{"text":"INTRODUCTION TO COMPUTING\nINTRODUCTION\nThe world of business has changed dramatically since the introduction of the first\nmodern multipurpose computer over 50 years ago. The ENIAC (Electronic Numerical\nIntegrator and Computer), designed by Drs. Mauchly and Eckert, two American engineers, was\nset up at the University of Pennsylvania in 1946. This 30-ton machine occupied a thirty-by-thirty\nroom, contained 18,000 vacuum tubes linked by 500 miles of wiring, and could perform 100,000\noperations per second. It consumed so much electricity that it dimmed the lights in the section\nof Philadelphia where it was housed. Thanks to the development of the integrated chip, the\ncomputer has evolved into a far smaller, more powerful, and less expensive machine. Today’s\nmicrocomputer is 3,000 times lighter than the ENIAC, performs 4000 times faster, and costs\nseveral million dollars less. Other innovations have made the computer easy enough for a child\nto use and versatile enough for applications ranging from astrophysics to arcade-style games.\nAs a consequence of their decreasing size and cost, computers can be found today in virtually\nevery corner of American society, from research facilities and corporate headquarters, to\nschools and homes.\nYou need only look around a business office to see evidence of the computer revolution.\nIn a large office you might find a variety of computers, ranging in size from a mainframe\ncomputer housed in a room of its own, to a palm-sized “personal assistant” tucked into an\nexecutive’s briefcase. A growing number of professions rely on computers, and accounting is\none of them. This introduction will provide you with the fundamentals of computer hardware\nand software to help you prepare for the material presented in the text.\nWHAT IS A COMPUTER?\nWhen we think of a computer, we generally picture computer hardware: the monitor, the\nkeyboard, and the electronic circuitry contained within the rectangular case. There is more to a\ncomputer than this, however. The missing element is software–the instructions that tell the\ncomputer how to operate the hardware. All computers must have these two components to\nfunction. However, it is software that gives the computer one of its most distinguishing\ncharacteristics—the ability to program a single machine to perform many different functions.\nIn general terms, a computer is a machine operating under the control of instructions\nstored in its own memory. These operations and instructions enable the computer to receive\ndata from a user (input), transform and manipulate the data according to specified rules\n(process), produce results (output). Additionally, data, instructions, and information are stored\n(storage) for future retrieval and use. Many computers are also capable of another task:\ncommunicating directly with other machines. A computer is a programmable device that stores, retrieves, and processes data. The term\n\"computer\" was originally given to humans (human computers) who performed numerical\ncalculations using mechanical calculators, such as the abacus and slide rule. The term was later\ngiven to a mechanical device as they began replacing the human computers. Today's computers\nare electronic devices that accept data (input), process that data, produce output, and store\n(storage) the results.\nBelow is a picture of a computer with each of the main components. In the picture below,\nyou can see the desktop computer, flat-panel display, speakers, keyboard, and mouse. We've\nalso labeled each of the input devices and output devices. WHAT PARTS ARE NEEDED FOR A COMPUTER TO WORK?\nA computer does not require all the components mentioned above. However, a computer\ncannot function without having at the very minimum the parts listed below.\nProcessor - Component that executes instructions from the software and hardware.\nMemory - Temporary primary storage for data traveling between the storage and CPU.\nMotherboard (with onboard video) - Component that connects all components.\nStorage device (e.g., hard drive) - Slower secondary storage that permanently stores data.\nHowever, if you had a computer with only the minimum parts above, you would be\nunable to communicate with it until you connected at least one input device (e.g., keyboard).\nAlso, for you to see what is happening, you would need at least one output device (e.g.,\nmonitor).\nTYPES OF COMPUTERS\nWhen talking about a computer or a \"PC,\" you are usually referring to a desktop\ncomputer found in a home or office. Today, however, the lines of what makes a computer are\nblurring. Below are all the different examples of what is considered a computer today.\nHARDWARE\nPhysical structure that houses a computer's processor, memory, storage, communication\nports and peripheral devices. Each of these components (called devices) have a different purpose, which may be either accepting inputs, storing data or sending outputs.\nFor example, a mouse and a microphone are input devices used to record user activities\nand transform them into data that is transmitted to the system unit. A hard disk is a storage unit\nwhere data is stored and accessed by other devices.\nA monitor or a speaker are output devices that transform processed data into\n(respectively) video and audio signals.\nUsually, the core components that represent the bare minimum that allow a computer to\nfunction are:\nProcessor (CPU)\nThe component that processes and executes inputs received from hardware and\nsoftware.\nMotherboard\nA mainboard that provides basic connection between all the other hardware components\nand devices (internal and external).\nMemory (RAM)\nA temporary data storage space that stores the information the CPU is actively using.\nStorage device\nA storage device where data is stored on a permanent basis. It’s slower but less volatile\nthan the RAM.\nPower supply unit\nThat’s pretty self-explanatory: without power, no electronic device can work!\nSOFTWARE\nAll parts of a computer that are not strictly physical, such as data, programs, applications,\nprotocols, etc., are broadly defined as “software.” Although software has no material form, it is\nno less critical to receive information, encode, store and process it.\nComputer software includes all executable and non-executable data, such as documents, digital\nmedia, libraries, and online information. A computer’s operating system (OS) and all its\napplications are software as well.\nA computer works with software programs that are sent to its underlying hardware\narchitecture for reading, interpretation and execution. Computers are classified according to computing power, capacity, size, mobility and other\nfactors, as personal computers (PC), desktop computers, laptop computers, minicomputers,\nhandheld computers and devices, mainframes or supercomputers.\nDEFINITION - WHAT DOES OPERATING SYSTEM (OS) MEAN?\nAn operating system (OS), in its most general sense, is software that allows a user to run other\napplications on a computing device.\nThe operating system manages a computer's software hardware resources, including:\nInput devices such as a keyboard and mouse.\nOutput devices such as display monitors, printers and scanners.\nNetwork devices such as modems, routers and network connections.\nStorage devices such as internal and external drives.\nThe OS also provides services to facilitate the efficient execution and management of, and\nmemory allocations for, any additional installed software application programs.\nIf several programs are running at the same time (such as an Internet browser, firewall, and\nantivirus), the OS will allocate the computer’s resources (memory, CPU, and storage) to make\nsure that each one of them receives what is needed to function.\nWhile it is possible for a software application to interface directly with hardware, the vast\nmajority of applications are written for an OS, which allows them to take advantage of common\nlibraries and not worry about specific hardware details.\nIn this regard, the OS acts as a comprehensive framework with which all applications can\ninteract in a consistent way, vastly simplifying the whole development process.\nExamples for OSs include:\nAndroid\niOS\nMac OS X\nMicrosoft Windows And Linux\nSome operating systems were developed in the 1950s, when computers could only execute one\nprogram at a time. Later in the decade, computers included many software programs,\nsometimes called libraries, which were linked together to create the beginning of today's\noperating systems.\nThe OS consists of many components and features. Which features are defined as part of the OS\nvary with each OS.\nTHREE EASILY DEFINED OPERATING SYSTEM COMPONENTS\nKernel\nThis provides basic-level control over all of the computer hardware devices.\nMain roles include reading data from memory and writing data to memory, processing\nexecution orders, determining how data is received and sent by devices, such as the monitor,\nkeyboard and mouse; and determining how to interpret data received from networks.\nMonolithic kernels have a simpler design and consist of a single code that communicates with\nall hardware and software.\nMicrokernels implement user and kernel services in different address spaces, reducing their\nsize, but forcing the use of message passing to execute services.\nUser Interface (UI)\nThis component allows interaction with the user, which may occur through graphical icons and\na desktop or through a command line.\nThe UI is further divided into Command Line Interface (CLI), consisting of a text-based\ninterface where advanced users can prompt specific commands by typing them, and a\nGraphical User Interface (GUI).\nThe latter is a visual interface that allows the end user to issue commands by interacting with\nsymbols, icons, and menus using an input device such as a mouse or touchpad.\nApplication Programming Interfaces (API)\nThis component allows application developers to write modular code.\nAn API defines how other systems or components can use a certain application. THE USE OF COMPUTING IN OUR DAILY LIFE\nBanks and financial\nComputers play a significant role in handling all of the world's money. Below are examples of\nhow computers are used in the financial market and places dealing with money.\nATM - When you make a withdraw from an ATM, you are using a computer.\nDigital currency - When depositing money in a bank, it is stored as a digital record. A\ncomputer keeps track of how much money is in your account.\nTrading - Stocks and commodities are traded using computers. In fact, today there are even\nthousands of computers using advanced algorithms that handle trading without needing\nhumans.\nBusiness\nBusiness is another big sector for computers and most money earned and spent is done using a\ncomputer. Below are some of the examples of how computers are used in business.\nRegister - If the business deals with selling goods to a consumer (e.g., a grocery store), a cash\nregister, which is a computer, is used to complete transactions.\nWorkers computer - Many businesses assign each employee a computer that allows them to\nproduce work and solve problems for the company.\nServer - If the business uses computers, connects to the Internet, or handles e-mail and files, a\nserver is used to help manage everything.\nCommunication\nToday's communication around the world is almost all digital and handled by computers.\nBelow are examples of how computers are used in the communication industry.\nSmartphone - If you have a smartphone, you have a computer in your pocket.\nE-mail - More electronic mail (e-mail) is sent today than postal mail (snail mail), and computers\nhandle all creation and distribution of that e-mail.\nVoIP - All voice over IP communication (VoIP) is handled and done by computers.\nComputer-assisted speech - Those who are disabled or cannot speak can use a computer to help\nthem communicate. For example, Stephen Hawking uses a computer to communicated.\nVoice recognition - Voice recognition uses a computer to translate recorded audio into text or\nother data. Defense and military\nMany technologies (e.g., GPS and the Internet) were initially created or started with a defense-\nrelated purpose. Today, computers are still an important aspect of the defense industry.\nEncryption - Secure communication is vital in the defense industry and computers encrypt\ncommunications that should remain secret.\nGPS - Using computers with GPS allows the military to track people and equipment and is still\nused today.\nComputer-aided flight - Many of today's jets and other aircraft require computers to fly and\noperate.\nDrones - A drone is either autonomous or remotely driven and uses computers to operate.\nEducation\nAs computers evolve, so does how computers are used in the education field. Below is a list of\nhow a computer can be used in education.\nInternet - Connecting a student to the Internet gives him or her access to an endless supply of\nknowledge. As mentioned later, the Internet would not be possible without computers.\nLearning - Computers can also be used to help design and create a more visual learning\nexperience for students. Using electronic whiteboards with computers can also benefit a student\nby giving them a more hands-on experience.\nWriting - Although reports can still be done using pen, pencil, or even a typewriter, a computer\nmakes it easier to write, format, save, share, and print reports.\nKeep records - Computers track students scores, identify struggling students, and create a final\nreport.\nTesting - Computers can assist students and teachers with the testing process by stepping the\nstudent through a series of questions and keep track of the results.\nInternet\nWithout computers, the Internet would not exist. Below are a few examples of how computers\nhelp run the Internet.\nDNS - When you type in a URL like https:\/\/www.computerhope.com\/, a DNS translates it into\nan IP address, which directs the computer to the server.\nWeb server - Every web page requires a web server or computer capable of receiving and\nsending requests when someone wants to view a web page.\nPrograms - A computer is also needed to run scripts and programs. For example, a search\nengine, shopping cart, or forum are all examples of programs that need a computer. Services - Other services like e-mail, FTP, and SSH also require a computer or are daemons on\nthe web server.\nMedical\nThe medical field is another place where computers are vital and used every day. Below are\nexamples of how computers help those in the medical field.\nMedical records - More and more medical records are being digitally stored. Storing these files\ndigitally allow for quick access and transfer of medical information so doctors can know your\nhistory.\nMonitoring - Computers help with monitoring a patient and can alert staff in the case of an\nemergency.\nResearch - A lot of the medical research is computer assisted. Without the assistance of a\ncomputer, it would either not be possible or take too long to be viable.\nDiagnosis - Computers can assist in the diagnosis of a patient, from gathering a patient's\nhistory and conditions to comparing that information against a database of existing\ninformation.\nSurgery - Although most surgery is still done with humans, it is becoming more practical and\naccessible for computer robot-assisted surgery. After being programmed, these robots can make\nsurgery more accurate, faster, and less prone to human errors.\nTransportation\nComputers also play an important part in transportation. Below are a few examples of how\ncomputers help the transportation field.\nCars - Most may not realize it, but all modern cars today have multiple computers that help\ncontrol and manage the vehicle.\nTraffic lights - The traffic lights that help control traffic are all run by computers.\nGPS - Cars that include a GPS mapping system have computers for display and calculating\nroutes.\nAirplanes - The airplanes that help transport millions of people and goods every year are filled\nwith computers that help control the plane.\nPublic transportation - Train, bus, subway, and all forms of public transportation are highly\ndependent on computers to manage traffic flow, monitor operation, and handle payments.\nSelf-driving cars - Although relatively new, self-driving cars are becoming increasingly popular\nand rely on a computer to make all decisions on how to drive. Multimedia\nComputers also play a significant role in video and audio. Below are examples of how\ncomputers are used in the film and audio industry.\nEditing - Once a movie, video, song, or audio track is created a computer can edit that media\ninstead of having to manually make cuts to the film or audio track.\nCGI - Computer animation and CGI has become a norm in big budget films. To create these\neffects computers and sometimes server farms are used.\nManipulation - Computers can manipulate pictures, video, and audio. For example, someone\ncould use Adobe Photoshop to add or remove elements from an image.\nRecording and playback - Computers can also be used to assist in the recording of audio tracks\nand then selectively playback each audio track.\nCreation - Computers can also be used to help in creating new multimedia content. For\nexample, creating 3D animation, 3D model, or a techno audio track can be done on a computer.\nAfter creating a 3D model, a 3D printer could also be used to build a product.\nTV, DVD, media players - Today's Smart TVs, DVD players, DVRs, etc., contain simple\ncomputing circuitry to connect the device to the Internet, run apps, and more.\nRobot\nThe industry of robotics is exploding and computers once again play an important role in\ncontrolling robots. Below are examples of how computers help control robotic machinery.\nControl - Computers are what help control robotics. For example, without a computer, a robotic\narm would not know where to place a part.\nLearning - Computers can take the input given by a robot and take that information to help\nlearn and adapt to new conditions.\nSimulations\nSome problems are so complex that it would be impossible for humans to calculate or would\ntake too long to calculate. Computers help solve these complex problems in a timely fashion.\nWeather prediction - Earth has an extremely complex weather system, and computers gather\nall of the variables and create weather reports.\nProduct simulations - Before some products go into development, computers simulate how\nthey would work in the real world. By creating a simulation, a company or government agency\ncan make adjustments before the product goes into development.\nBig data simulation - With cheap data storage companies can now store a massive amount of\ndata. With this big data, a computer can find unknown patterns. "}