{"text":"AN INTRODUCTION TO\nARTIFICIAL INTELLIGENCE\n1\nCOMPILED BY HOWIE BAUM • Artificial intelligence (AI), sometimes called machine intelligence,\nis intelligence demonstrated by machines, in contrast to the natural\nintelligence displayed by humans and other animals, such as \"learning\"\nand \"problem solving. .\n In computer science AI research is defined as the study of\n\"intelligent agents\": any device that perceives its environment and\ntakes actions that maximize its chance of successfully achieving its\ngoals.\n2 HOW ARE HUMANS INTELLIGENT ?\nLearning\n•\nReasoning\n•\nProblem Solving and Creativity\n•\nSocial Behavior\n•\nExperiencing our Environment with our senses:\n•\nHearing\n•\nSight\n•\nTouch\n•\nTaste\n•\nSmelling\n• 3 4 Ways that People Think and Learn\nAbout Things\n• If you have a problem, think of a past situation\nwhere you solved a similar problem.\n• If you take an action, anticipate what might happen\nnext.\n• If you fail at something, imagine how you might\nhave done things differently.\n• If you observe an event, try to infer what prior event\nmight have caused it.\n• If you see an object, wonder if anyone owns it.\n• If someone does something, ask yourself what the\nperson's purpose was in doing that.\n5 Artificial intelligence (AI) - The study of computer systems that\nattempt to model and apply the intelligence of the human mind.\nFor example, writing a program to pick out objects in a picture:\nThis is what\nComputers do best\nThis is what\nHumans do Can you count the\nbest distribution of\nletters in a book?\nCan you list Add a thousand\nthe items in\n4-digit numbers?\nthis picture ?\nMatch finger\nA computer\nprints?\nmight have\ntrouble\nSearch a list of a\nidentifying the\ncat there. million values\nfor duplicates?\n6 When we compare Humans to Machines, it is important to note that a\nMachine can be a car, a Smart Phone, a Digital Television, etc.\n7 8 The illustration below illustrates a typical information flow between the\n\"human\" and \"machine\" components of a system. For a properly designed\nsystem, its important to know the capabilities and flexibilities of both.\nhttps:\/\/www.hf.faa.gov\/webtraining\/HFModel\/HFInterModel\/overview.htm 9 10 KEY RESEARCH AREAS IN AI\n• Problem solving, planning, and search --- generic problem solving\narchitecture based on ideas from cognitive science (game playing,\nrobotics).\n• Knowledge Representation – to store and manipulate information\n(logical and probabilistic representations)\n• Automated reasoning \/ Inference – to use the stored information to\nanswer questions and draw new conclusions\n• Machine Learning – intelligence from data; to adapt to new\ncircumstances and to detect and extrapolate patterns\n• Natural Language Processing – to communicate with the machine\n• Computer Vision --- processing visual information\n• Robotics --- Autonomy, manipulation, full integration of AI\n11\ncapabilities From SIRI and Alexa, to self-driving cars, artificial\nintelligence (AI) is progressing rapidly.\nWhile science fiction often portrays AI as robots with human-like\ncharacteristics, AI can encompass anything from Google’s search\nalgorithms, to IBM’s Watson, to autonomous weapons.\nArtificial intelligence today is properly known as narrow AI\n(or weak AI), in that it is designed to perform a narrow\ntask such as only facial recognition, or only internet\nsearches, or only driving a car).\nHowever, the long-term goal of many researchers is to\ncreate general AI (AGI or strong AI).\nWhile narrow AI may outperform humans at whatever its\nspecific task is, like playing chess or solving equations, AGI\nwould outperform humans at nearly every thinking task.\n12 13 The potential benefits from self-learning computer chips are\nlimitless as these types of devices can learn to perform the most\ncomplex thinking tasks, such as interpreting critical cardiac\nrhythms, detecting anomalies to prevent cyber-hacking and\ncomposing music.\nThis is a new one made by the Intel company and many other\ncompanies are making special AI chips too.\n14 AUTOMATONS – ARE THESE DEVICES\nINTELLIGENT ?\nhttps:\/\/www.youtube.com\/watch?v=C7oSFNKIlaM (2.22 min)\n15 Artificial Intelligence (AI) has entered our daily lives like never before\nand we are yet to unravel the many other ways in which it could flourish.\nAll of the tech giants such as Microsoft, Uber, Google, Facebook, Apple,\nAmazon, Oracle, Intel, IBM or Twitter are competing in the race to lead\nthe market and acquire the most innovative and promising AI\nbusinesses.\n16 17 18 19 Google announced their Duplex system, a new technology for\nconducting natural conversations to carry out “real world” tasks over\nthe phone.\nThe technology is directed towards completing specific tasks, such\nas scheduling certain types of appointments.\nFor such tasks, the system makes the conversational experience as\nnatural as possible, allowing people to speak normally, like they\nwould to another person, without having to adapt to a machine.\nhttps:\/\/www.youtube.com\/watch?v=GoXp1leA5Qc\n20 21 https:\/\/www.youtube.com\/watch?v=gsUV0mGEGaY\n22 23 24 The answer is all of the above.\nEach of these highly realistic images were created by generative\nadversarial networks, or GANs.\nGAN, a concept introduced by Google researcher Ian Goodfellow in\n2014, taps into the idea of “AI versus AI.”\nThere are two neural networks: the generator, which comes up\nwith a fake image (say a dog for instance), and a discriminator,\nwhich compares the result to real-world images and gives feedback\nto the generator on how close it is to replicating a realistic image.\n25 26 27 28 The Turing Test\nTuring test\nA test to determine whether a computer has achieved intelligence\nAlan Turing\nAn English mathematician who wrote a landmark paper in 1950 that\nasked the question: Can machines think?\nHe proposed a test to answer the question \"How will we know when\nwe have succeeded?“\nHe said that a machine passes the test when it successfully generates\nresponses appropriate enough to convince the evaluator that it is\nhuman.\n29 In the Turing test, the interrogator must determine which\nrespondent is the computer and which is the human.\n30 THE LOEBNER PRIZE FOR COMPLETING THE TURING TEST\nThe Loebner Prize is an annual competition in artificial\nintelligence that awards prizes to the computer\nprograms considered by the judges to be the most human-\nlike, using the Turing Test computer and person arrangement.\nThe contest was launched in 1990 by Hugh Loebner and there\nare bronze, silver, and gold coin prizes, plus money.\n•So far, there have only been winners of the bronze medal and a\n$4,000 award.\n31 Silver – a one-time-only prize plus $25,000 offered for the first program\nthat judges cannot distinguish from a real human.\nGold plus $100,000 for the first program that judges cannot distinguish from\na real human in a Turing test that includes deciphering and understanding\ntext, visual, and auditory input.\nOnce this is achieved, the annual competition will end.\n.\n32 KNOWLEDGE REPRESENTATION\n• We need to create a logical view of the data, based on how we want\nto process it\n• Natural language is very descriptive, but does not lend itself to\nefficient processing.\n____________________________________________________\nWhat are the different ways that we can represent knowledge so it\ncan be reviewed by an Artificial Intelligence computer program ?\n1) Expert Learning Systems\n2) Semantic Networks - A knowledge representation technique that\nfocuses on the relationships and word descriptions of objects. A graph\nis used to represent a semantic network or net\n3) Decision or Search tree\n4) Neural networks – creating a computer version of the neurons of the\nbrain and how they work\n33 1) Expert Learning Systems\n• Expert Learning Systems were commercially the first and most\nsuccessful domain in Artificial Intelligence.\n• Somewhat out of favor today\n• These programs mimic the experts in whatever field is being\nstudied.\nAuto mechanic Telephone networking\nCardiologist Delivery routing\nOrganic compounds Professional auditor\nMineral prospecting Manufacturing\nInfectious diseases Pulmonary function\nDiagnostic internal medicine Weather forecasting\ncomputer configuration Battlefield tactician\nEngineering structural analysis Space-station life support\nAudiologist Civil law\n12-34 • Rule-based or Expert systems - Knowledge bases\nconsisting of hundreds or thousands of rules of the\nform:\n• IF (condition) THEN (action).\n• Use rules to store knowledge (“rule-based”).\n• The rules are usually gathered from experts in the field being\nrepresented (“expert system”).\n• Most widely used knowledge model in the commercial world.\nIF (it is raining AND you must go outside)\nTHEN (put on your raincoat)\n• Rules can fire off a chain of other rules\nIF (raincoat is on)\nTHEN (you will not get wet) Expert Systems\nGardener Expert System Example\n36 Expert Systems\nNamed abbreviations that represent conclusions:\n• NONE—apply no treatment at this time\n• TURF—apply a turf-building treatment\n• WEED—apply a weed-killing treatment\n• BUG—apply a bug-killing treatment\n• FEED—apply a basic fertilizer treatment\n• WEED & FEED—apply a weed-killing and fertilizer combination\n37\ntreatment Expert Systems\nVariables that are needed to represent the\nstate of the lawn\n• BARE—the lawn has large, bare areas\n• SPARSE—the lawn is generally thin\n• WEEDS—the lawn contains many weeds\n• BUGS—the lawn shows evidence of bugs\n38 Expert Systems\nData that is available:\n• LAST—the date of the last lawn treatment\n• CURRENT—current date\n• SEASON—the current season\nNow we can formulate some rules for our\ngardening expert system\nRules take the form of if-then statements\n39 Expert Systems\nSome rules\n• if (THE CURRENT DAY – LAST DAY IS LESS THAN 30) then\nNONE\n• if (SEASON = winter) then not BUGS\n• if (BARE) then TURF\n• if (SPARSE and not WEEDS) then FEED\n• if (BUGS and not SPARSE) then BUG\n• if (WEEDS and not SPARSE) then WEED\n• if (WEEDS and SPARSE) then WEED & FEED\n40 Expert Systems\nAn execution of our inference engine\n• System: Does the lawn have large, bare areas?\n• User: No\n• System: Does the lawn show evidence of bugs?\n• User: No\n• System: Is the lawn generally thin?\n• User: Yes\n• System: Does the lawn contain significant weeds?\n• User: Yes\n• System: You should apply a weed-killing and fertilizer\ncombination treatment.\n41 2) Semantic (word description) Networks\nSemantic network\nA knowledge representation technique that focuses on the\nrelationships between objects\nA directed graph or word chart is used to represent a semantic\nnetwork or net\n42 3) Search Trees\nAI often revolves around the use of algorithms.\nAn algorithm is a set of instructions that a mechanical computer can\nexecute.\nA complex algorithm is often built on top of another, simpler, one\nand a common way to visualize it is with a tree design.\n43 A simple example of an algorithm is\nthe following recommendations for\noptimal play at tic-tac-toe:\n If someone has a \"threat\" (that is,\ntwo in a row), take the remaining\nsquare. Otherwise,\n If a move \"forks\" to create two\nthreats at once, play that move.\nOtherwise,\n Take the center square if it is free.\nOtherwise,\n If your opponent has played in a\ncorner, take the opposite corner.\nOtherwise,\n Take an empty corner if one exists.\nOtherwise,\n Take any empty square.\n44 An example is a Search tree for playing the game Tic-Tac-Toe, as shown\nbelow.\nThis image depicts many of the possible paths that the game can take from\nthe having the first 2 rows filled,\nas shown:\n45 THE HUMAN BRAIN AND NEURONS IN IT\nA REVIEW BEFORE THE DISCUSSION ABOUT\n4) NEURAL NETS\n46 THE BRAIN IS DIVIDED INTO 4\nLOBES AND THE CEREBELLUM\nWHICH IS LOCATED AT THE\nBOTTOM, BACK AREA\n47 AI technology called machine learning today, is great at helping for\ntaking good photos, translating languages, recognizing your friends\non Facebook, delivering search results, screening out spam and many\nother chores.\nIt usually uses an approach called neural networks that works\nsomething like a human brain, not a sequence of IF THIS, THEN steps\nas in traditional computing.\n48 TYPES AND FUNCTION OF NEURONS\nNeurons are essential for every action that our body and brain carry out.\nIt is the complexity of neuronal networks that gives us our personalities and\nour consciousness.\nThey make up around 10 percent of the brain; the rest consists of glial cells\nand other cells that support and nourish the neurons.\n49 There are around 86 billion neurons in the brain. To reach this huge\ntarget, a developing fetus must create around 250,000 neurons per\nminute !\nEach neuron is connected to at least 10,000 others – giving well over\n1,000 trillion connections (1 quadrillion connections).\nThey all connect at a junction called a synapse, which can be electrical or a\nhigher percentage of them are chemical.\n50 Incoming signals to the neuron can be either excitatory – which means they\ntend to make the neuron fire (generate an electrical impulse) – or inhibitory –\nwhich means that they tend to keep the neuron from firing.\nA single neuron may have more than one set of dendrites, and may receive many\nthousands of input signals.\nWhether or not a neuron is excited into firing an impulse depends on the sum of\nall of the excitatory and inhibitory signals it receives.\nIf the neuron does end up firing, the nerve impulse is conducted down the axon.\n51 How synapses work - Neurons are connected to each other at a location\ncalled a Synapse, so that they can communicate messages\nAmazingly, where each cell connects with the other one, NONE of\nthese cells ever touch each other !!\nThe signal that is carried from the first nerve fiber to the next one is\ntransmitted by an electrical signal or a chemical one, up to a speed\nof 268 miles per hour !\nThere is new evidence that both types closely interact with each other and\nthat the transmission of a nerve signal is both chemical and electrical,\nwhich is actually required for normal brain development and function.\nhttps:\/\/www.youtu\nbe.com\/watch?v=m\nItV4rC57kM&t=10s\n52 If you don’t use a foreign language you learned years ago or\nmathematics, the neurons used for those things will move the\nsynapses away from each other so they can do other things that\nyou are learning to do. This is called Synaptic Pruning.\n53 4) Artificial Neural Network (ANN)\nA computer representation of knowledge that attempts to\nmimic the neural networks of the human brain\nYes, but what is a human neural network?\nNeural networks, or neural nets, were inspired by the\narchitecture of neurons in the human brain.\nA simple \"neuron\" N accepts input from multiple other\nneurons, each of which, when activated (or \"fired\"), cast a\nweighted \"vote\" for or against whether neuron N should itself\nactivate.\n54 An ANN is based on a collection of connected units or nodes called artificial\nneurons, which loosely model the neurons in a biological brain.\nEach connection, like the synapses in a biological brain, can transmit a\nsignal from one artificial neuron to another. An artificial neuron that receives\na signal can process it and then signal additional artificial neurons\nconnected to it.\n55 ARTIFICIAL NEURAL NETWORK\n• Artificial neurons: Commonly called processing elements,\nare modeled after real neurons of humans and other animals.\n• Has many inputs and one output.\n• The inputs are signals that are strengthened or weakened\n(weighted).\n• If the sum of all the signals is strong enough, the neuron\nwill put out a signal to the next neuron output of a 1.\nArtificial\nInputs Output\nNeuron\n12-56 Artificial Neural Networks\nTraining\nThe process of adjusting the weights and threshold values in a\nneural net\nHow does this all work?\nTrain a neural net to recognize An eagle in a picture.\nGiven one output value per pixel, train network to produce an\noutput value of 1 for every pixel that contributes to the eagle and 0\nfor every one that doesn’t.\n57 DeepMind is a subsidiary of Google that focuses on the\ndevelopment of artificial intelligence and deep reinforcement\nmachine learning.\nThe deep reinforcement learning of its AI algorithms has been\nused in both research and applied contexts\nDeepMind is built around the framework of neural networks and\nuses a method called deep-reinforced-learning.\nThis means that the A.I can learn from it's experiences and\nbecome more efficient at whatever it does.\nThe A.I is general-purpose meaning that it's NOT pre-programmed\nfor a specific task from the go.\nhttps:\/\/www.youtube.com\/watch?v=gn4nRCC9TwQ\n58 Agents\n• An agent is anything that can be viewed as a device that\ncan perceive its environment through sensors and act upon\nthat environment through actuators.\n• Human agent: eyes, ears, and other organs for sensors; hands,\nlegs, mouth, and other body parts for actuators\n• Robotic agent: cameras and infrared range finders for sensors\n• Various motors for actuators\n• Rational Agent:\n• For each possible sequence, a rational agent should select an\naction that is expected to maximize its performance measure,\ngiven the evidence provided by the perception sequence and\nwhatever built-in knowledge the agent has.\n59 Why “meaning” is the central concept of AI\n• For an agent to be “intelligent”, it must be able to understand the\nmeaning of information.\n• Information is acquired \/ delivered \/ conveyed in messages which\nare phrased in a selected representation language.\n• There are two sides in information exchange: the source (text,\nimage, person, program, etc.) and the receiver (person or an AI\nagent). They must speak the same “language” for the information\nto be exchanged in a meaningful way.\n• The receiver must have the ability to interpret the information\ncorrectly according to the intended by the source meaning or semantics of\nit.\nMEANING = SEMANTICS\n60 61 Machine Learning\nThe phrase ‘machine learning’ dates back to the middle of the last\ncentury where Arthur Samuel in 1959 defined machine learning as\n“the ability to learn without being explicitly programmed.”\nMachine learning is a type of AI that helps a computer’s ability to\nlearn and essentially teach itself to evolve as it becomes exposed\nto new and ever-changing data.\nFor example, Facebook’s news feed uses machine learning in an\neffort to personalize each individual’s feed based on what they like.\n62 DRONE CHASSIS DESIGN USING\nMACHINE LEARNING\nhttps:\/\/www.youtube.com\/watch?v=odHC-gxJhG4\n63 Deep Learning\nDeep Learning is a new area of machine learning research, which\nhas been introduced with the objective of moving machine\nlearning closer to artificial intelligence.\nIt relates to study of ‘deep neural networks’ in the human brain\nand, under this perspective, the deep learning tries to emulate\nthe functions of inner layers of the human brain, creating\nknowledge from multiple layers of information processing.\nSince the deep learning technology is modelled after the human\nbrain, each time new data is poured in, its capabilities get better.\nDeep artificial neural networks are a set of algorithms\nreaching new levels of accuracy for many important\nproblems, such as image recognition, sound recognition,\nrecommender systems, etc.\n64 "}