{"text":"INTRODUCTION TO\nDATABASES DATABASE\n• A database is a collection of data stored electronically, usually organized and\nstructured in some form.\n• Databases can be very simple – a text file or a CSV file, for example.\n• When they are complex, we use formal methods of design and engineering\nprinciples, to build, update and maintain these systems.\n• A DataBase Management System (DBMS) is the software used to interact between the\ndatabase and an application that uses the database.\n• Data in databases is usually stired as tables. DIFFERENCES BETWEEN TABLES AND\nDATABASES\n• When we think of databases, we often think of tables of information.\n• However, we encounter several types of tables in software, and they focus on different aspects.\n• HTML tables\n• Focus on display – tables have no basis of “identity” for data\n• Spreadsheets\n• Focus on positional data – fields are arranged and calculated based on their position in the spreadsheet\n• Databases\n• Focus on the data itself – metadata is used to identify data fields.\n• Data stored in transience during program execution (classes, structs, etc) do not count,\nsince they do not offer permanence. DATA IN 3 LEVELS\n• Level 1 – The actual database\n• A file that stores all the information. The format depends on the type of the Database )text,\nrelational, graph, etc.)\n• Level 2 – The DataBase Management System (DBMS) – interaction between data and\nan application\n• A software package that helps to update, maintain and secure the data.\n• Level 3 – Application\n• Any software package that is built on top of the other 2 layers that provides interaction with\nthe user. A web app, a mobile app, BI\/ERP, etc. TYPES OF DATABASES\n• Flat Model\n• Navigational databases\n• ▫ Hierarchical (tree) database model\n• ▫ Network\/Graph model\n• Relational Model\n• Object model\n• Document model\n• Entity–attribute–value model\n• Star schema DISADVANTAGES OF FILE STORAGE\n• Redundancy – We might have multiple copies of the same data.\n• Inconsistency – Data on the same business entity may appear in different forms, for\nexample, state name, phone number, etc. This makes it hard to modify data and track\nchanges.\n• Mixture of data – No clear logical relationships between the data columns, making it\nhard to understand and manage complex structures.\n• Hard to maintain and manage\n• No concurrency support – limiting scalability HOW DO DATABASES HELP?\n• Self-describing data collection of related records (meta data, data about data)\n• Databases contains not just data, but also include the structure of data\n• At the application level, databases can also store other application related meta data.\n• This facilitates the personalization and customization of the application according to\na user’s profile.\n• Two of the most important roles in defining metadata\n• Identify the type of data with a unique tag\n• Define the affinity of the data (tags enclose all data that is logically related) CONTENTS OF A DATABASE\n• User Data: The actual data used by the application\n• Meta data: The structure (schema) of the data, including\ntable names, column names and types, and constraints over\n• User data\nthe column(s)\n• Medadata\n• Application metadata\n• Index and other\n• Application meta data: Meta data on user settings or overhead\nfunctions of the application\n• Index and other overhead data: used for performance\nimprovement and maintenance. Logs, tracks, security, etc. 3 ACRONYMS\n• ACID\n• 4 essential properties that a DBMS has to implement to effectively interact with a database\n• SQL – Structured Query Language\n• A query is a result of a request to the database for information or for modification.\n• SQL is the language most relational databases (the most common for of databases) use for\ninteraction with the data.\n• CRUD – Create, Read, Update, Delete\n• Self-explanatory\n• The 4 major operations performed on the database. ACID\n• Atomicity – transactions are either all or none (commit\/rollback)\n• Consistency – only valid data is saved\n• Isolation – transactions should not affect each other\n• Durability – written data will not be lost\n• Good example : Bank transactions\n• Most of the challenges related to ACID compliance come from multiple users\/concurrent\nuse of the database RELATIONAL DATABASES - RELATIONS\n• A relational database describes the relationships among different\nkinds of data\n• Captures ideas like those defined in the Affinity and Collection rules\n• Allows software to answer queries about them\n• Any relational DB can be described in XML\n• But it is not the case that every XML description defines a relational DB RELATIONS (TABLES)\n• Tables (formally called ‘relations’) – are the building blocks of relational databases.\n• Tables store data in 2D, where each row reflects one instance of a record, and each column\nreflects one aspect of the attributes for all instances.\n• Rows may also be called ‘tuples’.\n• Columns may also be called ‘fields’.\n• For example, a ‘student’ table may contain (student id, first name, last name, grade, school\nname, home address, …), and each row may represent one student’s information, and\neach column of the table represents one piece of information for all students. And this is\ncalled a ‘relation’. ENTITIES\n• Entities are theoretical constructs that help us in conceptualization of relations.\n• Anything that can de identified by a fixed number of its characteristics (attributes)\n• Attributes have names and values\n• Attributes have a data type\n• A relational database table can be empty (NULL instance)\n• The values are the data that's stored in the table\n• An entity could be defined by a relation (table) or be spread across several relations.\n• Instances are Unordered\n• Order of the rows and columns does not matter in databases\n• Freedom to move the data is limited to exchanging entire rows or exchanging entire\ncolumns PROPERTIES OF ENTITIES\n• Uniqueness\n• No two rows can be the same\n• Two rows can have the same value for some attributes, just not all attributes\n• Atomic Data\n• Values stored for attributes\n• Not decomposable into any smaller parts. Separate fields for street, city, state,\npostal code\n• \"Only atomic data\" rule relaxed for certain types of data. Dates, times, currency PROPERTIES OF ENTITIES\n• Keys\n• Any set of attributes for which all attribute values are different is called a\ncandidate key\n• Pick one and call it the primary key to decide uniqueness\n• Key must distinguish all potential and actual entities, not just those that happen to\nbe in the table at a given time\n• If no combination of attributes qualify as a candidate key, assign a unique ID to\neach entity KEYS - PRIMARY KEY AND FOREIGN KEY\n• Primary key: Unique Identifier made of one or more columns to\nuniquely identify rows in a table.\n• If the primary key contains more than one column, it can be called ‘composite\nkey’ as well.\n• Foreign Key: is the primary key of another table, which is referenced in\nthe current table.\n• It’s the key to establish the relationship between the two tables, and through\nDBMS, to impose referential integrity. KEYS SURROGATE KEY\n–\n• Surrogate key is a unique column\n• Added to a relation to use as the primary key when there is a lack of a natural\ncolumn that serves as the primary key, or when the composite key needs to be\nreplaced for various reasons.\n• Surrogate key is usually in the form of an auto increment numeric value, and of no\nmeaning to the user, and thus could often be hidden in the table, form. or other entity\nfor internal use.\n• Surrogate keys are often used in the place of composite keys to add more flexibility\nto the table. DATABASE SCHEMAS\n• Database schema – way to define a table\n• Collection of table definitions that gives the name of the table, lists the attributes and\ntheir data types, and identifies the primary key OPERATIONS ON TABLES\n• A database is a collection of database tables\n• Main use of database is to look up information\n• Users specify what they want to know and the database software finds it\n• We can perform operations on tables to produce new tables (that are not explicitly\npart of the schema)\n• The questions we ask of a database are answered with a whole table\n• Five fundamental operations that can be performed on tables: Select, Project, Union,\nDifference, Product SELECT OPERATION\n• Takes rows from one table to create a new table\n• Specify the table from which rows are to be taken, and the test for selection\n• For SQL Syntax, look at SQL Reference PROJECT OPERATION\n• Builds a new table from the columns of an existing table\n• Specify name of exiting table and the columns (field names) to be included in the\nnew table\n• The new table will have the number of columns given in the operation, and the same\nnumber of rows as the original table, unless\n• The new table eliminates a key field; if the new table has duplicate rows, the duplicates\nwill be eliminated\n• SQL does not implement projects. Instead it is handled as a variation of select, where\ncertain columns are selected. OTHER OPERATIONS\n• Union - Combines two tables (that have the same set of attributes)\n• Difference - Remove from one table the rows also listed in a second table (remove from\nTable1 any rows also in Table2)\n• Product – Gives the cartesian product of the two tables – one instance of a row in Table2\nadded to each instance of a row in Table1\n• The five basic operations (select, project,+, -, x ) are all we need to make any relational\ntable\n• Other operations we can imagine can be done with combinations of the basic 5\n• One combination is so commonly wanted and useful that we name it and provide it as a\ndirect operation: Join JOINS\n• Combines two tables (like the Product operation) but doesn't necessarily produce all pairings\n• If the two tables each have fields with a common data type, the new table combines only the\nrows from the given tables that match on the fields\n• When match is true for a row from each table it produces a result row that is their\nconcatenation\n• Lookup operation on tables\n• For each row in one table, locate a row (or rows) in the other table with the same value in the common\nfield; if found, combine the two; if not, look up the next row.\n• This match on equality is called a natural join\n• Possible to join using any relational operator, not just = (equality) to compare fields STRUCTURE OF A DATABASE\n• We want to arrange the information in a database in a way that users see a relevant-\nto-their-needs view of the data that they will use continually\n• Physical database (stored on disk)\n• Logical view of the database (made on the fly and customized for a user)\n• The point of the two-level system is to separate the management of the data\n(physical database) from the presentation of the data (logical view of the database)\n• All users work with the same physical database\n• Different users will work with different views, one for each NORMALIZATION\n• Database normalization, or simply normalization, is the process of restructuring a\nrelational database in accordance with a series of so- called normal forms in order to\nreduce data redundancy and improve data integrity.\n• It was first proposed by Edgar F. Codd as an integral part of his relational model.\n• Normalization entails organizing the columns (attributes)\n• and tables (relations) of a database to ensure that their dependencies are properly\nenforced by database integrity constraints. It is accomplished by applying some\nformal rules either by a process of synthesis (creating a new database design) or\ndecomposition (improving an existing database design). ADVANTAGES OF NORMALIZATION\n• No Redundancy\n• No Inconsistency – changes can only be made at one place and are consistent\n(because of the key constraints), in DB\n• Normalization is the process of decomposition, so all business concepts can be\nmodeled with clear logical relationships\n• The entire database system remains consistent over time as the database grows with\nleast redundancy and much durability.\n• Strong support to be ACID compliant "}