{"text":"Computer Basics :\nJust How Does a Computer Work? Introduction\nLook at this picture of a\ncomputer from our\nComputer Lab. A\ncomputer is made up of\nmany parts. Let’s explore\nthe parts to see if you\nknow what they are called! The Monitor\nThe monitor looks\nlike a TV and lets\nlets you see your\nwork and your\nfiles. The CPU\nCPU stands for “Central\nProcessing Unit”. They contain\nthe brains of the computer.\nThey can be desktop models\nthat the monitor sits on top of,\nor tower models that stand up\ntall. Floppy Disk Drive\nThe CPU has places to insert disks. One\nkind of disk drive is a floppy disk drive. A\nfloppy disk drive reads information from a\nvery thin, floppy disk inside a hard plastic\ncase. Floppy disks can hold up to 1.44\nmegabytes of information. CD-ROM Disk Drive\nCD-ROM stands for Compact\nDisk-Read Only Memory. They\nare flat, shiny disks that store\ninformation. Most new\ncomputers have CD-RW drives.\nCD-RW stands for Compact\nDisk-ReWrite. This type of disk\nallows you to write information\nto it, as well as read from it.\nMost can hold up to 700\nmegabytes of information. DVD Drive\/Burner\nThe newest computers come with the option of\na DVD drive. A DVD (Digital Video Disc) looks\njust like a CD, but holds much more\ninformation! They can store 4.7 gigabytes of\ndata! Flash Drive\nA Flash Drive is a\nrelatively new storage\ndevice. It’s like a mini,\nportable hard drive! You\nplug it into the USB\n(Universal Serial Bus)\nport on the front of\nnewer computers and\nyou can save to it! How Do Computers Work?\n Input--This is when information is entered into a\ncomputer. Some common input devices include\nthe keyboard, mouse and scanner.\n Output--This is the information that comes out of\na computer after it has been processed. The\ninformation comes out on output devices such as\na printer or computer monitor.\n Processing--This is when the information is\nhandled by the computer’s brain, known as the\nCPU (Central Processing Unit). Input Devices The Keyboard\nThe keyboard is probably\nthe most used input device.\nIt operates a lot like a\ntypewriter, but has many\nadditional keys that let it do\nspecial things a typewriter\ncan’t. Special Keyboard Keys\nThe flashing light on the computer\nscreen is called the cursor. This\ncursor can be moved up and\ndown or left and right by pressing\nthe 4 keys that have arrows on\nthem. These arrow keys are\ncalled cursor keys. Shift Key\nWhen this key is pressed at the same\ntime you press a letter key, a capital\nletter appears on your screen. When it\nis held down when you press a key with\na symbol and number, the top symbol\nappears on the computer screen. There\nare two shift keys on your keyboard. The Backspace Key\nWhen this key is pressed, the cursor\nmoves back one space to the left on\nyour computer screen. This key is\nvery helpful when you press the\nwrong letter or number. You can\nerase your mistakes! The Caps Lock Key\nWhen you press this key, a small light on the\nkeyboard comes on. Whenever this light is on,\nany letter key you press will result in a capital of\nthat letter appearing on the screen. Pressing the\nCAPS LOCK key a second time turns it off. The Space Bar\nThis is the long bar located at the\nbottom of the keyboard. Every time you\npress this bar, the cursor moves one\nspace to the right on the computer\nscreen. The Enter Key\nWhen you write a letter or a story pressing\nthe Enter Key makes the cursor jump down\nto the next line. This is a very helpful key to\nuse when you want to start a new\nparagraph or you’re typing your spelling\nlist. The Function Keys\nMost computer keyboards have between 10\nand 12 function keys. These keys are usually\nlocated at the top of the keyboard and give\nthe computer user fast ways to give the\ncomputer special instructions. For example,\npressing F1 when using a Windows program\nwill allow the user access to the Help screen. The Numeric Keypad Keys\nOn the right side of the keyboard there is a\nset of keys grouped together in a square.\nThese keys have two functions. When the\nnumber lock key is pressed, these keys offer a\nquick and easy way of entering numbers into\nthe computer. When the number lock key\nisn’t pressed, these keys control the\nmovement of the cursor. Text Editing Keys\nLocated next to the numeric keypad, there are\nsix text editing keys. These keys are designed\nto be used in Word Processing programs.\nThey allow you to move quickly around a\nscreen when you are writing a letter or story.\nThey are very useful when you want to fix a\nspelling mistake, add a sentence to your\nwork, or just move to another page. The Mouse\nIt’s another input device. It’s called a\nmouse because of it’s shape and the way the\ncable attaching it to the computer looks a\nbit like a tail. There are two kinds of mice.\nSome use a roller ball that allows the mouse\nto roll around a flat surface. When you do\nthat and look up at the screen, you’ll see a\nsmall moving arrow. This arrow is called the\npointer. Scanner\nA scanner is a very useful\ninput device. You can place\na page of writing or pictures\nin the scanner and it will\nsend the information to your\ncomputer. There they can\nbe changed, saved into a\ncomputer file, or printed. Output Devices\n Printers\n Soundboard\n Audio Speakers Printers\nOne output device is a printer. Once a\ncomputer user has created something on\nthe computer, such as a story, he can send\nit to the printer. The printer prints exactly\nwhat’s on the screen. Two Common Types of Printers\nAn inkjet printer usually prints in\ncolor. It prints by squirting out small\ndots of ink onto the paper.\nA laser printer uses a laser beam to\ncreate an image that is transferred to\npaper. It uses toner and a drum. The\nink is powder. Soundboards\nA soundboard is an electronic\ncircuit board, located inside the\ncomputer, that can produce\nmusic and high quality sounds.\nIf you play video games and\nmultimedia programs on your\ncomputer, you’ll need a\n!\nsoundboard Speakers\nSpeakers can be connected to your computer\nso you can hear very realistic sound effects\nand wonderful music. Some computer\nmonitors come with built in speakers. Computer Processing\nOnce information has been sent to a\ncomputer by one of the input devices\nit’s processed. The computer uses it’s\nbrain to process the information. The\ncomputer’s brain is called the CPU, or\nCentral Processing Unit. The CPU is also called\nthe microprocessor.\nThe word “micro”\nmeans small. Since\nthe CPU is located on\na small computer chip\nabout 1 inch square,\nthat makes sense! Random Access Memory\nWhen a computer\nprocesses information, it\nuses software programs.\nEach program requires a\ncertain amount of electronic\nmemory, or RAM (Random\nAccess Memory) to run\ncorrectly. RAM is temporary memory. The computer\nholds information in this memory and gets it\nwhen it needs it.\nIf a computer has more RAM, it can solve\nproblems and process information faster! If\nyou’re updating your computer, more RAM is\na great thing to add! Read-Only Memory\nA second kind of computer memory is\nROM, which stands for Read-Only\nMemory. This memory is permanent. The\ninformation there was put there when the\ncomputer was made. The computer needs\nthe information in it’s ROM memory in\norder to function. What are all those parts inside my\ncomputer and what do they do??? Computer Hardware\n Hard Drive\n Motherboard\n Sound Card and Video Card\n Memory Card\n Power Supply\n NIC Card\n BIOS Bytes, Kilobytes,\nMegabytes and Gigabytes\n Byte 8 Bits=1 byte\n KB Kilobyte=1,000 bytes\n MB Megabyte=1,000,000\n(1 million) bytes\n GB Gigabyte=1,000,000,000\n(1 billion) bytes Just the beginning…..\nWe just touched on the very basics with this\npresentation! There is so much more to\nunderstanding computers. There are books\nthat are thousands of pages long that\nexplain how they work in great detail. But\nnow maybe you understand them more than\nyou did before and you’ll want to keep\nlearning.\nKeep computing! References\n•Kids Domain Resources: Computer\nConnections, Computers Inside & Out\n•http:\/\/www.howstuffworks.com\n•“Computer Basics”, Teacher Created\nMaterials, pub.1996 Computer Operation Overview\nDay 4\n1 Microsoft Office\nMicrosoft Office is a proprietary commercial office suite\nof inter-related desktop applications, servers and\nservices for the Microsoft Windows operating systems,\nintroduced by Microsoft in 1989. Initially a marketing\nterm for a bundled set of applications, the first version\nof Office contained:\n Microsoft Word √\n Microsoft Excel\n Microsoft PowerPoint\n2 Microsoft Excel\nMicrosoft Excel is a commercial spreadsheet application\nwritten and distributed by Microsoft for Microsoft\nWindows and Mac OS X. It features calculation, graphing\ntools, pivot tables and a macro programming language\ncalled Visual Basic for Applications. With its powerful\nfunctions, Excel has been a very widely applied\nspreadsheet in many fields, this article\n3 4 Use of Microsoft Excel\n1. Manage data records like name list\nThe commonly usage of Excel is to manage data records and name lists. You don't have to plan in\nadvance on how the table should look like, as the preset layout alllows you to create the tables on the\nfly, just fill in the information, the table is developed on the go. Another more attractive point is that\nyou have the ability to sort the list and filter the listing like a database tool.\n2. Used as an analytical tool\nBesides the good use on managing data, Excel is a great analytical tool for business. With the pivot\ntable contained within Excel, you can easily analyse a large number of data, as the pivot table can\nautomatically sort, count, and total the data stored in one table or spreadsheet and create a second\ntable displaying the summarized data. It has gone through many revision. In each revision, we see its\npower being enhanced. In the latest version of Excel 2010, there are many new features added: It\nadded almost six new caculations, a 'Show Value As' function and some great visual tools.\n3. Create forms and consolidate results\nYou can use Excel to create not only a simple form that contains boxes, but also professional forms\nwhich include option buttons that allow you to select answers, dropdown list to select a particular\nanswer from list of items. Together with charts, you can use Excel to compile answers to tests or\nquizzes and analyze the profile of the class (If you are a teacher) or your team (If you are a supervisor).\n5 Use of Microsoft Excel\n4. Corporate Budgeting\nA major business application of Excel is in corporate budgeting. Many companies, from big\ncorporations to small companies use Excel for their budgeting. Despite numerous calls by\nsuppliers of Business Performance Management Systems (BPM) to move away from Excel as a\nbudgeting tool, 70% to 80% of all corporations still use Excel as their primary budgeting tool.\n5. Inventory Management\nExcel provide many functions and formulas that will not only help you manage your data records\nefficiently but will also allow you to analyse your data based on your constantly changing\nbusiness environment. Through the use of Microsoft® Excel formulas, you can create\ncomprehensive drop down boxes to facilitate data inputs and reduce erroneous entries. And\nthrough the use of pivot tables, you could get a good detailed analysis of your stock movement\nand also your inventory level at any point in time.\n\\6. Finding Profit Breakeven\nFinding breakeven is never easy without using Excel. To manually find out the breakeven for a\nproject, you have to perform many calculations using different numbers as it's inputs. And the\ncalculation becomes even more complex if the components include fixed cost and step up cost.\nBut with the goal seek function in Excel, this task can be completed in a few seconds.\n6 7 8 Calculation with Excel\n9 Computer Operation Overview\nDay 3\n1 Microsoft Office\nMicrosoft Office is a proprietary commercial office suite of\ninter-related desktop applications, servers and services for\nthe Microsoft Windows operating systems, introduced by\nMicrosoft in 1989. Initially a marketing term for a bundled\nset of applications, the first version of Office contained:\n Microsoft Word\n Microsoft Excel\n Microsoft PowerPoint\n2 Microsoft Office\nMicrosoft Word Processor is a Software package that enables you\nto create, edit, print and save documents for future retrieval and\nreference. Creating a document involves typing by using a keyboard\nand saving it. Editing a document involves correcting the spelling\nmistakes, if any, deleting or moving words sentences or paragraphs.\nAdvantages of Word Processing:\nOne of the main advantages of a word processor over a\nconventional typewriter is that a word processor enables you to\nmake changes to a document without retyping the entire document.\n3 4 Features of Word Processing\nMost Word Processor available today allows more than just creating and\nediting documents. They have wide range of other tools and functions,\nwhich are used in formatting the documents. The following are the main\nfeatures of a Word Processor:\n• Text is typing into the computer, which allows alterations to be made\neasily.\n• Words and sentences can be inserted, amended or deleted.\n• Paragraphs or text can be copied \/moved throughout the document.\n• Margins and page length can be adjusted as desired.\n• Spelling can be checked and modified through the spell check facility.\n• Multiple document\/files can be merged.\n• Multiple copies of letters can be generated with different addresses\nthrough the mail-merge facility.\n5 Computer Operation Overview\nDay 2\n1 Operating System\nAn operating system (OS) is software, consisting of programs\nand data, that runs on computers, manages computer\nhardware resources, and provides common services for\nexecution of various application software. The operating\nsystem is the most important type of system software in a\ncomputer system. Without an operating system, a user\ncannot run an application program on their computer, unless\nthe application program is self booting.\n2 Computer Application\nApplication software, also known as an application or an\n\"app\", is computer software designed to help the user to\nperform specific tasks. Examples include enterprise\nsoftware, accounting software, office suites, graphics\nsoftware and media players. Many application programs\ndeal principally with documents. Apps may be bundled\nwith the computer and its system software, or may be\npublished separately. Some users are satisfied with the\nbundled apps and need never install one.\n3 List of OS & Application\nOPERATING SYSTEM COMPUTER APPLICATON\n Windws XP  Microsoft Office (word, Excel,\n Windows 7 PowerPoint, Outlook)\n Windows Server 2008  Photoshop\n UNIX  Corel Draw\n LINUX  Tally (Accounting Software)\n Mac OS  Adobe Acrobat \/ Reader\n4\n4 44 Internet\/Intranet\nInternet Intranet\nAn intranet is a computer network\nAn international computer network\nthat uses Internet Protocol\nproviding e-mail and information from\ntechnology to securely share any part\ncomputers in educational institutions,\nof an organization's information or\ngovernment agencies, and industry,\nnetwork operating system within that\naccessible to the general public via\norganization. The term is used in\nmodem links\ncontrast to internet, a network\nbetween organizations, and instead\nrefers to a network within an\norganization\n5 How to Use Internet\nThe Internet can powerfully extend your ability to find,\nmanage, and share information. The following sections\nprovide references to client application software, and\ndescriptions of the main features and capabilities of each\nInternet application:\n Internet Explorer (IE)\n Mozilla Firefox\n Google Chrome\n Safari\n Netscape Navigator\n6 Address Bar\nMinimize\nClose\nNew Tab Button\nTab Browsing\nSearch Box\nZoom Tool\n7\n7 7 Internet Search Engine\nA web search engine is designed to search for information on\nthe World Wide Web and FTP servers. The search results are\ngenerally presented in a list of results and are often called\nhits. The information may consist of web pages, images,\ninformation and other types of files. Some search engines\nalso mine data available in databases or open directories.\nSome search engine are:\n Google (www.google.com)\n Yahoo (www.yahoo.com)\n Altavista (www.altavista.com)\n8 Internet E-mail\nElectronic mail, commonly called email or e-mail, is a method of\nexchanging digital messages from an author to one or more recipients.\nModern email operates across the Internet or other computer networks.\nSome early email systems required that the author and the recipient\nboth be online at the same time, in common with instant messaging\n(IM).\nAn email message consists of three components, the message\nenvelope, the message header, and the message body. The message\nheader contains control information, including, minimally, an\noriginator's email address and one or more recipient addresses. Usually\ndescriptive information is also added, such as a subject header field\nand a message submission date\/time stamp.\n9 How to Use E-mail\nTo send and receive e-mail you need to create a e-mail\naccount with the help of e-mail services provider like YAHOO,\nGMAIL, HOTMAIL etc.\nTo create an e-mail account we need to follow some setups:\n• Open a e-mail provider website\n• Signup for new mail account\n• Fill the form and choose your mail account name as per\nyour choice.\n• Finally sign in with you registered mail account.\n10 To compose\na new mail\nReceived mails\nSent mails\n11\n11 1111 Computer System Overview\n1 Computer Systems & Accessories\nDesktop Computer Components of Desktop\nComputer\n CPU (Central Processing unit)\n Monitor\n Keyborad\n Mouse\n Speaker\nA desktop computer is a personal\ncomputer (PC) in a form intended\nfor regular use at a single\nlocation, as opposed to a mobile\nlaptop or portable computer\n2 Computer Systems & Accessories\nLaptop Computer Components of Laptop\nComputer\n CPU (Central Processing unit)\n Monitor\n Keyborad\n Mouse\n Speaker\nAbove components are In-Built in\nA laptop, also called a notebook, is a\nLaptop Computer.\npersonal computer for mobile use. A\nlaptop integrates most of the typical\ncomponents of a desktop computer\n3 Computer Systems & Accessories\nLCD Projector Components of LCD\nComputer\n Multi color Lens\n Power Cable\n RGB Video Cable\n Remote\n Slide Presenter\nAn LCD projector is a type of video\nprojector for displaying video, images or\ncomputer data on a screen or other flat\nsurface\n4 Computer Systems & Accessories\nLaserJet Printer DeskJet Printer\/Dot Matrix\nPrinter\nAn Deskjet printer A DMP is a type of\nis a type of computer printer\ncomputer printer with a print head\nA printer linked to a computer\nthat creates a that runs back\nproducing printed material by using a\ndigital image by and forth, or in an\nlaser to form a pattern of\npropelling droplets up and down\nelectrostatically charged dots on a\nof ink onto paper. motion, on the\nlight-sensitive drum, which attract\npage and prints\ntoner\nby impact\n5\n5 Connectivity Between Device\n1. Desktop Computer\n2. Laptop Computer\n3. Printer\n4. LCD Projector\n6 Computer Operation Overview\nDay 5\n1 Microsoft Office\nMicrosoft Office is a proprietary commercial office\nsuite of inter-related desktop applications, servers\nand services for the Microsoft Windows operating\nsystems, introduced by Microsoft in 1989. Initially a\nmarketing term for a bundled set of applications, the\nfirst version of Office contained:\n√\nMicrosoft Word\nMicrosoft Excel √\nMicrosoft PowerPoint\n2 Microsoft PowerPoint\nPowerPoint presentations consist of a number of individual pages or \"slides\". The\n\"slide\" analogy is a reference to the slide projector. Slides may contain text,\ngraphics, sound, movies, and other objects, which may be arranged freely.\nPowerPoint, however, facilitates the use of a consistent style in a presentation using\na template or \"Slide Master\".\nThe presentation can be printed, displayed live on a computer, or navigated through\nat the command of the presenter. For larger audiences the computer display is\noften projected using a video projector. Slides can also form the basis of webcasts.\nPowerPoint provides three types of movements:\n• Entrance, emphasis, and exit of elements on a slide itself are controlled by what\nPowerPoint calls Custom Animations\n• Transitions, on the other hand are movements between slides. These can be\nanimated in a variety of ways\n• Custom animation can be used to create small story boards by animating\npictures to enter, exit or move.\n3 4 5\n5 Summary\n Desktop Computer\n Laptop Computer\n LCD Projector\n LaserJet Printer\n DeskJet Printer\n Operating System\n Computer Application\n Internet\n Internet search engine\n Internet Email\n Microsoft Word\n Microsoft Excel\n Microsoft PowerPoint\n6 "}