{"text":"Introduction To Computer Science\nUnit 0: Pre-Assessment\nBefore discussing the various topics that relate to the development of history of computers,\nthe Von Neumann architecture and other related topics in subsequent units, in this unit,\nbasic terms that relate to computer science have been described. Understanding the terms\nassociated to computer science, information technology and information and communication\ntechnology in general develop your understanding of key concepts which have been discussed\nin the module.\nUnit Goals\nThis unit is to remind learners some of the important components of a computer system and\ncomputing, which learners are assumed to have known. Upon completion of this unit the\nlearner should be able to:\n• distinguish terminologies that relate to computer science, information technology\nand Information and Communication Technologies; and\n• Compute or convert the binary equivalent of decimal numbers.\nKey Terms\nBinary Digit: a single digit number in base-2,\nin other words, either a 1 or a zero. It is the\nsmallest unit by which a computer data is\nrepresented.\nBrowser: a software that is used to access\nvarious kinds of Internet resources.\nByte: a set of Bits that represent a single\ncharacter.\n16 Unit 0: Pre-Assessment\nWhat is a Computer, Computer Science, Information Technology and Information and\nCommunication Technology?\n1 What is a Computer?\nA computer is defined as an electronic device designed for storing and processing data,\ntypically in binary form [2].\nThe following are components of a computer system is composed of:\na. Memory or Primary Memory: enables a computer to store data or information\nand programs temporarily.\nb. Secondary or Mass storage device: enables a computer to permanently store\nlarge amounts of data. Commonly used mass storage devices include disk drives\nand tape drives.\nInput device: users interact with a computer using input devices. Input devices usually a\nkeyboard and mouse are used by a user in order to provide instructions to a computer.\nOutput device: computer uses a screen or monitor, printer, or other device to display\noutputs.\nCentral processing unit (CPU): the brain of the computer, this is the component\nresponsible for executing instructions.\n2 What is Computer Science?\nThere are several definitions for the term Computer Science most of them converge to the one\ngiven here. Computer Science can be defined as the study of computers and computational\nsystems. Computer scientists deal mostly with software and software systems; this includes\ntheir theory, design, development, and application .\n3 What is Information Technology?\nThe term Information Technology is defined as the study or use of systems (especially\ncomputers and telecommunications) for storing, retrieving, and sending information[3]. It\nrefers to the uses of computers, networking, software and other equipment to manage\ninformation. In the modern world information technology is integral to the success of business\nand most companies are equipped with computers, DBMS (Database Management Systems),\nservers(computers with high computing capacity) for storing, processing, retrieving and\nprotecting information of the company.\n17 Introduction To Computer Science\n4 What is Information and Communication Technology?\nInformation and Communication Technology (ICT) is an umbrella term that includes\ncommunication device or application, encompassing: radio, television, cellular phones,\ncomputer and network hardware and software, satellite systems, etc. and all the technical\nmeans for processing and communicating information . The terms encompasses both digital as\nwell as pre-digital technologies, including paper-based writing. However, it is most often used\nto describe digital technologies including:\n1. Components of data communication such as communication protocols,\ntransmission techniques, communications equipment, transmission medium.\n, as well as\n2. available techniques for data storage and information processing.\nThe term has been coined out due to the convergence of information technology (IT) and\ntelecommunication technology. In a nutshell ICT encompasses elements such as storage media\nto record information (whether paper, pen, magnetic disk\/ tape, optical disks - CD\/DVD, flash\nmemory etc.); and also technology for broadcasting information - radio, television,; and any\ntechnology for communicating through voice and sound or images- microphone, camera,\nloudspeaker, telephone to cellular phones and the Internet .\nBinary Number System\nDescriptions of binary number system:\n• Uses two digits, 0 and 1; and\n• It is also called Base 2.\nExample: the binary equivalent of 2 is (10)2. Just divide 2 by 2 and take the remainders from\nright to left.\n18 Unit 0: Pre-Assessment\nAssessment: Basic Terms and Binary Number System\nThis preliminary assessment tests the learner’s familiarity of basic topics which are essential for\nmastering the module contents. Attempt the questions and later compare your answer with the\nanswer given, and for the questions where you answered incorrectly refer to relevant materials\nto make further readings so as to be able understand the notions discussed in the unit properly\nAssessment\n1. What does digital technology mean?\n2. Give an example of the most critical ICT tool of our time that has become\na transformational agent in the day-to-day life of people?\n3. Which one of the following statement is correct about ICT?\n• It is a term used to describe methods of information communications\nexclusively\n• It is a term used to describe methods of information communications along\nwith techniques for storing and processing information.\n• It is a term used to describe techniques of storing and processing information.\n• It is a vague term difficult to describe.\n4. Mention two examples of the application areas of ICT.\n5. Find out the binary equivalent of 866?\n6. Describe the differences and commonalities between ICT and Information\nTechnology.\n7. Explain the term Internet?\nGrading scheme\n• The questions are meant to assess learners background with respect to\nbinary number system and some key terms related to the subject matter. The\nassessment questions weight needs not to exceed 7% and learners who carried\nout the learning activities successfully and answered the assessment questions\ncorrectly can earn 7 points or marks.\n19 Introduction To Computer Science\nAnswers\n1. It is about electronic device that generates, stores and processes data in\nterms of two states( a binary code of combination of the digits 0 and 1).\n2. The Internet\n3. B\n4. eLearning, eHealth, and the like\n5. Binary 1101100010\n6. Information Technology(IT) is one of the components of ICT or in other\nwords ICT subsumes IT. Make further readings from online sources.\n7. Internet is the interconnection of several independent networks.\nReferences\n1. http:\/\/www.igi-global.com\/dictionary\/information-and-communication-\ntechnology-ict\/14316, Date accessed, February 2016.\n2. http:\/\/www.webopedia.com\/TERM\/C\/computer.html, Date accessed,\nFebruary 2016.\n3. Wiki Page, https:\/\/en.wikipedia.org\/wiki\/Information_technology, Date\naccessed, February 2016.\n4. https:\/\/undergrad.cs.umd.edu\/what-computer-science\n5. http:\/\/searchcio.techtarget.com\/definition\/\nICT-information-and-communications-technology-or-technologies\n20 Unit 1: Introduction to Computer Systems\nUnit 1: Introduction to Computer\nSystems\nThis unit, defines basic terms such as Hardware, Software, and the Internet. It explains History\nand evolution of Computer Systems, and Types and classes of Computer Systems.\nUnit Goals\nUpon completion of this unit learner should be able to:\n• Describe Computers and their types.\n• Describe the software and hardware components of a Computer..\n• Identify characteristics of Computers that made them useful and indispensable\ntools of our time, and\n• Explain the history and evolution of Computers.\nKey Terms\nComputer: is an electronic device which accepts\ninput, processes the input and produces output\nof a certain kind.\nComputer Science: the study of computers\nand computational systems.\nHardware: is the physical components of a\ncomputer system.\nSoftware: is a general term for the various\nprograms used to operate a computer system.\nRegister: small memory units used to store\nintermediary results.\nNetworking: the interconnection of two or\nmore computers.\nInternet: the network of networks.\n21 Introduction To Computer Science\nLearning Activity: What is a Computer? Characteristics of\nComputers, Types of Computers\n1. What is a Computer?\nA Computer is an electronic device that accepts data, performs computations, and makes\nlogical decisions according to instructions that have been given to it; then produces\nmeaningful information in a form that is useful to humans. The name computer is derived from\na Latin word Computer, which has a meaning of, “to compute”.\nCharacteristics of Computers\nThe characteristics of a computer show the capability and the potential of the computer for\nprocessing data. This saves time, space, money, labors etc. And they answer the questions like\nwhy computers are used and why have they become so popular? The following are items that\ncharacterize a computer[1]:\n• SPEED: In general, no human being or any other device can compete to solve\ncomplex computation, faster than computer.\n• ACCURACY: Since the Computer is programmed, so whatever input we give it,\nit gives result with high degree of accuracy. In other words, it does computation\nwith high precision.\n• STORAGE : Computer has the capacity to store mass volume of data with\nappropriate format.\n• DILIGENCE: Computer never feels bored and it can work for hours and hours\nwithout any break and creating error.\n• VERSATILITY: Computers are multipurpose. A Computer can perform\ncompletely different types of work at the same time.\n• POWER OF REMEMBERING: It stores data for future use.\n• NO IQ: Computer needs to be instructed to do its job.\n• NO FEELING: Computer does not have emotions, knowledge, experience and\nfeeling.\n22 Unit 1: Introduction to Computer Systems\nTypes of Computers\nThere are different types of Computers. Besides size and purpose of application, their\ndifferences also stem from variations in terms of how they function or method of operation[2].\nClassification by the Method of Operation (processing)\nOn the basis of their method of operations Computers are further classified into three:\nAnalog Computers: Analog computers operate by measuring. They deal with continuous\nvariables; as opposed to discrete values or numbers, rather, they operate by measuring\nphysical magnitude such as pressure, temperature, voltage, current etc.\nExamples:\na. Thermometer, Voltmeter, Speedometer\nb. Gasoline pump – Contains an analog Computer that converts the flow of pumped\nfuel into two measurements the price of the delivered gas and the quantity of\npumped fuel.\nNote: They are special purpose computers, and they are known for limited accuracy.\nDigital Computers\nDigital computers deal with discrete variables; they operate by counting rather than measuring.\nThey operate directly upon numbers (or digits) that represent numbers, letters, or other special\nsymbols.\nExamples:\n• Abacus\n• Desk & pocket computers\n• The general purpose computers\nNote: Digital computers have higher accuracy and speed than the analog ones.\nHybrid Computers: The best features of analog and digital computers can be combined\ninto a single device to form a hybrid computer. A hybrid computer processes the information\nby collecting input data with analog methods and converting it into digital quantities;\nprocesses the digital values and then converts the output from digital to analog form.\nExample: The following paragraph describes an example of the application of a hybrid\ncomputer in healthcare\n23 Introduction To Computer Science\nIn hospital or healthcare centers analog devices can be used to measure a patient’s heart\nfunction, temperature and other vital signs. These measurements can then be converted\ninto numbers and supplied to a digital component in the system. This component is used to\nmonitor the patient’s vital signs and sends an immediate signal to the healthcare station if any\nabnormal readings are detected.\nClassification by purpose of application\nComputers can be applied or used for different purposes. Based upon their application, they\nare classified as special purpose or general-purpose computers.\nSpecial purpose computers: They are designed to solve a single type of problem, that is\ntheir components and functions are uniquely adapted to a specific situation involving specific\napplication.\nExample:\na. The public telephone box,\nb. Traffic control system,\nc. Ticket machines (used in grocery, super markets etc ),\nd. Pocket calculators,\ne. Counters etc\nMost analog computers are special purpose computers.\nGeneral-purpose computers: They are designed to solve variety of problems through the\nuse of “store program concept”. A program or set of instructions designed to solve a problem\nis read and stored into the memory and then executed by the computer one by one. The same\ncomputer can be applied to solve another set of problem using different program. General\npurpose computers are more flexible and versatile.\nExamples:\nA. Micro computers\nB. Mini computers\nC. Super computers etc.\n24 Unit 1: Introduction to Computer Systems\nClassification by Physical Size, Capacity and Performance\nAt this stage, by a computer, we mean a general-purpose digital computer. There is a wide\nvariety of general purpose digital computers on the market place today, in terms of physical\nsize, price, capacity, and performance. They are classified as follows by their capacity and size:\nSuper Computers: Super computers are the fastest, largest and most potential types\nof computer. They have speed of hundreds of millions of operation per second, a primary\nmemory capacity of about 80 million characters, a secondary memory of capacity of about 20\ntimes its primary memory.\n• They are multi-user systems in intercontinental range.\n• They can carry out enormously complex scientific calculations.\nThey are used to process huge amount of data and are commonly used in areas where there\nis a pressing need for big storage as well as performance capacity. Sectors where Super\ncomputers are in high demand include space technology centers, meteorology stations,\nastronomical observatories, intercontinental communications, airline organizations.\nMainframe computers:Smaller than supercomputers in size and capacity, lower in speed &\nmemory capacity than the supercomputers. However they are multi-user systems and handle\nhundreds of users, usually used in large organizations.\nMini computers: Have relatively lower speed, can handle multi-users, are smaller in size than\nthe mainframe computers. They use terminals for inputs and output. Mini computers are used\nin small organizations.\nMicro computers: Micro computer (personal or desktop computer) is a computer whose\nCPU is a microprocessor. Microprocessor is a processor all of whose components are on a\nsingle integrated-circuit chip. Since its CPU is integrated in a single circuit, it can serve only a\nsingle user at a time. Most of home and personal office computers are microcomputers. The\nrelative performance and usage of personal computer is relatively increased with a very high\nrate.\nWhat is Computer Science?\nComputer Science is the study of Computers and Computational systems. It is a science\nconcerned with the representation, storage, manipulation or processing and presentation of\ninformation. Like any other science, which uses some devices for the practical aspect, computer\nScience uses an electronic or digital device called Computer\nLike other sciences Computer Science has different fields of specialization or sub-disciplines.\nMajor fields of study in Computer Science include artificial intelligence, computer systems\nand networks, security, database systems, human computer interaction, vision and graphics,\nnumerical analysis, programming languages, software engineering, bioinformatics and theory\nof computing. A description for some of the disciplines is given below.\n25 Introduction To Computer Science\nSoftware engineering: It is concerned about the development of a better quality software\nby applying scientific and basic engineering principles.\nComputer Networks: It is concerned with connecting computers for the purpose of sharing\nresources.\nDatabase Systems: involves the study and design of efficient methods for information\nstorage, process & retrieval.\nArtificial Intelligence: It Iis concerned with the means by which Computers can perform\ntasks that would be characterized as intelligent if performed by human beings.\nActivity Conclusion\nIn this activity you have been introduced to basic notions such as what is computer?\nCharacteristics and types of computers. Computers have undergone significant changes over\nthe years since their advent, and their use spans to almost all sectors and activities.\nAssessment: Reflective Activities\n• Define the term computer in your own terms?\n• What are the characteristics of computers?\n• How are computers classified?\nAnswers\n• A computer is an electronic device that accepts inputs, processes the input based\non an algorithm and finally produces an output.\n• Diligent, multitasking, highly accurate, store their own instruction, etc\n• Computers can be classified based on size, electronic components used for\ntheir development, method of operations, their purpose of use and computing\ncapacity.\n26 Unit 1: Introduction to Computer Systems\nLearning Activity: History of Early Days Computers\nHistory and Evolution of Computer Systems\nHistory of Computer Systems\nThe History of computer systems is about the developments from early simple devices to aid\ncalculation to modern day computers. The following are some of the calculating devices that\nprecede modern day computers[3].\nAbacus: It is one of the earliest mechanical computational devices. The abacus was early used\nfor arithmetic tasks. It was in use in the Middle East as early as 2500 BC The familiar Chinese\nabacus ( dating approximately 1200 AD ) is composed of a frame and a number of wires..\nPascal’s calculator: Pascal’s calculator was the first true mechanical calculator. In 1642, at\nthe age of 19, the French philosopher and mathematician Blaise Pascal developed a rotating\nwheel calculator, the predecessor of the latter popular desktop calculator.\nThe Difference Engine: The difference engine is believed to be the forerunner of the\nmodern computer. Charles Babbage (1792-1871), a British mathematician and engineer, is\nconsidered by many to be the real father of today’s computer was the developer of the\ndifference engine and designer of the analytical engine. He also designed a significantly\nimproved version of the difference engine (but not built) called Analytic engine. It has different\nkey components\n• The store: A memory wheel consisting of set of counter wheels\n• The mill: An arithmetic unit capable of performing the four basic arithmetic\noperations. It operated on pairs of mechanical registers and produced a result\nstored in another register, all of which were located in the store.\n• Operation cards: These card selected one of the four arithmetic operations by\nactivating the mill to perform the selected function.\n• Variable cards: These cards selected the memory locations to be used by the\nmill for a particular operation ( a source of operand and the destination of the\nresult ).\n• Output: was to print or a card punch device.\n• Herman Hollerith’s Tabulating Machine\nHerman Hollerith was a statistician, in 1880, he developed the tabulating machine\ncommissioned by the U.S. Census Bureau.\n27 Introduction To Computer Science\nMark I: Developed by Howard Aiken at Harvard university in 1944, Mark I, was the first\nelectromechanical computer. Instructions were provided by means of punched paper\ntape, which combined the functions of Babbage’s operation cards and variable cards. Each\ninstruction had the format: A1 A2 OP , where A1 and A2 are registers storing the operands\nand OP is the operation to be performed( e.g. +,-,x,%). Mark I, was able to do a single\naddition in 6 seconds and division in 12 seconds.\n• ENIAC( Electronic Numerical Integrator And Computer)\nDeveloped by Eckert and Mauchly at the university of Pennsylvania. This was the first\nelectronic calculator and first general purpose digital computer. This machine was enormous,\nweighing 30 tons., occupying 15,000 square feet of floor space and containing over 18,000\nvacuum tubes. While running it used to consume over 140 KWh of power. It had the capacity\nto perform 5,000 additions per second. Its memory consisted of 20 “accumulators” each\ncapable of holding a 10 digit decimal number. The following are some of the characteristics of\nENIAC.\n• ENIAC did not use internally stored programs. Programs were wired on boards\nsimilar to a telephone switch board.\n• One of the major drawbacks of ENIAC was that it had to be programmed\nmanually by setting switches and plugging and unplugging cable\nActivity Conclusion.\nDevices that predates modern day computers are Abacus, Pascal’s calculator, the Difference\nengine, Herman Hollerith’s Tabulating Machine, Mark I and ENIAC. Among them ENIAC was\nregarded as the first electronic calculator and digital computer.\nAssessment: Reflective Activities\n• What was the function of the component named mil in the difference engine?\n• What were the distinguishing features of ENIAC from modern day computers?\n• What makes different a computer from any other electronic device?\n28 Unit 1: Introduction to Computer Systems\nAnswers\n• It performs basic arithmetic operations\n• ENIAC did not use internally stored programs. Programs were wired on boards\nsimilar to a telephone switch board. And it had to be programmed manually\nby setting switches and plugging and unplugging cables. Humanbeings or the\nmachine operator play the role of modern day operating systems\n• It can store information permanently, it has big computing power, highly\naccurate,etc\nLearning Activity 3: The Advent of Modern Days Computers\nThe Von Neumann Machine: The task of entering and altering programs for the ENIAC was\nextremely tedious. At the time when ENIAC was first in use, the person named Von Neumann\nwas the consultant on the ENIAC project, having a closer look at of ENIAC’s shortcomings he\nforward advanced the stored program concept, the then new concept enabled the computer\nto get its instruction by reading them from memory alongside the data and a program could\nbe set or altered by setting the values of a portion of a memory. Based on this concept, the\nfirst true electronic computers were developed by the name EDVAC( Electronic Discrete\nVariable Computer) and EDSAC( Electronic Delay Storage Automatic Computer).\nCommercial Computers: The 1950s saw the birth of computers industry with two\ncompanies, Sperry and IBM, dominating the market place. In 1947, Eckert and Mauchly\ndeveloped their successful commercial computer called UNIVAC I (Universal Automatic\nComputer).\nGenerations of Computers: Although computer professionals do not agree on exact dates\nor specifics, computer developments are often categorized by generations. Actually there are\nfour generations and major characteristics that distinguish these generations are the following;\n• Dominant type of electronic circuit elements used.\n• Major secondary storage media used.\n• Computer language used.\n• Types or characteristic of operating system used.\n• Memory access time (time to store or retrieve a word or data from memory).\nComputer generations are usually categorized by dramatic improvement in the hardware,\ntypically refold or better increases in speed and reliability.\n29 Unit 1:I Innttrroodduuccttioionn T too CInofmorpmuatetiro Snc aienndc eSociety\nA First generation (1950s)\n• Used vacuum tubes as components for the electronic circuit.\n• Punched cards were the main source of inputs, and magnetic grams were used for\ninternal storage.\n• Operate in a speed of milliseconds (thousandths of a second) and could handle\nmore than 10,000 additions each second.\n• Most applications were scientific calculations.\nB Second generations (early 1960s)\n• Transistors were the main circuit components. (Transistors are a solid state device\nmade from silicon which is smaller, cheaper, faster, dissipate less energy and more\nreliable than vacuum tube but work in the same way with the vacuum tube.)\n• Invented by Bell Labs.\n• Magnetic tapes (similar with music tape caste), used for main storage,\n• Operate in microseconds (millionths of a second) with more than 200,000\nadditions possible each second.\n• Business applications become more commonplace, with large data files stored on\nmagnetic tape and disk. (Magnetic disk: is a circular platter constructed of metal\nor plastic materials coated with magnetizable substance.)\n• High-level languages COBOL and FORTRAN were introduced during this period.\nBatch operating systems are used that permitted rapid processing of magnetic\ntape files.\nC Third generation (late 1960s, early 1970s\nCharacterized by solid-state logic and integrated circuit (IC). (A single, self-contained transistor\nis called discrete component. In early 1960 electronic equipment composed of discrete\ncomponents transistors, capacitors, resistors, were available:\n• Computer storage switched from magnetic cores to integrated circuit boards\nthat provide modularity (expandable storage) and compatibility (interchangeable\nequipment)\n• New input\/output methods such as optical scanning and plotters.\n• Software become more important with sophisticated operating systems, and\nimproved programming languages.\nD Fourth generation (late 1970s,early 1989s,)\n• Greatly expanded storage capabilities and improved circuitry.\n• Has a large-scale integrated circuits (LSI) which has several hundred\nthousands transistors placed on one tiny silicon chip.\n30 Unit 1: Introduction to Computer Systems\n• Computer memory operates at speeds of nano seconds (billionths of a\nsecond) with large computers capable of adding 15 million numbers per\nsecond.\nE Fifth generation\nThe fifth generation computer development is still in progress. An architecture, which makes\nuse of the changes in technology and allows a simple and natural methodology for solving\nproblems, is being sought. These computers will have intelligent processors i.e., processors\nwhich can draw inferences. Users will also be able to interact with them in natural languages\nsuch as in plain English or a particular language of choice.\nActivity Conclusion\nThe task of entering and altering programs for the ENIAC was extremely tedious. The\nlimitations of early days computers were successfully addressed through the Von Neumann\narchitecture which you will learn in the next unit. Computers evolution is grouped into four\ngenerations with each generation characterised by the dominant electronic component used,\nthe type of programming language as well as the type of operating systems used.\nAssessment: Reflective Activities\na. What was the type of electronic component used in the second generation of\ncomputers?\nb. What type of operating system was used in the first generation of computers?\nc. The type of operating system used in the third generation was a time sharing\none, what does time sharing mean?\nAnswers\na. Vacuum tube\nb. There was no notion of operating system then, it was programmer who also\nassumes the role of operating system by connecting or disconnecting wires\nc. Time sharing operating systems are systems that enables program share the\ncomputer resources including the CPU based on a scheduled time.\n31 Introduction To Computer Science\nLearning Activity: Creating a Summary for the Unit\nIntroduction\nIn this activity you are required to summarize the unit’s content with words not exceeding\n200. Just focus on the main elements discussed in the unit such as Computer, Computer\nScience, Characteristics of Computers, Types or Classes of Computers, History and Evolution of\nComputers.\nInstructions\nSummarizing the whole idea of a content of several pages in a few words among other\nthings requires writing skills. In this activity you need to be more specific as well as brief in\nincorporating the most important elements of the unit’s content in the summary. You need to\nwrite them in your own words, copying the topics idea in a verbatim way is not allowed.\nActivity Assessment Criteria: Summary completeness and readability.\nAssessment\nInstruction to Unit Assessment\nA solid understanding of the following items is mandatory, in case of doubts, learners are\nadvised to go back to the specific sections where they feel is not confident enough on\ntheir grasp of the notion(s).\na. Types of computers\nb. What a computer can do and what it can’t do\nc. The electronic circuit element each generation of computers made up of\nd. The characteristics of the operating system used in each generation of\ncomputers\ne. The nature of storage devices used in each generation of computers\nf. The nature of programming languages used in each generation of computers\n32 Unit 1: Introduction to Computer Systems\nThe following are sample questions:\n1. Which of the following is not a characteristic of a computer?\na. Diligent\nb. High Speed\nc. Never get bored or tired\nd. None\n2. Which of the following correctly describes Information Technology(IT)?\na. it is the combination of computer and communication technologies\nb. it deals with data processing only\nc. it deals with data communications only\nd. none\n3. Which of the following is true about types of computers classification?:\na. Computers can be classified by the method of operations or processing they\nuse\nb. Computers can be classified by purpose of applications\nc. Computers can be classified by physical size\nd. All\n4. Computers can perform multiple tasks simultaneously with equal ease means\na. They are diligent\nb. They are fast\nc. They are versatile\nd. They are reliable\n33 Introduction To Computer Science\n5. Which of the following statement characterizes first generation of computers?\na. Large integration of electronic circuits\nb. Vacuum tubes as components of electronic circuits\nc. Magnetic tapes\nd. Punched cards\ne. A & D\nf. B & D\nGrading scheme\nPreparing both subjective and objective questions related to the items mentioned above is\nrequired, the above questions are included as sample to aid in course module facilitators on\nhow to prepare unit assessment questions, and the unit assessment weight should not exceed\n10%.\nAnswers\n1. D, 2. A, 3. D, 4. C, 5. F\n34 Unit 1: Introduction to Computer Systems\nReferences\n1. National Institute of Open Schooling, http:\/\/oer.nios.ac.in\/wiki\/index.php\/\nCHARACTERISTICS_OF_COMPUTERS, Date accessed, February 2016.\n2. Wiki Page, https:\/\/en.wikipedia.org\/wiki\/Classes_of_computers, Date\naccessed, February 2016.\n3. Wiki Page, https:\/\/en.wikipedia.org\/wiki\/History_of_computing_hardware,\nDate accessed, February, 2016.\n35 Introduction To Computer Science\nUnit 2: Components of a\nComputer System\nThis unit describes the components of a computer system in relations to the Von Neumann\nArchitecture. It describes the peripheral parts of a computer system and the software that\nmakes the hardware components of a computer system operational.\nUnit Goals\nUpon completion of this unit the learner should be able to:\n• Describe Components of a computer system;\n• Distinguish elements of the Von Neumann Architecture;\n• Differentiate the types and functions of software systems; and\n• Explain the stored-program concept of the Von Neumann Architecture.\nKey Terms\nBus: a distinct set of conductors carrying data\nand control signals within a computer system, to\nwhich pieces of equipment may be connected\nin parallel.\nControl Signal: A pulse or frequency of\nelectricity or light that represents a control\ncommand as it travels over a network.\n36 Computer System\nLearning Activity: The Von Neumann Architecture\nIntroduction\nOver the years computer architecture has undergone incredible changes. One thing that\nhas been preserved in the influx of changes over the year is the Von Neumann concept of\ncomputer design. The von Neumann architecture, also known as the von Neumann\nmodel and Princeton architecture, is the first model to represent the stored-program\nconcept that has fundamentally changed computing[1,2,3]. In the 1940s, a mathematician\ncalled John Von Neumann described the basic arrangement (or architecture) of a computer\nsystem. Most computers in use are designed based on the concept described by him although\nthere are other types of architecture.\nThe following are characteristics of a Von Neumann-based computer:\n√ It uses a single processor.\n√ It uses one memory for both instructions and data.\n√ It cannot distinguish between data and instructions in a memory location\n√ It distinguishes between data and instructions only because of the location of a\nparticular bit pattern in RAM.\n√ Executes programs by doing one instruction after the next in a serial manner\nusing a fetch-decode-execute cycle.\nComponents of the Von Neumann Architecture\nFigure 1- The Von Neumann Architecture (Source: Computer\nArchitecture and Organization by M. Murdocca & V. Heuring\nFig 1-14 page 10)\nThe above figure, Figure 1, depicts the essential features of the\nVon Neumann or stored-program architecture\n37 Introduction To Computer Science\nMemory\nThe computer has a memory that can hold both data and also the program processing that\ndata. In modern computers this memory is known as RAM(Random Access Memory). The\nfollowing are items that characterize the Memory (RAM) in the Von Neumann architecture:\n– Consists of many memory cells (storage units) of a fixed size.\n– Each cell has an address associated with it: 0, 1, …\n– All accesses to memory are to a specified address.\n– A cell is the minimum unit of access (fetch\/store a complete cell).\n– The time it takes to fetch\/store a cell is the same for all cells.\n– When the computer is running , both program and data also known as\nvariables are stored in the memory.\n– Typical memory size in a personal computer (PC) is 4GB- 8GB.\n– Typical memory access time or speed in a personal computer is in the\nrange of nanoseconds.\n– It is volatile in that it can only store when power is on\n– Typical operations in memory are:\n√ Fetch(address)- fetching a copy of the content of memory cell with the specified\naddress.\n√ Store(address, value)- storing the specified value into the memory cell specified\nby address.\n– The memory is interfaced via:\n• Memory Address Register,\n• Memory Data Register,\n• Fetch\/Store signal.\n• Thus, the two memory operation fetch and store amounts to:\n– Fetch(address)\n– Load address into MAR.\n– Decode the address into MAR.\n– Copy the content of Memory cell with specified address into MDR.\n• Store(address, value)\n• Load the address into MAR.\n• Load the value into MDR.\n• Decode the address in MAR.\n• Copy the content of MDR into memory cell with the specified address.\n38 Computer System\nInput \/ Output\nThe input\/output component of the Von Neumann architecture handles devices that allow a\ncomputer system to communicate with other devices such as a screen(or monitor), keyboard,\nprinter, etc. It also allows a computer system to store information via storage devices such as\ninternal and external hard-drives, CD-ROMs, Memory stick(flash disks), etc.\nThere are two types of access methods where storage devices (mass-storage devices) can be\naccessed by a computer system:\na. Direct Access Methods are applicable for hard-drives, CD-ROMs, memory stick\nor flash disks and the like. Direct access means random access is possible.\nb. Sequential Access Methods are applicable for tape drives where data can only\nbe accessed serially or sequentially. Sequential access means random access is not\npossible\nCharacteristics of Input \/Output (I\/O) devices:\na. Compared to Memory or RAM, speed of I\/O devices is slow, it is in the range of\nmilliseconds\nb. In order to mitigate the slowness problem, I\/O devices make use of controllers.\n• A controller, which has a special purpose processor has a small memory\nbuffer, and a control logic to control I\/O device (e.g. to move a disk\narm).\n• This solution enables data transfer between RAM and the memory buffer,\nand accessing data from the memory buffer is faster.\nThe ALU\nThe Arithmetic\/ Logic Unit(ALU) performs mathematical operations((+, -, x, \/, …) and logic\noperations (=, <, >, and, or, not, ...). The ALU is a sub-component of the CPU(Central\nProcessing Unit). The ALU is composed of:\n• Circuits responsible for performing arithmetic\/logic operations,\n• Registers responsible for storing intermediate computational results,\nand\n• Bus that connects the two.\n39 Introduction To Computer Science\nThe Control Unit\nThe control unit is responsible for managing the process of moving data and program into and\nout of memory. It is also responsible for carrying out (executing) program instructions - one at a\ntime. This includes the idea of a ‘register’ to hold intermediate computational values.\nPeripheral Devices\nA peripheral device is generally defined as any device such as mouse or keyboard connected\nto a computer system to add functionality[4].\nTypes of Peripheral Devices\nTypes of peripheral devices fall into three general categories, they are:\n• Input devices: such as a mouse and a keyboard\n• Output devices: such as a monitor and a printer\n• Secondary Storage devices: such as a hard drive or flash drive.\nDevices like CD-ROM fall into more than one category in that users can use a CD-ROM to read\ndata or music (input) as well as to write data to a CD (output).\nPeripheral devices can be further divided into external or internal. For example, a printer is an\nexternal device that you connect with the computer using a cable, while an optical disc drive is\ntypically located inside the computer case.\nFor a desktop computer, a keyboard and a monitor are considered peripherals in that you can\neasily connect and disconnect them as needed. For a laptop computer, these components are\nbuilt into the computer system and can’t be easily removed.\nActivity Conclusion\nThe von Neumann architecture, also known as the von Neumann model and Princeton\narchitecture, is the first model to represent the stored-program concept that has fundamentally\nchanged computing. The following are characteristics of the Von Neumann Architecture:\n√ It uses a single processor.\n√ It uses one memory for both instructions and data.\n√ It cannot distinguish between data and instructions in a memory location\n√ It distinguishes between data and instructions only because of the location of a\nparticular bit pattern in RAM.\n√ Executes programs by doing one instruction after the next in a serial manner\nusing a fetch-decode-execute cycle.\n40 Computer System\nAssessment: Reflective Activities\n• What does the stored program concept mean?\n• What is the operation the control unit is responsible for?\n• What is the operation the ALU is responsible for?\nAnswers\n• Unlike some electronic devices such as calculators computers are capable of\nstoring their own instructions attributed to Von Neumann’s architecture - the\nstored-program concept.\n• The control unit is responsible for managing the process of moving data and\nprogram into and out of memory.\n• The ALU is responsible for arithmetic and logic operations\nLearning Activity: Software Systems\nIntroduction\nThe computer hardware refers to the physical components of a computer system. For the\nindividual components of a computer system to perform a task they need to be instructed. The\nfinite set of instructions (steps) that a computer system follows to perform a given task is called\na program. For any program to be executed first it should be loaded in the memory.\nA Software is therefore defined as a collection of programs that directs a computer to\naccomplish a given task[5].\nSoftware Types\nSoftware is divided into two types:\n• System Software, and\n• Application Software.\n41 Introduction To Computer Science\nSystem Software\nSystem software is designed to facilitate the work of the computer’s hardware. The following\nare activities a system software is responsible for:\n• It is responsible for organizing and managing the computer’s hardware;\n• It acts as intermediary or interface between the user and the computer hardware\n• It makes what it looks to be a complex hardware more users friendly.\nSystem software is further divided into:\n• Operating system\n• Language software\nOperating System\nOperating system coordinates the activity between the user and the computer. An operating\nsystem has three major functions.\n• Controlling operations (control program)\n• Coordinates, or supervises the activity of the computer system.\n• Decides where programs and data should be stored in the computer memory.\n• Handles communications among the computer components, applications\nsoftware and the user.\n• Controls the saving and retrieving of files to and from disks in the disk drive.\n• It performs all its controlling tasks without the involvement or awareness of the\nuser.\n• Input\/output Management\n• The I\/O manager coordinates the computers communication with outside world,\nflow of data to the display screen and other output devices (printers\/ plotters) and\nfrom the keyboard or other input devices.\n• Handles the flow of data to and from the disk drives (file management).\n• Handles the process of preparing a disk for use, the copying, renaming, erasing\ntask of a file.\n• Command Processing ( command Interpreter)\n– It interprets the commands or what you enter using the keyboard or\nother input devices\n42 Computer System\nTypes of operating Systems\nOperating systems can be classified by:\na. The number of programs or tasks they can handle at a time and\nb. The number of users they serve at once at one or different stations.\nSingle tasking operating systems\n– With single tasking operating systems: only one program can be run on\na computer at a time.\n– In order to run another program, one must remove the first program\nloaded in the computer’s main memory and load the other one(i.e. it\ncan’t handle two or more programs at a time)\n– These types of operating systems are single user or can serve only one\nuser at a time.\nMulti user operating system\nIt supports a number of workstations connected to a central system.\nA number of users can use the resources of one high capacity computer by the help of\nterminals.\nReal Time Operating System\nI. A real time operating system is a system that manages the resources of a\ncomputer system based on deadlines.\nII. Its primary characteristics is that it responds to an event within a well defined\ntime. in other words meeting deadline for a particular event is a must.\n43 Introduction To Computer Science\nLanguage Software\nLanguage software is a generic name consisting of various programs that serve as editors and\ntranslators to develop programs using programming languages.\nProgramming languages are broadly classified into:\na. High-level\nb. Low-level\nExamples of high-level programming languages include C, C++ Java, FORTRAN, etc\nTools such as compilers and interpreters are used to convert programs written in high level\nlanguages into machine or low-level language or object code.\nLow-level languages are expressed in binary digits, which is the only language the computer\ncan understand.\nApplication Software\nA software designed for a specific purpose is known as application software. Examples of\napplication software include:\nI. Word-processing software such as Microsoft Word,\nII. Spreadsheet software such as Microsoft Excel,\nIII. Presentation software such as Microsoft PowerPoint,\nIV. etc.\nActivity Conclusion\nA software or program is defined as a set of instructions that directs the computer hardware to\naccomplish a given task. In this activity you have been introduced to the broader classification\nsoftware, that is software divided into two types, system software and application software.\nSystem software usually performs generic tasks such as managing the hardware resources of a\ncomputer system. Whereas applications software are designed for a specific purpose.\n44 Computer System\nAssessment: Reflective Activities:\n1. In a computer system which component is more important, the hardware\nor the software?\n2. Define what an operating system means? And give two examples of\noperating systems commonly used for personal or office use.\n3. Explain the difference between single user operating system versus\nmultiuser operating system.\n4. Define the term application software and give an example of applications\nsoftware commonly used for creating and editing documents, as well as\ncreating presentation slides.\nAnswers:\n• Both the hardware and software are equally important, one without the other is\nunthinkable.\n• An operating system is a software which enables a user to interact with a\ncomputer. Examples: Microsoft Windows Operating system, Linux, Unix, etc.\n• A single user operating system only serves one user at a time whereas a multiuser\noperating system serves two or more users parallaly.\n• Application software is a software designed or developed for a specific purpose.\nExamples: Microsoft Word, Microsoft PowerPoint.\nLearning Activity: Creating a Summary for the Unit\nIntroduction\nIn this activity you are required to summarize the unit’s content with words not exceeding 80.\nJust focus on the main elements discussed in the unit such as the Von Neumann Architecture,\nthe peripheral devices of a computer system and software their types and purposes.\nActivity Details\nSummarizing the whole idea of a content of several pages( in this case 11 pages) in a few\nwords among other things requires writing skills. In this activity you need to be more specific as\nwell as brief in incorporating the most important elements of the unit’s content in the summary.\nYou need to write them in your own words, copying the topics idea in a verbatim way is not\nallowed.\n45 Introduction To Computer Science\nActivity Assessment Criteria: Summary completeness and readability.\nAssessment\nSummative Assessment for the Unit\nInstruction to Unit Assessment\nA solid understanding of the following items is a necessity, in case of doubts learners are\nadvised to go back to the specific sections where they feel is not confident enough on their\ngrasp of the notion(s).\na. The Von Neumann Architecture or model,\nb. The functional or role of each component of the Von Neumann Architecture-\nbased computer,\nc. What devices in a computer system are termed as peripheral and what\ndevices are not,\nd. The role of software in a computer system,\ne. The difference and commonalities of a system software and an application\nsoftware,\nThe following are sample questions:\n1. Which of the following is a destructive memory operation?\n• Fetching\n• Storing\n• A & B\n• None\n2. What is a secondary storage device, and why are such devices important?\n3. Discuss the components of the Von Neumann Architecture or Model\n4. Discuss the pros and cons of using magnetic tape as a storage medium\n5. What is the stored-program concept and why is it important?\nGrading scheme:\nPreparing both subjective and objective questions related to the items mentioned above is\nrequired, the above questions are included as sample to aid in course module facilitators on\nhow to prepare unit assessment questions, and the unit assessment weight should not exceed\n10%.\n46 Computer System\nAnswers:\n1. B\n2. Because RAM is volatile and ROM cannot be changed, there must be places\nto store data and programs outside of the computer’s main memory. Such\nplaces are called secondary storage devices.\n3. ALU- performs arithmetic\/logic operations\n4. Control Unit- controls the various parts of a computer hardware\n5. Memory- stores both data and program\n6. Magnetic tape is a cheap medium for storing great quantities of data.\nHowever, data items cannot be directly addressed on tape. To reach a data\nobject, all information recorded before the one you want must be read and\ndiscarded.\n7. The stored program concept means that data and instructions are both\nlogically the same and can both be stored in memory. The von Neumann\narchitecture is built around this principle. It is important because the human\ndoes not have to execute instruction from without the machine. Instructions\ncan be stored in memory and executed in sequence referencing the data\nvalues it needs on which to operate.\nReferences:\n1. Von Neumann Architecture, http:\/\/www2.cs.siu.edu\/~cs401\/Textbook\/ch2.\npdf.\n2. TheTeacher.info, http:\/\/theteacher.info\/index.php\/f453-advanced-theory\/3-\n3-3-architectures\/notes\/192-von-neumann-architecture-notes, Date\naccessed, February 2016.\n3. Wiki Page, https:\/\/en.wikipedia.org\/wiki\/Von_Neumann_architecture, Date\naccessed, February, 2016.\n4. Wiki Page, https:\/\/en.wikipedia.org\/wiki\/Peripheral, February, 2016.\n5. Wiki page, https:\/\/en.wikipedia.org\/wiki\/Software, February, 2016.\n47 Introduction To Computer Science\nUnit 3: The Internet\nThis unit presents a brief history of the Internet, which is one of the most critical and\nindispensable technological tool of our time. It describes the origin of the Internet, the initial\ninternetworking, and all the important milestones that the Internet technology has gone\nthrough since its emergence.\nUnit Goals\nUpon completion of this unit the learner should be able to:\n• Describe the important milestones that led to the establishment of the Internet as\nwe know it today;\n• Describe the application of the Internet;\n• Explain the Internet as the most crucial vehicle of resource repository in the\nteaching and learning process; and\n• Describe the components of the Internet technology.\nKey Terms\nProtocol: rules that computer use to exchange\ndata and communicate\nWorld Wide Web: the World Wide Web (www,\nW3) is an information space where documents\nand other web resources are identified by\nunique identifiers which are known as uniform\nresource locators ( or URIs), and can be\naccessed via the Internet.\nWebsite: a location connected to the Internet\nthat maintains one or more pages on the World\nWide Web\nClassified website: a website where businesses\npost their advertisement for free.\n48 Unit 3: The Internet\nLearning Activity: History of the Internet\nIntroduction\nThe early Internet was proposed, designed and implemented by American research institutes,\nuniversities, and telecommunication companies. Many believe the Internet today is the initial\nprototype of what is often called the National Information Infrastructure. It is a widespread\ninformation infrastructure with rich history that entails many aspects - technological,\norganizational, and community. It has a tremendous impact upon society with its influence\ntranscending beyond the technical fields of computer communications[1].\nOrigin of the Internet\nThe history of the Internet started in the United States in the early 1960s. It begun with the\ndevelopment of electronic computers in the 1950s. It started as a project of the United States\ngovernment’s Department of Defense, to create a non-centralized network. This project was\ncalled ARPANET (Advanced Research Projects Agency Network), created by the Pentagon’s\nAdvanced Research Projects Agency established in 1969 to provide a secure and survivable\ncommunications network for organizations engaged in defense-related research[2].\nIn order to make the network more global a new sophisticated and standard protocol was\nneeded. They developed IP (Internet Protocol) technology which defined how electronic\nmessages were packaged, addressed, and sent over the network. The standard protocol was\ninvented in 1977 and was called TCP\/IP (Transmission Control Protocol\/Internet Protocol). TCP\/\nIP allowed users to link various branches of other complex networks directly to the ARPANET,\nwhich soon came to be called the Internet.\nResearchers and academics in other fields began to make use of the network, and eventually\nthe National Science Foundation (NSF), which had created a similar and parallel network,\ncalled NSFNet, took over much of the TCP\/IP technology from ARPANET and established a\ndistributed network of networks capable of handling far greater traffic. In 1985, NSF began\na program to establish Internet access across the United States. They created a backbone\ncalled the NSFNET and opened their doors to all educational facilities, academic researchers,\ngovernment agencies, and international research organizations. By the 1990’s the Internet\nexperienced explosive growth. It is estimated that the number of computers connected to the\nInternet was doubling every year.\nBusinesses rapidly realized that, by making effective use of the Internet they could tune their\noperations and offer new and better services to their customers, so they started spending vast\namounts of money to develop and enhance the Internet. This generated violent competition\namong the communications carriers and hardware and software suppliers to meet this demand.\nThe result is that bandwidth (i.e., the information carrying capacity of communications lines) on\nthe Internet has increased tremendously and costs have dropped. It is widely believed that the\nInternet has played a significant role in the economic success.\n49 Introduction To Computer Science\nApplication or Purposes of the Internet\nSince its emergence the Internet has become popular and it has been used for several\npurposes. It has revolutionized the computer and communications world like nothing before.\nThrough the help of the World Wide Web and websites, the internet has become very useful in\nmany ways for everyone. Today the Internet has brought a globe in a single room. Right from\nnews across the corner of the world, wealth of knowledge to shopping, purchasing the tickets\nof your favorite movie-everything is at your fingertips.\nThe following are some of the common uses of the Internet[4]:\n• Communication such as Email, Skype, Viber, etc: By using the Internet people\ncan communicate in a fraction of seconds with a person who is sitting in the other\npart of the world.\n• Information or resource sharing: The Internet is known for being one of the\nmost important gateways for resource repositories which store or house different\ntypes of data or information in different formats. The Internet and the World Wide\nWeb has made it easy for anyone to access these data or information. People\ncan browse the Internet in search of information related to healthcare advises,\nweather, etc. easily.\n• Business medium: Over the years, the internet has proved itself that it is not\njust another technological tool, it has become increasingly a business platform\ntoo. World trade has seen a big boom with the help of the internet, as it has\nbecome easier for buyers and sellers to communicate and also to advertise their\nbusiness. It has become a common practice for businesses to use online classified\nwebsites to buy or sell or advertise their products or services. Classified websites\nsave a lot of money and time so this is chosen as medium by most of people to\nadvertise their products.\n• Social Networking: Today social networking websites have become an\nimportant part of the online community. More and more people as well as\ncompanies are joining social networking sites such as Facebook and Twitter for\npersonal as well as business purposes. It has now become a common reality for\ncompanies as well as individuals to use social medias or networking websites to\nbuild their business brand or profile\n• Online Shopping: In today’s busy life most of us are interested to shop online.\nIn some parts of the world, nowadays almost anything can be purchased via the\ninternet. In countries like the United States most of consumers prefer to shop\nfrom home.\n• Entertainment: via the Internet we can find all forms of entertainment from\nwatching films to playing games online. Almost anyone can find the right kind\nof entertainment for themselves. When people browse the Internet, there are\nnumerous things that can be found. Music, hobbies, news and more can be found\nand shared over the Internet.\n• E-Commerce: Ecommerce is the concept used for any type of commercial\nmaneuvering, or business deals that involves the transfer of information across\nthe globe via the Internet. It has become a phenomenon associated with any kind\nof online shopping.\n50 Unit 3: The Internet\n• Services: Many services are now provided on the internet such as online\nbanking, job seeking, purchasing itinerary tickets, and guidance services on\narray of topics in the every aspect of life, and hotel reservations and bills paying.\nMany governments in the developed world have transformed their services into\nelectronic and as a result citizens interact with governments online.\n• Job Search: Internet makes life easy for both employers and job seekers as\nthere are plenty of job sites which connects employers and job seekers.\n• Networking: People are connecting with others via the Internet and build their\nnetwork.\nActivity Conclusion\nThe history of the Internet started in the United States in the early 1960s. It begun with the\ndevelopment of electronic computers in the 1950s. Since its emergence the Internet has\nbecome popular and it has been used for several purposes. It has revolutionized the computer\nand communications world like nothing before. Through the help of the World Wide Web and\nwebsites, the internet has become very useful in many ways for everyone. Today the Internet\nhas brought a globe in a single room.\nAssessment: Reflective Activities\n– What does connecting to the Internet require?\n– Describe the application purposes of the Internet\n– People say the Internet has revolutionized the way we live, what does\nthis mean?\nAnswers:\n– Hardware- a computer or any Internet enabled device, Software-\nInternet browsers and subscription to a service provider(which is\ncommonly known as ISP).\n– The Internet can be used for almost for everything- for searching\neducational or other online resources, for communication, for\nentertainment, for healthcare delivery, for online learning, etc.\n– The Internet has made life easier for those who have access to, it has\nfundamentally changed the way we do our work, learn, shop, etc.\n51 Introduction To Computer Science\nLearning Activity : Search Engines\nSearch Engines\nSearch engines are software tools that search documents for specified keywords and returns\na list of the documents where the keywords were found. A search engine is a general class of\nprograms, however, the term is often used to specifically describe systems like Google, Bing\nand Yahoo search that enable users to search for documents on the World Wide Web.\nSearch engines are special sites on the Web that are designed to help people find\ninformation stored on other sites. There are differences in the ways various search engines\nwork, but they all perform three basic tasks:\n1. They search based on words\n2. They keep an index of the words they find, along with where they find them.\n3. They allow users to look for words or combinations of words found in that\nindex.\nMillions of people around the world use search engines almost on regular basis. The benefits\nof search engines to both individuals and society is huge. They have made the web a very\ncritical resource repository of our time. They are the most popular and widely used tool to find\ninformation online.\nTrends in Internet Use\nThe Internet of Things\nThe term Internet of Things(IoT) has no single universal definition. The definition in [4,5] have\nbeen picked just for their relative simplicity and clarity. The term Internet of Things generally\nrefers to scenarios where network connectivity and computing capability extends to objects,\nsensors and everyday items not normally considered computers, allowing these devices to\ngenerate, exchange and consume data with minimal human intervention.\nIt can also be defined as the network of physical objects—devices, vehicles, buildings and\nother items embedded with electronics ,software, sensors, and network connectivity—that\nenables these objects to collect and exchange data. The Internet of Things allows objects\nto be sensed and controlled remotely across existing network infrastructure, creating\nopportunities for more direct integration of the physical world into computer-based systems,\nand resulting in improved efficiency, accuracy and economic benefit.\nWhen IoT is augmented with sensors and actuators, the technology becomes an instance of\nthe more general class of cyber-physical systems, which also encompasses technologies such\nas smart grids, smart homes, intelligent transportation and smart cities. Each thing is uniquely\nidentifiable through its embedded computing system but is able to interoperate within the\nexisting Internet infrastructure. Experts estimate that the IoT will consist of almost 50 billion\nobjects by 2020.\n52 Unit 3: The Internet\nActivity Conclusion\nOver the years, search engines have become one of the most critical features of the Internet.\nMillions of people around the world use search engines almost on regular basis. The benefits\nof search engines to both individuals and society is huge. They have made the web a very\ncritical resource repository of our time. They are the most popular and widely used tool to find\ninformation online.\nThere are ongoing efforts to make the Internet beyond the regular use, this comes in the\nform of the Internet of Things(IoT for short). IoT generally refers to scenarios where network\nconnectivity and computing capability extends to objects, sensors and everyday items not\nnormally considered computers, allowing these devices to generate, exchange and consume\ndata with minimal human intervention.\nAssessment: Reflective Activities\n• What do search engines do? Give examples of commonly used search engines.\n• Why search engines keep an index of words?\n• In order IoT becomes an instance of the more general class of cyber-physical\nsystems, what devices need to be integrated?\nAnswers:\n• They all perform three basic tasks:\n– They search based on words\n– They keep an index of the words they find, along with where they find\nthem.\n– They allow users to look for words or combinations of words found in\nthat index.\n• The index helps search engines to retrieve a document quickly much like indexes\nin a book do.\n• sensors and actuators\n53 Introduction To Computer Science\nLearning Activity: Creating a summary for the unit\nIntroduction\nIn this activity you are required to summarize the unit’s content with words not exceeding 50.\nJust focus on the main elements discussed in the unit such as the Origin of the Internet, the\napplication of the Internet and trends in Internet use.\nActivity Details\nSummarizing the whole idea of a content of several pages( in this case 11 pages) in a few\nwords among other things requires writing skills. In this activity you need to be more specific as\nwell as brief in incorporating the most important elements of the unit’s content in the summary.\nYou need to write them in your own words, coping the topics idea in a verbatim way is not\nallowed.\nActivity Assessment Criteria: Summary completeness and readability.\nSummative Assessment for the Unit\nInstruction to Unit Assessment\nA solid understanding of the following items is a necessity, in case of doubts learners are\nadvised to go back to the specific sections where they feel is not confident enough on\ntheir grasp of the notion(s).\n• The origin of the Internet,\n• The broader application or purposes of the Internet,\n• What IoT and its components mean,\n• The notion of smart world, smart cities, etc.\n1. What is Internet, and for what purposes it is used?\n2. Describe the components of IoT.\n3. Discuss the pros and cons of using the Internet.\n4. What factors inhibit Internet access penetration in Africa?\nGrading scheme:\nPreparing both subjective and objective questions related to the items mentioned above is\nrequired, the above questions are included as sample to aid in course module facilitators on\nhow to prepare unit assessment questions, and the unit assessment weight should not exceed\n10%.\n54 Unit 3: The Internet\nAnswers:\n• The Internet is defined as the network of networks, communication, online\nshopping, resource or information sharing, etc.\n• The following is a summary of components of IoT.\nPhysical Objects: Things\nSensors Sense the physical environment\nActuators Affect the physical environment\nVirtual Objects Electronic tickets, Agendas, Books, Wallets\nPeople Ex.: Humans can control the environment via mobile\napps\nServices Ex.: Cloud services – can be used to:\n• Process big data and turn it into\nvaluable information\n• Build and run innovative applications\n• Optimize business processes by\nintegrating device data.\nPlatforms Type of middleware used to connect IoT\ncomponents (objects, people, services, etc.) to IoT.\nProvide numerous functions:\n• Access to devices\n• Ensuring proper installation\/behavior\nof device\n• Data analytics\n• Interoperable connection to local\nnetwork, cloud or other devices.\nNetworks IoT components are tied together by networks,\nusing various wireless and wireline technologies,\nstandards, and protocols to provide pervasive\nconnectivity.\n55 Introduction To Computer Science\n• Pros: access to vast amount of resources, low cost or affordable communication,\netc\nCons: privacy issues\n• Cost of connectivity, low level of digital literacy, underdeveloped\ntelecommunication infrastructure, etc\nReferences:\n1. Internet Society. http:\/\/www.internetsociety.org\/internet\/what-internet\/\nhistory-internet\/brief-history-internet, Date accessed February, 2016.\n2. History of the Internet, http:\/\/ocw.metu.edu.tr\/pluginfile.php\/348\/mod_\nresource\/content\/0\/Lecture_1.pdf.\n3. 10 Most Common Uses of Internet, http:\/\/www.sooperarticles.com\/internet-\narticles\/10-most-common-uses-internet-19405.html, Date accessed,\nFebruary, 2016.\n4. Internet Society, https:\/\/www.internetsociety.org\/sites\/default\/files\/ISOC-\nIoT-Overview-20151014_0.pdf\n56 Unit 4: Software Applications\nUnit 4: Software Applications\nThis unit discusses the features of selected basic software applications such as word processors,\nspreadsheets and presentation software. It provides a description of basic features of the\nselected applications software aligned to the laboratory or practical sessions designed for the\nmodule.\nUnit Goals\nUpon completion of this unit the learner should be able to:\n1. Use the features of word processor applications;\n2. Use the features of spreadsheet applications; and\n3. Use the features of presentation software..\nKey Terms\nCell: a box formed by the intersection of a row\nand column in which you enter data to an Excel\nsheet.\nCell reference: the set of coordinates that a\ncell occupies on an Excel worksheet.\nLearning Activity: Word Processors\nIntroduction\nWord processing is an application program that enables users to create letters, reports,\nnewsletters, tables, form letters, brochures, and Web pages. Using this application program\nyou can insert pictures, tables, and charts to your documents. You can also check spelling and\ngrammar. It allows the user to organize and present text on a page or several pages. Text\norganized in this way is referred to as a document[2].\nA word processor allows one to:\n1. Enter text\n2. Edit text\n3. Insert\n57 Introduction To Computer Science\n4. Delete\n5. Copy\n6. move\n7. Save and Open text documents – Format text and the document\n8. Validate text\n9. spelling\n10. grammar\n11. thesaurus\n12. Add graphics\n13. pictures\n14. graphs\n15. equations\n16. objects from other applications\n17. Reuse documents\nWhat You see is What you Get(WYSIWYG)\nWord processors show you on the screen what you will see when the document is printed,\nwhich is also known as “What you see is what you get” (WYSIWYG).\nWord processors vary considerably, but all word processors support the following basic\nfeatures[1]:\n• Insert text: allows you to insert text anywhere in the document.\n• Delete text: allows you to erase characters, words, lines, or pages.\n• Cut and Paste: allows you to remove (cut) a section of text from one place in a\ndocument and insert (paste) it somewhere else.\n• Copy: allows you to duplicate a section of text.\n• Page size and Margins: Allows you to define various page sizes and margins,\nand the word processor will automatically readjust the text so that it fits.\n• Search and Replace: allows you to search for a particular word or phrase\noccurrence in a document. You can replace a word or a phrase with another\neverywhere that the word or phrase occurs in the document.\n• Word Wrap: the word wrap features automatically moves to the next line\nwhen you have filled one line with text, and it will readjust text if you change the\nmargins.\n• Print: allows you to send a document to a printer to get hardcopy.\n58 Unit 4: Software Applications\nFeatures of Standard Word Processors\nWord processors that support only these features (and maybe a few others) are called text\neditors. Most word processors, however, support additional features that enable you to\nmanipulate and format documents in more sophisticated ways. These more advanced word\nprocessors are sometimes called full-featured word processors. Full-featured word processors\nusually support the following features:\n• File management: many word processors contain file management capabilities\nthat allow you to create, delete, move, and search for files.\n• Font specifications: allows you to change fonts within a document. For\nexample, you can specify bold, italics, and underlining. Most word processors\nalso let you change the font size and even the typeface.\n• Footnotes and cross-references: automates the numbering and placement\nof footnotes and enables you to easily cross-reference other sections of the\ndocument.\n• Graphics graphics: allows you to embed illustrations and graphs into a\ndocument. Some word processors let you create the illustrations within the word\nprocessor; others let you insert an illustration produced by a different program.\n• Headers , Footers , and Page numbering: allows you to specify customized\nheaders and footers that the word processor will put at the top and bottom of\nevery page. The word processor automatically keeps track of page numbers so\nthat the correct number appears on each page.\n• Layout: allows you to specify different margins within a single document and to\nspecify various methods for indenting paragraphs.\n• Macros: A macro is a character or word that represents a series of keystrokes.\nThe keystrokes can represent text or commands. The ability to define macros\nallows you to save yourself a lot of time by replacing common combinations of\nkeystrokes.\n• Merges: allows you to merge text from one file into another file. This is\nparticularly useful for generating many files that have the same format but\ndifferent data. Generating mailing labels is the classic example of using merges.\n• Spell checker: a utility that allows you to check the spelling of words. It will\nhighlight any words that it does not recognize.\n• Tables of contents and indexes: allows you to automatically create a table of\ncontents and index based on special codes that you insert in the document.\n• Thesaurus: a built-in thesaurus that allows you to search for synonyms without\nleaving the word processor.\n• Windows: allows you to edit two or more documents at the same time. Each\ndocument appears in a separate window. This is particularly valuable when\nworking on a large project that consists of several different files.\n• WYSIWYG (what you see is what you get): with WYSIWYG, a document\nappears on the display screen exactly as it will look when printed.\n59 Introduction To Computer Science\nActivity Conclusion\nWord processing is an application program that enables users to create letters, reports,\nnewsletters, tables, form letters, brochures, and Web pages. Using this application program\nyou can insert pictures, tables, and charts to your documents. Word processors offer several\nfeatures that enable users to create a well-structured,formatted and good looking document.\nAssessment: Reflective Activities\n• Describe the basic features of word processors\n• Word processors offer file management activity, how?\n• What do you to merge several documents into one?\nAnswers:\n• Inserting text, editing text, deleting text, etc\n• They enable users to create, modify, delete,merge and copy files\n• Open one document, and position the cursor where the next document you want\nto appear, choose the appropriate command from the relevant menu and insert\nthe second document, repeat the steps as many as the number of documents you\nwant to merge.\n60 Unit 4: Software Applications\nLearning Activity: Spreadsheet\nIntroduction\nA spreadsheet consists of cells made of rows and columns. Each cell can hold a text, a number,\nor a mathematical formula[2]. A cell is referred to by column and row, e.g., the upper left cell is\ncell A1. The cell right below A1 is A2, etc.\nColumn width and row height can be adjusted by dragging the separation line between\ncolumns (or rows) to the desired size. See between column B and C below.\nFigure 1- Spreadsheet Screenshot( taken from http:\/\/www.mech.\nutah.edu\/~rusmeeha\/references\/SpreadSheetBasic.pdf )\nA spreadsheet allows one to:\n• Enter text\/number\/formula in a cell\n• Edit text\/number\/formula in a cell\n– Insert\n– Delete\n– Copy\n– Move\n• Save and Open spreadsheet – Format text\/number\/formula\nEntering data\nBefore carrying out most commands, you must first select the part of the worksheet you want\nto work with. You may select a single cell or a range of cells, but a formula will only be applied\nto one cell at a time. When you click the cell you want to select, it will be surrounded by a\nrectangular border. To select a range of cells, click at the first cell and drag the mouse pointer\nto the rest of the cells. Alternatively, click at the first cell, hold down the shift key, and click at\nthe last cell. All the cells between the two clicks will be selected.\n61 Introduction To Computer Science\nOne of the strips below the menu bar is the formula bar. It tells you which cell you are working\non and gives you space to enter your formula. The picture below shows the cell A2 being\nselected. The formula bar indicates that A2 is the cell the data will go into. The formula being\nentered into that cell is “1+1”. The result of that formula, 2, will be shown in that cell. Hit enter\nor click at the check mark if the formula is correct. Click the X to clear the formula you have just\nentered if you want to re-enter the formula.\nFigure 2- Spreadsheet Screenshot ( taken from http:\/\/www.mech.\nutah.edu\/~rusmeeha\/references\/SpreadSheetBasic.pdf )\nYou can enter text, a number, or a formula in any cell. Think of them as placeholders for your\ndata. Text and numbers can be typed in directly but formulae must start with an “=” sign. You\nenter a formula in the same way you enter a formula in a “normal” calculator (not HP). To enter\na more advanced mathematical function, go to the Insert menu and select Function… Select\nthe desired function, e.g., SIN(), SQRT(), PI(), etc. The function you selected will be pasted\ninto the formula bar.\nYou can use any combination of numbers and cell references in a formula. As in the picture\nbelow, to take a square root of the result of the formula in cell A2, enter the formula and\nindicate the cell where the spreadsheet should get the number from by clicking that cell or by\ntyping in the cell name directly in the “( )” part of the formula.\nA formula can be copied and pasted using the usual Copy and Paste commands so that you\ncan perform a similar operation on some other number without having to retype the formula.\nThe spreadsheet is smart enough to index the cell reference for you. For example, if you\nselect and copy cell B2 and then select and paste into cell B3 the formula in that cell will be\n“=SQRT(A3)”. It will operate on the cell A3 instead of A2. If you want to refer to the same\ncell after pasting the formula somewhere else, put “$” in front of the column and row number,\ne.g., $A$2, to prevent the program from indexing your cell reference.\n62 Unit 4: Software Applications\nFigure 3- Spreadsheet Screenshot ( taken from http:\/\/www.mech.\nutah.edu\/~rusmeeha\/references\/SpreadSheetBasic.pdf )\nBasic Commands\nThe following are basic commands that you need to know in order to work on spreadsheet\nenvironments.\nMenu Command Description\nEdit Undo Undo last command.\nPaste Special... enables you paste just the formula, format, or\nvalue of a copied cell\nDelete... Delete a cell, range of cells,\ncolumn, or row\nin the middle of a\nspreadsheet. Be careful\nwhen using Delete...\nFill Copy and paste the same\nformula across\nrows or down columns.\nInsert Chart... Insert a graph based on\nselected range of\ndata.\nFunction... Scrolling list of functions\nthat can be used.\n63 Introduction To Computer Science\nFormat Cell... Change the format of\nnumbers, fonts, etc,\ndisplayed on the screen.\nData Sort... Sorting a range of cells\nin ascending or\ndescending order.\nThere is also an online help available under Help menu.\nActivity Conclusion\nA spreadsheet consists of cells made of rows and columns. Each cell can hold a text, a number,\nor a mathematical formula. Before carrying out most commands, you must first select the part\nof the worksheet you want to work with. Spreadsheet software enables you to create a tabular\ndata that can be analyzed and represented in charts or as a table.\nAssessment: Reflective Activities\n• List out the basic statistical operations that spreadsheet program support\n• What is the difference between paste and paste special?\n• What key combinations do you use to select cells placed adjacently?\n• What key combinations do you use to select cells placed non-contiguosly?\nAnswers:\n• Average, variance, regression, etc\n• Using paste only enables you to paste a formula as formula, whereas paste\nspecial enables you to paste a formula as value\n• Shift + Click on the last cell\n• Ctrl + Click on the cell you want to select\n64 Unit 4: Software Applications\nLearning Activity: Presentation Software\nIntroduction\nBefore computers were commonplace, presenters usually had an easel with posters or\ndrawings to show any necessary graphics to the audience. In some cases the speaker would\nhave a slide projector with a carousel of individual slides to show photographs on a screen.\nToday, many software package suites contain a program designed to accompany the speaker\nwhen he makes a presentation. The specific presentation program in this suite of programs is\nusually (but not always) in the form of a slide show, much like the ones used in years past.\nThese presentation software programs make it simple and often fun to create a presentation for\nyour audience. They contain a text editor to add your written content, and abilities within the\nprogram to add charts and graphic images such as photographs, clip art or other objects to\nliven up your slide show and get your point across simply.\nPowerPoint is an exciting tool that assists in effectively presenting a summation of important\nideas to an audience. PowerPoint can often be intimidating to one who has never used the\nprogram. In reality, PowerPoint can be as simple or involved as the creator’s imagination,\nbut at its foundation PowerPoint is nothing more than giving life to an outline. In academic\nand professional levels a simple and clear PowerPoint presentation is most effective[3]. The\nfollowing is a screenshot of a PowerPoint presentation.\nFigure 4 PowerPoint Screenshot (http:\/\/www.homeandlearn.\nco.uk\/powerpoint\/powerpoint_p1s2.html)\n65 Introduction To Computer Science\nSteps to create a PowerPoint presentation:\n1. When you first open PowerPoint, a new presentation will open up. The\ndefault slide design is a white background with black lettering.\n2. To choose a new design background click on format from the toolbar, and\nthen select slide design. Then simply click on the desired design.\n3. Once you have selected the slide design, click in the placeholders to\nadd the title and subtitle of the presentation. If the PowerPoint is used to\nsupplement a paper, then use the title of the paper. If your paper does not\nhave a subtitle, then you can include the names of those who participated\nin the presentation.\n4. To create a new slide, click on the insert tab from the toolbar and then select\nnew slide. You can also click on the new slide tab located on the right side\nof the formatting toolbar.\n5. Continue this process until you have completed your presentation.\n6. If you need to delete a slide select edit from the toolbar and then select\ndelete slide. You can also move the mouse cursor over the slide you want\nto delete in the slide\/outline tab. Then right click on the slide, and select\ndelete slide.\n7. During the creation of the presentation, you can go back and forth between\nslides by clicking on the slide you want to view in the slide\/outline tab.\n8. To view a slideshow of your presentation, select slide show from the toolbar,\nand then select view show. To move between sides, click the mouse\nanywhere on the screen.\nThe above are the basic steps to create a PowerPoint presentation. There are other tools that\ncan be used such as, inserting pictures, transitions between slides, and music. However, music\nand sound effects are not generally acceptable for academic PowerPoint presentations.\nActivity Conclusion\nPowerPoint is an exciting tool that assists in effectively presenting a summation of important\nideas to an audience. It helps presentations simple and easy to follow while attracting the\nattention of the audience. In this learning activity you have been introduced to both basic and\nadvanced features of PowerPoint presentation tools.\n66 Unit 4: Software Applications\nActivity Details:\nCreate a PowerPoint slide based on the following requirements.\n1. Select a suitable design template and appropriate slide layouts,\n2. Graphics that can enhance your presentation may also be inserted. You can\nreplace standard bullet symbols with other graphics,\n3. Add animation effects to the bullet items,\n4. Add transition and appropriate sound effects, and\n5. Add a timing to automate your slide show.\nActivity Assessment Criteria: Checking the PowerPoint presentation created for\ncompliance to the requirements specified.\nLearning Activity: Creating a summary for the unit\nIntroduction\nIn this activity you are required to summarize the unit’s content with words not exceeding\n120. Just focus on the main elements discussed in the unit such as the features of the a word\nprocessors, spreadsheets and PowerPoint presentation.\nActivity Details\nSummarizing the whole idea of a content of several pages in a few words among other\nthings requires writing skills. In this activity you need to be more specific as well as brief in\nincorporating the most important elements of the unit’s content in the summary. You need to\nwrite them in your own words, copying the topics idea in a verbatim way is not allowed.\nActivity Assessment Criteria: Summary completeness and readability.\n67 Introduction To Computer Science\nUnit Assessment\nSummative Assessment for the Unit\nInstruction to Unit Assessment\nA solid understanding of the following items is a necessity, in case of doubts learners are\nadvised to go back to the specific sections where they feel is not confident enough on their\ngrasp of the notion(s).\n• The set of basic features that word processor applications offer,\n• The set of basic features that spreadsheet applications offer, and\n• The set of basic features that presentation software offer.\nAssessment\n6. What does a word processor program do?\n7. What does a spreadsheet program do?\n8. What does a presentation software do?\nGrading scheme:\nPreparing both subjective and objective questions related to the items mentioned above is\nrequired, the above questions are included as sample to aid in course module facilitators on\nhow to prepare unit assessment questions, and the unit assessment weight should not exceed\n10%.\nCourse Module Summary\nThe course module has provided you preliminary knowledge and basic skills in computer\ntechnology that are considered mandatory in today’s workplace.\nYou have been introduced to the hardware\/software components of the computer system, with\nemphasis on the physical and operational aspects of the computer. You have been introduced\nto the basic components of the Computer System (Software and Hardware), the general\nconstruction and relationship between the basic components, history of the Internet and\nselected software applications.\nThe module is the foundation for those who wish to pursue their studies in computer science\nand information technology and is a pre-requisite for the subsequent modules in the\nprogramme.\n68 Unit 4: Software Applications\nAnswers:\n1. Word processors are used for storing, manipulating, and formatting text\nentered from a keyboard and providing a printout.\n2. Spreadsheets are used for tabulating a data, performing arithmetic and\nstatistical computation, graphically representing data.\n3. They are used to assist in effectively presenting a summation of important\nideas to an audience.\nFinal Exam Rubric\nNO Unit Description Number of Weight(35 %)\nquestions\n1 Unit 1 General 4 essay questions 10%\nIntroduction to each weighing 2.5\nComputer Systems mark.\n2 Unit 2: Components 5 essay questions 15%\nof Computer System each weighing 3 mark.\n3 Unit 3: The Internet 2 essay questions 5%\neach weighing 2.5\nmark.\n4 Unit 4: Software 2 essay questions 5%\nApplications each weighing 2.5\nmark.\nReferences:\n1. http:\/\/www.webopedia.com\/TERM\/W\/word_processing.html, Date\naccessed February, 2016.\n2. http:\/\/www.mech.utah.edu\/~rusmeeha\/references\/SpreadSheetBasic.pdf.\n3. http:\/\/www.apollolibrary.com\/cwe\/pdfs\/powerpointtutorial.pdf\n69 Introduction To Computer Science\nManual for Laboratory Practices\nMicrosoft Windows Basics\nOperating system is one of the critical software that needs to be installed in a computer to\nmake it usable. It gives the framework upon which all other applications or programs run. It is\nprimarily is a computer resource manager in that it is responsible for managing the memory,\nCPU, I\/O devices and files .\nObjectives:\nUpon completion of this laboratory session the learner will be able to:\n1. Describe some of the basic functions of an operating system, and Windows\nin particular;\n2. Explain the parts of the Windows desktop environment;\n3. Use the Start menu to launch programs;\n4. Effectively use the Windows file and folder management features;and\n70 Manual for Laboratory Practices\nLaboratory Learning Activities: Practicing Windows Basics\nIn order to be able to perform various tasks such as saving files, printing documents, and\nstarting programs, a computer requires software called an operating system. Microsoft\nWindows is one of the most widely used operating system. Over the years there have been\nseveral versions of Microsoft Operating System in use such as Windows 3.1, Windows 95,\nWindows 98, Windows 2000, Windows XP, and Windows Vista, etc. Regardless of the version,\nthey all have the same basic functionality. The purpose of this hands-on lab is to provide\nan introduction to the Windows Operating System. Hands-on tasks will be identified by the\nsymbol. When a computer is powered on, you’ll hear some beeping as it does some hardware\nchecks, and then the operating system loads. A computer running the Windows Operating\nSystem may display a login screen, or it may show the desktop immediately, depending on the\nsetup.\nParts of the Windows Desktop:\nTurn on your computer and sign in if necessary in order to display the Windows desktop. An\nexample of the Windows desktop is shown in the figure below, Figure 1.1.\nFigure 5. Parts of Windows Desktop\nThe desktop shown in Figure 1.1 has icons on the left, the Taskbar on the bottom, and an open\nwindow, which contains a document. Icons are pictures that represent programs or files. There\nare icons on the desktop and on the Taskbar. The picture showing a blue sky is a wallpaper.\nAny digital picture can be used as wallpaper.\n• Look at your desktop. Identify the Taskbar and icons.\n71 Introduction To Computer Science\nManaging Files and Folders\nA file is a collection of numbers(binary digits) which have been written to your computer’s hard\ndrive. These numbers can be converted into a picture, a sound, text, or a set of instructions for\na program to perform certain actions. However these numbers( or the internal details on how\nfiles are stored inside a computer) are hidden to users and a file is perceived by users as just\na label which is not the case in reality. A clue to a file’s type is given by its Icon or by its file\nextension. There are innumerable file types, some of the common ones are represented here:\n• .bmp – a bitmap image\n• .doc – a Word document\n• .wav – a sound file\n• .ppt – animated slides\n• .txt – plain text\n• .xls – a spreadsheet\n• .dbf – a database file\n• A shortcut (note the arrow)\n• .exe – an application (a program)\nWindows allows you to view information about files in different ways.\nBy default if a file type is a known one, such as a Microsoft Word Document, Windows won’t\ndisplay its file extension. To view all file extensions click on Tools on the menu bar:\n• Various options can be configured.\n– e.g. Display compressed files and folders with alternate colours.\nTo display all file extensions:\nuntick the Hide file extensions for known file types box.\nFile extensions are best left alone. Opening a file with the wrong application can sometimes\ndamage the file. However you may at some stage need to change a file’s extension.\nFolders\nFolders are containers for anything on a computer including files and other folders. A path lists\nthe folders that have to be opened to get to the required file. Folders were called directories\non older Microsoft systems. As shown in the following figure, Figure 1.2, each of the yellow\nicon is a folder. They may contain files or other folders (known as subfolders) or both. There\nmay be many “nestings” of folders within folders.\n72 Manual for Laboratory Practices\nFigure 6. Folder hierarchy\nMoving and Copying Files and Folders\nTo move a file or folder:\n• either right click on its icon OR left click on the Edit menu on the toolbar.\n• Choose cut to move and copy to copy.\nAt this point the item has been placed onto a clipboard – an area of memory accessible from\nnearly any application in Windows.\nRight click (or open Edit in the toolbar) in an open destination folder and choose “Paste” (or\nuse drag and drop) .\nNote:\nWhen an attempt is made to move an item between volumes(separate partitions of a disk), it is\neffectively copied, and the original remains.\nCreating Files and Folders\nThis is fairly a very easy task, do the following:\n• Simply right-click on some empty space in any suitable folder or the desktop and\n• Click on new and when prompted type the name.\n73 Introduction To Computer Science\nWhich characters are used to name a file\/folder and which characters are not allowed to use for\nnaming a file\/folder?\nIt is possible to copy and move files using a method called drag and drop. Start by opening\nthe folder that contains the file or folder you want to move. Then, open the folder where you\nwant to move it to in a different window. Position the windows side by side on the desktop so\nthat you can see the contents of both.\nNext, drag the file or folder from the first folder to the second folder. That’s all there is to it.\nFigure 7. Copying or Moving via Drag and Drop\nAs illustrated in the figure, Figure 1.3 above, to copy or move a file, drag it from one window\nto another.\nWhen using the drag-and-drop method, you might notice that sometimes the file or folder is\ncopied, and at other times it’s moved. If you’re dragging an item between two folders that are\nstored on the same hard disk, then the item is moved so that two copies of the same file or\nfolder aren’t created in the same location. If you drag the item to a folder that’s in a different\nlocation (such as a network location) or to removable media like a CD, then the item is copied.\nCreating and Deleting Files\nThe most common way to create new files is by using a program. For example, you can create\na text document in a word-processing program or a movie file in a video-editing program.\nSome programs create a file as soon as you open them. When you open Microsoft Word, for\nexample, it starts with a blank page. This represents an empty (and unsaved) file. Start typing,\nand when you are ready to save your work, click the Save button . In the dialog box that\nappears, type a file name that will help you find the file again in the future, and then click Save.\nBy default, most programs save files in common folders like My Documents and My Pictures,\nwhich makes it easy to find the files again next time.\n74 Manual for Laboratory Practices\nWhen you no longer need a file, you can remove it from your computer to save space and\nto keep your computer from getting cluttered with unwanted files. To delete a file, open the\nfolder that contains the file, and then select the file. Press Delete on your keyboard and then,\nin the Delete File dialog box, click Yes\nWhen you delete a file, it’s temporarily stored in the Recycle Bin. Think of the Recycle Bin as a\nsafety net that allows you to recover files or folders that you might have accidentally deleted.\nOccasionally, you should empty the Recycle Bin to reclaim all of the hard disk space being\nused by your unwanted files.\n• How do you delete files permanently?\nOpening an Existing File\nTo open a file, double-click it. The file will usually open in the program that you used to create\nor change it. For example, a text file will open in your word-processing program.\nThat’s not always the case, though. Double-clicking a word file, for example, will usually open\nthe Microsoft Word program.\nTo open a file:\n• Double click the file, the file will open in the program\n• Right-click the file, click Open with, and then click the name of the program that\nyou want to use.\nFile and folder management exercises\n1. Open the windows explorer\n2. Observe the left and right pane of the windows explorer\n3. View the size and other attributes of files in the “My documents” folder\n4. How much is the used space of your computer hard disk?\n5. Create the following folders tree under the root directory\n6. Select three un adjacent files from desktop and copy them to the “Computer”\nfolder\n7. Move two adjacent pictures from “My pictures” to “Featuredphone” folder\n8. Move the “Featuredphone” folder to the “Hardware “ folder\n9. Delete the “Hardware” folder\n10. Send the “Exercises” folder to your flash disk or Memory stick(which is also\nknown as removable media).\n75 Introduction To Computer Science\n11. Create a shortcut for “My computer” and put it in the Quick Launch” bar.\n12. Rename the “Hardware” folder to “Gadgets”\n13. Change the attribute of “Exercises” folder to read only.\n14. Select a folder in your hard disk and show the file attributes such as name,\nsize , type and date modified\n15. Find the total number of files (including sub folders) found in c:\\My\nDocuments\nMicrosoft Word Basics\nMicrosoft Word is a word processing software package. You can use it to type letters, reports,\nand other documents. It gives you the ability to use your computer for desktop publishing.\nThis tutorial teaches Microsoft Word 2007 basics. Although this tutorial was created for the\ncomputer novice, because Microsoft Word 2007 is so different from previous versions of\nMicrosoft Word, even experienced users may find it useful.This lesson will introduce you to the\nWord window. You use this window to interact with Word.\nObjectives:\n1. Upon completion of this laboratory session the learner will be able to:\n2. Describe some of the basic functions of a word processor, and Microsoft\nWord in particular;\n3. Explain the features of Microsoft Word; and\n4. Effectively use both basic and advanced features of the program.\nGetting Familiar with Microsoft Word Environment\nMicrosoft Word is a word processing software package. You can use it to type letters, reports,\nand other documents. It gives you the ability to use your computer for desktop publishing.\nWhen you launch the Microsoft Word program, a window like the one below in figure, Figure\n2.1 will appear.\n76 Manual for Laboratory Practices\nFigure 8. Parts of the Microsoft Word Window\nThe Microsoft Office Button\nIn the upper-left corner of the Word window is the Microsoft Office button. When you click the\nbutton, a menu appears. You can use the menu to create a new file, open an existing file, save\na file, and perform many other tasks.\nThe Quick Access Toolbar\nNext to the Microsoft Office button is the Quick Access toolbar. The Quick Access toolbar\nprovides you with access to commands you frequently use. By default Save, Undo, and Redo\nappear on the Quick Access toolbar. You can use Save to save your file, Undo to rollback an\naction you have taken, and Redo to reapply an action you have rolled back.\nThe Title Bar\nNext to the Quick Access toolbar is the Title bar. The Title bar displays the title of the\ndocument on which you are currently working. Word names the first new document you open\nDocument1. As you open additional new documents, Word names them sequentially. When\nyou save your document, you assign the document a new name.\n77 Introduction To Computer Science\nThe Ribbon\nYou use commands to tell Microsoft Word what to do. In Microsoft Word, you use the Ribbon\nto issue commands. The Ribbon is located near the top of the screen, below the Quick Access\ntoolbar. At the top of the Ribbon are several tabs; clicking a tab displays several related\ncommand groups. Within each group are related command buttons. You click buttons to issue\ncommands or to access menus and dialog boxes. You may also find a dialog box launcher\nin the bottom-right corner of a group. Clicking the dialog box launcher gives you access to\nadditional commands via a dialog box.\nThe Ruler\nThe ruler is found below the Ribbon.\nYou can use the ruler to change the format of your document quickly. If your ruler is not visible,\nfollow the steps listed here:\na. Click the View tab to choose it.\nb. Click the checkbox next to Ruler in the Show\/Hide group. The ruler appears\nbelow the Ribbon.\n78 Manual for Laboratory Practices\nThe Text Area\nJust below the ruler is a large area called the text area. You type your document in the text\narea. The blinking vertical line in the upper-left corner of the text area is the cursor. It marks the\ninsertion point. As you type, your text displays at the cursor location. The horizontal line next\nto the cursor marks the end of the document.\nUnderstanding Document Views\nIn Word 2007, you can display your document in one of five views: Draft, Web Layout, Print\nLayout, Full Screen Reading, or Online Layout.\nDraft View\nDraft view is the most frequently used view. You use Draft view to quickly edit your document.\nWeb Layout\nWeb Layout view enables you to see your document as it would appear in a browser such as\nInternet Explorer.\nPrint Layout\nThe Print Layout view shows the document as it will look when it is printed.\nReading Layout\nReading Layout view formats your screen to make reading your document more comfortable.\nOutline View\nOutline view displays the document in outline form. You can display headings without the text.\nIf you move a heading, the accompanying text moves with it.\nYou should use Draft view for these lessons. Before moving ahead, make sure you are in Draft\nview:\n• Click the View tab.\n• Click Draft in the Document Views group. When the Draft option is selected it\nappears in a contrasting color.\nClick\nDuring the lessons that follow, you will be asked to “click” items and to choose tabs. When\nasked to click:\n• Point to the item.\n• Press your left mouse button once.\n79 Introduction To Computer Science\nIf you are asked to double-click an item:\n• Point to the item.\n• Quickly press your left mouse button twice.\nIf you are asked to right-click:\n• Point to the item.\n• Press your right mouse button.\nIf you are asked to choose a tab, click the tab.\nUnderstanding Nonprinting Characters\nCertain characters, called nonprinting characters, do not print and will not appear in your\nprinted document but do affect your document layout. You can elect to see these characters\non the screen as you type or you can elect to have them remain invisible. For these lessons,\nopt to see them onscreen. This table describes most of them:\nCharacter Denotes\nr A tab\nA space\n¶ The end of a\nparagraph\nHIDDEN Hidden text\nTo view nonprinting characters:\n• Choose the Home tab.\n• Click the Show\/Hide button in the Paragraph group . The Show\/Hide button\nappears in a contrasting color, when it is selected.\n80 Manual for Laboratory Practices\nCreate Sample Data and Select Text\nIf you type =rand() in your Word document and then press Enter, Word creates three\nparagraphs. You can use these paragraphs to practice what you learn. Throughout these\nlessons, you will be asked to select text. The following exercise teaches you how to create data\nand how to select data. You can select by using the arrow keys or by clicking and dragging.\nWhen using the arrow keys, use the up arrow to move up, the down arrow to move down, the\nleft arrow to move left, and the right arrow to move right. When using the mouse, press the left\nmouse button and then drag in the direction you want to move.\nEXERCISE 1\nCreate Sample Data\na. Type =rand().\nb. Press Enter. Three paragraphs appear in your document.\nSelect with the Shift and Arrow Keys\na. Place your cursor before the word “On” in the first paragraph.\nb. Press and hold down the Shift key, which serves as an “anchor” showing where\ntext you wish to select begins or ends.\nc. Press the right arrow key until the first line of text is highlighted.\nd. Press the down arrow key until the first paragraph is highlighted.\ne. Click anywhere outside the highlighted area to remove the highlighting.\nSelect with the Mouse\n1. Place your cursor before the word “You” in the second paragraph.\n2. Press and hold down the left mouse button.\n3. Drag the mouse until you have highlighted the second paragraph.\n4. Click anywhere outside the highlighted area to remove the highlighting.\n81 Introduction To Computer Science\nPlace the Cursor\nDuring the lessons, you will often be asked to place the cursor at a specific location (the\ninsertion point) on the screen. You place the cursor by moving the cursor to the specified\nlocation and pressing the left mouse button or by using the arrow keys to move to the\nspecified location.\nEXERCISE 2\nThe Arrow Keys\n• Use the down arrow key to move down your document.\n• Use the right arrow key to move to the right.\n• Use the up arrow key to move up.\n• Use the left arrow key to move to the left.\nCursor\n1. Move around your document by using you mouse and clicking in a variety\nof location.\n2. Click in a location and type. Note what happens.\nExecute Commands with Keyboard Shortcuts\nThere are many methods you can use to accomplish tasks when using Word. Generally, you\nchoose an option by clicking the option on the Ribbon. However, you can also use shortcut\nkeys. A key name followed by a plus and a letter means to hold down the key while pressing\nthe letter. For example, Ctrl+b means you should hold down the Ctrl key while pressing “b.” A\nshorthand notation of the above would read as follows:\nPress Ctrl+b\nStart a New Paragraph\nWhen you type in Microsoft Word, you do not need to press a key to move to a new line. To\nstart a new paragraph, press the Enter key.\nExit Word\nYou have completed Lesson One. Typically, you save your work before exiting.\n82 Manual for Laboratory Practices\nEXERCISE 3\nClose and Save—Windows Vista\n– Click the Microsoft Office button. A menu appears.\n– Click Exit Word, which you can find in the bottom-right corner.\n• You are prompted: “Do you want to save changes to Document1?” To save your\nchanges, click Yes. Otherwise, click No. If you click Yes, the Save As dialog box\nappears.\n83 Introduction To Computer Science\n1. Move to the correct folder.\n2. Name your file by typing Lesson One.doc in the File Name field.\n3. Click Save. Word saves your file.\nClose and Save\nI. Click the Microsoft Office button. A menu appears.\nII. Click Exit Word, which is in the bottom-right corner.\nIII. You will be prompted: “Do you want to save changes to Document1?” To\nsave your changes, click Yes. Otherwise, click No. If you click Yes, the Save\nAs dialog box appears.\nIV. Specify the correct folder in the Save In box.\nV. Name your file by typing Lesson One.doc in the File Name field.\nVI. Click Save. Word saves your file.\n84 Manual for Laboratory Practices\nThe Vertical and Horizontal and Vertical Scroll Bars\nThe vertical and horizontal scroll bars enable you to move up, down, and across your window\nsimply by dragging the icon located on the scroll bar. The vertical scroll bar is located along\nthe right side of the screen. The horizontal scroll bar is located just above the status bar. To\nmove up and down your document, click and drag the vertical scroll bar up and down. To\nmove back and forth across your document, click and drag the horizontal scroll bar back and\nforth. You won’t see a horizontal scroll bar if the width of your document fits on your screen.\nThe Status Bar\nThe Status bar appears at the very bottom of your window and provides such information as\nthe current page and the number of words in your document. You can change what displays on\nthe Status bar by right-clicking on the Status bar and selecting the options you want from the\nCustomize Status Bar menu. You click a menu item to select it. You clic\nk it again to deselect it. A check mark next to an item means it is selected.\nMicrosoft Word Basic Features\nOpen a File\nWhen you do not have time to complete your work or when you finish your work, you can save\nand close your file. After saving a file, you can later open it to revise or finish it. You learned\nhow to save a file in Lesson 2. In the exercise that follows, you learn how to open the file you\nsaved.\n85 Introduction To Computer Science\nEXERCISE 1\nOpening a Word document or File\n– Launch the Microsoft Word program.\n– Click the Microsoft Office button. A menu appears.\n– Click Open. The Open dialog box appears.\n– Locate the folder in which you saved the file and select the file you want\nto open.\n– Click Open.\nCut and Paste\nYou can use Word’s Cut feature to remove information from a document. The you can use the\nPaste feature to place the information you cut anywhere in the same or another document. In\nother words, you can move information from one place in a document to another place in the\nsame or different document by using the Cut and Paste features. The Office Clipboard is a\nstorage area. When you cut, Word stores the data you cut on the Clipboard. You can paste the\ninformation that is stored on the Clipboard as often as you like.\nCopy and Paste\nIn Microsoft Word, you can copy information from one area of a document and place the\ninformation you copied anywhere in the same or another document. In other words, after you\ntype information into a document, if you want to place the same information somewhere else,\nyou do not have to retype the information. You simple copy it and then paste it in the new\nlocation. As with cut data, Word stores copied data on the Clipboard.\nUse the Clipboard\nAs you cut or copy, Word can store the information you have cut or copied on the Clipboard in\na hierarchy. Then each time you cut or copy, the data you just cut or copied moves to the top\nof the Clipboard hierarchy and the data previously at the top moves down one level. When you\nchoose Paste, the item at the top of the hierarchy is the item Word pastes into your document.\nThe Clipboard can store up to 24 items. You can paste any item on the Clipboard into your\ndocument by placing your cursor at the insertion point, displaying the Clipboard pane, and\nthen clicking the item.\nThe Clipboard pane includes an Options button. You can click the Options button to set the\nClipboard options described in the following table.\n86 Manual for Laboratory Practices\nOption Description\nShow Office Clipboard Shows the Clipboard automatically\nAutomatically when you copy items.\nShow Office Clipboard When Shows the Clipboard when you\nCtrl+c Pressed Twice press Ctrl+c twice.\nCollect Without Showing Copies to the Clipboard without\nOffice Clipboard displaying the Clipboard pane.\nShow Office Clipboard Icon on Displays the Clipboard icon on your\nTaskbar system taskbar.\nShow Status Near Taskbar Displays the number of items\nWhen Copying copied on the taskbar when\ncopying.\nUse Spell Check\nWord checks your spelling and grammar as you type. Spelling errors display with a red wavy\nline under the word. Grammar errors display with a green wavy line under the error. In Word,\nyou can use the Review tab’s Spelling & Grammar button to initiate a spell and grammar check\nof your document.\nFind and Replace\nIf you need to find a particular word or phrase in your document, you can use the Find\ncommand. This command is especially useful when you are working with large files. If you want\nto search the entire document, simply execute the Find command. If you want to limit your\nsearch to a selected area, select that area and then execute the Find command. After you find\nthe word or phrase you are searching for, you can replace it with new text by executing the\nReplace command.\nFormatting Paragraphs and Applying Styles\nWhen you type information into Microsoft Word, each time you press the Enter key it creates\na new paragraph. You can format paragraphs. For example, you can indent the first line of a\nparagraph, you can set the amount of space that separates paragraphs, and you can align a\nparagraph left, right, center, or flush with both margins. Styles are a set of formats you can\nquickly apply to a paragraph. For example, by applying a style, you can set the font, set the\nfont size, and align a paragraph all at once.\n87 Introduction To Computer Science\nAdd Space Before or After Paragraphs\nWhen creating a document, space is often used to clearly identify where each paragraph\nbegins and ends. By default, Word may place slightly more space between paragraphs than\nit does between lines in a paragraph. You can increase or decrease the amount of space that\nappears before and after paragraphs by entering amounts in the Before and After fields in\nthe Paragraph section of the Page Layout tab. Use the up arrows next to the Before and After\nfields to increase the amount of space before or after each paragraph; use the down arrows to\ndecrease the amount of space before or after each paragraph.\nChange Line Spacing\nLine spacing sets the amount of space between lines within a paragraph. The spacing for each\nline is set to accommodate the largest font on that line. If the lines include smaller fonts, there\nwill appear to be extra space between lines where the smaller fonts are located. At 1.5, the line\nspacing is set to one-and-a-half times the single-space amount. At 2.0, the line spacing is set\nto two times the single-space amount (double space).\nCreate a First-Line Indent\nSome people and organizations delineate the start of a new paragraph by indenting the first\nline. If you want to indent the first line of your paragraphs, you can use the Paragraph dialog\nbox to set the amount by which you want to indent. In the Special Field of the Paragraph\ndialog box, you tell Word you want to indent the first line by choosing First Line from the menu\noptions. In the By field, you tell Word the amount, in inches by which you want to indent.\nIndent Paragraphs\nIndentation allows you to indent your paragraph from the left and\/or right margin. You may\nfind this necessary when you are quoting a large block of text.\nAlign Paragraphs\nMicrosoft Word gives you a choice of several types of alignments. Left-aligned text is flush with\nthe left margin of your document and is the default setting. Right-aligned text is flush with the\nright margin of your document, centered text is centered between the left and right margins,\nand Justified text is flush with both the left and right margins.\nApply a Style\nYou can see of all the styles available to you in the style set by clicking the launcher in the\nStyles group and opening the Styles pane. You can leave the Styles pane open and available\nfor use by docking it. To dock the Styles pane, click the top of the pane and drag it to the left\nor right edge of the Word window.\nYou do not need to select an entire paragraph to apply a style. If the cursor is anywhere in the\nparagraph, when you click on the style, Word formats the entire paragraph.\n88 Manual for Laboratory Practices\nEXERCISE\nApply the Title Style\n1. Choose the Home tab.\n2. Click the launcher in the Styles Group. The Styles pane appears. You can\ndrag it to the side of the Word window to dock it. To close the Styles pane,\nclick the Close button in the upper right corner of the pane .\n3. Click anywhere in the paragraph “Single-Parent Family—Career Help.”\n4. Click Title in the Styles pane. Word 2007 applies the Title style to the\nparagraph.\nHeadings and subheadings mark major topics within your document. With Microsoft Word, you\ncan easily format the headings and subheadings in your document.\nApply Headings\n• Click anywhere in the paragraph\n• In the Style box, click Heading 1. Word reformats the paragraph.\n• Repeat steps 1 and 2 as required\nApply Subheadings\n• Click anywhere in the paragraph\n• In the Style box, click Heading 2. Word reformats the paragraph.\n• Repeat steps 1 and 2 as required\n89 Introduction To Computer Science\nSpreadsheet- Microsoft Excel Basics\nGetting Started\nWhen you open Excel, a screen or window of the following screen will be displayed.\nFigure 9. A Screenshot of Microsoft Excel Window\nAs can been seen in the above figure, Figure 3.1, the Excel Window has five important areas.\n• Quick Access Toolbar: This is a place where all the important tools can be\nplaced. When you start Excel for the very first time, it has only 3 icons (Save,\nUndo, Redo). But you can add any feature of Excel to to Quick Access Toolbar so\nthat you can easily access it from anywhere (hence the name).\n• Ribbon: Ribbon is like an expanded menu. It depicts all the features of Excel in\neasy to understand form. Since Excel has 1000s of features, they are grouped into\nseveral ribbons. The most important ribbons are – Home, Insert, Formulas, Page\nLayout & Data.\n• Formula Bar: This is where any calculations or formulas you write will appear.\nYou will understand the relevance of it once you start building formulas.\n• Spreadsheet Grid: This is where all your numbers, data, charts & drawings will\ngo. Each Excel file can contain several sheets. But the spreadsheet grid shows\nfew rows & columns of active spreadsheet. To see more rows or columns you can\nuse the scroll bars to the left or at bottom. If you want to access other sheets,\njust click on the sheet name (or use the shortcut CTRL+Page Up or CTRL+Page\nDown).\n• Status bar: This tells us what is going on with Excel at any time. You can tell if\nExcel is doing a calculation or calculating using a formula, creating a pivot report\nor recording a macro by just looking at the status bar. The status bar also shows\nquick summaries of selected cells (count, sum, average, minimum or maximum\nvalues). You can change this by right clicking on it and choosing which summaries\nto show.\n90 Manual for Laboratory Practices\nCreating a New Worksheet\nThree new, blank sheets always open when you start Microsoft Excel. But suppose that you\nwant start another new worksheet while you are working on another worksheet, or you closed\nalready opened worksheet and want to start a new worksheet. Here are the steps to create a\nnew worksheet:\nStep (1) : Right Click the Sheet Name and select Insert option.\nFigure 10. New Excel Window with Three New Sheets\nStep (2) : Now you’ll see the Insert dialog with select Worksheet option as\nselected from the general tab. Click Ok button\n91 Introduction To Computer Science\nFigure 11. Insert Sheet Dialog\nNow you should have your blank sheet as shown below ready to start typing your text.\nFigure 12. Newly Inserted Sheet\nYou can use a shortcut to create a blank sheet anytime. Try using Shift+F11 keys and you will\nsee a new blank sheet similar to above sheet is opened.\n92 Manual for Laboratory Practices\nEntering Data or Formula in a Worksheet\nIn Microsoft Excel there are 1048576*16384 cells.MS Excel cell can have Text, Numeric value or\nformulas. MS Excel cell can have maximum of 32000 characters.\nTo enter data, just activate the cell and type text or number and press enter or Navigation key.\nFigure 13 Entering Data in a Cell\nTo enter formula, go to formula bar, enter the formula and then press enter or navigation key.\nSee the screenshot below for a better understanding.\nFigure 14 Entering Formula in a Cell\nSimilarly, for modifying the content of a cell just activate the cell, enter a new value and then\npress enter or navigation key to see changes.\n93 Introduction To Computer Science\nFormatting in Microsoft Excel\nFormatting a Cell\nA Cell can hold different types of data like Numbers, Currency, Dates, etc..\nRight click on the cell you want to edit:\nFigure 15 Formatting a Cell\nCell Formats that can be applied on a cell:\n• General: This is the default cell format of Cell.\n• Number: This displays cell as number with separator\n• Currency: This displays cell as currency i.e with currency sign.\n• Accounting: Similar to Currency used for accounting purpose.\n• Date: Various date formats are available under this like 17-09-2013,\n17th-Sep-2013, etc\n• Time: Various Time formats are available under this like 1.30PM, 13.30, etc\n• Percentage: This displays cell as percentage with decimal places like 50.00%\n• Fraction: This displays cell as fraction like 1\/4 ,1\/2 etc\n• Scientific: This displays cell as exponential like 5.6E+01\n• Text: This displays cell as normal text.\n• Special: This is special formats of cell like Zip code, Phone Number\n• Custom: You can use custom format by using this.\nFormatting a Worksheet\nMargins are the unprinted areas along the sides, top, and bottom of a printed page. All printed\npages in MS Excel have the same margins. You can’t specify different margins for different\npages.\nYou can set margins by various ways as below\n94 Manual for Laboratory Practices\n• Choose Page Layout » Page Setup » Margins drop-down list, you can\nselect Normal, Wide, Narrow, or the custom Setting.\nFigure 16 Formatting a Worksheet Margin\nThese options are also available when you choose File » Print\nFigure 17. Formatting a Worksheet Margin\nIf none of these settings does the job, choose Custom Margins to display the Margins tab of\nthe Page Setup dialog box, as shown below.\nCenter on Page\nBy default, Excel aligns the printed page at the top and left margins. If you want the output to\nbe centered vertically or horizontally, select the appropriate check box in the Center on Page\nsection of the Margins tab as shown in above screenshot.\n95 Introduction To Computer Science\nFigure 18. Formatting a Worksheet Margin\nWorking with Formula\nFormulas are the lifeblood of worksheets.Without formula worksheet will be just simple tabular\nrepresentation of data. A formula consists of special code which is entered into a cell. It\nperforms some calculations and returns a result, which is displayed in the cell.\nFormulas use a variety of operators and worksheet functions to work with values and text. The\nvalues and text used in formulas can be located in other cells, which makes changing data easy\nand gives worksheets their dynamic nature. For example, you can quickly change the data in a\nworksheet and formulas works.\nElements of Formulas:\nA formula can consist of any of these elements:\n• Mathematical operators, such as +(for addition) and *(for multiplication)\nCreating Formula:\nFor creating formula you need to type in Formula Bar.Formula begins with ‘=’ sign. When\nbuilding formulas manually, you can either type in the cell addresses or you can point to\nthem in the worksheet. Using the Pointing method to supply the cell addresses for formulas\nis often easier and more powerful method of formula building. When you are using built-in\nfunctions, you click the cell or drag through the cell range that you want used when defining\nthe function’s arguments in the Function Arguments dialog box.See below screenshot.\n96 Manual for Laboratory Practices\nFigure 19. Creating a Formula\nAs soon as you complete a formula entry, Excel calculates the result, which is then displayed\ninside the cell within the worksheet (the contents of the formula, however, continue to be\nvisible on the Formula bar anytime the cell is active). If you make an error in the formula that\nprevents Excel from being able to calculate the formula at all, Excel displays an Alert dialog\nbox suggesting how to fix the problem.\nAdvanced Features\nCharts\nA chart is a visual representation of numeric values. Charts (also known as graphs) have been\nan integral part of spreadsheets. Charts generated by early spreadsheet products were quite\ncrude, but they have improved significantly over the years.\nExcel provides you with the tools to create a wide variety of highly customizable charts.\nDisplaying data in a well-conceived chart can make your numbers more understandable.\nBecause a chart presents a picture, charts are particularly useful for summarizing a series of\nnumbers and their interrelationships.\n97 Introduction To Computer Science\nTypes of Charts\nThere are various chart types available in MS Excel as shown in below screenshot.\nFigure 20. Creating a Chart\n• Column: Column chart shows data changes over a period of time or illustrates\ncomparisons among items.\n• Bar: A bar chart illustrates comparisons among individual items.\n• Pie: A pie chart shows the size of items that make up a data series, proportional\nto the sum of the items. It always shows only one data series and is useful when\nyou want to emphasize a significant element in the data.\n• Line: A line chart shows trends in data at equal intervals.\n• Area: An area chart emphasizes the magnitude of change over time.\n• X Y Scatter: An xy (scatter) chart shows the relationships among the numeric\nvalues in several data series, or plots two groups of numbers as one series of xy\ncoordinates.\n• Stock: This chart type is most often used for stock price data, but can also be\nused for scientific data (for example, to indicate temperature changes).\n• Surface: A surface chart is useful when you want to find optimum combinations\nbetween two sets of data. As in a topographic map, colors and patterns indicate\nareas that are in the same range of values.\n• Doughnut: Like a pie chart, a doughnut chart shows the relationship of parts to\na whole; however, it can contain more than one data series.\n• Bubble: Data that is arranged in columns on a worksheet so that x values are\nlisted in the first column and corresponding y values and bubble size values are\nlisted in adjacent columns, can be plotted in a bubble chart.\n• Radar: A radar chart compares the aggregate values of a number of data series.\n98 Manual for Laboratory Practices\nCreating Charts\nTo create charts for the data by below steps.\n• Select the data for which you want to create chart.\n• Choose Insert Tab » Select the chart or click on the Chart group to see\nvarious chart types.\n• Select the chart of your choice and click OK to generate the chart.\nFigure 21 Creating a Chart\nEditing Chart\nYou can edit the chart at any time after you have created it.\n• You can select the different data for chart input with Right click on chart »\nSelect data Selecting new data will generate the chart as per new data as\nshown in the below screenshot.\n99 IntrUodniut c6ti.o Tnh Teo N Ceotwmoprukt Sero Sciceiteyn ce\nFigure 22 Editing a Chart\n• You can change the X axis of the chart by giving different input to X-axis of chart.\n• You can change the Y axis of chart by giving different input to Y-axis of chart.\nMicrosoft PowerPoint Presentation Basics\nMicrosoft PowerPoint is a presentation tool that supports text, shapes, graphics, pictures\nand multimedia along with integration with other Microsoft Office products like Excel. In this\nlesson learners are expected to develop their skill in the use of Microsoft Word and Excels,\nand Microsoft PowerPoint environment in many ways is similar to the two other Microsoft\nOffice products. Thus those essential skills such as creating text and embedding objects are\nnot discussed here with the view it will be a repetition, and in light of that in this section only\nselected topics are covered.\nGetting Started\nTo launch Microsoft PowerPoint, just select and click on the commands in order:\nStart Button>> All Programs>>Microsoft Office>>Microsoft\nPowerPoint(with the version appended)\nThis will launch the Microsoft PowerPoint application and a window with the following look will\nbe displayed.\n100 Manual for Laboratory Practices\nFigure 23 Microsoft PowerPoint Window\nCreating Presentation\nPowerPoint offers a host to tools that will aid you in creating a presentation. These tools are\norganised logically into various ribbons in PowerPoint. The table below describes the various\ncommands you can access from different menus.\nFigure 24 Parts of Microsoft PowerPoint Window\n101 Introduction To Computer Science\nMenu Category Ribbon Commands\nHome Clipboard functions, manipulating slides, fonts\nparagraph settings, drawing objects and editing\nfunctions.\nInsert Insert tables, pictures, images, shapes, charts,\nspecial texts, multimedia and symbols.\nDesign Slide setup, slide orientation, presentation\nthemes and background.\nTransitions Commands related to slide transitions.\nAnimations Commands related to animation within the\nindividual slides.\nSlide Show Commands related to slide show set up and\npreviews.\nReview Proofing content, language selection, comments\nand comparing presentations.\nView Commands related to presentation views, Master\nslides, color settings and window arrangements.\nWorking with Multimedia\nPowerPoint supports multiple content types including images or pictures. With regards to\npictures PowerPoint classifies them into two categories:\n• Picture: Images and photos that are available on your computer or hard drive\nClip Art: Online picture collection that you can search from the clip art\nSidebar\nAlthough their sources are different, both these types can be added and edited in similar\nfashion. Given below are the steps to add picture to a slide.\nStep (1): Go to Images group in the Insert ribbon\n102 Manual for Laboratory Practices\nFigure 25 Adding Multimedia Contents to a PowerPoint\nStep (2): Click on Picture to open the Insert Picture dialog and\nadd a picture to the slide.\nStep (3): In this dialog, you have three sections: in the left\nmost you can browse the folders, the center section shows the\nsubfolders and files in the selected folder and the right most\nsection shows a preview of the selected image\nFigure 26 Add Picture Dialog\nStep (4): Select the image you want and click Open to add the\npicture to the slide.\n103 Introduction To Computer Science\nStep (5): To add online pictures, click on Clip Art and search for\nkeywords in the Clip Art sidebar\nFigure 27 Adding Online Picture\nStep (6): Once you have the clipart you want to use, double\nclick on the image to add it to the slide.\nFigure 28 Picture added from Online Sources\n104 Manual for Laboratory Practices\nSharing Presentation\nAlthough PowerPoint is used to create presentations, it supports various file types when it\ncomes to saving the content. With a host of operating systems and Office versions available in\nthe market, using a pdf file type can be a great way of ensuring everyone sees the same slides.\nGiven below are the steps to save a presentation as a pdf file.\nStep (1): Go to the Backstage view under the File tab.\nFigure 29 Sharing Presentation\nStep (2): Click on Save As to open the Save As dialog.\nStep (3): Select the file type as .pdf from the list of supported\nfile types.\nFigure 30 Selecting File Type\n105 Introduction To Computer Science\nStep (4): Assign a proper name to the file and click Save.\nFigure 31 Saving the File in PDF format\nStep (5): The .pdf file is created in the specified location.\nFigure 4.7 Creating the File in PDF Format\n106 "}