{"text":"Database System : Concepts and Design\nDatabase System : Concepts and Design\nMr.Bhojaraju G.*\nDr.M.M.Koganurmath**\n1. Introduction to Database :\nAn organization must have accurate and reliable data for effective decision\nmaking. To this end, the organization maintains records on the various facets maintaining\nrelationships among them. Such related data are called a database. A database system is\nan integrated collection of related files, along with details of the interpretation of the data\ncontained therein. Basically, database system is nothing more than a computer-based\nrecord keeping system i.e. a system whose overall purpose is to record and maintain\ninformation\/data.\nA database management system (DBMS) is a software system that allows access\nto data contained in a database. The objective of the DBMS is to provide a convenient\nand effective method of defining, storing and retrieving the information contained in the\ndatabase. The DBMS interfaces with the application programs, so that the data contained\nin the database can be used by multiple applications and users. In addition, the DBMS\nexerts centralized control of the database, prevents fraudulent or unauthorized users from\naccessing the data, and ensures the privacy of the data.\nGenerally a database is an organized collection of related information. The\norganized information or database serves as a base from which desired information can\nbe retrieved or decision made by further recognizing or processing the data. People use\nseveral databases in their day-to-day life. Dictionary, Telephone directory, Library\ncatalog, etc are example for databases where the entries are arranged according to\nalphabetical or classified order.\nThe term 'DATA' can be defined as the value of an attribute of an entity. Any\ncollection of related data items of entities having the same attributes may be referred to as\na 'DATABASE'. Mere collection of data does not make it a database; the way it is\norganized for effective and efficient use makes it a database.\nDatabase technology has been described as \"one of the most rapidly growing areas\nof computer and information science\". It is emerged in the late Sixties as a result of\ncombination of various circumstances. There was a growing demand among users for\nmore information to be provided by the computer relating to the day-to-day running of\nthe organization as well as information for planning and control purposes. The\ntechnology that emerged to process data of various kinds is grossly termed as\n'DATABASE MANAGEMENT TECHNOLOGY' and the resulting software are\nknown as 'DATABASE MANAGEMENT SYSTEM' (DBMS) which they manage a\ncomputer stored database or collection of data.\n* Librarian , Fr.C.Rodrigues Institute of Technology, Sector 9A,Vashi, Navi Mumbai - 400 703.\n**Librarian, Tata Institute of Social Sciences, Deonar, Mumbai – 400 088.\n2 Database System : Concepts and Design\n1.1 Meaning and Definition of Database :\nAn entity may be concrete as person or book, or it may be abstract such as a loan\nor a holiday or a concept. Entities are the basic units of objects which can have concrete\nexistence or constitute ideas or concepts. An entity set is a set of entities of the same type\nthat share the same properties or attributes .\nAn entity is represented by set of attributes. An attribute is also referred as data\nitem, data element , data field, etc. Attributes are descriptive properties possessed by each\nmember of an entity set. A groping of related entities becomes an entity set.\nFor ex : In a library environment,\nEntity Set -Catalogue -\nEntity -of Books, Journals, AV-Materials, etc\nAttributes - contains Author, Title, Imprint, Accn. No., ISBN, etc.\nThe word 'DATA' means a fact or more specially a value of attribute of an entity.\nAn entity in general, may be an object, idea, event, condition or situation. A set of\nattributes describes an entity. Information in a form which can be processed by a raw\ncomputer is called data. Data are raw material of information.\nThe term 'BASE' means the support, foundation or key ingredient of anything.\nTherefore base supports data.\nA 'DATABASE' can be conceived as a system whose base, whose key concept, is\nsimply a particular way of handling data. In other words, a database is nothing more than\na computer-based record keeping. The objective of database is to record and maintain\ninformation. The primary function of the database is the service and support of\ninformation system which satisfies cost.\nIn short, \" A database is an organized collection of related information stored with\nminimum redundancy, in a manner that makes them accessible for multiple application\".\nDefinition :\n1. Prakash Naveen : \"Database is a mechanized shared formally defined and central\ncollection of data used in an organization\".\n2. J.M.Martin : \" Database is a collection of inter-related data stored together without\nharmful or unnecessary redundancy to serve multiple application\".\n3. Mac-Millan dictionary of Information Technology : defines a database as a \" a\ncollection of inter-related data stored so that it may be accessed by authorized users with\nsimple user-friendly dialogues\".\n1.2 Functions of Database :\nThe general theme behind a database, is to handle information as an integrated whole.\nThe general objective is to make information access easy, quick, inexpensive and flexible\nfor the user.\n Controlled redundancy : Redundant data occupies space and therefore is wasteful.\nBy controlled redundancy, system performance is improved.\n User-friendly (i.e. ease to learning and use) : A major feature of a user-friendly\ndatabase package is how easy it is to learn and use.\n3 Database System : Concepts and Design\n Data independence : means it allows for changes at one level of the database without\naffecting the other levels i.e. changing hardware and storage procedures or adding\nnew data without having to rewrite application program.\n Economy (i.e. more information at low cost) : Using, storing and modifying data at\nlow cost are important.\n Accuracy and integrity : Even if redundancy is eliminated, however, the database\nmay still contain incorrect data. Centralized control of the database helps in avoiding\nthese situation. The accuracy of a database ensures that data quality and content\nremain constant. Integrity controls detect data inaccuracies where they occur.\n Recovery from failure : With multi-user access to a database, the system must\nrecover quickly after it is down with no loss of transactions. It helps to maintain data\naccuracy and integrity.\n Privacy and Security : For data to remain private, security measures must be taken\nto prevent unauthorized access i.e. complete jurisdiction over the operational data.\nDBMS ensures proper security through centralized control.\n Performance : It emphasizes response time to inquiries suitable to the use of the data\ndepends on the nature the user-database dialogue.\n Database retrieval, analysis, storage :.It facilitates Database retrieval, analysis and\nstorage.\n Compatibility : Usefulness i.e. hardware\/software can work with different\ncomputers.\n Concurrency control : is a feature that allows simultaneous access to a database,\nwhile preserving data integrity.\n Support : Support of complex file structure and access path. Ex : MARC\n Data Sharing : A database allows sharing of data under its control by any number of\nusers.\n Standards can be enforced : Standardizing stored data formats is particularly\ndesirable as an aid to data interchange between systems.\n1.3 Types of Databases :\nDatabase is considered as a central pool of data which can be shared by a\ncommunity of users. There are three yard sticks to determine the nature of data we can\ndeal with. They are :\na. Whether data is free of format or whether it is formatted.\nb. Whether definition of data is of the same size as data itself.\nc. Whether the data is active or passive.\nWhether these yard sticks are applied to data. We can classify database into four kinds\nwhich are\n1.3.1 Bibliographic Databases\n1.3.2 Knowledge Databases\n1.3.3 Graphic-Oriented Databases\n1.3.4 Decision-making Databases\n4 Database System : Concepts and Design\n1.3.1 Bibliographic Databases : have data which is free of format (unformatted data).\nThey are composed of textual data which, by it's very nature, displays little or no format.\nSuch databases are often used in Library and information system. Here data could be\ncomposed of abstracts of books and such documents with key words and key phrases.\nThrough the abstract, one can determine the document is of interest or not. Bibliographic\ndatabase contains descriptive information about documents, titles, authors, Journal name,\nVolume and Number, date, keywords, abstract, etc.\n1.3.2 Knowledge Databases : are used in Artificial Intelligence applications. The data\ncontained in these is discrete and formatted. In these there are typically many kinds of\ndata, with only a very few occurrence of each kind. Such databases having the size of the\ndata is as large as the definition of the data.\n1.3.3 Graphic-Oriented Databases : could possibly used in Computer-Aided Design\n(CAD). The data in such database is characterized as being active. This means that data is\na procedure capable of being executed. Any modification can be made in data, as the\nabove 1 and 2 cannot be executed in a computer.\nEx : Computer-Aided Design (CAD)\nComputer-Aided Learning (CAL)\nComputer-Aided Instruction (CAI)\n1.3.4 Decision-making Databases : are used in corporate management and allied\nadministrative tasks. Using data contained in these databases, one could handle problem\nlike resource planning and sales forecasting. These databases are characterized by the fact\nand their data contents are :\na. Formatted\nb. Far longer than description\nc. Passive\nThese Decision-making databases are often referred to as just databases.\nDepending upon the kind of databases being handled Database Management Systems\n(DBMS) can be classified as for example : Bibliographic Database Management Systems,\nKnowledge Database Management Systems and so on.\n1.4 Concept of Data Structure :\nData are structured according to the Data model. A group of data elements handled\nas a unit. Ex : Book details - is a data structure consisting of the data elements - Author\nname, Title, Publisher's name, ISBN and Quantity.\nThere are several different approaches to analyzing the logical structure of data in\ncomplex databases. Although all DBMS's have a common approach to data management,\nthey differ in the way : the structure of data.\nThere are three types of data structure, viz\n1.4.1 List Structure\n1.4.2 Tree \/ Hierarchical Structure\n1.4.3 Network Structure\n5 Database System : Concepts and Design\n1.4.1 List Structure : A list is nothing morethan a special data structure made up of data\nrecord where the Nth record is related (N-1) and (N-2) simply because of positioning.\nThis brings one-to-one relationship. This structure is illustrated as below :\nFig. Simple List Structure\n1.4.2 Tree \/ Hierarchical Structure : A tree structure is a non-linear multilevel\nhierarchical structure in which each node may be related to N-nodes at any level below it.\nBut to only one node above it in the hierarchy.\nThe entry is from the top and the direction of search or passing is downward and\nno branches on the tree trunk (touch).\nData storage in the form of a parent-child relationship. The origin of a data tree is\nthe root. Data located at different levels along a particular branch from the root is called\nthe node. The last node in the series is called the leaf. Each child has pointers to\nnumerous siblings and there is just one pointer to the parent thus resulting in a one-to-\nmany relationship.\nFig. Tree \/ Hierarchical Structure\n1.4.3 Network Structure : Network Structure is another form of hierarchical structure.\nIn this view as in the hierarchy approach, the data is represented by records and links.\nHowever, a network is a more general structure than a hierarchy.\nA network structure allows relationships among entities. Here user views the\ndatabase as a number of individual record occurrences in which a given node may have\nany number of subordinates nodes. Network Structure is equated to a graph structure.\nThis brings many-to-many relationship. The relationship between the different item is\ncalled as sets.\n6 Database System : Concepts and Design\nFig. Network Structure\n2. Introduction to Database Management System (DBMS) :\nA DBMS is essentially a collection of interrelated data and a set of programs to\naccess this data. This collection of data is called the Database which facilitates storage,\nretrieval and management of information.\nA DBMS consists of a collection of interrelated data and a set of programs to\naccess those data. The collection of data, usually referred to as the database. The primary\ngoal of DBMS is to provide an environment that is both convenient and efficient to use in\nretrieving and storing database information.\nDatabase systems are designed to manage large bodies of information. The\nmanagement of data involves both the definition of structures for the storage of\ninformation and the provision of mechanisms for the manipulation of information.\nIn addition, the database system must provide for the safety of the information\nstored, despite system crashes or attempts at unauthorized access. If data are to be shared\namong several users, the system must avoid possible anomalous results.\nDBMS is a software system which manages the databases providing facilities for\norganization access and control. DBMS is like an operator for database. Database is\npassive where as DBMS is active one. It provides the interface between the data file on\ndisk and the program that requests processing.\n2.1 Objectives of DBMS :\nThe primary objective of a DBMS is to provide a convenient environment to\nretrieve and store database information. It support single-user and multi-user\nenvironment.\n Provide for mass storage of relevant data.\n Make access to the data easy for user.\n Provide prompt response to user requests for data.\n Make the latest modifications to the database available immediately.\n Eliminate the redundant data.\n Allow multiple users to be active at one time.\n Allow for growth in the database system.\n Protect the data from physical harm and unauthorized access.\n Control over data correctness, consistency, integrity, security, etc.\n7 Database System : Concepts and Design\n2.2 Functions of DBMS :\nAccording to the Codd, a comprehensive DBMS provides eight major functions. viz\n Data storage, retrieval and update : A database may be shared by many users thus,\nthe DBMS must provide multiple users views and allow users to store, retrieve and\nupdate easily and effectively.\n Data dictionary and directory : The DBMS must maintain a user accessible data\ndictionary.\n Transaction integrity : A transaction is sequence of steps that constitute some well\ndefined business activity. To maintain transaction integrity, the DBMS must provide\nfacilities for the user or application program to define transaction boundaries i.e. the\nlogical beginning and end of transactions. The DBMS should then commit changes\nfor successful transactions and reject changes for aborted transactions.\n Recovery Services : The DBMS must be able to restore the database in the events of\nsome system failure. Sources of system failure include operator error, disk head\ncrashes and program errors.\n Concurrency Control : Since a database is a shared by multiple users, two or more\nusers may attempt to access the same data simultaneously. If two users attempt to\nupdate the same data record concurrently, erroneous results may occur. Since the\nsafeguards must be built into the DBMS to prevent or overcome the efforts of\ninterference.\n Security mechanisms : Data must be protected against accidental or intentional\nmisuse or distraction. The DBMS provides mechanisms for controlling access to data\nand for defining what action may be taken by each user.\n Data Communication interface : Users often access a database by means of remote\nterminates in telecommunication network. A telecommunication monitor is used\nprocess the flow of transactions to and from the remote terminates. The DBMS must\nprovide a interface with one or more telecommunication monitors so that all the\nnecessary functions are performed and the system will assist, rather than a burden on\nthe end user.\n Integrity services: The DBMS must provide facilities that assist users in\nmanufacturing the integrity of their data. A variety of edit checks and integrity\nconstraints can be designed into the DBMS and its software interfaces. These checks\nare normally administered through the data dictionary.\n2.3 Components of a DBMS :\nA DBMS is a complex structure that is used to manage, store and manipulate data\nand the metadata used to describe the data. It is utilized by a large variety of users to\nretrieve and manipulate data under its control. A system is a composed of set of\ninterrelated components.\n1. Atleast one person who owns and is responsible for the database.\n2. A set of rules and relationship that defines and governs the interactions among\nelements of the database.\n8 Database System : Concepts and Design\n3. People who put data into the database.\n4. People who get data out of the database.\n5. The database itself.\n3. Database Design :\nDatabase design is the design of the database structure that will be used to store\nand manage data rather than the design of the DBMS software. Once the database design\nis completed, the DBMS handles all the complicated activities required to translate the\ndesigner's view of the structures into structures that are usable to the computer.\nA poorly designed database tends to generate errors that are likely to lead to bad\ndecisions. A bad database design eventually can be self correcting: organizations using\npoorly designed databases often fail because their managers do not have access to timely\n(or even correct) information, thereby dominating the bad database design.\nThe availability of a DBMS makes it possible to tackle far more sophisticated\nuses of the data resources, if the database is designed to make use of that available power.\nThe kinds of data structures created within the database and the extent of the relationships\namong them play a powerful role in determining how effective the DBMS is. Therefore,\ndatabase design become a crucial activity in the database environment.\nDatabase design is made much simpler when we use models. A Database model is\na collection of a logical constructs used to represent the data structure and the data\nrelationships found within the database i.e. simplified abstractions of real-world events or\nconditions. If the models are not logically sound, the database designs derived from them\nwill not deliver the database system's promise to effective information drawn from an\nefficient database. \"Good models yield good database design that are the basis for good\napplications\".\n3.1 Goals of Database Design :\nDatabase Design normally involves defining the logical attributes of the database\ndesigning the layout of the database file structure.\nThe main objectives of database design is\n1. To satisfy the information content requirement of the specified user and application.\n2. To provide a natural and easy way to understand structuring of the information.\n3. To support processing requirements and any performance objectives such as\ni. Response time\nii. Processing time\niii. Storage space\nThe main objective of the database design is to ensure that the database meets the\nreporting and information requirements of the users efficiently. The database should be\ndesigned in such a way that :\ni. It eliminates or minimizes data redundancy.\nii. Maintains the integrity and independence of the data.\n9 Database System : Concepts and Design\n3.2 Logical and Physical View of Database :\nComputer Application DBMS Operating Database\nProgram System\n(IOCS)*\nUser logical Program logical Overall logical Physical View\nView View View\n(Schema)\n1 2 3 4\n* IOCS- Input\/ Output Control System\nIn database design, several views of data must be considered along with the\npersons who use them. There are three views :\n1. The overall logical view\n2. The program logical view\n3. Physical view\nThe logical view is what the data look like, regardless of how they are stored\nwhereas the\nphysical view is the way data exist in physical storage, it deals with how data are stored,\naccessed or related to other data in storage.\nFour views of data : THREE logical views and ONE physical view.\nThe logical view as the user's view, the programmer's view and the overall logical\nview (schema).\nThe overall logical view (schema) helps the DBMS to decide what data in storage\nit should act upon as required by the application program.\nA DBMS is a collection of interrelated files and a set of programs that allow users\nto access and modify these files. A major purpose of a database system is to provide users\nwith an abstract view of the data i.e. the system hides certain details of how the data are\nstored and maintained.\n3.3 An Architecture for a Database System :\n3.3.1 Data Abstraction : Many database system users are not computer trained,\ndevelopers hide the complexity from users through several level of abstraction, to\nsimplify users' interaction with the system. The architecture is divided into three general\nlevels : internal, conceptual and external.\n10 Database System : Concepts and Design\na. Internal \/ Physical level : The internal level is the one closest to physical storage i.e.\none concerned with the way in which the data is actually stored. It is the lowest level of\nabstraction describes how the data are actually stored. At the physical level, complex low\nlevel data structures are described in detail.\nb. Conceptual \/ Logical level : is a \"level of indirection\" between the internal and\nexternal. The next higher level of abstraction describes what data are stored in the\ndatabase, and what relationships exists among those data. The entire database is thus\ndescribed in term of a small number of relatively simple structures. This level is used by\nDatabase Administrators(DBA), who must decide what information is to be kept in the\ndatabase.\nc. External \/ View level : The external level is the one closest to the users, i.e. the one\nconcerned with the way in which the data is viewed by individual users. It is the highest\nlevel of abstraction describes only part of the entire database. Despite the use of simpler\nstructures at the logical level, some complexity remains, because of the large size of the\ndatabase. Many users of the database system will not be concerned with all this\ninformation. Instead, such users need to access only a part of the database so that their\ninteraction with the system is simplified, the view level of abstraction is defined. The\nsystem may provide many views for the same database.\nIf the external level is concerned with the individual user views, the conceptual\nlevel may be thought of as defining a community user view. In other words, there will be\nmany \"external views,\" each consisting of a more or less abstract representation of some\nportion of the database, and there will be a single \"conceptual view,\" consisting of a\nsimilarity abstract representation of the database in its entirety. Likewise, there will be a\nsingle \"internal view,\" representing the total database as actually stored.\nFig. The three levels of architecture of a DBMS\n3.3.2 Instances and schemes : Databases change over time as information is inserted or\ndeleted. The collection of information stored in the database at a particular moment is\ncalled an instance of the database. The overall design of the database is called the\ndatabase schema. Schemas are changed infrequently, if at all.\n11 Database System : Concepts and Design\nThe view at each of these levels is described by a Schema. A schema is an outline\nor a plan that describes the records and relationships existing in the view. The word\nschema is used in the database literature for the plural instead of schemata, the\ngrammatically correct word. The schema also describes the way in which entities at one\nlevel of abstraction can be mapped to the next level.\nDatabase systems have several schemas, partitioned according to the levels of\nabstraction(that we discussed). At the lowest level is the physical schema; at the\nintermediate level is the logical schema; and at the highest level is a subschema. In\ngeneral, database system support one physical schema, one logical schema and several\nsubschemas.\n3.3.3 Data independence : The ability to modify a schema definition in one level\nwithout affecting a schema definition in the next higher level is called data\nindependence. There are two levels of data independence viz.\na. Physical data independence : is the ability to modify the physical schema without\ncausing application programs to be rewritten. Modifications at the physical level are\noccasionally necessary to improve performance.\nb. Logical data independence : is the ability to modify the logical schema without\ncausing application programs to be rewritten. Modifications at the logical level are\noccasionally necessary whenever the logical structure of the database is altered.\nLogical data independence is more difficult to achieve than is physical data\nindependence, since the application programs are heavily dependent on the logical\nstructure of the data that they access.\n3.3.4 Database languages : Data Sublanguage (DSL) is a subset of the total language i.e.\nconcerned with the database objects and operations. DSL is a user's \/ query language\nwhich is being embedded in a host language. In principle, any given DSL is really\ncombination of two languages :\na. Data Definition Language (DDL) : is one which specify the database schema. A\ndatabase schema is specified by a set of definitions. This definition includes all the\nentities and their associated attributes as well as the relationships among the entities. The\nresult of compilation of DDL statements is a set of tables i.e. stored in a special file called\ndata dictionary or data directory, which caontains metadata i.e. data about data. This\nfile is consulted before actual data are read or modified in the database system.\nThe storage structure and access methods used by the database system are\nspecified by a set of definitions in a special type of DDL called a data storage and\ndefinition language.\nb. Data Manipulation Language (DML) : is one which is used to express data queries\nand updates i.e. manipulate data in the database. DML helps in\n- the retrieval of information stored in the database\n- the insertion of new information into the database\n- the deletion of information from the database\n- the modification of information stored in the existing database\n12 Database System : Concepts and Design\nA DML is a language that enables users to access or manipulate data as organized\nby the appropriate data model. There are basically two types :\ni. Procedural DMLs : requires a user to specify what data are needed and how to get those\ndata.\nii.Non- Procedural DMLs : requires a user to specify what data are needed without\nspecifying how to get those data.\nMapping : There are two levels of mapping :\ni. one between the external and conceptual levels of the system; and\nii. the other between the conceptual and internal levels.\nThe Conceptual\/Internal mapping defines the correspondence between the\nconceptual view and the stored database. The External\/Conceptual mapping defines the\ncorrespondence between a particular external view and the conceptual view.\nFig. Database System Architecture\nThe DBMS is the software that handles all access to the database. Conceptually\nwhat happens is the following :\n1. A user issues an access request, using some particular Data Manipulation\nLanguage(DML);\n2. the DBMS intercepts the requests and interprets it;\n13 Database System : Concepts and Design\n3. the DBMS inspects, in turn the external schema, the external\/conceptual mapping, the\nconceptual schema, the conceptual\/internal mapping, and the storage structure definition;\nand\n4. the DBMS performs the necessary operations on the stored database.\n3.4 Storage Structures :\nStorage Structures describes the way in which data may be organized in secondary\nstorage i.e. direct access media such as disk packs, drums and so on.\nFig : The Stored record interface\nUser operations are expressed (via the DML) in terms of external records, and\nmust be converted by the DBMS into corresponding operations on internal or stored\nrecords. These later operations must be converted in turn to operations at the actual\nhardware level, i.e. to operations on physical record or blocks. The component\nresponsible for this internal\/physical conversion is called an access method. Its function\nis to conceal all device-dependent details from the DBMS and to present the DBMS with\na stored record interface. The stored interface thus corresponds to the internal level, just\nas the user interface corresponds to the external level. The Physical record interface\ncorresponds to the actual hardware level.\nThe stored record interface permits the DBMS to view the storage structure as a\ncollection of stored files, each one consisting of all occurrences of one type of stored\nrecord(see architecture of DBMS).Specifically, the DBMS knows (a). what stored files\nexist, and, for each one, (b) the structure of the corresponding stored record, (c) the stored\nfield(s), if any, on which it is sequenced, and (d) the stored field(s), if any, that can be\nused as search arguments for direct access. This information will all be specified as part\nof the storage structure definition.\n14 Database System : Concepts and Design\n3.5 Phases in Database Design :\n3.5.1 First phase : The overall purpose of the database initial study is to\na. analyze the organization\/system situation\nb. define problem and constraints\nc. define objectives\nd. define scope and boundaries.\n3.5.2 Second phase : The second phase focuses on the design of the database model that\nwill support organization operations and objectives.\nIn this phase, we can identify six main phases of the database design :\nI. Requirements collection and analysis\nII. Conceptual database design\nIII. Choice of DBMS\nIV. Data model mapping\nV. Physical database design\nVI. Database system implement\nFig : Procedure flow in database design\n15 Database System : Concepts and Design\nI. Conceptual Design : It involves two parallel activities\na. Conceptual scheme design\nb. Transaction design\na. The first activity of Conceptual design examines the data requirements resulting\nfrom Phase 1 and produces a Conceptual database scheme.\nb. The second activity Transaction design examines the database applications\nanalyzed in Phase 1 and produces high-level specifications for the presentation. The goal\nof Phase 2 is to produce a Conceptual schema for the database i.e. independent of a\nspecific DBMS.\nIn this stage, data modeling is used to create an abstract database structure that\nrepresents real world objects in the most realistic way possible. The conceptual model\nmust embody a clear understanding of the transaction or system and its functioning areas.\nThis design is software and hardware independent.\ni. Data Analysis and Requirements : Before we can effectively design a database, we\nmust know the expectations of the users and the intended users of the database as much\ndetail as possible. The process of identifying and analyzing the intended users is called \"\nRequirements collection and analysis\".\nIt is the first step in Conceptual design is to discover the data element\ncharacteristics. Appropriate data element characteristics are those that can be performed\ninto appropriate information. Therefore designers has to focussed on :\na. information needs;\nb. information users ;\nc. information sources; and\nd. information constitution.\nIn order to develop an accurate data model, the designer must have a thorough and\ncomplete understanding of the organization's data. Consequently, the designer must\nidentify the organization's goals and objectives, rules and analyze their impact on the\nnature, role and scope of data.\nii. Entity-Relationship modeling and normalization : Before creating the E-R model(\ndata model) the designer must communicate and enforce appropriate standards to be used\nin the documentation of the design. Failure to standardize documentation often means a\nfailure to communicate later. And communication failures often leads to poor design\nwork.\niii. Data model verification : The E-R model must be verified against that the proposed\nsystem processes in order to corroborate that the intended processes can be supported by\nthe database model.\nVerification requires that the model can be run through a series of test against :\na. End user data views and their required transactions : SELECT, INSERT, UPDATE and\nDELETE operations and queries and reports.\nb. Access paths, security and concurrency control.\nc. System \/ Business-imposed data requirements and constraints.\n16 Database System : Concepts and Design\niv. Distributed Database Design : A distributed database stores logically related data\ninto two or more physically independent sites connected via a computer network. Design\nportions of a database may reside in different locations. Processes that access the\ndatabase may also vary from one location to another.\nII. DBMS Software selection : The selection of DBMS software is critical to the\ninformation systems' smooth operation. Consequently, the proposed DBMS software's\nadvantages and disadvantages should be carefully studied. The end user must be made\naware of the limitations of both the DBMS and the database in order to avoid false\nexpectations.\nFactors affecting the purchasing decision of DBMS are :\n(i).Cost, (ii). DBMS features and tools, (iii). Underlying data model, (iv). Portability, and\n(v). DBMS hardware requirements.\nIII. Logical Design : Logical design is used to translate the Conceptual design into the\ninternal model for a selected DBMS (such as DB2, SQL Server, Oracle, IMS, Informix,\nAccess, Ingress and so on). Logical Design follows the decision to use a specific database\nmodel (hierarchical, network or relational ). Once the database model is identified, we\ncan map the Conceptual design onto a Logical design that is tailored to the selected\ndatabase model. At this stage, the logical design is Software dependent. This includes\nmapping all objects in the model to the specific constructs used by the selected database\nsoftware. The right to use the database is also specified during the logical design phase.\nIn short, the logical design translates the software independent conceptual model\ninto a software dependent model by defining the appropriate domain definitions, the\nrequired tables and the necessary access restrictions.\nIV. Physical Design : The stage is now set to define the physical requirements that allow\nthe system to function within the selected hardware environment.\nPhysical design is the process of selecting the data storage and data access\ncharacteristics of the database. The storage characteristics are a function of the types of\ndevices supported by the hardware, the type of the data access methods supported by the\nsystem and the DBMS. Physical design affects not only the location of the data in the\nstorage device(s) but also the performance of the system.\nV. Database system implement : After the database has been created, the data must be\nloaded into the database tables. If the data are currently stored in a format different from\nthe required by the new DBMS, the data must be converted prior to being loaded.\nDuring the implementation and loading phase, we also must address performance,\nsecurity, backup and recovery, integrity, company standards and concurrency control.\n4. Application of DBMS to Library and Information System :\nThere are two software packages related to Library and Information System. viz.\n4.1 DBase III Plus : is one of the most popular DBMS on personal computers. It is the\nthird major version of the classic dBase database management system series from\nAshton Tate. It is powerful and flexible system for storing, organizing, analyzing and\n17 Database System : Concepts and Design\nretrieving information on a microcomputer. It can be interacted by two modes: one is the\nassistant\/menu mode and other is the command mode.\n4.2 CDS\/ISIS : is menu driven generalized information storage and retrieval system\ndesigned specially for the computerized management of structured non-numerical\ndatabases. It contains 8 programs written in PASCAL language. In India, it is distributed\nby the National Information System for Science and Technology (NISSAT), Department\nof Scientific and Industrial Research, New Delhi on behalf of UNESCO.\n5. Conclusion :\nThe field of information technology is growing out in a very fats rate in India.\nRecently, new types requirements in database processing capabilities have been\nincreasing in several area of application. At the same time, a variety of sophisticated\ntechniques have been developed and powerful modeling capabilities.\nDatabase development process includes information gathering, selection of quality\ninformation, computation and consolidation or abstracting in case of bibliographic\ndatabase, coding, structuring the compiled data into database format, data entry and\nediting, updating, quality control at all levels and maintenance.\nAs such database expresses a concept which has evolved and change gradually over\nthe years since the term was coined. Implementation of the concept has made possible by\nimproving hardware and software technology as made available increasingly regarded as\na vital corporate resource.\nIndia is a large country with vast natural resources. Still the information is scarce. It is\nnot that information is not generated but gets locked on papers to be put in files in the\ncustody of various government organizations and research institutions. India needs\ndatabase in view of liberalization of Indian economy and the globalization of business.\nThe increasing international interaction requires formation of relevant and viable\ndatabase.\nIn addition to the database with in an organization a vast new demand is growing\nfor database services. It has developed tremendously over the time to support the\nchanging world's need control and communication philosophies within the organizations\nas well as outside as seen by the users of this service.\n6. References :\n1. Rob,Peter and Coronel Carlis : Database Systems: Design, implementation and\nmanagement -\n4th ed. Cambridge, Course Technology, 2000 (p 1-55,286-321)\n2. Date, C J : An Introduction to Database Systems - 3rd ed. Vol. 1\nNew Delhi: Narosa,1996 (p 3-32,33-61,63-80)\n3. Silberschatz,Abraham and others: Database System Concepts - 3rd ed.\nNew Delhi: McGraw Hill, 1996(p 1-21)\n4. Desai,Bipin C : An Introduction to Database Systems\nNew Delhi: Galgotia, 1996 (p 2-33)\n18 "}