{"text":"Chapter One\nIntroduction to Computer\nComputer\nA computer is an electronic device, operating under the control of instructions stored\nin its own memory that can accept data (input), process the data according to specified\nrules, produce information (output), and store the information for future use1.\nFunctionalities of a computer2\nAny digital computer carries out five functions in gross terms:\nComputer Components\nAny kind of computers consists of HARDWARE AND SOFTWARE.\nHardware:\nComputer hardware is the collection of physical elements that constitutes a computer\nsystem. Computer hardware refers to the physical parts or components of a computer\nsuch as the monitor, mouse, keyboard, computer data storage, hard drive disk (HDD),\nsystem unit (graphic cards, sound cards, memory, motherboard and chips), etc. all of\nwhich are physical objects that can be touched.3\n1 Vermaat, Misty E. Microsoft Office 2013 Introductory. Cengage Learning, p.IT3. 2014\n2 http:\/\/www.tutorialspoint.com\/computer_fundamentals\/computer_quick_guide.htm\n3 http:\/\/en.wikipedia.org\/wiki\/Computer_hardware\n1 Input Devices\nInput device is any peripheral (piece of computer hardware equipment to provide data\nand control signals to an information processing system such as a computer or other\ninformation appliance.\nInput device Translate data from form that humans understand to one that the computer\ncan work with. Most common are keyboard and mouse\nExample of Input Devices:-\n1. Keyboard 2. Mouse (pointing device) 3. Microphone\n4. Touch screen 5. Scanner 6. Webcam\n7. Touchpads 8. MIDI keyboard 9.\n10. Graphics Tablets 11. Cameras 12. Pen Input\n13. Video Capture Hardware 14. Microphone 15. Trackballs\n16. Barcode reader 17. Digital camera 18. Joystick\n19. Gamepad 20. Electronic Whiteboard 21.\nNote: The most common use keyboard is the QWERTY keyboard. Generally standard Keyboard\nhas 104 keys.\n2 Central Processing Unit (CPU)\nA CPU is brain of a computer. It is responsible for all functions and processes.\nRegarding computing power, the CPU is the most important element of a computer\nsystem.\nThe CPU is comprised of three main parts :\n* Arithmetic Logic Unit (ALU): Executes all arithmetic and logical operations.\nArithmetic calculations like as addition, subtraction, multiplication and division.\nLogical operation like compare numbers, letters, or special characters\n* Control Unit (CU): controls and co-ordinates computer components.\n1. Read the code for the next instruction to be executed.\n2. Increment the program counter so it points to the next instruction.\n3. Read whatever data the instruction requires from cells in memory.\n4. Provide the necessary data to an ALU or register.\n5. If the instruction requires an ALU or specialized hardware to complete, instruct\nthe hardware to perform the requested operation.\n* Registers :Stores the data that is to be executed next, \"very fast storage area\".\nPrimary Memory:-\n1. RAM: Random Access Memory (RAM) is a memory scheme within the computer\nsystem responsible for storing data on a temporary basis, so that it can be promptly\naccessed by the processor as and when needed. It is volatile in nature, which means\nthat data will be erased once supply to the storage device is turned off. RAM stores\ndata randomly and the processor accesses these data randomly from the RAM\nstorage. RAM is considered \"random access\" because you can access any memory\ncell directly if you know the row and column that intersect at that cell.\n2. ROM (Read Only Memory): ROM is a permanent form of storage. ROM stays\nactive regardless of whether power supply to it is turned on or off. ROM devices\ndo not allow data stored on them to be modified.\nSecondary Memory:-\nStores data and programs permanently :its retained after the power is turned off\n1. Hard drive (HD): A hard disk is part of a unit, often called a \"disk drive,\" \"hard drive,\" or \"hard\ndisk drive,\" that store and provides relatively quick access to large amounts of data on an\nelectromagnetically charged surface or set of surfaces.\n2. Optical Disk: an optical disc drive (ODD) is a disk drive that uses laser light as part of the process\nof reading or writing data to or from optical discs. Some drives can only read from discs, but recent\ndrives are commonly both readers and recorders, also called burners or writers. Compact discs,\nDVDs, and Blu-ray discs are common types of optical media which can be read and recorded by\nsuch drives. Optical drive is the generic name; drives are usually described as \"CD\" \"DVD\", or\n\"Bluray\", followed by \"drive\", \"writer\", etc. There are three main types of optical media: CD,\nDVD, and Blu-ray disc. CDs can store up to 700 megabytes (MB) of data and DVDs can store up\nto 8.4 GB of data. Blu-ray discs, which are the newest type of optical media, can store up to 50\nGB of data. This storage capacity is a clear advantage over the floppy disk storage media (a\nmagnetic media), which only has a capacity of 1.44 MB.\n3 3. Flash Disk\nA storage module made of flash memory chips. A Flash disks have no mechanical platters or access\narms, but the term \"disk\" is used because the data are accessed as if they were on a hard drive. The\ndisk storage structure is emulated.\nOutput devices\nAn output device is any piece of computer hardware equipment used to communicate\nthe results of data processing carried out by an information processing system (such\nas a computer) which converts the electronically generated information into human-\nreadable form.\nExample on Output Devices:\n1. Monitor 2. LCD Projection Panels\n3. Printers (all types) 4. Computer Output Microfilm (COM)\n5. Plotters 6. Speaker(s)\n7. Projector\nNote Basic types of monitors are a.Cathode Ray Tube (CRT). B. Liquid Crystal Displays (LCD).\nc.light-emitting diode (LED).\nPrinter types: 1-Laser Printer. 2-Ink Jet Printer. 3-Dot Matrix Printer\n4 Software\nSoftware is a generic term for organized collections of computer data and instructions,\noften broken into two major categories: system software that provides the basic non-\ntask-specific functions of the computer, and application software which is used by\nusers to accomplish specific tasks.\nSoftware Types\nA. System software is responsible for controlling, integrating, and managing the\nindividual hardware components of a computer system so that other software and\nthe users of the system see it as a functional unit without having to be concerned\nwith the low-level details such as transferring data from memory to disk, or\nrendering text onto a display. Generally, system software consists of an operating\nsystem and some fundamental utilities such as disk formatters, file managers,\ndisplay managers, text editors, user authentication (login) and management tools,\nand networking and device control software.\nB. Application software is used to accomplish specific tasks other than just running\nthe computer system. Application software may consist of a single program, such\nas an image viewer; a small collection of programs (often called a software\npackage) that work closely together to accomplish a task, such as a spreadsheet or\ntext processing system; a larger collection (often called a software suite) of related\nbut independent programs and packages that have a common user interface or\nshared data format, such as Microsoft Office, which consists of closely integrated\nword processor, spreadsheet, database, etc.; or a software system, such as a\ndatabase management system, which is a collection of fundamental programs that\nmay provide some service to a variety of other independent applications.\nComparison Application Software and System Software\nSystem Software Application Software\nComputer software, or just software is a\ngeneral term primarily used for digitally stored Application software, also known as an\ndata such as computer programs and other application or an \"app\", is computer software\nkinds of information read and written by designed to help the user to perform specific\ncomputers. App comes under computer tasks.\nsoftware though it has a wide scope now.\nExample: 1) Opera (Web Browser)\n1) Microsoft Windows\n2) Microsoft Word (Word Processing)\n2) Linux\n3) Microsoft Excel (Spreadsheet software)\n3) Unix\n4) MySQL (Database Software)\n4) Mac OSX\n5) Microsoft PowerPoint (Presentation Software)\n5) DOS\n6) Adobe Photoshop (Graphics Software)\nInteraction: Users always interact with application software\nGenerally, users do not interact with system\nwhile doing different activities.\nsoftware as it works in the background.\nDependency: System software can run independently of the Application software cannot run without the\napplication software. presence of the system software.\n5 Unit of Measurements\nStorage measurements: The basic unit used in computer data storage is called a bit\n(binary digit). Computers use these little bits, which are composed of ones\nand zeros, to do things and talk to other computers. All your files, for\ninstance, are kept in the computer as binary files and translated into words\nand pictures by the software (which is also ones and zeros). This two\nnumber system, is called a “binary number system” since it has only two\nnumbers in it. The decimal number system in contrast has ten unique digits,\nzero through nine.\nComputer Storage units\nBit BIT 0 or 1\nKilobyte KB 1024 bytes\nMegabyte MB 1024 kilobytes\nGigabyte GB 1024 megabytes\nTerabyte TB 1024 gigabytes\nSize example\n• 1 bit - answer to an yes\/no question\n• 1 byte - a number from 0 to 255.\n• 90 bytes: enough to store a typical line of text from a book.\n• 4 KB: about one page of text.\n• 120 KB: the text of a typical pocket book.\n• 3 MB - a three minute song (128k bitrate)\n• 650-900 MB - an CD-ROM\n• 1 GB -114 minutes of uncompressed CD-quality audio at 1.4 Mbit\/s\n• 8-16 GB - size of a normal flash drive\nSpeed measurement: The speed of Central Processing Unit (CPU) is measured by\nHertz (Hz), Which represent a CPU cycle. The speed of CPU is known as Computer\nSpeed.\nCPU SPEED MEASURES\n1 hertz or Hz 1 cycle per second\n1 MHz 1 million cycles per second or 1000 Hz\n1 GHz 1 billion cycles per second or 1000 MHz\n6 Computers classification***\nComputers can be generally classified by size and power as follows, though there is\nConsiderable overlap:\n• Personal computer: A small, single-user computer based on a microprocessor. In\naddition to the microprocessor, a personal computer has a keyboard for entering\ndata, a monitor for displaying information, and a storage device for saving data.\n• workstation : A powerful, single-user computer. A workstation is like a personal\ncomputer, but it has a more powerful microprocessor and a higher-quality\nmonitor.\n• minicomputer : A multi-user computer capable of supporting from 10 to hundreds of\nusers simultaneously.\n• mainframe : A powerful multi-user computer capable of supporting many hundreds\nor thousands of users simultaneously.\n• supercomputer : An extremely fast computer that can perform hundreds of millions\nof instructions per second.\nLaptop and Smartphone Computers\nLAPTOP: A laptop is a battery or AC-powered personal computer that can be easily\ncarried and used in a variety of locations. Many laptops are designed to\nhave all of the functionality of a desktop computer, whichmeans they can\ngenerally run the same software and open the same types of files. However,\nsome laptops, such as netbooks, sacrifice some functionality in order to be\neven more portable.\nNetbook: A netbook is a type of laptop that is designed to be even more portable.\nNetbooks are often cheaper than laptops or desktops. They are generally less\npowerful than other types of computers, but they provide enough power for\nemail and internet access, which is where the name \"netbook\" comes from.\nMobile Device: A mobile device is basically any handheld computer. It is designed to\nbe extremely portable, often fitting in the palm of your hand or in your pocket.\nSome mobile devices are more powerful, and they allow you to do many of\n***http:\/\/www.acobas.net\/teaching\/survival\/handouts\/pcwebopedia.pdf\n7 the same things you can do with a desktop or laptop computer. These include\ntablet computers, e-readers, and smartphones.\nTablet Computers: Like laptops, tablet computers are designed to be portable.\nHowever, they provide a very different computing experience. The most\nobvious difference is that tablet computers don't have keyboards or touchpads.\nInstead, the entire screen is touch-sensitive, allowing you to type on a virtual\nkeyboard and use your finger as a mouse pointer. Tablet computers are mostly\ndesigned for consuming media, and they are optimized for tasks like web\nbrowsing, watching videos, reading e-books, and playing games. For many\npeople, a \"regular\" computer like a desktop or laptop is still needed in order\nto use some programs. However, the convenience of a tablet computer means\nthat it may be ideal as a second computer.\nSmartphones: A smartphone is a powerful mobile phone that is designed to run a\nvariety of applications in addition to phone service. They are basically small\ntablet computers, and they can be used for web browsing, watching videos,\nreading e-books, playing games and more.\nData, Information and Knowledge\nData: Facts and figures which relay something specific, but which are not organized\nin any way and which provide no further information regarding patterns, context, etc.\nSo data means \"unstructured facts and figures that have the least impact on the typical\nmanager.\"\nInformation: For data to become information, it must be contextualized, categorized,\ncalculated and condensed. Information thus paints a bigger picture; it is data with\nrelevance and purpose. It may convey a trend in the environment, or perhaps indicate\na pattern of sales for a given period of time. Essentially information is found \"in\nanswers to questions that begin with such words as who, what, where, when, and how\nmany\".\nKnowledge: Knowledge is closely linked to doing and implies know-how and\nunderstanding. The knowledge possessed by each individual is a product of his\nexperience, and encompasses the norms by which he evaluates new inputs from his\nsurroundings.\n8 The content of the human mind can be classified into four categories:\n1. Data: symbols\n2. Information: data that are processed to be useful; provides answers to \"who\", \"what\",\n\"where\", and \"when\" questions\n3. Knowledge: application of data and information; answers \"how\" questions\n4. Wisdom: evaluated understanding.\nWe need to understand that processing data produced Information and process\nInformation produces Knowledge and so on\nCharacteristics of Computer\nSpeed, accuracy, diligence, storage capability and versatility are some of the key\ncharacteristics of a computer. A brief overview of these characteristics are\n• Speed: The computer can process data very fast, at the rate of millions of instructions\nper second. Some calculations that would have taken hours and days to\ncomplete otherwise, can be completed in a few seconds using the computer.\nFor example, calculation and generation of salary slips of thousands of\nemployees of an organization, weather forecasting that requires analysis of a\nlarge amount of data related to temperature, pressure and humidity of various\nplaces, etc.\n• Accuracy: Computer provides a high degree of accuracy. For example, the computer\ncan accurately give the result of division of any two numbers up to 10 decimal\nplaces.\n• Diligence: When used for a longer period of time, the computer does not get tired or\nfatigued. It can perform long and complex calculations with the same speed and\naccuracy from the start till the end.\n• Storage Capability: Large volumes of data and information can be stored in the\ncomputer and also retrieved whenever required. A limited amount of data can\nbe stored, temporarily, in the primary memory. Secondary storage devices like\nfloppy disk and compact disk can store a large amount of data permanently.\n• Versatility: Computer is versatile in nature. It can perform different types of tasks\nwith the same ease. At one moment you can use the computer to prepare a letter\ndocument and in the next moment you may play music or print a document.\nComputers have several limitations too. Computer can only perform tasks that\nit has been programmed to do.\n9 Computer cannot do any work without instructions from the user. It executes\ninstructions as specified by the user and does not take its own decisions.\nComputer Viruses*\nViruses: A virus is a small piece of software that piggybacks on real programs. For\nexample, a virus might attach itself to a program such as a spreadsheet program.\nEach time the spreadsheet program runs, the virus runs, too, and it has the\nchance to reproduce (by attaching to other programs) or wreak havoc.\n•E-mail viruses: An e-mail virus travels as an attachment to e-mail messages, and\nusually replicates itself by automatically mailing itself to dozens of people\nin the victim's e-mail address book. Some e-mail viruses don't even require\na double-click -- they launch when you view the infected message in the\npreview pane of your e-mail software [source: Johnson].\n•Trojan horses: A Trojan horse is simply a computer program. The program claims to\ndo one thing (it may claim to be a game) but instead does damage when you\nrun it (it may erase your hard disk). Trojan horses have no way to replicate\nautomatically.\n•Worms: A worm is a small piece of software that uses computer networks and security\nholes to replicate itself. A copy of the worm scans the network for another\nmachine that has a specific security hole. It copies itself to the new machine\nusing the security hole, and then starts replicating from there, as well.\nWhat are some tips to avoid viruses and lessen their impact?*\nInstall anti-virus software from a reputable vendor. Update it and use it\n\nregularly.\nIn addition to scanning for viruses on a regular basis, install an \"on access\"\n\nscanner (included in most anti-virus software packages) and configure it to start\neach time you start up your computer. This will protect your system by\nchecking for viruses each time you run an executable file.\nUse a virus scan before you open any new programs or files that may contain\n\nexecutable code. This includes packaged software that you buy from the store\nas well as any program you might download from the Internet.\nIf you are a member of an online community or chat room, be very careful\n\nabout accepting files or clicking links that you find or that people send you\nwithin the community.\nMake sure you back up your data (documents, bookmark files, important email\n\nmessages, etc.) on disc so that in the event of a virus infection, you do not lose\nvaluable work.\n*http:\/\/computer.howstuffworks.com\/virus.htm\n*http:\/\/www.us-cert.gov\/publications\/virus-basics\n10 "}