{"text":"INTRODUCTION TO CYBER SPACE\n1.1 INTRODUCTION\nInternet is among the most important inventions of the 21st century which have affected our\nlife. Today internet have crosses every barrier and have changed the way we use to talk, play\ngames, work, shop, make friends, listen music, see movies, order food, pay bill, greet your\nfriend on his birthday\/ anniversary, etc. You name it, and we have an app in place for that. It\nhas facilitated our life by making it comfortable. Gone are the days when we have to stand in\na long queue for paying our telephone and electricity bills. Now we can pay it at a click of a\nbutton from our home or office. The technology have reached to an extent that we don‟t even\nrequire a computer for using internet. Now we have internet enabled smartphone, palmtops,\netc. through which we can remain connected to our friends, family and office 24x7. Not only\ninternet has simplified our life but also it has brought many things within the reach of the\nmiddle class by making them cost effective. It was not long back, while making an ISD or\neven a STD call, the eyes were stricken on the pulse meter. The calls were very costly. ISD\nand STD were used to pass on urgent messages only and the rest of the routine\ncommunication was done using letters since it was a relatively very cheap. Now internet have\nmade it possible to not only talk but use video conference using popular applications like\nskype, gtalk etc. at a very low price to a level where a one hour video chat using internet is\ncheaper that the cost of sending a one page document from Delhi to Bangalore using speed-\npost or courier service. Not only this, internet has changed the use of the typical devices that\nwere used by us. Television can be used not only for watching popular tv shows and movies\nbut can be used for calling\/ video chatting with friend using internet. Mobile phone is not only\nused for making a call but viewing a latest movie. We can remain connected to everyone, no\nmatter what our location is. Working parents from office can keep eye on their children at\nhome and help them in their homework. A businessman can keep eye on his staff, office,\nshop, etc with a click of a button. It has facilitated our life in more than one way. Have you\never wondered from where this internet came? Let us discuss the brief history of internet and\nlearn how this internet was invented and how it evolved to an extent that now we cannot think\nof our lives without it.\n1.1.1 History of Internet\nI don‟t know what the cold war between USA and Russia gave to the world, but defiantly the\ninternet is one of those very useful inventions whose foundation was laid during cold war\n8 days. Russia Launched the world‟s first satellite, SPUTNIK into the space on 4th October,\n1957. This was clearly the victory of Russia over the cyber space and as a counter step,\nAdvanced Research Projects Agency, the research arm of Department of Defence, United\nStates, declared the launch of ARPANET(Advanced Research Projects Agency NETwork) in\nearly 1960‟s. This was an experimental network and was designed to keep the computers\nconnected to the this network to communicate with each other even if any of the node, due to\nthe bomb attack, fails to respond. The first message was sent over the ARPANET, a packing\nswitching network, by Leonard Kleinrock's laboratory at University of California, Los\nAngeles (UCLA). You will be surprised to know that the fist message that was sent over\ninternet was “LO”. Actually they intended to send work “LOGIN” and only the first two\nletters reached its destination at second network node at Stanford Research Institute (SRI) and\nbefore the last three letters could reach the destination the network was down due to glitch.\nSoon the error was fixed and the message was resent and it\nThe major task that ARPANET have to play is to develop rules for communication i.e.\nprotocols for communicating over ARPANET. The ARPANET in particular led to the\ndevelopment of protocols for internetworking, in which multiple separate networks could be\njoined into a network of networks. It resulted in the development if TCP\/IP protocol suite,\nwhich specifies the rules for joining and communicating over APRANET.\nSoon after, in 1986 NSF(national Science Foundation) backbone was created to and five US\nuniversities‟ computing centres were connected to form NSFnet. The participating\nUniversities were:\n Princeton University -- John von Neumann National Supercomputer Center, JvNC\n Cornell University -- Cornell Theory Center, CTC\n University of Illinois at Urbana-Champaign -- National Center for Supercomputing\nApplications, NCSA\n Carnegie Mellon University -- Pittsburgh Supercomputer Center, PSC\n General Atomics -- San Diego Supercomputer Center, SDSC\nNFSnet, the successor of ARPAnet, become popular by 1990 and ARPANET was\ndecommissioned. There were many parallel networks developed by other Universities and\nother countries like United Kingdom. In 1965, National Physical Laboratory(NPL) proposed a\npacking switching network. Michigan Educational Research Information Triad formed\nMERIT network in 1966 which was funded and supported by State of Michigan and the\n9 National Science Foundation (NSF). France also developed a packet swiching network, know\nas CYCLADES in 1973.\nNow there were many parallel systems working on different protocols and the scientist were\nlooking for some common standard so that the networks could be interconnected. In 1978,\nTCP\/IP protocol suits were ready and by 1983, the TCP\/IP protocol were apopted by\nARPANET.\nIn 1981, the integration of two large network took place. NFS developed Computer Science\nNetwork(CSNET) and was connected to ARPANET using TCP\/IP protocol suite. Now the\nnetwork was not only popular among the research community but the private played also took\ninterest in the network. Initially NFS supported speed of 56 kbit\/s. It was upgraded to 1.5\nMbit\/s in 1988 to facilitate the growth of network by involving merit network, IBM, MCA\nand the state of Michigan.\nAfter the copertates took realized the strength and merit of this network, they particepitaqted\nin the develoement of the network to ripe its benefits. By late 1980s many Internet Service\nProviders(ISPs) emerged to provide the backbone for carrying the network traffic. By 1991,\nNFSNET was expended and was upgraded to 45Mbit\/s. Many commercial ISPs provided\nbackbone serive and was popular among the corporate. To facilitate the commercial use of the\nnetwork, NFSNET was decommissioned in 1995 and now the Internet could carry\ncommercial traffic.\nNow more and more Universities and research centres throughout the world connected to it.\nNow this network was very popular amongs the research community and in 1991 National\nResearch and Education Network (NREN) was founded and the World Wide Web was\nreleased. Initially the role of internet was only limited to file transfer. The credit of internet\nwhat we see it today goes to Tim Berners-Lee who introduced www.With the advent of www,\nthere was a transformation on how the network was used. Now this web of information can be\nused to retrieve any information available over the internet. Software called, browser was\ndeveloped to browse the internet. It was developed by researchers at University of Illinois in\n1992 and named as Mosaic. This browser enables to browse the internet the way we browse it\ntoday.\n1.1.1.1 Internet Addresses\nWith so many devices connected to the internet, we require some mechanism to uniquely\nidentify every device that is connected to the internet. Also we require some centralized\n10 system which takes care of this mechanism so that the signs which are used to identify each\ndevice are not duplicate; else the whole purpose is defeated. To take care of this, we have a\ncentralized authority known as Internet Assigned Numbers Authority (IANA), which is\nresponsible for assigning a unique number known as IP(Internet Protocol) address. An IP\naddress is a 32-bit binary number which is divided into four octets and each octet consists of 8\nbinary digits and these octet are separated by a dot(.). An example of an IP address is\n11110110.01011010.10011100.1111100\nEach 8-bits in an octet can have two binary values i.e. 0 and 1. Therefore, each octet can have\nminimum value 0. i.e. 00000000 to maximum value 256 i.e. 11111111 and in total have 28=\n256 different combinations.\nAgain to remember this 32-bit address in binary is bit difficult, so for the better understanding\nof the human being, it is expressed in a decimal format. But this decimal format is for human\nunderstanding only and the computer understands it in binary format only. In decimal, the\nabove IP address is expressed as 123.45.78.125\nThese octets are used to create and separate different classes. An IP address consists of two\nparts viz. Network and Host. Network part identifies the network different network and the\nhost part identifies a device of a particular network.\nThis address uniquely identifies a devices connected to the internet similar to the postal\nsystem where we identify any house by fist identifying the county, then state, district, post\noffice, cluster\/block and finally the house number. These IP addresses are classified into five\ncategories based on the availability of IP range. These categories\/classes are:\nTable 1: IP Address Classes\nClass Address range Supports\nClass A 1.0.0.1 to 126.255.255.254 Supports 16 million hosts on each of 127 networks.\nClass B 128.1.0.1 to 191.255.255.254 Supports 65,000 hosts on each of 16,000 networks.\nClass C 192.0.1.1 to 223.255.254.254 Supports 254 hosts on each of 2 million networks\nClass D 224.0.0.0 to 239.255.255.255 Reserved for multicast groups\nClass E 240.0.0.0 to 254.255.255.254 Reserved for future use, or Research and\nDevelopment Purposes.\nIANA decentralises that task of assigning the IP addresses by allocating the large chunk of IP\naddresses to five Regional Internet Registries (RIRs), which are further responsible to\n11 allocate the IP addresses in their zone. These RIRs along with their area of operations are\nlisted below:\n APNIC- This RIR is responsible for serving the Asia Pacific region\n AfriNIC- This RIR is responsible for serving the African region\n ARIN- This RIR is responsible for serving North America and several Caribbean and\nNorth Atlantic islands\n LACNIC- This RIR is responsible for serving Latin America and the Caribbean, and\n RIPE NCC- This RIR is responsible for serving Europe, the Middle East, and parts of\nCentral Asia\nFor liaison and coordinating between these five RIRs, there is an organization called Number\nResource Organization(NRO). These organizations are\n1.1.1.2 DNS\nWhenever we browse any website in the internet, we type name something like\nwww.uou.ac.in and we rarely deal with IP address like 104.28.2.92 but the fact is even if we\ntype http:\\\\ 104.28.2.92 in the URL, it will land us to the same webpage. The fact is we are\nvery comfortable using and remembering the names instead of a number. Moreover, these IP\naddress changes over time and some of the sites have multiple IP address. Also, the transfer of\nthe data over internet is only possible using IP addresses because the routing of the packet of\ndata sent over internet is done using IP address. There is a server called Domain Name\nSystem(DNS) which take cares of this translation job to simplify and to save us from\nremembering these changing IP address numbers, the DNS. Whenever you type an address\nlike http:\\\\www.uou.ac.in, there is a process called DNS name resolution, takes place in the\nbackground. The computer keeps the track of recently visited sites and locally maintains a\ndatabase in DNS cache. In case, the IP address of the site you have requested for is not found\nin the DNS cache of your local computer, then the next probable place to find it is DNS server\nof your Internet Service Provider(ISP). These DNS servers of ISP also maintain the cache of\nthe recently visited pages. Just in case, the information is not found here also, the DNS\nserver of the ISP forward the query to the root nameservers. The root name servers publish\nthe root zone file to other DNS servers and clients on the Internet. The root zone file describes\nwhere the authoritative servers for the DNS top-level domains (TLD) are located. There are\ncurrently 13 rootname servers. They are:\n A - VeriSign Global Registry Services\n12  B - University of Southern California - Information Sciences Institute\n C - Cogent Communications\n D - University of Maryland\n E - NASA Ames Research Center\n F - Internet Systems Consortium, Inc.\n G - U.S. DOD Network Information Center\n H - U.S. Army Research Lab\n I - Autonomica\/NORDUnet\n J - VeriSign Global Registry Services\n K - RIPE NCC\n L - ICANN\n M - WIDE Project\nThese root nameservers directs the query to the appropriate Top-Level Domain(TLD)\nnameservers by reading the last part of the URL first. In our example the url was\nhttp:\\\\www.uou.ac.in. The last part is .in. Some of the examples of TLD name servers are\n.com, .biz, .org, .us, .in, etc. These TLD nameservers acts as a switchboard and direct the\nquery to the appropriate authoritative nameserver maintained by each domain. These\nauthoritative nameserver maintains DNS records along with other useful information. This\naddress record is returned back to the requesting host computer via TLD nameservers,\nnameservers, ISP‟s DNS server. These intermediaty server keeps the recond of this IP address\nin their DNS cache, so that if the same request is encountered again , they don‟t have to go\nthrough this process again. If the same URL is requested again, the DNS cache of the local\nhost computer will return the IP address of the URL.\n1.1.1.3 Internet Infrastructure\nInternet, as the name suggests, in a network of network i.e. it is a collection of several small,\nmedium and large networks. This clearly indicates to one fact, nobody is a single owner of the\ninternet and it is one of the proven example of collaborative success. Now you must be\nsurprised how such a large network which is spread across the continents can run without the\nany problem. Yes it is correct that to monitor such a large network, we require an\ninternational body which can frame the rules, regulation and protocols to join and use this\nnetwork. Therefore, an international organization, known as “The Internet Society” was\nformed in 1992 to take care of such issues.\n13 Let us now discuss, how this internet works? How the email you sent to your friend is\nreceived by your friend‟s computer located at another country\/continent. When you are\nworking in your laptop\/desktop in your home without connecting to the internet, your\ncomputer is a standalone system. But, whenever you connect to the internet by dialling to\nyour Internet Service Provider(ISP) using your modem, you become the part of the network.\nThe ISP is the link between the internet backbone, through which the entire data route, and\nthe user. The ISP connects to the internet backbone at Network Access Points(NAP). These\nNAPs are the provided by the large telecommunication companies at various regions. These\nlarge telecommunication companies connect the countries and the continents by building and\nmaintaining the large backbone infrastructure to route data from NAP to NAP. ISPs are\nconnected to this backbone at NAP and are responsible build and manage network locally. So\nwhen you dial internet through modem, you first become part of the local ISP, which in turn\nconnects to the internet backbone through NAP. The data is routed through this backbone and\nsent to the destination NAP, where the ISP of your friend‟s network is located. As soon as\nyour friend dials his modem to connect to the internet, the data is delivered to your friend‟s\ncomputer.\n1.1.1.4 World Wide Web\nSometimes we interchangeably use the term internet and world wide web or simply the web,\nas it is popularly known as. But web is only one of the several the utilities that internet\nprovides. Some of the popular service that internet provides other then web is e-mail, usenet,\nmessaging service, FTP, etc. The web use HTTP protocol to communicate over internet and\nto exchange information. The web was developed at CERN (Europeen de Reserches\nNucleaires), Switzerland) by a UK scientist Tim Berners-Lee in 1989. It consists of all the\npublic web sites and all the devices that access the web content. WWW is an information\nsharing model which is developed to exchange information over the internet. There are plenty\nof public websites, which is a collection of web pages, available over the internet. These web-\npages contain plenty of information in a form of text, videos, audio and picture format.\nThese web pages are access using a application software called a web browser. Some of the\nexamples of the popular web browser are: Internet explorer, Chrome, Safari, Firefox, etc.\nSo this was a little indroduction about internet and how it functions. Now let us discuss about\ncyber crime.\n14 1.2 INTRODUCTION TO CYBER CRIME\nThe internet was born around 1960‟s where its access was limited to few scientist, researchers\nand the defence only. Internet user base have evolved expontinanlty. Initially the computer\ncrime was only confined to making a physical damage to the computer and related\ninfrastructure. Around 1980‟s the trend changed from causing the physical damaging to\ncomputers to making a computer malfunction using a malicious code called virus. Till then\nthe effect was not so widespread beacouse internet was only comfined to defence setups, large\ninternational companies and research communities. In 1996, when internet was launched for\nthe public, it immeditly became populer among the masses and they slowly became dependent\non it to an extent that it have changed their lifestyle. The GUIs were written so well that the\nuser don‟t have to bother how the internet was functioning. They have to simply make few\nclick over the hyber links or type the desired information at the desired place without\nbothering where this data is stored and how it is sent over the internet or wether the data can\naccessed by another person who is conneted to the internet or wether the data packet sent over\nthe internet can be snoofed and tempered. The focus of the computer crime shifted from\nmarely damaging the computer or destroying or manipulating data for personal benefit to\nfinancial crime. These computer attacks are incresing at a rapid pase. Every second around 25\ncomputer became victim to cyber attack and around 800 million individuals are effected by it\ntill 2013. CERT-India have reported around 308371 Indian websites to be hacked between\n2011-2013. It is also estimated that around $160 million are lost per year due to cyber crime.\nThis figure is very conservative as most of the cases are never reported.\nAccoring to the 2013-14 report of the standing committee on Information Technology to the\n15th Lok Sabha by ministry of communication and information technology, India is a third\nlargest number do Intrernet users throughout the world with an estimated 100 million internet\nusers as on June, 2011 and the numbers are growing rapidly. There are around 22 million\nbroadband connections in India till date operated by around 134 major Internet Service\nProviders(ISPs).\nBefore discussing the matter further, let us know what the cyber crime is?\nThe term cyber crime is used to describe a unlawful activity in which computer or computing\ndevices such as smartphones, tablets, Personal Digital Assistants(PDAs), etc. which are stand\nalone or a part of a network are used as a tool or\/and target of criminal acitivity. It is often\n15 commited by the people of destructive and criminal mindset either for revenge, greed or\nadventure.\n1.2.1 Classification of Cyber Crimes\nThe cyber criminal could be internal or external to the organization facing the cyber attack.\nBased on this fact, the cyber crime could be categorized into two types:\n Insider Attack: An attack to the network or the computer system by some person with\nauthorized system access is known as insider attack. It is generally performed by\ndissatisfied or unhappy inside employees or contractors. The motive of the insider\nattack could be revenge or greed. It is comparitively easy for an insider to perform a\ncyber attack as he is well aware of the policies, processes, IT architecture and\nwealness of the security system. Moreover, the attacker have an access to the network.\nTherefore it is comparatively easy for a insider attacker to steel sensitive information,\ncrash the network, etc. In most of the cases the reason for insider attack is when a\nemployee is fired or assigned new roles in an organization, and the role is not reflected\nin the IT policies. This opens a vernability window for the attacker. The insider attack\ncould be prevented by planning and installing an Internal intrusion detection systems\n(IDS) in the organization.\n External Attack: When the attacker is either hired by an insider or an external entity to\nthe organization, it is known as external attack. The organization which is a victim of\ncyber attack not only faces financial loss but also the loss of reputation. Since the\nattacker is external to the organization, so these attackers usually scan and gathering\ninformation.An expreicend network\/security administrator keeps regual eye on the log\ngenerated by the firewalls as extertnal attacks can be traced out by carefully analysinig\nthese firewall logs. Also, Intrusion Detection Systems are installed to keep an eye on\nexternal attacks.\nThe cyber attacks can also be classified as structure attacks and unstructured attacks based on\nthe level of maturity of the attacker. Some of the authors have classified these attacks as a\nform of external attacks but there is precedence of the cases when a structured attack was\nperformed by an internal employee. This happens in the case when the competitor company\nwants the future strategy of an organization on certain points. The attacker may strategically\ngain access to the company as an employee and access the required information.\n16  Unstructured attacks: These attacks are generally performed by amatures who don‟t\nhave any predefined motives to perform the cyber attack. Usually these amatures try to\ntest a tool readily available over the internet on the network of a random company.\n Structure Attack: These types of attacks are performed by highly skilled and\nexperienced people and the motives of these attacks are clear in their mind. They have\naccess to sophisticated tools and technologies to gain access to other networks without\nbeing noticed by their Intrusion Detection Systems(IDSs). Moreover, these attacker\nhave the necessary expertise to develop or modify the existing tools to satisfy their\npurpose. These types of attacks are usually performed by professional criminals, by a\ncountry on other rival countries, politicians to damage the image of the rival person or\nthe country, terrorists, rival companies, etc.\nCyber crimes have turned out to be a low-investment, low-risk business with huge returns.\nNow-a-days these structured crimes are performed are highly organized. There is a perfect\nhierarchical organizational setup like formal organizations and some of them have reached a\nlevel in technical capabilities at par with those of developed nation. They are targeting large\nfinancial organizations, defence and nuclear establishments and they are also into online\ndrugs trading.\nCriminal\nBoss\nThey are Trojan Provider and\nManager. They are responsible for Under Boss\ntrojen command and control.\nThey are the attackers crimeware\nCampaign Campaign Campaign\ntoolkit owner. They distribute Trojen\nin legtimate websites through their Manager Manager Manager\naffiliation network.\nStolen Data Stolen Data Stolen Data\nReseller Reseller Reseller\nFigure 1 : Hierarchical Organisational Structure\n17 The role of all the people in the hierarchy reamin changing and it is based on the oppourtinity.\nIf a hacker who have hacked sesetive data from an organization may use it for financially\nexploiting the organisation himself. In case, the hacker himself have the technical expertise\nfor it, he will do it himself, otherwise he may find a buyer who is intrested in that data and\nhave the technical expertize.\nThere are some cyber criminals offers on-demand and service. The person, organization or a\ncountry may contact these cyber criminals for hacking an organization to gain access to some\nsensetive data , or create massive denial-of –service attack on their compititors. Based on the\ndemand of the customer the hackers write malware, virus, etc to suit their requirements. An\norganizaiton effected by a cyber attack, not only faces finincial loss, but its repuration is also\nadversly affected, and the compitititor organization will definatly benefited by it.\n1.2.2 Reasons for Commission of Cyber Crimes\nThere are many reasons which act as a catalyst in the growth of cyber crime. Some of the\nprominent reasons are:\na. Money: People are motivated towards committing cyber crime is to make quick and\neasy money.\nb. Revenge: Some people try to take revenge with other person\/organization\/society\/\ncaste or religion by defaming its reputation or bringing economical or physical loss.\nThis comes under the category of cyber terrorism.\nc. Fun: The amateur do cyber crime for fun. They just want to test the latest tool they\nhave encountered.\nd. Recognition: It is considered to be pride if someone hack the highly secured networks\nlike defense sites or networks.\ne. Anonymity- Many time the anonymity that a cyber space provide motivates the person\nto commit cyber crime as it is much easy to commit a cyber crime over the cyber\nspace and remain anonymous as compared to real world.\nIt is much easier to get away with criminal activity in a cyber world than in the real\nworld. There is a strong sense of anonymity than can draw otherwise respectable\ncitizens to abandon their ethics in pursuit personal gain.\nf. Cyber Espionage: At times the government itself is involved in cyber trespassing to\nkeep eye on other person\/network\/country. The reason could be politically,\neconomically socially motivated.\n18 1.3 MALWARE AND ITS TYPE\nMalware stands for “Malicious Software” and it is designed to gain access or installed into the\ncomputer without the consent of the user. They perform unwanted tasks in the host computer\nfor the benefit of a third party. There is a full range of malwares which can seriously degrade\nthe performance of the host machine. There is a full range of malwares which are simply\nwritten to distract\/annoy the user, to the complex ones which captures the sensitive data from\nthe host machine and send it to remote servers. There are various types of malwares present in\nthe Internet. Some of the popular ones are:\n1.3.1 Adware\nIt is a special type of malware which is used for forced advertising. They either redirect the\npage to some advertising page or pop-up an additional page which promotes some product or\nevent. These adware are financially supported by the organizations whose products are\nadvertised.\n1.3.2 Spyware\nIt is a special type of which is installed in the target computer with or without the user\npermission and is designed to steal sensitive information from the target machine. Mostly it\ngathers the browsing habits of the user and the send it to the remote server without the\nknowledge of the owner of the computer. Most of the time they are downloaded in to the host\ncomputer while downloading freeware i.e. free application programmes from the internet.\nSpywares may be of various types; It can keeps track of the cookies of the host computer, it\ncan act as a keyloggers to sniff the banking passwords and sensitive information, etc.\n1.3.3 Browser hijacking software\nThere is some malicious software which are downloaded along with the free software offered\nover the internet and installed in the host computer without the knowledge of the user. This\nsoftware modifies the browsers setting and redirect links to other unintentional sites.\n1.3.4 Virus\nA virus is a malicious code written to damage\/harm the host computer by deleting or\nappending a file, occupy memory space of the computer by replicating the copy of the code,\nslow down the performance of the computer, format the host machine, etc. It can be spread\nvia email attachment, pen drives, digital images, e-greeting, audio or video clips, etc. A virus\nmay be present in a computer but it cannot activate itself without the human intervention.\n19 Until and unless the executable file(.exe) is execute, a virus cannot be activated in the host\nmachine.\n1.3.5 Worms\nThey are a class of virus which can replicate themselves. They are different from the virus by\nthe fact that they does not require human intervention to travel over the network and spread\nfrom the infected machine to the whole network. Worms can spread either through network,\nusing the loopholes of the Operating System or via email. The replication and spreading of the\nworm over the network consumes the network resources like space and bandwidth and force\nthe network to choke.\n1.3.6 Trojan Horse\nTrojan horse is a malicious code that is installed in the host machine by pretending to be\nuseful software. The user clicks on the link or download the file which pretends to be a useful\nfile or software from legitimate source. It not only damages the host computer by\nmanipulating the data but also it creates a backdoor in the host computer so that it could be\ncontrolled by a remote computer. It can become a part of botnet(robot-network), a network of\ncomputers which are infected by malicious code and controlled by central controller. The\ncomputers of this network which are infected by malicious code are known as zombies.\nTrojens neither infect the other computers in the network nor do they replicate.\n20 Figure 2: A typical botnet\n1.3.7 Scareware\nInternet has changed how we talk, shop, play etc. It has even changed the way how the\ncriminal target the people for ransom. While surfing the Internet, suddenly a pop-up alert\nappears in the screen which warns the presence of dangerous virus, spywares, etc. in the\nuser‟s computer. As a remedial measure, the message suggests the used download the full\npaid version of the software. As the user proceeds to download, a malicious code, known as\nscareware is downloaded into the host computer. It holds the host computer hostage until the\nransom is paid. The malicious code can neither be uninstalled nor can the computer be used\ntill the ransom is paid. A sample message alert of a scareware is shown below in Fig 31\nFigure 3: Sample Warning Message of a\nScareware1\n1.4 KINDS OF CYBER CRIME\nVarious types of cyber crimes are:\n1.4.1 Cyber Stalking\nIt is an act of stalking, harassing or threatening someone using Internet\/computer as a\nmedium. This is often done to defame a person and use email, social network, instant\nmessenger, web-posting, etc. as a using Internet as a medium as it offers anonymity. The\nbehaviour includes false accusations, threats, sexual exploitation to minors, monitoring, etc.\n1 Image courtesy: https:\/\/www.flickr.com\/photos\/alamagordo\/2372928527\n21 1.4.2 Child Pornography\nIt is an act of possessing image or video of a minor (under 18), engaged in sexual conduct.\n1.4.3 Forgery and Counterfeiting\nIt is a use of computer to forgery and counterfeiting is a document. With the advancement in\nthe hardware and the software, it is possible to produce counterfeit which matches the original\ndocument to such an extent that it is not possible to judge the authenticity of the document\nwithout expert judgement.\n1.4.4 Software Piracy and Crime related to IPRs\nSoftware piracy is an illegal reproduction and distribution for personal use or business. It\ncomes under crime related to IPR infringement. Some of the other crimes under IPR\ninfringement are: download of songs, downloading movies, etc.\n1.4.5 Cyber Terrorism\nIt is defined as the use of computer resources to intimidate or coerce government, the civilian\npopulation or any segment thereof in furtherance of political or social objectives.\n1.4.6 Phishing\nIt is a process of acquiring personal and sensitive information of an individual via email by\ndisguising as a trustworthy entity in an electronic communication. The purpose of phishing is\nidentity theft and the personal information like username, password, and credit card number\netc. may be used to steal money from user account. If a telephone is used as a medium for\nidentity theft, it is known as Vishing (voice phishing). Another form of phishing is Smishing,\nin which sms is used to lure customers.\n1.4.7 Computer Vandalism\nIt is an act of physical destroying computing resources using physical force or malicious\ncode.\n1.4.8 Computer Hacking\nIt is a practice of modifying computer hardware and software to accomplish a goal outside the\ncreator‟s original purpose. The purpose of hacking a computer system may vary from simply\ndemonstrations of the technical ability, to sealing, modifying or destroying information for\nsocial, economic or political reasons. Now the corporate are hiring hackers, a person who is\nengaged in hacking computers, to intentionally hack the computer of an organization to find\nand fix security vulnerabilities.\nThe hackers may be classified as:\n22  White Hat: white hat hackers are the persons who hack the system to find the security\nvulnerabilities of a system and notify to the organizations so that a preventive action\ncan be taken to protect the system from outside hackers. White hat hackers may be\npaid employee of an organization who is employed to find the security loop-holes, or\nmay be a freelancer who just wants to prove his mantle in this field. They are popular\nknown as ethical hackers.\n Black Hat: in contrast to the white hat, the black hat hack the system with ill\nintentions. They may hack the system for social, political or economically motivated\nintentions. They find the security loopholes the system, and keep the information\nthemselves and exploit the system for personal or organizational benefits till\norganization whose system is compromised is aware of this, and apply security\npatches. They are popularly known as crackers.\n Grey Hat: Grey hat hackers find out the security vulnerabilities and report to the site\nadministrators and offer the fix of the security bug for a consultancy fee.\n Blue hat: A blue hat hacker is someone outside computer security consulting firms\nwho is used to bug-test a system prior to its launch, looking for exploits so they can be\nclosed.\n1.4.9 Creating and distributing viruses over internet\nThe spreading of an virus can cause business and financial loss to an organization. The loss\nincludes the cost of repairing the system, cost associated with the loss of business during\ndowntime and cost of loss of opportunity. The organization can sue the hacker, if found, for\nthe sum of more than or equivalent to the loss borne by the organization.\n1.4.10 Spamming\nSending of unsolicited and commercial bulk message over the internet is known as spamming.\nAn email can be classified as spam, if it meets following criteria:\na. Mass mailing:- the email is not targeted to one particular person but to a large number\nof peoples.\nb. Anonymity:- The real identify of the person not known\nc. Unsolicited:- the email is neither expected nor requested for the recipient.\nThese spams not only irritate the recipients and overload the network but also waste the time\nand occupy the valuable memory space of the mailbox.\n1.4.11 Cross Site Scripting\n23 It is an activity which involves injecting a malicious client side script into a trusted website.\nAs soon as the browser executes the malicious script, the malicious script gets access to the\ncookies and other sensitive information and sent to remote servers. Now this information can\nbe use to gain financial benefit or physical access to a system for personal interest.\n1.4.12 Online Auction Fraud\nThere are many genuine websites who offers online auction over internet. Taking the\nadvantage of the reputation of these websites, some of the cyber criminals lure the customers\nto online auction fraud schemes which often lead to either overpayment of the product or the\nitem is never delivered once the payment is made.\n1.4.13 Cyber Squatting\nIt is an act of reserving the domain names of someone else‟s trademark with intent to sell it\nafterwards to the organization who is the owner of the trademark at a higher price.\n1.4.14 Logic Bombs\nThese are malicious code inserted into legitimate software. The malicious action is triggered\nby some specific condition. If the conditions holds true in future, the malicious action begins\nand based on the action defined in the malicious code, they either destroy the information\nstored in the system or make system unusable.\n1.4.15 Web Jacking\nThe hacker gain access to a website of an organization and either blocks it or modify it to\nserve political, economical or social interest. The recent examples of web jacking are some of\nthe websites of the educational institutes were hacked by Pakistani hackers and an animation\nwhich contains Pakistani flags were flashed in the homepage of these websites. Another\nexample is Indian hackers hacked website of Pakistani railways and flashed Indian flag in the\nhomepage for several hours on the occasion of Independence Day of India in 2014.\n1.4.16 Internet Time Thefts\nHacking the username and password of ISP of an individual and surfing the internet at his\ncost is Internet Time Theft.\n1.4.17 Denial of Service Attack\nIt is a cyber attack in which the network is chocked and often collapsed by flooding it with\nuseless traffic and thus preventing the legitimate network traffic.\n1.4.18 Salami Attack\n24 It is an attack which proceeds with small increments and final add up to lead to a major\nattack. The increments are so small that they remain unnoticed. An example of salami attack\nis gaining access to online banking of an individual and withdrawing amount in such a small\namounts that it remains unnoticed by the owner. Often there is default trigger set in the\nbanking website and transactions below say, Rs. 1000 withdrawal are not reported to the\nowner of the account. Withdrawing amount of Rs. 1000 over a period of time will lead to total\nwithdrawal of a large sum.\n1.4.19 Data Diddling\nIt is a practice of changing the data before its entry into the computer system. Often, the\noriginal data is retained after the execution on the data is done. For example, DA or the basic\nsalary of the person is changed in the payroll data of an individual for pay calculation. Once\nthe salary is calculated and transferred to his account, the total salary is replaced by his actual\nsalary in the report.\n1.4.20 Email Spoofing\nIt is a process of changing the header information of an e-mail so that its original source is not\nidentified and it appears to an individual at the receiving end that the email has been\noriginated from source other than the original source.\n25 CYBER SECURITY TECHNIQUES\nThere are many cyber security techniques to combat the cyber security attacks. The next\nsection discusses some of the popular techniques to counter the cyber attacks.\n2.1 AUTHENTICATION\nIt is a process of identifying an individual and ensuring that the individual is the same who\nhe\/she claims to be. A typical method for authentication over internet is via username and\npassword. With the increase in the reported cases of cyber crime by identity theft over\ninternet, the organizations have made some additional arrangements for authentication like\nOne Time Password(OTP), as the name suggest it is a password which can be used one time\nonly and is sent to the user as an SMS or an email at the mobile number\/email address that he\nhave specified during the registration process. It is known as two-factor authentication\nmethod and requires two type of evidence to authentication an individual to provide an extra\nlayer of security for authentication. Some other popular techniques for two-way\nauthentication are: biometric data, physical token, etc. which are used in conjunction with\nusername and password.\nThe authentication becomes more important in light of the fact that today the multinational\norganizations have changed the way the business was to be say, 15 years back. They have\noffices present around the Globe, and an employee may want an access which is present in a\ncentralized sever. Or an employee is working from home and not using the office intranet and\nwants an access to some particular file present in the office network. The system needs to\nauthenticate the user and based on the credentials of that user, may or may not provide access\nto the used to the information he requested. The process of giving access to an individual to\ncertain resources based on the credentials of an individual is known as authorization and often\nthis process is go hand-in-hand with authorization. Now, one can easily understand the role of\nstrong password for authorization to ensure cyber security as an easy password can be a cause\nof security flaw and can bring the whole organization at high risk. Therefore, the password\npolicy of an organization should be such that employees are forced to use strong passwords\n(more than 12 characters and combination of lowercase and uppercase alphabets along with\nnumbers and special characters) and prompt user to change their password frequently. In\nsome of the bigger organizations or an organization which deals in sensitive information like\ndefence agencies, financial institutions, planning commissions, etc. a hybrid authentication\n26 system is used which combines both the username and password along with hardware security\nmeasures like biometric system, etc. Some of the larger organizations also use VPN(Virtual\nPrivate Network), which is one of the method to provide secure access via hybrid security\nauthentication to the company network over internet.\n2.2 ENCRYPTION\nIt is a technique to convert the data in unreadable form before transmitting it over the internet.\nOnly the person who have the access to the key and convert it in the readable form and read it.\nFormally encryption can be defined as a technique to lock the data by converting it to\ncomplex codes using mathematical algorithms. The code is so complex that it even the most\npowerful computer will take several years to break the code. This secure code can safely be\ntransmitted over internet to the destination. The receiver, after receiving the data can decode it\nusing the key. The decoding of the complex code to original text using key is known as\ndecryption. If the same key is used to lock and unlock the data, it is known as symmetric key\nencryption.\nFigure 4: Encryption2\nIn symmetric key encryption, the after coding of data, the key is sent to the destination user\nvia some other medium like postal service, telephone, etc. because if the key obtained by the\nhacker, the security of the data is compromised. Key distribution is a complex task because\nthe security of key while transmission is itself an issue. To avoid the transfer of key a method\ncalled asymmetric key encryption, also known as public key encryption, is used. In\n2 Image courtesy: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bc\/Public_key_encryption_keys.png\n27 asymmetric key encryption, the key used to encrypt and decrypt data are different. Every user\nposse‟s two keys viz. public key and private key. As the name suggest, the public key of\nevery user is known to everyone but the private key is known to the particular user, who own\nthe key, only. Suppose sender A wants to send a secret message to receiver B through\ninternet. A will encrypt the message using B‟s public key, as the public key is known to\neveryone. Once the message is encrypted, the message can safely be send to B over internet.\nAs soon as the message is received by B, he will use his private key to decrypt the message\nand regenerate the original message.\n2.3 DIGITAL SIGNATURES\nIt is a technique for validation of data. Validation is a process of certifying the content of a\ndocument. The digital signatures not only validate the data but also used for authentication.\nThe digital signature is created by encrypting the data with the private key of the sender. The\nencrypted data is attached along with the original message and sent over the internet to the\ndestination. The receiver can decrypt the signature with the public key of the sender. Now the\ndecrypted message is compared with the original message. If both are same, it signifies that\nthe data is not tempered and also the authenticity of the sender is verified as someone with the\nprivate key(which is known to the owner only) can encrypt the data which was then\ndecrypted by his public key. If the data is tempered while transmission, it is easily detected by\nthe receiver as the data will not be verified. Moreover, the massage cannot be re-encrypted\nafter tempering as the private key, which is posses only by the original sender, is required for\nthis purpose.\nAs more and more documents are transmitted over internet, digital signatures are essential\npart of the legal as well as the financial transition. It not only provides the authentication of a\nperson and the validation of the document, it also prevents the denial or agreement at a later\nstage. Suppose a shareholder instructs the broker via email to sell the share at the current\nprice. After the completion of the transaction, by any chance, the shareholder reclaims the\nshares by claiming the email to be forge or bogus. To prevent these unpleasant situations, the\ndigital signatures are used.\n28 Figure 5: Digital signature3\n2.4 ANTIVIRUS\nThere are verities of malicious programs like virus, worms, trojan horse, etc that are spread\nover internet to compromise the security of a computer either to destroy data stored into the\ncomputer or gain financial benefits by sniffing passwords etc. To prevent these malicious\ncodes to enter to your system, a special program called an anti-virus is used which is designed\nto protect the system against virus. It not only prevents the malicious code to enter the system\nbut also detects and destroys the malicious code that is already installed into the system.\nThere are lots of new viruses coming every day. The antivirus program regularly updates its\ndatabase and provides immunity to the system against these new viruses, worms, etc.\n3 Image courtesy: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2b\/Digital_Signature_diagram.svg\n29 Figure 6: Different anvirus available on the market4\n2.5 FIREWALL\nIt is a hardware\/software which acts as a shield between an organization‟s network and the\ninternet and protects it from the threats like virus, malware, hackers, etc. It can be used to\nlimit the persons who can have access to your network and send information to you.\nFigure 7: Firewall5\nThere are two type of traffic in an organization viz. inbound traffic and outbound traffic.\nUsing firewall, it is possible to configure and monitor the traffic of the ports. Only the packets\nfrom trusted source address can enter the organization‟s network and the sources which are\nblacklisted and unauthorized address are denied access to the network. It is important to have\nfirewalls to prevent the network from unauthorized access, but firewall does not guarantee\nthis until and unless it is configured correctly. A firewall can be implemented using hardware\nas well as software or the combination of both.\n4 Image courtesy: https:\/\/www.flickr.com\/photos\/thomasguest\/3027199004\n5 Image courtesy: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5b\/Firewall.png\n30  Hardware Firewalls: example of hardware firewalls are routers through which the\nnetwork is connected to the network outside the organization i.e. Internet.\n Software Firewalls: These firewalls are installed and installed on the server and client\nmachines and it acts as a gateway to the organizations‟ network.\nIn the operating system like Windows 2003, Windows 2008 etc. it comes embedded with the\noperating system. The only thing a user need to do is to optimally configure the firewall\naccording to their own requirement. The firewalls can be configured to follow “rules” and\n“policies” and based on these defined rules the firewalls can follow the following filtering\nmechanisms.\n Proxy- all the outbound traffic is routed through proxies for monitoring and\ncontrolling the packet that are routed out of the organization.\n Packet Filtering- based on the rules defined in the policies each packet is filtered by\ntheir type, port information, and source & destination information. The example of\nsuch characteristics is IP address, Domain names, port numbers, protocols etc. Basic\npacket filtering can be performed by routers.\n Stateful Inspection: rather than going through all the field of a packet, key features are\ndefined. The outgoing\/incoming packets are judged based on those defined\ncharacteristics only.\nThe firewalls are an essential component of the organizations‟ network. They not only protect\nthe organization against the virus and other malicious code but also prevent the hackers to use\nyour network infrastructure to launch DOS attacks.\n2.6 STEGANOGRAPHY\nIt is a technique of hiding secret messages in a document file, image file, and program or\nprotocol etc. such that the embedded message is invisible and can be retrieved using special\nsoftware. Only the sender and the receiver know about the existence of the secret message in\nthe image. The advantage of this technique is that these files are not easily suspected.\n31 Figure 8: Steganography6\nThere are many applications of steganography which includes sending secret messages\nwithout ringing the alarms, preventing secret files from unauthorized and accidental access\nand theft , digital watermarks for IPR issues, etc.\nLet us discuss how the data is secretly embeded inside the cover file( the medium like image,\nvideo, audio, etc which is used for embed secret data) without being noticed. Let us take an\nexample of an image file which is used as a cover mediem. Each pixel of a high resolution\nimage is represented by 3 bytes(24 bits). If the 3 least significant bits of this 24 bits are altered\nand used for hiding the data, the resultant image, after embeded the data into it, will have un-\nnoticible change in the image quality and only a very experienced and tranined eyes can\ndetect this change. In this way, evcery pixel can be used to hide 3 bits of information.\nSimilerly, introducing a white noise in an audio file at regular or randon interval can be used\nto hide data in an audio or video files. There are various free softwares available for\nSteganography. Some of the popular ones are: QuickStego, Xiao, Tucows, OpenStego, etc.\n6 Image courtesy: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/b8\/Seformatbmp-embedding_full.png\n32 INVESTIGATING CYBER CRIMES: INTRODUCTION\nTO CYBER FORENSIC\nIn the precedding chapters, we have dicussed the prevention techniques for cyber attack. What\nif one have encounter cyber attack? What Next? The next step is to report the cyber crime.\nBut if a person is exposed to cyber forensic principles, the chances that the person accidently\ndistroy the vital cyber evidences are minimized.\n3.1 COMPUTER FORENSICS\nCyber forensic is a branch of science which deals with tools and techniques for investigation\nof digital data to find evidences against a crime which can be produced in the court of law. It\nis a practice of preserving, extracting, analyzing and documenting evidance from digital\ndevices such as computers, digital storage media, smartphones, etc. so that they can be used to\nmake expert opinion in legal\/administrative matters.\nThe computer forensic plays a vital role in an organization as the our dependency on\ncomputing devices and internet is increasing day-by-day. According to a survey conducted by\nUniversity of California7, 93% of all the informaiton generated during 1999 was generated in\ndigital form, on computers, only 7% of the remaining information was generated using other\nsources like paper etc. It not always easy to collect evidences as the data may be temperd,\ndeleted, hidden or encrypted. Digital foransic investigation is a highly skilled task which\nneeds the expose of various tools, techniques and guidelines for fininding and recovering the\ndigital evidances from the crime scene or the digital equipments used in the crime. With\ndigital equipments like smartphone, tablets, palmtops, smart tv, etc having increasing\nprocessing capabilities and computation speed, the possibility of use of these devices in cyber\ncrime cannot be ruled out. A forancis investigator must not only have deep understanding of\nthe working of these devices and also hands-on exposure to the tools for accurate data retrival\nso that the value and intrigity of the data is preserved.\n7 http:\/\/www.isfs.org.hk\/publications\/ComputerForensics_part1.pdf\n33 A computer can be used intentionally or unintentionally to cyber crime. The intentional use is\nto use your computer to send hate mails or installing cracked version of an otherwise licenced\nsoftware into your computer. Unintentional use is the computer you are using contains virus\nand it is spread into the network and outside the network causing major loss to someone in\nfinancial terms. Simillerly a computer can be directly used to commit a digital crime. For\nexample, your computer is used to access the sensitive and classified data and the data is sent\nsomeone inside\/outside the network who can use this data for him own benefit. The indirect\nuse of computer is when while downloading a crack of a software, a trozan horse is stored in\nthe computer, while creates a backdoor in the network to facilitate hacker. Now the hacker\nlogs into your computer and use it for committing cyber crime. An experienced computer\nforensic investigator plays a crucial role in distinguishing direct and indirect attack. Computer\nforensic experts are also useful for recovery of accidental data loss, to detect industrial\nespionage, counterfeiting, etc.\nIn large organization, as soon as a cyber crime is detected by the incident handling team,\nwhich is responsible for monitoring and detection of security event on a computer or\ncomputer network, initial incident management processes are followed8. This is an in-house\nprocess. It follows following steps:\n1. Preparation: The organization prepares guidelines for incident response and assigns\nroles and the responsibilities of each member of the incident response team. Most of\nthe large organizations earn a reputation in the market and any negative sentiment may\nnegatively affect the emotions of the shareholders. Therefore, an effective\ncommunication is required to declare the incident. Hence, assigning the roles based on\nthe skill-set of a member is important.\n2. Identification: based on the traits the incident response team verifies whether an event\nhad actually occurred. One of the most common procedures to verify the event is\nexamining the logs. Once the occurrence of the event is verified, the impact of the\nattack is to be assessed.\n3. Containment: based on the feedback from the assessment team, the future course of\naction to respond to the incident is planned in this step.\n8 http:\/\/countuponsecurity.com\/2012\/12\/21\/computer-security-incident-handling-6-steps\/\n34 4. Eradication: In this step, the strategy for the eradication or mitigate of the cause of\nthe threat is planned and executed.\n5. Recovery: it is the process of returning to the normal operational state after\neradication of the problem.\n6. Lesson Learned: if a new type of incident is encounter, it is documented so that this\nknowledge can be used to handle such situations in future.\nThe second step in the process is forensic investigation is carried out to find the evidence\nof the crime, which is mostly performed by 3rd party companies. The computer forensic\ninvestigation involves following steps:\n1. Identify incident and evidence: this is the first step performed by the system\nadministrator where he tries to gather as much information as possible about the\nincident. Based on this information the scope and severity of the attack is assessed.\nOnce the evidence of the attack is discovered, the backup of the same is taken for the\ninvestigation purpose. The forensic investigation is never performed on the original\nmachine but on the data that is restored from the backup.\n2. Collect and preserve evidence: Various tools like Helix, WinHex, FKT Imager, etc.\nare used to capture the data. Once the backup of the data is obtained, the custody of\nthe evidence and the backup is taken. MD5(message digest) hash of the backup is\ncalculated and matched with the original one to check the integrity of the data. Other\nimportant sources of information like system log, network information, logs generated\nby Intrusion Detection Systems(IDS), port and process information are also captured.\n3. Investigate: The image of the disk is restored from the backup and the investigation is\nperformed by reviewing the logs, system files, deleted and updates files, CPU uses and\nprocess logs, temporary files, password protected and encrypted files, images, videos\nand data files for possible stegnographic message, etc.\n4. Summarize and Presentation: The summery of the incident is presented in\nchronological order. Based on the investigation, conclusions are drawn and possible\ncause is explained.\nWhile carrying out the digital forensic investigation, rules and procedure must be applied.\nSpecially while capturing the evidence. It should be ensured that the actions that are taken for\ncapturing the data do not change the evidence. The integrity of the data should be maintained.\nIt must be ensured that the devices used for capturing the backup are free from contamination.\n35 Moreover, all the activities related to seizure, access, storage or transfer of digital evidence\nmust be fully documented, preserved and available for review9. Prevention is always better\nthan cure. It is always recommended to fine tune your intrusion detection system like firewall\noccasionally perform penetration tests on your network to avoid pray to hacker. Last but not\nthe least, report the crime.\n3.2 WHY SHOULD WE REPORT CYBER CRIME?\nSome of the companies do not report a cyber crime incident because they fear this will harm\ntheir reputation amongst its shareholders. Some of the data are very sensitive and its\ndisclosure may impact their business negatively. But, the fact is until and unless a cyber crime\nincident is reported, the cyber criminals will never be crabbed by the law enforcement\nagencies. This will further worsen the conditions and encourage the criminals to repeat these\ntypes of incidents with the same or the other organizations. So it is very important to identify\nand prosecute them. This will help not only to identify the existing threats to the economy and\nthe infrastructure but also new threats are identified. Depending on the scope of a cyber crime,\nthe cyber crime should be reported to nearest cyber cell of your locality, state cyber cell,\ncentral investigating agencies like CBI, IB or the international bodies like Interpol.\nSome of the addresses of the cyber coordinating units are:\nAssam Haryana\nAddress: CID HQ,Dy.SP., Assam Police A d d r e s s : C y ber Crime and Technical\nContact Details: Ph: +91-361-252-618, +91 Investigation Cell, Joint Commisioner of Police,\n9435045242 Old S.P.Office complex,Civil Lines, Gurgaon\nE-mail id: ssp_cod@assampolice.com E-mail: jtcp.ggn@hry.nic.in\nMumbai Chennai\nAddress: Cyber Crime Investigation Cell, Address: Asst. Commr. of Police, Cyber Crimes\nOffice of Commissioner of Police Cell,\noffice,Annex -3 Building, 1st floor, Near Vepery, Chennai 7\nCrawford Market, Mumbai-01. Contact Details: 04423452348, 04423452350\n9 http:\/\/www.isfs.org.hk\/publications\/011009\/Collins-CIO&CeO.pdf\n36 Contact Details: +91-22-22630829, +91-22- E-mail id: cybercrimechn@yahoo.com\n22641261\nFor Rest of Tamil Nadu,\nWeb site: http:\/\/www.cybercellmumbai.com\nAddress: A-Wing, III rd Floor, Rajaji Bhawan,\nE-mail id: officer@cybercellmumbai.com\nBesant Nagar,\nThane\nChennai-600090\nAddress: 3rd Floor, Police Commissioner\nContact Details: 044-24461959, 24468889,\nOffice, Near Court Naka, Thane West, Thane\n24463888\n400601.\nE-mail id: hobeochn@cbi.gov.in\nContact Details: +91-22-25424444\nWeb site: www.thanepolice.org\nE-Mail: police@thanepolice.org\nBangalore (for whole of the Karnataka) Hyderabad\nAddress: Cyber Crime Police Station, C.O.D Address:\nHeadquarters, Cyber Crime Police Station, Crime Investigation\nCarlton House, # 1, Palace Road, Bangalore - Department,\n560 001 3rd Floor, D.G.P. office, Lakdikapool, Hyderabad\nContact Details: +91-80-2220 1026, +91-80- – 500004\n2294 3050, +91-80-2238 7611 (FAX) C o n t a c t D e t a i l s : + 9 1 - 4 0 - 2 3 24 0663, +91-40-\nWeb site: 2785 2274, +91-40-2785 2040, +91-40-\nhttp:\/\/www.cyberpolicebangalore.nic.in 2329 7474 (Fax)\nEmail-id: Website:\nccps@blr.vsnl.net.in, ccps@kar.nic.in http:\/\/www.cidap.gov.in\/cybercrimes.aspx\nE-mailid:\ncidap@cidap.gov.in, info@cidap.gov.in,\ncybercell_hyd@hyd.appolice.gov.in\nDelhi Pune\nCBI Cyber Crime Cell: Superintendent of Address : Deputy Commissioner of\nPolice, Police(Crime), Office of the\nCyber Crime Investigation Cell, Central Commissioner Office, 2, Sadhu Vaswani Road,\nBureau of Investigation, 5th Floor, Block Camp,Pune 411001\n37 No.3, CGO Complex, Contact Details: +91-20-26123346, +91-20-\nLodhi Road, New Delhi – 3 26127277\nContact Details: +91-11-4362203, 011- +91-20-2616 5396, +91-20-2612 8105 (Fax)\n26851998 Website: www.punepolice.gov.in\n011-26515229, +91-11-4392424 E - M a i l : c r i m e c o m p . p u ne@nic.in,\nWeb site: http:\/\/cbi.nic.in p u n e p o l i c e @ v s n l . c o m\nAsst. Commissioner of Police,\nCyber Crime Cell, EOW, Crime Branch,2nd\nFloor, Police Training School, Malaviya\nNagar, New Delhi-110 017\nE-Mail: cbiccic@bol.net.in, dcp-eow-\ndl@nic.in\nHimachal Pradesh G u j a r a t\nAddress : CID Office ,Dy.SP, Himachal DIG, CID, Crime and Railways. Fifth Floor,\nPradesh Police Bhavan\nSector 18, Gandhinagar 382 018\nContact Details: +91-94180 39449\nContact Details: +91-79-2325 4384, +91-79-\nE-mail:soodbrijesh9@gmail.com 2325 0798, +91-79-2325 3917 (Fax)\nJharkhand Kerala\nAddress: IG-CID,Organized Crime, Rajarani Address : Hitech Cell, Police Head Quarters,\nBuilding, Doranda Ranchi – 834002 T h i r u v a n a n t h a p u r a m\nContact Details:: +91-651-2400 737, +91- Contact Details: +91-471 272 1547, +91-471 272\n651-2400 738 2768\nE-mail: a.gupta@jharkhandpolice.gov.in E-mail: hitechcell@keralapolice.gov.in\nJammu O r i s s a\nAddress: SSP-Crime, CPO Address: CID,Crime Branch, Orissa\nComplex,Panjtirthi, Jammu-180004 C o n t a c t D e t a i l s : + 9 1 9 4 3 74 50370\nContact Details: +91-191-257-8901 E - m a i l : s p l c i d c b . o r p o l @ nic.in\n38 E-mail: sspcrmjmu-jk@nic.in\nMeghalaya Punjab\nAddress: SCRB,Superintendent of Police Address: Cyber Crime Police Station, DSP\nMeghalaya Cyber Crime, S.A.S Nagar,Patiala, Punjab\nContact Details: +91 98630 64997 C o n t a c t D e t a i l s : +91 172 2748 100\nE-mail: scrb-meg@nic.in\nBihar W est Bengal\nAddress: Cyber Crime Investigation Unit, Address: CID, Cyber Crime, West Bengal\nDy.S.P.Kotwali Police Station, Patna C o n t a c t D e t a i l s : + 9133 24506163\nContact Details: +91 94318 18398 E - m a i l : o c c y b e r @ cidwestbengal.gov.in\nE-mail: cciu-bih@nic.in\nUttar Pradesh U t t a r a K h a n d\nAddress: Cyber Complaints Redressal Cell, Address: Special Task Force Office\nNodal Officer Cyber Cell Agra, Agra Range Sub Inspector of Police, Dehradoon\n7,Kutchery Road, Contact Details: +91 135 264098, +91 94123\nBaluganj,Agra-232001, Uttar Pradesh 70272\nContact Details: +919410837559 E-mail:dgc-police-us@nic.in\nE-mail: info@cybercellagra.com\n39 SOME RECENT CYBER SECURITY ATTACKS\n4.1 INTRODUCTION\nThe proliferation of Internet amongt the population is getting deep day-by-day. This not only\nincrease the scope of e-governance and e-commerce in the area of healthcare, banking, power\ndistribution, etc. but also expose these sectors to cyber threats like hacking, credential thefts,\ndata tempering, account hijacking, etc. According to a report,there were around 62,189 cyber\nsecurity incidents, originating mainly from Countries including US, Europe, Brazil, Turkey,\nChina, Pakistan, Bangladesh, Algeria and the UAE, in the period from Jan-May, 2014. Also,\naroung 10,000 Indian government sites were compromised in this period. India has a seroius\nsortage of IT Security professional to deal with such treats in effective manner. According to\na report, India needs around one million cyber security professionals to deal with cyber\nthreats effectively.\n4.2 SOME RECENT CYBER CRIME INCIDENTS\nIn the current section, we will discuss some of the common cyber crimes and fruads incidents\nover internet so that you could appriciate how these little ignorance could lead to a big\ndigaster.\n1. Paypal, an international online money transfer service, which allows you to safely\ntransfer money through an Internet using various encryption techniques and provides\nan alternative to other traditional payment methods like cheques, money orders, etc. It\nhave an active user base of over 100 million active users in 190 countries and\nperforms over 9 million payments daily. It is one of the popular medium of payment\nover online auction sites like ebay etc. It is a convinient medium for trading\nparticularly of the buyers and sellers are from differnet countries and have different\ncurrencies.\nRomanion Hacker TinKode aka Razvan Cernaianu, explioted a loophole in the code\nof the chargeback process of PayPal. Due to this, a user can double its money en every\nattempt. Suppose the user have Rs.1000, this using this loophole, the amount will be\ndoubled to Rs.2000 in the first attempt. Now this Rs. 2000 will be doubled to Rs. 4000\nin the second attempt. Further Rs. 4000 will be doubled to Rs. 8000. Like wise this\nprocess will continue endlessly.\n40 2. In Australia, a website called MP3\/WMA Land, which offers a large number of\npirated songs, music video clips for free download to its users. This resulted in heavy\nfinancial losses to the artists and the producers of those songs. The complain was\nloudeged by an organizations called Music Industry Piracy Investigations.\nThe owners of the website, Ng, Tran and Le, who were the students of Australian\nUniversity, were framed for Australia‟s largest copyright infrigement case(Urbas,\n2012).\n3. One of the intresting case of online stalking was registered by Mrs. Ritu Kohli at Delhi\nPolice (Kaur, 2013). She reported that someone is using her identity over the Internet\nin the website www.mirc.com for chatting, and distributed her address and phone\nnumber. As a result she received a large number of phone calls from all over including\nDubai, Ahemdabad, Mumbai, etc. at odd hours. This caused a lot of mental frustration\nand she decided to report the case. Based on her complain, Delhi Police tracced the IP\naddress and finally traced the address of accused, Manish Kathuria and arrested him.\nA Dubai based NRI was blackmailed, and by the time the case was reported, he had\nalready approximatly 1.25 crore to the accused (Madhya Pradesh State Cyber Police,\n2013). The NRI met a girl over Internet and after a series of long chatting sessions, the\ngirl won the love and trust of the NRI. In the meantime, she introduces him with\nseveral of her friends. Due to some reasons, the relation could not last long. After\nsome time, one of the girl‟s friend, who was introduced to him by the girl, reports him\nthat due to the mental stress of the broken relationship, the girl have commited sucide\nand police is investigating the case. Many fake copies of the letters from CBI, High\nCourt of Calcutta, New York police and Punjab University etc. were also sent to the\nNRI. The NRI seeked help from the girl‟s friend, who in turn introduced her with a\nlaw firm based at Kolkata. The owner of the law firm agreed to take this case. A huge\nsome of money was demanded by the law firm and a total of more that 1.26 crore were\ntransfered on different occassions and he still demamded more money. The NRI smell\nsomething fishy and reported the case to Mumbai Police. The NRI forwarded all the\nemail that he recieved from the girl, her friend and the owner of the law firm. After the\nforansic invertigation for the email, the IP address of all the three persons were found\nto be originated from the same source. After investigation, it was found that the\nidentity of the girl and her friends were all virtual i.e. they does not exist. The owner\nof the law firm was the mastermind who assumed false identity of all the persons and\ncreated this false story to blackmail the NRI.\n41 4. Iran‟s necular facility at Natanz was attacked by virus, Stuxnet which is belived to be\ndeveloped by US (Shubert, 2011). It was not possible to inject the virus though the\nInternet as the network of the the Iran‟s necluer facility is a private network and was\nisolated from rest of the world. The virus first infacted the third party utility which is\nused by Natanz facility and gained assess to the network. The virus was designed to\nattack a specfic system software which controls the operation of Siemens controllers.\nThe virus speeds up or slow down the centrifuges and thus wearing them out\nprematurely. Moreover, it hijacked the system and send false signals about the health\nand status of the necluer plant. Therefore, by the time the effect of the virus was\ndetected, it was too late and the virus have done much harm to the neculear facility.\n5. A trojen mail was used to hack the user name and the password of the current account\nof Mumbai based firm RPG Group and siphoned off Rs. 2.41 crore by Real Time\nGross Sattlement(RTGS) (Narayan, 2013). Th bank officials suspected when they\nnotice the huge amount of money transfer. They confirmed they same from the\ncompanie‟s officials who denied the tranfer of the money to the designmated accounts.\nBased on the names and the address of the of the account holders who have received\nthe money, the police came to know that the account holders have permitted the main\naccused to use their account in return of huge commission.\n6. Chennai police cracked a case of credit card fraud, where two BPO employees with\nthe help of the son of the accused, increased the credit card limt and the\ncommunication address of the credit card owner (Madhya Pradesh State Cyber Police,\n2013). They illigally hacked into their company‟s computer to find out the details of\nthe credit card owner. They credit card company was cheated for about 7 lakhs before\nthe incident was noticed. Due to the chance of the communication address, the owner\nof credit card could not receive montly statements genrerated at the month‟s end. The\ncase was register with the Chennai police. After the digital foransic investigation of\nthe BPO‟s compute system, it was found that its two employees have illegally access\nto the computer to steel the customer record.\n7. A case of copyright infringment was loudged in Andhra Pradesh (Nandanwar, 2013).\nA well known mobile serive operator company launched a promotional campain, in\nwhich it offered a mobile phone at a very low cost to its customers with a lock-in\nperiod of 3-years. The software of the phone was configured in such a way that, in the\nlock-in period the sim of any other company cannot working with the handset. A\ncompititor of that company lured the existing customers of the company which gave\n42 the mobile phone to “unlocked” the phone by cracking the software of the mobile so\nthat any other sim can be used with the handset. The company reported the crime and\nthe case were registered under copyright infringement u\/s 63 of copyrights act.\n8. A gang of criminals is active over the cyber space, which steels the credit card data of\nthe cardholders from the POS at shopping malls, petrol pumps, resturents, hotels, etc.\nand use these cards to book air tickets online. According to the reports, over 15000\ncredit cards were fraudulently used by these criminals to book online tickets which\naccount for approximatly Rs. 17 crore revenue loss. These criminals use public\ninfrastructure like cyber cafe, etc. to book these tickets so that it is difficult to trace\nthem. The fraud came to the notice when the customers who were charged for\nbooking an airticket and these customers reported at the card issuing banks claming\nthat these tickets were never booked by them.\n9. In the year 2000, a worm known as Love Bug worm or VBS\/Loveletter, which\nspecially target Windows operating system based computer system, caused damage\ncosting approx. Rs. 22,000 crore. An spam mail containing “ILOVEYOU” in the\nsubject line and LOVE-LETTER-FOR-YOU.TXT.vbs as an attachment is received. If\nthe used clicked the attachment, the machine gets infacted and the worm start\nsearching all the drive of the computer and start currupting the files. It also start\nforwarding the copies of the email to all the outlook contacts added in the addressbook\nof the user. Nearly 10% machines connected to the Internet were infacted within no\ntime (Madhya Pradesh State Cyber Police, 2013). Many large organizations which\nincludes British parliament, Pentagon have to shut down the email system to stop this\nworm spreading into their network.\n10. Online degree fraud are very popular these days over internet where accredited online\ndegrees are offered by fake Universities (Gollin, 2003). These diploma mills offer to\nturn your work experience into a degree in exchange of money. The transcripts are\nalso issued to the students on the basis of self evaluation. Its only when the students is\nrejected on account of fake degree, he realize that he fell pray to online fraud.\n11. Can you belive a fake tweet message can cost $136 billiion loss within seconds\n(Fisher, 2013). The US stock markets crashed in response to a fake twitter message\nsend via hacked twitter account of Associated Press, USA which reported two\nexplosions in the White House and that President Barack Obama had been injured.\nLater, Syrian Electronic Army, a terrorist group claimed responsibility on its own\nTwitter feed for the AP hack. The hacking was performed by sending a phishing e-\n43 mail. As soon as the link in the phishing e-mail was clicked, a spyware was installed\nin the computer and the information stored in the system were sent to remote servers.\nUsing this information the account of AP was hacked and the hoax was created which\neffected sentiments of the invester of NY Stock Exchange and resulted in heavy loss.\n12. Recently a new virus, which infects the Point of Sale(POS) machines and steals the\npayment record of credit card of the customers. These confidential data like PIN\ncodes, credit card numbers, expiration date, CCV number, etc. are tracked and sent to\nthe hackers so that this information can be misused for commiting financial frauds\n(US-CERT, 2014).\n13. The people with ill intentions are not only looking for your private and confidential\ndata, but are in search of your communication infrastructure so that your identity can\nbe used for hiding their identity so that they are not caught after creating neusence.\nThe terrorist outfit Indian Mujahideen(IM) used the unprotected wi-fi network of a\nMumbai based US citizen, Kenneth Haywood. They hacked his wi-fi network used\nsend an e-mail, which contains his IP address, to a news agency just 5 minutes before\nthe Ahemdabad blast (Chowdhury, Nair, & Johnson, 2008).\n14. The terrorist used open wi-fi network of Matunga's Khalsa College of Arts, Science\nand Commerce, Mumbai to send a terror mail to media house (The Indian Express,\n2008). The terrorists remotely access the router and deleted the system logs after using\nthe network so that it becomes difficult for the investigating to trace the origin of the\nemail.\n15. Pune based software engineer, Asma Sandip Thorve was arrested by economic\noffences wing of Pune police for illegally steeling source code of the software product\nand other confidential information of Brainvisa Technologies due to which the\ncompany lost Rs. 46.5 crores (Times of India, 2009).\n16. There is a new type of crime evolving over internet where a prospective business\npartner will offer you a homebased business oppourtinity with no investment and very\nlucrative commission (Castillo, 2007). Once the person agrees to work with the\ncompany, the prospective business partner will ask for the details like address, phone\nnumbers, photo identity, date of birth, etc. After some time, the person will receive\nparcel at the address with repackging instructions along with the list of addresses\nwhere these parcels are to be dispatched abroad. Actually these goods are purchased\nusing stolen credit cards and the goods are delivered at the address provided by the\nperson. The person will be held responsible if address of the delivery of the goods is\n44 traced by the investigators. The real trouble begins when your commision arrives. It is\nin the form of third party cheque and is of the higher amount then you expected. Some\ndays latter an instruction to return the excess amount electronically is received. Once\nthe excess fund is electonically transferred, the bank will discover that the cheque is\nfake and the person will be help responsible for this act.\n17. Some of the customers of ICICI bank were victim phishing attack (Nair, 2009). Some\nof the customers received an email from a person who claimed to be an official of\nICICI bank. He asked the customers to update their account information using a link\nwhich redirects the customers to a page which is very similler to ICICI bank‟s\nwebpage. The case was registered by the bank officials when this fraud came to the\nknowledge of the bank when some of the customers got suspecious and informed the\nIT department of the bank to verify the source of such email. The bank officials were\nsuprized to find out that the website, which was very closely resembling the bank‟s\nofficial website. If the customer used that link to update his account credentials by\nlogging into the fake website using their user id and the password, these details would\nreached the hackers and they can later use this information to login into the customer‟s\naccount and transfer money aur pruchase goods online.\n18. The cyber criminals have targeted the gas filling station in the US to skim the credit\ncard and debit card data. The hacker planted bluetooth enabled credit card skimmers in\nmost of the gas stations locted in the Southern United States. The customer data which\nincludes information like account number, PIN, CVV, etc eas used by the hackers to\nwithdraw more than $2 million from the ATM mostly located at Manhattan.\n19. The hackers used the tools used by the law enforcement agencies to parse data from\niPhones to steel the private photographs of female celebreties in the US (Hazen,\n2014). The hackers are belived to be using software called Elcomsoft Phone Password\nBreaker and iBrute to log into apple‟s site and download the backupfiles into their\nmachines.\n20. There are many incidents were non- friendly countries launch cyber attacks to gain\naccess to the sensitive information. One such event is Russia is suspected for his\ninvolvement in hacking of US financial system (Farberov, 2014). One of the leading\nbanks JPMorgan Chase was reported to be attacked by Russian hackers. The hackers\nwere successful in steeling the sensitive data from the bank‟s server.\n21. Recently, a Chinese mobile company, Xiaomi was found guilty for sending the\nsensitive data to Chinese servers (Kumar, 2014). This information includes sms,\n45 photographs, contact list, etc. without the knowledge of the users. It‟s not the first time\nthat a Chinese company was help suspected for espionage and US government have\nbanned the use of Chinese equipments in some of its major establishments.\n46 CYBER SECURITY INITIATIVES IN INDIA\n5.1 INTRODUCTION\nWith the growth of internet, the dependence on computers has increased exponentially. The\nchallenge is to protect critical information infrastructure, like civil aviation sector, Railways‟\npassenger reservation system and communication network, port management, companies and\norganisations in power, oil and natural gas sectors, banking and finance, telecom sector, etc.\nfrom cyber attacks. India is ranked fourth among the top 50 countries in terms of the number\nof cyber crime complaints reported to the Internet Crime Complaint Centre (IC3), preceded\nonly by the US, Canada and the UK based on the 2014 IC3 annual report (The Telegraph,\n2015).\nShortage of trained cyber security workforce is of serious concern to India. In comparison to\nChina, US and Russia that have 125000, 91080 and 7300 trained cyber experts respectively;\nIndia has merely 556 cyber experts deployed in various government agencies (Joshi, 2013).\nIndia is considered an IT superpower that is a major exporter of software and hosts major\nITES-based outsourced businesses. Therefore, IT constitutes a major share of Indian\neconomy. Recently, European Union has picked holes in India‟s data security system and\nsuggested that a joint expert group be set up to propose ways on how the country should\ntighten measures for qualifying as a data secure nation (Sen, 2013). Therefore, India needs\nlook seriously into upgrading its Information Security infrastructure and reframe cyber\npolicies to get data secure status from EU. This is crucial for India to retain high-end\noutsourced business, which has a potential of increasing from the existing $20 billion to $50\nbillion.\n5.2 COUNTER CYBER SECURITY INTIATIVES IN INDIA\nTo counter cyber security attacks, Government of India have taken some initiatives which are\nlisted below:\n1. National Counter Terrorism Center(NCTC): After 26\/11 attack in 2008, suddenly\nthe Indian government realized the importance of Counter terrorism initiatives and\nproposed National Counter Terrorism Center(NCTC) to provide intelligence inputs to\nthe decision makers to plan for counter terrorist activities. The NCTC is supposed to\ncoordinate between various State and Central govt. agencies and serve as a single and\n47 effective point of control and coordination of all counter terrorism measures. It is\nmodeled on the American NCTC and Britain‟s Joint Terrorism Analysis Centre and\nwill derive its powers from the Unlawful Activities Prevention Act, 1967 (Mrunal,\n2012).\n2. National Information Security Assurance Programme (NISAP): To create the\nawareness among the people in the government and critical sector organization,\nCERT-In has taken an initiative called National Information Security Assurance\nProgramme (NISAP), to develop and implement information security policy and\ninformation security best practices based on ISO\/IEC 27001 for protection of their\ninfrastructure. CERT-in has established the facility for Computer Forensics for\ninvestigation of cyber crimes and to provide hands on training to the law enforcement\nagencies and judiciary. This infrastructure is being augmented to include network\nforensics and mobile forensics investigation facility. CERT-In is cooperating with\ndefence, banks, judiciary and law enforcement agencies in training their officials as\nwell as extending the support in investigation of cyber crimes (Srinath, 2006).\n3. Computer Emergency Response Team-India(CERT-In): The Indian Computer\nEmergency Response Team was created in 2004 by Department of Information\nTechnology. The purpose of creating CERT-In was to respond to computer security\nincidents, report on vulnerabilities and promote effective IT security practices\nthroughout the country and is also responsible for overseeing administration of the IT\nact (CERT-In, 2014).\n4. Indo US Cyber Security Forum (IUSCSF): The India-US Cyber Security Forum\nwas established in 2001 and is dedicated to protecting the critical infrastructure of the\nknowledge-based economy. The members of the forum are various government and\nprivate sector organizations, both from India and the United States, working under the\nForum‟s auspices, have identified risks and common concerns in cyber security and\ncrafted an action-oriented work plan on securing networked information systems.\nThe Forum focuses on cyber-security, cyber-forensics and related research and works\ntowards enhancing co-operation among law enforcement agencies on both sides in\ndealing with cyber crime. Defence services of both the countries will enhance their\ninteraction through exchange of experience in organizational, technological, and\nprocedural aspects. Ongoing co-operation between India‟s STQC and the US National\nInstitute of Standards and Technology (NIST) will expand to new areas including\nharmonization of standards. CII and their US counterpart have decided to set up an\n48 India Information Sharing and Analysis Centre (ISAC) and India Anti-Bot Alliance\n(„bot‟ refers to software that can be tasked to invade computers and undertake\nmalicious activities remotely on behalf of hackers) (Press Information Bureau, 2006).\n5. National Critical Information Infrastructure Protection Centre (NCIPC) of\nIndia: It is declared as a nodal agency for the protection of critical information\ninfrastructure of India and is responsible for all measures including R&D for\nprotection of critical information infrastructure. Some of the activities that NCIIPC\nperforms are (Chander, 2013):\na. Identification of Critical Sub-sectors\nb. Study of Information Infrastructure of identified critical sub-sectors\nc. Issue of Daily \/ Monthly cyber alerts \/ advisories\nd. Malware Analysis\ne. Tracking zombies and Malware spreading IPs\nf. Cyber Forensics activities\ng. Research and Development for Smart and Secure Environment.\nh. Facilitate CII owners in adoption of appropriate policies, standards, best\npractices for protection of CII.\ni. Annual CISO Conference for Critical Sectors.\nj. Awareness and training\nk. 24X7 operation and helpdesk\n6. National Intelligence Grid (Natgrid) project of India: It is the integrated\nintelligence grid developed by C-DAC-Pune connecting databases of core\nsecurity agencies of the Government of India (C-DAC, 2014). It is a counter\nterrorism measure that collects and collates a host of information from\ngovernment databases including tax and bank account details, credit card transactions,\nvisa and immigration records and itineraries of rail and air travel (Yasmeen, 2013).\nThis combined data will be made available to 11 central agencies, which are: Research\nand Analysis Wing, the Intelligence Bureau, Central Bureau of\nInvestigation, Financial intelligence unit, Central Board of Direct Taxes, Directorate\nof Revenue Intelligence,Enforcement Directorate, Narcotics Control Bureau, Central\nBoard of Excise and Customs and the Directorate General of Central Excise\nIntelligence.\n7. Crime and Criminal Tracking Networks and Systems (CCTNS) project of India:\nIt is a project under National e-Governance Plan(NeGP) covering all 28 States and 7\n49 UTs which aims at creation of a nation-wide networking infrastructure for evolution of\nIT-enabled sophisticated tracking system around 'investigation of crime and detection\nof criminals (PTI, 2013). The goals of the CCTNS are to facilitate collection, storage,\nretrieval, analysis, transfer and sharing of data and information at the police station\nand between the police station and the State Headquarters and the Central Police\nOrganizations. CCTNS would provide a comprehensive database for crimes and\ncriminals, and it would be easier for the law enforcement agencies to track down a\ncriminal moving from one place to another.\n8. National Cyber Coordination Centre (NCCC): National Cyber Coordination\nCentre is a proposed cyber security and e-surveillance agency in India. It is intended\nto screen communication metadata and co-ordinate the intelligence gathering activities\nof other agencies. Some of the components of NCCC include a cyber attack\nprevention strategy, cyber attack investigations and training, etc.\n9. Botnet Cleaning Center: As a part of the Digital India programme, the Government\nis setting up a centre that will detect malicious programmes like „botnets‟ and help\npeople remove such harmful softwares from their devices. “ The Government is\nsetting up „botnet‟ cleaning and malware analysis centre” according to media reports.\nBotnet is a network of malicious software. It can steal information, take control of\ndevice function and carry out cyber attacks like Distributed Denial-of-Service (DdoS).\n10. E-mail policy of Government of India: In present date Email is considered to be as\nthe major source of communication between individuals and organization as well. The\nsame applies to Govt. of India (GOI) as well. E-mail has become major mode of\ncommunications for the entire government. With the increasing use of Emails to\ncommunicate among different Govt. Agencies, the Email Policy was laid down by\nGovernment of India (GOI) in October 2013. Here we will cover some of the\nimportant clause of policy, readers are advised to download policy from Department\nof Electronics and IT website.\n11. Ministry of Home Affairs (MHA): The Ministry of Home Affairs (MHA) is a\nministry of the Government of India. An interior ministry, it is mainly responsible for\nthe maintenance of internal security and domestic policy. Readers are adviced to read\nannual report of the Ministry of Home Affairs. The Ministry of Home Affairs (MHA)\nhas multifarious responsibilities, the important among them being-internal security,\nborder management, CentreState relations, administration of Union Territories,\nmanagement of Central Armed Police Forces, disaster management, etc.\n50 12. National Crime Records Bureau (NCRB): NCRB shall endeavour to empower\nIndian Police with Information Technology and Criminal Intelligence to enable them\nto effectively & efficiently enforce the law & improve public service delivery. This\nshall be achieved through coordination with police forces at National & International\nlevel, upgradation of crime analysis technology, developing IT capability & IT\nenabled solutions.\n13. Data Security Council of India (DSCI): Data Security Council of India (DSCI) is a\npremier industry body on data protection in India, setup by NASSCOM, committed to\nmaking the cyberspace safe, secure and trusted by establishing best practices,\nstandards and initiatives in cyber security and privacy. DSCI brings together national\ngovernments and their agencies, industry sectors including IT-BPM, BFSI, Telecom,\nindustry associations, data protection authorities and think tanks for public advocacy,\nthought leadership, capacity building and outreach initiatives. To further its\nobjectives, DSCI engages with governments, regulators, industry associations and\nthink tanks on policy matters. To strengthen thought leadership in cyber security and\nprivacy, DSCI develops best practices and frameworks, publishes studies, surveys and\npapers. It builds capacity in security, privacy and cyber forensics through training and\ncertification program for professionals and law enforcement agencies and engages\nstakeholders through various outreach initiatives including events, awards, chapters,\nconsultations and membership programs. DSCI also endeavours to increase India‟s\nshare in the global security product and services market through global trade\ndevelopment initiatives. These aim to strengthen the security and privacy culture in\nthe India.\n51 GUIDELINES FOR SECURE PASSWORD, TWO STEP\nVERIFICATION AND USING FREE ANTIVIRUS\n6.1 GENERATING SECURE PASSWORD\n6.1.1 Guideline for setting secure Password10\nChoosing the right password is something that many people find difficult, there are so many\nthings that require passwords these days that remembering them all can be a real problem.\nPerhaps because of this a lot of people choose their passwords very badly. The simple tips\nbelow are intended to assist you in choosing a good password.\nBasics\n Use at least eight characters, the more characters the better really, but most people will\nfind anything more than about 15 characters difficult to remember.\n Use a random mixture of characters, upper and lower case, numbers, punctuation,\nspaces and symbols.\n Don't use a word found in a dictionary, English or foreign.\n Never use the same password twice.\nThings to avoid\n Don't just add a single digit or symbol before or after a word. e.g. \"apple1\"\n Don't double up a single word. e.g. \"appleapple\"\n Don't simply reverse a word. e.g. \"elppa\"\n Don't just remove the vowels. e.g. \"ppl\"\n Key sequences that can easily be repeated. e.g. \"qwerty\",\"asdf\" etc.\n Don't just garble letters, e.g. converting e to 3, L or i to 1, o to 0. as in \"z3r0-10v3\"\nTips\n Choose a password that you can remember so that you don't need to keep looking\nit up, this reduces the chance of somebody discovering where you have written it\ndown.\n Choose a password that you can type quickly, this reduces the chance of somebody\ndiscovering your password by looking over your shoulder.\nBad Passwords\n10 http:\/\/www.lockdown.co.uk\/?pg=password_guide\n52  Don't use passwords based on personal information such as: name, nickname,\nbirthdate, wife's name, pet's name, friends name, home town, phone number, social\nsecurity number, car registration number, address etc. This includes using just part of\nyour name, or part of your birthdate.\n Don't use passwords based on things located near you. Passwords such as \"computer\",\n\"monitor\", \"keyboard\", \"telephone\", \"printer\", etc. are useless.\n Don't ever be tempted to use one of those oh so common passwords that are easy to\nremember but offer no security at all. e.g. \"password\", \"letmein\".\n Never use a password based on your username, account name, computer name or\nemail address.\nChoosing a password\n Use good password generator software.\n Use the first letter of each word from a line of a song or poem.\n Alternate between one consonant and one or two vowels to produce nonsense words.\neg. \"taupouti\".\n Choose two short words and concatenate them together with a punctuation or symbol\ncharacter between the words. eg. \"seat%tree\"\nChanging your password\n You should change your password regularly, I suggest once a month is reasonable for\nmost purposes.\n You should also change your password whenever you suspect that somebody knows it,\nor even that they may guess it, perhaps they stood behind you while you typed it in.\n Remember, don't re-use a password.\nProtecting your password\n Never store your password on your computer except in an encrypted form. Note that\nthe password cache that comes with windows (.pwl files) is NOT secure, so whenever\nwindows prompts you to \"Save password\" don't.\n Don't tell anyone your password, not even your system administrator\n Never send your password via email or other unsecured channel\n Yes, write your password down but don't leave the paper lying around, lock the paper\naway somewhere, preferably off-site and definitely under lock and key.\n Be very careful when entering your password with somebody else in the same room.\n53 Remembering your password\nRemembering passwords is always difficult and because of this many people are tempted to\nwrite them down on bits of paper. As mentioned above this is a very bad idea. So what can\nyou do?\n Use a secure password manager, see the downloads page for a list of a few that won't\ncost you anything.\n Use a text file encrypted with a strong encryption utility.\n Choose passwords that you find easier to remember.\nBad Examples\n \"fred8\" - Based on the users name, also too short.\n \"christine\" - The name of the users girlfriend, easy to guess\n \"kciredref\" - The users name backwords\n \"indescribable\" - Listed in a dictionary\n \"iNdesCribaBle\" - Just adding random capitalisation doesn't make it safe.\n \"gandalf\" - Listed in word lists\n \"zeolite\" - Listed in a geological dictionary\n \"qwertyuiop\" - Listed in word lists\n \"merde!\" - Listed in a foreign language dictionary\nGood Examples\nNone of these good examples are actually good passwords, that's because they've been\npublished here and everybody knows them now, always choose your own password don't just\nuse somebody elses.\n \"mItWdOtW4Me\" - Monday is the worst day of the week for me.\nHow would a potential hacker get hold of my password anyway?\nThere are four main techniques hackers can use to get hold of your password:\n54 1. Steal it. That means looking over your should when you type it, or finding the paper\nwhere you wrote it down. This is probably the most common way passwords are\ncompromised, thus it's very important that if you do write your password down you\nkeep the paper extremely safe. Also remember not to type in your password when\nsomebody could be watching.\n2. Guess it. It's amazing how many people use a password based on information that can\neasily be guessed. Psychologists say that most men use 4 letter obscenities as\npasswords and most women use the names of their boyfriends, husbands or children.\n3. A brute force attack. This is where every possible combination of letters, numbers\nand symbols in an attempt to guess the password. While this is an extremely labour\nintensive task, with modern fast processors and software tools this method is not to be\nunderestimated. A Pentium 100 PC might typically be able to try 200,000\ncombinations every second this would mean that a 6 character password containing\njust upper and lower case characters could be guessed in only 27½ hours.\n4. A dictionary attack. A more intelligent method than the brute force attack described\nabove is the dictionary attack. This is where the combinations tried are first chosen\nfrom words available in a dictionary. Software tools are readily available that can try\nevery word in a dictionary or word list or both until your password is found.\nDictionaries with hundreds of thousands of words, as well as specialist, technical and\nforeign language dictionaries are available, as are lists of thousands of words that are\noften used as passwords such as \"qwerty\", \"abcdef\" etc.\n6.2 USING PASSWORD MANAGER11\nWe use passwords to ensure security and the confidentiality of our data. One of the biggest\nmodern day crimes is identity theft, which is easily accomplished when passwords are\ncompromised. The need of the hour is good password management. Have you ever thought\nof an alternative to remembering your passwords and not repeatedly entering your login\ncredentials? Password managers are one of the best ways to store, back up and manage your\npasswords. A good password is hard to remember and that‟s where a password manager\n11 http:\/\/opensourceforu.efytimes.com\/2015\/01\/peek-top-password-managers\/\n55 comes in handy. It encrypts all the different passwords that are saved with a master password,\nthe only one you have to remember.\n6.2.1 What is a password manager?\nA password manager is software that helps a user to manage passwords and important\ninformation so that it can be accessed any time and anywhere. An excellent password\nmanager helps to store information securely without compromising safety. All the passwords\nare saved using some kind of encryption so that they become difficult for others to exploit.\n6.2.2 Why you should use it?\nIf you find it hard to remember passwords for every website and don‟t want to go through the\n„Forgot password?‟ routine off and on, then a password manager is what you are looking for.\nThese are designed to store all kinds of critical login information related to different websites.\n6.2.3 How does it work?\nPassword managers may be stored online or locally. Online password managers store\ninformation in an online cloud, which can be accessed any time from anywhere. Local\npassword managers store information on the local server, which makes them less accessible.\nBoth have their own advantages, and the manager you use would depend on your need.\nOnline password managers use browser extensions that keep data in a local profile, syncing\nwith a cloud server. Some other password managers use removable media to save the\npassword so that you can carry it with you and don‟t have to worry about online issues. Both\nthese options can also be combined and used as two-factor authentication so that data is even\nmore secure.\n6.2.4 Some popular Password managers\nThe passwords are saved using different encryptions based on the services that the companies\nprovide. The best password managers use a 256-bit (or more) encryption protocol for better\nsecurity, which has been accepted by the US National Security Agency for top secret\ninformation handling. If you have considered using a password manager and haven‟t decided\non one, this section features the top five.\n1. KeePassX: KeePassX is an open source, cross-platform and light weight password\nmanagement application published under the terms of the GNU General Public\nLicense. It was built based on the Qt Libraries. KeePassX stores information about\nuser names, passwords and other login information in a secure database. KeePassX\nuses its own random password generator, which makes it easier to create strong\n56 passwords for better security. It also includes a powerful and quick search tool with\nwhich a keyword of a website can be used to find login credentials that have been\nstored in the database. It allows users to customise groups, making it more user\nfriendly. KeePassX is not limited to storing only usernames and passwords but also\nfree-form notes and any kind of confidential text files.\nFigure 9: KeePassX\nFeatures\n Simple user interface: The left pane tree structure makes it easy to distinguish\nbetween different groups and entries, while the right pane shows more detailed\ninformation.\n Portable media access: Its portability makes it easy to use since there‟s no need to\ninstall it on every computer.\n Search function: Searches in the complete database or in every group.\n Auto fill: There‟s no need to type in the login credentials; the application does it\nwhenever the Web page is loaded. This keeps it secure from key loggers.\n Password generator: This feature helps to generate strong passwords that make it\ndifficult for dictionary attacks. It can be customised.\n Two factor authentication: It enables the user to either unlock the database by a\nmaster password or by a key from a removable drive.\n Adds attachments: Any type of confidential document can be added to the\ndatabase as an attachment, which allows users to secure not just passwords.\n57  Cross-platform support: It works on all supported platforms. KeePassX is an open\nsource application, so its source code can be compiled and used for any operating\nsystem.\n Security: The password database is encrypted with either the AES encryption or\nthe Twofish algorithm, which uses 256-bit key encryption.\n Expiration date: The entries can be expired, based on a user defined date.\n Import and export of entries: Entries: from PwManager or Kwallet can be\nimported, and entries can be exported as text files.\n Multi-language support: It supports 15 languages.\n2. Clipperz: Clipperz is a Web-based, open source password manager built to store login\ninformation securely. Data can be accessed from anywhere and from any device\nwithout any installation. Clipperz also includes an offline version when an Internet\nconnection is not available.\nFigure 10: Clipperz\nFeatures\n Direct login: Automatically logs in to any website without typing login\ncredentials, with just one click.\n Offline data: With one click, an encrypted local copy of the data can be created as\na HTML page.\n No installation: Since it‟s a Web-based application, it doesn‟t require any\ninstallation and can be accessed from any compatible browser.\n58  Data import: Login data can be imported from different supported password\nmanagers.\n Security: The database is encrypted using JavaScript code on the browser and then\nsent to the website. It requires a passphrase to decrypt the database without which\ndata cannot be accessed.\n Support: Works on any operating system with a major browser that has JavaScript\nenabled.\n3. Password Gorilla: Password Gorilla is an open source, cross-platform, simple\npassword manager and personal vault that can store login information and notes.\nPassword Gorilla is a Tcl\/Tk application that runs on Linux, Windows and Mac OS X.\nLogin information is stored in the database, which can be accessed only using a master\npassword. The passwords are SHA256 protected and the database is encrypted using\nthe Twofish algorithm. The key stretching feature makes it difficult for brute force\nattacks.\nFigure 11: Password Gorilla\nFeatures\n Portable: Designed to run on a compatible computer without being installed.\n Import of database: Can import the password database saved in the CSV format.\n Locks the database when idle: It automatically locks the database when the\ncomputer is idle for a specific period of time.\n Security: It uses the Twofish algorithm to encrypt the database.\n Can copy credentials: Keyboard shortcuts can be used to copy login credentials to\nthe clipboard.\n59  Auto clear: This feature clears the clipboard after a specified time.\n Organises groups: Groups and sub-groups can be created to organise passwords for\ndifferent websites.\n4. Gpassword Manager: Gpassword Manager is a simple, lightweight and cross-\nplatform utility for managing and accessing passwords. It is published under the terms\nof the Apache License. It allows users to securely store passwords\/URLs in the\ndatabase. The added entries can be marked as favourites, which then can be accessed\nby right-clicking the system tray icon. The passwords and other login information\nshown in the screen can be kept hidden based on user preferences.\nFigure 12: Gpassword manager\nFeatures\n Access to favourite sites: A list of favourite Web pages can be accessed\nquickly from the convenient „tray‟ icon.\n Quick fill: Passwords and other information can be clicked and dragged onto\nforms for quick filling out.\n Search bar: The quick search bar allows users to search passwords that are\nneeded.\n Password generator: Passwords with user-defined options can be generated\nwith just a click.\n Quick launch: Favourite websites can be launched by right-clicking the tray\nicon.\n5. Password Safe: Password Safe is a simple and free open source application initiated\nby Bruce Schneier and released in 2002. Now Password Safe is hosted on\n60 SourceForge and developed by a group of volunteers. It‟s well known for its ease of\nuse. It is possible to organise passwords based on user preference, which makes it easy\nfor the user to remember. The whole database backup and a recovery option are\navailable for ease of use. Passwords are kept hidden, making it difficult for shoulder\nsurfing. Password Safe is licensed under the Artistic licence.\nFigure 13: Password Safe\nFeatures\n Ease of use: The GUI is very simple, enabling even a beginner to use it.\n Multiple databases: It supports multiple databases. And different databases can be\ncreated for each category.\n Safe decryption: The decryption of the password database is done in the RAM,\nwhich leaves no trace of the login details in the hard drive.\n Password generator: Supports the generation of strong, lengthy passwords.\n Advanced search: The advanced search function allows users to search within the\ndifferent fields.\n Security: Uses the Twofish algorithm to encrypt the database.\n61 6.3 ENABLING TWO-STEP VERIFICATION12\nEvery day, tens of thousands of personal accounts are hacked. Personal information is\ncompromised, passwords are cracked, and lives are put in jeopardy. If you ever use one\npassword for multiple accounts, you are exponentially increasing your vulnerability to being\nhacked. Thankfully, Google has launched its 2-step verification system: anytime an unknown\ndevice is used to sign into your Google account, the user has to provide a verification code in\naddition to the password. So it's not enough for hackers to just get your password; they'll also\nneed physical control of your phone or computer to access your account.\nStep 1: Sign into your Gmail account. Click on a thumbnail of your avatar on the right side\nof the top menu bar, and then click \"Account\" to update your settings.\nFigure 14: Account setting\nStep 2: You will land on your Account Settings page. Scroll down until you find a blue bar\nthat says \"signing in\".\nFigure 15: Signing in\n12 http:\/\/www.wikihow.com\/Set-up-2-Step-Verification-in-Gmail available under an Attribution-\nNoncommercial-Share Alike 3.0 Creative Commons License\n62 Step 3: In the 2-step verification section, you'll see if you already have 2-step verification\nturned on. If it says \"OFF,\" click \"Edit\" to set the feature up.\nFigure 16: Turning on ywo steps verification13\nStep 4: You'll see a page that briefly walks through the steps of setting up 2-step\nverification. Hover over the steps for more detail. Once you're ready, click \"Start setup.\"\nFigure 17: Start setup\nStep 5: Type in your cell phone number. This will be the phone associated with your Google\naccount. Anytime you sign into your Google account from an unknown device (e.g., a public\n13 Image courtesy: Figure 14 to 30 are adopted from http:\/\/www.wikihow.com\/Set-up-2-Step-Verification-in-\nGmail available under an Attribution-Noncommercial-Share Alike 3.0 Creative Commons License.\n63 computer), Google will send a verification code to your phone and you will need to enter that\nbefore you can sign in.\nFigure 18: Entering mobile number for verification\nStep 6: Select whether you'd like to receive a text message or Google Voice call with your\nverification code. Press submit. Then wait for the code to arrive to your phone and enter it in.\nFigure 19: Entering varification code\n64 Step 7: Decide whether to trust this device. If you are turning on 2-step verification from a\npersonal computer or trusted device, check the \"trust this device\" box. You will only be asked\nto enter a verification code when you sign into this account once per 30 days.\nFigure 20: Setting up trust setting of the computer\nStep 8: Press OK, and you have just set up 2-step verification for your Google account! Skip\nany additional steps that seem unfamiliar or confusing for now -- we will address all of them\nin successive sections of this article.\n65 Figure 21: Confirmation\nStep 9: Print a list of backup verification codes and store it in a secure but accessible place,\nlike your wallet. If you ever need to sign into your Google account but don't have your\nprimary phone with you, you can enter one of these codes instead.\n Go to your 2-step verification settings page.\n Under \"How to receive codes,\" click on the \"Show backup codes\" link. Print\nthis page.\nFigure 22: Saving the page\nMethod 1 of 2: Application-Specific Passwords\n66 Figure 23: Setting up application specific password\nStep 1: Understand the need for application-specific passwords. With 2-step verification,\nGoogle has you covered every time you sign into your account from a web browser.\nHowever, if you use your Google account with other applications, such as Microsoft Outlook\nor a mobile device's mail application, those systems cannot ask you for a verification code.\nTherefore, you will need to sign into those systems once with an application-specific\npassword. You will only need to re-enter an application-specific password if you choose to\nreset it and generate a new one for that device.\nFigure 24: Genrating app password\n67 Step 2: Generate application-specific passwords for your devices. Go to your 2-step\nverification settings page or click \"Edit\" next to 2-step verification on the Security Account\nSettings page (steps 1-3 above). Scroll down and click on \"Manage application-specific\npasswords.\"\nFigure 25: Managing application specific passwords\nStep 3: At the top of the page, you will see a list of sites, applications and devices to which\nyou have granted some level of access to your account. If you allowed a third-party website\n(e.g., LinkedIn, Twitter, Foursquare) to comb your Gmail Contacts to find friends, for\nexample, you will see that listed. If you use other Google applications, you will also see those\nlisted. Feel free to revoke access to any site or program you no longer wish to use.\nFigure 26: Configuring applications\n68 Step 4: Scroll down to the field at the bottom for entering the name of a device. Enter in\nsomething that will help you remember what this application-specific password is for -- e.g.,\nMail App on iPhone, Google App on iPhone, Chrome Sync, Outlook, Thunderbird, or\nwhatever describes your application. Click \"Generate password\". You should generate a new\napplication-specific password for each application.\nFigure 27: Generating app password\nStep 5: Open up the application. Go to the settings page where you enter in your Google\nAccount information. Type in your Google account name as usual. Now instead of your\naccount password, type in the application-specific password in the password field. You have\nnow granted this application full access to your Google account. You will only need to enter\nthis password once. There is no need to write it down or memorize it, and it will not be\ndisplayed by Google again.\n69 Figure 28: Testing the password\nStep 6: Click \"Done\" on your web browser once you have successfully entered the\napplication-specific password.\nFigure 29: Revoke the password\nStep 7: Know how to revoke an app's access to your Gmail account. If you don't want to use\nan app anymore, or you lost your phone and want to stop anyone who has it from accessing\nyour Gmail, simply click on the \"Revoke\" button in your application-specific password\nsettings page.\n70 Figure 30: Generating password for andriod phone\nStep 8: Create new application-specific passwords for each application that you connect your\nGoogle Account to! This means if you sync your Google Account to two mail apps and a chat\nclient, you should have three application-specific passwords.\nMethod 2 of 2: If You Lose Your Phone\nIf you lose your phone and have 2-step verification turned on, you can still access your Gmail\naccount. You also can and should follow these steps to stop strangers from gaining access to\nyour Google accounts.\nStep 1: Revoke your current application-specific passwords. If you have a smartphone with\napps linked to your Google account, they will automatically be signed out. When you get a\nnew phone, you can generate new application-specific passwords (see previous section) and\nenter them into your new devices.\nStep 2: Change your Gmail password. Even if someone else has your verification code, they\ncan't get into your Gmail account without your new password. While it's unlikely that the\nperson who has your phone also has cracked your Gmail password, you can never be too sure.\nIf you are logged into Google from any web browser on your mobile device, you'll now also\nautomatically be signed out.\nStep 3: Add a backup phone number if you have a second mobile device. Go to your2-step\nverification settings page and click \"Add a phone number\" in the \"Backup phones\" section.\n71 Step 4: If you don't have a backup phone, use your list of printable backup codes to access\nyour account. On your 2-step verification settings page, click \"Show backup codes\". If you\nhaven't done so already, print out this page and keep it in a safe but accessible place -- such as\nyour wallet.\nStep 5: If you get phone and change your phone number, be sure to revoke access to your\nprevious number on the 2-step verification settings page.\n14\n6.4 SECURING COMPUTER USING FREE ANTIVIRUS\nAs computers become more and more integrated in to our lives, we end up leaving many\nsensitive data on our computer-from passwords, official email id, bank account to personal\nnotes, business plans and other confidential information. So, good security software is a must\nfor everyone. Here is a list of 11 free anti-virus software and its common features which you\ncan select (home users) for your online security. All are listed in alphabetical order\n1. Avast Antivirus– Avast is one of the best free anti-virus software available that provides a\ncomplete protection against security threats. This full-featured antivirus package has the\nfollowing feature: Built in Anti-spyware, Anti-Rootkit, Web shield, Strong self protection,\nP2P and IM shield, Anti-Virus kernel, resident protection, Network shield, Automatic update,\nSystem integration, Windows 64 bit support, Integrated Virus Cleaner. It can be downloaded\nfrom https:\/\/www.avast.com\/index\n2. AVG Antivirus – AVG anti-virus free edition provides basic antivirus and anti-spyware\nprotection for Windows. Following features included in the free edition: Anti-virus , anti-\nspyware and Safe surf feature. It can be downloaded from http:\/\/free.avg.com\/\n3. Avira AntiVir Personal - Avira is a comprehensive, easy to use antivirus program,\ndesigned to reliable free of charge virus protection to home-users. Features included are:\nProtection from virus worms and Trojans, Anti-rootkit, Anti-fishing, Anti dialers. It can be\ndownloaded from http:\/\/www.free-av.com\/\n4. BitDefender - Free Edition uses the same ICSA Labs certified scanning engines found in\nPro version of BitDefender , allowing you to enjoy basic virus protection for no cost at all.\nFeatures includes: On demand Virus Scanner and Remover and Scheduled scanning. It can be\ndownloaded from http:\/\/www.bitdefender.com\/PRODUCT-14-en--BitDefender-Free-\nEdition.html\n14 http:\/\/shaifulaueo.blogspot.in\/p\/free-antivirus_13.html\n72 5. Blink Personal – An all-in one security suite with antivirus limited for one year. Blink\npersonal Security suite features – Antivirus and Anti spyware, Anti root kit, Built-in Firewall\nprotection and Identity protection. It can be downloaded from http:\/\/free-antivirus.eeye.com\/\n6. Calmwin antivirus–An open source, free Antivirus program for Windows\n98\/Me\/2000\/XP\/2003 and Vista. Features include - high detection rates for viruses and\nspyware; automatic downloads of regularly updated Virus Database, Standalone virus\nscanner. It does not include an on-access real-time scanner. It can be downloaded from\nhttp:\/\/www.clamwin.com\/\n7. Comodo Antivirus - has all the functionality of a paid AV without the price – Features\nincludes- Detects and remove viruses from computers and networks. On Access Scanning\nconducts a real-time, scheduled virus scan. Host Intrusion Detection allows you to Intercept\nviruses, spyware, and other malware before they infect your computer.Get updates of the\nlatest virus definitions everyday so you can stay protected against the latest threats. It can be\ndownloaded from http:\/\/antivirus.comodo.com\/\n8. Moon Secure Antivirus - Aims to be the best Free Antivirus for Windows under GPL\nlicense. It offers multiple scan engines, Net shield, Firewall, On access, on Exec scanner and\nrootkits preventions plus features from Commercial Antivirus applications. It can be\ndownloaded from http:\/\/sourceforge.net\/projects\/moonav\/\n9. PCTools Antivirus- with PC Tools AntiVirus Free Edition you are protected against the\nmost nefarious cyber-threats attempting to gain access to your PC and personal information. It\nprotects you fromVirus, worm, Trojan and has Smart Updates, IntelliGuard Protection, file\nguard and email guard. It can be downloaded from http:\/\/www.pctools.com\/free-antivirus\/\n10. Rising Antivirus – Rising Antivirus Free Edition is a solution with no cost to personal\nusers for the life of the product while still provides the same level of detection and protection\ncapability as RISING Antivirus . It protects your computers against all types of viruses,\nTrojans, worms, rootkits and other malicious programs. Ease of use and Smartupdate\ntechnology make it an \"install and forget\" product and entitles you to focus on your own jobs\nwith your computer. It can be downloaded from http:\/\/www.freerav.com\/\n11. Threatfire Lite – Provides Comprehensive protection against viruses, worms, Trojans,\nspyware, rootkits, keyloggers & buffer overflows. And have Real-time behavior-based\nmalware detection, malware quarantine & removal, etc. It can be downloaded from\nhttp:\/\/www.threatfire.com\/download\/\n73 ACTIVITY\n1. Compare the feature of some of the popular free antiviruses.\n2. What is the difference between free antivirus and paid antivirus? Is it safe to use free\nantivirus in your machine?\n3. Use the guidelines to for generating secure passwords and evaluate whether your current\npasswords can be considered as safe or unsafe passwords.\n4. Based on the above guidelines, change your unsafe passwords to safe ones.\n5. Find out some popular password managers and evaluate them based on their\ncharacteristics‟.\n6. Based on the above comparison, choose one of the best password managers for yourself.\n7. Create two step verification for your Gmail account.\n8. Find out how many sites, other than Gmail provide two steps verification.\nRECOMENDED VIDEOS\nhttps:\/\/www.youtube.com\/watch?v=WprjZyY8ZuY\nhttps:\/\/www.youtube.com\/watch?v=mYhJyVKjai4\nhttps:\/\/www.youtube.com\/watch?v=MFyPg2Flf8s\nhttps:\/\/www.youtube.com\/watch?v=iNWUtj9qhPo\nhttps:\/\/www.youtube.com\/watch?v=A9O0zYv-5d0\nhttps:\/\/www.youtube.com\/watch?v=cdRbvO_MXh4\nhttps:\/\/youtu.be\/Xhmae4_fG2o\nhttps:\/\/youtu.be\/COU5T-Wafa4\nhttps:\/\/youtu.be\/cUH3tQbGj4A\nhttps:\/\/youtu.be\/hYyWgPXfx9U\n74 Configuring Firewall in your computer\n7.1 CONFIGURING FIREWALL ON MAC COMPUTER15\nEvery Mac ships with a built-in firewall - a service that can be configured to disallow\ninformation from entering your Mac. But what is a firewall, and why do you need to use it on\nyour Mac?\nEvery time you request information from the Internet, such as a web page or email message,\nyour Mac sends data packets to request the information. Servers receive the packets, and then\nsend other packets back to your Mac. This all happens in a matter of seconds. Once your Mac\nhas reassembled the packets, you'll see something, like an email message or web page.\nFigure 31: Firewall\nA firewall can help prevent bad packets from entering your Mac. Hackers love to run\nautomated applications that can scan thousands of computers (including your Mac) for open\nports that can be exploited. To ensure that random individuals do not gain unauthorized\naccess to your Mac, you should enable Mac OS X's built-in firewall. It will close your Mac's\nopen ports and disallow random network scans.\n7.1.1 Turning on and Configuring the Mac OS X Firewall\nHere's how to turn on and configure your Mac's built-in firewall:\n1. From the Apple menu, select System Preferences. The window shown below appears.\n15 Content and image courtesy(figure 31 to 35): http:\/\/www.macinstruct.com\/node\/165 available under Creative\nCommons Attribution-NonCommercial-ShareAlike 3.0 Unported License\n75 Figure 32: System preference dashboard\n2. Select Security & Privacy.\n3. Click the Firewall tab.\n4. Click the lock icon and authenticate with your administrator username and password.\nThe window shown below appears.\nFigure 33: Security and privacy dashboard\n5. Click Start. The firewall turns on - you'll know it's enabled when you see the green\nlight and the Firewall: On message, as shown below.\n76 Figure 34: Turning on firewall\n6. Click Advanced. The window shown below appears.\nFigure 35: Configuring firewall\n7. Select the Automatically allow signed software to receive incoming connections\ncheckbox. This allows the applications on your Mac to communicate with the outside\nworld.\n8. Select the Enable stealth mode checkbox. This prevents your Mac from responding\nto port scans and ping requests.\n9. Click OK to close the Advanced settings.\n10. Close System Preferences. Your Mac is now protected by the built-in firewall!\n77 7.2 WORKING WITH WINDOWS FIREWALL IN\nWINDOWS716\n7.2.1 Firewall in Windows 7\nWindows 7 comes with two firewalls that work together. One is the Windows Firewall, and\nthe other is Windows Firewall with Advanced Security (WFAS). The main difference\nbetween them is the complexity of the rules configuration. Windows Firewall uses simple\nrules that directly relate to a program or a service. The rules in WFAS can be configured\nbased on protocols, ports, addresses and authentication. By default, both firewalls come with\npredefined set of rules that allow us to utilize network resources. This includes things like\nbrowsing the web, receiving e-mails, etc. Other standard firewall exceptions are File and\nPrinter Sharing, Network Discovery, Performance Logs and Alerts, Remote\nAdministration, Windows Remote Management, Remote Assistance, Remote\nDesktop, Windows Media Player, Windows Media Player Network Sharing Service.\nWith firewall in Windows 7 we can configure inbound and outbound rules. By default, all\noutbound traffic is allowed, and inbound responses to that traffic are also allowed. Inbound\ntraffic initiated from external sources is automatically blocked.\nSometimes we will see a notification about a blocked program which is trying to access\nnetwork resources. In that case we will be able to add an exception to our firewall in order to\nallow traffic from the program in the future.\nWindows 7 comes with some new features when it comes to firewall. For example, \"full-\nstealth\" feature blocks other computers from performing operating system fingerprinting. OS\nfingerprinting is a malicious technique used to determine the operating system running on the\nhost machine. Another feature is \"boot-time filtering\". This features ensures that the firewall\nis working at the same time when the network interface becomes active, which was not the\ncase in previous versions of Windows.\nWhen we first connect to some network, we are prompted to select a network location. This\nfeature is known as Network Location Awareness (NLA). This feature enables us to assign a\nnetwork profile to the connection based on the location. Different network profiles contain\ndifferent collections of firewall rules. In Windows 7, different network profiles can be\n16 Contents and image courtesy( Figure 31 o 43):http:\/\/www.digitalcitizen.life\/gain-additional-control-using-\nwindows-firewall-advanced-security available under Creative Commons Attribution-Noncommercial-Share\nAlike 4.0 International.\n78 configured on different interfaces. For example, our wired interface can have different profile\nthan our wireless interface. There are three different network profiles available:\n Public\n Home\/Work - private network\n Domain - used within a domain\nWe choose those locations when we connect to a network. We can always change the location\nin the Network and Sharing Center, in Control Panel. The Domain profile can be\nautomatically assigned by the NLA service when we log on to an Active Directory\ndomain. Note that we must have administrative rights in order to configure firewall in\nWindows 7.\n7.2.2 Configuring Windows Firewall\nTo open Windows Firewall we can go to Start > Control Panel > Windows Firewall.\nFigure 36: Control pandel dashboard on Windows machine\nBy default, Windows Firewall is enabled for both private (home or work) and public\nnetworks. It is also configured to block all connections to programs that are not on the list of\nallowed programs. To configure exceptions we can go to the menu on the left and select\n\"Allow a program or feature trough Windows Firewall\" option.\n79 Figure 37: Configuring firewall setting\nExceptions\nTo change settings in this window we have to click the \"Change settings\" button. As you can\nsee, here we have a list of predefined programs and features that can be allowed to\ncommunicate on private or public networks. For example, notice that the Core Networking\nfeature is allowed on both private and public networks, while the File and Printer Sharing is\nonly allowed on private networks. We can also see the details of the items in the list by\nselecting it and then clicking the Details button.\nFigure 38: Setting exceptions\n80 Details\nIf we have a program on our computer that is not in this list, we can manually add it by\nclicking on the \"Allow another program\" button.\nFigure 39: Selecting programs not present in the list\nAdd a Program\nHere we have to browse to the executable of our program and then click the Add button.\nNotice that we can also choose location types on which this program will be allowed to\ncommunicate by clicking on the \"Network location types\" button.\nFigure 40: Adding a program\n81 Network Locations\nMany applications will automatically configure proper exceptions in Windows Firewall when\nwe run them. For example, if we enable streaming from Media Player, it will automatically\nconfigure firewall settings to allow streaming. The same thing is if we enable Remote\nDesktop feature from the system properties window. By enabling Remote Desktop feature we\nactually create an exception in Windows Firewall.\nWindows Firewall can be turned off completely. To do that we can select the \"Turn Windows\nFirewall on or off\" option from the menu on the left.\nFigure 41: Customize settings\nFirewall Customization\nNote that we can modify settings for each type of network location (private or public).\nInteresting thing here is that we can block all incoming connections, including those in the list\nof allowed programs.\nWindows Firewall is actually a Windows service. As you know, services can be stopped and\nstarted. If the Windows Firewall service is stopped, the Windows Firewall will not work.\nFigure 42: Enabling firewall from Windows services\nFirewall Service\n82 In our case the service is running. If we stop it, we will get a warning that we should turn on\nour Windows Firewall.\nFigure 43: Firewall notification\nWarning\nRemember that with Windows Firewall we can only configure basic firewall settings, and this\nis enough for most day-to-day users. However, we can't configure exceptions based on ports\nin Windows Firewall any more. For that we have to use Windows Firewall with Advanced\nSecurity, which will be covered in next section.\n7.2.3 How to Start & Use the Windows Firewall with Advanced Security17\nThe Windows Firewall with Advanced Security is a tool which gives you detailed control over\nthe rules that are applied by the Windows Firewall. You can view all the rules that are used by\nthe Windows Firewall, change their properties, create new rules or disable existing ones. In\nthis tutorial we will share how to open the Windows Firewall with Advanced Security, how to\nfind your way around it and talk about the types of rules that are available and what kind of\ntraffic they filter.\n7.2.3.1 How to Access the Windows Firewall with Advanced Security\nYou have several alternatives to opening the Windows Firewall with Advanced Security:\nOne is to open the standard Windows Firewall window, by going to \"Control Panel -> System\nand Security -> Windows Firewall\". Then, click or tap Advanced settings.\n17 http:\/\/www.digitalcitizen.life\/gain-additional-control-using-windows-firewall-advanced-security\n83 In Windows 7, another method is to search for the word firewall in the Start Menu search box\nand click the \"Windows Firewall with Advanced Security\" result.\nIn Windows 8.1, Windows Firewall with Advanced Security is not returned in search results\nand you need to use the first method shared above for opening it.\nThe Windows Firewall with Advanced Security looks and works the same both in Windows 7\nand Windows 8.1. To continue our tutorial, we will use screenshots that were made in\nWindows 8.1.\n7.2.3.2 What Are The Inbound & Outbound Rules?\nIn order to provide the security you need, the Windows Firewall has a standard set of inbound\nand outbound rules, which are enabled depending on the location of the network you are\n84 connected to. Inbound rules are applied to the traffic that is coming from the network and the\nInternet to your computer or device. Outbound rules apply to the traffic from your computer\nto the network or the Internet.\nThese rules can be configured so that they are specific to: computers, users, programs,\nservices, ports or protocols. You can also specify to which type of network adapter (e.g.\nwireless, cable, virtual private network) or user profile it is applied to.\nIn the Windows Firewall with Advanced Security, you can access all rules and edit their\nproperties. All you have to do is click or tap the appropriate section in the left-side panel.\nThe rules used by the Windows Firewall can be enabled or disabled. The ones which are\nenabled or active are marked with a green check-box in the Name column. The ones that are\ndisabled are marked with a gray check-box.\nIf you want to know more about a specific rule and learn its properties, right click on it and\nselect Properties or select it and press Properties in the column on right, which lists the\nactions that are available for your selection.\n85 In the Properties window, you will find complete information about the selected rule, what it\ndoes and in when it is applied. You will also be able to edit its properties and change any of\nthe available parameters.\n7.2.3.3 What Are The Connection Security Rules?\nConnection security rules are used to secure traffic between two computers while it crosses\nthe network. One example would be a rule which defines that connections between two\nspecific computers must be encrypted.\nUnlike the inbound or outbound rules, which are applied only to one computer, connection\nsecurity rules require that both computers have the same rules defined and enabled.\nIf you want to see if there are any such rules on your computer, click or tap \"Connection\nSecurity Rules\" on the panel on the left. By default, there are no such rules defined on\nWindows computers and devices. They are generally used in business environments and such\nrules are set by the network administrator.\n86 7.2.3.4 What Does the Windows Firewall with Advanced Security Monitor?\nThe Windows Firewall with Advanced Security includes some monitoring features as well. In\nthe Monitoring section you can find the following information: the firewall rules that are\nactive (both inbound and outbound), the connection security rules that are active and whether\nthere are any active security associations.\nYou should note that the Monitoring section shows only the active rules for the current\nnetwork location. If there are rules which get enabled for other network locations, you will\nnot see them in this section.\nThe above section discussed on how to setup a firewall on two Operating Systems viz.\nWindows and Mac. Linux have many varients therefore it is not possible to discuss how to\nconfigure firewall on Linux. There are some links in the Recommended Videos section which\ndiscuss the procedure of setting up firewall in various varient of Linux.\nActivity\n1. Setup and configure a firewall in your system.\n2. Find some some of the free and commercially available firewalls over internet.\nRECOMENDED VIDEOS\nhttps:\/\/www.youtube.com\/watch?v=krbivwp4t3U\n87 https:\/\/www.youtube.com\/watch?v=H0g8xJMnT68\nFor linux\nhttps:\/\/www.youtube.com\/watch?v=hkzHtEnFZpc\nhttps:\/\/www.youtube.com\/watch?v=o0a09CQi_48\nhttps:\/\/www.youtube.com\/watch?v=wbzP2-qvc4o\n88 CHOOSING BEST BROWSER TO SUIT YOUR\nREQUIREMENTS\n8.1 FINDING THE BEST BROWSER ACCORDING TO THE\nUSERS REQUIREMENT18\nBrowsers are the key to the Internet these days, at least for most tasks. There are many, many\nbrowsers for every platform and operating system, so the choice can be tough. However, this\nshould help narrow the search.\nStep 1: Determine the age of your computer. How old is your computer? Is it a mobile\ndevice? Know your systems specifications as this may be more suited to some browsers than\nothers.\n18 http:\/\/www.wikihow.com\/Choose-an-Internet-Browser\n89 Step 2: Think about your ideal browser; what would it be able to do? You may want it to be\nquite simple, handling only the bare necessities. You may want some basic features like web\nfeed reading, bookmarking (favorites), or search boxes. Some browsers have a lot more, and\nthat's where it starts to get confusing.\nStep 3: Make sure you know what platform you are on. Some browsers are only available to a\ncertain operating system, or not available to one operating system.\n90 Step 4: Research browsers. Tabbed browsers include Safari (runs on OS X, iPhone and is\nnew to Windows), Firefox (general purpose with the most plug-ins), Opera(supports torrents,\nhandles e-mail and runs on mobile devices), Konqueror (dual purpose file manager),\nSeamonkey (includes HTML editor and e-mail client), Off By One (tiny) and Flock (social\nnetworking).\nStep 5: See the features of all browsers you have found, and compare with what you want.\n91 Step 6: Consider alternative lower-memory browsers, if you have low computer memory.\nConsider Off by One, Dillo, SkipStone and NetSurf.\nStep 7: Consider a text-based browser, if you want an even faster-than-fast(maximum\nspeed\/hyperdrive) experience. Consider ELinks.\n92 Step 8: Find out if you can add features you may want or if there is an easy method to doing\nso such as an existing plugin or extension in the case of Firefox.\nStep 9: Download and install your new browser!\nActivity\n1. Compare the various browsers based on their characteristics‟.\nRECOMMENDED VIDEOS:\nhttps:\/\/www.youtube.com\/watch?v=sr7mgYD2tAc\nhttps:\/\/www.youtube.com\/watch?v=-jHs-RYD7gc\nhttps:\/\/www.youtube.com\/watch?v=gNiz4kfSZnw\n93 GUIDELINES FOR SAFE INTERNET BROWSING\n9.1 SAFE BROWSING\nInternet security is a matter of great concern for internet users. It is important to know if a\nwebsite is secure or not while surfing the internet19. A secure website creates a safe\nconnection between the website and the web browser so that entered data, such as personal\ninformation, credit card details, banking information, etc, is not accessible to unauthorized\nentities. When the browser opens a secured connection, \"https\" can be seen in the URL\ninstead of just http. To know if a website is secure or not, look for the locked yellow colour\npadlock symbol on the lower right corner of the browser window.\n9.1.1 How do I know if a website is secure?\nSome web sites use a secure connection between the web site and your browser. This may be\nimportant to you, for instance, if you want to pay online for a product or a service and have to\nenter credit card information or other personal information. To know if your browser is\nviewing a secure web site, you can look in the lower right part of the window. There is a\nsmall box in the frame of the window to the left of the area that describes which zone you are\nin (usually the Internet zone, with a globe icon). If you see a yellow padlock icon, the web site\nyou are viewing is a \"secure web site.\" If the box is empty, the web site does not have a\nsecure connection with your browser.\n19 http:\/\/ccm.net\/faq\/2-how-do-i-know-if-a-website-is-secure\n94 9.2 TIPS FOR BUYING ONLINE20\nShopping online can be cheaper and more convenient for you and for businesses. However,\nmake sure you understand your rights and the risks before you shop online or bid in an online\nauction.\nI. Pay securely: Don‟t make any payment unless:\n You are on a secure website, and\n You can make a secure payment.\nThis will protect you against fraud and unauthorised credit card transactions. A secure\nwebsite address will always:\n begin with „https:\/\/‟, not „http:\/\/‟\n display the image of a closed padlock (usually in the bottom right corner of your\nbrowser window).\nOnly make a payment if you can see both of these things. Never give out your bank\naccount details, credit card number or other personal details if you are not certain that\nthe business is a reputable trader.\nII. Know the business: Only buy from websites you know and trust. Check that the\ncompany has a physical street address and landline phone number. If the company\noperates from overseas, you might have trouble getting a refund or repair.\nIII. Know the product: Make sure you check whether:\n the product is legal\n the product will work in Australia\n any warranties or guarantees offered are valid in Australia\n the product has an authorised repairer nearby.\nIV. Check the contract: Make sure you read and understand:\n the terms and conditions of sale\n the refund policy\n the delivery details\n returns and repairs policies, including any associated costs.\nV. Check the full cost: Be aware of the full cost of your purchase. Additional costs may\ninclude:\n currency conversion\n taxes\n20 https:\/\/www.qld.gov.au\/law\/your-rights\/consumer-rights-complaints-and-scams\/consumer-advice-rights-and-\nresponsibilties\/tips-to-become-a-smarter-shopper\/tips-for-buying-online\/\n95  postage and delivery fees\n packaging.\nIt might end up being cheaper to buy the product at a local shop.\nVI. Protect your privacy: Only buy online if you are comfortable with a business‟s\nprivacy policy. Do not give out information unless they require it to complete the sale.\nRemember, if a deal sounds too good to be true, it probably is.\nVII. Keep records: Always write down any reference numbers and print out copies of:\n the order form (both before and after you confirm the order)\n receipts (can come by email or in a pop-up window).\nAlways make sure all charges are correct by checking the receipt against your:\n credit card statement\n merchant account statement (such as PayPal)\n bank statement.\nThe charges may be converted from another currency.\nVIII. Online auction sites: Most online auction sites (like eBay) offer a dispute resolution\nprocess for buyers and sellers. This should be your first step to resolve a dispute if:\n you did not receive the items you bought\n you did not receive payment for items you sold\n you received items that were significantly different from their description.\nThe eBay website has an example of this facility.\n9.3 CLEARING CACHE FOR BROWSERS\nYour internet browser's cache stores certain information (snapshots) of webpages you visit on\nyour computer or mobile device so that they'll load more quickly upon future visits and while\nnavigating through websites that use the same images on multiple pages so that you do not\ndownload the same image multiple times21. Occasionally, however your cache can prevent\nyou from seeing updated content, or cause functional problems when stored content conflicts\nwith live content. You can fix many browser problems simply by clearing your cache. This\narticle contains instructions with screenshots on how to clear the cache for all major browsers.\n9.3.1 Clearing cache for Chrome Browsers above version 10\n21 http:\/\/www.wikihow.com\/Clear-Your-Browser%27s-Cache\n96 Step 1: Open the settings on Chrome. Click the menu icon in the upper right corner of the\nbrowser to the right. Click settings on the bottom of the menu.\nStep 2: From settings, click \"Show advanced settings. It's located at the very bottom of the\nsettings section.\n97 Step 3: Scroll to the privacy section and click \"Clear browsing data.\n98 Step 4: Select \"Cached images and files\". Uncheck all other options to avoid deleting browser\nhistory, cookies and other things you may wish to retain. Change \"Obliterate the following\nitems from\" to \"the beginning of time\".\nStep 5: Press \"Clear browsing data\". You are done!\n9.3.2 Clearing cache for Chrome Browsers from version 1 to 9\nStep 1: Once your browser is open, select the Tools menu (the wrench in the upper-right\ncorner) and select Options (Preferences on Mac).\n99 Step 2: On the Under the Hood tab, click the Clear Browsing data button.\nStep 3: Select the Empty the cache check-box.\n100 Step 4: You can also choose the period of time you wish to delete cached information using\nthe Clear data from this period dropdown menu.\nStep 5: Click the Clear Browsing Data button.\n101 9.3.3 Clearing cache for Safari for iOS, iPhone and iPad\nStep 1: Click on Settings from the home page.\nStep 2: Scroll down until you see \"Safari.\" Click on it to bring up the option page.\n102 Step 3: Click \"Clear Cookies and Data\". A popup box will appear. Click \"Clear Cookies\nand Data\" again to confirm your choice.\n9.3.4 Clearing cache for Safari for Mac OS x\nStep 1: Once your browser is open, click the Safari menu and select Empty Cache.\n103 Step 2: Click Empty.\n9.3.5 Clearing cache for Safari for windows\n104 Step 1: Once your browser is open, click the gear icon on the top right.\nStep 2: Select \"Reset Safari...\" This will prompt a screen to open.\nStep 3: Select \"Remove all website data\" at the very bottom of the prompt. Check or\nuncheck any other categories you want reset.\n105 Step 4: Click “Reset”.\n9.3.6 Clearing cache for Internet explorer 9, 10 and 11\nStep 1: Once your browser is open, click the gear icon at the top right to open the\nSettings menu. Then, select Safety and Delete Browsing History.\n106 Step 2: Select Temporary Internet Files. You will also need to uncheck all of the other boxes,\nespecially Preserve Favorites website data. This option makes the window also delete objects\nfrom websites in your Favorites folder, which is necessary to completely clear your cache.\nStep 3: Click the Delete button near the bottom of the window to perform the operations (i.e.\nclear your cache by deleting temporary files).\n107 Step 4: Your computer will work for a moment, and then the process will be complete.\nYou've successfully cleared Internet Explorer 9's Cache!\n9.3.7 Clearing cache for Internet explorer 8\nStep 1: Once your browser is open, click the Tools menu.\n108 Step 2: Click on Delete Browsing History.\nStep 3: Select Temporary Internet Files.\n109 Step 4: Click the Delete button near the bottom of the window to delete your temporary files\n(i.e. clear your cache).\nStep 5: Set your cache to delete every time you close Internet Explorer. If you want the\nbrowser to automatically clear the cache whenever you close it, close the 'Delete Browsing\nHistory' window, select 'Internet Options' from the Tools menu, and check the 'Delete\nBrowsing history on exit' checkbox.\n110 Note: IE8 has a \"feature\" which retains some cookies even after you clear your cache if you\ndo not UNCHECK the \"Preserve Favorites Website Data.\" If you truly need to clear your\ncache, you will want to uncheck this!\n9.3.8 Clearing cache for Firefox\nStep 1: On a PC, click the \"Firefox\" menu in the top left corner. Next, select the right arrow\nnext to \"History >\", and click \"Clear Recent History\".\nStep 2: Make sure \"Details\" is expanded, then select \"Cache\" from the list. Uncheck\neverything else.\n111 Step 3: In the \"Time Range to Clear\" drop down, select \"Everything\".\nStep 4: Select \"Clear Now\". Your computer will work for a moment, and the process will be\ncomplete. You've successfully cleared Firefox's Cache!\n9.3.9 Clearing cache for Firefox 33\n112 Step 1: Click the Menu button (\"hamburger button\" - the one with three horizontal lines) and\nthen choose Options.\nStep 2: Firefox for Mac: On a Mac, choose Preferences from the Firefox menu and then\ncontinue as instructed below. With the Options window now open, click the Privacy tab. In\nthe History area, click the clear your recent history link.\n113 Step 3: If you wish to clear other kinds of stored data, feel free to check the appropriate\nboxes. They will be cleared with the cache in the next step.\n9.3.10 Clearing cache for opera\nStep 1: Once your browser is open, select the \"Settings\" menu and click \"Delete private\ndata\".\nStep 2: Make sure the \"Delete entire cache\" box is checked. Make sure any unwanted\ncategories are left unchecked.\n114 Step 3: Press “Delete”.\n9.3.11 Clearing cache for Ccleaner\nCcleaner- This is a computer maintenance tool that lets you scan and delete browser cache\nand cookies. Launch it, go to Cleaner tab and make sure to check the Temporary internet files\nfor the browser you have.\n115 Activity\na. Perform the cache clearing opetation on your system browser.\nb. Perform the cache clearing operation on the browser of your smartphone.\nc. Install Ccleaner in your system and use it to perform cache clearing operation.\nd. Find out whether the popular websites you visit daily are secure or not.\ne. Can you find any banking site that does not use https:\/\/\nf. Can you find some social networking site that does not use https:\/\/\ng. Can you list down some important points that should be kept in mind before going for\nonline shopping.\n116 WIRELESS SECURITY\nThis chapter is about different kind of Best Practices that should be followed when using\nWireless LAN.\n10.1 WHAT IS WIRELESS LAN?\nThe Wireless LAN or WLAN is becoming a popular way to connect devices such as\ncomputers these days. In offices and homes, WLAN has become an alternative way of\ncommunication compared to wired LAN. The convenience to connect different devices is\nboth cost effective and easily maintainable. The Wikipedia says: “Wireless LANs have\nbecome popular in the home due to ease of installation, and the increasing to offer wireless\naccess to their customers; often for free.”\nThe other factors why WLANs are becoming more acceptable are:\n1. No need to be connected physically with each other through any medium such as cables.\nYou can roam around freely in office premises, home or around.\n2. WLANs are cost effective. Cabling all the way in the offices, hotels etc are not needed.\nSo it‟s cheap and provides same quality of service.\n3. Unreachable spots where a cable is hardly accessible, WLAN signals can reach out such\nas big installations like airports. Also surfing outdoors is also convenient. Just install the\ndevice called Access Points (AP) and you are done.\n4. Less interruption and easy trouble shooting in case of failures as compared to cabled\nnetworks.\n5. More secure as most of APs support best encryption methods which protect them from\nsniffing and other attacks.\nFigure 44: A typical Wireless network\n117 10.2 MAJOR ISSUES WITH WLAN\nHaving said that, WLAN are also as prone to various attacks as their counterpart wired LNAs\nare. Actually WLANs are easier to hack as compared to wired LANs, if not properly\nconfigured, due to its easy accessibility around the installation. No need to be in contact of\nphysical wires to hack can be done from anywhere. Its convenience can turn into serious risk\nto the organization if not configured properly. Major attacks include such as, Sniffing, Key\ncracking, DoS (Denial of Service), Deauthentication attacks, War driving etc. This chapter is\nnot focused on attacks, we shall mainly concentrate on best practices- how to install and use\nWLAN securely which can thwart a number of above mentioned attacks.\n10.2.1 Secure WLAN\nWireless Security mainly depends on these 3 factors:\n How much is your wireless network secured in terms of encryption being used.\n Monitoring for suspicious and unusual activities.\n User awareness and education.\nThese are the combination of various approaches ranging from corporate to home networks.\nThese are also for users how to remain safe while surfing.\n10.2.2 Wi-Fi at home\nUsing a Wi-Fi at home is not a luxury anymore it has become a necessity. However, when the\nquestion of security comes into the scene, the first thought that would arise in my mind is how\nyou can protect something which you cannot see, neither can you feel it? Protecting a home\nwireless network is altogether a different side of the coin as compared to wired networks.\nMost of wireless network device vendor‟s and Internet Service provider do not provide any\nsecurity settings by default and leave the customer to fend for herself. So make sure, your\nnetwork is secured from being maliciously used.\nThere is no silver bullet that will protect your wireless network infrastructure. These are,\nhowever, some countermeasures listed below that should be used in conjunction with each\nother to secure your wireless network to the highest level:\n1. Use most secure possible encryption: The first and most necessary step- use industry\nstandard encryptions. The old (however generally used) WEP-Wired Equivalent Privacy, has\nbeen known to be broken. Even you use complex passwords it can be broken and decrypted\nwithin minutes or hours. WEP uses 40 bit or 128 bits RC4 ciphers to encrypt the channel.\n118 Instead use secure protocols such as WPA 2 – Wi-Fi Protected Access- 2, which uses strong\n128 bits AES ciphers and is typically considered more robust encryption strategy available.\nAttacks mitigated: WEP Key cracking, Sniffing, Capturing\/Eavesdropping\n2. Use Firewall: All the wireless routers come with built-in firewalls. Enable them with all\nthe security features. You should block any anonymous ping requests and place restrictions on\nwebsite browsing, if required. Define additional security policies and apply them.\nAttacks mitigated: Fingerprinting, System compromise\n3. Have a monitoring system in place: There‟s a saying- prevention is better than a cure. If\nyou are able to detect some suspicious activities before it penetrates your network, you can\nblock them or take precautionary measures. Deploy WIPS\/WIDS for monitoring suspicious\nactivities.\nAttacks mitigated: Scanning, DoS\n4. Don’t use default credentials: Every wireless router comes with a set of default\nusername\/password. Sometimes, people don‟t change them and keep using them for long\ntime. Username and passwords are used by computers or other devices to connect to wireless\nrouter. If any hacker is able to guess them, he can connect to your network easily. Studies\nshow that majority of users use the same combination of username\/passwords as set by\nmanufacturers. Some default username combinations are: admin\/admin, admin\/password or\nadmin\/ “ “.\nAttacks mitigated: Unauthorized access, War driving\n5. Disable Auto-connect feature: Some devices or the computers\/laptops have „Let this tool\nmanage your wireless networks‟ or „Connect automatically to available network‟. Such users\nhaving this auto-connect feature enabled are prone to Phishing attack or Rogue AP attack.\nAttackers keep their APs alive and kicking for such kind of unsuspecting users. They also use\nluring names as „HotSpot‟, „SecureConnect‟, ‟GovtNetworks‟ etc. The user will never suspect\nthem and keep surfing the wireless network happily. Also if you have not changed the default\npassword of your router, the attacker will try to use this feature on their machine and\nautomatically connect using the easily guessable default passwords.\nAttacks mitigated: Phishing, Sniffing, Rouge AP association\n6. Don’t use public Wi-Fi spots to surf sensitive websites: Free and open wireless\nnetworks available on airports, cafes, railway stations are not very secure by nature. They do\n119 not use any encryption to secure the channel between your laptop to the router. So any\ninformation which is not by default going on HTTPS from your laptop\/smart phone is\nsusceptible to sniffing and even more your session could be hijacked because the unencrypted\nchannel may leak the active session ID used by your website. Recently to demonstrate these\ntypes of attacks one researcher developed a tool Firesheep\n[http:\/\/codebutler.github.com\/firesheep\/]. All the attacker needs to do is to just install this tool\nin Firefox and start sniffing the communications on a public unencrypted Wi-Fi. Some\napplications like Facebook encrypts the login page [HTTPS] but internal pages are served on\nunencrypted [HTTP] channel so your session ID can be leaked.\nAttacks mitigated: Sniffing, Session Hijacking\n7. Change the default SSID: Although this will not prevent hackers breaking into a network,\nusing a default SSID acts as an indication that the user is careless. So he may be an obvious\ntarget to explore further to see if he still uses the default passwords as well?\nAttacks mitigated: War driving\n8. Restrict access by assigning static IP addresses and MAC filtering: Disable automatic\nIP assigning feature and use private static IPs to the legitimate devices you want to connect.\nThis will help you in blocking unwanted devices from being connected to your network. Also,\nenable MAC filtering- router remembers MAC of each and every device connected to it and\nsaves it as list. You can use this facility to restrict access. Only a set of trusted devices can be\nallowed to connect. However MAC spoofing is still possible but it raises an extra bar for your\nwireless network.\n9. Turn off your router when not in use: Last but not least, a little obvious, but it will save\nyour network from all the attacks for that time period.\n1.7.2.3 Wi-Fi in a Corporate\/Enterprise Network\nDue to the nature of activity and criticality of information, it is very important that Corporate \/\nEnterprise networks have a higher degree of security.\nThe following are good to have:\n Defining an adequate organization wide Information Security policy & procedures for\nwireless network\n120  SSID‟s should not be associated with the organization, AP vendor or any other related\ninformation which would be easy to guess or associate with the current organization\n Enable WPA2 Enterprise encryption with RADIUS authentication and use of EAP\nprotocol like EAP-TTLS, TLS etc.\n Implementation of PKI infrastructure. CA signed certificates to authenticate the server\nto client and vice versa\n Filtering of clients based on unique identifier like MAC Address\n Isolated „Guest‟ wireless network with no interface \/ connection to the corporate\nnetwork\n Limiting the radius of Wi-Fi network by reducing the power output of the AP\n Allocating IP Address to the employee and guest machines only after successful\nauthentication\n Periodically changing the keys & passwords\n Use of VPN while accessing corporate information from Public Wi-Fi network\n Client side utilities like DecaffeintIDcan help in detecting changes in ARP table and\nserve as common man‟s IDS to protect against attacks like „hole196‟ and DoS.\n Implementation of Wireless IDS. Wireless IDS is a new concept. The key features of\nWireless IDS are:\n Prevention against Rogue AP‟s\n Detection & prevention against DoS attacks\n Assistance in locating the approximate physical location of the attacker\n Assistance in enforcing the Organization‟s Information Security policy on\nwireless networks\n Detection of use of scanning tools like Kismet & NetStumbler\nACTVITY\n1. What are the precations one should take using a wi-fi network at public place?\n2. How to secure home network?\n3. How to secure enterprise network?\n4. Find more about the terms over inernet:\n IDS\n DOS\n Kismet\n NetStumbler\n121 RECOMENDED VIDEOS\nhttps:\/\/www.youtube.com\/watch?v=_WHynHcXm7c\nhttps:\/\/www.youtube.com\/watch?v=Jmszt__J204\nhttps:\/\/www.youtube.com\/watch?v=aktovPyT0iM\nhttps:\/\/www.youtube.com\/watch?v=CStMHLQWa_8\nhttps:\/\/www.youtube.com\/watch?v=a9q-tDRCTtc\nhttps:\/\/www.youtube.com\/watch?v=xex1h93fnI8\nhttps:\/\/www.youtube.com\/watch?v=a9q-tDRCTtc\n122 EMAIL AND SOCIAL MEDIA SECURITY\n11.1 SAFE BROWSING GUIDELINES FOR SOCIAL\nNETWORKING SITES22\nOnline communities have existed since the invention of the internet. First there were bulletin\nboards and email lists, which gave people around the world opportunities to connect, to\ncommunicate and to share information about particular subjects. Today, social networking\nwebsites have greatly expanded the range of possible interactions, allowing you to share\nmessages, pictures, files and even up-to-the-minute information about what you are doing and\nwhere you are. These functions are not new or unique – any of these actions can also be\nperformed via the internet without joining a social networking site.\nAlthough these networks can be very useful, and promote social interaction both online and\noffline, when using them you may be making information available to people who want to\nabuse it. Think of a social networking site as being like a huge party. There are people there\nthat you know, as well as some that you don't know at all. Imagine walking through the party\nwith all your personal details, and up-to-the-minute accounts of what you are thinking, written\non a big sign stuck on your back so that everyone can read it without you even knowing. Do\nyou really want everyone to know all about you?\nRemember that social networking sites are owned by private businesses, and that they make\ntheir money by collecting data about individuals and selling that data on, particularly to third\nparty advertisers. When you enter a social networking site, you are leaving the freedoms of\nthe internet behind and are entering a network that is governed and ruled by the owners of the\nsite. Privacy settings are only meant to protect you from other members of the social network,\nbut they do not shield your data from the owners of the service. Essentially you are giving all\nyour data over to the owners and trusting them with it.\nIf you work with sensitive information and topics, and are interested in using social\nnetworking services, it is important to be very aware of the privacy and security issues that\nthey raise. Human rights advocates are particularly vulnerable to the dangers of social\nnetworking sites and need to be extremely careful about the information they reveal about\nthemselves AND about the people they work with.\n22 https:\/\/securityinabox.org\/en\/guide\/social-networking\n123 Before you use any social networking site it is important to understand how they make you\nvulnerable, and then take steps to protect yourself and the people you work with. This guide\nwill help you understand the security implications of using social networking sites.\n11.1.1General Tips on using Social Networking platforms safely\nSocial media have become an evident part of our life. We share out updates with our friends,\nfamily and anyone who is concerned using social media. But the hackers can use this\ninformation to steal sensitive data and hack your account. Given below are some of the\ngeneral tips on using social media.\n Always ask the questions:\n Who can access the information I am putting online?\n Who controls and owns the information I put into a social networking site?\n What information about me are my contacts passing on to other people?\n Will my contacts mind if I share information about them with other people?\n Do I trust everyone with whom I'm connected?\n Always make sure you use secure passwords to access social networks. If anyone\nelse does get into your account, they are gaining access to a lot of information about\nyou and about anyone else you are connected to via that social network. Change your\npasswords regularly as a matter of routine.\n Make sure you understand the default privacy settings offered by the social\nnetworking site, and how to change them.\n Consider using separate accounts\/identities, or maybe different pseudonyms, for\ndifferent campaigns and activities. Remember that the key to using a network safely is\nbeing able to trust its members. Separate accounts may be a good way to ensure that\nsuch trust is possible.\n Be careful when accessing your social network account in public internet\nspaces. Delete your password and browsing history when using a browser on a\npublic machine.\n Access social networking sites using https:\/\/ to safeguard your username, password\nand other information you post. Using https:\/\/ rather than http:\/\/ adds another layer of\nsecurity by encrypting the traffic from your browser to your social networking site.\n Be careful about putting too much information into your status updates – even if you\ntrust the people in your networks. It is easy for someone to copy your information.\n124  Most social networks allow you to integrate information with other social networks.\nFor example you can post an update on your Twitter account and have it automatically\nposted on your Facebook account as well. Be particularly careful when integrating\nyour social network accounts! You may be anonymous on one site, but exposed\nwhen using another.\n Be cautious about how safe your content is on a social networking site. Never rely on\na social networking site as a primary host for your content or information. It is\nvery easy for governments to block access to a social networking site within their\nboundaries if they suddenly find its content objectionable. The administrators of a\nsocial networking site may also decide to remove objectionable content themselves,\nrather than face censorship within a particular country.\n11.1.2 Posting Personal Details\nSocial networking sites ask you for a good deal of data about yourself to make it easier for\nother users to find and connect to you. Perhaps the biggest vulnerability this creates for users\nof these sites is the possibility of identity fraud, which is increasingly common. In addition,\nthe more information about yourself you reveal online, the easier it becomes for the\nauthorities to identify you and monitor your activities. The online activities of diaspora\nactivists from some countries have led to the targeting of their family members by the\nauthorities in their homelands.\nAsk yourself: is it necessary to post the following information online?\n birth dates\n contact phone numbers\n addresses\n details of family members\n sexual orientation\n education and employment history\n11.1.3 Friends, Followers and Contacts\nThe first thing you will do after filling in your personal details with any social networking\napplication is establish connections to other people. Presumably these contacts are people you\nknow and trust – but you may also be connecting to an online community of like-minded\nindividuals that you have never met. The most important thing to understand is what\ninformation you are allowing this online community to have.\n125 When using a social network account such as Facebook, where a lot of information about\nyourself is held, consider only connecting to people you know and trust not to misuse the\ninformation you post.\n11.1.4 Status Updates\nOn Twitter and Facebook and similar networks, the status update answers the questions: What\nam I doing right now? What's happening? The most important thing to understand about the\nstatus update is who can actually see it. The default setting for the status update on most\nsocial networking applications is that anyone on the internet can see it. If you only want your\ncontacts to see the updates, you need to tell the social networking application to keep your\nupdates hidden from everyone else.\nTo do this in Twitter, look for “Protect Your Tweets”. In Facebook, change your settings to\nshare your updates with “Friends Only”. Even if you switch to those settings, consider how\neasy it is for your information to be reposted by followers and friends. Agree with your\nnetwork of friends on a common approach to passing on the information posted in your social\nnetworking accounts. You should also think about what you may be revealing about your\nfriends that they may not want other people to know; it's important to be sensitive about this,\nand to ask others to be sensitive about what they reveal about you.\nThere have been many incidents in which information included in status updates has been\nused against people. Teachers in the US have been fired after posting updates about how they\nfelt about their students; other employees have lost their jobs for posting about their\nemployers. This is something that nearly everyone needs to be careful about.\n11.1.5 Sharing Online Content\nIt's easy to share a link to a website and get your friend's attention. But who else will be\npaying attention, and what kind of reaction will they have? If you share (or \"like\") a site that\nopposes some position taken by your government, for example, agents of that government\nvery might well take an interest and target you for additional surveillance or direct\npersecution.\nIf you want your contacts (and of course the administrators of the social networking platform\nyou use) to be the only ones who can see the things you share or mark as interesting, be sure\nto check your privacy settings.\n11.1.6 Revealing your Location\n126 Most social networking sites will display your location if that data is available. This function\nis generally provided when you use a GPS-enabled phone to interact with a social network,\nbut don't assume that it's not possible if you aren't connecting from a mobile. The network\nyour computer is connected to may also provide location data. The way to be safest about it is\nto double-check your settings.\nBe particularly mindful of location settings on photo and video sharing sites. Don't just\nassume that they're not sharing your location: double-check your settings to be sure.\n11.1.7 Sharing Videos and Photos\nPhotos and videos can reveal people's identities very easily. It's important that you have the\nconsent of the subject\/s of any photo or video that you post. If you are posting an image of\nsomeone else, be aware of how you may be compromising their privacy. Never post a video\nor photo of anyone without getting their consent first.\nPhotos and videos can also reveal a lot of information unintentionally. Many cameras will\nembed hidden data (metadata tags), that reveal the date, time and location of the photo,\ncamera type, etc. Photo and video sharing sites may publish this information when you upload\ncontent to their sites.\n11.1.8 Instant Chats\nMany social networking sites have tools that allow you to have discussions with your friends\nin real time. These operate like Instant Messaging and are one of the most insecure ways to\ncommunicate on the internet, both because they may reveal who you are communicating with,\nand what you are communicating about.\nConnecting to the site via https is a minimum requirement for secure chatting, but even this is\nnot always a guarantee that your chat is using a secure connection. For example, Facebook\nchat uses a different channel to HTTPS (and is more prone to exposure).\nIt is more secure to use a specific application for your chats, such as Pidgin with an Off-the-\nrecord plugin, which uses encryption. Read the 'Pidgin – secure instant messaging' hands-on\nguide.\n11.1.9 Joining and Creating Groups, Events and Communities\nWhat information are you giving to people if you join a group or community? What does it\nsay about you? Alternatively, what are people announcing to the world if they join a group or\ncommunity that you have created? How are you putting people at risk?\n127 When you join a community or group online it is revealing something about you to others. On\nthe whole, people may assume that you support or agree with what the group is saying or\ndoing, which could make you vulnerable if you are seen to align yourself with particular\npolitical groups, for example. Also if you join a group with a large number of members that\nyou don't know, then this can compromise any privacy or security settings that you have\napplied to your account, so think about what information you are giving away before joining.\nAre you using your photo and real name so strangers can identify you?\nAlternatively, if you set up a group and people choose to join it, what are they announcing to\nthe world by doing so? For example, perhaps it is a gay and lesbian support group that you\nhave set up to help people, but by joining it people are openly identifying themselves as gay\nor gay-friendly, which could bring about dangers for them in the real world.\n11.2 EMAIL SECURITY TIPS23\n1. Don't open email attachments that you are not expecting, or which have come from\nsomeone you do not know. When you open such an email, make sure that your anti-virus\nsoftware is up-to-date and pay close attention to any warnings from your browser or email\nprogram.\n2. You can use anonymity software which can help you hide your chosen email service from\nanyone who might be monitoring your internet connection. A good, free software\nprogramme to do this is Tor (Find out more about Tor browser using Google). If you don't\nwant to give away information about your identity through your email, do not register a\nusername or 'Full Name' that is related to your personal or professional life.\n3. You can avoid getting spam (unwanted or junk email) by guarding your email address and\ndistributing it sparingly. Also, never open or reply to any emails you consider to be spam,\nbecause spammers will take this as a proof of the legitimacy of the address and will just\nsend you more spam. Consider using a spam filter, but remember that it needs to be\nmonitored as it may mistake a genuine email for spam.\n4. You should try to avoid your emails being mistaken for spam by the recipients. Spam\nfilters will block messages with certain words in the subject heading. It is worth scanning\nyour spam folder for subject lines that are getting blocked.\n23 https:\/\/survival.tacticaltech.org\/internet\/email\/tips\n128 5. Beware of email scams. Many scam emails pretend to come from a bank, Ebay, Paypal, or\nother online shops. If you get an email telling you that your account is in danger of being\nshut down, or that you need to take immediate action by updating your account\ninformation, be very suspicious: these messages are usually scams. Another frequent scam\nhas you receiving an email from someone you know which says that they have had an\nemergency and asks you to send them money. This person's email account is likely to\nhave been compromised by a scammer.\n6. Pay close attention if your browser suddenly gives you messages about invalid security\ncertificates when you attempt to access a secure webmail account. It could mean that\nsomeone is tampering with the communication between your computer and the server in\norder to intercept your messages.\nACTIVITY\n1. What are anonymous accounts? Find some browsers which supports anonymouity.\n2. After going though the above section, find out whether you were following the above safe\npracitices while handling your social medial account? Find the gaps?\n3. Based on the above recommendations, adjust your social media account settings.\nRECOMENDED VIDEOS\nhttps:\/\/www.youtube.com\/watch?v=EFHfg1bfgVc\nhttps:\/\/www.youtube.com\/watch?v=tkgLHoaFeFk\nhttps:\/\/www.youtube.com\/watch?v=QUyla_nMJis\nhttps:\/\/www.youtube.com\/watch?v=-CeuqCHX7tE\nhttps:\/\/www.youtube.com\/watch?v=xCHTmzfsGmI\n129 SMARTPHONE SECURITY\n24\n12.1 INTRODUCTION\nAdvances in technology now mean that mobile phones can provide services and features\nsimilar to desktop or laptop computers. These Smartphones offer many new ways to\ncommunicate and capture and disseminate media. To provide these new functionalities, the\nsmartphones not only use the mobile network, but also connect to the internet either via a wi-\nfi connection (similar to a laptop at an internet cafe) or via data connections through the\nmobile network operator.\nSo while you can, of course, make phone calls with a smartphone, it is better to view\nsmartphones as small computing devices. This means that the other material in this toolkit is\nrelevant to your use of your smartphone as well as your computer.\nSmartphones usually support a wide range of functionality – web browsing, email, voice and\ninstant messaging over the internet, capturing, storing and transmitting audio, videos and\nphotos, enabling social networking, multi-user games, banking and many other activities.\nHowever, many of these tools and features introduce new security issues, or increase existing\nrisks. For instance, some smartphones have built-in geo-location (GPS) functionality, which\nmeans they can provide your precise location to your mobile network operator by default, and\nto many applications you use on your phone (such as social networking, mapping, browsing\nand other applications). As mentioned before, mobile phones already relay your location\ninformation to your mobile network operator (as part of the normal functions of the phone).\nHowever, the additional GPS functionality not only increases the precision of your location\ninformation, it also increases the amount of places where this information might be\ndistributed.\nIt's worth reviewing all the risks associated with mobile phones discussed in our guide How to\nuse mobile phones as securely as possible as all of them are also relevant to smartphone use.\nThat guide also covers issues of eavesdropping, interception of SMS or phone calls, SIM card\nrelated issues, and best practices.\nIn this guide we'll take a look at the additional security challenges posed by smartphones.\n24 https:\/\/securityinabox.org\/en\/guide\/smartphones\n130 12.2 SMARTPHONE SECURITY GUIDELINES\n12.2.1 Purses, Wallets, Smartphones\nWe have an intuitive understanding of the value of keeping our purse or wallet safe, because\nso much sensitive information is stored in them, and losing them will compromise our privacy\nand safety. People are less aware of the amount of personal information being carried in their\nsmartphones, and consider losing a phone a nuisance rather than a risk. If you also think that a\nsmartphone is a computing device which is always connected to a network and is continually\ncarried around, it also highlights the important difference between a holder of discrete,\npassive information (like a wallet), and an active and interactive item like a smartphone.\nA simple exercise can help illustrate this:\nEmpty the content of your wallet or purse, and take account of sensitive items. Typically you\nmay find: - Pictures of loved ones (~5 pictures) - Identification cards (driver's license,\nmembership cards, social security cards) - Insurance and health information (~2 cards) -\nMoney (~5 bills) - Credit\/Debit cards (~3 cards)\nNow, examine the contents of your smartphone. A typical smartphone user may find some of\nthe above in higher quantities, and in some cases much more valuable items:\n Pictures of loved ones (~100 pictures)\n Email applications and their passwords\n Emails (~500 emails)\n Videos (~50 videos)\n Social networking applications and their passwords\n Banking applications (with access to the bank accounts)\n Sensitive documents\n Sensitive communication records\n A live connection to your sensitive information\nThe more you use smartphones, the more you need to become aware of the associated risks\nand take appropriate precautions. Smartphones are powerful amplifiers and distributors of\nyour personal data. They are designed to provide as much connectivity as possible and to link\nto social networking services by default. This is because your personal data is valuable\ninformation that can be aggregated, searched and sold.\n131 It can be disastrous if you lose your phone without having a backup of your most important\ndata (such as your contacts) in a secure location. Besides backing up your data, make sure you\nalso know how to restore the data. Keep a hard copy of the steps you need to take so you can\ndo it quickly in an emergency.\nIn this chapter we'll start by introducing some smartphone basics – a description of various\nplatforms and some basic setup procedures for securing your information and communication.\nThe remaining parts of this chapter will cover specific precautions related to common uses of\nsmartphones.\n12.2.2 Platforms, Setup and Installation\n12.2.2.1 Platforms and Operating Systems\nAt the time of writing, the most common smartphones in use are Apple's iPhone and Google's\nAndroid, followed by Blackberry and Windows phones. The key difference between Android\nand other operating systems is that Android is, mostly, an Open Source (FOSS) system, which\nallows the operating system to be audited independently to verify if it properly protects users'\ninformation and communication. It also facilitates development of security applications for\nthis platform. Many security-aware programmers develop Android applications with user\nsafety and security in mind. Some of these will be highlighted later in this chapter.\nRegardless what type of smartphone you are using, there are issues that you should be aware\nof when you use a phone which connects to the internet and comes with features such\nas GPS or wireless networking capacities. In this chapter we focus on devices with the\nAndroid platform, because, as mentioned above, it's easier to secure data and\ncommunications. Nonetheless, basic setup guides and some applications for devices other\nthan Android phones are provided, too. Blackberry phones have been presented as “secure”\nmessaging and email devices. This is because messages and emails are securely channeled\nthrough Blackberry servers, out of the reach of potential eavesdroppers. Unfortunately, more\nand more governments are demanding access to these communications, citing need for\nguarding against potential terrorism and organised crime. India, United Arab Emirates, Saudi\nArabia, Indonesia and Lebanon are examples of governments which have scrutinized the use\nof Blackberry devices and demanded access to user data in their countries.\n12.2.2.2 Feature Phones\nAnother category of mobiles are often called 'feature phones'. Recently, feature phones have\nincreased their functionalities to include those of some smartphones. But generally, feature\nphones' operating systems are less accessible, therefore there are limited opportunities for\n132 security applications or improvements. We do not specifically address feature phones,\nalthough many measures discussed here make sense for feature phones too.\n12.2.2.3 Branded and locked smartphones\nSmartphones are usually sold branded or locked. Locking smartphones means that the device\ncan only be operated with one carrier, whose SIM card is the only one that will work in the\ndevice. Mobile network operators usually brand a phone by installing their own firmware or\nsoftware. They may also disable some functionalities or add others. Branding is a means for\ncompanies to increase revenue by channelling your smartphone use, often also collecting data\nabout how you are using the phone or by enabling remote access to your smartphone.\nFor these reasons, we recommend that you buy an unbranded smartphone if you can. A\nlocked phone poses a higher risk since all your data is routed through one carrier, which\ncentralises your data streams and makes it impossible to change SIM cards to disseminate the\ndata over different carriers. If your phone is locked, ask someone you trust about unlocking it.\n12.2.2.4 General Setup\nSmartphones have many settings which control the security of the device. It is important to\npay attention to how your smartphone is set up. In the Hands-on Guides below we will alert\nyou to certain smartphone security settings that are available but not active by default, as well\nas those which are active by default and make your phone vulnerable.\n12.2.2.5 Installing and updating applications\nThe usual way to install new software on your smartphone is to use the iPhone Appstore or\nGoogle Play store, log in with your user credentials, and download and install a desired\napplication. By logging-in you associate your usage of the online store with the logged-in user\naccount. The owners of the application store keep records of this user's browsing history and\napplication choices.\nThe applications which are offered in the official online store are, supposedly, verified by\nstore owners (Google or Apple), but in reality this provides weak protection against what\napplications will do after being installed on your phone. For example, some applications may\ncopy and send out your address book after you install them on your phone. On Android\nphones each application needs to request, during the installation process, what it will be\npermitted to do when it is in use. You should pay close attention to what permissions are\nrequested, and if these permissions make sense for the function of the app you are installing.\nFor example, if you are considering a \"news reader\" application and you find out that it\nrequests the rights to send your contacts over a mobile data connection to a third party, you\n133 should look for alternative applications with appropriate access and rights. )ites. Some users\nmay want to consider these alternative sites to minimize online contact with Google. One of\nthe alternative store is F-Droid ('Free Droid'), which only provides FOSS applications.\nHowever please remember that you should trust the site before you download any apps from\nit. For inexperienced users we recommend that you use Google Play store.\nIf you don't want to (or are unable to) go online to access apps, you can transfer apps from\nsomeone else's phone by sending .apk files (short for 'android application package') via\nbluetooth. Alternetively you could download the .apk file to your device's Micro SD card or\nuse a usb cable to move it there from a PC. When you have received the file, simply long tap\non the filename and you will be prompted to install it. (Note: be especially careful while using\nBluetooth.\n12.2.3 Communicating Securely(Through Voice and Messages) with a\nSmartphone\n12.2.3.1 Secure Voice Communication\nBasic telephony\nIn order to send or receive any calls or communications to your phone, the signal towers\nnearest you are alerted by your phone of its presence25. As a result of those alerts and\ncommunications the network service provider knows the precise geographic location of your\nmobile phone at any given time.\nAbout Anonymity: If you are conducting sensitive phone conversations or sending sensitive\nSMS messages, beware of the above tracking 'feature' of all mobile phones. Consider\nadopting the steps below:\n Make calls from different locations each time, and choose locations that are not\nassociated with you.\n Keep your phone turned off, with the battery disconnected, go to the chosen location,\nswitch your phone on, communicate, switch the phone off and disconnect the battery.\nDoing this habitually, each time you have to make a call, will mean that the network\ncannot track your movements.\n Change phones and SIM cards often. Rotate them between friends or the second-hand\nmarket.\n25 https:\/\/securityinabox.org\/en\/guide\/mobile-phones\n134  Use unregistered pre-paid SIM cards if this is possible in your area. Avoid paying for\na phone or SIM cards using a credit card, which will also create a connection between\nthese items and you.\nAbout eavesdropping: Your phone can be set to record and transmit any sounds within the\nrange of its microphone without your knowledge. Some phones can be switched on remotely\nand brought into action in this way, even when they look as though they are switched off.\n Never let people whom you don't trust get physical access to your phone; this is a\ncommon way of installing spying software on your phone.\n If you are conducting private and important meetings, switch your phone off and\ndisconnect the battery. Or don't carry the phone with you if you can leave it where it\nwill be absolutely safe.\n Make sure that any person with whom you communicate also employs the safeguards\ndescribed here.\n In addition, don't forget that using a phone in public, or in places that you don't trust,\nmakes you vulnerable to traditional eavesdropping techniques, or to having your\nphone stolen.\nAbout interception of calls: Typically, encryption of voice communications (and of text\nmessages) that travel through the mobile phone network is relatively weak. There are\ninexpensive techniques which third parties can use to intercept your written communications,\nor to listen to your calls, if they are in proximity to the phone and can receive transmissions\nfrom it. And of course, mobile phone providers have access to all your voice and text\ncommunications. It is currently expensive and\/or somewhat technically cumbersome to\nencrypt phone calls so that even the mobile phone provider can't eavesdrop – however, these\ntools are expected to become cheaper soon. To deploy the encryption you would first have to\ninstall an encryption application on your phone, as well as on the device of the person with\nwhom you plan to communicate. Then you would use this application to send and receive\nencrypted calls and\/or messages. Encryption software is currently only supported on a few\nmodels of so-called 'smart' phones.\n135 Conversations between Skype and mobile phones are not encrypted either, since at some\npoint, the signal will move to the mobile network, where encryption is NOT in place26. Using\nInternet through your Smartphone over mobile data connections or WiFi can provide more\nsecure ways to communicate with people, namely by using VoIP and employing means to\nsecure this channel of communication. Some smartphone tools can even extend some of this\nsecurity beyond VoIP, to mobile phone calls as well (See Redphone below).\nHere we list a few tools and their pros and cons:\nSkype\nThe most popular commercial VoIP application, Skype, is available for all smartphone\nplatforms and works well if your wireless connectivity is reliable. It is less reliable on mobile\ndata connections.\nSkype is a non Open-Source software what makes it very difficult to independently confirm\nits level of security. Additionally, Skype is owned by Microsoft, which has a commercial\ninterest in knowing when you use Skype and from where. Skype also may allow law\nenforcement agencies retrospective access to all your communications history.\nOther VoIP tools\nUsing VoIP is generally free (or significantly cheaper than mobile phone calls) and leaves few\ndata traces. In fact, a secured VoIP call can be the most secure way to communicate.\nRedPhone is a Free and Open-Source Software application that encrypts voice\ncommunication data sent between two devices that run this application. It is easy to install and\nvery easy to use, since it integrates itself into your normal dialing and contact scheme. But\npeople you want to talk to also need to install and use RedPhone. For ease of use, RedPhone\nuses your mobile number as a way to identify you to your contacts. Unfortunately, this makes\nit more difficult to use RedPhone without a functioning mobile service plan, even on devices\ncapable of using WiFi to connect to the Internet. RedPhone also uses a central server, which\nputs the administrators of the service in a powerful position by allowing them to see much of\nthe meta-data related to your encrypted VoIP calls.\nCSipSimple is a powerful VoIP client for Android phones that is well maintained and comes\nwith many easy set-up wizards for different VoIP services.\n26 https:\/\/securityinabox.org\/en\/guide\/smartphones\n136 Open Secure Telephony Network (OSTN) and the server provided by the Guardian\nproject, ostel.co, currently offers one of the most secure means to communicate via voice.\nKnowing and trusting the entity that operates the server for your VoIP communication needs\nis an important consideration.\nWhen using CSipSimple, you never directly communicate with your contact, instead all your\ndata is routed through the Ostel server. This makes it much harder to trace your data and find\nout who you are talking to. Additionally, Ostel doesn't retain any of this data, except the\naccount data that you need to log in. All your speech is securely encrypted and even your\nmeta data, which is usually very hard to disguise, is blurred since traffic is proxied through\nthe ostel.co server. If you download CSipSimple from ostel.co it also comes preconfigured for\nuse with ostel, which makes it very easy to install and use.\nTool Guides for CSipSimple and Ostel.co are forthcoming. In the meantime, more\ninformation can be found by following the links above.\n12.2.3.2 Sending Messages Securely\nYou should use precautions when sending SMS and using instant messaging or chatting on\nyour smartphone.\nSMS\nSMS communication is insecure by default. Anyone with access to a mobile\ntelecommunication network can intercept these messages easily and this is an everyday\noccurrence in many situations. Don't rely on sending unsecured SMS messages in critical\nsituations. There is also no way of authenticating SMS messages, so it is impossible to know\nif the contents of a message was changed during delivery or if the sender of the message\nreally is the person they claim to be.\nSecuring SMS\nTextSecure is a FOSS tool for sending and receiving secure SMS on Android phones. It\nworks both for encrypted and non-encrypted messages, so you can use it as your default SMS\napplication. To exchange encrypted messages this tool has to be installed by both the sender\nand the recipient of a message, so you will need to get people you communicate with\nregularly to use it as well. TextSecure automatically detects when an encrypted message is\nreceived from another TextSecure user. It also allows you to send encrypted messages to\nmore than one person. Messages are automatically signed making it nearly impossible to\ntamper with the contents of a message. In our TextSecure hands-on guide we explain in detail\nthe features of this tool and how to use it.\n137 Secure Chat\nInstant messaging and chatting on your phone can produce a lot of information that is at risk\nof interception. These conversations might be used against you by adversaries at a later date.\nYou should therefore be extremely wary about what you reveal when you are writing on your\nphone while instant messaging and chatting.\nThere are ways to chat and instant message securely. The best way is to use end-to-end\nencryption, as this will enable you to make sure the person on the other end is who you want.\nWe recommend ChatSecure as a secure text chat application for the Android phones.\nChatSecure offers easy and strong encryption for your chats with Off-the-Record Messaging\nprotocol. This encryption provides both authenticity (you can verify that you are chatting with\nthe right person) and the independent security of each session so that even if the encryption of\none chat session is compromised, other past and future sessions will remain secure.\nChatSecure has been designed to work together with Orbot, so your chat messages can be\nrouted through the Tor anonymizing network. This makes it very hard to trace it or even find\nout that it happened.\nFor iPhones, the ChatSecure client provides the same features, although it is not easy to use\nit with the Tor network.\nWhichever application you will use always consider which account you use to chat from. For\nexample when you use Google Talk, your credentials and time of your chatting session are\nknown to Google. Also agree with your conversation partners on not saving chat histories,\nespecially if they aren't encrypted.\n12.2.3.3 Storing Information on your Smartphone\nSmartphones come with large data storage capacities. Unfortunately, the data stored on your\ndevice can be easily accessible by third parties, either remotely or with physical access to the\nphone. You can take steps to encrypt any sensitive information on your phone by using\nspecific tools.\nDate Encryption Tools\nThe Android Privacy Guard (APG) allows OpenGPG encryption for files and emails. It can\nbe used to keep your files and documents safe on your phone, as well when emailing.\nRecording Password Securely\nYou can keep all your needed passwords in one secure, encrypted file by using Keepass. You\nwill only need to remember one master password to access all the others. With Keepass you\n138 can use very strong passwords for each account you have, as Keepass will remember them for\nyou, and it also comes with a password generator to create new passwords. You can\nsynchronise Keepass password databases between your phone and your computer. We\nrecommned that you synchronise only those passwords that you will actually use on your\nmobile phone. You can create a separate smaller password database on the computer and\nsyncronise this one instead of coping an entire database with all the passwords that you use to\nyour smartphone. Also, since all the passwords are protected by your master password, it is\nvital to use very strong password for your Keepass database.\n12.2.3.4 Sending Email from your Smartphone\nIn this section we will briefly discuss the use of email on smartphones. In the first instance,\nconsider if you really need to use your smartphone to access your email. Securing a computer\nand its content is generally simpler than doing so for a mobile device such as a smartphone. A\nsmartphone is more susceptible to theft, monitoring and intrusion.\nIf it is absolutely vital that you access your email on your smartphone, there are actions you\ncan take to minimize the risks.\n Do not rely on smartphone as your primary means for accessing your email.\nDownloading (and removing) emails from an email server and storing them only on\nyour smartphone is not advised. You can set up your email application to use only\ncopies of emails.\n If you use email encryption with some of your contacts, consider installing it on your\nsmartphone, too. The additional benefit is that encrypted emails will remain secret if\nthe phone falls into wrong hands.\nStoring your private encryption key on your mobile device may seem risky. But the benefit of\nbeing able to send and store emails securely encrypted on the mobile device might outweigh\nthe risks. Consider creating a mobile-only encrytpion key-pair (using APG) for your use on\nyour smartphone, so you do not copy your encryption private key from your computer to the\nmobile device. Note that this requires that you ask people you communicate with to also\nencrypt emails using your mobile-only encryption key.\n12.2.3.5 Capturing Media with your Smartphone\nCapturing pictures, video or audio with your Smartphone can be a powerful means to\ndocument and share important events. However, it is important to be careful and respectful of\nprivacy and safety of those pictured, filmed or recorded. For example, if you take photos or\nrecord video or audio of an important event, it might be dangerous to you or to those who\n139 appear in the recordings, if your phone fell into the wrong hands. In this case, these\nsuggestions may be helpful:\n Have a mechanism to securely upload recorded media files to protected online\nlocation and remove them from the phone instantly (or as soon as you can) after\nrecording.\n Use tools to blur the faces of those appearing in the images or videos or distort the\nvoices of audio or videos recordings and store only blurred and distorted copies of\nmedia files on your mobile device.\n Protect or remove meta information about time and place within the media files.\nGuardian Project has created a FOSS app called ObscuraCam to detect faces on photos and\nblur them. You can choose the blurring mode and what to blur, of course. Obscuracam also\ndeletes the original photos and if you have set up a server to upload the captured media, it\nprovides easy functionality to upload it.\n12.2.3.6 Accessing the Internet Securely from your Smartphone\nAs discussed in our guide How to keep your Internet communication private and our\nguide How to remain anonymous and bypass censorship on the Internet, access to content\non the Internet, or publishing material online such as photos or videos, leaves many traces of\nwho and where you are and what you are doing. This may put you at risk. Using your\nsmartphone to communicate with the Internet magnifies this risk.\nThrough Wi-Fi or Mobile Data\nSmartphones allow you to control how you access the Internet: via a wireless connection\nprovided by an access point (such as an internet cafe), or via a mobile data connection, such\nas GPRS, EDGE, or UMTS provided by your mobile network operator.\nUsing a WiFi connection reduces the traces of data you may be leaving with your mobile\nphone service provider (by not having it connected with your mobile phone subscription).\nHowever, sometimes a mobile data connection is the only way to get online. Unfortunately\nmobile data connection protocols (like EDGE or UMTS) are not open standards. Independent\ndevelopers and security engineers cannot examine these protocols to see how they are being\nimplemented by mobile data carriers.\nIn some countries mobile access providers operate under different legislation than internet\nservice providers, which can result in more direct surveillance by governments and carriers.\n140 Regardless of which path you take for your digital communications with a smartphone, you\ncan reduce your risks of data exposure through the use of anonymising and encryption tools.\nAnonymity of your Smartphone\nTo access content online anonymously, you can use an Android app called Orbot. Orbot\nchannels your internet communication through Tor's anonymity network.\nAnother app, Orweb, is a web browser that has privacy enhancing features like using proxies\nand not keeping a local browsing history. Orbot and Orweb together circumvent web filters\nand firewalls, and offer anonymous browsing.\nProxies\nThe mobile version of Firefox – Firefox mobile can be equipped with proxy add-ons, which\ndirect your traffic to a proxy server. From there your traffic goes to the site you are\nrequesting. This is helpful in cases of censorship, but still may reveal your requests unless the\nconnection from your client to the proxy is encrypted. We recommend the Proxy Mobile add-\non (also from Guardian Project, which makes proxying with Firefox easy. Is also the only\nway to channel Firefox mobile communications to Orbot and use the Tor network.\n12.2.3.7Advanced Smart Phone Security\nGet Full Access to your Smartphone\nMost Smartphones are capable of more than their installed operating system, manufacturers'\nsoftware (firmware), or the mobile operators' programmes allow. Conversely, some\nfunctionalities are 'locked in' so the user is not capable of controlling or altering these\nfunctions, and they remain out of reach. In most cases those functionalities are unnecessary\nfor smartphone users. There are however, some applications and functionalities that can\nenhance the security of data and communications on a smartphone. Also there are some other\nexisting functionalities that can be removed to avoid security risks.\nFor this, and other reasons, some smartphone users choose to manipulate the various software\nand programs running the smartphone in order to gain appropriate privileges to allow them to\ninstall enhanced functionalities, or remove or reduce other ones.\nThe process of overcoming the limits imposed by mobile carriers, or manufacturers of\noperating systems on a smartphone is called rooting (in case of Android devices), or\njailbreaking (in case of iOS devices, like iPhone or iPad). Typically, successful rooting or\njailbreaking will result in your having all the privileges needed to install and use additional\n141 applications, make modifications to otherwise locked-down configurations, and total control\nover data storage and memory of the smartphone.\nWARNING: Rooting or jailbreaking may not be a reversible process, and it requires\nexperience with software installation and configuration. Consider the following:\n There is a risk of making your smartphone permanently inoperable, or 'bricking' it (i.e.\nturning it into a 'brick').\n The manufacturer or mobile carrier warranty may be voided.\n In some places, this process maybe illegal.\nBut if you are careful, a rooted device is a straightforward way to gain more control over your\nsmartphone to make it much more secure.\nAlternative Firmwares\nFirmware refers to programmes that are closely related to the particular device. They are in\ncooperation with the device's operating system and are responsible for basic operations of the\nhardware of your smartphone, such as the speaker, microphone, cameras, touchscreen,\nmemory, keys, antennas, etc.\nIf you have an Android device, you might consider installing a firmware alternative to further\nenhance your control of the phone. Note that in order to install alternative firmware, you need\nto root your phone.\nAn example of an alternative firmware for an Android phone is Cyanogenmod which, for\nexample, allows you to uninstall applications from the system level of your phone (i.e. those\ninstalled by the phone's manufacturer or your mobile network operator). By doing so, you can\nreduce the number of ways in which your device can be monitored, such as data that is sent to\nyour service provider without your knowledge.\nIn addition, Cyanogenmod ships by default with an OpenVPN application, which can be\ntedious to install otherwise. VPN (Virtual Private Network) is one of the ways to securely\nproxy your internet communication (see below).\nCyanogenmod also offers an Incognito browsing mode in which history of your\ncommunication is not recorded on your smartphone.\n142 Full Device Encryption\nIf your phone is rooted you may consider encrypting it's entire data storage or creating a\nvolume on the Smartphone to protect some information on the phone.\nLuks Manager allows easy, on-the-fly strong encryption of volumes with an user-friendly\ninterface. We highly recommend that you install this tool before you start storing important\ndata on your Android device and use the Encrypted Volumes that the Luks Manager provides\nto store all your data.\nVirtual Private Network(VPN) Security\nA VPN provides an encrypted tunnel through the internet between your device and a VPN\nserver. This is called a tunnel, because unlike other encrypted traffic, like https, it hides all\nservices, protocols, and contents. A VPN connection is set up once, and only terminates when\nyou decide.\nNote that since all your traffic goes through the proxy or VPN server, an intermediary only\nneeds to have access to the proxy to analyze your activities. Therefore it is important to\ncarefully choose amongst proxy services and VPN services. It is also advisable to use\ndifferent proxies and\/or VPNs since distributing your data streams reduces the impact of a\ncompromised service.\nACTIVITIES\n1. Find out more about jailbreaking over internet.\n2. Find and use the feature of “off-the –record” option in your chat application and observe\nwhat difference it makes.\n3. Download and use Skype to make a video call to your friend.\n4. Find out more about ObscuraCam over internet.\nRECOMENDED VIDEOS\nhttps:\/\/www.youtube.com\/watch?v=KCObM4PBTVk\nhttps:\/\/www.youtube.com\/watch?v=V8bCyRCqK0k\n143 "}