{"text":"Contents\nIntroduction to Computer Based Control Systems 1\n1.1 Introduction to computer based measurement and control systems 1\n1.2 Role of computers in measurement and (process) control 3\n1.3 Basic components of computer based measurement and control\nsystems 4\n1.4 Architecture – computer based process control system 7\n1.5 Human Machine Interface (HMI) 12\n1.6 Hardware for computer based process control system 13\n1.7 Interfacing computer system with process 19\n1.8 Economics of computer based system for industrial application 24  1\nIntroduction to\nComputer Based Control Systems\nWhile the fundamental purposes and functions of Instrumentation systems have remained the\nsame from its inception, there is a paradigm shift, over the years, in methodology of\nmeasurement, interpretation and control, due to, continuous technological innovations. The\nintroduction of fast and accurate digital technology and components such as analog-to-digital\nconverters, microprocessors and transducers associated with revolutionary advancements in\ncommunication technology has replaced natural scale-up versions of manual monitoring and\ncontrol to highly advanced automated process monitoring and control systems. This chapter\nintroduces the concepts of hardware, software, and communication aspects of computer aided\nmeasurement and control systems and discusses techno-commercial benefits of such systems for\nits application in process industries.\nIn this chapter we will learn the following:\n• Introduction to computer based measurement and control systems\n• Role of computers in process control\n• Basic components of computer based measurement and control system\n• Architecture of computer based control\n• Human Machine Interface (HMI)\n• Hardware of computer based process control system\n• Interfacing computer system with process\n• Economics of computer based system for industrial application\n1.1 Introduction to computer based measurement and control\nsystems\nThe industrial revolution has contributed largely in the development of machine based control\nwhere machines in process industries were took over the work done by human physical power.\nThe early production processes were natural scale-up versions of the traditional manual practices.\nThese were designed as batch process which later was expanded to continuous processes,\nresulting in economical and technological benefits. The industrial process control has\nmodernized with modernization of industries. Process control is therefore not a discovery of\nrecent past, but is rather as old as the industry itself. The engineers and designers of process\nindustries always tried to automate the processes as much as possible and to do so, brought in\nmeasuring instruments. Thus the need of better instrumentation and automatic control became\nthe dominant reason for better operation of industrial processes. Conversely, the advancement in 22 Distributed Control Systems\ninstrumentation and control contributed to the development of larger and more complex\nprocesses, bringing numerous technological and economical benefits to the operator.\nThe earliest recorded suggestions for use of computer for measurement and control (in real-time)\napplication were made by Brown and Campbell in their paper in 1950. The paper contained the\ndiagram, as shown in Figure 1.1 below. In this specific reporting the computer was used in both\nfeedback and feed-forward loops. These scientists also suggested using digital computing\nelements (logics) for setting up the control functions.. The first digital computer developed\nspecifically for control (in real-time application) was for airborne (military) operation, and in\n1954 a digitrac digital computer was successfully used to provide an automatic flight and\nweapons control system.\nFigure 1.1\nThe proposed use of computer in measurement and control\nLate 1950s itself saw the application of digital computers in industrial measurement & control\nfor the purpose of process control. The first industrial computer control system, called RW –\n300 system (of Ramo-Wooldridge Company) was installed at Port Arthur refinery of Texaco\nCompany in Texas. This system was capable of providing closed-loop control. The RW-300\nsystems were later installed by a number of chemical industries during early 1960s to work as\nsupervisory control systems. The logged information was used for steady-state optimization\ncalculations to determine the set-points for standard analog controllers. These computers based\nsystems were only indicative type; that means these did not control directly the movement of\nthe valves or other final control elements. Introduction to Computer Based Control Systems 3\nFigure 1.2\nThe picture of Ramo-Wooldridge (RW-300) computer used in process control and data logging\nThe first direct-digital control (DDC) computer system developed and operated for process\nmonitoring and control was Ferranti Argus 200; a large system with a provision of 120 control\nloops and 256 measurement inputs. The architecture of this computer system has ferrite core\nmemory storage system (it replaced the rotating drum as used by the RW – 300 computers).\nComputers are now extensively used for measurement and control in process and manufacturing\nindustries. It has brought not only new possibilities but also new challenges to measurement and\ncontrol engineers. In the following texts and diagrams of these chapter basic elements, hardware\nand software of computer based measurement and control systems have been discussed.\n1.2 Role of computers in measurement and (process) control\nThe development of digital computer technology has, extensively increased the use of computers\nfor measurement and control application. The basic objective of computer based measurement\nand control is to acquire the information from field devices (input), and compute a logical\ndecision to manipulate the material and energy flow of given process in a desired way to get\noptimal output. The expectations from a process computer compared to a general purpose\ncomputer is primarily in terms of response time, computing power, flexibility and fault tolerance,\nwhich are need to be rigid and reliable; moreover, the control of the process has to be carried out\nin real-time. Other difficulties encountered, mostly for process computers is to provide a solution\nto the problem of complexity, flexibility, and geographical separation of process elements (plant\nequipment) which are to be operated in a controlled manner.\nDigital computer control applications in the process industries may be of passive or active type.\nPassive application involves only acquisition of process data (data acquisition \/ data logging)\nwhereas active application involves acquisition and manipulation of data and uses it for (real\ntime) process control. The passive application deals predominantly with monitoring, alarming\nand data reduction systems, as shown in Figure 1.3. The process data, after being acquired\n(measured) on-line, is sent to the data acquisition computer through interface module. The smart\ninstruments (smart sensors, smart transmitters and smart actuators, the final control element),\nwith embedded computer help operator to receive real-time process measurement information\nand automatic transmission in required form for further processing by the process control 44 Distributed Control Systems\ncomputer. The smart instruments ensure that the actuator, transmitter or sensor function\naccording to the requirement of the user.\nFigure 1.3\nDigital computer use limited to passive application; used only for data acquisition \/ data logging\nThe major application of digital computers is in process control and plant optimization.\nComputer control systems, once prohibitively expensive, can now be tailored to fit most\nindustrial applications on a competitive economic basis. The advances in the use of computer\ncontrol have motivated many and changed the concepts of the operations of industrial processes.\nVideo display terminals now provide the focus for operators to supervise the whole plant from a\ncontrol room. Large panel of instruments, knobs and switches are replaced by a few keyboards\nand screens. Control rooms are now much smaller and fewer people are required to supervise the\nplant.\nProcess control computers now have the capability to implement sophisticated mathematical\nmodels. Plant managers and engineers can be provided with comprehensive information\nconcerning the status of plant operations to aid effective operation. With the use of\nmicroprocessor-based instruments and new emerging techniques, it is possible for automatic\ntuning of controller parameters for best operating performance. The expert systems and\nadvanced control techniques such as model based predictive control, are being applied with the\nhelp of computers for optimization of the process operation.\n1.3 Basic components of Computer Based Measurement and\nControl System\nThe basic components are:\n• Measurement and Data Acquisition\n• Data conversion and scaling and checking\n• Data accumulation and formatting\n• Visual display\n• Comparing with limits and alarm raising\n• Events, sequence and trends; monitoring and logging\n• Data logging and Computation\n• Control actions Introduction to Computer Based Control Systems 5\nFigure 1.4\nDigital computer used for process control; note the use of ADC and DAC for computer to Input and output matching.\nA block diagram of computer based process control system is shown in Figure 1.4. As shown in\nFigure 1.4(a), the controlled variable which is the output of the process, is measured as a\ncontinuous electrical signal (analog), and converted into a discrete-time signal using a device\ncalled Analog-to-digital-converter (ADC). This digital signal is fed back to a comparator\n(digital) and compared with the discrete form of the set point, which is the desired value, by the\ndigital computer; this produces an error signal e. An appropriate computer program representing\nthe controller, called control algorithm, is executed which yields a discrete controller output. The\ndiscrete signal is then converted into a continuous electrical signal using a device called Digital-\nto-analog-converter (DAC), the analog signal is fed to the final control element. This control\nstrategy is repeated at some predetermined frequency (time division multiplexed with other\ncontrol loops and other associated activities) to achieve the closed-loop computer control of the\nprocess. Figure 1.4(b) is a block diagram of the computerized control system explained above. 66 Distributed Control Systems\nCase study: Computer based control of a hot-air-blower\nFigure 1.5\nA hot air blower system – example process taken up for computer based control\nThe figure 1.5 above is the schematics of a process where a centrifugal fan blows air over a\nheating element and into a tube. The hot-air temperature at the output is measured and by say, a\nthermocouple, which, through signal conditioner, generates a proportional voltage signal to\ntemperature. The output temperature in this process may be increased or decreased by varying\nthe heater current. The air-inlet valve opening and closing for flow of air into the blower is\nadjusted by means of a reversible motor. The motor operates at constant speed and is turned on\nor off by a logic signal applied to motor on \/ off control.\nFigure 1.6\nA hot air blower system – controlled using computer based system Introduction to Computer Based Control Systems 7\nFigure 1.6 above is the general schematic diagram of the process discussed above being\ncontrolled by a Computer based mechanism. The information regarding the measured value of\nair temperature and fan inlet valve position is obtained in the form of analog signal. An analog-\nto-digital converter is used to convert the analog signal into digital signal before it is fed to the\ncomputer. The status of fully open or fully closed position of the fan inlet valve is obtained in the\nform of digital signals. For the output generated by the computer, digital -to- analog converter is\nused to send control signal in analog form to the motor control. The block diagram of the above\nsystem showing the control portion through computer is in Figure 1.7\nFigure 1.7\nA hot air blower system – Block diagram of the control system\n1.4 Architecture – Computer based Process Control System\nComputer-aided Industrial Process can be classified on the basis of their architecture under one or\nmore of the following:\na. Centralized Computer Control\nb. Distributed Computer Control\nc. Hierarchical Computer Control\n1.4.1 Centralized Computer Control\nThe early digital computer based control had the following drawbacks:\n• Low speed magnetic drum memory, slow speed processors\n• Very small memory size\n• Programming done in machine language\n• Inadequate knowledge of operator in computer technology\n• Limited knowledge of supplier on trends and technology\n• No maintenance support, limited spares support\n• Poor reliability of computer hardware and software, etc\nThe centralized computer based process control system comprised of large computer system with\nhuge space and power consuming type magnetic core memory, wired-in arithmetic and logical\nfunctions (gate logics); mostly done to improve the speed of operation.. But the system was\nexpensive due to high cost of core memory and additional electronics used in the system. To\njustify the high cost, every possible control functions, including both supervisory and DDC, were\nincorporated in a single computer system. These were popularly known as the central or\nmainframe computer.\nThe use of centralized computer control systems also had problems of providing expensive\ncommunication systems for bringing in the (field) signals to the centralized computer location;\nand output control signals to the field devices (valves, motors, actuators etc.). Electrical noise\nproblems for large distance communication of signals was a major cause of process interruptions\ndue to sudden computer stoppages leading to complete stoppage of plant\/process and, as a\nconsequence, resulted in losses and poor quality products.. 88 Distributed Control Systems\n1.4.2 Distributed Computer Control Systems\nWith the advent of microprocessors and microcomputers, distributed computer control\narchitecture became very popular because such systems were capable of tackling the problems\nand limitations of centralized computer control system were removed. While the technology and\napplication of distributed control system has been dealt with wide details in subsequent chapters,\nit is worth mentioning here that the work of monitoring and control of the industrial processes is\nnot divided by functions and allocated to a particular computer; instead, the total work is divided\nup and spread across several computers. Since industrial processes are geographically located\nover wide area, it is essential that the computing power required to control such processes be also\ndistributed and more emphasis be put to locations where major (control) activity takes place; this\nlimits the data flow to a single sink and instead ensures continuation of operation of the plant\neven if there are failures at some sub systems. This type of physical distribution of digital\ncomputer based control is also known as Distributed Digital Control (DDC); refer Figure1.8\nbelow.\nFigure 1.8\nArchitecture of Distributed Digital Control (DDC)\nFoxboro’s TDC 2000 system was the first, and truly distributed computer control system; this\nwas introduced as an alternative to the not so popular and unreliable centralized computer control\nsystem. This distributed computer control system comprised of a set of small, widely distributed\ncomputer systems containing one or more microprocessors, each of them controlling one or more\nloops. All of these computers were connected by a single high speed data link that permitted\ncommunication between each of the microprocessor-based systems with centralized operator\nstation. Figure 1.9 below illustrates the concept of distributed computer control system as has\nbeen incorporated in Foxboro TDC 2000 DCS. Introduction to Computer Based Control Systems 9\nFigure 1.9\nFoxboro TDC 2000 Distributed Control System; schematic diagram\n1.4.3 Hierarchical Computer Control Systems\nAs the name implies, in this type of Systems there is hierarchy of computers connected on a\nnetwork with each performing distinct functions. In this type of control, the upper level\ncomputers depend on lower level devices for process data, and the lower level systems depend\nupon the higher level systems for more sophisticated control functions such as overall plant\noptimization.\nA popular 5-level automation hierarchy of a computer integrated industrial manufacturing plant is\nshown in Figure 1.10 below. Here, Level 0 is the lowest level; the field instrumentation is\ninstalled for the measurement of process parameters. This level, would forward the measured\nvalues (data) to Level 1 for process control functions. At this level, functions such as process\nmonitoring and control, inter process operation and monitoring, system coupling, etc. are\nperformed by the computer installed at this level. At the Level 2, supervisory functions are\nimplemented. These include data collection and logging, process optimization, etc. The\nmathematical models of the process efficiently take care of overall process optimization. Level 3\nis the plant (management) level where functions such as plant resource allocation, production\nplanning and scheduling, maintenance scheduling, production accounting, etc are done.\nFigure 1.10\nFive levels of automation hierarchy of a (hierarchical) computer based process control system 1100 Distributed Control Systems\nThe production schedule is prepared at Level3 computer based on management inputs\n(requirements) such as sales orders, stock level, selling cost, profit margins, operating cost,\nscheduled maintenance plans for production units, etc. This information is communicated down\nthe line to the supervisory level (Level2) computers. At level 2 the computed set-points for\nvarious parameters to meet the above production schedule are passed on to the process controllers\nat level 1. These computations are done based on product recipe and operation sequences\nprogrammed and stored in the database maintained at this level. Computers at level 1 take\nrequisite control actions to maintain the process conditions based on set points.\nThe monitoring and recording of all the plant are done by computers at Level 3; this include\nplant\/process parameters and various events, alarm conditions, production and quality issues and\nselectively (event based) transfer these to the corporate level (the Level 4) for management\ninformation (MIS) purposes.\nA schematic diagram of a hierarchical Computer Control system using the 5 level of automations\nhierarchy for an industrial process is shown in Figure 1.10 above. As may be seen in the figure\nabove, the hierarchical systems involve some form of distributed network and hence most\nsystems and therefore such systems may be termed as a mixture of hierarchical and distributed\ncomputer control system.\n1.4.4 Tasks of computer control system\nComputer based automatic monitoring and control system of a process plant is generally\nconcerned with large number of variables operating under a wide range of process dynamics. The\nprocess algorithm therefore requires the development of large number of complex functions\nwhich work on a large number of widely scattered actuators of various types, known as final\ncontrol elements, based on multiple inputs to the computer as process parameters.\nFigure 1.11\nSchematic diagram of a process with both feedback and feed forward control with tasks of the computer based control\nwell defined.\nAn industrial plant need to meet the production demands while ensuring the quality of the\nproducts and safety of the plant’s resources. The productivity associated with lowest production\ncosts has is a important factor as well. While such activities should be catered by the computer\nbased system it should also work as control system enforcer in which the computers at various\nlevels are synchronized to carry out respective jobs and communicate in a network to keep units\nof the plant production system operating at some optimal level. Introduction to Computer Based Control Systems 11\nThe above schematic diagram (Figure 1.11) shows the process being monitored and controlled\nwith multiple process physical parameters (pressure, temperature, flow etc.) as inputs to\ncomputer system leading to multiple (manipulated) outputs from the computer system( t final\ncontrol elements, like valves etc.) to maintain the optimum control on the process. As may be\nseen, in this particular case of computer control, the tasks of the feedback control system may be\nthrough software based controllers (say PIDs) and the feedforward control done through\ncomputer mathematically modeled process simulators.\n1.4.5 Task listing of computer based control system\nThe readers may refer to the Figure Fig. 1.10 above; the tasks carried out by each level in the\nautomation hierarchy are as under:\nField Level (Level-0)\n• Measurement of process parameters, signal conditioning etc. if necessary, and\ntransmission of field parameters to the control level (Level-1) computer control\nsystems.\nControl Level (Level-1)\n• Systems at this level maintain direct control of the plant units under their\ncognizance, detect emergency condition in these units and take appropriate action.\n• Undertakes system coordination and reporting jobs by collecting information on\nunit production, raw material consumption, and energy consumption; transmits to\nhigher level computer (Level-2). Programming part of operator’s human machine\ninterface (HMI) done at this level.\n• Takes up reliability assurance activities by performing diagnostics on the various\ncontrol equipment; this also helps in detecting the faults and maintaining the\nstandby system if connected to the system.\nSupervisory Level (Level-2)\n• This level enforces the control on the system by responding to any emergency\ncondition at its own level; also optimizes processes under its control as per\nestablished production schedule and carry out all established process operational\nschemes or operating practices for the processes.\n• The coordination of the plant operation is taken up for here for data reporting; this\nlevel collects and maintain process\/production database. The records for inventory\nand raw material are maintained at this level; monitors on the energy consumption\nby units under its control.\n• This level is also the one where communication with the higher and lower level\ncomputer systems are coordinated.\n• The reliability assurance part of the job performs diagnostics on the various control\nequipments to detect the fault and keep updating hot-backup (standby) system if\nconnected in the hierarchy.\nPlant Level (Level-3)\nThis level undertakes the production planning and scheduling job by preparing immediate\nproduction schedule under its area of control.\nThe production cost optimization function is taken up by modifying the production schedule\nbased on inputs received from lower levels; the energy consumption and optimization of energy\nuse is manipulated at this level.\nThe plant coordination and operational data reporting jobs which include preparing production\nreports, maintenance of plant inventory about material and energy usage, maintaining\ncommunications with the higher and lower level computers, operation related data collection and\noff-line analysis for future prediction and usage, providing services to the operator’s human-\nmachine interface (HMI) are taken up at this level. 1122 Distributed Control Systems\nUnder reliability assurance activities, the diagnostics on the various control equipment to help in\ndetecting the fault and keeping the standby system live is taken up at this level\nManagement level (Level-4)\n• The core area of activity at this level involves management tasks; under Sales and\nMarketing the activities taken up are customer order management, order booking,\nand transferring order information to plant level (Level – 3) computers. Market\nforecasting and market intelligence, customer database management, market survey\nare the other activities of this level.\n• Under finance and accounting the logging and monitoring of company’s sales and\nexpenditures, annual accounting, profit and loss account for the management\ninformation etc. are undertaken\n1.5 Human Machine Interface (HMI)\nThe Human-Machine Interface is technically where the human and the machine may interact. It is\nthe area of the human and the area of the machine that interact during a given task. Interaction\ncan include touch, sight, sound, heat transference or any other physical or cognitive function. The\ngoal of human-machine interaction engineering is to produce a user interface which makes it\neasy, efficient, and enjoyable to operate a machine in the way which produces the desired result.\nThis generally means that the operator needs to provide minimal input to achieve the desired\noutput, and also that the machine minimizes undesired outputs to the human\nHMI for process monitoring and control provides the historical review, trending, storage of\nprocess conditions, and maintenance\/updating of any control elements (viz. computer hardware\nand software systems, communication system, etc.). The standard software packages may have\nthe following display features:\n• Plant mimic diagram of plant\/process overview (Figure 1.12 below)\n• Alarm overview presenting information on the alarm status of large areas of the\nplant\n• Multiple area displays presenting information on the control system\n• Loop displays giving extensive information on the details of a particular control\nloop of group of control loops\nHMI devices consist mainly of the following components\n• Display unit (CRT)\n• Keyboard\n• Input unit\n• Printing unit\n• Control Panel\/desks, mimic board\/panel\n• Recorders\nAn improperly designed man-machine interface (MMI) without consideration of human\ncapability, background and grasping power, may lead to confusing presentations of information\nwith illogical relationships forcing humans to commit errors resulting in system inefficiency or\neven failures. We tend to dismiss these errors, but they may be due to mismatch between\noperator and machine (MMI) or operator and task, resulting from one or more of the following\nreasons:\na. Ineffective dialogue structure\nb. Ineffective display presentation and linkages\nc. Delay in deciding the control actions to display the required page\nd. Confusing displays due to overcrowding of information, ineffective information coding\ne. Untrained operator\nf. Delayed feedback on control actions\ng. Ineffective communication means within control center with other level control centers Introduction to Computer Based Control Systems 13\nFigure 1.12\nAn HMI device displaying the plant mimic diagram; Picture courtesy Wienview\nTherefore, computer system designer should consider human s as integral and indispensible part\nin the design of MMI at each stage. MMI systems, dialogue structures, information coding and\npresentation, etc. must consider the end users and operators who operate the system. This will\nresult in accessibility of the system after it is installed, and the users\/operators will exploit its\nworth to the maximum in safe and optimal operation of the process under control, continuously.\nWith the availability of the 4th generation computer programming languages (4GL) software such\nas GUI, it has now become very easy to design a user friendly MMI.\n1.6 Hardware for Computer based process control system\nA general purpose digital computer with adequate hardware provisions can be used as an\nindustrial process (real-time) computer control. Besides, to make it suitable for measurement and\ncontrol purpose, the digital computer should have additional features like ability to communicate\nefficiently and effectively with plant and operating personnel. It should also be capable of rapid\nexecution of tasks (algorithms) for real time control actions. With the advancement in\ntechnology and development of microcomputers and minicomputers, these digital computers may\nbe used for large industrial process control applications with up to several thousand input\/ output\n(I\/O) points.\n1.6.1 Architecture of general purpose computer\nThe four basic components of a general computer are -.\n• Central Processing Unit (CPU)\n• Storage section (memory)\n• Input\/ output (I\/O) section and\n• Bus Interface 1144 Distributed Control Systems\nFigure 1.13\nBlock diagram of a general purpose computer and picture of an actual CPU\nFigure 1.13 above shows the diagram of a general purpose computer system; Figure 1.14 below\nis the schematic diagram of the same. All the physical components of this are termed as\nhardware. The programmer has to write a set of instructions to make these physical devices to\nperform specified functions; such instructions are called program or software. The hardware\ncomponents work as per instructions of software; without software (programming) the hardware\nsimply cannot work.\nFigure 1.14\nSchematic diagram of a general purpose computer\nThe Central Processing Unit (CPU) is the main unit inside the computer (sometimes called the\nheart of the computer). This unit is responsible for all events inside the computer. It controls all\ninternal and external devices, performs arithmetic and logic operations and consists of control\nunit, arithmetic logic unit (ALU), temporary (primary storage) and general purpose registers. The\ncontrol unit continually supervises and controls the operations\/activities within the CPU (refer\nFigure 1.15 below). The operations of a processor are controlled by instruction set of this\nprocessor. The instruction set is \"hard wired\" in the CPU and determines the machine language\nfor the CPU. Processors differ from one another by the instruction set. Introduction to Computer Based Control Systems 15\nFigure 1.15\nBlock diagram – central processing unit\nThe arithmetic logic unit (ALU) is the fundamental building block of a computer and is the part\nwhere actual computations take place. It consists of circuits which perform arithmetic operations\n(e.g. addition, subtraction, multiplication, division) and logical operations (AND OR NOT etc.)\nover data received from memory and capable to compare numbers. While performing these\noperations the ALU takes data from the temporary storage area inside the CPU named registers.\nRegisters are a group of cells used for memory addressing, data manipulation and processing.\nSome of the registers are general purpose and some are reserved for certain functions. It is a high-\nspeed memory which holds only data for immediate processing and results of this processing. If\nthese results are not needed for the next instruction, they are sent back to the main memory and\nregisters are occupied by the new data used in the next instruction.\nFigure 1.16\nSchematic representation of Arithmetic Logic Unit (ALU)\nThe word length used by the computer is important both in ensuring adequate precision in\ncalculations and also, in allowing direct access to a large area of main storage within one\ninstruction word. It is always possible to compensate for short word lengths, both for arithmetic\nprecision and for memory access, by using multiple word operations. But, the disadvantage is\nthat it increases the time for the operations. The word length is governed by the length of data\nbus. The amount of main storage directly accessible is also influenced by the number of address\nline provided on the input\/output interface.\nAnother important aspect of information sharing within a CPU is the Addressing mode. The\naddressing modes are the ways how architectures specify the address of an object they want to 1166 Distributed Control Systems\naccess. In general purpose register type machines, an addressing mode can specify a constant, a\nregister or a location in memory.\nStorage - The main function of storage device is to store data and instructions (programs). The\nmost elementary unit of stored information is the bit (a 0 or 1) value and a byte (consisting of 8\nbits) representing a character of the information or data. The storage capacity of a computer is\nexpressed in terms of certain multiples of a byte as kilobytes, megabytes, gigabytes, terabytes as\nit is in metric system\nFor economical and technological reasons storage devices come in many sizes, speed and costs.\nStorage devices range from inexpensive low-capacity, slow speed device to larger, more\nexpensive, faster ones suitable for permanent storage of the information of, in this discussion,\nlarge process industries. The storage devices store two distinct types of information: data and\ninstructions (programs). They are of three types:\n• Main storage or immediate access of storage (IAS)\n• Auxiliary or secondary memory storage\n• Cache memory\nThe main memory (also called primary memory) storage is a high-speed random access memory\n(RAM) which is volatile in nature, which means, it keeps the data\/ information as long as power\nis available to the computer. As soon as power is off, the content of the memory is erased\n(removed). It stores information or program which is required for execution. The operation of\nmain memory is very fast. RAM (random access memory) permits both read and write\noperations by the CPU. Another kind of memory, which CPU can read but cannot write or\nchange, is called ROM (Read Only Memory). Variations that can be reprogrammed by off-line\ndevices are called PROM (programmable ROM or EPROM (Erasable Programmable ROM).\nThe use of ROM has eased the problem of memory protection to prevent loss of programs\nthrough power failure or corruption of memory by malfunctioning of the software.\nFigure 1.17\nPicture of Random Access Memory (RAM)\nThe auxiliary memory storage (such as tape or disk) is non-volatile in nature that means, it\nkeeps data, information, program, or instructions even after the power is off. These devices\nprovide bulk storage for programs or data, which are required infrequently at a much lower cost\nthan the high-speed main memory. But, it has disadvantages of taking much longer access time\nand they need for interface boards and software to connect to the CPU. Auxiliary storage devices\noperate asynchronously to the CPU and care has to be taken in deciding on the appropriate\ntransfer technique for data between the CPU, fast access (main) memory and the auxiliary\nstorage. Introduction to Computer Based Control Systems 17\nFigure 1.18\nThe concept of cache memory\nAn additional storage part, known as cache memory (Figure 1.18 above) is also used in the\nprocess control computers for improvements in performance and utilization. Cache memory is an\nauxiliary memory that provides a buffering capability by which the relatively slow and ever-\nincreasingly large main memory can interface to the CPU at the processor cycle time in order to\noptimize performance. It is a high-speed storage that is much faster than the main storage, but\nextremely expensive as compared with the main storage. Therefore, only relatively small caches\nare used.\nThe input\/output (I\/O) interface is the sub-system through which the CPU communicates with\nthe outside world. Through these devices the Human Machine Interface (HMI) for\ncommunication between the CPU and displays and the CPU and other peripheral devices such as\nprinters, external storage, keyboards, mouse etc. interface. I\/O interface is one of the most\ncomplex areas of a computer system because of the wide variation in the rate of data transfer and\nwide variety of devices which have to be connected. The I\/O devices of process control\ncomputers are divided into three types:\n• Operator IO\n• Process IO\n• Computer IO\nA schematic diagram showing interfaces of computers for process control applications system are\nshown in Figure 1.19. All the devices here share the same interface bus system and hence the\nCPU treats all devices with equal priority. 1188 Distributed Control Systems\nFigure 1.19\nSchematic diagram of a process control computer interfaced with various field devices.\nOperator IO Devices communicate with the operators; process operator use devices such as\nkeyboards, push buttons, thumb switches, etc. to input data or command to the computer and they\nreceive information from the computer via devices such as VDU (Visual Display Unit), LED\n(light-emitting-diode) numerical displays, pilot lights, etc. computer operators and program\ndevelopers (programmers) use computer console to communicate with the computer.\nProcess IO devices communicate directly between CPU and all plant devices such as sensors,\nlimit switches, tachometers, encoders, etc. for inputs and control valves, motor starters, stepping\nmotors, etc. for output. The plant devices are connected to the computer through ADC (analog-\nto-digital converters) and DAC (digital-to-analog converter) subsystem to convert them into\nanalog or digital signal as the case may be.\nComputer IO devices directly communicate with the CPU for data and information exchange\nwith the peripheral devices.\nBus Interface\nBus Interface is an electronic pathway (media) in computer based system that provides a\ncommunication path for data to flow between the CPU and its memory and peripherals and\namongst the CPUs connected to the computer system. (Refer to Figure 1.14 above). A bus\ncontains one wire for each bit needed to specify the address of a device or location in memory,\nplus additional wires that distinguish among the various data transfer operations to be performed.\nThere are address bus, data bus and control bus; there may be a status bus too. These are\nnormally confined to inside the computer chip for data and information movements and also\navailable to outside world to expand the power of the computer system. A bus carries electrical\nsignal and the wires may be tracks on a printed circuit board or in the form of a ribbon cable.\nThis printed circuit board or ribbon can be plugged into the slots provided on the computer board.\nA bus can transmit data in either direction between any two ends provided in the computer (bi-\ndirectional). Introduction to Computer Based Control Systems 19\nOn a microcomputer, the bus is usually called an expansion bus because its design determines the\ndegree to which the minimum configuration of the system can be expanded with regard to\nmemory, processing speed, graphics capability, and the peripheral support. The expansion bus is\nthe collection of wires, paths, connectors, and controllers responsible for distributing the data and\ninstructions from the microprocessor to the peripheral expansion cards. Slots connected to the\nbus provide places to plug those cards in, and the bus then provides a mechanism for\ncommunicating with them.\nWith increased use of computers for process control applications and other purposes, various\nstandards were introduced. Following are the common expansion buses which were introduced\nwith IBM - compatible PCs (personal computers):\n• S-100 bus\n• ISA (Industry Standard Architecture) bus\n• ISA-AT (Advanced Technology) bus\n• MCA (micro-channel Architecture) bus\n• EISA (Extended Industry Standard Architecture) bus\n• NU-bus\nNote: Readers may refer to any standard book on microprocessors \/ personal computers to get\nmore details on these buses\n1.7 Interfacing computer system with process\nThere are a wide variety of instruments and actuators (sensors\/ transducers) which are connected\nto process or plant for measurement and control of process parameters such as temperature, flow,\npressure, level, speed, etc. In a computer based process control system, it is required to convert\nthese process parameters, which are physical quantity (analog) to a digital (electrical) signal\npattern which the computer can understand. All the sensors (instruments) should have, therefore,\nstandard interface (compatible to host computer) to achieve this conversion. The field\ninstruments (or sensors) send measured data four categories:\nAnalog Quantities; Thermocouples, strain gauges, flow meters, level sensors, etc. generate\nmeasured outputs as analog quantities in the form of milli-volts (mV) or milli-amperes (mA).\nThe values of measured quantities are usually scaled to 0 to 5 V, 0 to 10 V, -5 to +5 V,-10 to +10\nV, 4 to 20 mA or 0 to 20 mA. Analog quantities are continuous variables and have to be both\nsampled and converted to a digital signal. The mV or mA signals are amplified and fetched to\nthe computer after converting these analog signals into digital signal.\nDigital Quantities; these are process events such as (on\/off) operation of a limit switch, open or\nclosed contacts, a valve( in open or closed position), a switch in power on or off position, a relay\nin open or closed condition, etc. These statuses (on\/off, open\/close) are sensed in form of digital\nquantities. These digital quantities can be either binary (0\/1) or a Binary Coded Decimal (BCD)\nor in other formats. Digital quantities are directly sent to the computer without any conversion.\nPulses or pulse rates; these may be outputs (or inputs) of some measuring instruments such as\nflow meters, stepper motors as controllers, valves, a motor on or off, etc.\nTelemetry; this is a mechanism of transmitting a measured process quantities to a convenient\nremote location or to multiple locations, in a form, suitable for displaying, recording or actuating\na process. The use of telemetry system makes it possible to group several instruments in a\ncentralized room to enable the operator to have a complete picture of the plant status. The\nincreasing use of remote outstations such as in electrical substations, power generation units, data\nrelated to mining operations, hazardous areas etc. has made telemetry a convenient option. The\ndata may be transmitted by a wired or wireless method. 2200 Distributed Control Systems\nThere are a variety of interface cards which have been developed and added to the computer\nsystem to connect to different measurements inputs of process parameters; these are put to signal\nconditioning to convert to appropriate signal capable of interfacing with digital computers. The\ninterfaces are:\n• Analog interfaces\n• Digital interfaces\n• Pulse interfaces\n• Real-time clock\n• Standard (bus) interfaces\nAnalog interfaces; these interfaces take up the continuous (time varying) type analog inputs.\nThe interfacing hardware ensures compatibility of the incoming (or outgoing) signals to and from\ndigital computer. The popular analog interfaces applied with digital computer are:\n• Analog-to-digital converter (ADC)\n• Digital -to- analog converter (DAC)\n• Multiplexing devices\n• MODEM\nAnalog-to-digital converter (ADC)\nFigure 1.20\nAn 8-level (3-bit) ADC coding scheme\nAn analog-to-digital converter (abbreviated ADC, A\/D or A to D) is a device that converts a\ncontinuous quantity to a discrete time digital representation. An ADC may also provide an\nisolated measurement.\nTypically, an ADC is an electronic device that converts an input analog voltage or current to a\ndigital number proportional to the magnitude of the voltage or current. However, some non-\nelectronic or only partially electronic devices, such as rotary encoders, can also be considered for\nthe purpose of ADCs. The digital output may use different coding schemes. Typically the digital\noutput will be a two's complement binary number that is proportional to the input.\nThe resolution of the converter indicates the number of discrete values it can produce over the\nrange of analog values (span). The values are usually stored electronically in binary form, so the\nresolution is usually expressed in bits. For example, an ADC with a resolution of 8 bits can\nencode an analog input to one in 256 different levels ;(28 = 256). The values can represent the Introduction to Computer Based Control Systems 21\nranges from 0 to 255 (i.e. unsigned integer) or from −128 to 127 (i.e. signed integer), depending\non the application.\nSome of the popular method of analog to digital conversion are Direct conversion (Flash) ADC,\nsuccessive approximation ADC, ramp compare ADC, integrating ADC etc.\nDigital-to-Analog converter (DAC)\nDigital-to-analog conversion is a process in which signals having two defined levels or states\n(digital) are converted into analog signals (theoretically infinite number of states). A common\nexample is the processing, by a modem, of computer data into audio-frequency (AF) tones that\ncan be transmitted over a twisted pair telephone lines. The circuit that performs this function is a\ndigital-to-analog converter (DAC)\nFigure 1.21a\nAn 8-bit Digital to Analog Converter (DAC) circuit using R-2R network\nFigure 1.21b\nFunctional diagram of an 8-bit Digital to Analog Converter (DAC)\nADC and DAC devices can be classified as unipolar or bipolar, depending on their voltage range\ncapability. These are also classified according to binary code used to represent numbers, their\nnumber of bits of resolution (8, 10, 12 bits), and the technology and circuit involved in\nfabricating these devices. A typical application of ADC and DAC used for interfacing analog\nsignals to a digital computer controlled process is shown below in Figure 1.22. 2222 Distributed Control Systems\nFigure 1.22\nADCs and DACs connected for interfacing analog signals to and from computer in process control\nMultiplexing (MUX); it is the process of sending multiple signals or streams of information on a\ncarrier at the same time in the form of a single, complex signal. At receiver end, the multiplexed\nsignal is de-multiplexed to recover all the multiplexed signals. The main reason of multiplexing\nis to ensure efficient use of the full bandwidth of the communication channel by means of lower\ntransmission cost.\nThe 3 different methods of multiplexing, which is commonly used for industrial application are:\n• Space Division Multiplexing\n• Frequency Division Multiplexing\n• Time Division Multiplexing\nSpace Division Multiplexing (SDM) – this is the method of providing multiple fixed bandwidth\nchannels by multiple physical paths (i.e., pairs of wires or optical fibers). An example of SDM is\nthe use of a 25-pair cable to carry the information of 25 individual sensors from the field\npremises to one the local control station of the plant. In actual practice, hundreds of twisted pair\nwires, coaxial cables, and optical fiber cables can be grouped to for a larger diameter cable.\nFigure 1.23\nFDM, with three signals to three users sharing the same bandwidth\nFrequency Division Multiplexing (FDM); here a higher bandwidth channel is divided into\nmultiple individual smaller bandwidth channels. Signals on these channels are transmitted at the\nsame time but at different carrier frequencies. As may be seen in Figure 1.23 above, each\ntransmitter modulates its source's information into a signal that lies in a different frequency sub-\nband (like transmitter 1 generates a signal in the frequency sub-band between 92.0 MHz and 92.2\nMHz). The signals are then transmitted across a common channel. At the receiving end of the\nsystem, bandpass filters are used to pass the desired signal to the appropriate user and to block all\nthe unwanted signals. Introduction to Computer Based Control Systems 23\nTime Division Multiplexing (TDM); this is a method of putting multiple data streams in a\nsingle signal by separating the signal into many segments, each having a very short duration.\nEach individual data stream is reassembled at the receiving end based on the timing.\nFigure 1.24\nExample of TDM showing three channels multiplexed \/ demultiplexed and transmitted \/ received\nThe circuit that combines signals at the source (transmitting) end of a communications link is\nknown as a multiplexer. It accepts the input from each individual end user, breaks each signal\ninto segments, and assigns the segments to the composite signal in a rotating, repeating sequence.\nThe composite signal thus contains data from multiple senders.\nAt the other end of the long-distance cable, the individual signals are separated out by means of a\ncircuit called a demultiplexer, and routed to the proper end users. A two-way communications\ncircuit requires a multiplexer \/ demultiplexer at each end of the long-distance, high-bandwidth\ncable\nFigure 1.25\nSchematic diagram of modems connecting two remotely placed computers via conventional telephone network.\nMODEM – This device transmits data between computers, workstations and other peripheral\ndevices interconnected by means of conventional communication lines supporting analog\ntransmission. Modem transforms (modulate) data from a digital device to an analog form which\nis suitable for transmission on (analog) lines. Since, in general, the data flows in both direction,\nmodems are also able to receive an analog signal from some remote device and restore it back\n(by demodulation) to its original digital form (as shown in Figure 1.25 above. 2244 Distributed Control Systems\n1.8 Economics of computer based system for industrial application\nTill the advent of microprocessors and microcomputers, computer based process control was very\nexpansive. A strong justification was required for using computer based process control system\nin place of conventional system. Computers were used for control purposes in only some\nindustrial applications that required complex sequencing and processing. After the advent of\nmicroprocessors and microcomputers and their wide spread availability, the cost of computers\nhave now drastically reduced and at the same time computers have become more powerful.\nToday, the application of computer controlled system is justified automatically because of its low\ncost, its capabilities to handle large complexity of industrial processes and high returns\n(immediate payoffs) from such systems.\n1.8.1 Advantages of computers in measurement and control\nSome of the major advantages of using computers for measurement and control application area;\n• Computers ensure the repeatability in the product quality that is essential in\nmanufacturing plants.\n• It permits flexibility to modify the sequencing and control procedures to provide for\nthe manufacture of a different product and frequent changes in product\nspecification. It maintains a data base containing the product recipe and thus is easy\nto change to a new recipe quickly and reliably.\n• Use of computers increases the productivity of the plant significantly by ensuring\ngreater plant availability.\n• It provides increased understanding of the behavior of the processes.\n• It helps in reduction in dead time of batch operation. "}