{
    "text": "Chapter 9. America, South of the U.S.\n9.1 Defining the Realm\nLearning Objectives\n1. Recount a brief history of this realm.\n2. Locate major regions of European colonization in the realm.\n3. Recall the basic climate differences of America, south of the U.S. in terms latitude and elevation.\n4. Describe altitudinal zonation.\nThe name Latin America is often used to label this realm. Latin was used in the Roman Catholic Church,\nand the Spanish and Portuguese brought Roman Catholicism and Latin-based languages to these shores.\nHowever, the name is problematic in that several areas are not tied to the Latin origin. There are\nnumerous local and regional indigenous languages in use, such as Quechua and Guarani, as well as other\nEuropean languages such as French and English. The Caribbean and surrounding lowland coastal\nlocations of Central America and Northern South America were areas of competition between\ncompeting European powers, including the British, French, and Dutch. These areas have different\ncolonial patterns than those of the Spanish and Portuguese. Thus, this text uses an umbrella term,\nAmerica, South of the U.S. for its title. Certainly, though, the Spanish and Portuguese conquerors (the\nConquistadors), and the cultural imprint they put into place, aren’t to be ignored. Arriving in the 15th\nand 16th Centuries, these adventurers subsequently defeated major civilizations such as the Aztec and\nIncan Empires, and established a Latin image of religion and economy onto those that were vanquished.\nIndigenous peoples were put to work in newly organized towns organized around the Roman Catholic\nChurch. A common area would be located in front, and governmental buildings would be at the edge of\nthe commons. Due to the Treaty of Tordesillas in 1494, most of western Latin America came under\nSpanish rule. The Portuguese established Brazil. See figure 9.1 for a general orientation. Figure 9.1. General map of America, South of the U.S. Labels added by Lincoln DeBunce. Each line of\nlatitude and longitude represents 15 degrees of separation. Image courtesy of “Marvin01 (Sean Baker)\neditado por alexgotha,” CC-BY-3.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:LocationWHLatinAmeric.png\nIn terms of physical geography, Latin America is situated over many latitudes, from 30 degrees north, to\nover 50 degrees South. This affords a good deal of climatic differences, and can be understood as\nequatorial climates, moving through subtropical deserts, with temperate zones in the south. At the\nsouthern-most tip of South America, colder conditions prevail. A series of high mountain ranges located\non the western side of this realm complicates this general pattern. As elevation increases, temperatures\ndecrease. The Sierra Madre Occidental and Sierra Madre Oriental frame Mexico, and elevated central\nplateaus dominate the interior (figure 9.2). This moderates what would otherwise be a warmer\ntemperature profile. Figure 9.2. Topological map of Mexico, with labels. Source: “NASA - derivative work by Ricraider,” Public\nDomain. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Geographic_Map_of_Mexico.jpg\nThe Andes Mountains along the western side of South America also provide opportunities of cooler\nclimates in otherwise equatorial locations. Peoples of equatorial Locations have used the differences in\nelevation to raise different agricultural products for millennia (figure 9.3). In the tierra caliente, lowland\ntropical plants are dominant. Higher elevations, such as the tierra templada, are good for coffee and\neven higher, pasturage. Interestingly, there has long been a pattern of higher population clusters living\nin the higher, elevated valleys. These are typically known as the altiplano (figure 9.4). Figure 9.3. Diagram showing altitudinal zonation in Latin America. Image courtesy of “Chris.urs-o;\nMaksim; Anita Graser,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Altitudinal_zonation#/media/File:Hoehenstufen_der_anden.en.PNG Figure 9.4. Almost 2 million people live in the high elevation city of La Paz, Bolivia. Many Latin American\npeople live in the high valleys rather than lowland coastal zones. Image courtesy of “EEJCC,” CC BY-SA\n4.0. Retrieved from Wikipedia: https://en.wikipedia.org/wiki/Altiplano#/media/File:La_Paz_Skyline.jpg\n9.2 Middle America: Mainland versus Rimland\nLearning Objectives\n1. Distinguish mainland and Rimland patterns.\n2. Discuss problems of land equity in the Mainland.\n3. Describe why tourism is considered an irritant industry.\nMiddle America consists of Mexico, Central America, and the Caribbean. Two colonial systems came into\nplay in the development of this part of America, South of the U.S. The Spanish established what\ngeographer Donald Meinig described as a “land Empire.” This is where a small number of elite colonists\nsubjugate the indigenous population and control the land for the purpose of showing and maintaining\nhigh status. This pattern of colonialism is evident in the “Mainland,” seen in figure 9.5. The Spanish\nnobility established haciendas; large manor houses, servant quarters, and surrounding lands. Crops were\ngrown for subsistence, as the route back to Spain did not encourage exports. Figure 9.5. The Mainland and Rimland of Middle America. Image courtesy of unnamed author, located in\n“World Regional Geography.” CC BY-SA 4.0. Retrieved from:\nhttps://open.lib.umn.edu/worldgeography/chapter/5-1-introducing-the-realm/\nThe development of the “Rimland” was quite different. While the Spanish did not ignore this area, the\noriginal inhabitants, the Carib and Arawak Indians, did not fare well at all at the hands of the new\ninvaders and largely went extinct. Other European powers, eager to gain spoils found in the New World,\nsponsored pirates to intercept gold from Spanish galleons. Colonial ports and associated towns were\nestablished. Later, African slaves were used on islands under British, French and Dutch control to grow\nlarge plantations focused on a few cash crops like tobacco and sugarcane. Once slavery was abolished,\nnew labor was introduced in the form of indentured servants. Under this system, poor eager farmers\nwere enticed to come to the Caribbean and work off their passage for a period of time, usually seven\nyears. Thereafter they were free to start their own farms. While this may seem to be a bad deal, it was\nappealing to many living in destitute conditions. At the time, parts of India, Indonesia, China, and Ireland\nwere sources of this labor.\nThese two different patterns have led to different historical paths of development. In many mainland\nareas, the descendants of Spanish aristocracy ultimately lost their large landholdings in peasant\nuprisings and revolutions. But land reform has not worked out well, and continues to be a major area of\ndissatisfaction and unrest. Poverty, and inequality of wealth and power are prevalent. In recent decades,\nunderground economies, such as the trade of drugs, and the consequential growth of organized crime\nand corruption, has plagued the “mainland.”\nThe rimland is also problematic in terms of inequalities of wealth. Poverty is widespread, yet nearby one\ncan find in stark contrast beachside upscale resorts (figure 9.6). Tourist destinations provide much\nneeded money, yet are a stark reminder of the lack of affluence these places are dealt. Often times,\ntourist sites are funded from international companies, and the tourist monies spent flow back to foreign\nshores where they originated. Figure 9.6. This photo, of Palm Beach, Aruba, is one of countless tourist landscapes in the Caribbean.\nImage courtesy of Bjørn Christian Tørrissen, CC BY-SA 3.0. Retrieved from\nhttps://en.wikipedia.org/wiki/Palm_Beach,_Aruba#/media/File:Palm-Beach-Aruba-2013.JPG\n9.3 Regions of South America\nLearning Objectives\n1. Describe the characteristics of northern South America.\n2. Distinguish the major cultural differences between western region and the Southern Cone.\n3. Recall major qualities and issues of Bazil.\nSouth America is generally broken into four regions (see figure 9.7 below). Northern South America has\ntwo parts. Guyana, Suriname, and French Guiana, sometimes called the Three Guianas, are an extension\nof the Rimland pattern of Middle America, and make up the first part. The British, Dutch, and French\nestablished plantations and imported labor for export cash crop purposes. To this day, French Guiana is\nan overseas department of France. The second part is comprised of Venezuela and Columbia. These two\ncountries are alike in their reliance on petroleum revenues. Both country’s populations are largely\nurban, and the political and economic cores, while strong, are removed from the peripheral areas of\ndiscontent. Venezuela has tried to remove itself from influences of the United States and other aligned\ncountries. Its economy has suffered with inflation and political instability. Columbia has been besieged\nby a strong insurgency operating in the periphery funded by the production and running of drugs. An\nuneasy truce has been in place for several years between these insurgents and the official government. Figure 9.7. Regions of South America. Borders and labels of regions added by Lincoln DeBunce. Image\ncourtesy of Cacahuate, amendments by Joelf and Globe-trotter, CC BY-SA 3.0. Retrieved from Wikipedia:\nMap of South America - South America - Wikipedia.\nThere is an interesting juxtaposition (side by side difference) between the west region of South America\nand the Southern Cone. The West has a large number of indigenous South Americans who live in the\nAltiplanos of the Andes Mountains and are engaged in traditional ways of farming and trading.\nTerracing, the use of root crops like the potato, and the incorporation of New World domesticated\nanimals, like the llama and alpaca are widespread. In short, this is a region that was part of the Incan\nEmpire, and elements of those times remain (see figure 9.8). Figure 9.8. Terrace farming near Machu Pichu high in the Andes Mountains. Ways of life in the high\nAltiplano has many elements of traditional cultural practices. Image courtesy of “RAF-YYC,” CC BY-SA.\n2.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Machu_Picchu#/media/File:Machu_Picchu_(3833992683).jpg\nThe Southern Cone is quite different. European culture is widespread, and the local economies and look\nof the land reflect this fact. For instance, the Pampas, an area around Buenos Aires, is a rich agricultural\nregion where field crops, especially soy, abound. Buenos Aires is a European-styled city, with a vibrant\ncentral high-rise district (see figures 9.9 and 9.10 below). Figure 9.9. Soy beans make up about half of Argentina’s crop production. Photo courtesy of “Arielex,”\nreleased into the Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Economy_of_Argentina#/media/File:Sojadepasodelaarena.JPG Figure 9.10. The high rises of central Buenos Aires are indicative of a European style metropolis. Image\ncourtesy of “Deensel,” CC BY 2.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Economy_of_Argentina#/media/File:High-\nrises_of_Puerto_Madero_(40022145164).jpg\nAs one moves to the interior hinterlands, the European pattern dissolves into more indigenous lifeways\nand landscapes. Boundaries of the indigenous west and European south become blurred. This is\nexemplified by the landlocked country of Paraguay. Paraguay’s capital, Asunción, is a western city with a\nstylized central city (figure 9.11). But it has had difficulty moving to a developed nation, and lags behind\nits southern neighbors in most economic categories.\nFigure 9.11. Asunción, Paraguay, incorporates modern high-rise designs. Image courtesy of\n“Anonymous,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Asunci%C3%B3n#/media/File:Asunci%C3%B3n_Paraguay.jpg\nA series of authoritarian leaders and wars with neighbors has curtailed the country’s growth. Guarani,\nan indigenous people and language, is one of only a few indigenous tongues to be widely used and\nnationally recognized. Paraguay has characteristics of modernity, but has a strong pre-European ethnic\nmakeup.\nBrazil, the largest and most influential country in South America, is usually considered a region of its\nown. However, within Brazil there are uneven patterns that one can discuss (see figure 9.12 below). Figure 9.12. Regions of Brazil with population percentages and major cities shown. Image courtesy of\nunnamed author, located in “World Regional Geography.” CC BY-SA 4.0. Retrieved from:\nhttps://open.lib.umn.edu/worldgeography/chapter/6-3-brazil/\nThe South and Southeast parts of Brazil can be seen as an extension of the Southern Cone, in that this is\nthe most modernized area and home to the highest percentage of European descendants. Sau Paulo,\none of the largest cities in the world is found here. Likewise, one the most iconic cities, Rio de Janeiro, is\nalso located here (figure 9.13). Figure 9.13. The Statue Christ the Redeemer, is an iconic landmark of Rio de Janeiro. Image courtesy of\nRafael Rabello de Barros, CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Rio_de_Janeiro#/media/File:Cidade_Maravilhosa.jpg\nThe northeast is home to the highest percentage of African American descendants, who, like the rimland\ndiscussed previously, were brought to tropical plantations centuries ago as slaves. Five hundred years of\nintegration has produced a lively cultural mixture, imparting a regional distinctiveness.\nThe north of Brazil is home to the Amazon River and Basin. This remote interior is home to more\nindigenous people than any other region of Brazil. In terms of biodiversity, this area is extremely rich.\nMaintaining this biodiversity while also developing the region for timber and farmland are huge issues\nhere. Cutting and clearing parts of the Amazon raise concern over the loss of irreplaceable biodiversity\nand life sustaining forest.\n9.4 Cultural Awareness: Cities of America, South of the U.S.\nLearning Objectives\n1. Define megacity\n2. List the top four populated cities in this realm.\n3. Describe the Latin American Model.\n4. Discuss how urban patterns showcase cultural and economic variety.\nLatin American populations are more urban than people might think. Close to 80 percent of people in\nAmerica, South of the U.S. live in cities, making the realm one of the most urban. Additionally, four of\nthe cities are megacities; urban areas of over 10 million people. An estimated 22 million people live in or\naround Sao Paulo, another 22 million or so in Mexico City. Rio de Janeiro is around 16 million, and\nBuenos Aires has a population of over 15 million. Additionally, there are over 50 cities with populations\nof over one million in this realm. There are several reasons for this urban pattern. Mostly, the\nperception, real or imagined, of more opportunities and a better life have drawn people to the cities\nfrom the countryside. Within the city, geographers look for patterns of city life. Overall trends are idealized in models—\nsimplifications of the patterns seen. In Latin America, a classic model is applicable and is shown below in\nfigure 9.14.\nFigure 9.14. The Latin American Model. Courtesy of unnamed author, located in “World Regional\nGeography.” CC BY-SA 4.0. Retrieved from: https://open.lib.umn.edu/worldgeography/chapter/5-1-\nintroducing-the-realm/\nThe Latin American model, proposed by geographers Ford and Griffin, shows distinctive zones of use\nand occupation. These are typically determined by when people settle in or near the city, by wealth and\naffluence, and by function (residential areas versus business areas). The center of a typical Latin\nAmerican city has a well established market near a governmental district (seen on the CBD on the map).\nResidents build houses around this center. Over time, these become well established neighborhoods.\nThis is represented by the zone of maturity. As one continues to move outward, one comes across\nneighborhoods that are still being developed. Here, a first floor of a house is finished, but the stairway\nto the second floor will be built later. Some streets are paved, others dirt. At one time, this was an area\nof makeshift structures. Overtime, improvements have been made. Eventually, schools and city services\nwill help transform the zone of in situ accretion into a zone of maturity. On the margins, people come\nand build dwellings out of whatever they can. One day, this too, it is hoped, will become an established\nneighborhood (figure 9.15). Figure 9.15. Villa 31 is an example of a zone of in situ accretion on the edges of Buenos Aires, Argentina.\nGovernment Plans to infuse money and incorporate this area into the city government is ongoing. Image\ncourtesy of “Aleposta,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Slum#/media/File:Villamiseria4.JPG\nBesides these circular zones, Ford and Griffen note that an elite neighborhood moves outward along a\nprestigious and well-developed part of the city called the spine. Here, parks, zoos, hotels, and upscale\nbusinesses are dominant (figure 9.16). Figure 9.16. The Alameda Central Park in Mexico City is an example of an affluent landscape element\nthat one finds in center and spine of Latin American Cities. Image courtesy of “Luisalvaz,” CC BY-SA 4.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Alameda_Central#/media/File:Vista_de_la_Alameda_Central_desde_la_T\norre_Latinoamericana.JPG\nSometimes parts of zones are differentiated into ethnic neighborhoods. This is particularly true of Sao\nPaulo, Brazil, which is home to descendants of Portuguese, Italians, Japanese, and African slaves (figure\n9.17). These communities add yet another dimension to the urban fabric of America, South of the U.S. Figure 9.17. The neighborhood of Liberdade, Sau Paulo, part of the zone of maturity, is home to many of\nBrazil’s Japanese immigrants. Brazil is home to more Japanese than any other country outside of Japan.\nPhoto courtesy of “Caio do Valle Caiodovalle,” released into the Public Domain. Retrieved from\nWikipedia:\nhttps://en.wikipedia.org/wiki/Liberdade_(district_of_S%C3%A3o_Paulo)#/media/File:Liberdade_sao_pa\nulo.jpg"
}