{
    "text": "Chapter 5. Sub-Saharan Africa\n5.1 Defining the Realm: Why not all of Africa?\nLearning Objectives:\n1. Define the cultural and physical boundaries of the Realm.\n2. Relate the broad arc of Africa’s history until early European Contact.\nWhy consider Sub-Saharan Africa a world realm rather than the whole continent? The answer is found\nboth in the environmental and cultural differences between the north and south. The North is\ndominated by the Earth’s largest desert, the Sahara. The north is also home to people who have, for the\nmost part, adopted Islam. North Africa, then, can be better understood as part of the same realm as\nSouthwest Asia, which is also the home of Islam and deserts.\nFigure 5.1. Satellite overview of African Environments with major place names. Additional cartography\nby Lincoln DeBunce. Base image courtesy of NASA, Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Geography_of_Africa#/media/File:Africa_(satellite_image).jpg As Figure 5.1 suggests, Sub-Saharan Africa is separate from the desert environment of the north,\nbecoming more humid as one approaches the Equator. A zone called the Sahel, a grassland desert with a\ndistinct dry season, serves as a transition zone. Basins and Plateaus anchor the interior. To the east, a\nmountain and valley system, called a rift zone, has created highland savannas and long linear lakes. In\nthe south and southwest, deserts arise once more. And in the south, a small but pleasant mid-latitude\nzone of temperate weather dominates. Africa, south of the Sahara, is home to a multitude of native\nreligions, infused and found alongside various branches of Christianity and Islam. Peoples of this realm\nare ethnically and linguistically diverse, far more so than is reflected in a map of African countries.\nMadagascar, home of the Malagasy peoples, related more to their ethnic home of Melanesia, complete\nthe picture of this intriguing realm.\nThis realm is largely underappreciated for its deep history and prehistory. Humankind, including related\nforms of Australopiths evolved in East Africa 3-5 million years ago. The best evidence is that Homo\nsapiens emerge in Africa around 150,000 years ago. But this is not the only amazing note in Africa’s past.\nContrary to some peoples thoughts about Africa, numerous kingdoms, including cities and monolithic\narchitecture arose here in similar ways to other civilizations around the world. They started with\nagricultural innovations, such as the early pastoral occupation sites such as the Dhar Tichitt in\nSouthwestern Mauritania 6,500 years ago. Later, many civilizations arise on the African continent (see\nfigure 5.2 below). One of these, Great Zimbabwe (1,000-1,500 A.D.) shows the extent of monumental\ndesign and imply a highly organized political structure (figure 5.3). African Kingdoms would be severely\ndisrupted and eventually overthrown by European Colonialism that would change African politics and\nproductivity to this day. Figure 5.2. This is a partial compilation of African Kingdoms found between 500 and 2,500 years ago.\nConcentrations of these kingdoms are organized roughly by the broad regional boundaries. European\nexploration and colonialization diminished and/or outright replaced these indigenous political\nstructures. Derivative Map courtesy of Monsieur Fou from the original work by Jeff Israel (ZyMOS), CC\nBY-SA 3.0. Retrieved from Wikimedia: https://commons.wikimedia.org/wiki/File:African-civilizations-\nmap-imperial.png Figure 5.3. Part of Great Zimbabwe, featuring the main enclosure whose walls are over 30 feet high.\nPhoto courtesy of “Simonchihanga,” CC BY-SA 4.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Great_Zimbabwe#/media/File:Great-Zimbabwe-still-\nstanding_strong.jpg\n5.2 Cultural Awareness Issue: The myth of the Nation-State.\nLearning Objectives:\n1. Discriminate between the terms nation and state.\n2. Explain why the prevalent ideal of a nation-state is problematic.\n3. Describe how colonialism and the Berlin Conference shaped the political geography of\nSubSaharan Africa.\n4. Define neocolonialism and explain how this can affect the development of newly emerging\nstates.\nThe map of African countries is an intriguing patchwork, whose names have changed over the years (see\nfigure 5.4 below). One may wrongly assume that these countries are representative of the people within\nthem; that most of the people rose up an declared this is our space and these are our borders. As figure\n5.5 indicates, this is not the case, and if examined with some thought on world events, is an important\nlesson. To lay the groundwork of this point, we need to clarify some political terminology, and then\napply them to this realm, and beyond. Country is a commonly used term but is not very specific. Political\nscholars instead like the terms State and Nation. A State, as in a state-of-the-world, is a political box\nwith a governmental apparatus. For instance, The State of Kenya has borders and has a capital located in\nNairobi. It has a government whose policies ideally extend to its borders. The term “Ideally,” is a\nworthwhile qualifier. Not all states have governments that function well. Also, not all states have well defined borders. When a State of the world becomes highly dysfunctional, it can be said to be a failed\nstate. Another thing to consider regarding states is that the visible states on a map are those that are\ninternationally recognized. Sometimes, a counter government can be found in an internationally\nrecognized state that has borders. This insurgent state controls aspects of policing, education,\neconomics, etc. It operates as a state but is not internationally recognized.\nFigure 5.4. States of Africa. The green line separates the SubSaharan realm from North Africa, which is\npart of the Southwest Asia/North Africa realm. Additional cartography by Lincoln DeBunce, original map\ncourtesy of Eric Gaba, CC BY-SA 2.5. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/United_States_of_Africa#/media/File:African_continent-en.svg Figure 5.5. Precolonial ethnographic boundaries compiled by George Murdock depicts a better reality of\nthe diverse peoples in Africa. Image retrieved from: World Regional Geography, pressbooks:\nhttps://worldgeo.pressbooks.com/chapter/sub-saharan-africa/ , based on Pre-colonial Ethnographic\nRegions of Africa (© George Murdock, Suzanne Blier, and Nathan Nunn, CC BY-NC-SA 3.0 US).\nSomalia is a good example of a failed state that has a strong insurgent state in its midst. After a brutal\ncivil war that broke apart allegiances in the Horn of Africa, Somalia is struggling to maintain a central\ngovernment. As the map shown in figure 5.5 indicates, many places in the southern part of the country\nare controlled by Islamists, hardliners who are not helpful in rebuilding the country. Other regions seek\nto be part of a united Somalia, but wish for regional control. To the north, the proclaimed state of\nSomaliland represents an insurgent state that has proclaimed secession (they want to leave). This\ndeclaration, however, has yet to be accepted by Somalia and, more importantly, the world community\nof states. What is not highlighted strongly is that structures at the local level, often militias led by a\nnetwork of relatives, are more of a force to be reckoned with than state-level laws or their\nrepresentatives. Figure 5.5. The political situation as captured on a map in 2017. Somaliland could become the latest\nrecognized state of the world. Cartographic work courtesy of Nicolay Sidorov, who has released it into\nthe Public Domain. Key retouched by Lincoln DeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Somalia#/media/File:Somalia_map_states_regions_districts.svg\nA Nation is different from a state. A Nation is a group of people who feel an affinity for one another and\nan attachment to a homeland. Nations are not states. The Cherokee Nation, for instance, is a Native\nAmerican Tribe who sees themselves as a cultural group that has a homeland, but they are not a State. The distinction between State and Nation allows for more possibilities and a better description of what\ncountries are about. You can have Stateless Nations, like the Cherokee, or the Igbo of Nigeria, who\nfought a civil war for independence. Conversely, you can better describe almost all countries as\nmultination states, places where many peoples who have a sense of a homeland and in one political box.\nWhat is extremely rare, but has been put forward as an ideal, is the Nation-State. Iceland is the best\nexample of a nation-state. Other countries often claim this fact, but is seldom the reality.\nWhen we apply Nation and State to the countries of SubSaharan Africa, we find that no State is a nation\nof one people. Tribal lines often transect boundaries. State boundaries are largely a glaring mismatch of\nthe peoples found in the region. This causes all kinds of problems in building up and running a country\neffectively—especially when the government attempts to claim its people as in charge, and minority\npeoples needing to conform. This is the major program of the myth of the nation-state. By seeing reality\nas one political box run by one people, we make invisible the reality of different people wanting\nrecognition, autonomy and the ability to run one’s own affairs. Sometimes these interests lead to major\ninternal disagreements, efforts to devolve the country into two or more separate countries, or to take\npower from a competing group. To the international community, these efforts are often seen a civil and\ninternal strife and war and not therefor, a matter for intervention. Sometimes intervening outside forces\ndo try and instill peace through international “peacekeeping” efforts. Regardless, the idea of one nation\nand one state perfectly coinciding has wrought instability and carnage, not only in Africa, but in much of\nthe world.\nSo how did this mismatch of people and boundaries occur? One would think that a group of like-minded\npeople would mark-off land that they occupy and build a country. This did not happen. Instead,\nEuropeans brought the idea of the nation-state to Africa. Europeans explored and claimed broad swaths\nof land in pursuit of gaining the riches and resources of Africa and its peoples. This is what colonialism is\nabout. Claiming lands already occupied, plundering the resources and largely exploiting the native\npeoples that were found there. When territorial maps were developed, they were largely about the\ncolonial powers making sure to claim lands in an agreeable way, and thus avoid potential conflicts. In\nfact, in the winter of 1884-1885, European powers came together to hash out the colonial boundaries.\nThis took place in Berlin, and is known as the Berlin Conference. Figure 5.6 shows the claims of Africa in\n1914 by European powers. Notice that Ethiopia in East Africa, and Liberia, established by the United\nStates for slaves wishing to return to West Africa, are the only non-colonial entities in Africa at this time. Figure 5.6 Colonial control of Africa in 1913. Derivative Map by Caitlin Finlayson, based on the original by\nEric Gaba, Wikimedia Commons, CC BY-SA 4.0. Retrieved from World Regional Geography, pressbooks:\nhttps://worldgeo.pressbooks.com/chapter/sub-saharan-africa/\nThose local peoples that eventually supported the colonizers, usually those that helped build the coastal\nports, helped extend navigation upstream, helped to build the roads and rail lines, and gained at least\nsome economic and political superiority over other groups in the area, were those that arose to\nprominence over other tribal groups. By the end of World War II, people in several of these European\ncolonies were gaining independence. What bound these people together was the hope of a brighter\nfuture and a common colonial oppressor. Unfortunately, once independent, these new countries had to\nbuild upon a plundered resource base and navigate the tricky waters of incorporating numerous culture\ngroups, some of which were traditional enemies, together. This has not been easy. Compounding this history is that the economic links in many of these budding countries are with the\nEuropean colonist to which they are trying to be rid. These economic arrangements could be painfully\nbroken, with new countries “buying out” European corporate interests, or in trying to find new\npartnerships. Loans to these countries have led to debt and foreign linkages that are difficult to remove.\nLeaders of several new countries have been susceptible to corruption and “being-in-bed” with foreign\ncorporate leaders. These type of post-colonial linkages have been termed neocolonialism. Neo means\nnew. In neocolonialism, lingering connections of exploitation and corruption from past relationships\ncontinue, stunting the development of these newly emerging states.\n5.3 Regions of Sub-Saharan Africa.\nLearning Objectives:\n1. Discriminate between each Sub-Saharan region.\n2. Overview the general map layout of each region.\n3. Describe the major human and environmental issues of each region.\nThere are many ways we can regionalize this realm. The following map (figure 5.7 below) from the\nUnited Nations represents a common arrangement. Note that the North Africa region belongs in\nanother chapter on North Africa and Southwest Asia.\nEast Africa is distinctive due to its higher elevation. Expansive savannahs, such as the Serengeti, large\nlakes, and the East African Rift Zone form a backdrop to this interesting land. The British and Germans\nwere major colonial influences in this region, and while Germany lost its claims during World War II, the\nBritish influence, especially in terms of social institutional structures, like courts, laws, museums and\nplaces of learning, along with a continued use of English as a trade language, continue to be a lasting\npresence.\nPolitical stability alongside gruesome genocidal civil wars are an unfortunate paradox in East Africa.\nMuch could be learned from the multi-tribal country of Tanzania whom, despite a lack of a clear core,\nhave forged a lasting peace. Kenya, less diverse, nonetheless has also overcome challenges upon\nindependence to become something of an anchor for others to model. Other countries, however, have\nfailed to emerge from colonial rule without heartache and suffering. Somalia has already been\ndiscussed, but other countries have struggled mightily as well. Uganda has had a missed history marked\nby a notorious strongman, Idi Amin, who ordered the deaths of at least 300,000 citizens and eventually\nmade a disastrous decision to attack neighboring Tanzania. This led to his ouster and exile. The genocide\nof 500,000 to 1,000,000 Tutsi tribespeople in the 1990’s Rwandan civil war is another startling example\nof how horrid conditions have been in some place of Sub-Saharan Africa. This war spilled into the\nneighboring region of central Africa and has destabilized the Democratic Republic of the Congo to this\nday.\nSome countries of East Africa have displayed mixed success in obtaining post-colonial success. One such\nexample is Zimbabwe, which emerged in 1980 after years of war with former British colonists. This\ncountry had a successful agricultural industry that wisely kept former British landowners in place to help\nbuild a productive State. Unfortunately this did not last. Over time, increasingly aggressive squatters displaced the White agricultural landowners. Government leaders seemed to look on with apathy. Many\nof these former British colonists have reluctantly left the country. Productively, especially in the\nagricultural sector has dropped dramatically.\nFigure 5.7. Regions within the Subsaharan Africa Realm. United Nations Geoscheme based on\n“Image:Blank_Map-Africa.svg by User:Andreas 06,” Public Domain. Green boundary line added by\nLincoln DeBunce.\nWest Africa’s historical trade networks and practices are worth noting. Trade cities like Timbuktu,\nDjenné, and Gao, located in present-day Mali, harken back to a vibrant trans-Saharan trade route where\nsalt and other goods from the desert northwest were traded for gold, Slaves, and tropical goods. These\noperated from the 10th to 14th century, until Portuguese traders disrupted this relationship. Another aspect of trade that is quite historical in origin and continues today in the practice of periodic\nmarkets. Periodic Markets are places where villages set up and buy/sell and trade local foods and hand\nfashioned consumer goods (figure 5.8 below). They might be thought of as “farmers markets” or “street\nfairs.” Historically they were the primary way people exchanged goods and services. Periodic markets\nmeet on a regular schedule, typically every four days, but other intervals are used as well. Villages\ntypically meet on a day that is not the same as a neighboring village; schedules are staggered. This\nallows those individuals who wish to trade more than every four days to travel to nearby markets.\nPeriodic markets are a mainstay in this region of Africa, but are also found throughout portions of Africa,\nSouthwest Asia, East Asia, and Latin America. In larger cities, periodic markets are less notable, and\ninstead permanent marketplaces are found. In mid-sized towns, such as the one seen in figure 5.8, a\n“market-day” still is practiced, though the market operates to a lesser degree on a daily basis.\nFigure 5.8. A market scene in the modest sized city of Niamtougou, Togo. The market day here is every\nSunday, but vendors can be found throughout the week. Image courtesy of Grete Howard, CC BY 3.0.\nRetrieved from Wikipedia: https://en.wikipedia.org/wiki/Niamtougou#/media/File:Niamtougou1.jpg\nIn terms of climate, central Africa shares an equatorial forest biome. But trade linkages were, and still\nare more tenuous here. Coastal areas were developed by European colonizers, but good roads and rail\ninto the interior are less common, and those that do exist are oriented on bringing raw goods, such a\nlumber to the coastal cities. Even in coastal areas, where development is more advanced, water remains an important transportation medium over roadways. The lack of unifying transportation linkages are\none of the key geographic realities of this region.\nThe post-colonial experience of these countries has focused on near-shore oil reserves found in the gulf\nof Guinea. States have agreements with foreign corporations to help extract petroleum. This is a\ntemporary boon for local economies, and one hopes that the revenue will improve the future of the\nbudding countries development. Unfortunately, there are many reasons to be pessimistic. Political\ninstability, including civil wars in places like the Democratic Republic of the Congo, the Central African\nRepublic, as well as poverty which tends to drive people to cities that are increasingly overwhelmed by\nthe needs of newcomers, hamper efforts. Even in relatively peaceful countries, such as Cameroon and\nGabon, poverty is high.\nThe region of South Africa is climatically distinct from other Sub-Saharan regions, with more seasonality\nand moderate temperatures in the far south. Interior and western coastal deserts are the norm in\nNamibia and Botswana. The European colonial experience in the region dates back to the establishment\nof Cape Town by the Dutch in 1652. British rule which came later offered the settled Dutch some\nautonomy. But this uneasy arrangement dramatically expanded across Southern Africa, with groups of\nformer Dutch citizens journeying east, later followed by a determined British. Wealth was to be had in\ngold and diamond mines. Labor came to South African shores from British colonial subjects in South Asia\n(Indians), and even in the way of Chinese merchants and laborers. The wealth and success of the\ncountry of South Africa from these extractive pursuits benefitted White industrialists in particular. And\nlong established discriminatory racial practices were extremely obvious in the wealth differential and\nthe type of life of those who have resources, the White descendants of British and Dutch, versus the\npoorest and most vulnerable, who were descendants of ancestral African tribespeople. These\nestablished racial policies were known as apartheid in South Africa, and was finally overturned by\ninternal protest and external international boycotts and sanctions in 1994. Today, the country of South\nAfrica is a country whose future is uncertain but full of potential. The presence of HIV/AIDs as a portion\nof the population is highest here, fueled by a denial by political leaders of the past. About 1 in 5 South\nAfrican citizens test positive for the disease. Fortunately, life expectancy has rebounded somewhat with\nthe introduction of antiretroviral drugs (see figure 5.9). Figure 5.9. Life expectancy of selected African States. The drop and rebound are related to HIV/AIDS and\nthe introduction of drugs to counter the virus. Graph courtesy of Thomas Splettstoesser, CC BY-SA 4.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/South_Africa#/media/File:Life_expectancy_in_select_Southern_African_c\nountries_1960-2012.svg\nTo the North and west, the desert countries of Namibia and Botswana are relatively well off countries\ncompared with their Central African counterparts. Namibia is closely tied to South Africa, having gained\nindependence rather recently, in 1990. Income disparity is an issue in the country, but its natural\nresources which include mineral wealth and tourism centered on wildlife tourism have helped make this\nnew country an early success. Botswana is a sparsely populated country that has capitalized on revenue\nfrom mining, cattle ranching, and a vibrant tourist industry centered on the African wildlife (see figure\n5.10 below). While influenced from South Africa, its history of independence is longer (1964) than\nNamibia’s, and its direction and focus less tied to its southern neighbor. Figure 5.10. Zebras and Gnus are some of the spectacular sites to see in Chobe National Park, Botswana.\nImage courtesy of “Gorgo,” Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Chobe_National_Park#/media/File:Gnus_zebras_chobe_national_park.jpg"
}