{
    "text": "Chapter 2. Oceania\n2.1 Small populations and an Ocean of Blue\nLearning Objectives:\n1. Overview the physical aspects of Oceania.\n2. Describe the diversity of lifeways and people in the realm.\n3. Locate the four regions of this realm and list key physical and cultural differences between\nthem.\nFrom Hawaii to the north, Easter Island to the east, New Zealand to the south, and Australia to the west,\nOceania is a vast realm of sparkling seas and oceans, rugged high islands and low coral atolls, and\nunforgiving desert outback. Isolation, distance, and small populations are considerations in connecting\nplaces to one another is this commonly overlooked realm.\nFigure 2.1 Map of Oceania Regions. Courtesy of Lincoln DeBunce, adapted from the derivative work of\n“Cruickshanks,” based on an original UN Geoscheme map. In this version, New Zealand is in a\ntransitional zone, part of Australasia and part of Polynesia. The andesite line, separating larger\ncontinental based islands from the smaller Pacific plate islands is indicated by the dotted line. Retrieved\nfrom Wikipedia:\nhttps://en.wikipedia.org/wiki/Oceania#/media/File:Oceania_UN_Geoscheme_Regions.svg.\nPhysically, this realm can be divided into locations east or west of the andesite line (see figure 2.1). West\nof this line are found islands and continents associated with andesitic continental rock materials. They\ntend to be larger than islands located to the east of andesite line. Here, basaltic Pacific Plate earth\nmaterials have risen to form a plethora of Micronesian and Polynesian islands. Biogeography, an area of study that emphasizes the cause of plant and animal distributions, is an\nimportant consideration to understanding this realm. The concept of island biogeography posits that the\nfurther away an island is from a continental mainland, the less species diversity is found. Size of the\nisland is a factor as well. Smaller, more remote islands will have far less biodiversity than larger islands\nlocated near the continents. In examining figure 2.1 above, we should expect to see less biodiversity in\nPolynesia and Micronesia, and more biodiversity in Melanesia and Australasia.\nThe types of plants and animals is also related to evolutionary source regions. Plants and animals that\ndeveloped in mainland Asia will be more likely found in neighboring islands than those arising\nelsewhere. Australia is interesting in this regard. It has a geologic history of being isolated from other\ncontinents. Here, different forms of mammals are present. Monotremes (egg-laying mammals), like the\nduck-billed platypus, are found along-side marsupials (mammals who typically carry young in pouches),\nlike the kangaroo. In addition, most Australian native plants are found nowhere else. The delineation\nbetween the biogeographical realms of Asia and Australasia have been noticed by scientists of the past.\nThe Wallace, Weber, Lydekker, and Huxley lines shown in figure 2.2 below represent efforts to mark this\nboundary.\nFigure 2.2 Proposed boundaries of Biogeographic realms are shown. Sundra and Sahul are the names for\nthe exposed continental shelves in times of world cooling. Courtesy of “Altaileopard.” Retrieved from\nWikipedia: https://en.wikipedia.org/wiki/Wallace_Line#/media/File:Map_of_Sunda_and_Sahul_2.png The movement and settlement of peoples into this realm is one of the most fascinating stories of human\ngeography. 40-50,000 years ago, peoples of East and SE Asia crossed between Sundra into Sahul. Even\nthough the continents were closer together, rafts or similar means of travel must have been used to\ncross the gaps between landmasses. Archaeological evidence suggests that the earliest Australians,\nknown collectively as Aborigines, lived and expanded along the coastlines first, then later began settling\nthe interior. These peoples were hunters and gatherers, subsisting on wild plants and animals. 40-\n50,000 years is plenty of time for peoples to become isolated from one another, to develop different\nlanguages and traditions. This early wave of “Australasian” and “Melanesian” colonists also settled in\nNew Guinea and other neighboring andesitic islands of Melanesia. In Figure 2.3 below, these peoples\nand their suggested migration paths are indicated by the blue arrows.\nFigure 2.3 Australasian and Polynesian Migration in Oceania. Courtesy of David Eccles, CC-BY 3.0.\nRetrieved from Wikimedia: https://commons.wikimedia.org/wiki/File:Polynesian_Migration.svg.\nAs indicated in the map (figure 2.3), New Guinea was colonized at different times by different peoples.\nThough soils are poor, tropical agriculture took root here. Different elevations brought people different opportunities for food and resources. Lowland peoples have different traditions and foodways from\nhighland groups. For instance, highlanders rely on root starches for their food base rather than the Sago\npalm and other tree based starches of the lowlanders. Given the deep time-line, multiple paths of\nmigration, and the varied environment, New Guinea remains one of the most culturally and linguistically\ndiverse places on earth. The neighboring islands of Melanesia have a similar settlement history and\ncultural diversity between islands is high.\nPolynesian movements into the Pacific happened later than Australasian migrations, but their\nsettlement sweeps across broad swaths of ocean never before reached by humankind. The major\ntechnology used by the Polynesians was a mariner-oriented complex of outrigger canoes and intimate\nknowledge of navigation incorporating prevailing ocean currents, wave-forms, bird movements, and\nstars, as well as wayfinding songs and stories. Most Polynesian movements and consequent settlements\nwere purposeful voyages involving large and multiple outrigger canoes moving families that brought\nwith them an assemblage of tools, dogs, chickens, and tropical plant cuttings (taro, banana, coconut,\netc.) needed to colonize a virgin island. Because of the more restricted timeline, and the singular nature\nof migrants, Polynesian peoples and cultures are more uniform than Melanesian, Micronesian and\nAustralian regions. Nevertheless, languages, lifestyles and art forms do vary from place to place.\nMicronesia is a “catch-all” of peoples migrating from South and East Asia, and from Polynesian peoples\nmoving westward after their Pacific island hopping to the east. Micronesian islands tend to be small,\nwith singular culture groups occupying low-lying atolls. These people are focused on marine resources,\nlargely fish, turtles and mollusks. The few larger islands have a greater admixture of peoples and\nenvironments upon which to draw more of an agricultural existence. Breadfruit, yams and a variety of\ncitrus and other tropical fruits grow well in the rich basaltic soils.\nIn the last few hundred years, Oceania has been explored and colonized by European, American, and\nAsian powers. The Spanish were first to establish a string of colonies through this realm from Mexico to\nThe Philippines. British, French, German, Japanese, and American governments have all claimed\nterritories. These more recent colonists have left a cultural imprint of varying degree. French Polynesia,\nfor instance, is considered an overseas department of France, and not surprisingly, French language and\nmaterial symbols like money and architecture are evident. The United States has territorial claims to\nvarious islands such as American Samoa, Guam, and Hawaii, as well as strong post-colonial alliances with\nThe Federated States of Micronesia and The Republic of the Marshall Islands. The British strongly\ninfluenced the cultures of Australia, New Zealand, and laid territorial claims to a vast array of scattered\nPacific Islands such as Fiji, Solomon Islands, and Pitcairn Island.\n2.2 The Similarities and Differences of Australia and New Zealand\nLearning Objectives:\n1) Contrast the Physical geography of Australia and New Zealand\n2) Compare the settlement history and understand the term Peripheral Development\n3) Apply the concept of “Planned Capital” to Australia and New Zealand.\nUsing a simple technique of comparing and contrasting Australia and New Zealand is an insightful way of\nlearning about the Australasia region. Physical differences are obvious. Australia is a continent with\nassorted nearby islands. The interior is desert and mountain ranges are old, worn and infrequent. The continent is safely within a large tectonic plate; earthquakes are infrequent. New Zealand consists or\ntwo large and numerous small islands. The interior is mountainous. It is one of the most tectonically\nactive places in the world (see Figure 2.4 and 2.5 below).\nFigure 2.4. This scene of the Australian Outback with Mt. Connor/Attila in the background contrasts\ngreatly with figure 2.5. Photo courtesy of Gabriele Delhey. CC SA 3.0, retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Outback.JPG. Figure 2.5. The Aroarokaehe Range on the South Island poses a barrier to interior settlement in New\nZealand. Photo courtesy of Bernard Spragg, released into the Public domain. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:The_Aroarokaehe_Range._Mt_Cook_NP._NZ_(32215055714).\njpg.\nCulturally, an obvious similarity between Australia and New Zealand is that British ideas of architecture,\nagriculture, political systems and other aspects of culture are seen in both countries. This is because\nboth countries were strongly impacted by British Settlement. In contrast, British settlement began in\nAustralia by the import of British prisoners. In New Zealand, British settlement was voluntary, and in\nsome cases religious communities purposely created settlements based on their religious ideals.\nCanterbury and Dunedin are notable in this regard.\nAnother cultural contrast is among the first settlers of this realm. Aborigines in Australia made their\nliving and organized themselves to accommodate a hunting and gathering lifestyle. Small bands that\ngathered and dispersed according to the rhythms of the seasons were typical, and military organization\nto resist outsiders weak. The Polynesian Maori of New Zealand, on the other hand, were agricultural\nbased tribes that were hierarchically organized and had a reputation for fierceness. The art, language\nand foodways of the first peoples of both countries is widely different and imparts uniqueness to both\ncountries. How the British treated each group differed. The Aborigines were pushed off their better\nlands. The Maori entered into a treaty with the British at a place called Waitangi. Subsequently, they\nalso became marginalized.\nBoth countries are exemplars of peripheral development. This is a concept where the margins of the\ncountry are developed rather than the center. In both Australia and New Zealand’s case, port cities for\nimporting and exporting goods back and forth to Great Britain grew at the expense of internal stabilizing\ncores. Peripheral development was exacerbated (made worse) by the interior environments (deserts\nand mountains). Figures 2.6 and 2.7. Major locations on both Australia and New Zealand show a pattern of peripheral\ndevelopment and planned capitals. Both maps courtesy of the Central Intelligence Agency (public\nDomain). https://www.cia.gov/library/publications/the-world-factbook/attachments/maps/NZ-map.gif\nand https://www.cia.gov/library/publications/the-world-factbook/attachments/maps/AS-map.gif\nOne consequence of peripheral development in Australasia is that different colonies had their own\n“gateway” cities and their own hinterlands that supplied raw materials. When each colony tried to unify,\ndifferent gauged railways and other disconnected infrastructure needed to be mended. Regional\nloyalties led each country to create a centrally located “planned” capital. In Australia, a straight line\nbetween the two rival cities of Melbourne and Sydney was plotted. A suitable build site was created\nnear the midpoint. This is where Canberra was established. In New Zealand, rumors of the South Island\nsplitting away from the North Island led to the selection of Wellington, near the strait separating both\nislands. This location symbolically is in the middle of New Zealand.\n2.3 Melanesia, Polynesia, and Micronesia A big contrast in these island places is between “high” islands and “low” islands. High islands are\nmountainous and generally larger than low islands. High islands have more access to various plant and\nanimal resources, and are well watered. High islands tend to be oriented toward farming. Breadfruit,\nhard and soft taro, sugarcane, yam, mango, citrus, bananas and plantains, are some of the myriad of\ncrops typically grown. Low islanders traditionally are marine oriented in their subsistence. Protected\nlagoons and reefs brimming with reef fish, and mollusks provide a backbone of protein food sources.\nAgriculture is limited to salt water and sand tolerant plants such as coconut and pandanus. Often pits of\nleaf matter form a base for soft taro.\nFigure 2.8 and 2.9. The resource rich high island of Moorea, French Polynesia above, contrasts with\nAtafu Atoll in Tokelau, a low island with interior lagoon, seen below. Figure 2.8 Courtesy of Remi Jouan,\nCC-BY-SA-2.5. Retrieved from: https://en.wikipedia.org/wiki/Moorea_Airport#/media/File:Moorea_-\n_Vue_avion_(1).JPG. Figure 2.9 Courtesy of NASA, Public Domain. Retrieved from:\nhttps://en.wikipedia.org/wiki/File:Atafutrim.jpg. The cultures of these thousands of islands can be understood from the general themes of Home,\nresource extraction, paradise, and military pawns.\nSeveral themes emerge to help us understand the three insular regions of Oceania: Islands as home,\nislands as possessions to extract resources, islands as paradise, islands as military testing grounds and\nstrategic locations, and islands as emerging nations. As mentioned earlier, adventurous islanders settled\nin Polynesia, Melanesia, and Micronesia, centuries ago. The descendants of these original islanders\ncontinue to make a living, keep homes and raise families on these gems of the Pacific. It is important to\nremember that islanders are living their lives and raising families just as people do all around the world.\nThey have creation stories and distinct cultures, including languages that form a wonderful example of\nhuman experience and expression. But these peoples have been vulnerable to outside forces.\nAs colonial powers extended their range of influence into the Pacific, resources such as whales, copra\n(coconut meat) and in some islands, metals and phosphorus, were extracted under foreign colonial rule.\nSome island economies have been completely transformed from self-sustaining garden paradises, to\nplantation crops such as sugarcane and coconut that are at the whim of foreign owners and world\nprices. Islands like Nauru, in Micronesia, have been thoroughly mined of phosphorus, its surface sold for\nprofit, and its land mostly in ruins.\nAs stories of these islands and the beautiful people on them made their way back to Europe and beyond,\npeople’s imaginations of paradise, travel, and more recently, tourism has ensued. Today, tourism plays a\nmajor role in the economies of several island outposts. Hawaii and French Polynesia are prominent examples. Tourist dollars transform coastlines and tax local environments, but generate considerable\nrevenues. Unfortunately, monies spent on the island are often siphoned off by the outside investors\nwho have partnered to build and run the tourist resorts. Those employed in tourism are also reliant are\nthe ebb and flow of tourist desires to travel.\nFigure 2.10 Waikiki Beach is a tourist icon of Hawaii. Photo courtesy of Cristo Vlahos, CC BY-SA 3.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Waikiki#/media/File:Waikiki_Beach,_Honolulu.JPG\nThe 19th and 20th centuries saw these islands become more involved in the military machinations of\ncontinental powers. After the Japanese extended their sphere of control into the Pacific, the United\nStates pushed back. Post World War II politics have continued to shape these places. Both the French\nand United States extensively tested nuclear weapons on and near island possessions. Island nations\ncontinue to make their way into the realm of recognized states of the world. Some, like the Federated\nStates of Micronesia, are relative newcomers, and others, like French Polynesia, continue to be overseas\ndepartments of countries located very far away.\nThe acronym “MiRAB” is another way of understanding the way of life in island societies today. It stands\nfor migration, remittance, aid, and bureaucracy. Migration and remittance go together. As islands\nbecame (and are continuing to become) part of the world market economy, younger islanders migrated\nto other islands and colonial home countries to find work. They would then send money back to their\nextended family networks back home. Over time, communities of islanders emerged outside of their\nhome islands. Notable examples are a myriad of Polynesian peoples who work and live in New Zealand,\nand Chamorro’s, indigenous people of Guam and the Mariana Islands, who have a strong presence in\nSan Diego. On a more local scale, the movement of islander from rural parts of their countries to more\nurban port and governmental locations, also occurs. Port Moresby in Papua New Guinea is a notable\nexample. Aid and bureaucracy also go together. Foreign aid, often from former colonial home countries flow into\nemerging island countries and is often distributed through bloated island governmental agencies and\noffices. In a healthy environment, local businesses and perhaps the extraction and manufacturing of\nproducts would provide revenue to support local governments. In several countries, notably in\nMicronesia, the government is the largest employer and these worker’s income support local\nbusinesses. This is not ideal. The effect is dependency upon foreign monies for the islander’s livelihoods.\nThe future of Polynesia, Melanesia, and Micronesia are in peril due to the potential sea level rise from\nglobal warming. Hundreds of low island atolls are likely to be uninhabitable in the next few decades.\nBefore they become submerged, flooding and irregular precipitation will likely drive the peoples on\nthese islands to vacate due to a lack of fresh water, which is already a vulnerable and limited resource\non this type of island.\n2.4 Cultural Awareness: Asserting Indigenous Rights\nLearning Objectives:\n1) Appreciate “First Peoples” rights and how New Zealand and Australia are dealing with their\ncolonial histories.\nAustralia and New Zealand’s treatment of first people’s is a good study in understanding the rise of\nindigenous peoples asserting power after being historically oppressed. As mentioned earlier, the Maori\nof New Zealand entered a treaty with the British at a location on the North Island called Waitangi. Over\ntime, the British and their modern day progeny discounted and ignored this treaty. This period of time,\nroughly 1860-1930, is poignantly referred to as “loss of memory” by author Claudia Orange. After this\ntime of forgetfulness, Maori leaders began reasserting their rights under Waitangi. Eventually a tribunal\nwas convened. In a number of unprecedented outcomes, Maori claimants have won restitution from\nthe New Zealand Government for assertions of polluting fishing grounds, loss of habitat and home areas\nand the like.\nThe significance of these outcomes can’t be overstated. New Zealand has been a bellwether for\nprogressive social changes that have spread to other developed countries. New Zealand was the first to\nestablish an eight hour work day, and the right of women to vote in elections. To uphold and award\ndamages for broken treaties sets a tone for reconciliation to spread to other places. This is the case for\nAustralia.\nIn the 1980’s Eddie Mabo, a Torres Strait Islander, challenged the Australian Government’s claim of terra\nnullius, the idea that Australia was “empty land” settled by the British. This challenge was affirmed in\n1992, and was followed by The Native Title Act of 1993. Subsequently over one million square miles of\nland have been claimed by aborigines and Torres Strait Islanders. In 1996, a Reconciliation week for all\nAustralians to remember and celebrate their shared cultures began. In 1998 a National Day of Healing,\nalso known as “Sorry Day” was enacted."
}