{
    "text": "Chapter 8. America, North of Mexico\n8.1 Defining the Realm\nLearning Objectives\n1. Overview what is included and excluded in defining this realm.\n2. Describe the basic physical geography of America, North of Mexico.\nRealm boundaries are a combination of physical and cultural features. Defining the boundaries of the\nAmericas hasn’t been consistent by geographers. Some have divided the realm into North America,\nMiddle America, and South America. This is workable, but technically Mexico is part of the North\nAmerican Continent. Why differentiate Mexico from the rest of North America? Because it is largely\nrecognized that culturally and economically Mexico has more in common with other places south of the\nUnited States than with the US. Recognizing this feature, some geographers have used the terminology\nof Anglo America and Latin America. While this is closer to recognizing the boundaries posed in this\ntextbook, it does gloss over the numerous non-Anglo peoples north of Mexico, as well as the peoples\nsouth of the United States who did not experience colonization by countries bringing Roman Catholicism\nto their shores. As a solution, though certainly not a perfect one, this text has adopted the United\nStates/Mexican Border as a rough partition between the two realms (see figure 8.1 below). Figure 8.1. The boundary of the two realms in the Americas in roughly the border separating the United\nStates and Mexico. Base map courtesy of Uwe Dedering, CC BY-SA 3.0. Additional editing by Lincoln\nDeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/File:North_America_laea_relief_location_map.jpg\nIn this text book, America North of Mexico includes part of the United States, Canada, and Greenland.\nGreenland is a self-governing overseas constituency of Denmark. All of Canada is included, but portions\nof the United States are not part of this realm. The US has overseas territories like Puerto Rico and\nGuam—they are not part of this chapter. Nor is Hawaii, which obviously is affected tremendously by\nwhat is happening in the mainland United States, but is instead placed into the chapter on the Pacific\nIslands.\nThe physical setting of North America is one of great, unfettered plains and gorgeous mountains. A\nsimplified pattern is presented in the map below (figure 8.2).\nFigure 8.2 General physical regions of America, north of Mexico. Interior lowlands and framed by\nmountain chains. Base map courtesy of Uwe Dedering, CC BY-SA 3.0. Additional editing by Lincoln\nDeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/File:North_America_laea_relief_location_map.jpg The Western Mountains region is characterized by folded mountains along the coast, productive interior\nvalleys, followed by inland volcanic mountains, such as the Cascades of Oregon and Washington States,\nthe Sierra Nevada of California, and the Alaskan Range. The Basins and Plateaus region are raised areas\nlocated between the younger Western Mountains to the west, and the more established Rocky\nMountains and Brooks Range to the east. Some of these elevated interior locations are quite striking in\ntheir beauty, but also are quite remote and unpopulated (see figure 8.3 below).\nFigure 8.3. This portion of Great Basin National Monument shows how remote parts of the Basin and\nPlateaus region can be from sizable human populations. Photo courtesy of Bob Wick, CC BY 2.0.\nRetrieved from Wikimedia: Basin and Range National Monument (21599169342) - Category:Basin and\nRange National Monument - Wikimedia Commons\nBeyond the Brooks Range in Alaska lies the Arctic Plain. Here lie expansive lowlands that are home to\nwildlife, and contain riches in the form of potential petroleum exploitation. Marked as region #5 on\nfigure 8.2 above, lies an extensive area of gentle topography made up of old lake sediments called the\nGreat Plains. These are semiarid lands that are agriculturally important, especially in regard to extensive\ngrazing. The Canandian Shield is a vast region to that covers much of the northern portions of North\nAmerica. Numerous Continental glaciations have scoured the land, denuded most of the would-be\nproductive soils, leaving behind a rocky and uneven region of elongated lakes hill, mountains and\nvalleys. Coupled with a cold, high latitude climate, this region is relegated to lumbering, mining and\nsubsistence hunting activities. As one would imagine, population density is low.\nSandwiched between the Canadian Shield to the north and the Coastal Plains to the south, is found the\nInterior Lowland region. The climate and soils of this region combine to produce some of the most\nproductive agricultural lands anywhere. Farming populations and large agribusiness towns and cities dot\nthe landscape. Manufacturing cities, most in decline today, are nestled around the Great Lakes. This\nregion is home to America’s heartland and aging manufacturing belt (see figure 8.4). Figure 8.4. Decatur, Illinois, is emblematic of the mid-sized cities that are found though out the interior\nLowland region of North America. Its economy is based on agricultural processing and like many other\ncities, is suffering a population decline largely due to declining manufacturing opportunities. Photo\ncourtesy of Gil Lebois, CC0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Decatur,_Illinois#/media/File:Downtown-MerchantRsz.jpg\nAreas marked 8 and 9 on the generalized physical regions map are associated with older, worn\nsedimentary highland complexes. The Ozark and Ouachita Mountains contain wonderful examples of\nlimestone eroded landscapes with many ponds, caverns, cliffs and waterfalls. The Appalachia Mountains\nform a north-south barrier across the eastern portion of the United States. Beautiful valleys and\nforested hillsides are home to a rural lifestyle that suffers from a lack of good paying jobs. Completing\nthe physical regions of North America are the Coastal Plains. This low-lying region is home to numerous\nport cities and important inland waterways. A “fall-line” that separates higher locations from coastal\nlocations was an important source of early water-powered small manufacturing (See figure 8.5). Figure 8.5. Columbus, Georgia, developed a very successful textile industry based upon the power of\nfalling water to power its mill. This pattern of building early North American industries repeats itself\nwhere the Coastal Plain meets the lower reaches of eastern North America’s interior plateaus. Photo\ncourtesy of “PghPhxNfk,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Columbus,_Georgia#/media/File:Downtown_Columbus,_Georgia_skyline.j\npg\n8.2 Cultural Awareness: Settlement Geography and Migration\nLearning Objectives\n1. Overview the movement of peoples into the realm.\n2. Recall major European settlement efforts.\n3. Distinguish three American cultural hearths.\n4. Describe the differences between U.S. and Canadian waves of immigration.\n5. Explain types of migration and appreciate attitudes toward the phenomenon.\nThe peopling of the Americas is an amazing story that continues to be researched and understood by\narchaeologists and related scholars. Humans came into North America from Siberia at least 16,000 years\nago, although many scientists believe this time-line goes back another ten to 20 thousand years. These\nearly migrants probably came in waves of settlement, likely walking across a lowered continental shelf\nbetween North American and Siberia, and by intermittent use of boats along the Pacific coastline, and\npossibly by other routes as well. Later migrations and explorations include those of Norse people into present-day Greenland and\nNewfoundland. In Greenland, Norse settlements began about 1000 years ago and lasted at least 350\nyears. Settlements in other locations have been suspected, but only L'Anse aux Meadows in\nNewfoundland has been confirmed by the majority of scholars.\nWaves of seafaring explorers came to the Americas beginning in with the Spanish in 1492. Though not\ndirectly setting foot on North American soil, the Spanish would later claim an extensive area including\nparts of present-day Florida and the western United States. Other European powers: the Dutch, English,\nand French, claimed parts of Eastern North America and established colonies in the 16th century. Russian\nexplorers and trappers had established themselves along the western edge of North America. By 1794,\nthe English and Dutch colonies had transformed into a young United States of America. French power\ngave way to English and would eventually form modern-day Canada. Figure 8.6 shows the state of play\nin the Americas toward the end of the 18th century.\nFigure 8.6. Eurasian power in the America’s at the end of the 18th century shows the presence of\nSpanish, French, English, and Russian power, as well as a newly founded United States. While all of the\ncultures would heavily impact Native peoples, the United States and Canada, both tilted toward a British\npattern of Governance and culture, would become prevalent. Map courtesy of “Jluisrs,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/European_colonization_of_the_Americas#/media/File:America_1794.png\nIn the United States, three distinct culture hearths emerged from the earlier British colonies. A culture\nhearth is a region in which distinctive patterns of outlook and behavior arise that is distinguishable from\nother locations. The northern coast colonies developed what geographers term the New England\nhearth. Here, small cottage industries, like wood working and textiles arose. The ideal town was built\naround a village green, flanked by small businesses and the local church. This pattern spread around the\nGreat Lakes area, and helps to explain the manufacturing and rural ideal evident in this part of the\nUnited States. The Middle Atlantic region, centered around Philadelphia, developed the pattern of the\nindependent small farmer who valued small government and private property. The cultural schema\nspread to the Ohio Valley, and later to the Midwestern Plain States, and eventually came out west on\nthe Oregon Trail. Southern colonies focused on market crops and developed a plantation agricultural\nsystem driven by slave labor from Africa. This South hearth spread through the Coastal Plain States. The\ndivision of the South and the New England hearth is evident in the U.S. Civil War.\nOf course, there were many other cultural forces that have shaped the North American landscape. Along\nwith the British, the French left an indelible mark on significant parts of Canada. And in Louisiana, a\ndistinct French/Cajun culture continues. Native American culture groups, predating by millennia the\nEuropeans, were subsumed and marginalized under the U.S. and Canadian Governments. Nevertheless,\nthese indigenous peoples have shaped and continue to shape the culture and life of North America.\nHistorical waves of immigration have impacted North America. Generally speaking, Canada has accepted\na large contingent of Eastern European and Russia immigrants over the years, and now is seeing waves\nfrom China and other East Asian places, as well as some Middle Eastern migrants seeking relief from a\ntroubled realm. In the United States, historical migrations were from Western, Northern, and Southern\nEuropean countries, like Germany, Great Britian, Sweden, and Italy. Current waves of immigrants to the\nUnited States are largely from Mexico and Central America. Another source is from Pacific Asia. These\npeoples have also helped make North America the diverse and vibrant realm we see today.\nMigration, a planned one-way trip of people, can be discussed as immigration (incoming movement), or\nemigration (outward movement), depending upon one’s perspective. Migration can be internal (moving\ninside of a country), or external (moving between countries). Causes of migration are a combination of\npush and pull factors. Push factors can lead to emigration. Major push factors are lack of work, political\ninstability, and persecution. Refugees are a type of forced migration where a group of people must leave\nan area or be subject to extreme negative consequences, including incarceration and death. Pull factors\nare associated with immigration. Favorable policies of gaining entrance, the promise of work and safety,\nand importantly, having a trusted contact already in place, are key reasons people might migrate to a\ndestination. When a clear pattern of migration exists, for instance for Hong Kong to Vancouver, it is\ncalled channelized migration. The reason for channelized migration is typically that relatives and other\nmembers of a newly established community with help others from the home country immigrate to the\nhost country. This is known as chain migration. Most ancestral Europeans coming to America are\nproducts of chain and channelized migration, which leads to distinctive ethnic communities, like “little\nItaly,” or “Germantown.”\nIt’s important to understand that attitudes toward newly arriving migrants have historically been mixed.\nEven though a community’s history might be one where two generations ago, it was established by immigrants, it doesn’t mean the people today are welcoming to migrants. From a historical perspective,\nAmerica north of Mexico will continue to repeat the past, welcoming and incorporating some groups at\nsome points in time, while also limiting access to groups at other points in time; migration has caused\ncontroversy in the past and will likely continue to be a source of contention.\n8.3 Economic evolution of the US and Canada\nLearning Objectives\n1. Distinguish different sectors of the economy.\n2. Apply the sectors of the economy to historical trends in the U.S. and Canada.\n3. List a few consequences of a changing economy.\nIt is useful to categorize different areas of the economy into various groupings, called sectors. The\nPrimary sector is concerned with extracting natural resources out of the environment. It is place specific.\nGrowing wheat, fishing for cod, mining for coal, are all examples. The secondary sector involves\nchanging the form of an item to increase its value. Manufacturing is another term often used. Milling\nthe wheat into flour, cleaning the fish and preparing it for sale, or taking cut trees and turning them into\nlumber are examples. The tertiary, or third sector of the economy involves providing services. It often\nincludes transportation, retail sales, banking, and the like. It also includes the manipulation of ideas and\nmanagement of information, and decision-making career choices.\nThe United States and Canada began as agriculturally based economies, heavily involved in the primary\nsector of the economy. Port cities along the east coast, and later along the Gulf of Mexico accepted\nimports of manufactured goods and slaves for labor in market crops destined for export. Consequences\nare that rural farms became widespread. Up to 1830, less than 10 percent of Americans lived in cities.\nLater, the economy transitioned into a manufacturing-based economy, especially in the northern United\nStates and Canada. Plantation farming continued in the Southern U.S. to some extent. This period saw\nthe growth of cities at the expense of rural society. For instance, in 1870, the early years of\nmanufacturing, about 25 percent of Americans were city dwellers. Consequences of a secondary\neconomy are a premium on industrial location. This occurred in North American around the Great Lakes,\na region typically known as the “Manufacturing Belt.” Lastly, the United States, and to a lesser extent\nCanada, has moved away from the secondary sector and into the tertiary; an evolution coined as post-\nindustrial. Consequences of this transition is a dislocation of factory workers and deterioration of the\nGreat Lakes manufacturing belt, and a premium on workers skilled in manipulation data. Place-bound\nwork is often urban centered, but high-speed communication technology has freed many workers from\nbeing place bound, but has also allowed some corporations to be able to operate in a “footloose”\nmanner, being able to relocate when conditions are desirable. The total amount of Americans living in\ncities is now around 80 percent. Even in a post-industrial phase, city life continues to appeal to a large\nAmerican demographic.\nThe transition of North America from primary, to secondary, and now into tertiary economic\nenvironments has not come without cost. The family farm has given way to corporate agribusiness.\nGood paying manufacturing jobs have been lost to outsourcing overseas, and the movement into a\nservice-based economy has led many Americans and Canadians to wonder if a good paying, steady job\nwill endure in their hometown. 8.4 Cultural regions and the rural/urban continuum in the US and Canada\nLearning Objectives\n1. Appreciate the continuum from urban, suburban, small town, to rural lifeway patterns\n2. Distinguish between major regional differences in North America.\nGeographers have attempted to apply culture regions to areas of the United States. This was once easier\ndue to limited travel and mixing of peoples, technologies and ideas. Today, cultural divides exist, and\nregionalism is still evident, but one could argue the differences between rural and small-town culture\nversus suburban and city life is just as dramatic, or even more so, than between East or West. Take for\nexample, Chicago and the dozens of miles around it. People living in the Chicago urban core are\nextremely diverse and arise from over 35 national and ethnic backgrounds. This interesting map from\n1950 shows how ethnic groups form distinct neighborhoods (figure 8.7).\nFigure 8.7. This 1950 map of national/ethnic pattern in Chicago illustrates the cosmopolitan nature of\nurban places. Image courtesy of City of Chicago Department of Planning and Development, Public\nDomain. Retrieved from Wikipedia Chicago Demographics in 1950 Map - Demographics of Chicago -\nWikipedia. In recent decades, corporations and factories have fled the higher tax and dense urban settings for the\nmore attractive and new smaller cities on the edge, such as Schaumberg seen below. In 1970\nSchaumberg had a population of around 18,000. Just ten years later, the population rose to over 53,000.\nThis is due to large corporations, such as IBM, moving out of the inner-city to a newer place away from\nthe decaying and crowded street patterns. Skilled people and higher wages moved with them. New\nconstruction built around freeway access and the motor vehicle in pleasant surroundings is common in\nthese newly built suburbs (see figure 8.8).\nFigure 8.8. The Renaissance Schaumburg Hotel and Convention Center is emblematic of the new\nconstruction that took place miles away from crowded inner-cities in the 1980’s. Notice the broad\nstreets to accommodate a suburban automobile loving culture. Image courtesy of “Wonderlane,” CC BY\n2.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Schaumburg,_Illinois#/media/File:Schaumburg_view.jpg\nThis is not unique to Chicago. Other cities have seen flight from the interior to the edge. Unfortunately,\nthese new communities often sprawl into the farmlands and consume the nature of small towns and\nfarmsteads that feed and support the metropolitan areas.\nThe cultural discourse and way of life can be quite different in a small town than in urban places. It is\nquite typical in North America for rural citizens to be less agreeable to changing norms and alternate\nlifestyles. Rural people have a work ethic that typically is tied to family and community traditions.\nAlternately, people in cities generally like the variety of perspectives and are more used to alternate\nnorms and different peoples and cultures, and are more likely to accept change. While these distinctions\nmight appear as stereotypes, these generalities do show up in broad patterns of voting and purchasing\nbehavior. For instance, in 2017, urban counties tilted favorably to Democratic Party affiliation (66\npercent), while rural counties tilted towards the Republican Party (54 percent). Even though the urban-rural continuum is an increasing important element in understanding the\ndiversity of peoples in North America, some obvious and enduring regional distinctions can be mapped.\nFigure 8.9 below highlights a few of the regions typically mentioned.\nFigure 8.9. Selected culture regions of America North of Mexico. Base map courtesy of Uwe Dedering,\nCC BY-SA 3.0. Additional editing by Lincoln DeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/File:North_America_laea_relief_location_map.jpg\nThe South is an area traditionally associated with the cash crop plantation farming established before\nthe Civil War. A high percentage of African Americans live here, and rural poverty is high. Modern cities,\nsuch as Atlanta, are infusing much needed economic and social changes to this region. Culturally,\ndistinctive cooking styles, dialect, music, and racial divisions are evident.\nThe Southwest is a growing region, popularized by sunshine and a high quality of life made possible by\naffordable hydroelectric power projects allowing air conditioning to offset otherwise oppressive summer\ntemperatures. A limited water supply is a limiting factor and concern to the burgeoning population\ncenters. Culturally, a mix of Native American, Mexican, and Anglo-western cultures are present. Unique\nfoodways, which rely on tasty peppers, corn, and beef, flow from merging cultural influences.\nThe Midwest can be seen as a combination of an extremely productive agricultural base with associated\nprocessing and distribution networks, as well as a declining upper midwestern industrial complex built\naround automobile manufacturing, and steel production. Culturally, the Midwest is home to the\nAmerican dialect, adopted by the communication and media industries. Culturally, many Northern,\nCentral, and Eastern European peoples have historically migrated to this region. African American\npopulations are found in industrial cities, having moved to from the South around World War II to help the industrial war effort. Some of these peoples have been engaging in return migration back to their\nsouthern roots.\nThe Pacific Northwest has a European history of trapping, forestry, and self-sufficient agriculture from\nsettlers from the Oregon Trail. Rugged individualism still abounds in rural areas, but the urban centers of\nSeattle, Portland, and Boise have attracted high-tech industry and ecologically-minded skilled workers,\nas well as retirees from California and beyond. Outdoor recreation, including hiking, camping, and skiing\nare popular cultural pursuits."
}