{
    "text": "Chapter 3. Russia\n3.1 Northern Exposure and the Dilemma of size.\nLearning Objectives:\n1. Overview the locational dimensions of Russia.\n2. Assess Russia’s climates and biomes\n3. Describe the geographic opportunities and limitations found in the Russian realm.\nRussia’s size is daunting. It contains 1/8 of the Earth’s land mass and spans eleven time zones. When\npeople awaken in Vladivostok in the east, Russians are likely getting ready for bedtime in Moscow. This\nlatitudinal expanse alone creates a discontinuity of interaction that the Russian government has spent\ntime, planning and resources to try and alleviate. The most notable effort in connecting west to east is\nfound in the trans-Siberian railway. Stretching over 5,700 miles, it is the longest rail line in the world.\nBuilt in several segments, it took twenty-five years to build to the government’s satisfaction. Around\n200,000 shipping containers are moved on the rail line to Europe each year, constituting about 30\npercent of Russia’s exports.\nFigure 3.1 The mainlines of the Trans-Siberian Railway are shown over a map of time-zones. Moscow to\nVladivostok is a six to seven day trip. Image courtesy of “Stefan Ertmann & Lokal Profil.” CC-SA-2.5.\nRetieved from Wikimedia.org: https://commons.wikimedia.org/wiki/File:Trans-\nSiberian_railway_map.png\nThe map featured in figure 3.1 above shows the time zones and main lines of the Trans-Siberian railway,\nbut it also shows a couple other things of interest. One, there is a vast area of Russia that is not\nconnected well. Large swaths of Siberia are accessed by dirt and gravel roads, and by helicopter and\nplane. The trans-Siberian Highway, which mirrors the path of the rail line was only completely paved in 2015. The second noticeable pattern is the Southern path of the railway. Permafrost, a condition where\nthe lower layer of earth is permanently frozen, while the upper layer is subject to freezing and thawing,\nplays havoc on portions of the railway traversing north of Lake Baikal.\nThis problem is emblematic of a larger geographic consideration of Russia as a whole: Russia’s northern\nlocation. If we think about the major factors of climate, the high northern latitudes receive diffuse,\nhighly seasonal patterns of energy from the Sun. The size of Asia and remoteness of the interior to\nmajor sources of water that could otherwise circulate energy and warm coastal locations, means that\nthe interior can be warm in the summer, but extremely cold in the winter. This phenomena, known as\ncontinentality, coupled with the northern location of Russia, means that the coldest inhabited places on\nearth with dramatic swings of temperature are found here. Oymyakon, a small town of less than 1000\npeople, is cited as the coldest permanently occupied settlement on earth. Temperatures in the summer\nare generally in the 50 degree Fahrenheit range, and days can warm into the 80’s, but winters typically\nare in the -50 degree range, and can dip as low at -85 degrees! This is an average swing of 100 degrees\nfrom summer to winter.\nThese conditions of colder climates, listed as “D” and “E” climates, are shown in figure 3.2 below. Only in\nthe far southwest of Russia, near the Black sea, does one encounter a more moderate “C” zone. The\nlocation of Oymyakon is shown as a red square in the east. Figure 3.2 Climates of Russia are dominated by cold winters that generally worsen as one moves east\nand north. Image courtesy of Adam Peterson, Oymyakon, marked in red, added by Lincoln DeBunce, CC\nBY-SA 4.0. Base map Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Climate_of_Russia#/media/File:Russia_K%C3%B6ppen.svg\nMuch of Russia’s heartland is west of the Ural Mountains in the North European Plain. Short daylight\nand growing season has hampered agricultural productivity, muting Russia’s overall economy. This is\namplified as one moves east. While most of Russia is part of the “D” climate type, harsher winters (Dfc,\nDfd, Dwc, Dwd, and Dsc types) and worsening terrain lead into a very large forest zone known as Taiga.\nTrees in this biome also known as Boreal Forest, are adapted to extremely cold winters and grow\nvigorously in a short spring and summer (see figure 3.3 below).\nFigure 3.3. Taiga forest in Siberia during the autumn season. Photo courtesy of “Elkwiki.” Retrieved from\nWikimedia: https://commons.wikimedia.org/wiki/File:Siberian_autumn_in_taiga..JPG\nNorth of the Taiga forests is the Tundra, an area too cold to support trees, and even less suitable for\nRussian agricultural pursuits. Consequently, expansion of agriculture has been south and east toward\nthe Aral Sea.\nThese patterns are quite evident when you compare a map of Russia population density with the factors\nof climate and distance (see figure 3.4 below). Population density is high in and around the major city of\nMoscow (around 12 million people) and also along the warmer southeast zone near the Black sea (see\nfigure 3.3 below). The “black earth” agricultural zone stretches south and east and is home to people,\nbut the colder and remote northern and eastern parts of Russia see few sizable concentrations. Figure 3.4. Russia’s population density is highest in the south and west. Compare this map to figure 3.2.\nThe association of climate and population is apparent. Image courtesy of Lincoln DeBunce, derived from\n“Kolya Yanchiy,” CC BY-SA 4.0. Original retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/List_of_cities_and_towns_in_Russia_by_population#/media/File:Federal_\nsubjects_of_Russia_by_population_dencity_edited.svg\nOverall, Russia, despite its vast size, has limitations. Distance coupled with climate has been a barrier to\nintegration and development.\n3.2 Russia’s Historical Geography\nLearning Objectives:\n1. Recount the establishment of Russia’s core.\n2. Associate Russia’s expansion with key historical figures and periods.\n3. Describe the extent of the Soviet Union and its current alignment as part of the Commonwealth\nof Independent States.\nThe origin of ethnic Russians can be traced to the mixing of Viking and Slavic cultures in the 9th century\nwest of the Ural Mountains. After being ruled by Mongol invaders for 240 years, Ivan the Great\ncoalesced support around Moscow and defeated “the Great Horde” of Tatars in 1480. Under his reign,\nRussia was able to extend their area north. Later, the new empire began its exploration and expansion\neast. Forts and trading posts, rough passages and distant contacts back to the Russian core was the\nnorm, as fur traders and explorers moved across Asia into present-day Alaska, and travelled all the way\ndown the coast of North America into Present-day California. Figure 3.5 Russia’s expansion from 1500-1900 by century. Courtesy of Lincoln DeBunce. Derivative of an\noriginal work by “Mixx321” GNU Free Documentation License, 1.2 or higher. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Rus1500-1900.PNG\nOne of the best known constructions of iconography, large monuments that represents a political\nculture, was built during Ivan’s time. St. Basil’s Cathedral in Red Square started with the pyramid\ncathedral in the middle of the church grounds, and subsequently expanded to include the hallmark\n“onion dome” style so typical of Russian Eastern Orthodox architecture (see figure 3.6 below).\nFigure 3.6. St. Basil’s Cathedral in Moscow is an example of both religious and national iconography,\nimparting a sense of what Russia is about upon the land. During the Soviet Union, the Cathedral was\ndesignated as a museum, rather than an active church. Photo courtesy of Valerii Tkachenko, CC-BY-2.0.\nRetrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:St._Basils_Cathedral_Moscow_(8337499448).jpg . Under Czar Peter the Great (1682-1725), expansion turned west towards Europe. Peter’s concern was to\nmake Russia more progressive, modern and industrialized; to be included into a greater vision of\nEurope. One of his hallmark achievements was to commission a new westward-focused capital city to be\nbuilt on the Baltic. When a country purposely positions its capital toward an area of interest, it is called a\nforward capital. St. Petersburg is one of history’s best examples. Designed by different architects, and\naltered over time by fires and subsequent additions, the core Baroque expressions of the earliest\ndesigners are evident in St. Petersburg’s major landmarks (see figure 3.7 below). The city, known by\ndifferent names over the years, was Czarist Russia’s capital for more than 200 years (1713-1918), and it\ncurrently Russia’s second largest city, with over 5 million residents.\nFigure 3.7 Palace Square in St. Petersburg is a fusion of Baroque, Neo-classical and Russian-Byzantine\nstyles. The Building of the General Staff is in the horizon. Palace Square was designated a UNESCO World\nHeritage Site in 1991. Courtesy of Walter Smith. Creative Commons 2.0 Generic license. Retrieved from\nWikimedia: https://commons.wikimedia.org/wiki/File:Petersburg-square.jpg\nWith the leadership of Catherine the Great (1729-1796), expansion took a turn south. Under her reign\nRussia began to solidify its position along the Black and Aral Seas, leading to conflict with the Turks and\nPersians. Subsequent leaders expanded the empire even further into the Caucasus Mountains and\nnearby areas in the 1800’s.\nBy the end of the 19th century, Russia had just begun introducing the full force of change brought about\nby the Industrial Revolution. Changing economic circumstances, stubborn poverty, Royal excess, and\npainful wars, coalesced to fuel the October Revolution of 1917. This lead to a new communist vision of\npolitics and economic success, and the ultimate establishment of the Soviet Union (USSR).\nThe rise and fall of the Soviet Union (1922-1991) ushered in a period of Russian expansion into Eastern\nEurope. At its zenith after World War II, The Soviets had control over fifteen republics including the Baltic States of Latvia, Lithuania, and Estonia; West facing republics including Belarus, Ukraine, and\nMoldova, as well as a variety of Southern republics such as Georgia, Armenia, Kazakhstan and\nTurkmenistan. In addition, Several Satellite countries in Eastern Europe, including East Germany,\nHungary, Czechoslovakia, Romania, and Bulgaria, were under its political umbrella. Shortly before the\ndevolution of the USSR, their leader, Mikhail Gorbachev, instituted two related policies, glasnost, an\nopening of freedoms, especially in regard to speech, and perestroika, economic restructuring. After the\nfall of the USSR, several countries were allowed to break away from Russia, and aligned themselves\nwestward to Europe. East Germany was unified with West Germany. Eventually, Czechoslovakia\ndevolved into the Czech and Slovakia Republics. But A few countries maintained economic ties with\nRussia by forming a Commonwealth of Independent States (C.I.S). In recent times and under a renewed\nsense of Russian domination, Ukraine has been trying to affiliate itself with European interests. In a\nsurprise move, Russian annexed the Crimean Peninsula, and a Russian-influenced civil war in Eastern\nUkraine has been waged.\nFigure 3.8. The Soviet Union and its satellites are shown in red and orange (top map). After the fall of\nthe Soviet Union, the Commonwealth of Independent States (C.I.S.) was formed. It is shown in deep blue\nand green. Ukraine, shown in light blue, is part of the C.I.S., but is in conflict with Russia. Courtesy of\nLincoln DeBunce, derivative work of “Aivazovsky,” Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Soviet_Union#/media/File:Cold_War_border_changes.png 3.3 Cultural Awareness: Russia’s Ethnic and Religious Geography\nLearning Objectives:\n1. Appreciate the extent of Russia’s ethnic diversity.\n2. Recall how Russia has tried to assimilate ethnic minorities during different political periods.\n3. Describe selected religions in Russia and the impact of political periods on their expression.\nDue to historical expansions, Russia’s population is not at all the same, but instead consists of over 180\ndistinct ethnic groups that speak their own languages and practice their own beliefs.\nFigure 3.9. Ethnolinguistic groups of the former Soviet Union. Over time the Russian presence has\nexpanded into Turkic and Siberian lands. Map courtesy of “ZeppelinXanadu2112,” CC BY-SA 3.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Demographics_of_the_Soviet_Union#/media/File:Map_of_the_ethnic_gr\noups_living_in_the_Soviet_Union.jpg\nCzarist Russia defeated various ethnic groups and attempted to make these people more Russian. This\ninvolved conversions to Eastern Orthodoxy and the renunciation of pre-Christian belief systems,\npromotion of the Russian language and the introduction of the Cyrillic (Russian) alphabet. The teaching\nof Russian National myths, and so on, were used to socialize children in State Schools. This process,\ncaused Russification, is a type of assimilation, wherein a distinct people loses its identity voluntarily or\nby force and takes on the identity of another group, usually an economically and politically powerful occupying people. Seldom is the assimilation process 100 percent effective, and a cultural “residue” of\nthe former remains. But this process is extremely destructive to minority ethnic groups.\nDuring the Soviet period, political acknowledgement was given to the larger populations of the minority\npeoples through the establishment of Federal Republics, Autonomous Republics, Autonomous Oblasts\nand Okrug’s. In theory, these different political layers form part of a federal system allowing local\ndecision making. Despite the terminology used in naming these political units, which seemingly respects\nethic differences, in reality, Russification efforts continued, altered by the Soviet view on religion,\nNational allegiance, and myth building. Thus, one form of assimilation was basically replaced by another\nsimilar effort.\nFigure 3.10. The Soviet Union was organized into Federal Republics, Autonomous Republics,\nAutonomous Oblasts and Okrug’s. Terminology seemingly respects ethic differences, but Russification\ncontinued under a Soviet guise. Image courtesy of the Perry-Castañeda Library of the University of Texas\nat Austin, Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Republics_of_the_Soviet_Union#/media/File:Soviet_Union_Administrativ\ne_Divisions_1989.jpg\nThe dissolution of the Soviet Union allowed peoples to revive their various religious practices. This is\nknown as revivalism. Eastern Orthodoxy, once strongly discouraged by Soviet policies and practices, has\nmade a comeback, with a concentrated membership to the Russian Orthodox Church in the country’s\ncore area (see figure 3.11 below). This branch of Eastern Orthodoxy has more members than any other,\nwith over 100 million followers worldwide. Figure 3.11. Distribution of Russian Orthodox members in Russia. Note the concentration in the Russian\ncore. Image courtesy of “Yerevanci,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Russian_Orthodox_Church#/media/File:Russian_Orthodox_Church_follow\ners.png\nPre-Christian practices have also been revived. For instance, the Mari, who live along the Kama and\nVolga Rivers, and enjoy a dedicated republic (the Mari El), have had their culture disrupted by numerous\nactivities including the proselytization and subsequent conversion to Eastern Orthodoxy, migration of\nRussians into Mari lands, oppression of Mari nationalist leaders, and assimilation through Russian based\neducation, economic, and military activities. Still, 25 to 40 percent of the Mari population pursues its\ntraditional beliefs. The basics of this tradition includes the recognition of many gods including the Great\nWhite God, the Fire God, a multitude of half-god entities, and a general sense that nature is imbued\nwith a supernatural positive force which is to be nurtured and, in turn, nurtures the Mari. Figure 3.12. A group of Mari Pagan Priests. The Mari are one of scores of ethnic groups who are\nrevitalizing their cultural traditions in a post-Soviet Russia. Photo courtesy of Petr Vasiliev, CC BY-SA 4.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Mari_people#/media/File:%D0%9C%D0%B0%D1%80%D0%B8%D0%B9_%\nD0%BE%D0%BD%D0%B0%D0%B5%D0%BD-%D0%B2%D0%BB%D0%B0%D0%BA.jpg\nFor some peoples, the fall of the USSR is not complete, and a yearning for more autonomy, and even a\ncreation of separate countries is desired. The Chechen people are a visible, militant example. Located in\nthe Northern Caucasus Mountains between the Black and Caspian seas (see figure 3.13 below), these\npeople were forcefully moved to Kazakhstan after WWII. They were allowed to return in 1956, but in the\nintervening time, approximately 60% of the exiled people had perished. In 1990, plans were made to\nbecome an independent country. When a cooperative separation between Chechnya and Russia failed,\nthe Chechen peoples declared independence anyway. Wars between Russia and this southern republic\nunfolded. The mountainous region to the south has been a bastion and refuge for the Chechen\ninsurgents, and Russia has continued to try and hold onto this area, with the Chechens wanting the\nfreedom and independence their neighbors, such as Georgia and Armenia were granted at the fall of the\nUSSR. Figure 3.13. This ethnolinguistic map of the Caucasus Mountain region shows the relationship of various\nethnic groups, including the Chechens show in sand yellow, to Russia in the north and the Islamic\nneighbors of Turkey and Iran in the south. The mountainous terrain, though not obvious in this map, has\nprovided refuge for these peoples from larger empires. Image courtesy of “I, Pmx” CC BY 2.5. Retrieved\nfrom Wikipedia: https://en.wikipedia.org/wiki/Chechnya#/media/File:Caucasus-ethnic_en.svg\n3.4 Economic patterns of Russia\nLearning Objectives:\n1. Recall historic economic conditions of Russia’s people.\n2. Apply basic Weberian analysis to Russia’s command economy.\n3. Describe selected Russian development projects and their environmental impacts. Historically, Russia was a largely impoverished agrarian country led by a small, yet lavishly wealthy royal\nfamily and host of advisors. The communist ideology championed a new worker led world of\ncommunism, where people would look out for each other and everyone would be better for it. A\ntransition to this time would need to happen in the form of socialism, where the government owned the\nmeans of production (factories, businesses, etc.) and the economy would be directed by government\nadvisors. This is also called a command economy. The Soviets have been widely criticized by their\nseeming misunderstanding of how economics works, especially by Europe and United States (often\ncalled Western) economists and politicians who lauded the superiority of capitalism. In the western\nview, market forces will allow good decision making by entrepreneurs to flourish, and stamp out poor\ndecisions through closing of businesses, factories and such. One example of Russian stupidity was the\ndirective of manufacturing a needed part in Latvia, and only in Latvia, and then shipping it across the\nUSSR to another factory’s assembly line.\nBut this type of criticism seems overstated. The Soviets did utilize classic principles of Alfred Weber’s\n(1909) principles of industrial location. In his Least Cost Theory, the decision as to where industries\nshould be located are based on the bulk and weight of source materials, cost and location of needed\nlabor, and where markets are located, which usually is cities (figure 3.14 below). If something gains bulk,\nweight, or becomes more perishable, the factory should be located at or near markets. For instance,\nclothing and other textiles gain bulk when put together—and under the Soviets were largely placed in\nMoscow. This industry is represented in the orange/market orientation side of the hexagon of figure\n3.14. When the bulk can be reduced, such as refining metals from ore, factories should be located near\nthe source of ore. Factory cities were established under the command economy of the Soviet Union and\nclearly incorporated some of these ideas. For example, Bratsk, located near Lake Baikal, was created\nlargely from a central plan in the 1950’s to build a hydroelectric dam. Workers were enticed to move to\nthis cold Siberian site. Later, an aluminum plant and Pulp Mill were established. The placement of the\naluminum plants near cheap electricity is important. The process of changing bauxite to aluminum taxes\nelectricity sources, and in the case of the pulp mill, placing it near the nearby forests also makes sense.\nThe industries of Bratsk are found on the green/raw material side of the hexagon of figure 3.14.\nFigure 3.14. Diagram of a model showing the ideal location of different type of manufacturing. Based\nupon ideas of Alfred Weber’s least cost theory. Diagram by Lincoln DeBunce, CC BY 4.0. Sometimes the factory should be placed in a strategic location between a power source to run the\nfactory, a labor source to work there, and the source of ore, timber, or other raw resource. This would\nlead to a location within a network of competing locational pulls, typically seen as a locational triangle.\nFigure 3.15. Weber’s locational triangle. The pull of competing factors leads to an ideal manufacturing\nlocation. In this example, labor costs are less of a factor than energy and raw resource costs, thus the\nlocation of the factory is further away from labor and closer to the other inputs. Diagram by Lincoln\nDeBunce, CC BY 4.0.\nThe Soviets practiced these ideas, but as mentioned earlier, they also seemingly placed factories\nproducing one component part far away from a factory line elsewhere reliant on that component.\nCertainly, the centrally run command economy made multiple mistakes, but some of these strange\ndecisions can be seen in a rational way--the Soviet leadership purposely creating interdependencies\namong far flung places, thus making it hard for these locations to leave the Union.\nGrand economic projects were a hallmark of Soviet planners. Huge dams, like in Bratsk, were\ncenterpieces and symbols of Soviet accomplishment. Unfortunately, environmental protection, the use\nof short-cuts production, and bad judgement created a series of negative impacts that are massive in\nscale. The Bratsk Dam, for instance, led to a buildup of mercury in the reservoir. As a result of emissions\nfrom the pulp mill and aluminum factory, air quality of Bratsk is among some of the worst in the world.\nAnother well-cited environmental disaster of Soviet making is the shrinking of The Aral Sea due to\ndiverting water for agriculture from rivers that would otherwise recharge the Sea (see figure 3.16\nbelow). Croplands created by this massive irrigation project have also been negatively impacted by the\nexposed salt and sands of the Aral Seas shores blown onto the fields. Figure 3.16. Abandoned ship on the dried floor of the Aral Sea. Image courtesy of “Staecker,” released\ninto the Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Aral_Sea#/media/File:Aralship2.jpg\nThe environmental disaster that perhaps exemplifies the substandard work and environmental\ndestruction caused during the Soviet era is the Chernobyl nuclear accident in April of 1986. During an ill-\nadvised test, the nuclear reaction core overheated leading to an explosion and an uncontrolled nuclear\nchain reaction. The result of this disaster is heightened levels of radiation in a substantial portion of\nUkraine and neighboring Belarus (see figure 3.17 below). A “zone of alienation” extending 19 miles from\nChernobyl has been established, and the site of Chernobyl will likely be uninhabitable for 20,000 years. Figure 3.17. Radiation levels around Chernobyl in 1996. Courtesy of “Sting,” CC BY-SA 2.5. Retrieved\nfrom Wikipedia:\nhttps://en.wikipedia.org/wiki/Chernobyl_disaster#/media/File:Chernobyl_radiation_map_1996.svg\nThe fall of the Soviet Union was, in part, fueled by these types of disasters. A combination of a poor\nplanning, a poor economy, and importantly, tensions from ethnic nationalists also led to the Union’s\ndemise."
}