{
    "text": "Chapter 6. South Asia\n6.1 South Asia: A Realm of Contrasts\nLearning Objectives\n1. Describe the physical contrasts of South Asia.\n2. Explain the monsoon.\n3. Describe the population geography of South Asia.\nSouth Asia is a realm of contrasts. The highest mountain range in the world, the Himalayas, frames the\nnorth, while tropical beaches and plantation style tropical farms are found in the Indian Ocean coasts\nand islands. There are areas of inhospitable deserts, such as the Thar of Pakistan, and regions where one\nfinds the best soils and conditions for agriculture anywhere, such as the Gangetic Plain. A look at the\nmap below (figure 6.1) gives us some needed orientation.\nFigure 6.1. Topographic interpretation and basic features of South Asia. Places names added by Lincoln\nDeBunce on a CIA Base map edited by “Deepak,” Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/South_Asia#/media/File:Indian_subcontinent.JPG Along with the features previously described, South Asia can be understood by looking at it as edges\n(the periphery) and interior (the core). As the map noted as figure 6.2 shows in green highlight, South\nAsia is bordered by the Southwest Asian countries of Iran and Afghanistan, and the East and Southeast\nAsian countries of China and Myanmar. Within South Asia, the four mainland peripheral states of\nPakistan, Nepal, Bhutan, and Bangladesh, along with the insular (island) states of The Maldives and Sri\nLanka, surround India, the anchor of the realm. Three major rivers, the Indus of India, the Ganges of\nIndia, and the Brahmaputra of India and Bangladesh, are life-giving waters supporting millions upon\nmillions of South Asian farmers. Figure 6.2. Political map of South Asia. Major rivers and realm boundary highlighted by Lincoln DeBunce.\nMap produced by the United Nations, Public Domain. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:South_Asia_UN.png\nThe word “monsoon” is sometimes misapplied by lay people. It roughly translates as “season” and\ncomes from the South Asia realm, which has two strong distinct seasons. The wet monsoon occurs\nbetween May and September. Warm moist air blows in from the southwest. This moist air is drawn\ninland due to the heating of the Asian interior. When it reaches significant topography, such as the\nWestern Ghats, or the Himalayas, lifting and subsequent cooling leads to frequent downpours (see\nfigure 6.3). Between October and April, the Asian interior is cooler than the Indian subcontinent and air\nflow reverses. Since the interior has a lack of a moisture source, dry conditions prevail. This is a rhythm\nand contrast that defines rural life.\nFigure 6.3. A rural scene in Madhya Pradesh, India, during the wet monsoon. Photo courtesy of “Rajarshi\nMITRA,” Creative Commons Attribution 2.0 Generic. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:(1)_Agriculture_and_rural_farms_of_India.jpg\nThe realm’s population is only second to East and Southeast Asia. As of 2020, the combined population\nis a stunning 1.9 Billion people. Close to one fourth of humanity lives here. However, where people live\nand what they do to make a living contrasts greatly. The large Gangetic plain has some of the best soils\nin the world, and farmers and farming form the background of this realm. Over a million villages are\nfound in the realm, not only along the Ganges, but along the Indus, Brahmaputra, and numerous other\nriver valleys and plains. The mountainous Himalayas host fewer people, but strain on the ecosystem\nbrought about by population pressure nonetheless is significant, especially in Nepal. The Deserts can’t\nsupport many, and thus the lights of south Asia (seen in figure 6.4) are far less in the west. The\nilluminations of South Asia’s huge metopolises are home to tens of millions of Indians, Pakistanis, and\nBangladeshis. The largest city conglomerations include: Delhi (30+ million), Mumbai (25+ million), Dhaka\n(20+ million), Karachi (17+ million), and Kolkata (16+ million). As figure 6.5 shows, the density of\nhumanity in these places leaves a novice western visitor disoriented as people, vehicles, and animals\nmove along the roadways. Cities contrast sharply with village life in this realm. Figure 6.4. South Asia by night shows that the densest populations are along the Gangetic Plain in north\nIndia. Other extremely dense clusters are in the huge metropolitan areas. Another interesting aspect of\nthis image is that is shows India’s commitment to electrification and development to its rural villages.\nImage courtesy of NASA, Public Domain, 2016. City labels added by Lincoln DeBunce. Original retrieved\nfrom NASA: https://www.dnaindia.com/technology/report-nasa-just-released-new-global-maps-of-\nearth-s-night-light-2400265 Figure 6.5. This neighborhood image near Mahim Junction in Mumbai, India, show a range of goods on\nthe rooftops. Various ways of negotiating the nearby roadway includes walking, carts, motorcycles, cars,\nvans, and trucks. Image courtesy of “A.Savin,” Free Art License 1.3. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Mumbai_03-2016_51_Dharavi_near_Mahim_Junction.jpg\n6.2 Cultural Awareness: South Asia’s many religions\nLearning Objectives\n1. Describe the religious tradition of South Asia.\n2. Differentiate ethnic and universalizing religious orientations.\n3. Associate the dominant religious traditions with the modern States of South Asia.\nOne of the most interesting aspects of South Asia is the multitude of religions that either developed\nhere or were introduced by colonists and their missionaries. Of these religions, Hinduism, which has\nroots over 3500 years old, is dominant in India and is the largest in the realm. Because of India’s\npopulation, it is the third largest in the world. Hinduism was introduced by Aryan herders and\nconquerors from the west. It took hold and evolved amongst people in and beyond this realm in the\nfollowing centuries. Outside of South Asia, Hinduism has a long established presence in some Southeast\nAsian communities (figure 6.5), and of course is found in small numbers wherever Hindu people have\nmigrated. Figure 6.6. Imprint and diffusion of Hinduism, including important Hindu sites. Map courtesy of\nGunawan Kartapranata, CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Greater_India#/media/File:Hinduism_Expansion_in_Asia.svg\nSome scholars consider Hinduism as “a way of life” while others define it as a religion. Some describe\nHinduism as many paths, forms, and facets of one God, while others see it clearly as polytheistic,\nmeaning a belief in many gods and goddesses. Common aspects of Hinduism are shared sacred texts,\npilgrimage sites, and overarching religious constructs that include a belief in the soul, spiritual cause and\neffect (Karma), including the inevitable reincarnation into different statuses based on previous life\nexperiences. The Caste system, officially abolished in India but still unofficially practiced, is an outgrowth\nof these concepts. In the Caste system, you inherit the basic socioeconomic position, including\noccupation, of your parents. You are not allowed to move up to another position, or drop to a lower\none. You are to marry within your caste. This is different from a class system, in which it may be hard to\nmove up to another social category, but is not impossible, and is in fact encouraged as a value. Getting\nback to the Caste system, there are five basic levels found in traditional India. From top to bottom these\nare Brahmans (Priests), Kshatriyas (rulers and warriors), Vaisyas (merchants and skilled workers), Sudra\n(Farmers and unskilled workers), and Dalits (untouchable folks who clean and work with unclean waste,\nblood and garbage). If you are born a Sudra, for instance, you can’t change your position in this life, but\nyou might through reincarnation in the next. If you are an honorable and good person of the Sudra Caste, in your next life you might be reborn as a Priest. Alternately, if you are a bad person living as a\nSudra, you might be reincarnated as a Dalit (untouchable). As you might imagine, the Caste system\nencourages conformity in the social order. Whatever your lot in life is, you should strive to be the best\nyou can be in it, and perhaps you will be rewarded in the next.\nImportant Hindu sites are located throughout India and beyond, and a central spiritual feature of the\nlandscape is the Ganges River, which gives life through its use in agriculture. Hinduism has a vibrant\nartistic component as can be seen in temple architecture depicted in figure 6.7 below.\nFigure 6.7. Hindu art is detailed and expressive. These wall reliefs are part of Hoysaleswara Temple\nlocated in west central India. Photo courtesy of “Bikashrd,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Hindu_temple#/media/File:Exteriors_Carvings_of_Shantaleshwara_Shrine\n_02.jpg\nBuddhism sprang forth out of the experiences and teachings of Siddharta Gautama, who lived in the\narea of present-day northern India around 2500-2600 years ago. Gautama, who is known as “Buddha,”\nor “the Awakened One,” developed a philosophy and way of being to religious and lay people alike. His\nfollowers took his teachings across most of Asia (see figure 6.8). While Buddhism is seen in India, and\nimportant religious sites are found there, it is much more of a presence outside of India, in areas that it\nspread. Four distinct varieties of Buddhism are practiced, but all are based on a few central tenants. The\nmain theme is that desire is the source of misery and, therefore, to escape misery one needs to abandon\ndesire. Like Hinduism, Buddhism incorporates the ideas of life after death, karma, and reincarnation.\nUnlike Hinduism, Buddhism proposes a route to break beyond worldly desires, thus achieving the state\nof Nirvana, a place transcending reincarnation and suffering. These practices are summarized as the\nNoble Eightfold Path. These paths include: right view, right intention, right speech, right action, right\nlivelihood, right effort, right mindfulness, and right concentration. Buddhism is the fourth largest\nreligion in the world, and is associated most strongly in South Asia with the countries of Sri Lanka and\nBhutan. Buddhism is a world-wide religion and is growing. Figure 6.8. The diffusion of Buddhism in East, South, and Southeast Asia. Map courtesy of Gunawan\nKartapranata, CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/History_of_Buddhism#/media/File:Buddhist_Expansion.svg\nAnother religion that grew out of a South Asian Hindu context about the same time as Buddhism is\nJainism. Jainism has far less adherents than Buddhism, with about 5 million members, mostly in India.\nJainism shares the belief in souls, and has related core themes around non-violence, truthfulness,\ndisavowing worldly things and desires. Jains are vegetarians, and avoid root crops due to the destruction\nharvesting might bestow on other organisms. Jains do consume milk products, as long as the animals\ninvolved are not harmed. Jains maintain a number of shrines and temples around the realm, and many\nmore around the world. Some of these temples are UNESCO World Heritage Sites (figure 6.9). Figure 6.9. Jain Narayana temple in the Pattadakal Temple complex was built in the 9th century. It is one\nof several temples in a complex designated as a UNESCO World Heritage Site. Photo courtesy of\n“Dineshkannambadi,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Pattadakal#/media/File:Jain_Narayana_temple_at_Pattadakal.JPG\nOther major religions have more recently impacted the nature of South Asian life. Of these Islam is the\nmost significant. It came to South Asia shortly after its inception, largely by traders along the coasts and\nassociated river valleys of South Asia about 1400 years ago. Its appeal has made it the largest religion in\nPakistan, Bangladesh, and the Maldives. Muslims form the second largest religious group in India, with\nover 180 million followers. In total, more Muslims live in this realm than any other, with over 600 million\nmembers.\nIslam developed in the Arabian Peninsula about 1400 year ago. It is based on revelations given to the\nProphet Muhammad. The religion is often described as based upon five pillars. These are: Giving alms to\nthe poor, attempting a pilgrimage to Mecca at least once, sharing the faith, daily prayer, and fasting.\nIslam translates as submission, or surrender to the will of God. Muslims reject the notion of other\ndeities, idolatry, including representations of God in human-like form, or the idea of the trinity, which is\npresent in the majority of Christian faiths.\nIslam in a Universalizing religion. This means that one of its primary goals is to make converts. The belief\nis that Islam applies to all of humanity and is not limiting to one particular group. A major tenet of the religion is that it be shared because it is the path to salvation. This is also true of Christianity, Buddhism,\nand at least in the past—to Hinduism. Universalizing religions are the largest, with active missionary\nactivities converting people into their system. Figure 6.10 shows the power universalizing religions have\nin shaping world-wide cultural patterns. Note that in this map, Christianity, Islam, Hinduism, and\nBuddhism, all former or current Universalizing religions, are most dominant.\nFigure 6.10. Prevailing religions of the world, in terms of adherents, feature former and current\nuniversalizing faiths. Three of these are well represented in South Asia. The fourth, Christianity, has less\nof a footprint in South Asia, but is the largest and most widespread in the world. Map courtesy of\n“LilTeK21,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Major_religious_groups#/media/File:Prevailing_world_religions_map.png\nIn contrast, most of the religions of the world are Ethnic religions. These are belief systems that spread\nfrom community members to other community members, Parents to children, but there is no core idea\nor belief of spreading the faith anywhere else. The traditional Mari faith, mentioned in the chapter on\nRussia, is an example. Another example is Judaism. Jews have no compunction to convert followers. In\nfact they do not accept converts easily.\nIslam, Christianity, and Judaism are related. The ancient texts (Torah) of Judaism is shared with Christian\nand Islamic texts. All share the story and individual of Abraham. Thus, all three are sometimes referred\nto as Abrahamic faiths.\nOver the centuries, Christians have attempted to convert followers in the South Asian realm, with\nmoderate success. There are stories of Thomas the Apostle reaching the western Indian coast of Kerala\nin 52 A.D., but this is not definite. By 1500 years ago, Christianity had certainly reached parts of this\narea. Today, Christianity is the third largest religion in India, after Hinduism and Islam, but only\ncomprises 2.3 percent of the population. Various Protestant sects comprise the majority of Christian\ngroups in the sub-continent. However, one interesting pocket of Christianity shaping the land of people\nof South Asia are Goan Catholics. Goa, a state of India located on the west coast, had been a Portuguese\ncolony for over 500 years, only being absorbed into India in 1961. The Portuguese brought Catholic Missionaries and made a concerted effort at converting local peoples into the Church. Roughly twenty-\nfive percent of the population today claims Catholicism, far higher than other south Asian locations.\nCatholic (and Portuguese) architecture is strikingly different than other states and regions of India, and\nimportant Christian landmarks remain part of the land (see figure 6.11 below).\nFigure 6.11. Se Cathedral, Old Goa, is the oldest Catholic Cathedral in India and is seat of the Patriarch of\nthe East Indies. It was in built in 1510 and is dedicated to St. Catherine of Alexandria. Photo courtesy of\nDanny Burke, CC BY-SA 2.5. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Goan_Catholics#/media/File:Se_cathedral_goa.jpg\nOne the most interesting religions to emerge in the Punjab of India and Pakistan, is Sikhism. Established\nabout 500 years ago, this is one of the most recent additions to world religions, and the 5th largest. The\nestablishment of Sikhism happened through the teachings and revelations of a succession of ten human\nGurus, starting with Guru Nanak, and ending with the final non-human Guru, Granth Sahib, a religious\ntext. Some scholars see the religion as a combination of Hinduism and Islam, incorporating elements of\nboth. When religions are formed in this manner it is known as a syncretic religion. Sikhism has common\nelements with Hinduism, such as the belief of reincarnation and karma, but also has a strong sense of\nmonotheism and eternal salvation more akin to Islam. It is important to note that most Sikhs see their\nfaith differently, as one inspired by the one God they worship, and not as a cobbling of beliefs from\nother religions. Sikhs gained notoriety and enhanced standing in India under British rule, and the image\nof a turban and sword clad Indian is a common stereotype representing all Indians. But this garb is particular to Sikhs; a dress code commonly known as the five K’s. These include uncut hair, often worn\nunder a turban, a steel bracelet, a small sword, a wooden comb, and a distinctive style of shorts. The\nholiest place of Sikhs is Sri Harmandir Sahib (the Golden Temple), in Amritsar (see image below), but\nSikh temples and people are found through South Asia. Their presence is also seen in Britain and other\nfar flung places. In the United States there are about 250,000 to 500,000 Sikhs. These folks are often\nmisidentified as Muslims or Arabs by uninformed people.\nFigure 6.11. Sri Harmandir Sahib is the holy site of Sikhism. The words translate as the Temple of God,\nbut the structure is commonly known as the Golden Temple. Image courtesy of “Ekabhishek,” CC BY-SA\n2.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/w/index.php?search=Golden+Temple&title=Special:Search&ns0=1&ns\n6=1&ns12=1&ns14=1&ns100=1&ns106=1#/media/File:Sarovar_and_the_Golden_Temple.jpg\nIn South Asia, there are some noticeable associations between political boundaries and religious\npreferences. Partially this is explained in how South Asia became independent after centuries of\ncolonialism. Most of South Asia’s most recent colonial experience was with the British (1858-1947).\nGreater India was the “Jewel of the Crown” of the British Empire, and included the present day\ncountries of South Asia, except for Nepal and Bhutan, which were able to remain remote and\nindependent. The British processed cotton from India in their industrial textile mills, and India provided\na huge market. British English became the language of commerce, and railways were built throughout\nthe realm. The breakup of colonial India severed the region based largely on dominant religions. India was at the core, and predominantly Hindu. Pakistan, The Maldives, and Bangladesh, were based on\nMuslim allegiances. Sri Lanka became the island home of Buddhists.\nThis is not to say that this break up of British India was easy. Pakistan and India have fought four wars\nover border disputes. Still today, the mountainous area known as Kashmir is a disputed region. Pakistan\nrecognized that the majority of people were Muslim and declared it should be part of the newly formed\nIslamic State. But India, in support of the political elite of Kashmir claimed it as part of the Indian\npartition. Figure 6.12 below shows a map of this disputed ground. Green indicates area controlled by\nPakistan. Orange represents the area under Indian domain. China gained control of some of this\ndisputed region as well. This is an ongoing and serious dispute; both India and Pakistan are nuclear\npowers, and tensions sometimes escalate between the two.\nFigure 6.12. The disputed region of Kashmir is a potential flashpoint between two nuclear powers.\nChina’s unrecognized occupation of part of Kashmir complicates the situation. Map courtesy of the Central Intelligence Agency, Public Domain. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Kashmir_map.jpg\nAnother example of unrest in the wake of the colonial break-up of British India occurred In Sri Lanka.\nHere, a minority Hindu group known as the Tamils, brought to the island as affordable labor to work\nrubber and tea plantations in the 18th and 19th centuries, eventually sought recognition and power. The\nTamils are distinct in their language and share India’s Hindu religion. The Sinhalese, who are the\nindigenous islanders and have their own language, traditions, and follow Buddhist teachings, were not\naccommodating to their wishes. They claimed the entire island as Sinhalese territory. A civil war broke\nout between the two groups in 1983 and waged for over a quarter century, ending with the defeat and\nsurrender of the Tamils in 2009.\nIt is important to note that people seldom fight over religion. Instead, religion is a way of identifying the\nother. As is the case in these examples, most of the time people fight over territory and resources."
}