{
    "text": "Chapter 10. North Africa and Southwest Asia\n10.1 Defining the Realm\nLearning Objectives\n1. Recall three ways that the realm is commonly delimited, and problems of each.\nThis large and important realm is thought of in a variety of ways. For some, this is “the Dry World.” True\ndeserts, those receiving less than ten inches of precipitation per year, include the Sahara and Arabian,\nwhich cover the southern reaches of this realm. Semi-arid steppes and plateaus are also common place.\nMuch of Iran and Kazakhstan include these types of environs. But there are some exceptions to the dry\nworld classification. Much of the coastal Mediterranean has enough precipitation to move beyond the\ndesert name. Dry summers, but wetter winters prevail. This allows a rich plethora of Mediterranean\ncrops to flourish. Parts of Turkey and Syria have moderate climates with woodland forests. In other\nplaces, rivers bring sustenance to the land and provide a source for agriculture. The Nile, Euphrates and\nTigris Rivers are examples. Figure 10.1 below is a map of biomes which is directly tied to climate.\nReferences mentioned in the text are indicated.\nFigure 10.1. Biomes of North Africa, Southwest Asia. While deserts prevail over much of the realm, other\nenvironments are also found. Realm boundaries are approximate. Derivative map by Lincoln DeBunce,\nbased on a retouched Biomes of the World map courtesy of “Terpsichores,” Creative Commons\nAttribution-Share Alike 3.0 Unported license. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Biomes_of_the_World_-_Retouched.png Other scholars note the predominance of Islam and identify this realm as “the Islamic world.” Figure\n10.2 below shows predominant religions and the percentage of people identifying as adherents.\nCertainly, Islam can be seen as wide spread throughout Southwest Asia and North Africa.\nFigure 10.2 Prevailing religious adherents by country in the Eastern Hemisphere. Derivative map by\nLincoln DeBunce, based on work by “Crayton,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Major_religious_groups#/media/File:Prevailing_religious_population_by_\ncountry_percentage.svg\nBut this realm can’t be seen solely as the Islamic World. After all, Indonesia, which contains the highest\npopulation of Muslims on Earth, is in Southeast Asia, far from this realm. And just because Islam is\npredominant, it doesn’t mean it’s the only religion practiced. Christians are found though out the area,\nespecially in Lebanon. Coptic Christians, one of the oldest denominations, are found in Egypt and\nEthiopia.\nIt is also important to note that the Muslims who do live in North Africa and Southwest Asia (NASWA)\nare not unified in their beliefs and practices. Sunni Islam, the largest branch, is made up of dozens of\nsects. Shia Islam is found primarily in Iran and Iraq, and the way different Shi’ite people organize\nthemselves is also varied. One way of attempting to solidify the religious nature of NASWA countries is by declaring that the laws and ways of the religion are, part in parcel, the laws of the country. Figure\n10.3 shows countries that are Religious States. Islamic States are most common, but you do find\nReligious States that are Christian or Buddhist.\nFigure 10.3 Religious States of the World. Derivative map by Lincoln DeBunce, based on work by\n”Applysense,” Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/State_religion#/media/File:State_Religions.svg\nFinally, some people think of this realm as an “Arab World.” While it is true that Dialects of Arabic are\nused, it is largely a North African, and Arabian Peninsula phenomenon (see figure 10.4 below). Other\nparts of this realm are populated by people using various Turkish and Indo-European languages. Figure 10.4 Language families and branches in and around the NASWA realm. Derivative map by Lincoln\nDeBunce, based upon the work by “JFDP13,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/List_of_languages_by_number_of_native_speakers#/media/File:Human_\nLanguage_Families.png\nAll told, the combination of these three criteria: climate, religion, and language, shed light on the\nboundaries and qualities of this interesting and important realm, but should not be overstated or\noverused.\n10.2 A Consequential History\nLearning Objectives\n1. Recount key historic events that help us understand the importance of this realm.\n2. Describe how conflict in the realm can be tied to global forces outside of the realm. This realm is host to several significant historical and prehistoric events which have shaped the realm\nand beyond. A major breakthrough in human’s past occurred here around 11,000 years ago. Peoples\nwho were formerly hunter-gatherers began domesticating plants and animals. Domestication entails\ntaming and keeping livestock and nurturing selected plants, while weeding out others. The reasons for\ndoing so are debated, but what we know is that this period of time is shortly after the last glacial period,\nwhen temperatures began to warm. Lush forests and related biomes started to dry up, and more arid\nareas became apparent. The plants domesticated included various legumes such as lentils, and cereal\ngrains such as barley, wheat, and rye. Animals include cattle, sheep, and goats. These herd animals and\ncereal grains are the basis of Middle Eastern, Indian, and European diets today. Figure 10.5 shows the\nlocation of early domestication sites. Figure 10.5 This map shows the area of early domestication in Southwest Asia. Sites based on agriculture\nare symbolized in red. Black represents sites that have archaeological significance both pre and post\ndomestication. Image courtesy of “GFDL,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/History_of_the_Middle_East#/media/File:Fertile_crescent_Neolithic_B_ci\nrca_7500_BC.jpg\nThe agriculture base that was established enabled another significant historical development, the rise of\ncivilizations. Civilizations involve hierarchical social systems centered around permanent, clustered\ndwellings. Two of the well-known civilizations in this realm include Mesopotamia, located between the\nTigris and Euphrates Rivers, and ancient Egypt, located along the Nile in North Africa (Figure 10.6\nbelow).\nFigure 10.6 The pyramids of Giza are one of the most photographed icons of ancient civilizations in the\nworld. Image courtesy of Ricardo Liberato, CC BY-SA 2.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Ancient_Egypt#/media/File:All_Gizah_Pyramids.jpg\nAnother element of history to be noted are the accomplishments and contributions to knowledge that\nwere developed in the middle-ages, roughly 1500-500 years ago. Called the “Golden Age” by some\nscholars, advancements in arts and sciences took root and spread throughout the realm. For instance,\nalgebra was developed, accurate cartography of the known world was published, medicine based on\nplant combinations and advancements in surgery were developed. Principles of Engineering were\nemployed, such as crankshafts, Waterwheels and pistons invented by Al-Jazari (see figure 10.7 below).\nImportantly, texts that likely would have been lost over time were collected and translated into Arabic.\nEducation, medicine, engineering, mathematics, arts, religion, philosophy and more were documented\nand expanded upon during this period. Figure 10.7 This waterworks machine, called a noria, seen here in Hama, Syria, was invented by Al-Jazari\nduring the Golden Age of the Middle-East. Image courtesy of Erik Albers, CC0 1.0 Universal (CC0 1.0)\nPublic Domain Dedication. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Noria_and_houses_in_Hama,_Syria.JPG\nThe spread of the culture at this time was facilitated by the zeal and aggressive diffusion of Islam\nstarting with the Prophet Muhammad’s time in the Arabian Peninsula, particularly between 622 and 632\nAD. This was a period of consolidation and conquest of tribes and cities centering on Medina and Mecca.\nIslam became a unifying force and its mission of spreading the religion to others allowed a convenient\nreason for conquering neighboring lands. The movement of the religion across North Africa and\nSouthwest Asia helped spread the other cultural elements of the realm’s “golden Age.” It was during\nthis period that the Iberian Peninsula (present-day Spain and Portugal) were invaded and occupied by\nthe Arab/Berber alliance. Figure 10.8 Rise of the Islamic Golden Age. Derivative map by Lincoln DeBunce, based on the work of\n“DieBuche,” Released into the Public Domain. Base map Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Islamic_Golden_Age#/media/File:Map_of_expansion_of_Caliphate.svg\nThe decline of the Golden age around 500 years ago allowed another center of power to emerge later\non. Centered on the modern-day country of Turkey, the Ottoman Empire is another significant slice of\nhistory that gives shape to the modern-day situation we find in the realm today. The Ottoman Empire\nhad an Islamic countenance, and some scholars but primarily used military might to capture and control\nneighboring areas. As map 10.9 shows, the Ottoman’s reached through the Balkans and into central\nEurope, onto the doorstep of Vienna. The Ottoman alliance with Austro-Hungary during WWI would\nbring defeat and fracturing of their Empire. Perhaps more significantly, it brought the European victors\nof WWI squarely into the North Africa/Southwest Asia realm as “protectors” and colonizers. The\nstrategic location of places in the Middle East, such as the Suez Canal zone, the riches of oil discoveries,\nand the religious attachment of European Peoples to Middle Eastern places of the Bible, are all strong\nreasons for European powers to develop a lasting presence. Figure 10.9 The extent of the Ottoman Empire is seen in the map. Arab and South-central European\nlocations are tied together. Image courtesy of “Chamboz,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Ottoman_Empire#/media/File:OttomanEmpireMain.png\nWorld War II brought another dose of European control over the North Africa and Southwest Asia realm.\nThe post war period brought to light the struggles of Jews across Europe, Russia, and the Middle East.\nAn initiative was started by the British which expanded to other countries to support a return of Jewish\npeople to the Levant (eastern flank of the Mediterranean) in a newly recognized country of Israel. The\nproblem was this area was already occupied by Arabs who claimed it as their home, called Palestine. The\ncreation and support by the United States and others of a Jewish Israel was not recognized as legitimate\nby neighboring Arab countries, nor by the Palestinians. Disputes between Palestinian Arabs and Israeli\nJews, and between Israel and other nearby countries is an ongoing conflict in the realm. As figure 10.10\nshows, the United Nations has recognized Israel as the territory that twists between the Gaza strip to\nthe south, around the West Bank in the center, and ending at the border of Syria next to the Golan\nHeights. In actuality, Israel is occupying the Golan Heights, the West Bank, and has influence over Gaza.\nThis is a result of failed wars and resistance in past decades. The occupation of these areas further\ncomplicates negotiations for peace in this region of the Middle East. Figure 10.10. 2011 map of Israel and the occupied zones. Courtesy of the United Nations, Public Domain.\nRetrieved from Wikipedia:\nhttps://commons.wikimedia.org/wiki/File:Map_of_Israel,_neighbours_and_occupied_territories.svg Foreign powers, such as the United States, British, and Russians, have struck up allegiances and have\npropped up leaders in many countries of this realm. When a much more powerful country helps put into\npower and supports an otherwise unpopular leader of a weaker country, it can create a Puppet\nGovernment. Sometimes these puppet governments get into conflicts with neighboring countries who\nare also puppets of large foreign influences. In essence, these two weaker countries are proxies\n(substitutes) engaging in larger global power struggles. In this case, the conflict can be seen as a proxy\nwar. Within countries, rebel groups fighting against their governments can be seen in the same light.\nThe rebels are supported by an outside force, fighting a proxy civil war against the government of the\ninternationally recognized country--but it is also a larger geopolitical contest. The recent involvement of\nthe United States, Saudi Arabia, France and Jordan, actively supporting Syrian rebels is one such case.\nThe Syrian Government of Bashar al-Assad is a foe of Israel, and Israel a friend of the United States.\nIsrael is not actively involved but supportive of the United States efforts. The United States and\nassociated allies initially encouraged, supplied and actively assisted the rebels to fight against Assad\nduring the U.S conflict with the Daesh (ISIL). The Syrian Government reached out for and received\nassistance from Iran, and later Russia, a cold war foe of the United States (figure 10.11 below). Factions\nsympathetic to Assad in Lebanon (seen in yellow in the map) also became involved. Iraq has various\nfactions that are in conflict. Some have sided with Syria, and some have aided the rebels.\nFigure 10.11. Regional influences in the Syrian Civil War. Turkey, Jordan, Saudi Arabia, France, and the\nUnited States (not on the map), support rebels to oust the Assad government. This alliance is in green.\nBlue colors indicate Iran and Russia. Both have militarily aided the Assad regime. Image courtesy of\n“Cowik,” CC BY-SA 3.0. Country labels added by Lincoln DeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Syrian_civil_war#/media/File:SyrianCivilWarMap.png\nThe United States largely withdrew direct military aid, and with Iranian and Russian assistance, the\nBashar al-Assad government regrouped and has made inroads against the rebellion. Figures 10.12 shows\nthe situation in 2020. Rebel force control shown in green, is largely peripheral to an Assad run Syrian Government, shown in red. This is one of many complex struggles that might appear to be an internal\ncivil conflict which we see as being not our concern, but in fact, is a battleground of world geopolitics.\nFigure 10.12. The situation of rebel forces against the Assad regime in 2020. Rebel forces have lost\nterritory since the opening of major conflicts after 2011. Image courtesy of “Rr016,” CC BY-SA 4.0.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Syrian_civil_war#/media/File:Situation_in_Syria_(July_2020).svg\n10.3 Cultural Awareness: Gendered Spaces and the changing role of women in the Arab World\nLearning Objectives\n1. Describe some differences in the role of Arab women and men,\n2. Provide examples of gendered spaces and how behavioral expectations differ based on these\nideas.\n3. List examples of how Arab women’s roles are changing. Gender roles are culturally learned. The underpinnings of beliefs and expected behaviors about them\nvary from culture to culture. In the Arab world, the roles of men and women are quite different, and\ncritiques have pointed to the inequities between men and women. These are showcased in various\nways. For instance, females are far less likely to engage in work outside of the household. In the Gulf\nStates, such as Qatar, participation for men in the workplace is over 70 percent, while less than 10\npercent of women are in the workforce. Education attainment is unequal between men and women as\nwell. A stark example is the adult literacy rates of women in Algeria, which are 30 percentage points\nbelow men. Throughout the Arab world women have less representation in the formal politics of the\nState, and women are restricted in their degree of movement without escort. A couple of countries\nrequire chaperones for women outside of the house, while for those countries that are less restrictive,\nsexual harassment and assault are generally higher than in European countries.\nOne understanding for this disparity is the Arab concept of domestic space, which is associated with\nwomen, and public space, which is the realm of the male. When women leave the private domestic\nspace, they are essentially entering a male world and protections are made to accommodate that\nmovement. Right clothing, right behavior, and in more extremely bifurcated places, such as Saudi\nArabia, male chaperones are thought to be needed for appropriate activities to occur outside of the\nhome. These behaviors are mediated by the type of public space encountered and by regional\ndifferences on expectations.\nThe home is a model for the distinction of domestic/private space, and public/male space. The\ntraditional Arab house has a very private interior space that is off-limits to the outside public sphere\n(figure 10.13). The outside walls are very plain, and lattice covered windows prevent outside exposure.\nA modest entry way leads to semi-private areas, some for male guests, others for females. The houses\ncenter is an interior courtyard. This is an open area, ideally a place of greenery and water, protected\nfrom the outside world. A wind catching tower funnels a cooling breeze through the heart of the home. Figure 10.13. Diagram of a traditional Arab house. The courtyard is the focal point of domestic life.\nDiagram courtesy of Linc DeBunce. CC BY-SA 4.0.\nIn the photo below (figure 10.14), you can see a typical courtyard scene, which showcases a nice garden\nand a thoughtful placement of fountain and pond. Domestic space is focused upon this inward respite.\nThis is opposite of the outward focus of Anglo home designs which feature spacious front windows and\nshowcase a front yard to passersby. Figure 10.14. Courtyard of a house in Tozeur, Tunisia. Plants and water provide a respite from dry\nstreetscapes and deserts. Image courtesy of Tsaag Valren, CC BY-SA 4.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Courtyards_in_Tunisia#/media/File:Cour_int%C3%A9rie\nure_d'une_maison_de_Tozeur.jpg\nCultures change all of the time, and this is true of the distinction of gendered space in Arab culture.\nWestern (U.S. and European) inspired modern house designs are becoming more of the norm, and\nWestern ideas are also spreading to female gender roles as well. While political participation in the Arab\ndomain is generally low for women, the right to vote was first established after World War II, and has\nbeen spreading throughout the realm ever since. The most culturally conservative State, Saudi Arabia,\nhas finally allowed this right in 2015. Education rights have followed a similar track. Since the mid-1970's\nfemale enrollment in schools has risen dramatically, but has not yet equaled that of males in many\nplaces. Travel restrictions have loosened as of late, but progress on this front is slow. For instance, Saudi\nArabia has only recently allowed women the right to drive a car (2018), and in Yemen women are not\nallowed to travel outside of the country without the father’s consent. Perhaps the most controversial\nchange has been to women’s modest dress, particularly head coverings. Hijab is modest dress, but in\nterms of headgear, it typically refers to a headscarf. The wearing of headscarves is widespread. More\nrestrictive head coverings are the Niqab, which provides a slim opening for eyes, and burkas which use a\nnetted veil to obscure onlookers from seeing women’s faces at all.\nIn most Arab countries, burkas and niqabs are no longer required in public spaces, but on the fringe are\ntwo opposite rules. In Saudi Arabia, the coverings are required and religious police will enforce the\nproper attire. In this country, a version of Islam, espoused by an influential Islamic reformer Muhammad\nibn Abd al-Wahhab, took root and is still enforced today. On the opposite side of this spectrum, wearing\nhead coverings that mask the face is against the law in Tunisia, whose government sees it as an\nimposition of religious extremism. Like all culture change, beliefs and expressions of those beliefs change at different rates in various places. As shown in figure 10.15, in some countries traditional veiling\nis widespread but discouraged. In other places, change can’t come quick enough. This is an obvious\ndouble-bind on women who are caught between opposing forces of tradition and modernity.\nFigure 10.15. Women’s dress codes and competing cultural pressures by country, 2008. Derivative map\nby Lincoln DeBunce, courtesy of “Womanstats Project,” designated a Free Image. Retrieved from\nWikimedia:\nhttps://commons.wikimedia.org/wiki/File:Map3.10RequiredDressCodesforWomen_compressed.jpg"
}