{
    "text": "Chapter 1. Introducing World Regional Geography\n1.1 Geography and the Regional Approach\nLearning Objectives:\n1. Define geography and describe how the discipline is organized.\n2. Recall why a spatial perspective is important.\n3. Locate major geographic realms and describe how regions are employed.\n4. Appreciate that since a spherical Earth can’t be developed into a flat surface, all maps have\ndistortion and compromise in them.\nFor countless generations people have been curious about the world around them. What lies beyond\nthe next hill? Where are earthquakes common? Why do people speak and act differently from one\nlocation to the next? If you are curious about your surroundings, then you have some of what it takes to\nbe a professional geographer. It is the geographic discipline that focuses on questions like these (what,\nwhere and why), and the very word geography tells us much about what geographers do. Geography\ncomes from the Greek words geo (earth), and graphein (to write or describe). If you aren’t planning to\nbe a professional geographer, don’t worry, much of what is taught in a course like world regional\ngeography can make your life fuller as an educated person. Geographic knowledge is important. Can you\nimagine a country of citizens that doesn’t know where many places in the world are located? Worse yet,\nwhat if many of these citizens have large misconceptions about what these places and the people in\nthem are like? Having a reasonable baseline of understanding is crucial for making good decisions in this\nincreasingly interconnected world. A world regional geography course is a place to establish, or re-\nestablish this baseline.\nFigure 1.1 This picture of an abandoned railroad trestle near Bend, Oregon, shows the complex interplay\nbetween the environment and the people who carve out an economy and humanize the landscape.\nBoth the natural and human realms are part of geographic inquiry. Photo courtesy of “Tequask” (CC-BY-\nSA 4.0). Retreived from Wikimedia: https://commons.wikimedia.org/wiki/File:Rail_Trestle_-\n_Bend,_Oregon.jpg. Geography is broken into two separate areas. Physical geography is the exploration of the thin layer of\nthe earth that makes up the natural world. Climatologists study patterns of atmospheric flow and\ntransfer of energy around the world. Geomorphologists study Earth’s natural landforms, from mountain\nbuilding processes to the tearing away of the surface by weathering and erosion. Biogeographers work\nin understanding how and why plants and animals have come to be where they are found. Geographers\nalso work in understanding soils—the rich combination of earth, atmosphere and plant materials.\nHuman geographers study the rich array of human patterns that shape the land. Culture, the tapestry of\nthought, belief and behavior that includes religion, politics, economics, race and ethnicity, urban and\nrural settlements, and much more, is part of this side of the discipline. No study of regional geography is\ndevoid of looking at population dynamics. This also makes up part of human geography. Table 1.1 below\nsummaries these two branches, while figure 1.1 alludes to the idea that both areas are important to\nconsider.\nTable 1.1 Major Subdisciplines of Geography\nPhysical Geography Human Geography\nClimatology Political Geography\nGeomorphology Economic Geography\nBiogeography Ethnic Geography\nSoils Urban Geography\nPopulation Geography\nThese two branches of geography are often taught as distinct introductory courses: physical geography\nor human geography, covering each topic (climate, geomorphology, etc.), one chapter after the other. In\ngeography this approach is called systematic. Another way of teaching and studying geography is using\na regional approach. The regional approach, as opposed to a systematic approach, uses a bounded area\nof like or related places as the unit of study. The region can be large (like Europe) or small (like the\nColumbia Basin of Oregon) or somewhere in between. World regional geography looks at the largest\nregions that make sense as units of study. These large parts of the earth are known as realms. The\nboundaries of realms in this text are based on traditional regions used in geography text books, adjusted\nto fit a ten-week course. For instance, sometimes East Asia is a separate chapter from Southeast Asia.\nIn this text they are combined. When dealing with realms, it is important to note that boundaries are\nmore akin to transition zones than sharp lines separating one people from another. Sometimes these\nboundary zones have a regional quality unto themselves (such as the borderlands between the U.S. and\nMexico). Another thing about describing any region or realm is that the complexity and variety of\npeople and landscapes are always more than what can be conveyed in a short chapter. In this text it is\nmore appropriate to think of the chapter content as a framework for further understanding than as an\nexhaustive look at any one place or region. Another thing to keep in mind is that regions have a past, a\npresent and future. They are not static. Regions and their boundaries change. Europe, for example,\nused to be smaller. The breakup of the Soviet Union rewrote the place of countries like Poland and\nRomania and placed them into the European realm. Again, it is best to think of a framework of\nknowledge that can and should be updated and developed by the reader. The nine realms used as\nchapters and units of study in this text are seen below. Figure 1.2 World Realms as Configured in this Text. Cartography by Lincoln DeBunce. Base Map\ncourtesy of Petr Dlouhy, released into the Public Domain.\nIf you associate maps like the one above with the study of geography, you are not alone. Sometimes\npeople think geography is the study of maps. Since geography asks questions that are spatial (for\ninstance, why here and not there?) this association is not far off the mark. In fact, one area of\ngeography is cartography and mapping science. Technology like geographic information systems (G.I.S.)\nand geographic positioning systems (G.P.S.) have revolutionized the way spatial information can be\nanalyzed and portrayed.\nA couple words of caution should be noted about world scale maps (and maps in general). Since the\nearth is close to being a sphere (it is actually more of an oblate spheroid), and spheres can’t be\ndeveloped in flat maps without introducing distortion, all world scale maps are distorted in some\nmanner. Additionally, world maps “crop” areas. For instance, in the map above, much of the Pacific\nOcean, and thus the populated islands of Oceania are missing. In terms of extreme distortion, a\ncommon map seen in classrooms is the Mercator projection map (see below). While direction and\nshape is maintained, the area of continents and islands is highly distorted. This distortion is worse\ntoward the poles. This is why Greenland looks like it should be a continent and Antarctica is massive.\nCompare this map to one that keeps the area from one place to another true (also see below). In this\ncase shape is distorted. The reality is that there is no perfect way of portraying the Earth. Each design\nhas its merits and drawbacks. Sometimes one map is more appropriate. For instance, if you want to\nsuggest that Antarctica is worthy of continued exploration and financial investment the Mercator\nprojection might help sell your idea. On the other hand, if you are trying to get someone to invest\nresources in Africa, the equal area map would be a better choice (figure 1.3). Figure 1.2 showing the\nworld realms, is actually a compromise between extremes. This layout was developed by geographer\nArthur H. Robinson (it is called the Robinson Projection). When you view maps, keep the purpose in\nmind. In this work, maps are generally chosen due to their theme and availability to be freely used. Figure 1.2 Mercator (conformal) map courtesy of “Strebe.” - Own work, CC BY-SA 3.0,\nhttps://commons.wikimedia.org/w/index.php?curid=16115307\nFigure 1.3 Equal area map courtesy of “Strebe.” - Own work, CC BY-SA 3.0,\nhttps://commons.wikimedia.org/w/index.php?curid=16115199 Whether you take a systematic course like “Introduction to Human Geography” or a regional course\nsuch as “World Regional Geography,” an emphasis in geography over the last couple of decades is to\nidentify and ask critical spatial questions regarding social and environmental issues. Issues like economic\ndisparities between rich and poor countries, gender inequality, identifying environmental issues and the\nlike are examples. In this text, this emphasis is put forth as sections identified as cultural awareness\ntopics.\nTakeaways:\n Geography is the study of Earth as our home.\n As an informed citizen it is important to have a foundation of where places are, what is going on\naround the globe, and to ask critical questions based on location.\n Regions are bounded areas of like or related places. In this course, nine large world regions\n(called realms) are identified based on traditional divisions of culture and environments. At this\nscale the boundary of regions are transition zones, and some of these transition zones have a\ncharacter all to themselves.\n Maps are a key tool of the geographer. Choices on the way maps are constructed is an\nimportant consideration for visualizing the world around us.\n1.2 The Earth as our Home\nLearning objectives:\n1. Describe how the theory of plate tectonics helps explain mountain systems and natural hazards\nlike earthquakes, tsunamis and volcanos.\n2. List the six basic labels of climate regions and provide a basic explanation of why these climate\nzones exist.\nWorld regional geography courses almost always count as social science (or social study) disciplines.\nThe emphasis is on culture groups, societies and human spatial patterns involving religious, economic,\nand political expressions on the land. Yet, obviously the Earth’s natural environments provide\nopportunities and limitations to these human activities, and the resources and prospects local\nenvironments embody are not evenly spread throughout the world. While the Natural world can’t be\nmore than touched upon in a modest book focusing on world regions, studying “the earth as our home”\ncan’t begin without a broad overview of the landforms and climates that form the foundation of our\nhuman experiences. This section on plate tectonics and climate helps set the stage for the chapters that\nfollow. Plate Tectonics\nThe way the continents are arranged is not random. Plate tectonic theory, the idea that the Earth is\nmade of a number of interlocking surface plates that are slowing sliding around over a plastic and fluid\ninterior, explains a number of geologic phenomena, some of which directly affects the lives of people\nand shapes the ways regions look.\nWhen plates collide, move apart, or slide past each other, earthquakes are not uncommon. For example,\nthe San Andreas fault is a well-known fault in California that can cause massive earthquakes and damage\nto humans who live there. In the map below, the Pacific Plate (left of the fault) is moving northward in\nopposition of the North American Plate (on the right).\nAs you can see in figure 1.21 there have been several significant earthquakes in California. One such\nquake happened in Northridge. It was one of the costliest natural disasters in the United States. 57\npeople died and over 8500 were injured. Property damage was upward of 50 billion dollars.\nFigure 1.21 Map of San Andreas Fault, Courtesy of Kate Scharer, USGS (Public Domain).\nhttps://www.usgs.gov/media/images/san-andreas-fault-eq-2\nNot all plated slide past each other. When plates move together, one plate often moves under the\nother. This is called subduction. Where this occurs, the subducted material can melt under interior\npressure and heat and the magma can rise up through the crust forming volcanoes. A famous pattern of\nthese volcanoes is where the denser Pacific Plate has moved under surrounding continental margins.\nThe result is the so-called “ring of fire.” As figures 1.22 and 1.23 show, not only is there a pattern of\nvolcanoes, there is also an associated pattern of earthquakes. Figure 1.22. Tectonic plates, general direction of travel, and the “ring of fire” are seen on this map.\nImage courtesy of “Astroskiandhike.” Creative Commons Attribution-Share Alike 4.0 International\nlicense https://commons.wikimedia.org/wiki/File:Tectonic_plates_and_ring_of_fire.png\nFigure 1.23. Global earthquake map courtesy of the USGS (Public Domain). Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Ring_of_Fire#/media/File:EQs_1900-2013_worldseis.png\nObviously, some places are shaped far more by plate tectonic movements than others and people live\nwith different levels peril. Japan, for example, was greatly damaged by the Tohoku earthquake and related tsunami in 2011. Not only were over 20,000 people killed, but significant damage to the\nFukushima Daiichi nuclear reactors caused additional alarm.\nWhere two plates merge and both rise up, great mountain chains can emerge. This is the case with the\nHimalaya Range. These mountains are not volcanos. Rather, they are great pieces of uplifted and faulted\nblocks of earth.\nIn other places, plates are separating. When this happens, great rifts valleys are formed, such as the\ngreat rift zone in East Africa, and/or magma can ooze out causing new islands, such as found in Iceland.\nSometimes broad areas are stretched apart, and large distinctive basin and range type landscapes form\n(see figure 1.24 below).\nFigure 1.24. Simplified Basin and Range Topographic Cross Section with Underlying Geologic Structures.\nCourtesy of Lincoln DeBunce, adapted from: Simplified Basin and Range Province Cross Section, by\nKathleen Smith. Creative Commons Attribution 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/File:Simplified_Basin_and_Range_Province_Cross_Section.jpg\nClimate Basics and where Humans like to Live\nWeather and climate are part of our experience; people talk about them and they are of importance.\nWeather refers to the immediate or near future qualities of temperature, moisture, wind, clouds and\nsuch that we care about when moving from to work or school to home. Climate is different. It is the\naverage weather of a place over an extended period of time, usually 30 years. Temperature and\nprecipitation are two key aspects of climate that concern out well-being. Temperature is largely\ncontrolled by the angle at which radiation strikes the surface of the earth. It is more direct at the\nequator and more diffuse at the poles. In terms of average weather, precipitation is tied to the\nmovement of large convection cells around the globe. For instance, as figure 1.25 shows, at the\nequatorial zone, air typically rises upward. With that movement, air cools and water droplets form producing afternoon rains. In the subtropics, 15 to 30 degrees north and south of the equator, air\ndescends. It is rather dry and heats up as it moves to the surface. Precipitation in this zone is low, and\nthe temperatures rather hot. This is home to the world’s great deserts, like the Sahara seen in figure\n1.26.\nFigure 1.25. Convection cell dynamics in the equatorial region. Diagram courtesy of Image © Arizona\nBoard of Regents / ASU Ask A Biologist. licensed under a Creative Commons Attribution-ShareAlike 3.0\nUnported License. Source: https://askabiologist.asu.edu/explore/desert Figure 1.26. A caravan travels across the Sahara Desert. Photo courtesy of “Bachmont” CC 2.0 Generic.\nRetrieved from Wikimedia https://commons.wikimedia.org/wiki/File:Maroc_Sahara_caravane.jpg\nClimate regions, such as found in figure 1.27 below, try to capture these patterns. Several different ways\nof categorizing these patterns exist, but the one featured in this text book is a common one developed\nby climatologist/botanist Vladimir Köppen in the late 19th and early 20th centuries. The nice thing about\nKöppen’s regions is that they correspond with vegetation commonly associated with a particular zone.\nKöppen used alphabetical letters (A-H) to organize his regions. “A” are hot and humid climates located\naround the equator. As we move north or south, the letters ascend accordingly until “E” climates, which\nare cold polar environments. Köppen subdivided his scheme of letters by adding a second, third, and\neven fourth letter after the first. For instance, “B” could be subdivided as BW (arid) or BS (semiarid), but\nfor our purposes, we can stick to the first letter. Here is a list of general climates Köppen identified:\n “A” Climates. These are tropical climates that have an overall surplus of precipitation, becoming\nmore seasonal as one moves north and south, and this zone has a constant high temperature.\nTropical plants flourish here.\n “B” climates. These are desert climates. Low moisture levels prevent substantial vegetative\ncover and limit productivity. Plants that do survive have adapted to the low moisture levels.\nSome deserts are quite hot (like the Sahara and Arabian) while others can be miserably cold,\nespecially at night (like the steppes of Asia).\n “C” Climates. These are moderate climates with adequate seasonal moisture. Cool winters and\nwarm summers are prominent. Deciduous trees are common in this zone.\n “D” Climates. Mid and high latitude locations that have cold winters and short growing seasons\nare typical of “D” climates. Conifers that can withstand freezing temperatures, especially at\nhigher latitudes are dominant species.\n “E” climates. Cold, high latitude places limit which plant species can survive. Just beyond the\ntree-line of “D” climates, low growing vetches and mosses make up the tundra. Beyond, nothing\ngrows and ice caps prevail.  “H” climates. In some renderings, “H” climates fall under the “E” designation. “H” climates are\nareas of complex mountain and valley environments that have multiple variations of plant life\ndepending on elevation, slope and aspect. At the scale of a global map, these areas are too\ncomplex to differentiate as to the various microclimates. Because of the “H” designation, some\npeople know these as “highland” climates.\nFigure 1.27. Basic climates of the World. Courtesy of Lincoln DeBunce. Adapted from: Worldwide\nClimate Classifications uploaded by “Splette” at en.wikipedia. CC BY-SA 3.0.\nhttps://simple.wikipedia.org/wiki/Climate#/media/File:ClimateMap_World.png\nWhen examining climate zones, there is a human preference to live in some climates over others. “E”\nand “B” climates are least desirable places for large human occupation. A lack of growing season and a\nlack of moisture inhibit the ability to support communities.\nWhere do people live? Ecumene is the geographic designation for the zone that people have made their\npermanent home. “C” climates and ecumene go together. This climate region is the most favorable\nplace for large settlements on the Earth. This temperate, well-watered seasonal climate is home to rich\nfertile river basins and coastal zones. Agriculture, which is a key to supporting cities and lots of people\nexcels in this climate. “A” and “D” climates are home to many people as well, but the agriculture in\nthese zones is less intensive and more extensive in nature, meaning more land is needed for herding and\nshifting cultivation, and overall populations are less than one finds in “C” areas. “H” climates are generally less populated, but some exceptions are noteworthy. In the high valleys (altiplano) areas of\nMiddle and Central America, agriculture benefits from cool year round temperatures. This is where the\nIncan civilization arose, and this zone is still preferred by many over the hot and humid adjacent coastal\nzones in equatorial locations (see figure 1.28 below).\nFigure 1.28. Bogata, Columbia, is located in the Altiplano of South America, and is home to millions of\npeople. Photo courtesy of Felipe Restrepo Acosta, CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Bogot%C3%A1#/media/File:Centro_internacional.JPG\nTakeaways:\n Plate Tectonic Theory, the idea that moving plates move and collide provide a framework for\nunderstanding the appearance of mountains, volcanos, and earthquakes in some locations and\nnot others.\n Climate is the long term average weather. Temperature is largely controlled by the angle at\nwhich incoming solar radiation strikes the earth. Precipitation is more complex, but is largely\ntied to the movement of large convection cells. Köppen developed a system of classifying\nclimate that corresponds to the major vegetation type found there. Humans inhabit the zone of\n“C” climates more than others. This forms the backbone of the ecumene, or lived in world. 1.3 Population Geography\nLearning Objectives:\n1. Recall the trajectory of human population growth, describing the shift from foraging,\nagriculture, to industrial societies and their impact on global population patterns.\n2. Apply the demographic transition model to future population projections and relate the model\nto population pyramids.\n3. Map the three largest global population clusters and recall the trend of urbanization.\nFor almost all of humankind’s time on Earth, populations were fairly small and stable. Hunting and\ngathering bands of 25-75 people made their living by foraging wild plants and animals. Moving in a\npurposeful routine from resource to resource, these foraging groups likely had impermanent\nsettlements consisting of portable material goods, such as woven sacks, bows and such. In some\nresource rich locations, like a salmon filled river, populations and permanence would have been\nsomewhat higher. Likewise, desolate resource poor areas would have seen very low population counts\nand highly mobile foraging patterns. Based on historical accounts of foraging groups, families may have\nhad several offspring but also had mortality rates that ran fairly high as well. In harsher locations,\ninfanticide was a practice occasionally used as a buffer against foreseeable family and group hardships.\nLeadership was situational, and in general, an egalitarian spirit of sharing was the norm.\nAround 8-10,000 years ago, in at least two different areas, the domestication of plants and animals took\nroot. People in the Middle East and S.E. Asia began keeping animals nearby, building pens and selecting\nanimals for breeding. Plants, such as wheat and rye in the Middle East, or bananas, sugar cane and taro\nin S.E. Asia, were focused upon. As agricultural communities became established, specialists, such as\nfarmers, merchant, religious and military roles became the norm. Permanent dwellings in the form of\nrural farms and Small cities arose. It is clear that cities can’t form without the surplus of food agriculture\nbrings. The rank and rule of elites could not occur either. Society changed radically. People became\nsedentary instead of mobile, and populations started to modestly increase. Farming families saw the\nvalue of many children, perhaps more so than the merchants and elites of the central cities, but also\nfamine and a host of new diseases became part of human society.\nIt wasn’t until recently, after the industrial revolution in Europe, that an understanding of germ theory\nand sanitation began driving down high rates of mortality. In this region more children survived.\nFarmers had labor, but less were needed as machines transformed how people farmed. European\nfactories, located in new growing cities, took labor from the countryside. Eventually, the culture of\nEurope began to change and adapt with the higher survival rates bestowed upon families by new\nmedicine and sanitation. But the long established family custom of many children to only a few changed\nmuch slower than the medical breakthroughs. This era saw high birth rates and low death rates which\nmeant rapid population growth. As these medicines and sanitation practices spread out of Europe, so\ntoo did the rapid rise in population. Figure 1.31 shows this meteoric rise. Figure 1.31. World Population Growth over time. Courtesy of Hana Zavadska via CK-12 Foundation, CC\nBY-NC; retrieved from libretesxts.org:\nhttps://bio.libretexts.org/Bookshelves/Human_Biology/Book%3A_Human_Biology_(Wakim_and_Grewa\nl)/24%3A_Ecology/24.08%3A_Population_Dynamics\nIn the last several decades concern about the unprecedented rapid population growth sparked\nnumerous calls for curbing the explosion. Some governments, like China, called for stiff regulations on\nhaving children. World health organizations provided contraceptives and education to “less developed”\nregions. Interestingly, in Europe, population growth slowed and then stopped. Now, many places in\nEurope are having so few children that population growth has been reversed. Women, having economic,\nsocial, and educational power in Europe, are seeing no need for several children. The culture of large\nfamily size, even in places like Italy, have changed. This transition has been noted and a model for\nEurope’s experience created. The demographic transition model (see figure 1.32 below), charts the\nchange from high birth and death rates to low birth and low death rates. The rapid population growth\nexperienced from cultural values and expectations lagging behind technological changes can be seen\nfrom stage two to stage three. This “cultural lag” is taking place in many parts of the world today, and\nhopefully, the model will apply to other regions besides Europe. If this is true, then populations may\nstabilize or even decrease slightly around 11 billion in the next few decades. Figure 1.32. The Demographic Transition Model. The decline in death rates and continued high birth\nrates correspond with rapid population growth of stage 2. Courtesy, Lincoln DeBunce CC-BY 4.0.\nAnother way of thinking about population dynamics of a given country or region is to examine its age\nand sex structure. Popularly called “population pyramids,” graphs showing the percentage of females\nand males by age cohort provide an easy and effective visual way of describing the state of affairs\nregarding population for that location. For instance, in examining the three population pyramids below\n(figure 1.33) we see a different set of challenges; and we can place where each country falls on the\ndemographic transition continuum.\nAngola is typical of a country adopting ways of lowering death rates, but still maintaining a culture that\nvalues and expects many offspring. The dependency of children on a smaller segment of productive age\nworkers is great. Schools and health care focused on children is needed. More importantly, unless these\nnumerous children die young, more jobs will be needed so they in turn can have a prosperous future.\nCountries like Angola are found throughout the developing world of Africa, East and S.E. Asia, and Latin\nAmerica. This triangle shape indicates a high probability of a rapidly growing population. This curve\nwhich represents stage 2 of the demographic transition, is where the name sake “population pyramid”\ncomes from.\nThe United States is representative of stage 4. The demographic transition is largely over. The graph is\nmore akin to a column than a triangle. This indicates resources that need to be allocate both to children\nbut also to an aging population. Population growth is small or stagnant.\nThe last example in figure 1.33 is that of Germany. After a population boom after World War II, the\ncountry’s people have decided to have small families. In many cases couples are deciding to have\nchildren later than sooner, and perhaps limiting their offspring to one or two (if having children at all).\nThe result is a population that is not replacing its workers and a country that must figure out how to\nsupport a dependent older cohort. Figure 1.33. Types of Population Pyramids. Adapted from: “Kopiersperre” (CC BY-SA 3.0). Retrieved\nfrom Wikipedia:\nhttps://en.wikipedia.org/wiki/Epidemiological_transition#/media/File:Population_pyramid_forms.svg\nOf course, it is one thing to look at the overall population trends, or even examine the age-sex structures\nof countries, but it is also incumbent upon us to know where most people in the world live today. Figure\n1.34 shows us that there are three great population clusters in the world today: East Asia, South Asia,\nand Central Europe. Of the 7+ billion people on Earth, these three clusters together are home to the\nmajority of them. In fact, China and India alone are home to over 35% of the world’s peoples. These\nconcentrations are experiencing different growth patterns: South Asia is expanding; East Asia’s growth is slowing down and is moving toward no growth at all; and Europe in declining. These patterns imply that\nSouth Asia is still in stage 2 and 3 of the demographic transition model, East Asia is moving toward the\nend of stage 3, and Europe is in stage 5, having gone through the demographic transition.\nExplaining why these places and not others are the largest population clusters on the planet boils down\nto good arable land (there is strong overlap with a “C” climate), and historical development of the\ncivilizations of each region and country.\nFigure 1.34. Three population clusters of the world. Cities with populations over 1 million shown in red.\nAdapted from: “Cocoliras,” (CC BY-SA 3.0). Retrieved from Wiki commons:\nhttp://commons.wikimedia.org/wiki/File:2006megacities-1-.jpg.\nBeyond these clusters, we should also note the cities seen on figure 1.34. Each red dot represents a city\nof over one million people. The concentration of people in cities is another general trend that began\nwith the agricultural revolution and has intensified with the industrial revolution. For instance, in 1900,\nless than 20 percent of the world’s population were urban dwellers. Part of this movement is due to the\nmechanization introduced in farming. It is a common practice in developing regions for displaced or\nyoung unemployed adults to find work and social opportunities in cities. Sometimes their dreams are\nrealized, but income inequality, including extreme poverty and homelessness in evident in urban\nenvironments. Today, more than half of humanity lives in cities. In some countries, such as Japan, rates\nare as high as 90+ percent, and even in countries that have a strong rural base, such as the United\nStates, the rate is over 80 percent.\nTakeaways\n For most of history and prehistory, humans have lived off the land as hunters and gatherers.\nPopulations were small and mobile. Only in the last few thousand years have we turned to\nagriculture as the primary way of feeding ourselves, and with this new economic system, have\nturned toward permanent settlements.  Due to advancements in sanitation and health, there has been an explosion of population\ngrowth in the last couple of centuries. Fortunately, the experience of Europe has shown that\nrapid population growth can subside, transitioning from a high birth and death rate, to a low\nbirth and death rate.\n People are not evenly spread across the globe. Rather, more than half of humanity lives in three\ndistinct population clusters. The world’s people are living more in urban environments than\never before. Part of this change is due to the mechanization of agriculture and the perceived\nbenefits (real and imagined) of living in cities."
}