{
    "text": "Chapter 7. East and Southeast Asia (Draft Version)\n7.1 Realm on the Rise\nLearning Objectives\n1. Describe the physical dimensions and basic components of East and Southeast Asia.\n2. Overview the basic history of the realm.\n3. Explain why this realm is considered to be on the rise.\nIn terms of economic, political, and military power, East and Southeast Asia is a dynamic realm that is on\nthe rise. This realm consists of two large and important regions, East Asia and Southeast Asia. These are\nsubdivided by mainland and insular (island) sub-regions. China is the hegemonic seat (most powerful\ninfluence), while Japan, South Korea, and Taiwan, have robust economies bolstered by their ties to\nUnited States commerce. Southeast Asian countries are home to emerging economies, like Vietnam,\nThailand, and Malaysia. Both regions also contain some of the world’s poorest and least developed\nplaces, such as North Korea, Myanmar and Cambodia.\nFigure 7.1: Map of East and Southeast Asia. East Asia is in orange and Southeast Asia is represented in\nred. Courtesy of CIA World Factbook, Public Domain. Retrieved from World Regional Geography:\nhttps://worldgeo.pressbooks.com/chapter/east-and-southeast-asia/ This realm covers many climatic areas. As figure 7.2 shows, very dry, cold deserts are found in western\nChina. Semi-desert steppes are typical of Mongolia. Temperate mid-latitude humid climates dominate\neastern China, Japan, and Taiwan. In southern china, the Tibetan Plateau rises thousands of feet, and\nthe climate reflects a cold highland aspect. As one turns south, humid equatorial climates prevail.\nFigure 7.2 This Satellite view of East and Southeast Asia shows the range of physiographic features.\nGreen areas are more humid, while grey areas are representative of deserts and mountainous zones.\nNotice that interior, western locations tend to be drier than eastern locations, which are more humid. Southern tropical locations receive plentiful rainfall. Image courtesy of NASA, Public Domain. Text and\nboundaries added by Lincoln DeBunce.\nThe history and development of the realm largely centers on cycles of expansion and contraction of the\nChinese dynasties, though other historical empires, such as the Mongol hordes, which conquered vast\nareas of Eurasia, and SE Asian regional empires like the Khmer, which ruled significant portions of\nSoutheast Asia 1200-600 years ago, are also important. With China, the history stretches back to the rise\nof agricultural villages, towns and later cities, combining to produce surplus food. This is the requisite of\nlarger political and social organizations that lead to powerful families backed by military and supported\nby taxes of food and goods, and later on, money. The earliest dynasty, a succession of related family\nmembers, was the Xia dynasty beginning about 4000 years ago. This dynasty was centered on the\nChinese plain, a rich farming area that includes eastern portions of the Yuan He (Yellow) and Chang Jiang\n(Long) river basins (figure 7.3). Various physiographic areas (large areas of similar land and climate,\nlisted as Macro areas on this map) were controlled at one time or another by dynasties, but all\nemanated from this core area.\nFigure 7.3. Physiographic map with Chinese expansion overlain. Map courtesy of “Yug,” CC BY-SA 3.0.\nRetrieved from Wikipedia: https://en.wikipedia.org/wiki/Geography_of_China#/media/File:China-\nHistoric_macro_areas.svg It is better and more accurate to think of China as made up of many ethnic groups, the Han being the\nlargest, and the group that is in power in China today. As areas were incorporated into the Han area of\ninfluence, their culture and peoples spread as well. Han influence continued to spread beyond formal\nboundaries into places like modern-day Vietnam.\nChina has been a place that has at times, extended itself beyond its core and interacted with others, at\nother times, China has built great walls and has been inward looking. In the 19th century, outside trade\nwith European powers opened the door for a lucrative opium trade from the British to China. It was\nabout the only commodity that gained traction as a good that could be traded. China had superior\nceramics, superior textiles (like silk), and had little interest in most other European goods. The\ndestruction of Chinese health, habits, and culture, led China to try and halt British and other European\ntrade. The British fought a brief war with China to force the continued trade of opium. The Chinese lost,\nand concessions were granted to various European Powers to set up extra-territorial enclaves where the\nEuropean laws and businesses thrived and Chinese rights were diminished (Macau, repatriated in 1999,\nwas essentially the last of these extra-territorial arrangements). In the ensuing chaos, regional Chinese\nwarlords began ruling areas, and the last Chinese dynasty ended when the emperor of China was forced\nto step down in 1912. Between World War II and the early 1980’s, China was a rather closed country,\nand did not deal much at all with the outside. Since that time, Chinese policy has changed, and now\nChina is once again in a position of opening itself to foreign investment, trade, and expansion. China\ntoday is the regional power that all others in this realm pay sharp attention, and some experts argue it is\nin a position to become a superpower. A superpower is a country whose actions are looked at carefully\nby all countries of the world due to the economic, military, and political power, it exudes.\nBy most measures, China is the largest economy in the world. Not has China risen to prominence, the\nrealm as a whole has developed rapidly in the last several decades. After World War II, The United\nStates established a policy of favorable trade with Japan, Taiwan, and South Korea. These country’s\neconomies have flourished. Hong Kong and Singapore followed. Vietnam has a trade surplus, which\nmeans it sells more exports than it buys imports. The same is true for Malaysia, Thailand, Brunei,\nIndonesia, and Mongolia. Sometimes known as the East Asian Miracle, State level involvement that\nworks hand-in-hand with export-oriented production, coupled with stable governments, low wages and\na productive work force, has been credited for continued growth and productivity. Not all countries are\ndoing well. The Philippines, Cambodia, Laos, Myanmar, and North Korea have all suffered from political,\nsocial, and economic integration. East Timor is a newer country, and its future success has yet to be\ndetermined.\n7.2 Mainland East Asia\nLearning Objectives\n1. Describe the environment, lifestyle, and political history of Mongolia.\n2. Map the population patterns of China and explain the patterns displayed.\n3. Describe the significance of China’s Special Administrative and Special Economic Zones.\n4. Explain the basic reasons for conflict on the Korean Peninsula.\nWind-blown steppes (semidry grasslands) cover much of Mongolia. In this seemingly hostile\nenvironment, Mongols tamed horses and developed a highly successful nomadic lifestyle of pastoralism. The yurt, locally called a ger, along with the horse and bow, was central to their culture. Many\nMongolians still practice a nomadic lifestyle, though the trappings of modernity and a strong influence\nfrom Russia has affected traditional ways. Russia backed Mongolian quasi-independence after World\nWar II from China. Mongolia had little choice other than to accept Russia’s support and input in its\naffairs. The alternative was to be drawn more permanently into the Chinese sphere of territorial claims,\nwhere their autonomy would be very limited. This made Mongolia a classic example of a buffer State. A\npolitical entity caught between two much larger and more powerful adversarial States.\nFigure 7.4. A traditional ger on the Mongolian Steppe. Traditional nomadic lifestyles have been impacted\nby western items of convenience, like the motorcycle and power lines. Traditions were heavily impacted\nfrom Russia between 1945 and 1990. Photo courtesy of Marcin Konsek, CC BY-SA 4.0. Retrieved from\nWikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Steppes_in_Mongolia#/media/File:Jurty_na_stepie_po\nmi%C4%99dzy_U%C5%82an_Bator_a_Karakorum_01.JPG\nOne of the consequences of Russia’s alignment was a suppression of Mongolian Buddhist practices. With\nthe downfall of the Soviet Union, Mongolia seized upon the opportunity for full independence. A\nresurgence of Buddhism and other Mongol cultural practices has ensued in the last couple of decades. A\nsmall population and landlocked location between two larger powers is a continuing challenge for the\ncountry. An investment in foreign adventure tourism targeting the United States and Europe is one of\nthe ways Mongolia has sought to affirm its new status.\nSouth of Mongolia, China is a land full of rich history and booming economic opportunities. The\nfortunes and future of China is reflected in its very uneven population characteristics. In the northeast, the Han Chinese reaped the benefits of wonderful agricultural production. After staving off raiding from\nthe Mongols, the purpose of the Great Wall of China, China has built its population over the years. At\nfirst, the original leader of the Communist Party, Mao Zedong, saw warnings of population growth as a\nsneaky way of outsider trying to limit China’s power, and he encouraged large families. However, a few\nyears later, the reality of trying to feed an ever-growing population moved his regime to a policy of one\nchild only. As Draconian as this sounds, it has slowed the population boom, and this policy has been\nsomewhat relaxed.\nFigure 7.5. Population density map of China, with the Heihi-Tengchong line added by Lincoln DeBunce.\nDensity map courtesy of Alan Mak, CC BY 2.5. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:China_Pop_Density.svg#/media/File:Population_density_of_C\nhina_by_first-level_administrative_regions(English).png .\nAs mentioned earlier, the Han expanded its boundaries to other areas and to other peoples. If you\nexamine the map above, however, you can see a pattern observed even in 1935 by the Chinese\nGeographer Hu Huanyong. The humid eastern part of China, marked by the heavy black line, is where\nthe close to 2 billion Chinese live, over 90 percent of the population. The western part, comprised of\ndeserts and mountains, is sparsely populated. These areas are a buffer for China, and home to minority\ngroups, such as Tajiks that are linked to the Middle East through the Silk Road, and to TIbetans who have\nlived in high plateau areas for thousands of years. To the east, the shores of the Pacific have been\navenues of trade and sometimes aggression from outside peoples. After a period of isolation by the Communist party, in the 1970’s, China has slowly and strategically opened its shores to foreign\ninvestment and trade. Booming food and manufacturing industries based around low cost labor has\nfueled China’s ascension to a global economic power. These areas, known as Special Administrative\nZones (SAZ’s) and Special Economic Zones (SEZ’s) are shown in figure 7.6 below.\nFigure 7.6. China’s Special Administrative and Economic Zones. Map courtesy of Alan Mak, CC BY 2.5.\nRetrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Special_economic_zones_of_China#/media/File:PR_China-SAR_&_SEZ-\nEnglish.png.\nHong Kong was returned from the United Kingdom to China in 1997, Macau was returned from Portugal\nin 1999. Both island areas had served as a capitalistic entry and exit point from the Chinese Mainland.\nInstead of immediately overhauling both places to resemble to more isolated Chinese economic model,\nChina instead has allowed economic connections to continue, with the understanding that the Chinese\npolitical apparatus has ultimate authority. Macau has a gambling and resort landscape over seven times\nthat of Las Vegas. Hong Kong has banking and shipping connections that tie the Shantou and Shenzhen\nSEZ’s to the rest of the world. China’s SEZ’s, like those in Guangdong Province just mentioned, are set up\nas opportunity zones for foreign manufacturing using local Chinese labor. These SEZ’s have substantially changed the location of global manufacturing and has led to an economic boom in China. As seen in\nfigure 7.7 below, local landscapes, such as Pudong in the Shanghai SEZ, have changed dramatically. In\nthis case, it is a symbol of China’s global reach and reward in the world economy.\nFigure 7.7. Pudong and Oriental Pearl Tower are a showcase of China’s place in the global economy. The\nestablishment of China’s SEZ’s have transformed local landscapes and the world economy. Photo\ncourtesy of “MiLu24,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Pudong#/media/File:OrientalPearlTower_feet.JPG\nIn Northeast Asia lies the contentious and dangerous Korean Peninsula. Once known as the Hermit\nKingdom, Koreans were traumatized by the invasion and occupation of Japan during WWII. Afterwards,\nliberation took the form of a Russia north and an American south. Instead of peacefully relinquishing\nand unifying the Korean people, instead a capitalist/communist cold war divide ensued. The Korean War\nleft many dead in its wake, and finally resulted in a cease-fire line around the 38th parallel. There has\nbeen no treaty, and technically the war between the same people, ideologically divided, has not ended.\nSouth Korea, bolstered by investment and protection from the United States has flourished. In the\nnorth, it has been a very different story. An authoritarian family regime founded by Kim Il-Sun, has\nlargely left the outside world behind. Poverty and lack of modern services is widespread (see figure 7.8).\nThe Sun family has steadfastly developed a nuclear and missile program to deter outside aggression.\nLack of communication, and suspicion on both sides leaves this part of east Asia in a highly charged and\ndangerous state. Figure 7.8. The lack of illumination at night from North Korea contrasts sharply with those of South\nKorea. This satellite image is a telling reminder of the unfulfilled unification of the Korean Peninsula.\nImage courtesy of NASA, Public Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Korean_Demilitarized_Zone#/media/File:Korea_at_night.png\n7.3 Insular East Asia\nLearning Objectives\n1. Overview the Physical geography of Japan and Taiwan.\n2. Briefly describe the effect of US investment leading to Modern Japan.\n3. Explain the awkward association of Taiwan to Mainland China.\nThe archipelago (chain of islands) of Japan traverse a good deal of latitude. This means that the\nNorthern Islands of Japan get cold snowy winters, and the southern reaches, including Okinawa and the\nRyukyu islands, are rather tropical (see figure 7.9 for a general overview). All of these islands are\nmountainous with limited flat lands to develop farming and large settlements. General map of Japan with major placenames. Note that Hokkaido ranges north of 40 degrees, while the\nKyukyu Islands fall into the tropical latitudes. Map courtesy of the CIA, Public Domain. Retrieved from\nWikipedia: https://en.wikipedia.org/wiki/Geography_of_Japan#/media/File:Japan-CIA_WFB_Map.png\nThe nature of this geography lies in the underlying geology (see figure 7.10 below). The archipelago is at\nthe juncture of these major tectonic plates, causing mountain uplift and frequent earthquakes. The low-\nlying Kanto plain, home to Tokyo and its many affiliated cities, is at the nexus of this unstable zone. Figure 7.10. Japan’s location among active geologic plates is central to understanding its mountainous\nand earthquake prone nature. Image courtesy of “Oghmoir,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Geography_of_Japan#/media/File:Japan_separation.png\nJust Southwest of the Ryukyu Islands is Taiwan. It is located on the border of the Philippine and Asia\nPlate. Its western side rises to a mountainous interior and rugged east coast (figure 7.11). Figure 7.11. Taiwan is a sizeable island off the coast of mainland China. Satellite view courtesy of NASA,\nPublic Domain. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Geography_of_Taiwan#/media/File:Taiwan_NASA_Terra_MODIS_23791.j\npg\nBoth Japan and Taiwan are countries that have been invested in from the United States. After World\nWar II, a strategy, known as the Marshal plan, sought to align Japan and other countries toward a\ncapitalistic model, away from the socialist economies and alliances of Russia and China. In Taiwan’s case,\nthe Nationalist Chinese Party that was aligned with the United States fled from mainland China to\nescape the emergent Communist Party. The United States officially recognize Taiwan as the legitimate\nleaders of all China for three decades, but finally relented and acknowledged the Mainland leaders as\nlegitimate over China. However, Taiwan has been placed in a nebulous situation as a result. Mainland\nChina claims Taiwan and sees it as a rogue territory. The United States has intimated it will defend\nTaiwan from invasion from the Mainland. This is another potential flashpoint in East Asia.\nJapan and Taiwan have thrived in a favorable economic climate. Taiwan has modernized and moved\nfrom producing inexpensive garments to high tech computer technologies. Japan has forged a similar\npath. Their economy moved from cheap consumer goods, appliances, and automobiles, to a pinnacle of high-tech electronics, robotics, and optics. The country is home to a vibrant banking and business\nclimate.\n7.3 Southeast Asia\nLearning Objectives\n1. Compare and contrast highland and lowland areas of SE Asia.\n2. Associate European colonies and modern country boundaries.\n3. Describe major issues affecting SE Asia.\nMainland SE Asia is comprised of a number of North-South Trending mountains and River Valleys. Many\ndifferent ethnic groups developed a pattern of life depending greatly on these locations. Mountain\npeoples use a shifting agricultural pattern. Stretches of forest would be cleared through burning, and\nthe friable soils then planted with food crops, like dry rice, for a few years. Due to the high leaching of\nnutrients through high rainfall, soils would become less useable, and the peoples would move to a new\nplot of land and start the cycle of burning anew. The abandoned land would slowly recover and\neventually might be used again. This system involves more mobility of the people, and a low population\ndensity to be successful. Valley peoples were able to stay in place and establish larger villages. Wet rice\ncould be planted several times a year, and the nutrients filtered down from the mountain streams\nwould replenish the paddy’s year after year. On the islands of SE Asia, the shifting pattern was\ndominant. On the coast, fishing and rivers allowed a more settled life.\nIt is in these conditions that European traders established contact with the sedentary peoples at the\nmouths of rivers and the protected island harbors. These Southeast peoples became part of the colonial\nworld of trade, whilst the mountain peoples of the interior stayed aloof of these relationships. Later,\nafter these river and coastal villages turned into colonial cities, the mountain peoples became a\nminority, while the settled peoples of the valleys and coastal ports became the majority. The European\ncolonial pattern of claims, with the exception of most of Thailand, which was able to remain\nindependent, largely established the state of the world boundaries we see today (compare figures 7.12\nand 7.13 below). Figure 7.12. European colonial territories in SE Asia. Image courtesy of Rumilo Santiago, CC BY-SA 4.0.\nLabels and minor editing by Lincoln DeBunce. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/European_colonisation_of_Southeast_Asia#/media/File:European_colonis\nation_of_Southeast_Asia.png Figure 7.13. The modern political map of SE Asia is shown above. Comparing this map to figure 7.12, the\nassociations between old and new make clear that like many places outside of Europe, colonial claims\nhave left an indelible mark. Image courtesy “Cacahuate,” CC BY-SA 4.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Map_of_Southeast_Asia.png\nBuilding stable and vibrant countries, where minorities from the interiors are integrated into the\ndominant coastal and valley peoples, from these colonial origins is a major challenge. The Philippines,\nfor example, has hundreds of ethnic groups and languages, Roman Catholicism and Islam, as well as\ndozens of indigenous religious practices, spread across over 7,500 islands. What these people have in\ncommon is not much. The colonial past has left an impoverished and often corrupt government to try\nand stay in control over a wide disparate periphery containing people who may not like them, nor see\nwhy they should try and work to build a unified country. The pattern of the Philippines is repeated\nacross Southeast Asia."
}