{"text":"Quite simply, “Geography” broken down means “to study the culture. Like many of the disciplines in the social sciences, it is a\nearth” and throughout your studies in the book, we are going to discipline that weaves the threads of the others.\nexpand on this definition.\nWhen studying geography we are going to focus on two\naspects - physical geography and human geography. When\nwe look at landforms, vegetation, climate, bodies of water such\nas rivers, lakes, and seas, we will be studying physical geography,\nthe study of natural and physical characteristics. Human\ngeography is different but related. It is the study of how people\ninteract with the earth. It also includes culture, migration\npatterns, and patterns of population.\nThe study of something often begins with a question. This\nbook itself is set around a series of questions, some smaller,\nsome larger. Over the course of this entire world geography\nbook, you will explore one major\nquestion: “How are we, as members\nInteractive 1.2 Interactive\nof a global society, connected?” In\nJournal\nIf you were to go home and ask your parents about each section of this book, we will\ngeography they may have studied in school, they might say when bring you back to this idea and have\nthey were students they memorized the states and capitals, or you record any new thoughts and\nmajor countries in the world. This is only one part of what ideas that occur to you based on what\ngeography really is however. To study geography is to study you have explored in this book and\nwhere we are in the world; what the world around us is like. It is through class instruction and\nthe study of who lives there and why. It can be the study of foods discussion. You will be doing this as\nPlease note: once you have\npeople eat, clothes they wear, cars they drive, and homes they part of an interactive digital journal\ncreated your own copy of this\nlive in. It is the study of climate, land, economies, politics and which you can view here. document, this widget will only\nreturn you to the blank copy. You\nwill need to access yours by\nopening from your own Goo7gle\nDocument. While the teachers who have put this book together have would wear lighter clothing? What is the average temperature\nprovided some questions to focus your study, you will be asked during winter? What is the average temperature during the\nand encouraged to come up with your own questions as well. summer months? One question about why people dress the way\nThe process you will be guided through is known as inquiry - the they do could lead to a series of new inquiries in the desire to\nact of seeking out information. learn more.\nGallery 1.1 Image Gallery\nImage source: https:\/\/farm4.staticflickr.com\/\n3302\/3570407917_585dd5a1e8_o.jpg\nView the image\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8c\/\ngallery above -\nInupiat_Family_from_Noatak,_Alaska,_1929,_Edward_S._Curtis_(restored).jpg\npractice asking\nHow are the people in the picture above dressed? Why might\ngeographic\npeople in this place wear clothing like this? If you notice the fur\nquestions based\nhoods surrounding their faces you might think it is cold where\non the images\nthey live. If you investigated further, you would learn that this is a\nshown.\nhistorical photo of an Inupiat family from Alaska. It might lead you\nto ask more questions - are there times of the year when they\n8 As you continue to study “the basics,” this chapter serves\nnot just as an introduction to your studies this year, but also as a\n“how to use this book” in case this is your first time using a digital\ntextbook to explore Social Studies. You will have an opportunity\nto practice most of the things you will be asked to do in this book\nduring this introductory chapter. The last thing you will be asked\nto do is to once again revisit the question we posed at the start of\nthis section. This time, you are going to write a brief response.\nWhat is Geography, anyway?\n9 Section 2\nWhy Do We Study Geography?\nQUESTIONS TO GUIDE You might now have a better idea about\nINQUIRY what geography is, but why do we study it?\nThere are many reasons. Take a moment to\n1. What is geography?\nview the video clip here about how some\n2. Why do we study\npeople use geography in their chosen\ngeography?\nprofessions.\n3. What tools do\ngeographers use?\nInteractive 1.3 What can\nyou do with geography?\n4. What is geographic\ninquiry?\n5. Why do we need to\nthink globally?\nLearn more about what\ngeographers do with this YouTube\nclip (requires internet connection)\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/32\/JohannesVermeer-\nTheAstronomer(1668).jpg\n10 Why we study geography is a question many have asked. think critically. It provides opportunity to inquire about the world\nWhile to some geography is viewed only as maps, in reality it has around you and research to find answers.\nlinks to science, mathematics, literacy, literature, and the other\nGeographers study the “why of where” which can be\nsocial sciences.\nsimplified to “why there?” or “why here?” You may have studied\nthe early history of the United States in other social studies\nclasses. Where did early settlements like Jamestown tend to\nspring up and plant roots? It was generally around water\nsources. A geographer would then ask and seek to explain “why\nthere?”\nThe image on this page is not an all inclusive list of why we study\ngeography, but it does include many of the major reasons we will\noutline as you go through this book.\nStudying geography can provide you with an overview of the\nplanet upon which we live. People who study it are better\nequipped to understand topics such as why people live where\nthey do, what causes people to move between places, how we\nuse our natural resources, why countries and locations are broken\nup into geographic regions...the list goes on and on!\nIn addition to knowing about our planet and the people who\nlive there, people study geography because it helps you learn to\n11 affecting more\ncountries than\njust Japan. We\nare citizens of\nthe United\nStates of\nAmerica, but no\nmatter where we\nlive, we are also\nresidents of this\nball of rock\nfloating in\nspace. What\nWinter sunrise at Michigan’s St. Joseph Lighthouse\nImage source: John McCormick\/Shutterstock\ndoes that mean?\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8d\/\nUnderstanding the world around you - Why does Michigan\n2011_Tohoku_earthquake_observed_tsunami_heights_en.png\ngenerally have colder temperatures in the winter than Florida?\nWhy is a home on the beach so expensive? Have humans had Learning about people and societies - If you slurp your soup in\nan effect on the climate of the earth? When studying geography America, folks might call you rude. Burp at the table and it’s\nyou can learn the answers to questions such as these which help possible your parents might send you to your room without any\nyou make sense of the world around you. dessert. In Japan however, holding a bowl of soup and noodles\nup to your mouth to eat it is considered a sign to the chef that the\nBecoming a global citizen - Back in the early 1900s it could take\nfood is delicious. Slurping and all! In parts of China, burping\na person coming from Europe to America over a week to make it\nafter a meal is considered a sign of appreciation. Religious\nfrom one port to the next. Now, flights leave major airports and\ncustoms vary from country to country - the five major world\nhave people at their destination within hours. When a natural\nreligions (discussed in more depth in later chapters) all help\ndisaster happens in one part of the world, it can affect daily life on\ndictate traditions and customs in parts of the world. Studying\nanother. A tsunami in Japan back in March of 2011 ended up\n12 geography Connections -\nallows you to\nAll of these things together help us explore the idea of how the\nlearn more than\nworld around us affects every day life, as well as the\njust where a\nconnections between how we relate to all of that.\ncountry is\nlocated on a\nFor that reason, the inquiry question we will keep coming back\nmap, but what\nto throughout the course of this book is:\nthe people and\n“How are we, as members of a global society, connected?”\nsociety are like\nas well.\nThis question is not studied because there is a world\ngovernment that unifies the planet, but more to help you realize\nhttp:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/23\/JapaneseBosozoku.jpg\nthat whatever country you are from is one of many, and that\nactions in one place can have effects on other places.\nTake a moment to record your thoughts to that question. In the\nnext section we will begin to look at\nLearning about locations - This\nsome of the tools that geographers\nmay be the piece of geography that\nuse.\nsticks in almost everyone’s mind,\nbut geography is the study of\nlocations. We do this by studying\nmaps, pictures, Geographic\nInformation Systems data, visiting\nand exploring these places, among\nothers.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/12\/\nWorld_map_2004_CIA_large_1.7m_whitespace_removed.jpg\n13 Section 3\nWhat Tools Do Geographers Use to Study the Earth?\nQUESTIONS TO If you were to ask 100 people what tools geographers\nGUIDE INQUIRY use to study the earth, one of the first answers you will\nundoubtedly hear will be “maps.” And it is true that maps\n1. What is geography?\nare one of the most common tools used to answer\n2. Why do we study\ngeographic questions. A map is a visual representation of\ngeography?\nthe earth, or parts of the Earth and can showcase a variety\n3. What tools do\nof spatial scales.\ngeographers use?\n4. What is geographic What are those spatial Interactive 1.5 Google\nMaps\ninquiry?\nscales? You can represent a\n5. Why do we need to very small portion of the map\nwith great details. Below is an\nthink globally?\nembedded map from Google. It is\nA Note On Scale:\nset to a city in Northern Michigan\nInteractive 1.4 Google\nThe map activity on this page is zoomed in as far as that particular\nDrive Journal Activity\nset to focus on a city in Northern\nmap can go to. Take a moment to\nMichigan at the most zoomed-in\nexplore that map at different scales\nscale. This is the smallest scale\nand then complete the Google Drive\nfor a map because objects like\njournal activity located here.\nbuildings and roads are shown\nat their largest size. At a more\nzoomed-out scale, objects like\nbuildings and roads may be so\nRefer to this handout together small that we cannot see them.\nwith the Google Maps widget.\n14 Maps If you were to take a balloon\nInteractive 1.7 Map\nand inflate it, then draw a map of\nProjections Video\nMaps are able to show information about geographic areas.\nthe world on it, you could, if you\nEvery map has at least one purpose. They can represent a place\nwere careful, get a very close\nsuch as a neighborhood, a town, a country, or the world overall.\napproximation of what the world\nSometimes they can show human features. In the very first map\noverall looks like. If you were\nyou looked at in the Google Maps link above, what human\nextremely careful you could\ncharacteristics such as roads, buildings, etc. were you able to\nrepresent the continents of the\nsee? When you zoomed all the way out, were you still able to see\nearth drawn to a precise scaled\nany human characteristics?\nsize. This is because a balloon is a Learn more about map projections\nwith this video. (Requires internet\nround, three-dimensional object. A\nWhen your parents were younger, they probably went on a connection)\nmap, however, is a two-dimensional\ntrip with their families which involved using a map of a state or\nobject. If you were to pop that balloon (much like peeling the\nregion to get to their final destination. Modern technology such\norange in the video above) what you are left with is a much less\nas smart phones have GPS built in which has made these two\nuseful representation of the earth.\ndimensional maps obsolete for that purpose. A road trip is not\nthe only use for a map of a city or a state, however. Maps can\nrepresent a variety of different features about a place. There is a\nsmall problem with maps however… In an attempt to represent a three dimensional object in two\ndimensions, mapmakers, known as cartographers, have created\nInteractive 1.6 The Orange different ways to represent the earth. These are known as map\nprojections. There are hundreds of different types of projections\nand each has plusses and minuses in its usage.\n15 Take this map for represented\nexample. This is known closer to\nas a Mercator projection. their actual\nA Mercator projection scales. If,\nwould be an excellent however,\nmap for a navigator on a you\nship. In fact, this kind of compare\nmap was extremely useful this map to\nin navigation. One of the the Mercator\nproblems with this map is Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/34\/Gall projection,\n%E2%80%93Peters_projection_SW.jpg\nthe distortion of size. If what do you\nyou look at Greenland on this map, it appears to be huge. notice about\nAustralia, the small continent in the bottom right hand portion of the shape of land masses? There is a distinct distortion\nthe map, looks like it is much smaller than Greenland. In actuality somewhere on\nhowever, Greenland is much smaller. Antarctica almost appears the map.\nto be as large as the rest of the continents together. So, while a\nThe next\nMercator Projection is a great map for use in navigation, it does\nprojection we\nnot project the world as it is due to the distorted size of certain\nwill take a look\nareas.\nat is known as\na Robinson\nProjection.\nAnother well known map projection is known as a Gall-Peters\nGenerally\nProjection, or more commonly, a Peters Projection. There is a\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/9\/96\/\nspeaking, a\nRobinson_projection_SW.jpg\/1280px-Robinson_projection_SW.jpg\ngreat controversy surrounding the origins of this map, which you\nRobinson\nmight want to take a few minutes to look up in the future. In a\nprojection is an attempt to compromise and show the\nprojection such as the one above, parts of the world are\nlandmasses as close to their natural size and shape as possible\n16 on a two dimensional representation. It too, however, suffers Below is a gallery of many different map projections. As you flip\nfrom distortion. In this case, much of the world is shown as close through the gallery, think about how each map might be useful,\nto scale as possible, but as you move toward the top and bottom and what the disadvantages of the map might be.\nof the map, what do you notice happening?\nGallery 1.2 More Map Projections\nNow, think back to the video you watched at the beginning about\nthe orange. Another projection is known as the Goode\nHomolosine Projection, more commonly known as an Interrupted\nProjection. In this projection type, there is very little distortion in\nterms of size of continents, however it is very difficult to calculate\ndistances on a map such as this. If you were taking a plane ride\nfrom New York to London, it would be difficult to figure out the\nexact distance if this were the only map available to you.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f2\/Goode_homolosine_projection_SW.jpg 17 one portion of the United States seems to have a lot of\nthese lights, while large portions of the Western half of the\nUnited States are much spottier. A “why” question a\ngeographer might ask about this would be: “Why are there\nImage source: http:\/\/pixabay.com\/p-92367\/?no_redirect\nSo, yes...maps are one of the many tools that geographers use to Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/da\/Washington,_D.C._-\n_2007_aerial_view.jpg\nstudy the earth. But what are some of the others?\nmore large urban areas on the eastern half of the United States\nthan the western half?” By looking at this image, geographers\nAerial Photographs and Satellite Imagery might then look at maps and other aerial photographs to get an\nanswer to this question.\nWhen you look at the image above, what do you see? This is a\nsatellite image captured of the United States. The “gold” on the\nmap represents city lights, which in turn can help someone\nstudying this image understand where some of the major\nmetropolitan areas are in the United States. You will notice that\n18 A satellite image has many purposes and can be helpful at a stand-alone unit, sends information up into the sky where it\nvariety of spatial scales from large to small. An aerial photograph connects with a satellite, which then determines your position on\nis similar to this, but is generally speaking at a larger. The aerial the planet. This information is then relayed back to the user and\nphotograph that shows Washington, DC, shows a zoomed-in displayed on a map. Aside from just locating yourself on a map,\nview of a city at a larger scale in which we can see individual how might GPS be a useful tool for geographers?\nbuildings and streets. A picture like this one might help someone\nGIS (Geographic Information System)\nstudy patterns of development for neighborhood planning. It\ncould be useful in surveying an area for a potential building\nA geographic information system, commonly referred to as GIS\nproject. Other aerial photographs could be useful in determining\nutilizes software and hardware to collect and display data. It can\nlocation of farmland, where irrigation systems could be created,\nhelp you display forms of information useful for geographers to\namong many other things. Both of these tools are useful for\nexplore. It is a combination of map making (cartography), data\ngeographers in answering their “why” and “where” questions.\nGPS (Global Positioning Systems)\nDo your parents have a smartphone they sometimes use to\nget directions to places they have never been? What about you?\nGlobal Positioning\nSystems (commonly\nreferred to as GPS)\nmake use of satellites in\norbit to collect\ninformation about where\nthe user is on the earth.\nYour GPS device, be it\na phone or a\ncommercially available Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/33\/GvSIG_-_GIS.jpg\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/59\/\nGPS_Receivers_2007.jpg\n19 about places, and computer technology to create a Return once more to the “What Tools Do Geographers Use to\nrepresentation of places. Someone who uses a GIS is then able Study the Earth” note guide. There is one final question for you\nto create a representation of places by layering information on top to explore before moving into the next section.\nof the map and allowing the people using them to manipulate\ninformation in an attempt to better understand a place.\nOther tools\nYou may not initially think of things like stories, people, charts,\ntables and graphs as being things a geographer might use,\nhowever, even with a wealth of other tools such as maps, satellite\nInteractive 1.8 Google\nimagery, and GPS and GIS available, more information is needed Drive Digital Journal Activity\nin pursuit of the answer to the questions of “why” and “where.”\nIn this case, geographers use some of the same tools as\neveryone else to explore and learn more, such as data in tables,\nand charts and graphs which can help with numerical data about\na place. If a geographer is trying to understand why people\nsettled in a given area, they might look back at historical data\nabout when people came to a region in an attempt to understand\nwhy. They might also look at primary source documents - first\nhand accounts from people who lived during the time to get a\nsense of why people came there. If movement to this region was\nrecent, they might even interview living people to get clues.\nWhat has been outlined in this section is by no means a full list\nthat shows you every tool a geographer can use. It focused on\nsome of the most common ones, and you’ll et practice with these\nand many more throughout the book.\n20 Section 4\nWhat is Geographic Inquiry?\nQUESTIONS TO GUIDE INQUIRY So far you have learned about what geography is, why you are going study it, and\nwhat tools geographers use. One of the most important things to remember is\n1. What is geography?\nthat just like people in every field, geographers ask questions. Geographers go\n2. Why do we study geography?\nthrough an inquiry process every time they ask themselves a question on\n3. What tools do geographers use?\nsomething that interests us, whether we are aware of it or not. The first step is\nasking the right question. From there, you go out and find the right information.\n4. What is geographic inquiry?\nYou evaluate, sometimes without knowing it,\n5. Why do we need to\nwhether the information is “good” or not, before\nthink globally?\nfinally coming up with your conclusion. These\nare all steps in a good inquiry process.\nGeographic inquiry is no different. For the\npurposes of this book the following process will\nbe used:\n21 Ask a geographic question also use a map that is more zoomed in so you can see more\nspecifically how streets connect a parking lot to the concert site.\nTo begin any inquiry, you need to have a question in mind. If you\nAll of this information helps you as you begin the next stage of\nare having a hard time beating a boss in a video game, you might\ngeographic inquiry.\nask “How do I get past the level 12 boss?” This is certainly a\nquestion you can research, but it probably is not a question a\ngeographer would use. Geographers are going to ask questions\nabout where things happen, what happened, and why it\nhappened. Two geographers headed to a rock concert (music,\nnot stones) might wonder why it costs $15 an hour to park their\ncar in the lot right next to the venue, the place where the concert\nhappens. This is one of those times where economics also\ncomes into play. If they drove several streets over, there might be\ncheaper parking lots. In this case, they may think the answer to\nthis question is “convenience.” The closer you are to your\ndestination, the more expensive it is to park there. To be certain\nhowever, they are going to have to do a few more things.\nAcquire Geographic Information\nOrganize Geographic Information\nThe second step once you have your question is to go out and\nThe date of the concert is approaching and the geographers’\ngather some information. In the rock concert example above, a\nexcitement grows. They do not want to pay too much, however,\ngeographer probably would not look at a world map to figure out\nso now that the question has been asked and they have an\nwhere to park, but if you think back to the geographic tools we\nopportunity to collect some resources, it’s time to explore and\ndiscussed in the previous section, you might look at aerial\norganize that data. As they look through aerial photographs of\nphotographs to see where available parking might be. You might\nthe area to determine the number of parking lots in walking\n22 distance of the concert venue, they also might have received Answer Geographic Questions\ninformation from the city website on how much the parking costs\nFinally, the day of the concert arrives and our geographers are\nat various locations. At this point they may create their own\nready to attend with all of the best knowledge on where to park in\nspecial map which showcases prices. Once this is done, they\nthe city. Not only are they going to attempt to land themselves a\nare ready for the next step.\nparking spot at points three or four on the map so they have more\nmoney for souvenirs, but they conduct a little more geographic\ninquiry to figure out how long it will take them to walk from their\nAnalyze Geographic Information\nparking spot to the venue. They leave secure in the knowledge\nthat they went through the geographic inquiry process to answer\nOnce their map has been assembled with the most up-to-date\nthe important question about why parking so close to the concert\ndata they have available, it is easy to see the available public\nvenue is more expensive.\nparking lots that are the furthest away from location A (the\nconcert venue) are cheaper than the ones located right near the\nvenue. While our example has been relatively simple, sometimes\nit takes a long time to analyze the geographic information that has\nbeen collected and organized in response to a geographic\nquestion. And sometimes, as you get further into the inquiry\nprocess, you might need to return to earlier steps. Perhaps it is\nasking a different question. Maybe you need more information to\nreach your conclusion. Inquiry can be messy, but once you have\nthe right question and the right data, you can move to the final\nstep.\nImage source: Andrey Yurlov, Shutterstock\n23 Chapter 2\nNorth\nAmerica\nQUESTIONS TO GUIDE INQUIRY\n1. Why do people move?\n2. Why would you move?\n3. How do people, goods and ideas move?\n4. Why do people, goods and ideas move?\nImage source: https:\/\/www.flickr.com\/photos\/walkingsf\/5912385701 Section 1\nIntroduction - Movement and North America\nQUESTIONS TO The movement of people, the import and export of\nGUIDE INQUIRY goods, and mass communication have all played major\nroles in shaping our world. People everywhere interact\n1. Why do people\nmove? through movement. They travel from place to place and\nthey communicate. We live in a global village and global\n2. Why would you\nmove? economy.\n3. How do people,\nWhat is movement?\ngoods and ideas\nmove?\nWhat factors push or pull people?\n4. Why do people,\ngoods and ideas\nInteractive 2.1 Movement\nmove?\nPeople interact with\neach other through\nmovement. Because\nwe are social beings,\nwe interact with each\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/\ncommons\/d\/d1\/ other through travel,\nBiswa_Ijtema_Dhaka_Bangladesh_24012010.JPG\ntrade, information and\nLearn more about this theme of\ngeography in this video (requires\npolitical events.\ninternet connection)\n25 What is an example of an idea that moves?\nHow do we depend on people in other places?\nHow do they depend on us?\nWhat resources are where you live?\nWho uses the resources?\nHow could people around the world use these resources?\nThe Geography of North America\nThe landmass of North America lies in the Western Hemisphere.\nIt is bordered by the Arctic to the north, the continent of South\nAmerica and the Caribbean Sea to the south, the Atlantic Ocean\nto the east, and the Pacific Ocean to the west. The land is rich in\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/29\/\nresources like coal, natural gas, oil, timber products, freshwater,\nNorth_America_satellite_orthographic.jpg\nand an abundance of plant and animal species. Renewable\nresources such as wind, water, biomass, geothermal and solar\nare widely used as well.\n26 places, the land narrows and contains a wide variety of\nclimates and vegetation zones for such a small area.\nWith an abundance of fresh water, North America is truly\nblessed. The Mississippi River is one of the world’s major river\nsystems in size, habitat diversity and biological productivity. It\nis the third longest river in North America, flowing 2,350 miles\nfrom its source at Lake Itasca through the center of the\ncontinental United States to the Gulf of Mexico.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/57\/Climatemapusa2.PNG\nThe land is very diverse with a variety of climates, vegetation\nzones and various other geographical features. Due to its latitude\nand longitude, the climates range greatly. Around the Arctic\nCircle, the climate is cold and is home to the Tundra region and\nvery barren land masses covered in snow and ice. Move closer\nto the equator and the climate and vegetation change. Although\nthe elevation varies due to the Rocky Mountains, this region\ncontains the Great Plains, forested and desert regions. In other\n27 Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/57\/Great_Lakes_from_space_crop_labeled.jpg\nThe Great Lakes - Superior, Michigan, Huron, Erie and Ontario -\nare a dominant part of the physical and cultural heritage of North\nAmerica. Shared with Canada and spanning more than 750 miles\nfrom west to east, these vast inland freshwater seas provide\nwater for consumption, transportation, power, recreation and a\nhost of other uses. The Great Lakes are the largest surface\nfreshwater system on the earth. Only the polar ice caps contain\nmore fresh water.\n28 Section 2\nThe First Americans\nQUESTIONS TO GUIDE INQUIRY\n1. Why do people move?\nAs you read this section, think about the following questions.\n2. Why would you move?\n3. What’s worth moving to and\nHow do we know these people moved?\nfrom?\nWhat evidence do we have that they traveled and\nsettled?\nOver 15,000 years ago, a land bridge was exposed in\nthe Bering Sea. During this time groups of hunters and\ngatherers crossed this barren wasteland to follow\nmigrating animals. Many scientists believe that this land\nLearn more about how early\nhumans arrived in North America bridge was the gateway to early settlement in North and\nhere.\nSouth America. The area is still known today as\nBeringia.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/en\/c\/c8\/Human_migration.png\nThis was perhaps the first great movement to the\nAmericas by any group of people. Beringia became a key migration route for\n29 humans, plants and animals. Today, it is a preserve that lies 42 The Solutreans theory began when tools found in Virginia were\nmiles from the Bering Strait. This area of Northeast Alaska and the same as tools found in Western Europe during the Solutrean\nEastern Russia is still home to the ancestors of people today. period. This relatively new information is highly debated due to\nThis heritage lives on in the culture of these people and can cultural characteristics like language and other artifacts found in\neasily be seen in their language, traditions and way of living. Europe.\nArchaeologists have unearthed bones and tools resembling that\nof ancient Europe and are believed to be older than the Bering\nThe following section is a little controversial. After reading and\ncrossing. These tools and remains are much older because the\ndiscussing in class, you can form your own opinion. Is it fact or\nmove would have been from east to west. These people would\nfalse? Why?\nhave moved the shorter distance.\nOther scientists believe there were people who crossed the\nThese theories explain the two movements from early humans.\nAtlantic prior to the Clovis period. These people are thought to\nOver time, these first Americans spread out all over North and\nhave been outcasts or lost seal hunters from south western\nSouth America. They developed their own way of living in the\nEurope. Whether a result of shelf ice detachment or lost hunters\nenvironment they chose.\ntraveling by foot or kayaks, there is evidence that suggests these\npeople moved and settled in what is now present day Nova\nScotia, Canada.\nLike the land bridge people, grasses and animals could have\nenticed these ancient travelers to migrate west and then south\nalong the Atlantic coast of America. These people were the\nSolutreans.\n30 No matter what theory is ultimately\ndeemed possible, these people moved.\nMap of the three migration hypotheses\nQuestions:\nWhy do people move?\nPut yourself in their shoes, what would cause you to move?\n31 Section 3\nThe Vikings\nQUESTIONS TO GUIDE INQUIRY The Vikings\n1. Why do people move?\nHope is both the earliest and the most indispensable virtue inherent in the state of\n2. Why would you move? being alive. - Leif Erickson\n3. What’s worth moving to and from?\nLeif Eriksson was the son of Erik the Red, founder of the first European settlement\n4. What factors push or pull people? on what is now called Greenland. Around A.D. 1000, Eriksson sailed to Norway,\nwhere King Olaf I converted him to Christianity.\nAccording to one school of thought, Eriksson\nInteractive 2.3 The Vikings\nsailed off course on his way back to Greenland\nand landed on the North American continent\nwhere he explored a region he called Vinland. He\nmay also have sought out Vinland based on\nstories of an earlier voyage by an Icelandic trader.\nAfter spending the winter in Vinland, Leif sailed\nback to Greenland, and never returned to the\nThink about this:\nLearn more about the Vikings\nNorth American shores. He is generally believed\nHow different would North America be if Eriksson had exploration of North America with\nto be the first European to reach the North this YouTube video (requires\nstarted a settlement in Vineland?\ninternet connection)\nAmerican continent, nearly four centuries before\nHow would the settlement affect future explorers\nChristopher Columbus arrived in 1492.\nsuch as Columbus, Cortez and others?\n32 Section 4\nThe Europeans\nThe Columbian Exchange refers to the widespread movement of animals, plants,\nQUESTIONS TO GUIDE INQUIRY\nculture, human populations, communicable diseases, technology and ideas\n1. Why do people move?\nbetween the American and Afro-Eurasian hemispheres in the 15th and 16th\n2. Why would you move?\ncenturies. This occurrence is related to European colonization and trade, including\n3. What’s worth moving to and from? the atlantic slave trade, following Christopher Columbus' 1492 voyage.\n4. What factors push or pull people?\nThis process between the two regions moved a large variety of fruits, vegetables\nand domesticated animals between the continents. Side effects included a\npopulation boom in both places and an increase of disease particularly amongst\nWhere are you located?\nNative Americans in the Americas. Traders returned to Europe with maize,\nWhat crops and animals are grown and raised?\npotatoes, and tomatoes, which became very important crops in Europe. Similarly,\nDid they originate there? Europeans introduced manioc and peanut to tropical Asia and West Africa, where\nthey flourished in soils that otherwise would not produce large yields.\nWho brought them to your area?\nThe Spanish\nChristopher Columbus, in the year 1492, sailed to the new world. He was\nsearching for an easier path to the Indies for trade. The lives for millions of\nEast\nindigenous people would be forever changed by this event. This event opened a\n33 The Atlantic Slave Trade\nAfricans were forced onto slave ships, by European countries for\nover 300 years. These people were transported across the\nAtlantic Ocean in horrible conditions. Captain John Hawkins, led\nthe way for the British in the Transatlantic Slave Trade.\nStarting in the late 1400s, Hawkins captured over 1300 Africans\nand sold them in the Americas. The willing buyers were the\nSpanish and Portuguese colonists. As the new world was settled\nand thus more populated, these slave traders supplied British\ncolonies as well. The estimated number of transported slaves\nResearch:\nChoose any fruit to spend a little time researching. Where did it\ncome from?\nHow have domesticated animals changed your region?\nflood\ngate of migration from Europe. Along with the Spanish, Great\nBritain and France became key players in the migration of millions\nof people to the Americas.\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Triangular_trade.png\n34 runs around Movement in North America Today:\n3.4 million.\nPeople, ideas, and products move about Earth. Over the years,\nThe willing people moved by foot, animal, ship and automobile. Their\nbuyers used products moved the same way. Their ideas moved faster and\nthese slaves faster. Each move connected people from place to place. All\nto work on these moves made us who we are today. From the first humans\nfarms and to come to North America by land bridge to the colonists who\nplantations. braved stormy seas. These people moved. Their products\nLaws were moved. Their ideas moved.\nImage source: http:\/\/www.tablespace.net\/maps2\/lowres\/HumanCargo.jpg\npassed\nMultiple factors play into why they\nrestricting the rights of the slaves. Originally, Great Britain set up\nmoved. Were they pulled by desire, Interactive 2.4 Slavery\nports on the coast of West Africa and created a monopoly in the\nToday\nfood or just the curiosity as to what\nslave trade. Only British ships could dock there and transport\nis on the other side of the horizon?\nslaves from these ports. Policies like this created interlopers.\nWere they pushed like the slaves on\nInterlopers were illegal slave transporters who traded Africans at\nthe slave ships? Slaves were\ndiscounted prices. This caused a loss of profits, created less\nphysically forced to move\npopulated ports and lowered prices for the British crown.\nIn March of 1807, The United States and the British signed acts\nthat prohibited the transportation of slaves. This did not abolish\nDoes slavery still exist today?\nslavery by any means; it just restricted the transportation of Learn more with this article from\nthe Washington Post\nAfricans as slaves. Over the next couple hundred years the\nmovement of people by illegal means posed serious international\nproblems. The abolition of the slave trade was not internationally\nrecognized until 2001.\n35 Section 5\nMovement in North America Today\nQUESTIONS TO GUIDE INQUIRY Moving People\n1. Why do people move?\nHistorically speaking there are many reasons why people move TO North America,\n2. Why would you move? but what does movement IN North America look like today?\n3. What’s worth moving to and from?\n4. What factors push or pull people?\nPeople move. You’ve already learned about push\/pull factors. Sometimes people\nand families move because of jobs and opportunities elsewhere. This kind of\nmovement could be across a town, a state, a region, a country, or in between\ncountries.\nMovement of people can take place in a variety of ways. You’ve already read a\nlittle bit about historical methods of bringing people from place to place. Early\nmigrations took place on foot. European migrations began on ships. Today\npeople move in many ways. They can still travel on foot and on ship, though cars,\nbusses, trains, and planes have all made the speed at which people can travel\nmuch faster.\n36 Take a moment to look at the map below.\nLet’s pretend you live at\npoint 1 on the map and\nyou and your family are\nmoving to point 2.\nBased just off of this\nmap, trace your finger\nover the route you might\ntake to get there.\nDo you draw a direct\nline connecting the two\npoints? Do you travel\nsouth first and then\nmove west? What\nmethod of travel is\nbest?\n37 It is difficult to answer some of those questions without some 1. Determine the distance of the route you decided to\nmore information. Therefore, in practicing the skills of a travel on the previous map.\ngeographer, here is a second map.\n2. Calculate the number of hours this trip would take by\ncar by dividing by 60\n3. Will this change how you move from Point 1 to Point 2?\nWhy?\nImage source: http:\/\/st.hist-geo.co.uk\/img\/usa-48\/USA-48-Etats-1.png\nYou can see now that with a map scale added you can tell the\ndistance between the two locations. Using a ruler or other\nmeasuring device, do the following:\n38 You may choose to drive to this location still, but doing so will\nprobably require that you drive anywhere between 18-24 hours\ndepending on the route you chose, and assuming of course that\nthere are actually roads that lead to this location on the route you\ntraced with your finger.\nTo make certain you can actually travel this route by car, you need\nto make certain that there are actually roads that get you there.\nThe fastest way will be to utilize the major United States highway\nsystem map. Using this map, are you still able to make the trip\nalong your original route?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/27\/Interstate_Highway_System_Map.jpg\nWhat are some reasons there might be fewer highways in\ncertain places?\nThere is still one other thing to consider in this simulation. Even\nwith the highway system in place, might movement from Point 1\nHow does your answer to the previous question possibly\nto Point 2 be difficult at times? To get one answer to that\nrelate to movement?\nquestion, you might want to take a look at yet another map.\n39 there were train or bus routes that could get you there, though\nthat method of travel would add length to your time.\nLooking back at the maps, could you take a boat from Point 1\nto Point 2?\nDepending on where and how a person wants to move, the trip\ncould be easy or difficult. Right now a person in North America\ncould move almost anywhere on\nInteractive 2.5 Road from\nthe continent and to places in Latin\nUS To Europe\nAmerica by car with varying\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c8\/ReliefUSA_map.gif\ndegrees of ease. If someone\nwanted to drive from New York to\nLondon England however, they\nwould be unable to do so right\nnow. Learn more about how the\nThis map is a map that depicts the major mountain ranges of the\ncountry of Russia would like to\nUnited States. You can see from this map that Point 2 requires\nsolve that problem in the future at\ntravel through mountains. If you’re driving in an old car without\nthis website.\nenough power (and carrying your belongings in the back seat!)\nyour trip might end up being a little difficult in certain places.\nThat isn’t to say that you couldn’t fly there. That trip would be\nmuch shorter and probably less expensive. You might also see if\n40 Moving Products The short answer to the questions you were asked above might\nbe “food” and “my parents bought it.”\nThat food however came from somewhere. Sometimes it came\nfrom multiple places. While it is true that people travel to a store\nand purchase groceries, the movement of that product from the\nstore to their home is only one step in a longer journey.\nIf you had cereal for breakfast, it’s possible you used a brand that\nwas created in Michigan by Kelloggs, which made $14.8 billion in\nrevenue in 2014. Kelloggs foods has their headquarters in Battle\nCreek Michigan, and their cereals are manufactured and sold\nworld wide. The factory in Battle Creek, as well as others around\nthe country and world produces many kinds of cereal which you\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/a3\/Froot_loops_in_a_bowl.jpg\nmay have eaten this morning.\nWhat did you have for breakfast this morning?\nSome might be tempted to say that the journey of the product\nHow did that breakfast make its way to your kitchen? from the store to a home begins at the factory, but that is still not\nthe case. All of the parts of a product, such as ingredients for\nmaking cereal, come from places outside of the factory. It could\ncome from local sources, or much farther away - across a state,\nthe country, or even the world.\n41 Activity - Use the internet to find the ingredients in one\nbreakfast cereal of your choice. Then, pick any three\ningredients (such as rice, sugar, or salt) to find out where in\nthe United States these materials might come from. If it\ndoes not come from the United States, where else might it\ncome from? How might those ingredients “move” to the\nfactory in which they are processed and turned into cereal?\nThe journey of an ingredient for cereal could begin\nhundreds or thousands of miles away from your house. If\nyou live in Michigan however, it is quite possible that they\nmade their way to Battle Creek to be made into your\nbreakfast this morning.\n(image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/20\/Warehouse_of_Grupo_Martins_in_Cama%C3%A7ari_(Brazil).jpg)\nstill moved. If your family purchases an American made car from\nIt doesn’t necessarily matter where your cereal was created.\nFord, GM, or Chrysler, the parts came from all over the world, and\nOften times after production it is taken to centralized warehouses\nit’s possible that it wasn’t even assembled in the state that you\nwhich deliver the products to many regional stores. The goods\nlive in.\ntravel over land and by air depending on the distance they must\ntravel.\nFrom apples to cars, to the breakfast you ate this morning, the\ntheme of movement is taking place all across your town, your\nAll goods and products move in this way. If your family goes to a\nstate, the country, and the world.\nlocal farmers market and purchases apples, the journey from the\nfarm to you may have been a relatively short one, but the product\n42 Moving Ideas Fast forward a thousand years and communication became\nfaster. The telegraph was invented in the 1830s. People could\nPeople and products move constantly, but a third major type of\nnow send a message to someone across a large distance much\nmovement also exists. The third type of movement is the\nfaster, though it still required people to both send and receive the\nmovement of ideas. Prior to the 1830s, movement of ideas could\ntransmission, decode it, and deliver it to a recipient. The\nbe very slow. To communicate across vast distances people\ntelegraph did however make the spread of information and ideas\neither had to travel to a place themselves or send a letter which\nmuch faster.\ncould take days, weeks, or months to arrive at their final\ndestination.\nJust forty years later, the telephone was invented. For the first\ntime people could communicate with their voice over large\nWhile you will learn more about the major religions of the world in\ndistances. This also helped ideas and information spread faster.\na later chapter, the spread of religion around the world can be\ntraced to an idea called cultural diffusion, the spread of beliefs\nand activities from one group to another. In ancient times\nAs faster methods of travel became available, this also led to a\nreligions such as Christianity, and Islam spread along trade\nfaster spread of information.\nroutes, with places in the world adopting the incoming religion,\nand others taking pieces of it which mixed with local customs.\nWhen people moved from one region to another to trade goods,\nToday however, many people carry a phone in their pocket which\ntheir customs came with them and often times spread. This was\nallows them to communicate with people all over the world\nnot a process that happened overnight, rather, it took a great deal\ninstantaneously. That phone isn’t just used to send your voice.\nof time. The fastest methods of communication generally\nMany phones come equipped with cameras allowing easy face\ninvolved people traveling long distances over long periods of\nto face communication. You can text a message, a picture, or a\ntime.\nvideo to friends almost anywhere in the world and they can\nreceive it within seconds.\n43 People today can even communicate with people they have chose connects\/connected\nnever, and will never meet. Social media - things like Twitter, people during that time period.\nFacebook, and YouTube allow you to broadcast yourself to the\nworld.\nAn aspiring musician might make a video on their phone of them\nplaying an original song in their basement or bedroom. They\nupload that song to a place like YouTube and some of their\nDescribe how a “tweet” on Twitter, or a Facebook status\nfriends and family might view it and share it with their wider circle.\nupdate represents movement of an idea.\nA few weeks later it might have been viewed in all fifty states. A\nfew months later, if the song was popular enough, it might make\nits way outside of the country. Some musicians have been\ndiscovered by record labels this way and offered recording\nReturn to your interactive journal and describe three\ncontracts. What begins as a song recorded in a basement in\nimportant things you have learned about movement in this\nRoscommon Michigan could become a hit in Tokyo Japan if the\nchapter.\nconditions are right.\nThe movement of people, goods, and ideas is constantly taking\nplace. You’ll learn more about how people, goods, and ideas\nmove in later chapters of this book.\nUse the infographic at this website to research a method of\ncommunication through the ages. Explain how the method you\n44 Chapter 3\nLatin\nAmerica\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society,\ninterconnected?\n2. How do people’s actions impact the world?\n3. How does the environment affect human behavior and\nactions? Section 1\nHuman\/Environment Interaction in Latin America\nIntroduction\nQUESTIONS TO Latin America\nGUIDE INQUIRY Interactive 3.1 More About\nThe area known as Latin America is\nLatin America\n1. How are we, as\nmade up of the region south of the\nmembers of a\nglobal society, United States, beginning at the river\ninterconnected? that separates the U.S. from Mexico,\nthe Rio Grande’, and extending to the\n2. How do people’s\nactions impact southern tip of South America, an area\nthe world?\nknown as Cape Horn.\n3. How does the\nThis region includes Mexico, Central\nenvironment This video created by a teacher\nfor his class gives an overview of\naffect human America, South America and the\nLatin America and many of the\nbehavior and\nImage source: http:\/\/en.wikipedia.org\/wiki\/Latin_America#\/media\/ islands of the Caribbean Sea. things you’ll study about in this\nactions? File:Latin_America_%28orthographic_projection%29.svg section.\nLatin America is home to 23% of the\nworld’s forests and 31% of its freshwater. Despite a wealth of resources, the\nregion’s population growth and the way in which people have used the land\naround them, have led to the destruction of many of these resources.\nAs the population continues to grow, a major challenge becomes finding safe\nwater and ways to maintain sanitation in towns and cities. Pollution, both in the air\nand water (freshwater, oceans, and seas) is also a major problem confronting the\npeople of Latin America. In some areas, competition over scarce resources has\n46 led to social and environmental conflicts. These then Latin America is a great place to study this\nInteractive 3.2 Rain Forest\npose a risk to the lifestyles of all who live there. Threats theme. Humans interact both positively and\nnegatively with the environment around them.\nThe Theme of “Human-Environment Interaction”\nFor example, when humans dam a river, there\nare consequences, both good and bad.\nIf you look back to the second and third questions\nthat guide this chapter: “How do people’s actions\nYou will study some of these consequences\nimpact the world?” and “How does the environment\nthroughout this chapter.\naffect human behavior and actions?” you’ll begin to\ndiscover what the geographic theme of “Human-\nThis short article from National\nEnvironment Interaction” means. Geographic will give you a little\nbackground information on an\nissue you might choose to study\nThe theme of Human-Environment interaction is an\nfurther in this chapter.\ninteresting one to explore because its roots are not\njust planted in geography. It runs through all of the social studies\ndisciplines. It is a part of history, economics, and civics as well as Interactive 3.3 Interactive\nJournal\ngeography and the sciences. Here’s an example from early\nhistory:\nHumans have learned over time how to adapt to the environment\naround them and how to modify it to suit their needs. Most early\npermanent settlements sprang up around sources of water. In\nsome of these places humans began to modify the environment\naround them so that they could settle in large regions around\nPlease note: once you have\nwater. An early form of humans interacting with the environment\ncreated your own copy of this\nwas irrigation which allowed water from these major water document, this widget will only\nreturn you to the blank copy. You\nsources to be brought in to surrounding farms to provide food for\nwill need to access yours by\npeople. opening from your own Google\nDocument.\n47 Section 2\nPhysical Geography - Mexico\nQUESTIONS TO GUIDE INQUIRY Mexico & Central America Mexico and the nations Interactive 3.4 Google\nMaps - Mexico\nof Central America make up the southern portion\n1. How are we, as members of a global\nsociety, interconnected? of the North American continent.\n2. How do people’s actions impact the world?\n3. How does the environment affect human The Geography of Mexico\nbehavior and actions?\nMexico is bordered by the United States to its\nnorth, with the Rio Grande dividing much of the\ntwo countries. The Gulf of California and the\nUse this interactive widget to\nzoom in on and see the physical\nPacific Ocean lie to the west of Mexico,\ncharacteristics of Mexico.\nGuatemala and Belize are found to\nthe south, and the Gulf of Mexico and the Caribbean lay to its east.\nMexico is a land with a wide range of geographical features\nranging from swampy areas and tropical forests to arid deserts\nand high mountain ranges.\nCentral Mexico is mainly a plateau which has mountain ranges on\nboth sides. The northern area of the plateau is very arid and makes\nup nearly 40% of the total area of country. The two main mountain\nranges found in Mexico are the Sierra Madre Oriental and the\nSierra Madre Occidental. Volcanoes and smaller mountain ranges\nImage source: http:\/\/www.earthchronicle.com\/ECv1\/Atlas\/Images\/AmericaSRTM-CentralLarge-picasa.jpg\n48 can also be found in southern areas\nInteractive 3.5\nof Mexico. The appearance of the Earthquakes in Mexico\nWhat characteristic of Mexico’s geography do you think is\nmany mountains and volcanoes, as\nthe biggest challenge for the people living there? Use\nwell as earthquakes is due to\nevidence to support your claim.\nMexico’s placement along the\nwestern edge of the North American\ntectonic plate. Actually, Mexico is\nlocated at a place on the earth\nwhere three different tectonic plates\nFind the most recent data for\ncome together. The movement of\nearthquakes in Mexico using this\nwebsite.\nthese plates causes a great deal of\ngeographic activity in Mexico.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ad\/\nWorld_tectonic_plate_map_large.png\n49 Section 3\nPhysical Geography - Central America\nQUESTIONS TO GUIDE INQUIRY Central America Interactive 3.6 Google\nMaps - Central America\n1. How are we, as members of a global\nCentral America is often referred to as its own\nsociety, interconnected?\nregion, but it is actually the southern portion of the\n2. How do people’s actions impact the world?\nNorth American continent. There are seven\n3. How does the environment affect human countries in this region which you can see on the\nbehavior and actions?\nembedded Google Map: Belize, Costa Rica, El\nSalvador, Guatemala, Honduras, Nicaragua,\nand Panama.\nUse this interactive widget to\nzoom in on and see the physical\nEven though Central America is a relatively\ncharacteristics of Central America.\nsmall area, its physical geography is very\ndiverse. In some places it is very high, like\nthe volcanic mountains and highlands.\nUsing the Google Map and the\nThere are also lowlands covered in\nmap on this page, describe\nrainforest and dry savanna areas.\nCentral America’s location in\nthe world.\nCentral America contains rugged\nmountains and diverse amounts of\nvegetation. It is located near two oceans - both the Atlantic and the\nPacific.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/94\/\nCIA_map_of_Central_America.png\n50 With natural hazards such as volcanic activity, earthquakes, and\nhurricanes, Central America is the site of many natural disasters.\nThe volcanic activity results in eruptions and earthquakes. The\nclose location to the oceans make the area vulnerable to\nhurricanes. In the past. Hurricanes and the floods that often\nfollow can have a devastating effect on the lowland areas. In\nDecember of 1998, Hurricane Mitch struck Central America\nleaving thousands dead and even more homeless.\nHow do natural disasters often result in people in\nour global society becoming interconnected?\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ae\/Sierra_Madre_Occidental.jpg\nThe major landform in Central America is the Sierra Madre\nmountain range. These rugged mountains extend through the\ncenter of Central America, running from Mexico in the west\nthrough the center of the region. Some of these mountains rise\nas high as 14,000 feet, with the highest being found in\nGuatemala. On each side of these highlands are coastal lowlands\nthat run along the Atlantic and Pacific coasts. The lowlands are\ngenerally hot and humid, while the highlands are cool and\nrelatively dry. There is also an active belt of volcanic mountains\nwhich runs along the Pacific coast from Mexico all the way down\nto Costa Rica.\n51 Section 4\nPhysical Geography - South America\nQUESTIONS TO South America Interactive 3.7 Google\nMaps - South America\nGUIDE INQUIRY\nSouth America is the\n1. How are we, as\nfourth-largest continent in\nmembers of a\nglobal society, the world. It can be\ninterconnected? divided into three\nphysical regions:\n2. How do people’s\nactions impact mountains\/highlands,\nthe world?\nriver basins, and coastal\nUse this interactive widget to\n3. How does the plains. Because of the\nzoom in on and see the physical\nenvironment\nvariety of geographic characteristics of South America.\naffect human\nfeatures on this continent,\nbehavior and\nthere are a large number of biomes, regions of the world\nactions?\nwith similar climate, animals and plants, found here.\nThe deserts of the coastal plains rise up to meet the\nmountains of the Andes. The river basin of the Amazon\nhas a dense, tropical rain forest, while the basin of\nanother major river, the Prana, is made up of Grassland.\nWith this great variety, there is a large number of plant\nand animal species, making South America stand out\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/51\/ 52\nSouth_America_laea_relief_location_map.jpg among the other continents of the world. Highlands are also a major feature of South America. The\nAltiplano (“high plain”) of Peru and Bolivia stands out at an\nMountains & Highlands\nelevation of about 12,300 feet. Marked by cold, windy weather,\nfew trees survive here. The dominant vegetation is simply grass\nThe major mountain system in South America is the Andes\nand shrubs. The northern area receives enough rainfall to grow\nMountains, with a length of about 5,500 miles, which makes it the\ncrops, whereas the southern half receives relatively little rainfall.\nworld’s longest mountain range. The Andes sit on the western\nside of the continent and stretch from its southern tip to its\nnorthern coast. The highest mountain peak in the Andes is\nAconcagua, which is 22,841 feet tall, making Aconcagua the\ntallest mountain outside Asia.\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Romanceor_Altiplano_1.jpg\nImage source: http:\/\/simple.wikipedia.org\/wiki\/Andes#\/media\/File:Andes_70.30345W_42.99203S.jpg\n53 The southern portion of South America is known as Patagonia. River Basins\nThis region of Argentina and Chile consists of lower-elevation\nplateaus and rugged glaciers. The Argentine side features arid\nsteppes, grasslands and deserts, while the western side found in\nChile has glaciers in the mountains and even rainforests.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f6\/Amazon_rainforest.jpg\nSouth America has three major river basins: the Amazon,\nImage source: Patagonia http:\/\/en.wikipedia.org\/wiki\/Santa_Cruz_Province,_Argentina#\/media\/ Orinoco, and the Paraná. The Amazon River basin covers nearly 3\nFile:Landschaft_von_Patagonien.jpg\nmillion square miles, making it the largest watershed in the world.\nIt is also the world’s second longest river, stretching nearly 4,000\nmiles.\nIt begins in the norther part of South America and includes\nsmaller river tributaries that come from the glaciers of the Andes.\nThe Amazon River is the heart of the Amazon rain forest, which is\nthe world’s largest tropical rainforest and makes up about half of\n54 the total rainforests found in the world . It covers about 40% of\nSouth America and is spread over nine different countries. Investigation: Head to Google to investigate some of the plants that\nmake their home in the Amazon and find ways people have used these\nThe Amazon Rainforest is invaluable to the health of the planet as\nplants.\nit provides about 20% of the world’s oxygen and absorbs an\nequal amount of carbon dioxide.\nNowhere else on Earth is there\nInteractive 3.8 The World\nWildlife Fund - Amazon the same kind of diversity of\nRainforest\nanimal life like there is in the\nAmazon Rainforest. There are\nmore than 2 million species of\ninsects, a large variety of animals\nthat include many different\nprimates, and thousands of\nnative birds such as macaws,\nparrots and toucans.\nLearn even more about the\nAmazon, including some of the\nthreats at this website from WWF.\n55\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/62\/\nAmazonian_rainforest.JPG The Paraná River basin is not as large as the Amazon, but is over Coastal Plains\n1 million square miles. It covers much of southeastern Brazil as\nThe coastal plains of South America are found on the\nwell as Bolivia, Paraguay, and northern Argentina. The Paraná\nnortheastern coast of Brazil on the Atlantic Ocean, and the Pacific\nRiver basin supplies water to the large plains found in the\nOcean coast of Peru and Chile in the west. The coastal plains are\nsouthern portion of South America, known as the Pampas. The\nvery dry, with the Brazilian Highlands blocking the sea winds\nPampas have rich, fertile soil and predictable rainfall patterns.\nfrom the Atlantic, and the Andes Mountains blocking out the\nThis makes the area important for ranching and farming.\nmoisture coming in from the Pacific. The Atacama Desert is part\nThe Orinoco River originates in the highlands of northern Brazil of the coastal plain in the west. It is considered the driest desert\nand empties into the Atlantic Ocean in Venezuela. The basin region in the world, receiving less than a half inch of rainfall a\ncovers an area of about 366,000 square miles. There is a vast year. While the Atacama has few plants and animals found in the\ngrassland region (savanna) known as the Llanos that is found in region, it is a main source of copper which is important to the\nthis area. The Llanos is a great habitat for many bird species, as economy\nwell as many different aquatic river species like the piranha, of Chile. Do you think people live in the Atacama Desert? Why or\nelectric eel, and the crocodile. why not?\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/08\/Birds_eye_view_of_the_Chajnantor_plateau_in_Chile's_Atacama_Desert.jpg\n56 Section 5\nPhysical Geography - The Caribbean\nQUESTIONS TO GUIDE INQUIRY The Caribbean\n1. How are we, as members of a global Interactive 3.9 Google\nThe Caribbean Sea is home to over 7,000\nsociety, interconnected? Maps - The Caribbean\nislands, thirteen of which are independent\n2. How do people’s actions impact the world?\nnations. This area is very diverse in terms of its\n3. How does the environment affect human physical geography. Many of these islands are\nbehavior and actions?\nprimarily the result of volcanic activity. There are\nhowever few active volcanoes today. One well\nknown volcano that has been active recently is\nMt. Soufriere of Montserrat. After 365 years of\nlying dormant, it erupted in 1995 and has been Use this interactive widget to\nzoom in on and see the physical\nthe site of on-going volcanic activity ever since.\ncharacteristics of the Caribbean.\nVarious other islands of the\nCaribbean are known to\nexperience various forms of\nvolcanic activity, even the island of\nTrinidad has small volcanoes. Most\nof the non-volcanic island found in\nthis area are coral islands that\nformed from the coral reefs found\nthroughout the Caribbean.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/85\/\nCIA_map_of_the_Caribbean.png\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/7b\/57\nSoufriere_Hills_Volcano.jpg Hills & Mountains where runoff rainwater is collected. Trinidad is home to two major\nswamps, the Nariva and the Caroni.\nWith most of the main islands of the Caribbean being volcanic\nislands, many are very hilly and mountainous. The largest Rainforests & Desert\nmountain ranges in the Caribbean include the Northern Range of\nRainforests are commonly found in South America, but they are\nTrinidad and the Blue Mountains of Jamaica. Many of these\nalso found on some of the islands of the Caribbean such as\nranges in the Caribbean are covered by rainforests and provide\nJamaica and Puerto Rico. Rainforests add to the diversity of the\nan extensive variety of vegetation and wildlife. Because of the\nflora and fauna of these islands. In contrast to these lush areas, a\nmountainous and hilly nature found in the lands of the Caribbean,\nnumber of islands are also found to be very arid, almost desert\nmany islands have little to no flat land leading up to these\nlike. Some of these islands include Aruba, Bonaire, Curacao and\nmountainous areas. This results in the formation of swamps\nGrand Turk. Even though these islands are surrounded by water\nthey receive relatively little, or sporadic, rainfall. Islands such as\nthese have areas that are very rugged and dry. The plant life on\nthese islands often\ninclude scrub\nvegetation, and even\ncactus.\nDue to the dry\nclimate, cactus can\nbe found in many\nareas on Aruba.\nArikok National Park, Aruba\nImage source: http:\/\/en.wikipedia.org\/wiki\/Arikok_National_Park#\/media\/\nPhoto credit: Brian Dufort File:Arikok_NP.jpg 58 Section 6\nHistory - Early Civilizations\nQUESTIONS TO GUIDE INQUIRY So far a great deal of attention has been paid to the\nInteractive 3.10 Interactive\nPhysical Geography of the region. As you go through\n1. How are we, as members of a global Journal\nsociety, interconnected? the next few sections of this text dealing with history,\nthink about how humans interacted with their\n2. How do people’s actions impact the world?\nenvironment.\n3. How does the environment affect human\nbehavior and actions?\nEarly Civilizations\nThe cultivation of crops in the Americas first began\nnear present-day Mexico City around 5000 B.C.E.\nPlease note: once you have\nOriginally these crops were an addition to the hunting\ncreated your own copy of this\nand gathering that was done by these early people. document, this widget will only\nreturn you to the blank copy. You\nBy 3000 B.C.E. these people began to rely more\nwill need to access yours by\nopening from your own Google\nheavily on agriculture. This development spread to\nDocument.\nthe other hunter-gatherers societies found in south\nAmerica.\nHow are humans interacting with the environment when practicing agriculture?\n59 Many important early civilizations developed in this area, flourished around the time of the ancient Greek civilizations and\nincluding the Olmecs, Zapotecs, Teotihuacanos, Mayas and the Trojan War. The rise of the Olmecs marked the beginnings of\nAztecs. These cultures developed complex societies, achieved civilization in Central America. Centuries later the oldest\nhigh levels of technological advancement, developed complex civilization in South America developed in what would become\narchitecture, and shared many cultural aspects. Peru.\nThese ancient civilizations would rise and fall, eventually being\nreplaced by the three great civilizations of Latin America: the\nMaya, the Aztecs and the Inca.\nThe Maya Interactive 3.11 Pyramids\nin Mesoamerica\nThe Mayan civilization was at its\nheight from approximately 250 C.E.\nuntil 700 C.E. The Mayan civilization\ndeveloped a written language,\nunderstood advanced mathematics\nand had an extensive knowledge of\nMap of Mesoamerica, showing locations of cities and historical sites Image source: http:\/\/ astronomy. They even developed a\nwww.lib.uci.edu\/about\/publications\/exhibits\/meso\/images\/3.jpg Follow this link to view a\ncalendar based on their\nslideshow of the pyramids of\nastronomical observations. The Mesoamerica:\nWith the establishment of agriculture, groups of early Americans\nMayans were also very skilled\nbegan to develop more advanced societies. The earliest\narchitects, building large stone pyramids and well developed\ncivilization in the Americas first developed along the coast of the\nlarge cities.\nGulf of Mexico around 1200 B.C.E. This was the Olmec\ncivilization which flourished around the time of the ancient Greek\ncivilization and the Trojan War. They were a civilization that\n60 Mayan Calendar it was most likely a combination of these events. Although the\ncivilization collapsed, the Mayan people still can be found living\nsouthern Mexico and into Central America.\nInteractive 3.12 The Fall of\nthe Mayans\nFollow this link to read a National\nGeographic article about different\npossible reasons for the fall of the\nMayan civilization. Which one do\nPart of the Mayan Long Count Calendar included dates written out as five hieroglyphs separated by four\nyou think is correct? Record\nperiods. Photo credit: LiveScience\nwhich theory you believe, and\nwhy, in your Interactive Journal.\nStarting around the year 700 C.E., the Mayan empire began to\nexperience a decline . Archeologists are not sure why this\nhappened, although some theories as to why include epidemics,\nearthquakes, drought, and warfare. Many researchers believe\nthat\n61 The Aztecs\nThe Aztecs appeared in\nInteractive 3.13\nMesoamerica sometime in the\nIn what ways did the Aztecs interact with the environment?\nTenochtitlan\nearly 13th century. Before then,\na group of people known as the\nToltecs dominated the area. The The Inca\nAztecs arrived as the Toltecs’\nThe Inca Empire began small, as a group that lived in a village in\ninfluence was on the decline.\nthe Andes Mountains. When there was an attempt by another\nPerhaps the Aztecs were\ntribe to conquer them around the year 1200 C.E., the Inca were\nsomewhat to blame for this\nable to fight off their attackers and emerge victorious. From that\ndecline. They built their capital Learn more about Tenochtitlan at\nthis academic website. time on, it would be the Inca that looked to expand their territory\ncity near Lake Texcoco in what\nand grow an empire. Over the next 100 years, the Inca conquered\ntoday is central Mexico. The Aztecs drained the swampy land\nmany different tribes throughout\nsurrounding the lake and built artificial islands in the lake on\nInteractive 3.14 The Inca\nSouth America. The Inca Empire\nwhich they established the beginnings of their capital city. This\nwould grow to stretch nearly the\ncity, established in 1325 C.E., is known as Tenochtitlán. The city\nentire length of the western side of\nhad around 200,000 inhabitants at one point, making it the third\nSouth America, becoming one of\nlargest city in the world at that time.\nthe largest empires in the world.\nThe Aztecs developed a complex system of agriculture, which\nThe Inca had a well-developed\nincluded irrigation practices, to support their civilization. Crops\ncivilization. They built a strong\ngrown by the Aztecs included corn, beans, squash, and potatoes.\nWatch this video (requires internet\ncentral government, and had an\nconnection) for an explanation of\nThey also built a powerful military. These two developments\nhow the Inca built their empire.\nequally strong army. They built\nallowed them to conquer other native peoples around them, What examples of human-\nroads, bridges and aqueducts to environment interaction do you\nspread their influence, and build a strong empire.\nsee?\ncarry water to their cities. The Incas\nalso kept official records with a\n62 device called the quipu, which means knot. This was a cord beans and peanuts. The potato was especially important as it\nwhich had a series of smaller colored strings attached to it on could easily grow in the poor mountain soil and survive the cold\nwhich knots were tied. As no South American culture had any temperatures.\nsystem of writing at this time, this record keeping system was a\nmajor development for the Inca and allowed them to save and\nsend information in a much easier and reliable manner than\nsimple word of mouth.\nThe Inca also developed terrace farming in order to adapt to the\nsharp mountain slopes and make farming possible in the\nmountains. The Inca were so organized that they had stockpiles\nof food that could be distributed to the people when times of\ndrought occurred and crops failed. Many of the foods we eat\ntoday were developed and grown by the Inca, such as; potatoes,\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/eb\/Machu_Picchu,_Peru.jpg\nWith their well-developed society, strong\nInteractive 3.15\nmilitary, agricultural practices and engineering\nInteractive Journal\naccomplishments, the Inca continued to grow\nin power and influence. The Inca maintained\ntheir dominance in South America until the\nSpanish conquistadors arrived and defeated\nthem in 1533.\nPlease note: once you\nhave created your own\nReturn to your interactive journal. Describe\ncopy of this document,\nways ancient civlizations adapted to and this widget will only\nreturn you to the blank\nchanged their environment?\ncopy. You will need to\naccess yours by\nopening from your own\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/71\/Pisac006.jpg 63\nGoogle Document. Section 7\nCulture\nQUESTIONS TO GUIDE INQUIRY Latin America is home to about 525 million people who live in 33 different\ncountries. The region’s population includes Native Americans, Europeans,\n1. How are we, as members of a global\nsociety, interconnected? Africans, Asians, and mixtures of these groups. It is a unique blending of cultures\nthat has been influenced by both the native population and by the establishment\n2. How do people’s actions impact the world?\nof colonies by the European nations of Spain and Portugal. Marriages between\n3. How does the environment affect human\nEuropean colonists and native populations established what is called the Mestizo\nbehavior and actions?\nclass. Mestizos are people with a mix of both indigenous and European ancestry.\nToday, mestizos make up a large portion of the population of South America.\nAnother factor influencing the cultural landscape of South America was the\nimportation of enslaved Africans. Most of these Africans were brought to Brazil,\nand it is their cultural practices, mixed with native and European beliefs that\ncreated a unique cultural landscape that can be seen in cultural traits such as\nmusic, dance and foods. Religion remains the backbone of many South American\ncultures. While Catholicism, the official religion of both Spain and Portugal at the\ntime of colonization, dominates the continent, there are other spiritual beliefs that\nhave had an influence on other social activities.\nThe Day of the Dead Festival, or Dia de los Muertos, is a Mexican festival\ncelebrating the reunion of dead relatives with their families. This festival occurs\neach year on November 1st (All Saints Day) and 2nd (All Souls Day). The origins of\nthe festival come from the ancient native peoples who believed that the souls of\n64 the dead return each year to visit with their living relatives, and\nto eat, drink and be merry. With the arrival of the Spanish,\ncertain Christian beliefs were brought into the festival. Today’s\npractice calls for all of the deceased children to be remembered\non November 1st, All Saints Day with toys and colorful balloons\nadorning their graves. The next day, All Souls Day, adults who\nhave died are honored with displays of their favorite food and\ndrinks, as well as ornaments and personal belongings. Flowers\nand candles are placed on the graves and are supposed to\nguide the spirits home to their loved ones. Other parts of the\ncelebration today include; the pan de muerto (a coffee cake\ndecorated with candy bones), skull-shaped candies, paper\nmache’ skeletons and skulls. Today, these symbols and other\nitems fill shops and candy counters in October. During this time,\nhomes are often decorated in the same manner as the graves. Giant Parade Float, Carnival, Brazil http:\/\/mrfoster.blog.hu\/2015\/02\/22\/a_leggyonyorubb_jelmezek_amiket_el_tud_kepzelni\nAnother distinct cultural example is the gaucho (or “cowboy”).\nThe Carnival of Rio de Janeiro in Brazil is a festival that is held\nThis cultural group was developed in the Pampas of South\nevery year before Easter. It is an example of a religious\nAmerica. In the 1700s, gauchos hunted the herds of wild horses\ncelebration that has also become a popular social event. The Rio\nand cattle that had been roaming freely on the open grasslands.\nCarnival is the largest carnival event in the world, attracting\nMuch like the famous cowboys of America, the gaucho was seen\nmillions of tourists.\nas free-spirit and became the focus of many songs, stories, and\nfilms. The gaucho culture still exists today, especially in Argentina\nand Uruguay.\n65 As the growth of industries, railroads and the expansion of trade\nbegan to bring new wealth to the upper classes, a new middle\nclass began to form in the newly developing cities. But a vast\nmajority of Latin Americans, especially those living in the rural\nareas, saw little to no progress being made in the condition of\ntheir lives. The gap between the rich and the poor grew and led to\nunrest among farmers and workers. By this time, many of the\nnations of Latin America were controlled by military dictators, and\nit was these governments that resisted demands for reform. In\nmany cases, the military was used to put down these uprisings.\nThis trend continued well into the next century.\nIn 1959, a revolution in Cuba was led by Fidel Castro. The Cuban\npresident Fulgencio Batista was a military dictator who had the\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Gaucho_in_action.jpg\nsupport of the United States because of his friendly policies\nPolitical Geography\ntowards the U.S. He was however unpopular in Cuba due to his\ncruel tactics in dealing with the Cuban people. After Castro’s\nDuring the 1900s, the nations of Latin America experienced major\nvictory and take-over of the island nation, he set up a communist\npolitical and social changes. Slowly, control by European nations\ngovernment. The United States feared that communism would\nbegan to decline, but they were replaced by the United States as\nthat nation began to influence the area more. An example of this continue to spread throughout the region. Hoping to destroy the\nis the creation of Panama as an independent nation. Panama won communist presence, the U.S supported other various military\nits independence with the support of the United States, and once dictatorships throughout the region that opposed the communist\nit became an independent country in 1903, Panama quickly governments. Over the next few decades, Latin America would\nsigned a treaty with the U.S. giving it the rights to control what continue to be the site of conflict between these competing\nwould become the Panama Canal Zone. factions.\n66 These dictatorships were often brutal, and thousands of\npolitical prisoners were arrested. Although communism\nremained in Cuba, by the 1990s many of the military\ndictatorships that had been in power were replaced with\npeople elected through a democratic voting process. The\ntransition hasn’t been an easy one as the nations of Latin\nAmerica struggle to replace governments that had been run\nby one man with ones elected by the people and rely on the\ndemocratic voting process to make decisions. Today Latin\nAmerican countries are working to end corruption within their\ngovernments and bring economic stability.\nBelow are political maps of the regions of Latin America\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d8\/\nMap_of_Central_America.png\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/98\/Caribbean_general_map.png\n67\nImage soruce: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/\n7\/70\/%22Political_South_America\n%22_CIA_World_Factbook.jpg Section 8\nHuman-Environment Interaction\nQUESTIONS TO When Hernando Cortes Interactive 3.16 Lake\nTexcoco Area Today\nGUIDE INQUIRY came upon Tenochtitlan, the\ncapital city of the Aztecs, it\n1. How are we, as\nmembers of a was a large city sitting in the\nglobal society,\nmiddle of a great lake in\ninterconnected?\ncentral Mexico. The Aztecs\n2. How do people’s\nhad built causeways\nactions impact\nconnecting the city to the\nthe world?\nshore. They had small island\nCompare this map to the one on\n3. How does the\nwhich were used for farming, the left. What do you think\nenvironment\ncaused the differences?\nalso connected to the\naffect human\nbehavior and causeway system. After the\nactions?\nSpaniards conquered the Aztecs, the city was taken\nover. The Spaniards decided that they wanted to drain\nthe lake and use the land surrounding the city for\nfarming. As the city was rebuilt by the Spanish, the\nforests surrounding what became Mexico City began to\nshrink. This began a long process that would drastically\naffect Mexico as we know it today.\n68 The depletion of the forests in the area in the early 19th century\nThinking Points - Record your responses in your Interactive Journal:\nled the springs that had supplied the city with fresh water to dry\nup. New fresh water wells were dug in 1857. By the twentieth • Why do you think the Spanish settlers destroyed old Tenochtitlan and\ncentury these wells numbered in the hundreds. The amount of then built a new city where the old city had been?\nwater that was removed from the ground could not be replaced\n• What two things were done to the environment in this area that has led to\nnaturally, and the underground aquifer that fed the wells began to major problems today for Mexico City?\ndry up.\n• What are these major problems?\nAs more water was removed from the ground, the land that the\ncity was built on began to sink. Parts of the city sank below what\nremained of Lake Texcoco. This caused a serious threat to the\ncity as it posed a flood risk during the rainy season. The course of\naction to prevent this was to sink wells into Lake Texcoco itself\nand remove enough water from the aquifer that fed it to make the\nlevel of the lake itself drop below the level of the city once again.\nLake Texcoco has been drained in one way or another since the\n1600’s. It now occupies only a small area surrounded by salt\nmarshes just east of Mexico City. With the depletion of the\nground-water, the land that the city is built on has become\nrelatively unstable. Large fissures, or cracks, will open up from\ntime to time. This, along with the fact that much of Mexico City\ntoday is built on top of the original Lake Texcoco lake bed, means\nthat the cities buildings are at a constant risk. As the area is prone\nto earthquakes, the ground is not very solid and stable. The\ninstability magnifies the ground shaking effect of the earthquakes\ncausing greater damage than may have otherwise occurred.\n69 Central America - Building the Francisco by nearly 8,000 miles, and allow ships to avoid the\nInteractive 3.17 Panama\nPanama Canal dangerous conditions around Cape Horn.\nPrior to 1914, a trip from New York The next question became where to construct this new canal.\nto San Francisco required one to France began work on a canal in Panama in the 1870s. The\nsail around the tip of South French effort was plagued by disease and financial problems and\nAmerica. This was a journey of the project was eventually abandoned. The United States then\napproximately 12,000 miles. Not considered its options. It could buy the rights to finish the French\nonly was this a long trip, but it was canal, or it could build one through Nicaragua. A canal there\nLearn more about Panama at this\na treacherous trip as well. The website. would be closer to the U.S., the terrain was flatter and easier to\nvoyage around Cape Horn, the work with, and the large number of lakes could be connected,\nsouthern tip of South America, is marked by hazardous meaning less digging. But volcanic activity in Nicaragua\nconditions, including strong winds, strong currents and large prompted the United States to try to buy the territory in Panama,\nwaves. With this in mind, nations such as the United States, Grea which at that time was a territory of Colombia. The U.S. failed to\nt\nBritain and France decided that an alternate route was needed. If acquire the rights to build the canal. Just about this same time,\na canal passing through Central America was constructed, it an independence movement began. With support from the U.S.,\nwould cut the travel distance between New York and San Panama successfully gained its independence. The United States\nwas the first nation in the world to recognize the new government\n70\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/cb\/PanamaCanal1913a.jpg of Panama. Within weeks, a treaty between the U.S. and Panama\ngave a 10-mile strip of land to the United States. Thinking Points - Record your responses in your Interactive Journal:\n• Describe why there was a desire to build a canal through Central America.\nConstruction on the canal proved difficult. Beginning in 1907,\nAmericans began blasting through the mountains that stood in • What difficulties were faced by those attempting to build such a canal.\nthe way. Yellow fever and malaria also posed a constant threat to\n• How were these difficulties overcome?\nthe workers and threatened to slow the progress being made.\nWalter Reed, an Army medical doctor serving in Cuba during the\nSpanish American War, had discovered that these diseases were\nspread by mosquitoes that had bitten an infected person. When\nthat mosquito bit another person, that person was then infected\nas well. Using the work of Walter Reed, anti-mosquito measures\nthat had combated yellow fever in Cuba were put into place in\nPanama. Chemicals were sprayed on pools of shallow stagnant\nwater where the mosquitoes bred\nand laid eggs. This treatment\nInteractive 3.18 Panama\nproved to be effective and\nCanal\ngreatly decreased the mosquito\npopulation, and thereby reduced\nthe number of cases of yellow\nfever and malaria. With the\ndisease factor no longer a major\nproblem, the Panama Canal was\nfinished and opened in 1914,\nLearn more about the\nmaking travel from the Atlantic\nconstruction of the Panama Canal\nwith this video. Ocean to the Pacific much\neasier.\n71 South America - Amazon Rainforest Deforestation (Global ability to absorb adequate amounts of carbon dioxide are also\nRainforest Deforestation) reduced. The increased levels of carbon dioxide contribute to\nwhat is called “The Greenhouse Effect.” The Greenhouse Effect\nThe destruction of the Amazon rainforests is a serious concern.\noccurs when elevated levels of carbon dioxide help to trap the\nAccording to the World Wildlife Fund, more than 20% of the\nsun’s energy in the Earth’s atmosphere. Just as a glass\nrainforest has already been destroyed. This number grows daily\ngreenhouse traps the heat from the sun, the Earth’s atmosphere,\nas the land continues to be cleared for agriculture, livestock\nwhen too much carbon dioxide is present, will trap the heat from\nranches, mining operations and logging. In addition, some forest\nthe sun as well. As we continue to burn more and more fossil\nareas are being purposefully burnt in order to make charcoal to\nfuels, more and more carbon dioxide is put into the atmosphere.\nuse as a source of fuel for local power plants. The effects of the\nWithout healthy rainforests worldwide, the Earth cannot re-absorb\ndestruction of the rainforest\nenough carbon dioxide to lessen the impact and reduce the\nInteractive 3.19\nwill have a lasting effect on\nRainforests in Brazil greenhouse effect.\npeople worldwide, as well as\nthe planet itself. It has been Another issue caused by the destruction of the rainforests involve\nestimated that If the what is found in those forests. Many fruits, spices and other\ndeforestation continues at its useful plants come from the rainforest, including; bananas,\ncurrent rate, the entire Amazon guavas, figs, mangos, black pepper, cayenne pepper, chocolate,\nRainforest will be depleted by cinnamon, cloves, ginger, coffee, vanilla and cashew nuts. It is\nthe end of the 21st century not just the foods that we eat that are being destroyed. About\nLearn more about the Brazilian 25% of our current prescription drugs that come from plants\nWhat is at stake? rainforests here.\nactually come from plants found in the rainforest. These include\ndrugs include those that are used to fight cancer, AIDS, and\nThe Amazon Rainforest is known as “The Lungs of the Earth.”\nvarious other viruses and infections.\nThe amount of oxygen produced by the vegetation of the\nrainforest, as well as the amount of carbon dioxide that is\nabsorbed by it, cannot be replaced. The destruction of the\nrainforest is believed by many to be a contributing factor to the\nglobal warming trend. As the forests are reduced the Earth’s\n72 Interactive 3.20\nFor each section, record one thing you\nDeforestation Web-quest\nInteractive 3.21 Enter learned in your Interactive Journal:\nAmazonia\n• \"Enter Amazonia\" for general\ninformation.\n• \"Water worlds\" for information about\nthe waters and water animals\n• \"Life on Land\" for land animals\n•\"The Big Top\" for animals in trees\nConduct an investigation into\ndeforestation on this online web-\n• \"Powerful Plants\" to find out what\nquest.\nplants are there and how the plants are used\n•\"Sacred Ground\" to learn about problems in the rainforest.\nThinking Points - Record your responses in your Interactive\nJournal:\n• What benefits do people get from the Amazon Rainforest?\n• How have people changed the rainforest?\n• What are the negative effects of the changes that people\nhave made to the rainforest?\n73 Summary Show what you have learned by answering the following\nInteractive 3.22\nDestruction of the questions:\nPeople have been impacting the\nRainforest\nenvironment in which they live 1. How has the decision to harvest trees from the\nthroughout history. Human rainforest (“cutting down the rainforest”) impacted the\nimpact on the environment can environment in South America? How has it impacted the world as\nbe explained in two ways. One a whole?\nis how people have adapted to\nand changed their environment\n2. How has the environment of Latin America affected the\nto survive and make life more\nbehavior and actions of the people that have lived there. Site\nCheck out this short “Before &\ncomfortable, the other is the\n“After” video highlighting the\nsome specific actions.\ndestruction of the rainforest: effect that these changes and\nadaptations have on the\nenvironment. Many of these changes and adaptations have had a\nInteractive 3.23 Interactive\npositive impact on the lives of humans, but often these changes\nJournal\nhave proven to be bad for the environment. You have read about\na few of these examples as seen in Latin America. Consider what\nyou have read and viewed in this chapter, and answer the Final\nJournal Discussion Questions below.\nFinal Journal Discussion Questions\nPlease note: once you have\ncreated your own copy of this\nAfter reading this section on Latin America, think about how the\ndocument, this widget will only\nreturn you to the blank copy. You\npeople of the earth, as members of a global society, are\nwill need to access yours by\nconnected. opening from your own Google\nDocument.\n74 Chapter 4\nNorth Africa\nand the\nMiddle East\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society,\ninterconnected?\n2. Does where you live affect your viewpoint on the areas\nwhere others live?\n3. How does culture impact a person’s perspective? Section 1\nIntroduction and Physical Geography\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global\nsociety, interconnected?\n2. Does where you live affect your viewpoint\non the areas where others live?\n3. How does culture impact a person’s\nperspective?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/d0\/BlankMap-World-1ce.png\nOn the map above, the regions circled in green are North Africa and the Middle\nEast. Using only this map, try and answer one of the questions geographers\nasked when studying place:\nWhere is it located?\n76 This allows you to then look at what is around it, and what is\nconnected to it.\nThe region of North Africa and the Middle East lies at the\ncontinental crossroads of Asia, Africa and Europe. At this\nintersection of the world, all three continents meet here at the\nMediterranean Sea. The region extends from the eastern border\nof Pakistan to the Atlantic coast of Morocco in the west. The\nregion includes many diverse landscapes. It contains rugged\nmountains, vast deserts, spacious plains and is surrounded by\nnumerous seas. In this unit, you will learn how geography impacts\nthe way people live. You will also discover how culture impacts a\nImage source: http:\/\/190152612307854813.weebly.com\/uploads\/1\/2\/6\/8\/12683649\/9446804_orig.jpg\nperson’s perspective.\nThe map above contains lines of latitude and longitude which\nwere discussed in the introduction. These imaginary lines run up\nand down, as well as across the world to give geographers the\nThink about the following question:\nability to assign coordinates which describe where a place is.\nUse the map above (Hint: You can click on it to make it bigger) to\nDoes where you live affect your viewpoint on the\ntry and answer the same question you were asked before.\nareas where others live?\nWhere is it located?\nWhen looking at this region, there are some different viewpoints\non an appropriate name. The Middle East has been known by\nIn this chapter we’ll explore another theme of geography: many different names throughout history, all depending on the\nLocation. In order to study a place you have to know where it is. viewpoint of the people referring to the area. Today Southwest\nAsia and Middle East are used interchangeably. With both terms\n77 being used to describe the same region, it can be confusing at • There are a number of different ethnic groups in the area.\ntime as to which is appropriate. Geographically, Southwest Asia One example are the Kurds who live in parts of Iran, Iraq, Syria\ncontains all of the countries of the Middle East as well as Pakistan and Turkey. The Persians are the predominant ethnic group in\nand Afghanistan, Using the map on the previous page, what Iran, connected by ethnic background and language.\ncountries seem to make up the Middle East?\nThe use of the term “the Middle East” has been criticized recently As build your knowledge of North Africa and the Middle East,\nas a primarily Eurocentric view. Having a Eurocentric view means keep these questions in mind:\nthat the worldview is centered on Western Civilization. According\nto the Associated Press, the term “The Middle East” would refer\nto the countries of the western part of the region and Near East\nreferred to the countries of the east, but now they are\n“How does where you live impact how you live?”\ninterchangeable. With all this in mind, there are a number of\ndifferent ways to refer to the region, however the current “How does culture impact a person’s perspective?”\naccepted terms are Southwest Asia and the Middle East. For\nsimplicity, the term “Middle East” will be used in this chapter.\nInteractive 4.1 World Bank\nNorth Africa and The Middle East are two regions often grouped\n- The Middle East\ntogether because they have many things in common. The region\nis almost entirely composed of desert. In the region, Islam is the\ndominant religion and most people speak the Arabic language.\nThese important factors bring the two different areas into one\nregion. With all these things in common, there are many\ndifferences among the people.\n• Christianity and Judaism are major religions in the area\n78 The region of North Africa and the Middle East is a large, diverse\nregion. There are many different geographic and human\ncharacteristics that make up the region. The varied landscape has\ninfluenced the way people live their lives.\nNorth Africa and the Middle East have rich cultures and a history\nreaching far into the past. As you work through this section, you\nwill look at the impact religion, government, and lifestyle play in\nhow a person’s perspective is shaped.\nThe region of North Africa and the Middle East covers almost 6.6\nmillion square miles (17 million sq. km) in area, more than twice\nthe size of the continental United States. North Africa consists of\nthe countries of Morocco, Algeria, Tunisia, Libya and Egypt. The\nMiddle East is made up of Israel, Jordan, Lebanon, Syria, Turkey,\nIraq, Iran, Saudi Arabia, Yemen, Oman, United Arab Emirates,\nQatar, Kuwait, Afghanistan and Pakistan.\nThe Middle East and North Africa have long been linked together.\nFor centuries camel caravans have crossed the region taking\ngoods and ideas back and forth. This region became a\ncrossroads for trade, connecting Africa, Europe, and Asia. Today\ntrade still makes a lasting impact, with oil being the dominate\ngood instead of the spices and silks of centuries ago.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Trans-Saharan_trade#mediaviewer\/File:Caravane_hoggar1.jpg\n79 The rich history of the people in the region extends far beyond Fossil fuels are in high demand worldwide. Due to the large\neconomics. The Middle East has long been known as the \"cradle demand for oil, a fossil fuel, many countries in the region have\nof civilization.” This is where grown very rich meeting the world's growing reliance. North Africa\nfarming began. This is where and the Middle East have the largest known oil deposits in the\nInteractive 4.2 Google\nthe first cities developed and Maps - North Africa and the world. Oil is refined down and used in many different products.\nMiddle East\nthis region is also the Gas is one product that comes from oil and is important since it is\nbirthplace of three major world the fuel used by most cars, trucks, planes and ships worldwide.\nreligions.\nUse this link to examine the\narea. Look at both the human\nand physical characteristics of\nthe region. What are some of\nUse this interactive widget to learn\nthe things you observe? Zoom\nmore about the regions.\ninto the area, to some of the\ncountries. Explore some of the pictures that show up at the\nbottom.\nEconomic Activity\nNatural resources define the economic activity of North Africa and\nthe Middle East. Petroleum, or oil, is the most important resource\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f0\/Oil_Reserves_Updated.png\nto the region due to the world’s demand for it and the region\nhaving so much of it. Another major resource is water, which, in\ncontrast to oil, is important due to the lack of fresh water in the\nDescribe where oil is located in North Africa and in the\nregion.\nMiddle East.\n80 The lack of water limits how much agriculture areas are able to Physical Features\nsupport. Very few areas are able to have commercial farming or\nThe Sahara desert is a combination of large sand dunes and\nlivestock. In most areas there is just enough water for\nrocky terrain. As you travel the region small areas of fertile plains\nsubsistence farming and nomadic herding. Small areas of\nexist around the few rivers and the occasional oasis, giving the\ncommercial farming produce olives. Wheat and fruit can be\nregion its only sources of fresh water. The Nile, the longest river in\nfound along the Mediterranean coast. Nomadic herders move\nAfrica, runs through this region, emptying into the Mediterranean\ncattle from place to place in search of both food and water to\nSea. To the north, the Atlas Mountains stretch across the region.\nfeed their animals. Families who rely on subsistence farming live\non small plots of land and will raise just enough food to feed their\nfamily. The people of the region have spent centuries learning\nhow to adapt to the challenges of surviving in this dry region.\nNorth Africa is one of five subregions of Africa. The world’s largest\ndesert, The Sahara, is the main physical feature in the area.\nImage source: https:\/\/www.flickr.com\/photos\/babeltravel\/2762316959\/in\/photostream\/\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Sahara_ecoregion.svg\n81 The physical landscape of the Middle East is defined by great To the north, the Anatolia Plateau covers much of the rugged\ndifferences. The region has some of the world’s highest landscape of modern day Turkey.\nmountains to the east and the world's driest areas in the deserts\nClimate\ncovering much of the region. The region also boasts a number of\nbodies of water, both fresh and salt water. The Tigris and\nDespite the many seas and rivers in the area, North Africa and the\nEuphrates rivers come together in the area once known as\nMiddle East are regions of mostly arid and semiarid climate\nMesopotamia to create one of the most fertile river valleys in the\nzones. An area with an arid climate receives less than 10 inches\nworld.\nCritical Thinking Skill:\nWhat other regions of the world have a climate similar to North Africa and\nWith a vast\nthe Middle East?\nnetwork of\nWhy would these other regions have a similar climate?\nseas and\ngulfs, tin\naddition to\nabundant\nnatural\nresources, this\nregion boasts\none of the\nlargest\nImage source: http:\/\/commons.wikimedia.org\/wiki\/\nshipping\nFile:Mesopotamia_geographic.png\nnetworks in\nthe world. In the south is the world’s largest peninsula, the\nArabian Peninsula, which covers more than a million square miles.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c2\/ClimateMapWorld.png\n82 of precipitation in a year. The Vegetation\nsemiarid zone will receive slightly\nThe vegetation of the region is very limited due to\nmore precipitation on average per\nthe arid and semiarid climates. Much of the region\nyear. These two zones often are the\nis covered by desert scrub. Desert scrub is made\nhottest places in the world.\nup of small trees and shrubs that can survive in a\nSummer temperatures can be\nregion where water is scarce. Other vegetation\nextreme with daytime temperatures\nzones exist depending mainly on the temperature\nreaching above 100°F. There is very\nand rainfall of an area. The river valleys are\nlittle vegetation or moisture in the\ncovered with mixed forest vegetation. In these\nair to keep in heat, so temps can\nareas, both coniferous and deciduous trees grow.\ndrop drastically at night.\nIn the Nile River Valley you will find the region’s\nonly area of broadleaf evergreen forest. Some\nsmall areas of temperate grassland appear in the\nAlong the coastal areas, the climate\ncooler climate found in the highland area of\nis more moderate. Much of the area\nTurkey. Finally, along the coast of the\nenjoys a Mediterranean climate.\nMediterranean Sea, you will find chaparral. This\nHere summers are warm with little\narea of small trees and bushes thrives in the warm\nprecipitation and winters are mild\nMediterranean climate.\nand wet. In other areas of the\nregion, the climate can vary\ndrastically due to changes in\nelevation. Generally, in the\nmountain areas, as the elevation\ngoes up the temperatures drop.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Nile#\/media\/\n83\nFile:Nile_watershed_topo.png Section 2\nHistory and Religion\nQUESTIONS TO GUIDE INQUIRY North Africa and the Middle East is a large, diverse region. There are many\ndifferent geographic and human characteristics that make up the region. The\n1. How are we, as members of a global\nsociety, interconnected? varied landscape has influenced the way people live their lives.\n2. Does where you live affect your viewpoint\nAs you work through this section, you will look at the impact religion, government,\non the areas where others live?\nand lifestyle all play in how a person’s perspective is shaped.\n3. How does culture impact a person’s\nperspective? History and Religion- How does culture impact a persons perspective?\nInteractive 4.3 The Spread\nThe civilizations of Mesopotamia and Egypt had a huge impact on later\nof Religion\ncivilizations. The Middle East and North Africa is known as “the cradle of\ncivilization.” This is where agriculture (farming) first began. The first cities\ndeveloped here and the region is also the birthplace of three of the worlds major\nreligions. Around 5,000 years ago, two civilizations developed in the region. In\nNorth Africa, Egypt grew along the banks of the Nile River. To the east,\nMesopotamia, developed on a fertile plain located between the Tigris and\nEuphrates Rivers.\nView this animated timeline\ndepicting the spread of the five Ancient Egypt\nworld religions.\nAround 5,000 years ago, two civilizations developed in this region. In North Africa,\nEgypt grew along the banks of the Nile River. To the east, Mesopotamia\ndeveloped on a fertile plain located between the Tigris and Euphrates Rivers.\n84 These civilizations had a the position people held in society. At the\nhuge impact on later top were the rulers and government\ncivilizations. This is why the officials, in the middle were business and\nregion has been called ‘the craftspeople, and at the bottom were the\ncradle of civilization.’ This is farmers and slaves.\nwhere agriculture, or farming,\nAncient Mesopotamia\nwas invented and where the\nfirst cities developed. The\nAround 4000 B.C.E., people began to\nregion was also the\nsettle and farm the area along the Tigris\nbirthplace of three of the\nand Euphrates Rivers. This area, also\nworld’s major religions.\nknown as the Fertile Crescent, is an arch\nshaped area of fertile land that stretches\nReligion was very important\nfrom the Persian Gulf to the Mediterranean\nin Egyptian society. The\nsea. Very similar to Ancient Egypt, the\nbelief system was\npeople of Mesopotamia relied on yearly\npolytheistic. Polytheism is\nfloods to provide them with fertile soil and\nthe worship of or belief in\nfresh water for irrigation. To help control\nmany gods or deities. All\nthe flooding, the people developed a\nlevels of Egyptian society\ncomplex system of ditches, canals and\nwere influenced by the\ndams. This also provided water for\nbeliefs of the Egyptian\nirrigation of the farms..\npeople. Egypt was a\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Map_of_fertile_crescent.svg\ntheocracy, a form of\ngovernment where a religious leader or leaders rule. Egyptian\nAbout 1000 years later the small farming villages began to\nrulers were called pharaohs and the Egyptians believed they were\ndevelop into larger cities in the area of Sumer. These large cities\ngods as well as rulers. The rest of society was broken down into\nincluded the main city, normally surrounded by tall walls, and the\nmany different levels. This complex social structure was based on\n85 farmland around it. As these Sumerian cities grew, each Judaism is the oldest of the\ndeveloped their own form of government and came to be called three religions. Judaism\ncity-states. Each city-state also included a center area that had a originated in Israel from\nlarge temple dedicated to the god of that city. Just like in Egypt, Israelites or Hebrews also\npeople in Mesopotamia practiced a polytheistic religion. known as Jews. Today,\nIsrael is still the center of the\nJewish religion, but many\nbelievers are spread\nCritical Thinking:\nworldwide.\nExplain how you think people in Ancient Egypt and Mesopotamia\nfelt about the floods. Was the effect positive or negative? Jewish history and religion\nis found in their holy book,\nImage source: http:\/\/vi.wikipedia.org\/wiki\/Do_Th%C3%A1i_gi\nthe Torah, or Hebrew Bible.\n%C3%A1o\nIn the first four books of the\nThree World Religions\nTorah, Judaism was founded by a man named Abraham. Around\n1800 B.C.E God told Abraham to leave his home along the\nIs there a church, synagogue or a mosque in your area? These\nEuphrates River and move his family to the land of Israel. The\nthree places of worship represent three of the world’s major\nTorah states that God made a covenant or agreement with\nmonotheistic religions: Judaism, Christianity, and Islam. All three\nAbraham. If he moved to the land of Canaan (Israel), he and his\nreligions were “born” in the region and continue to claim portions\nfamily would be blessed. The descendants of Abraham, known as\nof this region as holy land. While you will learn more about these\nIsraelites today, believed they would continue to be blessed as\nreligions in later grades, a brief history is necessary to understand\nlong as they followed God’s laws.\nthis region of the world.\nThe Jewish people believe the most important laws were given to\nHistory of Religion\na prophet, or messenger of God, named Moses. According to the\nJudaism Torah, Moses led the Hebrews out of slavery in Egypt. After\nescaping slavery, the Hebrew people endured the long journey\n86 back to the promised land. Along the way Moses received God’s placed their trust in God,\nlaws, the most important being the Ten Commandments. These their sins would be\nlaws were very different from others of the time because they forgiven. Jesus’\nwere based on how the people should worship God. followers declared he\nwas the son of God and\nAround 1000 B.C.E. the kingdom of Israel was created in the area\nsavior of all people.\nof present-day Israel by King David.\nInteractive 4.4 Judaism\nThe capital city of Jerusalem was Many people viewed\nOverview\nestablished and a temple built. Later Jesus as a savior sent\non the kingdom split into two states- by God to save them.\nIsrael and Judah. In the coming The large following that\ncenturies, the people of Israel would he was building worried\nImage source: http:\/\/commons.wikimedia.org\/wiki\/\nbe conquered by outside invaders many of the Roman\nFile:ChristianitySymbolWhite.PNG\nand forced to leave their homeland. leaders in Israel. Jesus\nThis scattering of the Jews is known was convicted of treason under Roman law and sentenced to be\nLearn a little more about Judaism as the Jewish Diaspora. crucified. According to the Gospels, Jesus rose from the dead\nthrough this YouTube video\nand appeared to his followers.\n(requires internet connectivity)\nOver time, Jesus’ followers spread his message all throughout the\nChristianity\nMediterranean region. Churches formed in communities large and\nsmall. Eventually the Gospels, accounts of Jesus’ life, and other\nChristianity, another monotheistic religion, began about 2,000\nwritings from early Christians came together to form the Christian\nyears ago with a Jew named Jesus. About 30 C.E. Jesus began\nBible. Christianity spread all over Europe and became the\npreaching in the present day region of Israel. The life and\ndominate religion there and eventually around the world. It is\nteachings of Jesus are presented in the four Gospels, the first\npresently the world’s largest religion with about 2 billion followers.\nfour books of the New Testament. The New Testament is part of\nthe Bible, the Christian holy book. Jesus taught that God loved all\npeople, even those who had sinned. He explained that if people\n87 Islam\nIslam is the third monotheistic religion\ndeveloped in the region in the 600s\nCE in present day Saudi Arabia.\nMuslims are followers of Islam.\nMuslims believe a man named\nMuhammad was the last and greatest\nprophet of Islam. He followed the\nprophets Abraham, Moses, and Jesus.\nMuhammad, born around 570 C.E., was a merchant living in the\ntrading city of Mecca. According to the Quran, the holy book of\nImage source: http:\/\/commons.wikimedia.org\/wiki\/\nIslam, Muhammad was given messages about God from an\nFile:PikiWiki_Israel_13177_Christianity_and_Islam.jpg\nangel. The angel told him that god wanted him to preach to the\nHow does where you live impact\npeople, telling them that there is only one God, Allah. In his\nInteractive 4.5\nmessages, Muhammad was also sent to tell people that all whom how you live? Living in the Middle\nComparative Religions\nbelieved in Allah were equal in his sight. East exposes people to three of the\nworld’s major religions. How do you\nAfter the death of Muhammad in 632 C.E., a group of religious\nthink these religions influence the way\nleaders know as caliphs ruled the Muslim community. For the\npeople your age live in the Middle\nnext few centuries, Islam spread into Asia, North Africa, and parts\nEast?\nof Europe. Muslim control of trade in these areas helped their\ncities grow. These cities became centers for trade, learning and\ngovernment in the Muslim world. Muslim scholars made many\nComplete this handout with your\nknowledge from this section and\nimportant contributions to math, chemistry and medicine.\nany additional research you need.\n88 Section 3\nCultures and Government - North Africa\nQUESTIONS TO GUIDE INQUIRY Cultures and Lifestyles\n1. How are we, as members of a global\nCulture is the way of life shared by a group of people. It includes their ideas,\nsociety, interconnected?\ntraditions, values and beliefs. All these areas are influenced by the viewpoints,\n2. Does where you live affect your viewpoint\nrules and institutions found among the people. There are a number of traits that\non the areas where others live?\ncan describe a people's culture. This section will focus on six: art, language, food,\n3. How does culture impact a person’s\ngovernment, religion, and ethnic background. Why does this matter? The region of\nperspective?\nNorth Africa and the Middle East has served\nas the crossroads for the continents of Asia,\nAfrica, and Europe. This has resulted in a\nregion that has been home to many different\ngroups and cultures.\nThe people of North Africa have a long and\nrich past. As the birthplace of one of the\nworld’s earliest civilizations, Ancient Egypt,\nthe region has a rich cultural heritage. Many\nof the traditions and cultures of some of the\nethnic groups have changed and adapted\nover time. Modernization and urbanization\nhave had an impact on the way of life for the\npeople of the region. Despite this, many still\n89\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:A_cameleer_with_his_traditionally_decorated_camel._Cairo,_Egypt,_North_Africa.jpg hold on to their traditional ways. separated the area into geometric boundaries, separating the\nland using straight lines. These boundaries were drawn by the\nEthnic Background\ncolonial powers and did not take into account natural and cultural\nfeatures that existed in the area. This created conflict among the\nThe people of North Africa are a mix of indigenous and Arab\nnew countries. In the mid-1900s nationalism began to take hold\ncultures with a strong European influence. The main indigenous\nand many North African countries were able to gain their\npeople, the Berbers, existed long before the Arab invasions. Of\nindependence.\nthe some 15 million Berbers who occupy the area, most are\nfarmers or pastoral nomads. These people mostly live in the Atlas\nToday many different types of governments exist. European\nMountains and areas of the Sahara desert.\ncolonization still has a great impact on the governments of the\nregion. Stability is difficult to obtain. Civil wars\nThe majority of people in the region are Arabs.\nhave been common. Some countries are\nUnited by language, the Arabic-speaking\nbeginning to develop democracy and\npeople migrated to the region from the\nconstitutional monarchies that look to create\nArabian Peninsula in the 600s C.E.\nsome equality and stability for the people\nBedouin herders can still be found\nin North Africa.\nraising animals in the desert where water\ncan be found to support vegetation.\nGovernment\nEarly on, the people of North Africa were hunter-gatherers that\nlived in small groups. As time passed the Egyptian civilization\ndeveloped in the Nile River Valley. This civilization had a\ntheocracy, government based in religious belief. The pharaoh was\nnot only the head of government but seen as a god as well. As\ncenturies passed, different groups fought for control of the region.\nFinally in the 1800s a period of European colonial rule took\ncontrol. The European states took control of the governments and\n90 Language, Food and Art language still is spoken. With the continued growth of the world\ncommunity, in many of the larger cities English is spoken.\nHow does where you live impact things like your language, food\nand the art or music you enjoy? In a region as culturally diverse History and the world community have had a strong influence on\nas North Africa, it has a large impact. Due to the high degree of art and music. Much of the art that comes from the region has a\ncultural diversity, the region’s food, language and arts have strong mystical feel to it. Berber and Islamic culture heavily\ndeveloped a flavor of their own. The diet of people living in the influence the style of the region’s art. Traditional symbols and\nregion is based on staple foods that can be grown and raised in signs are used to draw connections to pre-Islamic times. Music is\nthe harsh desert environment. Food like seafood, goat, lamb, influenced much the same way. Many of the original peoples of\nbeef, dates, almonds, olives, and other fruits and vegetables the area, like the Berbers, enjoy traditional music styles. Much of\nmake up the staple diet of the people. Highly influenced by the music is Muslim influenced. Today, popular music contains\nMuslim culture, most dishes served in the region follow Islamic aspects of these traditional roots as well as popular music that\nLaw for food and meal preparation. has been imported.\nThe history and cultures Interactive 4.6 Music of\nhave also had a large Morocco\nimpact on the languages\nspoken in North Africa.\nToday most people speak\nArabic. This is a result of\nthe dominant influence of\nthe Islamic religion on the\narea and the conquering\nLearn more about the Music of\nof the area by the Arab Morocco at this Interactive\nWebsite\nIslamic armies in the 600s\nC.E. In some areas the\ntraditional Berber\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/37\/\nIlkhanateSilkCircular.jpg\n91 Section 4\nCultures and Government - The Middle East\nQUESTIONS TO GUIDE INQUIRY Very much like North Africa, the Middle East has a rich history and heritage. As the\nbirthplace of civilization and three major world religions, the region has had a\n1. How are we, as members of a global\nsociety, interconnected? number of traditional, religious and ancient influences on the cultures in the region.\nModernization and urbanization have also had an impact on the way of life for the\n2. Does where you live affect your viewpoint\non the areas where others live? people of this region. Despite this, many still hold on to their traditional ways.\n3. How does culture impact a person’s\nperspective?\nEthnic Background\nAlmost 350 million people live in the Middle East today,\nmore than the current population of the United States.\nThere is a variety of backgrounds as a result of\nmigration from neighboring areas. This is a result of a\nlong history of migration of people into the region from\nneighboring areas.\nArabs make up the largest ethnic group in the region.\nThe term refers to people who originally inhabited the\nArabian Peninsula, but today the term connects the\npeople who speak the Arabic language. A number of\nother ethnic groups make up the region. In Israel there\nare the Palestinians and Jews, in Iran the Persians, and\n92\nImage source: http:\/\/en.wikipedia.org\/wiki\/Yemen#mediaviewer\/File:3_Kids_in_San%27a.jpg the Kurds spread throughout Iraq, Iran, Syria and Turkey. Language and Food\nGovernment Most people in the region speak Arabic. However, there are many\nareas that speak Turkish, Farsi and other local languages and\nEarly on, the people of the Middle East were hunter-gatherer who\ndialects. Many areas speak unique dialects through the\nlived in small groups. As time passed and civilization developed in\ncombination of other languages spoken in the region. For\nMesopotamia, so did government. City-states developed within\nexample, some people in Lebanon speak a blend of English and\nthe area. Many of these city-states had monarchies and\nFrench mixed in with the local Arabic dialect.\ntheocracies both supported by their religions beliefs. As centuries\npast, different groups fought for control of the region. Middle Eastern food’s unique flavors have been influenced by\ndiverse populations throughout the region. Middle Eastern cuisine\nThe Ottoman Empire, centered in present day Turkey, held\nis as mixed and diverse as the people who make up the region.\npolitical control from the early 1500s until after World War I.\nEven with this diversity, the food holds some common aspects\nFollowing the empires collapse, portions of the region gained\nacross the region. Sharing similar characteristics and staple\nindependence, however much of the region was placed under the\nfoods, much of the cuisine is based on food like olives, olive oil,\ncolonial control of a few European countries. By the 1970s, many\npita bread, honey, dates, chickpeas, mint and parsley. Staple\nof the countries were able to gain their independence. These new\nmeats include lamb and some beef. All foods share the same\ngovernments varied in style from monarchies to dictatorships.\ncharacteristic of being able to grow in the fertile valleys of the\nMany would continue to see periods of unrest and war that has\nTigris and Euphrates rivers.\nextended into the present day. Since the 1990s many, but not all,\ncountries have slowly moved towards democracy. This push\ntowards a democratic system of government has been driven by\nthe peoples’ desire for more participation and freedom in the\npolitical life of the countries.\n93 Section 5\nGlobal Connections\nQUESTIONS TO GUIDE INQUIRY Global Connections-”How does having a valuable natural resource impacted\nthe people of the region?”\n1. How are we, as members of a global\nsociety, interconnected?\nYou've never known life without a Playstation (1994), Wifi (1999), or even the\n2. Does where you live affect your viewpoint\niPhone (2007). Can you imagine what people did prior to these inventions? In a\non the areas where others live?\nshort amount of time much can change the way people live. Other parts of the\n3. How does culture impact a person’s\nworld such as the Middle East have radically changed as well. Take Dubai for\nperspective?\nexample, by clicking on the Interactive 4.7 link you'll see what fifteen short years\ndid to that city. What brought about such rapid and dramatic change to this jewel\nof the Middle East?\nInteractive 4.7 Dubai -\nThen and Now\nDubai is one of a collection of seven states that make up the United Arab\nEmirates. Not that long ago this was a small town where nomads raised cattle in\nthe nearby desert oasis. Today it is a growing city with all the modern amenities.\nWhat could cause such a dramatic change in this small Middle Eastern state?\nThe Middle East sits on the largest oil reserve in the world. It is estimated that the\nLearn a little more about Dubai at\ncountries of the Middle East control approximately half of the entire oil reserves in\nthis website.\nthe world. Along with the abundance of oil, large natural gas reserves give the\n94 region a wealth of the natural resources that are seen nowhere than half the world’s reserves of crude oil or petroleum is found\nelse in the world. World demand for oil has been growing year under the lands of the Middle East. Worldwide demand for oil and\nafter year. As mentioned earlier, crude oil is refined down into natural gas remains high. These two factors have given countries\nmany different products. As demand for these products has gone of the Middle East a wealth not seen elsewhere in the world.\nup, the countries who control the oil have become very wealthy.\nMost countries have become very dependent on fuels produced\nIn the next chapter you are going to learn how having such a\nfrom crude oil to meet their energy demands. Many forms of\nvaluable resource has affected the way people in the Middle East\ntransportation run on fuels refined from oil. Power plants burn oil\nlive.\nto create electricity to power the homes and electronics we use\ndaily. Oil is also used in many products such as medicines,\nplastics, cosmetics and other goods. As demand continues to\ngrow the reserves will one day begin to shrink. Oil is a\nnonrenewable resource. There is a limited supply of it and it\ncannot be recreated. Once the supply is gone, we will have to\nturn our attention to renewable forms of energy to take its\nplace.\nOil is not distributed equally throughout the world. It takes very\nspecial conditions for the earth to take plant and animal\nDescribe where the regions with the\nremains and change it into oil. Distribution of oil in the Middle\nlargest amounts of oil are located.\nEast is uneven as well. Saudi Arabia is the region’s largest country\nand has the most oil. On the other hand countries like Kuwait and\nOil: So whats the big deal?\nthe United Arab Emirates are much smaller in proportion to Saudi\nThe Middle East is not the most welcoming region of the world. Arabia, but have almost have as much oil as their Middle Eastern\nMuch of land is hot and dry. The area is characterized by large neighbor. Other countries, like Bahrain and Syria, have some oil\ndeserts, rugged mountains and plateaus. However, beneath this but it is far less than most of the region.\nformidable exterior is a vast reserve of oil and natural gas. More\n95 Oil Wealth improve the health care of the region. As seen in the changes in\nDubai, both public and private wealth from oil has improved and\nPer$Capita$GDP$(2013)$in$United$States$Dollars expanded cities in the region.\n100,000.00\nSource:>>World>Bank\n90,000.00 93,714.06\n80,000.00\nHow might having this valuable resource affect the people of the\n70,000.00\nMiddle East? Give two ways you think this resource will affect the\n60,000.00\nregion in the future.\n50,000.00 52,197.34\n40,000.00 43048.85\n30,000.00\n24,689.11 25,961.81\n20,000.00 21,929.01 Oil has not improved life for all people in the region. Oil has not\n10,000.00\nended poverty in the Middle East. Many countries, like Yemen,\n4,763.30 6,862.50 2,065.54 1,473.10\n0.00\nBahrain Iran Iraq Kuwait Oman Qatar Saudia>Arabia Syria United>Arab> Yemen remain among the poorest countries in the world. A number of\nEmirates\ncountries in the Middle East do not share the same amount of oil,\nOil has brought great wealth to the people and countries of the\nin turn their oil wealth does not meet the needs of their poor\nMiddle East. The graph above shows the per capita Gross\npopulation. Some countries have made a lot of money on oil but\nDomestic Product of 10 Middle Eastern countries. This data\nhave not used that money to improve the lives of their people.\nshows the comparison of how rich one country is to another. As\nyou may observe, not all oil countries are the same and a\ncountry’s oil wealth is not divided evenly among the people.\nSome are very, very rich while others are extremely poor.\nThe oil wealth of many Middle Eastern countries has impacted\nthe people in positive ways. In general the money from oil\nproduction has improved the lives of many of the people. Life\nexpectancy has increased and the infant mortality rate has fallen.\nBoth factors can be attributed to countries using their wealth to\n96 Algeria, Angola, Ecuador, Libya, Nigeria, and Venezuela. These\nmember countries want to keep oil pricing steady, not too high\nnot too low. To do this they control the production of oil. If too\nmuch oil is pumped, there will be less competition for it and\nthe price it sells for will be too low. If there is too little\nproduced, there will be more competition between buyers,\nforcing pricing to rise too high.\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:OPEC.svg\nOil and the World\nSo, how does having this valuable resource affect the world?\nMany oil producing countries of the Middle East depend on oil\nsales as a major part of their country’s economy. Due to this\ndependance, many countries have the goal of a steady oil supply.\nThis allows countries to have a steady flow of money coming into\ntheir country.\nTo meet this goal, several countries have formed the Organization\nof the Petroleum Exporting Countries or OPEC. Currently OPEC\nhas 12 member countries, six of the members are Middle Eastern\ncountries: Iran, Iraq, Kuwait, Qatar, Saudi Arabia and the United\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/9a\/Renewable_energy_potential.jpg\nArab Emirates. The other 6 non-Middle Eastern countries are\n97 Despite all this power over oil production, there are some things energy. As oil demand stays high and resources run out, more\nthat limit what OPEC is able to control. First, OPEC cannot and more people will have to begin using alternative forms of\ncontrol all of the oil sales in the world. Member countries control energy.\nless than half the oil that is exported around the world. The rest\nLooking through the Eyes of the World Your interactive journey\ncomes from various non-OPEC countries. Another factor is that\nthrough geography: Record your thoughts to the essential\nmembers do not always act as a group. Some members act\nquestions in your journal.\nindependently and refuse to follow the decisions that OPEC\nmakes about how much oil to produce or who to sell to.\nThe world’s dependence on\nInteractive 4.8 Interactive\noil has been increasing year\nJournal\nafter year. Countries become\nmore dependent on oil as\nthey develop economically.\nSimple economics shows\nthat as more people demand\na product like oil, the price\nwill continue to rise. As you\nhave learned in this unit, oil Please note: once you have\ncreated your own copy of this\nis a nonrenewable resource.\ndocument, this widget will only\nreturn you to the blank copy. You\nWith more people\nwill need to access yours by\ndemanding oil and oil\nopening from your own Google\nDocument.\nproducts, the world has\nbegun to look at new\nrenewable energy resources. Examples include solar and wind\n98 Chapter 5\nSub-Saharan\nAfrica\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society, connected?\n2. How does history impact the culture of a region?\n3. How do the people of Sub-Saharan Africa overcome the\nmany challenges they face? Section 1\nIntroduction - Africa South of the Sahara\nQUESTIONS TO GUIDE INQUIRY Where is it?\n1. How are we, as members of a\nglobal society, connected?\n2. How does history impact the Point A: It is about 8,356 miles (13448 km)\nculture of a region? from Lansing, Michigan to Cape Town,\nSouth Africa.\n3. How do the people of Sub-\nSaharan Africa overcome the\nmany challenges they face?\nInteractive 5.1 Trip to\nSouth Africa\nExplore the route from Lansing\nMichigan to one of the Southern\nmost tips of Africa.\n100 Place - What is it like there?\nIn the introduction to this book you learned briefly about the five\nthemes of geography, and previous chapters have covered the\ngeographic themes of Movement (North America), Human\/\nEnvironment Interaction (Latin America), and Location (North\nAfrica and the Middle East). This chapter will help you begin to\nthink more about the theme of “place.” Geographers define the\nstudy of place as the conditions at a location, or more simply, a\nstudy of what it’s like there. If you look back at the chapters on\nNorth America, Latin America, and North Africa and the Middle\nEast you’ll notice in the sections on physical geography that this\nquestion has really been answered.\nIntroduction: Africa South of the Sahara\nAfrica is a large landmass, second only to Asia in size. The\ncontinent is a land of diverse physical features including high\nmountain peaks, great valleys, large deserts, great rivers and\ntropical rain forests. Sub-Saharan Africa is a region that\ngeographically lies south of the Sahara Desert. Approximately\n90% of the region lies within the Tropics Zone, giving the region a\nAs you build your knowledge of Sub-Saharan Africa, keep these\nwarm climate. In this unit, you will learn how the environment\nessential questions in mind:\nimpacts the way people live. You will discover how people have\n• “How does history impact the culture of a region?”\nadapted to living in this diverse landscape.\n101 Over time, the people of the region have had to face many for in the region. Some, like Arabic and English, are used all over\nchallenges as a result of their history. the region by many different cultures. Others, such as Hadza, are\nisolated to remote areas of the continent. Despite these extreme\n“How do the people of Sub-Saharan Africa overcome the\ndifferences, Africans share a long, storied history.\nmany challenges they face?”\nPeople of Africa South of the Sahara face many challenges such The region is home to some of the oldest groups of people found.\nas surviving in dense tropical rainforests and living in the harsh Scientists have found bones dating back to the earliest of times.\ndesert. They deal with the change in governments, war, and the With this evidence, many have called Africa the birthplace of the\nthreat of starvation. human race. These early peoples were hunter-gatherers, moving\nfrom place to place to find their food. Later on, they learned to\nfarm and began raising animals and growing crops.\nWith an area about three times the size of the United States,\nAfrica South of the Sahara\naccounts for almost one-fifth of the Interactive 5.2 Countries in For centuries great African empires rose and fell in the region, as\ntotal land in the world. The land Sub Saharan Africa well as small kingdoms and city-states. Vast trade networks\narea totals 10.3 million square connected Sub-Saharan Africa with Europe and Asia. In the\nmiles. It is not surprising that a 1400s, European explorers looking for a sea route to India and\nregion this large is made up of 54 China began to visit Africa. The Portuguese were the first to set\ncountries. up trade along both the west and east coasts of Africa. In the\nMid to late 1800s European countries began to carve up Africa\ninto colonies. By 1914 only Ethiopia and Libera were\nindependent nations.\nSub-Saharan Africa is a region\nThis page from the Library of\nCongress provides a list of\ncomprised of many cultural\ncountries in Sub Saharan Africa.\ngroups. Some 2,000 different Choose one country from this list\nand use the Internet to do a little\nlanguages have been accounted\nresearch on this country. In one\nparagraph, describe “What is it\n102\nlike there?” Share your findings\nwith a classmate. Image source: http:\/\/commons.wikimedia.org\/wiki\/File:Flag_map_of_Colonial_Africa_(1945).png\nThe age of African Independence began in the late 1950s. Ghana\nwas the first to gain its independence from European rule. Over\nthe next decade many African colonies were able to fight to gain\ntheir freedom from colonial rule. Unfortunately many were not\nprepared to self-govern. Since that time, many countries have\nfound it difficult to establish strong, stable governments.\n103 Section 2\nPhysical Geography\nQUESTIONS TO GUIDE\nINQUIRY\n1. How are we, as\nmembers of a global\nsociety, connected?\n2. How does history impact\nthe culture of a region?\n3. How do the people of\nSub-Saharan Africa\novercome the many\nchallenges they face?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/e7\/Volta_lake_from_the_Saint_Barbara_Church.JPG\nPhysical Geography\nSub-Saharan Africa is a huge region in size and has a great diversity of physical\nfeatures. Many geographers describe it as a land of plateaus.\nThere are also\na many mountain ranges in the region. Mt.\nlarge basins, coastal plains. nd\nKilimanjaro, located in the country of Tanzania, is the highest mountain in Africa\nand also the highest free-standing mountain in the world. A free-standing\n104 mountain is a mountain that is not part of a mountain range.\nAnother impressive feature is the Great Rift Valley. This massive\nvalley was formed when tectonic plates moved to create a gash\nin the continent extending from the country of Mozambique to the\nRed Sea.\nImage source: https:\/\/www.flickr.com\/photos\/ciat\/5207540264\/\nVegetation varies greatly across the massive region. To the north,\nthe Sahara gives way to the Sahel, a large area of mostly dry\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c2\/ClimateMapWorld.png grassland. In the west, the Niger river cuts through the Sahel. This\narea is also home to the Congo river basin and the large rainforest\nUsing the map above, determine other places in the world that have that surrounds the river system. To the east, tropical grassland\nsimilar climates as this region? What location characteristics do they\ncovers much of the region. Here the Great Rift Valley gives way to\nshare?\nthree large freshwater lakes and the two forks of the Nile River:\nthe White and Blue Niles. The Southern portion of Africa is made\nup of a large low-lying area. Here drops in the elevation create\nmany beautiful waterfalls. As you move further south the Namib\nand Kalahari deserts make up much of the far Southern region.\n105 Critical Thinking Question:\nAccess to clean water is a huge issue throughout the world.\nWhy is clean water important?\nImportance of Water\nWater is present all over Michigan. There are lakes and rivers with\nmillions of gallons surrounding our communities. We live in a state\nthat is surrounded by the largest freshwater ecosystem in the\nworld. It is safe to say we take the access to freshwater for\ngranted. Not only do we have access to all this water, but we Image source: http:\/\/commons.wikimedia.org\/wiki\/File:Flickr_-_usaid.africa_-_Water_pump.jpg\nhave full access to clean water. Unfortunately this is not the case\nInteractive 5.3 Expedition\nin many parts of Sub-Saharan Africa.\nWidget\nThis link (requires Flash and\nInternet Connection) will connect\nyou to History.com’s Expedition\nAfrica. Balance risks and rewards\nto see if you can survive an\nAfrican Journey\n106 Section 3\nApartheid\nQUESTIONS TO GUIDE INQUIRY History of Apartheid\n1. How are we, as members of a global\nImagine living in a place where signs\nsociety, connected?\nlike this are a daily sight. Imagine a\n2. How does history impact the culture of a\ncountry where the government has\nregion?\nenacted a policy of total separation\nbased on race. This policy would\n3. How do the people of Sub-Saharan Africa\ndecide where you could live and\novercome the many challenges they face?\nwork, along with who you could\nmarry. Such a place existed.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/12\/\nApartheidSignEnglishAfrikaans.jpg\nFor almost 50 years the white\nminority ruled the country of South\nAfrica under a system of racial separation called Apartheid. This policy of racial\nsegregation forced whites and nonwhites to live apart from each other. It offered\nfew economic resources and less political power to the nonwhite ethnic groups.\nSouth Africa was a multiracial society made up of many different ethnic groups.\nMost ethnic groups fit into four classifications blacks, whites, colored and Asian.\nApartheid then separated all these into white and nonwhite.\n107 How did South Africa become a multiracial society? People have from other parts of Europe. Dutch remained the language of the\noccupied the area for thousands of years. Some of the earliest colonists and later they would begin to adapt many words from\nblack Africans began migrating to the area from Central Africa the other settlers as well as black African languages to blend into\nsome 2,000 years ago. This group was made up of many smaller a new language called Afrikaans.\ngroups of black Africans which varied by ancestry and language.\nIn the early 1800s, Great Britain took over the colony and South\nAfrica became part of the British Empire. Soon the discovery of\ngold and diamonds attracted more colonists to the area. Both the\nBoers and British saw the wealth that could be obtained and\nbegan fighting over land. South Africa gained independence from\nGreat Britain in 1934. By 1948 the official policy of apartheid was\nfully in place.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Coloured#\/media\/File:Coloured-family.jpg\nIn the mid 1600s Europeans needed a place to stop along the\nlong trade routes to the east. South Africa was just the place.\nHere they could stop to restock on freshwater, food and goods\nthey needed. Soon the tip of Africa became the first white colony\nin South Africa. Dutch colonists, known as Boers or Afrikaners,\nbegan to flood in. Over time the colony grew, attracting settlers\n108 Life Under Apartheid\nAs the colonial period came to an end, South Africa became an Under the policy many\nindependent country in 1910. The new country’s government laws were created to\nwasted no time and enacted a constitution giving whites keep ethnic groups\ncomplete control over the national government. Separation separated and limit the\nbecame a way of life for the people living in South Africa. For right of the black South\ndecades it continued as a way of life, until 1948 when the ruling Africans. For example,\nwhites enacted a government policy making apartheid official. the right to vote was\nonly granted to people of\nEuropean descent.\nBlacks had to live in\nareas known as\n“homelands” where\nthere were fewer jobs\nand resources. There\nwere separate schools,\nhospitals, restaurants\nand movie theaters for\nWhites and people of\ncolor. Public\ntransportation was\nsegregated and signs\nappeared all over public\nparks and beaches\ndeclaring “For Whites\nImage source: http:\/\/simple.wikipedia.org\/wiki\/\nOnly.” Apartheid_in_South_Africa#\/media\/File:Apartheid.jpg\n109\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Apartheid_Museum_Entrance,_Johannesburg.JPG cities could travel from their ‘homelands’ to work. In other areas\nof the country, poor townships or slums were where many Blacks\nWhites lived very well under the policy of apartheid. White\nlived. They were allowed in the cities during the day time, but at\nschools were the best in the country. Whites had access to the\nnight were required to return to the slums.\nbest jobs, the best health care and the best overall living\nconditions. They of course controlled the government as well. Apartheid Ends\nAsians and coloreds were second\nApartheid did not go\nclass to the Whites. Schools and\nunchallenged; many groups\nother public services were limited.\nfought for decades trying to\nTheir political rights, such as voting,\ngain equality for Blacks in\nwere limited as well.\nSouth Africa. The most\nHowever, no group had it as difficult prominent group to protest\nas the black South Africans. They was the African National\nwere forced to move into the Congress (ANC). Founded\n“homelands.” These areas were in 1912, the ANC began\nmade up of some of the worst rural fighting against the unfair\nareas that South Africa had to offer. treatment by Whites prior to\nThere were few jobs and the ones apartheid becoming an\navailable did not pay well at all. official government policy.\nSchools were very bad and there By the early 1950s the\nwas little to no access to health struggle for equality and fair\ncare. Black South Africans were also treatment was drawing the\nlimited on where and how they could attention of the world.\nmove throughout the country. Free\nmovement was not allowed,\nhowever, those who worked in the\nImage source: http:\/\/en.wikipedia.org\/wiki\/Disinvestment_from_South_Africa#\/media\/File:Boycott_-\n_Contaminated_with_apartheid_-_South_African_goods.jpg\n110 Black South Africans protested the laws and unfair treatment. The notice, the United Nations condemned the policies of South\nwhite government responded by arresting many of the protestors Africa and, with the support of many countries, cut off trade to\nand black leaders. In 1952, South Africa.\nan ANC lawyer named\nBy 1989 many people around the world had become aware of the\nNelson Mandela took the\nunfair treatment of Blacks under apartheid. F.W. de Klerk, an\nlead in the fight for equality.\nAfrikaner, became the elected president of South Africa. In the\nMandela and the ANC began\npast, de Klerk had been an outspoken supporter of segregation.\na campaign to end the unfair\nEventually, he began to realize that South Africa would never see\ntreatment under apartheid.\npeace under apartheid. He made the decision to free Nelson\nSoon many black leaders,\nMandela and other leaders who had been jailed under the\nincluding Mandela, were\napartheid laws. Finally, by 1991 South Africa had abolished all\nImage source: https:\/\/www.flickr.com\/photos\/ixtla\/ jailed. As the world took\n2362881762\/ apartheid laws.\nIn 1994 democratic elections were held in South Africa for the\nfirst time in history. South Africans of all colors were allowed to\nvote. Nelson Mandela was elected as the first black president in\ntheir nation’s history. From there he worked with many prominent\nleaders, such as Desmond Tutu, to help heal the divisions that\nhad been created between the people of South Africa. Their\nprogram, the Truth and Reconciliation Commission, took the next\nseveral years to examine the human rights crimes that were\ncommitted during the apartheid years. In 1998 the commission's\nreport condemned violations of human rights by both white and\nblack South Africans. The commission also granted amnesty or\nforgiveness to some people who carried out some of the crimes.\nImage source: http:\/\/pixabay.com\/en\/nelson-mandela-quote-mural-belfast-539834\/\n111 Their work helped to create the groundwork South Africa needed\nto begin moving forward and recover from its past.\nCritical Thinking Activity:\nUse the links for Nelson Mandela Struggle in Posters. Answer\nthe questions using the materials on the webpage. Use the\nGoogle doc to analyze the different posters.\nInteractive 5.5 Mandela in\nInteractive 5.4 Historical\nPosters\nPoster Analysis\nUse the posters on this website to\nUse this Google Doc to analyze\nanswer the questions in the\nthe posters in the other link.\nGoogle Doc\n112 Section 4\nSub Saharan Africa Today\nQUESTIONS TO GUIDE INQUIRY South Africa Today\n1. How are we, as members of a global\nDespite all the changes, South Africa\nsociety, connected?\nstill has a long way to go. The\n2. How does history impact the culture of a\ngovernment has created new\nregion?\nprograms and opened up\n3. How do the people of Sub-Saharan Africa\nmany new job\novercome the many challenges they face?\nopportunities\nsince apartheid\nended. The\ngovernment has\npassed the\nEmployment Equity Act\nwhich identified the groups who\nhad been unfairly denied jobs in the\npast. Groups like blacks, coloreds, Asians, women and the disabled\nare now given equal opportunity under the law. Business must look at all people\nequally when they apply and give fair pay to all workers.\n113 Image source: http:\/\/commons.wikimedia.org\/wiki\/File:SouthAfricanStub.png\nHowever, there are still not enough jobs being created to supply\nall the people who need work. The growth in the economy has\nbeen slow. The number of unemployed people who are white has\nincreased, however the majority are still blacks, coloreds and\nAsians. This slow economic growth has led to an increase in\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:South-african-school-children.jpg\npoverty. People all over the country are struggling to meet the\nmost basic of needs.\nOne answer to the issue of poverty is education. For the most\npart, the more years a person has finished in school, the more\nmoney he or she will earn as an adult. Under apartheid,\nnonwhites had limited educational opportunities. Schools were\npoor, in disrepair and didn’t have the resources or qualified\nteachers to offer a good education. Once apartheid ended,\n114 Interactive 5.7 Changes\nchange came to the educational system. Students of all racial\nsince Apartheid\ngroups now attend the same school. More South Africans than\never are finishing high school and more are attending college. As\nmore and more nonwhites receive an education, opportunities for\nbetter jobs and a higher quality of life will continue to increase.\nOther areas of society are\nInteractive 5.6 South\nAfrica Steps Up Campaign improving as well. More and more\nto Create More Jobs\ncities are becoming less\nClick here to learn more about\nsegregated. Even with cities how the people of South Africa\nview the changes since Apartheid.\nopening up to all people, many\nnonwhites are not able to afford to\nlive in the nicer areas of the city.\nMany still live in the poor\ntownships and slums surrounding\nthe cities. The government has\nLearn more about how South\nAfrica is trying to create more jobs been making an attempt to correct\nto address one of their major\nthis issue. Over the years the\nproblems at this website.\nSouth African government has\nprovided many homes. The government is also working to\nimprove the township and slum areas. Streets and other areas of\ninfrastructure are being updated and installed. There are also new\nschools, police stations, and health clinics being built in these\nareas.\n115 The People of Sub-Saharan Africa Today\nSub-Saharan Africa has a rapidly growing population. Today the\nregion’s people number around 800 million and it has been\nestimated that with the current rate of growth, the region could be\nlooking at 1.5 billion by 2050. With this rapid rate of population\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:Africa_densidade_pop.svg\ngrowth, Sub-Saharan Africa rates as one of the largest areas of\ngrowth in the world.\nWhy has there been such an increase in population over the past\nfew years? There are several reasons. First, better medical care\nand sanitation have lowered the death rates for all people,\nespecially children. Second, during this time the region have seen\nsome of the highest birthrates ever. More than wealth and\nprivilege is the idea that large families are viewed as a necessity\nImage source: http:\/\/commons.wikimedia.org\/wiki\/ 116\nFile:Africa_at_night_(Cropped_From_Entire_Earth_Image).jpg in agricultural families. Visit the World Population Data Sheet to however much of the farmland in the region is being ruined by\nlearn more about the population of the region, World Population overuse, drought and erosion.\nData\nSo where do all these people\nInteractive 5.8 Africa:\nThis rapid population growth has brought on challenges to the live? The population is not\nCities on Frontline of\nregion. Many of the cities are overcrowded, leading to poor living evenly distributed throughout\nSustainable Development\nconditions. Basic services like clean water and electricity are not the region. The main cause of\nprovided everywhere. Many areas are also seeing stressed the uneven distribution is\nfarmland. Most people still rely on farming for jobs and food, because of areas where the\nland and climate are not\nwelcoming to people. Many of\nthese areas are desert where it\nis too dry to support either\nRead more about sustainable herding or farming. As a result,\ndevelopments in Africa here.\nmany of the region’s people\nlive along the coast. Not only do coastal areas provide friendlier\nlandforms for living conditions, but the climate is much milder and\nthe soil fertile.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Sahel#\/media\/File:Sahel_forest_near_Kayes_Mali.jpg\n117 The challenge of Health Care\nAs mentioned before, one cause of the rapid population growth in\nSub-Saharan Africa is the advancement of health care. More\nhospitals, clinics and medical centers are now open than in any\npoint in the region's history. Along with access to medical\nfacilities, more drugs and medical supplies are available to the\npeople. Even with this access, the death rates in the region\nremain high in comparison with the rest of the world. People still\nsuffer from malnutrition, poor health, as a result of not eating the\nright food or enough food.\nAnother health-related issue is the lack of access to clean water\nto drink or good sanitation services. While widespread famines\nhave killed many people, diseases such as malaria and ebola\nhave as well. These and other diseases are a few of the major\nImage source: https:\/\/en.wikipedia.org\/wiki\/File:Vegetation_Africa.png\nissues created due to the substandard health care found in Sub-\nAlthough many still rely on subsistence farming to provide for Saharan Africa.\ntheir needs, there is a growing trend in the region towards\nurbanization. Urbanization is the movement from the rural areas\nto the urban . The major pull factor towards urban growth is the\nhope of steady income. The hope of better jobs, healthcare and\neducation opportunities lead many to leave their old lives behind\nand move in pursuit of a better tomorrow.\n118 Economic Challenges area are very imbalanced. Due to unstable governments and the\neffects the colonization period had on the region’s economy and\nHow do the challenges of the environment and physical features\nsociety, many people rely on some type of agriculture to provide\nin Africa affect the economic activities of the people? The lives of\nfor their needs.\nthe people living in Sub-Saharan Africa are always impacted by\nthe physical environment surrounding them. The region is ever Farming is the main economic activity in Sub-Saharan Africa.\nchanging. One recent area of change is the involvement in the Somewhere around two-\nglobal economy. The people of the region face ever increasing thirds of the workforce\nodds, but this change in economic activities offers some hope for are involved in some\nnew opportunities. For many this may mean leaving their rural aspect of agriculture.\nvillages for the larger cities for work. Even though farming\nmethods and crop\nMany factors have gone into Sub-Saharan Africa being mostly a\nproduction have\ncollection of agricultural societies. The natural resources of the\nchanged, many still use\ntraditional methods\nwhen farming. Most\npeople in the region still\nuse subsistence farming\nto provide for the needs\nof the family.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Women_and_agriculture_in_Sub-Saharan_Africa#\/media\/\nFile:Guinea_Siguiri_farmer_woman.jpg\nImage source: https:\/\/en.wikipedia.org\/wiki\/File:Niger_millet_Koremairwa_1214.jpg 119 With so many people reliant on farming, how do the farmers meet\nthe challenges of living in Sub-Saharan Africa? Challenges like\nOnce their crops meet their families needs, anything else is taken\nto a local market to be sold or traded for items the family cannot\nproduce on their own. These\nfamilies live on small plots of\nland spread all throughout the\nAfrican countryside.\nA small portion of the\nworkforce has begun to work\non commercial farms. These\nlarge scale farms grow cash\ncrops, or crops sold for profit.\nMost of these farms are\nowned by large, foreign\ncompanies. They grow\nImage source: http:\/\/commons.wikimedia.org\/wiki\/File:%C3%81rbol_Cacao.JPG\npeanuts, cacao, and coffee.\novergrazing, overworking the soil, and lack of modern farming\nImage source: https:\/\/en.wikipedia.org\/wiki\/\nAgriculture_in_Angola#\/media\/\nThis method of farming came equipment make farming difficult. The use of commercial\nFile:Angolan_Potato_Farmers_(5687186090).jpg\nabout due to the colonial machinery, frequent use of the soil, and the clearing of forests\neconomic system that was put into place during the time of have created an erosion and desertification problem. This\nEuropean control. Both commercial and subsistence farming can particular issue relates to the growth of the desert due to the soil\nbe risky. The region lacks good farmland and one unfavorable loosing it’s natural nutrients and turning to sand. Farmers have\ngrowing season or a drop in the demand of a product can have a begun to use new methods to protect the land. They have begun\ndisastrous affect on the family or the economy of the area. to use different techniques of land-management to conserve the\nland. These methods include crop rotations, better fertilizers and\nseeds, and modern irrigation.\n120 How does an economy based heavily on agriculture join in with Today the region’s industry produces many products that just a\nthe global economy? As Sub-Saharan Africa has looked to few years back needed to be imported into the region. Food\nproducts and textiles, paper, leather and building materials are all\nareas of industry now produced in Sub-Saharan Africa. To\nproduce these, business have had to meet the challenges facing\nthem to create an industry infrastructure. Educational systems\nare still developing to provide people with the skill and education\nneeded to work these skilled jobs. New challenges seem to arise\nwhen others are met. Power shortages cannot meet the growing\ndemand for electricity and political conflict causes interruption in\neconomic planning and resource allocation. Even with a growing\nlist of challenges, the people of Sub-Saharan Africa are finding\nways to meet them.\nCritical Thinking Questions\nImage source: http:\/\/www.google.com\/imgres?imgurl=https:\/\/farm6.staticflickr.com\/ 5 Themes Review - The last few pages have discussed challenges in\n5168\/5367322642_458bff8f01_o_d.jpg&imgrefurl=https:\/\/www.flickr.com\/photos\/ciat\/\nfarming in the region. How have sub-saharan Africans adapted to or\n5367322642&h=2848&w=4288&tbnid=qSf7EisM4veazM:&zoom=1&docid=In8QZZ4GsgofFM&ei=m8FIVdfeLtjjoASsi\nYCgCA&tbm=isch&ved=0CCAQMygEMAQ changed their environment?\nThe people of Africa face many different challenges. What are some\nmodernize itself, the people have looked towards different\nways people around the world could help the people of Africa? What\neconomic opportunities. The region has begun to develop more\nare ways that you, living in Michigan, could help?\nmanufacturing but with the lack of trained workers, facilities and\nthe equipment to process the natural resources they have, many\ncountries have to develop industry from the ground up. To do this,\nmany have to look to foreign loans and investments.\nUnfortunately the process has been slow.\n121 Section 5\nThe Global Connection\nQUESTIONS TO GUIDE INQUIRY Global Connections-\nWorld's growing\n1. How are we, as members of a global\nsociety, connected? deserts\n2. How does history impact the culture of a\nAre the deserts of the\nregion?\nworld growing? The US\n3. How do the people of Sub-Saharan Africa\nDepartment of\nAgriculture\nmap on this\npage shows\nthe different\nareas of the\nworld that are\nthreatened by\ndesertification.\nDesertification\nis a process\nwhere land\nImage source: http:\/\/en.wikipedia.org\/wiki\/Desertification#\/media\/\nthat is\nFile:ShrinkingLakeChad-1973-1997-EO.jpg\nrelatively dry\nLake Chad is shrinking. In the photo you can see how Lake Chad has reduced in size\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/68\/Desertification_map.png becomes\nover the past 30 years. The blue area in the middle is the water, as desertification has\ntaken place, the water has dried up.)\n122 more and more arid. Typically these areas begin to lose their has an impact on the growth of deserts. Poor farming methods,\nbodies of water as well as the vegetation and wildlife that relies overgrazing, deforestation and nonnative plant life can all leave\non the fresh water and fertile soil. marginal land open to erosion.\nThere are a number of factors that cause desertification, some are How can people adapt to living in these areas? What can be done\ncreated by human activities others are due to larger processes. to prevent further harm? All over the world people are dealing\nwith the issue of desertification. In areas around China, people\nClimate change is believed to be one factor in this process. In a\nare trying multiples farming methods. One example is using crop\nnumber of areas long periods of drought has sped up the\nrotation or a resting season, so that farm land can become fertile\nprocess. The other major factor is human activities. The way that\nagain and erosion can be reduced. In other areas, programs to\npeople use the lands around the desert, known as marginal land,\nprevent land from drying out as well as programs designed to\nprevent forest fires have ben created to keep the forests and\ngrasslands from being destroyed. Less developed countries\nstruggle with ways to afford these large scale projects.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Desertification#\/media\/File:Cabrasnortechico.JPG\nHerd of goats in Chile, overgrazing is one activity that has led to desertification worldwide.\n123\nImage credit: https:\/\/en.wikipedia.org\/wiki\/Desertification#\/media\/\nFile:North_Sahara._Anti-sand_shields.jpg Click on the following links to learn more:\nInteractive 5.9 National\nGeographic Interactive 5.10 USGS\nInteractive 5.11 Interactive\nLearn more about desert threats Learn more about Desertification Journal\nat this website! at this website!\nLooking through the Eyes of the World Your interactive journey\nthrough geography: Record your thoughts to the essential\nquestions in your journal.\nPlease note: once you have\ncreated your own copy of this\ndocument, this widget will only\nreturn you to the blank copy. You\nwill need to access yours by\nopening from your own Google\nDocument.\n124 Chapter 6\nSouth Asia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society, connected?\n2. How does population growth impact a region?\n3. How does the population of a place impact how and where\nyou live? Section 1\nIntroduction - South Asia\nQUESTIONS TO Over seven billion (7,000,000,000) people live on planet\nGUIDE INQUIRY Earth. South Asia has over 1,000,000,000 people alone.\nGeographers determine regions of the world differently,\n1. How are we, as\nmembers of a usually based on characteristics that an area shares, such\nglobal society,\nas language, climate, religion or economic similarities. For\nconnected?\nour purposes, South Asia includes: India, Nepal,\n2. How does\npopulation\ngrowth impact a\nregion?\n3. How does the\npopulation of a\nplace impact\nhow and where\nyou live?\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/f\/f3\/\nSouth_West_Asia_location_map.svg\/1280px-\nSouth_West_Asia_location_map.svg.png\n126 the north. Sri Lanka lies just off the coast of southeastern India\nand The Maldive islands stretch down toward the Equator.\nMore than 1 billion people live in one country in this region - India,\nalone, with predictions of it soon surpassing China within a\ndecade or two. The map above shows the population of major\nworld regions. As you will see in following sections a population\nthis large presents some major challenges to people living in the\nregion.\nInteractive 6.2 Top\nInteractive 6.1\n10 Populated\nPopulation Clock\nCountries\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/de\/World_population_pie_chart.JPG\nAfter China and India, what is the next largest slice of of the pie\nchart above?\nIf India has 1.2 Billion people living there, approximately how many The world population is\nconstantly growing! Visit Learn more about the 10\npeople might there be living in that next largest slice?\nthis website to learn more most populated countries\nabout the estimates and at this website (requires\nwhat population growth internet connection)\nBangladesh, Bhutan, Pakistan, Sri Lanka and the Maldives. India,\nmeans. (requires internet\nconnection)\nwith over one billion people alone, is the second most populated\ncountry in the world, following China.This “subcontinent” is\nsurrounded by the Arabian Sea to the west, the Indian Ocean to\nthe south, and the Bay of Bengal to the east. Bhutan,\nBangladesh and Nepal sit nestled in the Himalayan Mountains to\n127 In this chapter we will be studying the theme of “region” while\nlearning about this portion of the world. A region is a man-made\nlabel that helps divide the world into manageable chunks for\nstudy. Typically a region has a unifying characteristic, a\nsimilarity that brings the territory together, but not everyone\nagrees on regions. Even the authors of this book disagreed on\nwhere to group certain parts of the world.\nHow Are Regions Determined?\nSometimes a region is defined by physical characteristics. This\ncan include climate, soil, and vegetation patterns. Others are\ndivided by human characteristics such as culture, political\nstructures, and economies.\nThe map on this page shows the regional areas of the United\nStates as defined by the U.S. Census Bureau. Michigan is part of Image source: https:\/\/en.wikipedia.org\/wiki\/List_of_regions_of_the_United_States#\/media\/\nFile:Census_Regions_and_Division_of_the_United_States.svg\nthe Midwest. If someone lives in California however, is the Mid\nWest really west? This is one problem with labeling a region. In\nthe chapter on North Africa and the Middle East, the term\nAssuming that you are a student in Michigan:\n“Eurocentric view” was introduced. A person in South Asia\nWhat region of the state do you live in?\ndoesn’t think of themselves as South Asian. They think of\nthemselves as Indian if they come from India. They consider What region of the country do you live in?\nthemselves Nepalese if they come from Nepal. This is one\nWhat makes your region a region?\ninstance of where it is not cultural characteristics that label a\nregion, but rather, physical characteristics, as you will learn in the\nnext section.\n128 Section 2\nPhysical Geography\nQUESTIONS TO GUIDE INQUIRY India is the largest country in South Asia spanning\nInteractive 6.3 Google\nalmost 1.3 million square miles. It is the seventh Maps - South Asia\n1. How are we, as members of a global\nsociety, connected? largest in the world and one-third the size of the\nUnited States. India has 22 official languages, with\n2. How does population growth impact a\nregion? 1,000 additional languages and 22,000 dialects-more\nthan any other country in the world. Most of their\n3. How does the population of a place impact\nhighly educated citizens speak English as a second\nhow and where you live?\nlanguage. Over 41% speak Hindi.\nThe Himalayan Mountain range stretches for nearly Explore the area with this\nembedded Google Map!\n1,500 miles, from Pakistan to Bhutan, along the ridge\n(Requires internet connection)\nof India, separating it from Nepal. Mt.\nEverest, the tallest mountain in the\nworld, reaches a height of 29,035 ft.\nMillions of years ago, sliding tectonic\nplates forced this mountain range to\nseparate northern Asia from South Asia,\nforming a natural barrier against trading\nor traveling. You will learn more about\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/79\/Himalayas.jpg\nthis when you study the history of the\nancient world.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/58\/\nHimalayas_Map.png\n129 Within the same region lies one of the flattest areas on Earth-the The Deccan Plateau is the peninsular part that juts into the Indian\nIndo-Gangetic Plain, sitting between the Himalayan Mountains in Ocean. It is surrounded by the Western and Eastern Ghats\nthe north and the Deccan Plateau to the south. The Ganges River, Mountain ranges, where roaming monkeys and elephants can be\nnearly 1600 miles long, runs through this area, emptying into the found.\nBay of Bengal leading to the Indian Ocean. It is considered\nNepal\nsacred by Hindus, who travel there to bathe in its holy waters and\nwash away their sins. This area is ripe for agriculture, making it\nNepal, a landlocked country about\nideal land for farmers. The Indus and Brahmaputra Rivers also run\nthe size of Florida, lies between\nthrough this landscape.\nChina to the north and India to the\nEdmund Hillary a New Zealand\nsouth. Of the ten highest peaks in\nIn the northeastern part of India is Cherrapunji, in the Assam Hills, native and Tenzing Norgay, a\nthe world, eight rest in Nepal, with\nsherpa were the first to reach\none of the wettest parts of the world with an average rainfall of 35\nthe majestic Mt. Everest being the the top of Mt. Everest on May\nfeet, or 428 inches a year.\ntallest. 29, 1953. Initial attempts\nstarted as early as 1921 but all\nSherpas are an ethnic group that fell short of reaching the\nlive in the region. Many are summit. Since the initial\nInteractive 6.4 Rainfall in ascent, over 10,000 people\nexperienced climbers who often\nCherrapunji\nhave attempted, with over 1700\nguide mountain climbers. The\nmaking it and 175 died while\nrugged Himalayas separate Nepal\nattempting The mountain is\nfrom China, with hilly terrain in the\nnamed after Sir George\ncentral region and flattening out to\nEverest, the first person to\nthe south into swampland and record the location and height\nforests. The highest percentage of of the mountain..\npeople that practice Hinduism live in\nNepal; however, Buddhism, founded\nLearn more about the rainfall in\nCherrapunji with this video\nby Prince Siddhartha Gautama of\n(requires internet connection)\nLumbini, is determined to have been\n130 born in Nepal around 560 B.C.E. Nepal recently experienced a severe and destructive earthquake\non April 25, 2015, measuring 7.8 on the Richter Scale and killing\nWith few cars available, most people continue to travel on\nupwards of 10,000 people. The last significant earthquake of\nfoot.The one international airport is found in Katmandu, the only\n1934 killed 17,000. Katmandu is an overcrowded and poor place\nmajor political city in the country and the most densely populated\nthat rests near a major tectonic plate. When new construction\narea of the region. Being one of the least developed countries in\noccurs, there are no codes to insure they can withstand major\nthe world, many people are isolated due to the rugged and\ndisasters, such as earthquakes.\nmountainous terrain.\nBangladesh\nBangladesh, is home to 156 million people making it one of the\nmost crowded places on earth. Bangladesh is a country smaller\nthan the state of Iowa, an dhome to 156 million people, making it\none of the most crowded places on earth. It is mostly a flat,\nfertile land, full of flourishing wild and plant life. The swampy\nSunderbans forest in the southeast is home to the endangered\nBengal tiger. This area is often hit by cyclones and tidal waves,\ncausing severe flooding. During the rainy seasons, overflowing\nwaters flood farms, often ruining crops, providing even less food\nfor its growing population. This country is one of the poorest in\nthe world. Although most people there are farmers, there is still\nnot enough food to feed everyone.They are the largest producers\nof jute, a crop fiber used to make burlap. Like India and Pakistan,\nBangladesh was ruled by Great Britain until their independence in\n1947. At that time, Pakistan broke off into East and West\nPakistan; however, separated by 1,000 miles. In 1971, East\nPakistan became Bangladesh. Although disease and poverty are\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/39\/2015_Nepal_depremi_(6).jpg\n131 rampant, economic growth is slowly increasing. come from northern India and practice Buddhism. From southern\nIndia are the Tamils, following the Hindu religion. Most Sri\nLankans are farmers, but wood carving, basket weaving, jewelry\nmaking and pottery are popular. Like other people living in this\nBhutan\nregion of the world, Sri Lankans live with the threat of natural\nBhutan is a mountainous, landlocked country sitting between\nhazards. For example, a tsunami in 2004 killed over 30,000 Sri\nIndia and China with 751,000 people in an area of 46,500 square\nLankans.\nmiles.This predominantly mountainous area is home to some of\nThe Maldives\nthe highest, snow covered peaks in the world, reaching up to\n23,000 feet. Only monks live in the highest regions of the\nThe Maldives, the smallest country in South Asia, is made up of\nmountains in a few remote monasteries. Three-fourths of the\nnearly 1,200 islands that stretch southwest of India in the Indian\npeople practice Buddhism, with the minority being Nepalese and\nOcean and are surrounded by coral reefs. Many islanders migrate\npracticing Hinduism. Thunderstorms and heavy rains are\nto Malé, the capital. Only 210 of the islands are inhabited by\ncommon. Most people in this country either farm crops such as\nhumans. Palm trees and other plant life are found on these tiny\nwheat, rice, corn, and barley, or tend livestock, such as cattle,\nislands, with no island bigger than five square miles. Fishing is the\nyaks, and sheep.\nisland’s main source of income, as is tourism. The islands have\nmany master boat builders, creating boats holding up to 12\nSri Lanka\npeople. Many of the islands are getting bigger, while others are\nSri Lanka, formerly called Ceylon, is a small island about the size\nslowly eroding away. The coral reefs surrounding these islands\nof West Virginia. It lies between the Bay of Bengal to the north,\nare home to many varieties of sea life. Over 400 miles of sandy\nthe Gulf of Mannar to the west and the Indian Ocean to the south.\ncoastlines and beautiful lagoons attract thousands of tourists.\nIt is 20 miles off the coast of India, separated by the Palk Strait.\nThe people of the Maldives are Sunni Muslim, with the only\nSeveral landforms are evident in this small country: mountains in\naccepted religion being Sunni Islam. Visitors may quietly practice\nthe center, plains along the outer edges, a rainforest in the\ntheir personal religion; however, no other homes of worship are\nsouthwest corner. Wild animals, such as bears, crocodiles,\navailable.\nsnakes, elephants and monkeys call this home, along with over\n3000 plant species. The bulk of the people are Sinhalese who\n132 Weather in the Region\nInteractive 6.5 Interactive 6.6 If the World\nInvestigating Regions Were a Village\nExtreme weather conditions exist in South Asia. The southeast\nregion receives record breaking rainfalls and the western part is\ndesert. Devastating monsoons flood this area in the summer\nwhile the winter often brings extreme droughts and temperatures\nreaching 110° Fahrenheit. (Visual showing actual rain and desert.)\nVacationers and the wealthy flock to the hills, or spots at a higher\nelevation with cooler temperatures, to escape the heat and\nhumidity.\nUse this handout and Google to Take another look at the “If the\nlearn the answers to the questions World Were a Village” video.\non this handout. (Requires\ninternet connection)\nIf the video above were the only tool available to you,\nwould you be able to label regions of the world using\nphysical characteristics or human characteristics?\nExplain your answer.\n133 Section 3\nHistory\nQUESTIONS TO GUIDE INQUIRY The history of India dates back 6,000 years ago when the first people who lived\nthere practiced both hunting and gathering. First settlements began near the Indus\n1. How are we, as members of a global\nsociety, connected? River Valley where the ground was fertile and ripe for planting due to river flooding.\nThriving for over 900 years, they traded across the Arabian Sea.\n2. How does population growth impact a\nregion?\n3. How does the\npopulation of a Around 1500 B.C.E. the Aryan, or lighter skinned, Indo-\nplace impact\nEuropean people, intruded upon the darker skinned, native\nhow and where\nDravidians, pushing them out. With them came the\nyou live?\nbeginnings of Hinduism, spreading across India. The\nBuddhist religion entered India in 563 B.C.E. due to\nSiddhartha Gautama and his approach to achieving a\npeaceful state of mind. The Mauryan Empire, the first\nempire, started in 321 B.C.E. and introduced a numerical\nsystem and the numeral zero (0), value of Pi, and the\nlength of the solar year. Buddhism continued to spread.\nThe Taj Mahal took 22,000 workers, 11,000 elephants and 22 years to complete. It was\nfinished in 1653.(caption for Taj Mahal)\nThe Gupta Empire, from 320-550 C.E., flourished with the\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c8\/ advancement of the arts and sciences and the continued\nTaj_Mahal_in_March_2004.jpg\nspread of Buddhism. The invasions of the Huns brought\n134 this empire to an end. During the Mogul Empire from 1526-1726 after, 10 million people left: Muslims for Pakistan, Hindus for\nA.D., the Shah Jahan built the famous, white marbled Taj Mahal in India. The Muslim people wanted their own country; however,\nmemory of his favorite wife. He was later overruled by his son, Gandhi’s opposition to separating the people was not well\nAurangzeb, in 1659, who imprisoned his father and beheaded two received. A man named Nathuram\nof his brothers. Godse, who was a Hindu Nationalist Gandhi was born in 1869 in\nassassinated Gandhi in 1948. Godse Porbandar, India. He studied\nlaw in London. Upon his\nhad ties to an extremist group that\nreturn to India, he soon left\nopposed nonviolence and thought\nBy the 19th century, Great Britain controlled the country with the\nfor South Africa, a country\nGandhi favored Pakistan. Over the years\nBritish East India Co., investors hoping to trade with India.\nalso controlled by the\ntensions have continued between India\nAlthough, they did bring modern conveniences to the area such British. In 1915, 21 years\nand Pakistan\nas the railroad system and the telegraph, they were brutal to the later, he went back home to\nfight the oppression of his\nthe Indian People. During WWI, Indians served in the British army\npeople. One example of his\nwith the promise they would have their own government at the\ncivil disobedience was\nend of the war; however, that promise was not kept. Peacefully\nleading hundreds of people\nprotesting the government, the much revered leader Mohandas\non a 240 mile trek to the sea\n(later Mohatma, meaning “The Great One) Gandhi was arrested\nto make their own salt,\nseveral times for his civil protests and sit ins. which had to be purchased\nInteractive 6.7 Gandhi from the government, from\nAt the start of WWII, he demanded\nBiography salt water. These types of\nindependence from Great Britain and was protests led to his arrest\ndenied. At the conclusion of the war, with Great and imprisonment.\nBritain financially and emotionally drained, they\nestablished Jawahalal Nehru as India’s Prime\nMinister. Tension between Muslims and Hindus\nincreased, due in part to such a heavy presence\nof Hindus. Pakistan and India were granted their\nLearn a little more about Gandhi\nseparate independences in August, 1947. Soon\nand his beliefs in this short video.\n(Requires internet connection)\n135 Section 4\nPopulation\nQUESTIONS TO GUIDE INQUIRY Bangladesh currently has a population that has exceeded 150 million. If you recall\nfrom a previous section, this is a small country that is roughly the size of Iowa in\n1. How are we, as members of a global\nsociety, connected? the United States. Iowa, in contrast to Bangladesh, has only 3.1 million people\naccording to the 2014 United States Census.\n2. How does population growth impact a\nregion?\nThe region of South Asia overall is over 1.7 billion. Population is a major challenge\n3. How does the population of a place impact\nfor all countries, and will continue to be so over the coming decades.\nhow and where you live?\nWith this in mind, how has population growth impacted South Asia? To answer\nthis question, first take a look at the two\nmaps on this page.\nThese maps show the population density of\ntwo areas - Iowa and Bangladesh. What do\nyou notice about the differences in\npopulation density in these two different\nareas?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/93\/\nIowa_population_map.png\n136 To determine the population density of a region, all you need to Try using the same formula to decide whether or not the\ndo is find out how many people are living there and divide by the population density of Bangladesh is similar to that of the United\nsize of the area. States:\nPopulation of Iowa: 3,107,000 (approximate) Population of the United States: 314,000,000 (approximate)\nPopulation of Bangladesh: 156,600,000 (approximate) Population of Bangladesh: 156,600,000 (approximate)\nSize of Iowa: 145,743 Square Kilometers Size of United States: 9,842,000 Square Kilometers\nSize of Bangladesh: 130,170 Square Kilometers Size of Bangladesh: 130,170 Square Kilometers\nUsing the formula provided above, what is the population density\nof Iowa?\nWhat is the population density of Bangladesh?\nWhich country is more crowded?\nWhat problems might living in a crowded area cause?\n137\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/21\/US_population_map.png There are two important things to note about the second part of\nthe activity you just completed. The first is that the United States\nis much larger than Bangladesh. You probably noticed that by\nusing the mathematical formula provided, the United State’s\npopulation density is much lower than that of Bangladesh. The\nsecond thing to note about this activity is that people cannot live\neverywhere in the United States. High mountains, large deserts,\nextreme temperatures and other natural barriers to settlement\nexist. Because of this, when studying population it is also\nnecessary to study the population distribution of an area.\nThe average population density for the planet overall is around 48\npeople for every squared kilometer. You can arrive at this average\nfor the planet overall by using the same formula you used to\ncalculate Iowa and the United States. The problem becomes,\nwhen studying the world overall, that the formula assumes that\nthose people are evenly spaced out around the planet, when in\nfact, they are not.\nTake a look at the Population Density map of Bangladesh once\nagain. Where are the areas of highest concentration of people?\nWhere are the lowest areas of concentration?\n138 Problems with Population time out doors, especially during the time of day when pollution\nlevels have reached their highest. Add that to the fact that there\nSqueezing that many people into one area does not come without\nis one qualified doctor for every 25,000 people on average, and\ncosts. While you will learn more about some of the population\nBangladesh can be considered to have some steep problems to\nissues other countries in South Asia are facing in the next section,\novercome.\nwhat problems does Bangladesh face?\nLike many countries in the region, they face issues of\noverpopulation. The population is expected to reach over 200\nMillion by 2050. While the birth rate has started to taper off, the\noverall population continues to increase.\nOver a quarter of the population lives below the poverty line. This\nmakes several other population related issues big problems for\nthe citizens there. Many people there have an inadequate diet\nand suffer from food shortages. This problem is worse in\nchildren. Almost two-thirds of the child population under five are\nconsidered under-nourished.\nBecause the population is impoverished, there is a shortage of\naffordable housing in the region. This has lead to a rise in slums\nwhere many people end up having to live due to the lack of other\nchoices.\nThe air quality in the region, due partially to industrial and vehicle\npollution has become a major concern for the people living in\nBangladesh. This has led to increased risks of being born with or\ndeveloping asthma, and led to other respiratory and neurological\nproblems. The problem is worse in children who spend more\n139 Section 5\nThe Global Connection\nQUESTIONS TO GUIDE INQUIRY Global Connections: India\n1. How are we, as members of a global\nOne-fifth of the world’s population is in South Asia. Today the people living there\nsociety, connected?\nencounter less poverty and disease, and can enjoy a longer life expectancy.\n2. How does population growth impact a\nregion? India is a diverse country with hundreds of languages spoken, 22 of them official.\nSeventy percent of people living in India live in rural villages in dried mud and\n3. How does the population of a place impact\nhow and where you live? straw homes, working in low wage jobs: farming, agriculture, handicrafts, fishing.\nConditions are poor, skills are few\nand unemployment is high. India is\nthe top producer of many goods:\nbananas, mangoes, jute (a long\nvegetable fiber used to make burlap),\niron, and steel. Rice is a mainstay of\nfarmers to feed their families.\nHowever, rural to urban migration is\noccurring. Mumbai, formerly called\nBombay, has more people than New\nYork City. It is a small island off the\nwestern coast and bridges link it to\nthe mainland. Seventy percent of the\npopulation is under the age of 40\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2a\/Jute_Rope_(%E0%AE%9A\n%E0%AE%A3%E0%AE%B2%E0%AF%8D_%E0%AE%95%E0%AE%AF%E0%AE%BF%E0%AE\n%B1%E0%AF%81).jpg 140 class has doubled. New Delhi, the capital city since 1931, has a\npopulation of 22 million people. This modern city is full of\nskyscrapers, palaces, gardens and parks.\nWhen Americans call companies for technical support, they often\nspeak with a college-educated student in India, earning a much\nlower wage than students in the United States. India also has a\nthriving movie industry. Americans generally think of Hollywood\nas being the movie capital of the world; however, it is Bollywood\nin Mumbai that produces 800 films a year in comparison to\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/66\/Mumbai_skyline88907.jpg\nHollywood’s 500-600 films.\nwith 600 million people under 25 years old. With the population of\nthe United States and China aging, India’s population is young,\nvibrant and excited for their bright and promising future. It is\nThe people of India still face many challenges. Bridges, roads,\nestimated that by the year 2030, India could almost wipe out their\nairports and railroads are in poor condition. They have more\npoverty stricken areas.\ntraffic deaths than anywhere in the world with the majority being\nschool-aged children. Their caste system, dating back to ancient\ntimes, still exists despite it being outlawed in 1950.\nIn the early 1990s, the government moved away from socialism,\nallowing foreign businesses to come, opening up a free market.\nWith lower wages and many of their youth speaking English,\nAmerican companies settle in India attracting young people.\nStarbucks, Nike, Gap and Wi-Fi are all recent additions to India\nand the young people flock to anything coming from the Western\nworld. Poverty has been reduced by 9% a year and their middle\n141 Dalits, formerly called Harijan, or\nuntouchables, are the lowest\nmembers of the caste system still\npracticed in India today. They face\ninferior accommodations and\ndiscrimination, not to be touched\nbecause they do the dirtiest and\nlowliest of jobs, such as clearing\nanimal carcasses from the street,\nor cleaning toilets. About 170\nmillion people, or 17% are among\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/75\/Caste_System.jpg\nthis group. Priests belong to the\nOver one-third of their population remains illiterate. Their\nhighest order of the caste system,\ngovernment run educational system is poorly run and many\nfollowed by rulers, traders and\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/\ncommons\/c\/c7\/ families pull their children, enrolling them in private schools.\nfarmers. Gandhi worked\nDalit_or_Untouchable_Woman_of_Bombay_(Mumbai)_ac\ncording_to_Indian_Caste_System_-_1942.jpg\nIndia produces more millionaires each year than any other country\nInteractive 6.8 Interactive\nextensively to eradicate this Journal in the world, they also have one-third of their population living on\nthinking, often visiting slum areas 56 cents a day.\nand staying in homes of the\nOver 80% of people living in India practice Hinduism. Hindus\nHarijan.\nrevere life and often believe that souls live eternally and come\nback in a different life form. Animals are sacred creatures,\nGo to your interactive journal\nespecially the cow, having its own holiday - Gopastami, when\nand compare the caste\ncows are decorated with ribbons and flowers. Islam is practiced\ndiscrimination in India to racial\nPlease note: once you have by 138 million Muslims, the second largest Muslim population in\ndiscrimination in the United\ncreated your own copy of this\nthe world. They believe in the teachings of Muhammad and follow\ndocument, this widget will only\nStates.\nreturn you to the blank copy. You\nthe Qur’an, their holy book. Jainism and Sikhism are also major\nwill need to access yours by\nopening from your own Google 142\nDocument. religions. Sikhism, dating back to t he 16th century, is a like Mumbai, but slums are\nmonotheistic religion that stresses the importance of prevalent as well. Roofs are\ndoing good actions rather than merely carrying out rituals. flat, so they can be used to\nJainism is based on a reverence for life, self-denial and a grow gardens, hang clothes out\nvegetarian lifestyle. to dry and avoid the heat\ninside. The poor will find any\nWomen typically wear a saree (sometimes spelled sari), or\navailable materials to create a\npants with knee-length shirts and jewelry representing\nmakeshift home, such as\nwealth and\/or religion. The saree is a traditional form of\naluminum and plastic. Families\ndress that has remained part of the culture for centuries.\nthat live in rural areas will have\nWomen are often seen with a bindi, a colored dot on their\nhomes made of brick, mud,\nforehead, representing femininity and marital status. It is\nstone and bamboo. Air\nconsidered an adornment and becoming more optional.\nconditioning is rare, even in\nOnce widowed, the bindi is not worn. Men usually wear\nlarger cities.\nsuits or a dhoti, a cloth wrapped around their waist.\nYoung people tend to be seen in trending Westernized\nclothing.\nRice is the most common food in most of India; however,\nin the north wheat is quite common. Meals are typically\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/\nspicy, and often include onions, coconut and curry. Most 7\/7c\/Sari_bleu.jpg\nIndians are vegetarians; Hindus do not eat beef, as the\ncow is sacred and Muslims do not eat pork or drink alcohol.\nTraditional families will eat with their right hand only, or with a\nbanana leaf. Women eat last and may be malnourished. More\nurbanized citizens will use utensils and a more Westernized diet is\nnot uncommon. High rise apartments are plentiful in big cities,\n143 In most cases,\nmen are typically\nthe head of the\nhousehold.\nWomen take care\nof all household\nchores and\nusually stay\nhome to raise the\nfamily. It is\nbecoming more\ncommon for\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/73\/Slum_in_India.JPG\nwomen to seek\nan education. If a\nwoman works outside the home, she continues to take care of\nInteractive 6.9 Culture\nthe household. A baby’s first haircut is a meaningful and sacred\nGrams - India\ntime. Within their first three years, the entire head is shaved to\neliminate past imperfect traits and to ensure a thick head of hair. Interactive 6.10 India Map\nPuzzle\nReligious holidays often unify India: Muslims celebrate the Hindu\nholidays of Diwali (Festival of Lights) and Holi, while the Hindus\ncelebrate Eid al-Fitr, a celebration marking the end of Ramadan. It\nis common to celebrate the Christian holiday of Christmas. The\npeople of India have their own Independence Day and New Year\nUsing your knowledge of the\nregion as well as the information\nto honor, as well. Gandhi’s birthday on October 2 is a special day\nat this website write a response\nwith prayer services and religious services to honor the person about what makes you similar to\nIndian sixth graders. Do this in Test your knowledge of this region\nwho led the struggle for freedom and independence.\nyour Interactive Journal. with this interactive map puzzle.\n144 People of Mumbai\nWhat challenges might students in Mumbai have?\nThink about what it would be like to live in a country in South\nAsia. How do you currently get to school? Do you ride a bus?\nWhat challenges might students in Detroit have?\nDo your parents take you there themselves? Maybe you walk?\nHow do students in countries in South Asia get to school? How\nDo Mumbai and Detroit share similar problems?\nmight your classroom compare to theirs? How might your lunch\ncompare to theirs?\nWhat would a student from Mumbai be most surprised by if visiting\nDetroit?\nThe largest city in Michigan is Detroit, with a population just\ntopping 700,000 people. India’s most populated city, Mumbai,\nhas over 12,000,000 people. Think about the following questions As a tour guide for your region of the state, what would you show a\nas you write a response in your interactive journal. visiting student from Mumbai?\nOur earth is a crowded place, with a large population living in\nSouth Asia. Think about how the\npopulation of South Asia might affect\nInteractive 6.11 Distance -\nyou and jot your notes in your\nMumbai\ninteractive journal.\nTake a look at the journey you\nwould take from Lansing to\nMumbai.\n145 Chapter 7\nEurope and\nRussia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we as members of a global community\ninterconnected?\n2. How do governments differ around the world?\n3. How does our government compare to others? Section 1\nPhysical Geography - Russia\nInteractive 7.1 Google\nQUESTIONS TO GUIDE INQUIRY Geography\nMaps - Russia\n1. How are we as members of a global\nRussia, with over 6.6 million square miles of varied\ncommunity interconnected?\nclimate and landscape, is the largest country in the\n2. How do governments differ around the\nworld. It is nearly twice the size of the United States\nworld?\nor Canada. Covering almost one-eighth of the Earth’s\n3. How does our government compare to\nsurface, it ranges from the Arctic Circle in the north,\nothers?\nto the borders of China in\nthe south, from Europe in\nUse this interactive widget to\nthe west to the Pacific zoom in on and see the physical\ncharacteristics of Russia. What is\nOcean to the east. It\nyour description of where Russia\nspreads through two is located?\ncontinents and 11 time\nzones. The Ural Mountains, some of the oldest\nmountain ranges, stretch from the north to the south.\nRussia borders more countries than any other and has\n12 major seas.\nSiberia, in the north, covers three-fourths of this\nlandscape, with most of it being frozen tundra in the\nfar north, meaning very little can grow because it is\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/3c\/Russia_edcp_relief_location_map.jpg too cold. Okmyakon is the coldest inhabited city in the\n147 world with temperatures dipping down to -70°F. Only small trees, The Kamchatka Peninsula juts into the Pacific Ocean, nearing the\nshrubs and moss survive the frigid temperatures. Winters are long tendrils of Alaska. Over 150 volcanoes hover over the people\nwith few people inhabiting this region. The endangered Siberian living there. Most are non-active, but the threat of dangerous\ntiger can be found in this region. Permafrost, or frozen ground, eruptions looms. The chain of islands rests within the Ring of\nprevents any agriculture. Fire. The Kuril mountain chain, made up entirely of volcanoes,\nreaches from the southern tip of the Kamchatka Peninsula to\nForested areas are\nnorthern Japan.\nsouth of the tundra\nwhere pine trees and\nevergreens are found.\nMost of the western\npart of the country is\nforests and steppes,\nor dry, flat plains,\ncovering a major\nportion of the\nremaining land. Russia\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/b\/b9\/\nP.t.altaica_Tomak_Male.jpg\/640px-P.t.altaica_Tomak_Male.jpg\ncontains four of the\nworld’s largest rivers:\nOb, Volga, Yenisei and Lena. The Lena stretches for 2,800 miles\nand is also one of the world’s longest rivers. Lake Baikal, believed\nto hold one-fifth of the world’s fresh water, is the oldest and\ndeepest freshwater lake in the world. Over 330 rivers flow into the\nBaikal and nerpas, one of the only freshwater seals in the world is\nImage source: https:\/\/farm8.staticflickr.com\/7404\/12185220474_77940a013e_o.jpg\nfound in this lake.\n148 Moscow, the capital, is located in the western part of the country various other structures. It was initially constructed in the 1500s\nwhere the largest population live along the Moskva (Moscow) and has had many improvements and additions over it’s long\nRiver. The Moscow Kremlin, an ancient fortress, rebuilt to retain history, always serving as a seat of power for those who ruled.\nits ancient heritage is home to the Russian central\ngovernment. In addition to being the official residence for the\nPresident, it includes five palaces, four cathedrals, and\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/13\/\nRed_square_Moscow_cityscape_(8309148721).jpg\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c2\/ClimateMapWorld.png\nUsing the climate and physical maps on this page,\nanswer the geographic question: “What is it like\nthere?”\n149\nImage source: https:\/\/en.wikipedia.org\/wiki\/Geography_of_the_Soviet_Union#\/media\/File:SovietUnionPhysical.jpg Section 2\nPhysical Geography - Europe\nQUESTIONS TO GUIDE INQUIRY Approximately 50 countries make up Europe, including the world’s smallest\ncountry and parts of the world’s largest country. Russia, the largest, extends all the\n1. How are we as members of a global\ncommunity interconnected? way to the eastern part of Asia and the Vatican City, in Rome, is the smallest at .17\nsquare miles. Less than 840 people live there, yet they have their own currency,\n2. How do governments differ around the\nworld? post office, and security. The famous Sistine Chapel’s ceiling painted by\nMichelangelo in the early\n3. How does our government compare to\n1500s attracts many\nothers?\nvisitors. The Pope, or\nleader of the Catholic\nChurch, resides in this\ntiny country.\nEurope is the second\nsmallest continent, only\nlarger than Australia;\nhowever, it is the third\nlargest in population,\nwith over 722 million\npeople. Europe is made\nImage source: https:\/\/www.flickr.com\/photos\/bribri\/2476394326\nof many peninsulas.\nThe Ural Mountains and the Caspian and Black Seas naturally separate Europe\n150 from the continent of Asia.\nInteractive 7.3\nGoogle Maps -\nEurope\nUse this interactive\nwidget to zoom in on\nand see the physical\ncharacteristics of\nEurope.\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/e\/ec\/\nRegions_of_Europe_Map.png Regions of Europe\nInteractive 7.2 Learning\nMt. Vesuvius\nAbout Europe\nMount Vesuvius’s most famous eruption\nwas in A.D. 79 and buried and destroyed\nthe cities of Pompeii and Herculaneum.\nLocated in Italy, it is the only volcano on\nEurope’s mainland to have erupted in the\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bc\/\nlast 100 years. With 3 million people living\nPompeii_Garden_of_the_Fugitives_02.jpg\nnear by, it is also one of the most\nLearn more about Europe and\ndangerous volcanoes in the world.\nplay some interactive games at\nthis website (requires internet\nconnection)\n151 Section 3\nHistory of the Region\nQUESTIONS TO GUIDE INQUIRY Pre-History\n1. How are we as members of a global\nThe earliest settlers to Prehistoric Europe came from the African continent during\ncommunity interconnected?\nthe Paleolithic era, somewhere around 45,000 and 25,000 B.C.E. These were small\n2. How do governments differ around the\nbands of people who were most likely following animals to hunt. As these early\nworld?\nEuropeans settled in and adapted to their environment, they eventually began to\n3. How does our government compare to\ndevelop more complex societies. Agriculture\nothers?\nwas developed around 7000 B.C.E., allowing Interactive 7.4 Faces of\nAncient Europe\npeople to settle in one place. Over the next\n4000 years, many different technological\nadvances were introduced from various other\ngroups coming from the Mediterranean area.\nThese ideas gradually spread northward and\nwere adopted by some of the more well-known\ncivilizations of this time period, such as the\nMinoans and the Mycenaeans. These groups\nExplore the Minoan era in more\nflourished during the Bronze Age, when bronze detail by viewing this YouTube\nvideo (requires Internet\ntools and weapons were developed and first\nconnection)\nused.\n152 The Greeks and spread is their idea of\nInteractive 7.5\n“Democracy.” Democracy means\nHistory.Com - Ancient\nFollowing the end of the Minoan and Mycenaean civilizations,\n“rule by the people.” The Greeks Greek Democracy\naround 7 B.C.E., the Greek civilization began and later flourished\ndeveloped a system of government\nduring the 5th to 4th centuries B.C.E. A period known as\nwith three different branches (much\nClassical Greece began with the defeat of the Persian invasion.\nlike the United States has today): a\nLater, with the conquests of Alexander the Great, the Greek\ngoverning body who wrote laws; a\ncivilization spread from the Mediterranean Sea into Central Asia.\ncouncil of representatives from the\nMany aspects of the Classical Greek culture, including religion,\nten main tribes of Athens; and a court\narchitecture and philosophy, became a major influence on the\nwhere citizens argued cases before a\nLearn more about Ancient Greek\nRoman Empire. Rome then went on to continue to spread the\ngroup of randomly selected jurors. “In Democracy here.\nideas of the Greeks throughout Europe and the Mediterranean\na democracy,” the Greek historian\narea. This is why the Greeks are viewed as being the culture\nHerodotus wrote, “There is, first, that most splendid of virtues,\nwhich has provided the basis of all modern Western culture. More\nequality before the law.” Although Greek democracy only lasted a\nthan any other aspect of the Greek culture which has flourished\nfew years, this development has spread worldwide and changed\nthe face of the world as it we know it today.\nThe Romans\nBeginning in the eighth century B.C.E., Ancient Rome grew from a\nsmall town in central Italy into an empire that at one point covered\nmost of Europe, parts of the Middle East, northern Africa and\nvarious islands in the Mediterranean. Like the Greeks, the\nRomans left a legacy that we can still see today. Latin, the Roman\nlanguage, forms the basis of the Romance languages (Italian,\nFrench, Spanish, Portuguese and Romanian). The modern\nWestern alphabet and calendar are based on those used by the\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ac\/BattleofIssus333BC- 153\nmosaic-detail1.jpg Romans. The transition of the Romans from a mythology-based so large, it was divided into two parts. “Old Rome” would be part\nreligion to their acceptance of the new religion of Christianity of the Western Roman Empire. The Eastern Roman Empire, also\ncontributed to the growth of Christianity as a major world religion. known as The Byzantine Empire, would be established in the far\nRome functioned as a republic, where people were represented eastern part of the Mediterranean and have a new capital,\nby officials in government for 450 years. After the rise of the Constantinople. Around 476 C.E., the Germanic peoples of\ngeneral Julius Caesar in the first century B.C.E., the republic northern Europe grew in strength and repeated attacks led to the\ncame to an end. Following the assassination of Caesar, Augustus fall of the Western Roman Empire. You will be learning much more\nrose to become Rome’s first emperor. His reign began an age of about the ancient history of Europe in 7th grade.\npeace and prosperity. By 300 A.D. the Roman Empire had grown\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/5a\/Roman_Empire_125_map.png\n154 Recent History Germany due to the large popularity he had with the German\npeople. After rearming Germany, Hitler and his ally, Benito\nWith the influx of resources from the New World, technological\nMussolini of Italy, began taking steps to gain full control of\nchanges occurred rapidly. From steam engine locomotives to the\nEurope. After the invasion of Poland by Germany in 1939, Great\nairplane, humankind was rapidly advancing. This was seen at the\nBritain and France had seen enough and declared war. This was\noutbreak of World War I in 1914. With nations feeling invincible\nthe beginning of World War II. Germany conquered France and\nwith their new modern armies, the powers of Europe took up\nhad Great Britain\nsides. The Allied Powers, led by Britain, France and Russia (and\nclose to defeat. After\nby the United States in 1917), defeated the Central Powers which\nnot being able to\nwere led by the German Empire and Austria-Hungary. When\nconquer the island\nGermany finally surrendered in 1918, the major nations involved in\nnation, Hitler turned\nthe war met at the Paris Peace Conference. The Big Four\nhis forces on the\n(England, France, United States and Italy) imposed their harsh\nSoviet Union. In 1941,\nterms in the Treaty of Versailles. Germany was forced to give up\nafter the Japanese\nmuch of its overseas territories, made to pay large reparations,\nattacked the United\nand was basically humiliated by the victors.\nStates, the Americans\nentered the war on Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/4\/41\/\nTotalitarianism\nMap_Europe_1923-en.svg\/2000px-Map_Europe_1923-en.svg.png\nthe side of the Allies\nFollowing World War I, The Great Depression broke out in 1929. (Great Britain, France,\nIn Europe the economic problems faced by the people led to Russia). In 1944, the Allies invaded France in the D Day invasion.\ndesperation. In these desperate times the people in many Germany surrendered one year later.\nEuropean nations demanded change, and this led to the collapse\nof democracy in many countries. Adolf Hitler was the leader of a\nsmall political party in the 1920s. As the living conditions\nworsened in Germany, his party became more and more popular.\nHitler, who had been arrested at one time for attempting to\noverthrow the government, was appointed Chancellor of\n155 The Iron Curtain Fall of Communism\nAfter World War II, Europe was divided by what Winston Churchill Under the leadership of Mikhail Gorbachev, the Soviet Union\nof Great Britain called, “The Iron Curtain.” The Soviet Union began economic and political reforms. But as the government\ndominated the nations of Eastern Europe after the war. All of the began to allow its people more freedoms in 1989, communism in\nnations in the region became communist states. The other the nations of Eastern Europe began to fall.\nnations of Europe were primarily democratic, capitalist countries Even the Berlin Wall in Germany was torn\nInteractive 7.6\nwho followed the leadership of the United States. The United down. This had been built in the 1950’s to History.Com - The\nFall of the Soviet\nStates and the Soviet Union were the two world superpowers. keep communist East and democratic\nUnion\nMost of the non-communist countries in Europe joined a joint West separate. This eventually led to the\nmilitary alliance called the North Atlantic Treaty Organization fall of communism and the break-up of the\n(NATO). The countries guided by the Soviet Union joined the Soviet Union itself in 1991. As a\nmilitary alliance known as the Warsaw Pact. Germany was consequence, Germany was reunited and\ndivided by the allies after the war, and remained so for decades, Europe's integration grew deeper. The\nwith West Germany being a democratic nation, and East European Union, which had been an idea Click on the link to watch\nthe history of the Berlin\nGermany being communist. primarily aimed at the democratic western\nWall and the fall of\nnations, began to expand to include many Communism in Germany:\nof the formerly communist European\ncountries.\n156\nImage source: https:\/\/c1.staticflickr.com\/5\/4069\/4642033407_f52f99d459_z.jpg\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/25\/\nGorbachev_and_Reagan_1987-9.jpg Section 4\nGovernments in Europe and Russia\nQUESTIONS TO GUIDE INQUIRY Political History\n1. How are we as members of a global\nHow are the governments of European countries different? Are there similarities?\ncommunity interconnected?\nThe region that consists of Europe and part of Russia is very diverse. The people\n2. How do governments differ around the\ncome from around 50 different countries and even greater differences in cultures\nworld?\nand ethnic groups.\n3. How does our government compare to\nothers? The cultures and history of Europe and Russia have led its people to create some\nof the most powerful governments in history. Other factors, including political and\neconomic struggles, have created change and revolution in many countries of the\nregion. With the fall of Rome, many small kingdoms rose and fell in Europe and\nRussia over the next few hundred years. Modern nations began to develop in the\nmid to late 1400s. As time passed many of these new lands were being ruled by\nmonarchies under the control of kings and czars.\nThe Modern Era saw two revolutions that would shape the political landscape for\nyears to come. The Industrial Revolution would bring an economic change to the\nworld. In Europe the creation of a manufacturing age led European nations to\nbecome the first developed countries in the world. Moving from an agricultural-\nbased society to one founded in manufacturing led to many changes in the\npolitical landscape. The second revolution was political. By the mid-1600s a\nnumber of political revolutions were happening across Europe. The revolutions\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/bc\/Europe_flags.png\n157 began changing how countries would be ruled, in some cases government takes on the responsibility of being the leader of the\nthis led to the rise of democratic governments. In others, Russia government body, while the head of state is a figurehead who\nfor instance, the political revolutions led to the rise of dictators. represents the country to other governments.\nToday elected governments of various forms rule most of the\nRussia\ncountries in this region.\nFrom 1922 to 1991 Russia was part of a larger nation known as\nGovernments of Europe\nthe Union of Soviet Socialist republics (USSR) or the Soviet\nMost governments in Europe are made up of elected officials who Union. The union was made up of subnational republics governed\nfollow a democratic ideal. Most countries are Republics. A by the Communist Party with a highly centralized government and\nrepublic is a democratic form of government where elected economy. As the state grew, it became a world superpower\nofficials represent the citizens. The biggest difference between thanks in large part to its large military. In 1991 the superpower\nmany of the countries is their official heads of state. Some collapsed. The Soviet leader at the time, Mikhail Gorbachev,\ncountries, like the United looked to reform the union and move it toward more of a social\nKingdom, have a prime minister style democracy. This led to a nationalist movement and\nInteractive 7.7\nwho is the head of the attempted coup, an attempted forced overthrow of a\nGovernments of the World\ngovernment and a king or government. Both failed but succeeded in creating even more\nqueen who is the head of state. instability. In late 1991, Gorbachev resigned and the Union was\nThis form of Constitutional dissolved into independent states, with Russia being the largest.\nMonarchy keeps the tradition\nof a monarch but allows the\npeople to govern themselves.\nIn most republics throughout\nFollow this link to visit an\nEurope you will find a prime\ninteractive map that shows the\nminister as the head of governments of Europe and\nRussia\ngovernment and a president as\nthe head of state. The two roles differ greatly; the head of\n158 Even though Russia is not as exercises executive power over the\nInteractive 7.8 More About\nInteractive 7.9 More About\nGorbachev big as the Soviet Union was, it Russian Federation (Russia). The\nRussia Today\nis still the largest country in the government is made up of three\nworld. Prior to the dissolution of branches and the Central Bank.\nthe Soviet Union, the Each branch is broken down into\ngovernment owned and ran the different groups who hold\ncountry's farms, factories and responsibilities within their branch of\nbusinesses. As the government government.\ncame to an end, the\nClick on the widget to watch a\ngovernment sold off its Click on this widget to learn more\nshort biography of Mikhail\nabout Russia today.\nGorbachev\nfactories and businesses. The\nThe members of the government\nsales did not benefit a majority\nissue decisions and orders that must not contradict the\nof the Russian people.\nconstitution, constitutional laws, federal laws and the presidential\ndecrees. The government must submit and implement a federal\nToday the businesses, farms and factories of Russia are privately\nbudget, a financial policy for the federation and a uniform state\nowned. Unfortunately, they are not always run well. Many of them\npolicy in areas of health care, social security, culture, science and\nneeded repair and modernization following the Soviet sell off, but\neducation. The government must also manage the federal\nnew owners were unable or unwilling to pay for the needed\nproperty, ensure the country’s defense, manage foreign policy\nrepairs. Others made goods that were poor in quality in an\nand ensure the rule of law, human rights, public order, crime\nattempt to quickly become wealthy. No one wanted to buy such\ncontrol and basic freedoms are upheld.\npoor goods. This resulted in many businesses failing and the\neconomy struggling to move forward.\nGovernment in Russia Today\nEuropean Union\nThe dissolution of the Soviet Union brought about many changes.\nAs World War II came to a close, many western European\nIn 1993 the Russian Constitution of 1978 received a revision to\ncountries found it difficult to rebuild their shattered economies. As\nmeet the needs of the new country. It states that the government\nthe reality of this struggle arose, a movement for European unity\n159 began to take hold. Beginning in 1950, Robert Schuman, a above the governments of the member countries. The European\nFrench leader delivered a speech laying out ideas to bring peace Union (EU) uses supranational cooperation to work towards\nto Europe though economic cooperation. Schuman proposed that shared goals. Member countries give up some power and control\nFrance, Germany and others in Europe should work cooperatively over certain areas, but remain separate countries. While they are\nto manage their coal and steel productions. Six countries agreed united in many ways they are divided in others. It is these forces\nwith him, and out of this the European Coal and Steel Community that work both for and against the EU.\nwas born. This group\nHave you ever traveled from one country to another?\ncreated a common\nIs crossing an international border easy or difficult?\nmarket for the coal and\nWhat are some of the issues with traveling from the\nsteel industry. Within\nUnited States to Canada? Do we see those same\nthe common market,\nissues when traveling from state to state?\ntrade barriers were\nremoved and tariffs\nwere lowered.\nIn the United States, traveling from one state to the\nBy the early 1990s a next is easy. There are no border checkpoints to\nnumber of European cross or customs to pass through. When you travel\ncountries agreed an from one state to the next, you have no need to\neconomic community trade your dollars in for the new state’s money.\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/fa\/Port_talbot_large.jpg\ncould be created within Imagine traveling in Europe. Prior to the creation of\nEurope to bring greater cooperation among the individual the EU, each time you went to another country it was much like\ncountries. In 1992 representatives from a number of European traveling from the United States into Canada.\ngovernments met to create the Maastricht Treaty. This agreement\nwould set up the European Union, a new governing body aimed\nat creating supranational cooperation among its member\ncountries. The prefix supra means “on top of.” Supranational is a\nterm referring to the government of the European Union standing\n160 difficult to travel country to country. National laws made it difficult\nInteractive 7.10 How the\nEU Works for someone to live in one country and work in another.\nToday member countries of the EU have a common\neconomic goal. They promote many different ways to\npromote economic cooperation between each other. One\nis the creation of a common market. This has been\nimportant in creating cooperation among member\ncountries. In this common market, goods and people are\nLearn more about how the EU able to move freely across borders. This allows people to\nWorks in this video (requires\nhave the benefit of working in one country and living in\ninternet connection)\nanother. The people also have more choices in what they\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/\ncan buy. With no tariffs on EU goods,\ncommons\/6\/65\/Euro_coins_and_banknotes.jpg\nprices are lower. This encourages people\nHow the EU Works Together\nto purchase goods from EU countries and\nLiving in the United States, people\nstrengths the economy at the same time.\nmove freely from one state to the\nThe EU has taken other steps towards\nnext. Someone might live in\neconomic cooperation. Many member\nMichigan and work in Indiana or\ncountries have adopted a common\nOhio. There are borders defining a\ncurrency called the Euro. Now Europeans\nstate's boundaries but people are\nno longer have to exchange their money\nable to cross them with no impact\nas they travel and trade in other member\non their day to day lives. Europe is\ncountries. This makes living and doing\njust slightly larger than the US.\nbusiness in EU member countries easier.\nMany countries are comparable in\nsize to US states, however, prior to\nthe creation of the EU it was very\nImage source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8b\/\nEU_map_names_isles.png 161 member nations. Culturally, the EU has worked at creating a some division within the EU. Politically, the government of the EU\ncommon European culture. The EU has its own Flag, has adopted does not trump the governments of the member countries. Giving\nthe Beethoven song “Ode to Joy” as its national anthem, and up political power is not easy for governments to do. Some\ncelebrates Europe Day every year on May 9th. Politically, the EU member countries still want to make their own decision on issues\nencourages cooperation between the governments who run the like defense and foreign affairs, especially when they don't agree\nmember nations. The EU government works to bring its members on a decision made by the EU. With the EU having no real\ntogether to work on issues they have in common. This allows recourse for countries who go out on their own at times, there is\nthem to work on large scale problems, like pollution, together. no incentive to follow all the decision made by the European\nPromoting a common European cultural identity is difficult. The Union.\ncountries of the EU are very diverse. They include people of many\nThe “Brexit”\ndifferent languages, religions, beliefs, traditions and values.\nAfter years of discussion, two very vocal groups of people\nIssues with EU Cooperation\nbrought the issue of whether or not the United Kingdom should\nThe EU doesn't always work together. With all the diversity that remain in the European Union in 2016. On one side of the\nmakes up the member countries it can be difficult to get everyone debate, a group called “Britain Stronger in Europe” campaigned\nto agree on everything. Member nations do not always agree on heavily for Britain to remain in the union. “Vote to Leave” was the\nthe issues they face or on how to address many of these issues. official group that was pushing for a break. On the one side,\nEconomic differences create a number of strains within the EU. those who wanted to withdraw argued that membership\nGenerally speaking the Western European countries are wealthier undermined their own sovereignty. The other side agreed, but\nthan those in the rest of Europe. This can create a number of argued that in a world with super powers, the benefits of being\nissues as the EU focuses funds on poorer countries to bring them part of a massive organization such as the EU outweighed the\nup to the EU’s economic standard. The differences in wages from loss of some power.\ncountry to country has prompted a number of people to leave\npoorer countries for jobs in wealthier ones. The adoption of the\nEuro is another issue. Not all member countries have adopted it\nas their national form of currency. Economically, this has created\n162 When put to a vote, 51.9% of the people living in the United Interactive 7.11 The Brexit\nKingdom voted to leave. The process of leaving the EU will take\nseveral years to complete, and it has already had an effect on the\nmarkets across Europe.\nFor more information on the Brexit, take a look at this continually\nupdating website with backstory, history, and the latest news.\nLearn more about the Brexit at\nthis website from the BBC.\nNow it’s time to return to your interactive journal and think about\nthe questions that have guided this chapter: Interactive 7.12 Interactive\nJournal\nHow are we as members of a global community interconnected?\nHow do governments differ around the world?\nHow does our government compare to others?\nPlease note: once you have\ncreated your own copy of this\ndocument, this widget will only\nreturn you to the blank copy. You\nwill need to access yours by\nopening from your own Google\nDocument.\n163 Chapter 8\nOceania,\nAustralia and\nAntarctica\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society connected?\n2. How does where societies develop influence their place in\nthe world?\n3. How do people survive when surrounded by oceans? Section 1\nIntroduction to Oceania\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global\nsociety connected?\n2. How does where societies develop\ninfluence their place in the world?\n3. How do people survive when surrounded\nby oceans?\nImage Source: https:\/\/www.google.com\/maps\/@-13.1858046,175.1825482,9581953m\/data=!3m1!1e3\n© 2014 Google - Map data (C) 2014 Google, INEGI Imagery (C)2014 NASA, TerraMatrices\nTake a look at the map of Oceania pictured above. What do you first notice when\nlooking at this map? Do your eyes head to the green shaded islands? Do they\nhead to the brown and gray shaded Australia? Do they go to the great blue\nexpanse of the Pacific Ocean?\n164 Oceania is an area of the world that has some very unique with other classmates to study a specific piece of Oceania to\ncharacteristics. More than one third of the earth’s surface is answer this question.\ncomprised of the Pacific Ocean and Oceania . In addition to all\nIn addition with each section you will also explore some\nthose islands, Oceania also includes the smallest continent in\nsupporting questions. These will help you answer the larger\nterms of land size: Australia. You can look anywhere in Oceania\ncompelling questions:\nand find strong cultural traditions, rich history, and strong\ngeographic features that vary widely depending on where you go.\nAs you study the region you are invited to think about the\nHow do people survive when\nInteractive 8.1 Google\nfollowing questions:\nMaps - Oceania surrounded by oceans?\nHow are we as members of a global society connected?\nBefore we begin exploring different\nregions in Oceania, take a moment\nFor many people living in the United States, particularly those in\nto look at this Interactive map.\nMichigan, Oceania is a far away place. As you have been\nZoom in and out and make note of\nlearning in each chapter however, we share social, political,\nwhat landforms you see and what\neconomic, and cultural connections with all regions of the world,\nother physical characteristics of\nand Oceania is no different. As you have been doing in other\nTake a look at the interactive place you can observe. What\nsections, as you study this region look for examples of these\nGoogle Map linked above\nhuman characteristics can you\n(requires internet connection) -\nconnections.\nWhat physical characteristics of\nobserve?\nplace can you observe?\nHow does where societies develop influence their place in the\nworld?\nFive Themes Practice - Location: Describe where\nYou cannot study the history of a place without looking at\nOceania is located using the maps in this section.\nhow geography has influenced a culture’s development. This\nsecond question will be one you work cooperatively to answer\n165 Section 2\nPhysical Geography - Oceania\nQUESTIONS TO GUIDE INQUIRY The Pacific Islands\n1. How are we, as members of a global\nHere is a map of the world with longitude and latitude lines displayed. Part of\nsociety connected?\nOceania has also been labeled inside the green circle on the map. Use the map to\n2. How does where societies develop\nanswer the following questions:\ninfluence their place in the world?\n3. How do people survive when surrounded\nby\n1. Based on location alone, what characteristics\ndo you believe this region may share with other\nparts of the world that are located in a similar\nzone? HINT: Think about what you know about\nSouth America, Africa, southern Asia.\n2. Based off of location alone, what economic\nactivities do you believe people in this region\nmay undertake?\nImage Source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/56\/World_map_longlat.svg\n166 When visualizing this region through another climate map, what\nobservations can you make? Try to answer the following\nquestions using the second Map:\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/d\/df\/ClimateMap_World.png\nHere is a climate map of the world. Review your predictions.\nWere you right? Where might you have been incorrect?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/58\/Klimagürtel-der-erde.png\n1. What do central and northern Australia have in common with Northern\nAfrica? What other parts of the world have similar characteristics?\n2. What do the islands north of Australia have in common with central\nAfrica and northern South America?\n3. What parts of the world are similar to Southern Australia?\n167 The Islands in the Pacific can be broken into three distinct The climate of this region is mostly tropical. There is heavy\nregions. Of the three, Melanesia is the most populated. rain year round in the region, and two natural disasters routinely\nMicronesia is made up of approximately 2,000 small islands and affect the region - volcanic activity and typhoons.\nis located north of Melanesia. Polynesia is a collection of many\nResources in the area are vastly different depending on\nislands just East of Melanesia and Micronesia. What do you\nwhere you go. The islands that were formed due to volcanic\nnotice about the shape of their zone?\nactivity are considered “high islands.” Due to the makeup of the\nsoil (which is volcanic in nature) the people who live in these\nzones have fertile farmland where they grow things such as\nbananas, coffee, and cocoa (necessary for the creation of\nchocolate).\nIn contrast, the other islands are\nInteractive 8.2 National\nconsidered “low islands” which\nGeographic Explorer\nhave little vegetation. You’ll learn a\nlittle more about the people in the\nnext section, but there are very\nsmall populations of people on\nthese islands.\nImage source: Image source: http:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/93\/\nPacific_Culture_Areas.jpg To learn a little bit more about the\nphysical features, and prepare for\nlearning about the human features\nof Oceania, take a look at the\nNational Geographic website here.\n168 Section 3\nHuman Geography of Oceania\nQUESTIONS TO GUIDE Oceania is a large region and as\nINQUIRY such there are a large variety of\ncultures represented. Overall,\n1. How are we, as\nmembers of a global however, the entire region (including\nsociety connected?\nAustralia) is very sparsely populated.\n2. How does where Look at the population density map\nsocieties develop\nprovided. This map from\ninfluence their place in\nreefbase.org showcases the\nthe world?\npopulation density of most of\n3. How do people survive\nOceania. If the darker regions\nwhen surrounded by\nindicate areas with a heavier\noceans?\nconcentration of population than the\nlighter areas, does the region seem\nto have a large or small population?\nImage used with permission. Image source: http:\/\/www.reefbase.org\/images\/pacific\/peoplereefs_figure3.gif\nWhat evidence supports your claim?\n169 Movement To The Region Contact with European powers occurred in the 1500s. While not\ninitially easy to get to and from Europe, the first European\nThere is much scholarly debate on when exactly the region began\nbelieved to have entered the region was Ferdinand Magellan who\nto be settled. Some claim people began making their way there\nlanded near the Philippines where he was eventually killed.\n35,000 years ago. Others believe it happened later. It is believed\nFurther explorers came after him, including Captain James Cook\nthe people of Polynesia arrived through one of three migrations:\nwho made three major voyages to the region and eventually\nexplored the vast majority of it. The records of his journey\n1. An “express train” out of Taiwan. This is not a literal\ninspired others back home in Europe to continue to investigate\ntrain, but rather a theory that people left quickly from southern\nthe region, and by the mid 1800s Spain, France, and Great Britain\nChina and made their way to islands such as Melanesia over a\nhad all taken major stakes in the region.\nlong period of time.\nWhich theory on movement of people do you\n2. An “Entangled Bank” - a much slower migration out of\nbelieve to be the most likely? Why?\nareas such as Australia and southern China.\n3. A “Slow Boat” - where people came to Melanesia,\nmixing and mingling with the populations there before moving out\nover a longer period of time.\nAll of these migrations took place over a long period of time\n- over several thousands of years. Because these civilizations\nwere isolated from others however, the history and cultures in this\nregion are distinctive and unique. Prior to contact with the\nEuropeans, the people of this island region practiced hundreds of\ndifferent religions, many with similar roots to one another. Much Image source: https:\/\/commons.wikimedia.org\/wiki\/File:Map_of_Oceania_country_codes.png\nof this changed with the arrival of the Europeans.\n170 Even the United States has a stake in the area. When the United\nStates went to war with Spain early in its history, the Spanish\nwere eventually defeated. Guam became a United States territory\nduring this period.\nThere are over 9 million people living in the overall region today.\nThat seems like a lot until you compare it to a relatively large city\nin Mexico - Mexico City. 8.5 Million people live in that city alone!\nThere are many different cultural traditions in this region. While\nImage source: Image Source: https:\/\/www.google.com\/maps\/\nmany adopted Christianity as a major religion which spread to the\n@-13.1858046,175.1825482,9581953m\/data=!3m1!1e3\nregion through European contact and exploration, there are still\n© 2014 Google - Map data (C) 2014 Google, INEGI Imagery (C)2014 NASA, TerraMatrices\nplaces where traditional local religions are practiced. The Pacific\nIslands are one of the most isolated\n“How do people survive when surrounded by oceans?”\nregions in the world, yet places there are Interactive 8.3 Culture\nGrams\nheavily visited by tourists.\nLooking at the region again again by viewing the map\nabove, what might make up the economy of the region?\nVisit the Culture Grams website (Only available to students\nin Michigan!) and look up the region to find more\ninformation and answer this inquiry question:\n(Hint! Once you select your region, look on the left hand\nside of your screen to dial down into certain options)\nAfter heading to the main page,\nselect “Kids” and choose Oceania\nto drill down deeper into the\nregion.\n171 Section 4\nIntroduction to Australia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as\nAustralia\nmembers of a\nglobal society\nHow does where societies develop\nconnected?\ninfluence their place in the world?\n2. How does\nwhere You cannot study the history of a\nsocieties\nplace without looking at how\ndevelop\ngeography has influenced a culture’s\ninfluence their\nplace in the development. This second question\nworld?\nwill be one you work cooperatively to\n3. How do people answer with other classmates as you\nsurvive when learn more about Australia.\nsurrounded by\noceans?\nImage source: Image source - http:\/\/www.deshow.net\/d\/file\/travel\/2008-11\/sydney-scenery-australia-travel-2.jpg\n172 Australia is a continent where As you read these next sections,\nInteractive 8.6 Australians\nInteractive 8.4 Australia -\nyou can find geographic think about how where Australia as Global Citizens\nIntroduction Quiz\nextremes. It has both deserts and developed influenced their place in\nrainforests, and is home to the the world. To get you to start\nOutback and the Great Barrier thinking about this, watch this video\nReef. This unique continent is and answer the questions in the\nsurrounded by the Pacific and blue box below:\nIndian Oceans. The continent is\ncomprised of the mainland,\nTake the following quiz to see\nTasmania and several smaller\nwhat you already know about this\nfascinating region. islands. Australia is the 6th\nlargest country in the world\nwhere over 23 million people live today. In this chapter you will\n1. How has Australia influenced the countries\nlearn about the geography of this\naround it?\ncontinent, along with the Interactive 8.5 Google\nMaps - Australia\npopulation and history of Australia. 2. Why do people move here?\nYou will have a chance to explore\n3. What sets Australia a part from other\nhow the population of this country\ncountries in the region?\ngrew and ways that this has\nshaped modern day life.\nExplore the region with this\ninteractive online map. (Requires\ninternet connection)\n173 Section 5\nPhysical Geography - Australia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global\nsociety connected?\n2. How does where societies develop\ninfluence their place in the world?\n3. How do people survive when surrounded\nby oceans?\nImage source: http:\/\/www.ga.gov.au\/images\/GA1073.jpg\nLooking at the map of Australia, what do you notice? The lines dividing Australia,\nmark the six states and two territories: Western Australia, South Australia,\nQueensland, New South Wales, Victoria, Tasmania, the Australian Capital Territory,\nand the Northern Territory. Where do you see the majority of the cities in Australia?\nYou will notice they are along the coastline. According to the Australian Bureau of\n174 Statistics, more\nthan 85% of the\npopulation in 2001\nlived within 30 miles\nof the coast.\nWhy do you think\nthat so many people\nlive near the coast in\nAustralia?\nThe Outback, found\ninland Australia, is\ndifficult to inhabit Image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/thumb\/f\/fa\/\nAustralian_Census_2011_demographic_map_-_Australia_by_SLA_-\ndue to arid weather\n_BCP_field_0109_Median_age_of_persons.svg\/2000px-\nand extreme heat. Australian_Census_2011_demographic_map_-_Australia_by_SLA_- Image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c5\/\n_BCP_field_0109_Median_age_of_persons.svg.png Australia_Present_Vegetation_Map.png\nThis land is not\nfertile, making\nfarming nearly impossible for people and thus you will see fewer\ncities in the Outback.\nLooking at Australia’s vegetation, notice that more than 70% of\nAustralia is arid or semi-arid. Arid means an area that has little or\nno rain, where it is difficult for vegetation to grow.\n175 In contrast to\nAustralia’s\nOutback, this\ncontinent has\nrain forests as\nwell as a\nworld famous\nunderwater\nhabitat. The\nGreat Barrier\nReef is the\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/6\/62\/\nworld’s largest\nAmazing_Great_Barrier_Reef_1.jpg\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/f\/f9\/Ayers_Rock_Uluru.jpg\ncoral reef\nAlthough most Australians do not live in the Outback, it is a system. It is larger than the Great Interactive 8.7 Great\nBarrier Reef\nbeautiful region and home to Ayers Rock (or also known as Wall of China and is the only living\nUluru). This impressive landmark is an image people think of thing that can be seen from space.\nwhen they imagine the Australian Outback or desert. It is found in The reef spans 2300 km -\nthe Northern Territory in central Australia. comparatively this would be equal to\nthe distance from Vancouver,\nCanada to the Mexican border. This\nreef is home to thousands of\nspecies. It is home to over 1,625\nClick on the link to experience\nwhat life is like on the Great\ntypes of fish alone!\nBarrier Reef.\n176 After learning about the geography of Australia, what does this\ncountry have in common with where you live? Australia is a top\ntravel destination and the Great Barrier Reef and Ayers Rock\nattract many tourists. What natural geographic attractions do\ntourists enjoy visiting in Michigan? Image: Sleeping Bear Dunes.\nYou have learned that Australia is a land of geographic extremes.\nYou probably do not live in a region of such extremes, but what\ndo you notice about where people live in Michigan? Is there a\npattern to where people live or where large cities are located?\nRemember that in Australia most people live near the coast\nbecause the large cities are able to sustain population, as\nopposed to the Outback.\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/3\/38\/\nSleeping_Bear_Dune_Aerial_View.jpg\n177 Section 6\nHuman Geography - Australia\nQUESTIONS TO GUIDE INQUIRY Australia is home to over 23 million people today. Australia is one of the most\nethnically diverse countries, where nearly 25 percent of people living in Australia\n1. How are we, as members of a global\nsociety connected? were not born here. Thinking about this fact for a moment, what do you think\nbrought all these people to Australia? Why do people still migrate, or move there?\n2. How does where societies develop\ninfluence We will be exploring the history of migration in this\ntheir place section and you will see there were some major\nin the\nevents in Australia’s history that pushed or pulled\nworld?\npeople to migrate there.\n3. How do\npeople\nsurvive\nwhen People native to this continent were known as\nsurrounded\nIndigenous or Aboriginal people by the British when\nby oceans?\nthey came to Australia in the 18th century.\nAboriginals are believed to have inhabited Australia\nfor over 50,000 years. Aboriginals survived by\nusing the resources in the area. They hunted,\nfished and gathered for their food. They were\nlimited in their food choices by what the land and\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c7\/\nsea offered. Therefore, they were nomads and\nAustralia_Aboriginal_Culture_002_(5447678025).jpg\ntraveled in search of their food. When the British\n178 came to Australia, they considered them illiterate and could not\nunderstand their nomadic culture.\nWhen the British arrived, the people native to Australia were\ndisplaced, or forced to surrender their native lands to the British.\nThey were now under British rule. In the years following British\nsettlement, many Aboriginal people died from displacement,\ndisease or violence. Racism towards Aboriginal or Indigenous\nAustralians continued until well into the 20th century. Indigenous\nAustralians were not given the right to vote until 1962. It was not\nuntil 1968 that the Australian government passed a law requiring\nemployers to pay Aboriginal Australians minimum wage. The\nAboriginal Land Rights Act in 1976 granted traditional land in the\nNorthern territories to the Aboriginal people.\nAlthough Aboriginal Australians\nInteractive 8.8 Dreamtime\nmake up less than 3 percent of the\nstory Image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/5\/52\/Aboriginal_Art_Australia(3).jpg\npopulation, the rich Aboriginal\nthe world was created. Dreamtime is reflected in both art and\nculture is something people hope to\nstories passed down through generations. Aboriginal art used\npreserve. Originally there were\nsymbols and drawings to tell a story and was first done in caves\nbetween 350 - 750 different\nand on bark.\nAboriginal groups and languages.\nTheir cultures was centered around\nnature and the importance of the\nClick on the link to listen to a\nland. The art created reflected the\ntraditional dreamtime story. Listen\nfor the sounds of the didgeridoo importance of Dreamtime, which\nat the beginning of the clip\nwas the period they believed when\n179 Reading about the people native\nInteractive 8.9 Aborigines\nInteractive 8.10 A Day in\nand Native Americans to Australia, you may have made\nthe Life - Australia\nsome connections to people who\nwere native to Michigan. The\nfollowing article explores the\nsimilarities and differences\nbetween Australian Aborigines\nand Native Americans. After\nreading the article please answer\nIs daily life in Australia different\nthe questions below.\nthan where you live? Take a peek\ninside a day in the life of a 12 year\nold boy living in Australia. After\nyou have looked at these slides,\ncompare and contrast a typical\n1. How are Australian Aborigines and Native\nday for you and the one you just\nAmericans similar? saw.\n2. In what ways are their histories different?\n3. Do you believe that a valid comparison can\nbe made between these two cultures?\n4. Why or why not?\n180 Section 7\nHistory of Australia\nQUESTIONS TO GUIDE INQUIRY History\n1. How are we, as members of a global\nAustralia is an independent country, yet it is part of the British Commonwealth.\nsociety connected?\nThis means that Australia shares a monarchy, a government ruled by a king or\n2. How does where societies develop\nqueen, with Britain. Thus, Queen Elizabeth II is Queen of England and Queen of\ninfluence their place in the world?\nAustralia.\n3. How do people survive when surrounded\nby oceans?\nAs you watch the video in the widget, be thinking about the following\nquestions:\nInteractive 8.11 Australia\nDecides - Monarchy or\nRepublic\n-What are some of the reasons people give for wanting or not wanting a\nrepublic?\n-Why do you think some of them do not seem to understand the issue?\n-What was the result of the referendum? Were there any positive outcomes?\n181 To understand why Australia became a monarchy, we need to go overcrowding prisons as well as helping them settle Australia\nback and look at how Australia was founded. This country has a much faster.\nrich history and in this section you will see the role that migration\nAustralia also experienced a population boom during the Gold\nplayed in shaping Australia’s history.\nRush of the 1850’s. Immigrants from around the world moved to\nAustralia hoping to become rich\nInteractive 8.12 A Land of\nwith the discovery of gold. The\nMilk and Honey\nBritish Claim the Continent:\npopulation, however, was\ndominated by convicted\nBy the mid 1700’s, England had an overcrowded prison system.\ncriminals who recently had\nThe country was in need of sending its prisoners somewhere else.\nbeen sent from England. On\nNear the end of the 1700’s, British explorer James Cook came to\nJanuary 1st the commonwealth\nAustralia and claimed it for Great Britain. He named this land New\nof Australia was created as a\nSouth Wales. A few years later ships carrying nearly 1400 people,\ndominion of the British Empire\nmostly convicts, from England landed in Australia. They arrived\nLearn more about how migrants\nand Australia was a officially a\non January 26th, 1788. This day is now known as Australia Day,\nadjusted to life in Australia\nnew country.\nan official public holiday celebrated throughout Australia.\nPopulation Growth:\nOver the next 100 years, over\n150,000 additional men and\nwomen were shipped to Australia.\n1. What benefits for migrants did this video highlight?\nMost of these people were\n2. Identify and list the problems for migrants shown in this\nconvicted criminals. They faced\nvideo clip.\ndifficult and horrible conditions\nthroughout their long journey on a\nship. The removal of these\nImage source: https:\/\/\nconvicts helped Britain with their upload.wikimedia.org\/wikipedia\/commons\/\n7\/76\/Captainjamescookportrait.jpg\n182 The economy was sparked by production for WWII and growth\nswept across Australia. Australia was in dire need of workers as\nindustry grew rapidly. Migrants from Europe came to fill many of\nthe needed positions. Most of the migrants were young and were\nvery hopeful for a bright and profitable future. They were not\ndisappointed. Watch the following video from 1951 that explained\nhow migrants adjusted to life in Australia. Note that many people\nwho migrated to Australia from Europe did not speak English.\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/c\/c9\/\nAUS_population_development_1788_to_2008.png\nHere is a look at the population growth of Australia. Australia’s\npopulation boomed between 1948 and 1975 when over 2 million\npeople migrated to this country.\nWhy do you think the population boomed after WWII in Australia?\nWhat do you think happened to the population of Michigan and the rest\nof the U.S. after WWII? Why?\n183 Australia has a rich and diverse history. So now that you have\nexplored Australia in greater detail, how are we, as members\nof a global society, connected to Australia? Open your\ninteractive journal and answer the inquiry questions for\nthis section.\nInteractive 8.13 Interactive\nJournal\nPlease note: once you have\ncreated your own copy of this\ndocument, this widget will only\nreturn you to the blank copy. You\nwill need to access yours by\nopening from your own Google\nDocument.\n184 Section 8\nIntroduction to Antarctica\nQUESTIONS TO Antarctica is an extremely\nGUIDE INQUIRY desolate place. It is the\ncoldest, windiest, and driest\n1. How are we, as\nmembers of a global place on the earth.\nsociety connected?\nAntarctica is Earth's\n2. How does where southernmost continent,\nsocieties develop\ncontaining the geographic\ninfluence their place\nSouth Pole. It sits in the\nin the world?\nAntarctic region of the\n3. How do people\nSouthern Hemisphere,\nsurvive when\nalmost entirely south of the\nsurrounded by\noceans? Antarctic Circle, and is\nsurrounded by the Southern\nOcean. Just speaking the\nname of this continent\nbrings up images of ice,\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/8\/8f\/Fryxellsee_Opt.jpg\nsnow and penguins.\nAntarctica has a rich history of exploration and continues to be a thriving spot for\nresearchers and scientists from all over the world. In this sections we will look at\nthe physical features of this continent, along with the history and how it connects\nto the rest of the world. You will have an opportunity to look at images from this\n185 frozen continent, watch videos taken in Antarctica and play\ninteractive games that test your knowledge of Antarctica. This\ncontinent has often been referred to as the last frontier in\nexploration and is extremely important in the scientific community\ntoday. As you read and explore, think about how are we, as\nmembers of a global society, connected to Antarctica? Also,\nthink about how the history of Antarctica impacts the role it plays\nin the world today?\nInteractive 8.14 Google\nMaps - Antarctica\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/93\/Antarctica_major_geographical_features.jpg\nStudy the region by exploring on\nthis Google Map.\n186 Section 9\nPhysical and Human Geography\nQUESTIONS TO\nGUIDE INQUIRY\n1. How are we, as\nmembers of a\nVideo Questions:\nglobal society\nconnected?\n1. Describe what Antarctica is like\n2. How does where\ncompared to where you live.\nsocieties develop\n(weather, land, number of people,\ninfluence their\nactivities)\nplace in the\nworld?\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/93\/\n2. Based on what you see, why do the\n3. How do people Antarctica_major_geographical_features.jpg\nphysical features make it difficult for\nsurvive when\npeople to live in Antarctica?\nsurrounded by oceans? Movie 8.1 Visual Loop - Antarctica\n3. Why might countries from around the\nworld be interested in Antarctica?\n187 Antarctica is the world’s fifth largest continent. It is slightly less cross this mountain range.\nthan 1.5 times the size of the U.S. and about twice the size of\nWildlife and Vegetation\nAustralia. Antarctica has an area of 14 million squared kilometers.\nAntarctica’s landscape is made up of approximately 98% thick\nThis beautiful, icy ocean environment is also home to nearly\ncontinental ice sheet and 2% barren rock. There are numerous ice\n10,000 highly adapted species, many of which can be found\nshelves in Antarctica. An ice shelf is a thick floating platform of\nnowhere else on the planet. Only cold-adapted organisms\nice that forms where a glacier or ice sheet flows down to a\nsurvive, including many types of algae, bacteria, fungi, and\ncoastline and onto the ocean surface (wikipedia). On this\nplants, and certain animals, such as mites, penguins, and seals.\ncontinent, glaciers form ice shelves along about half of the\ncoastline, and floating ice shelves constitute 11% of the area of\nGallery 8.1 Wildlife and Vegetation in Antarctica\nthe continent.\nAntarctica, on average, is the coldest, driest, and windiest\ncontinent, and has the highest average elevation of all the\ncontinents. Antarctica is considered a desert, with annual\nprecipitation of only 200 mm (8 inches) along the coast and far\nless inland. The temperature in\nInteractive 8.15 Antarctic\nAntarctica has reached −89 °C\nIce Shelves\n(−129 °F).\nThe South Pole, the southern\nmost point of the Earth, is\nlocated in Antarctica. The\nTransantarctic Mountains go\nthrough this continent. Explorers\ntrying to reach the South Pole by One of the author’s friends works in Antarctica and provided these still\nLearn more about the dangers\nimages.\nfacing the Antarctic Ice shelves in way of the Ross Ice Shelf had to\nthis video. 1 of 12\n188 Antarctica is one of the most pristine marine environments on\nthe planet. Vegetation where it occurs is tundra.\nHuman Geography\nAlthough there are no people native to Antarctica, anywhere\nfrom 1,000 to 5,000 people reside throughout the year at the\nresearch stations scattered across the continent. Most\nresidents of Antarctica live there for a few months at a time and\nit is important to keep in mind that there are no permanent\nresidents or cities or towns in Antarctica. “There are around 66\nscientific bases in Antarctica, of which about 37 are occupied\nyear round. There are about 4,000 people through the summer\nmonths and about 1,000 over winter each year. Antarctica\nboasts tens of thousands of tourists each year. In 2013-14\nAntarctica had 37,405 tourists.” (IAATO, 2014).\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/7\/79\/South_pole_skiers.jpg\n189 Section 10\nHistory\nQUESTIONS TO GUIDE INQUIRY Global Connections\n1. How are we, as members of a global\nSo who was the first person to see this beautiful and desolate continent? When\nsociety connected?\nwas Antarctica discovered? In\n2. How does where societies develop\n1820, several groups of\ninfluence their place in the world?\nexplorers claim to have sighted\n3. How do people survive when surrounded\nAntarctica. American Captain\nby oceans?\nJohn Davis claims to be the\nfirst to set foot there in 1821.\nDavis was a sealer, a person\nwho hunts seals. Sealers\nhunted seals for their pelts and\nfat, which could be made into\nlubricants, lamp fuel or\ncooking oil. In 1911,\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/2\/2d\/\nAptenodytes_forsteri_-Snow_Hill_Island,_Antarctica_-juvenile_with_people-8.jpg\nNorwegian explorer, Roald\nAmundsens’s expedition was\nImagine you were a part of an expedition to discover the\nthe first to reach the South\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/1\/1e\/\nSouth Pole. Write a letter home describing what this\nIceberg_in_Paradise_Harbour,_Antarctica_(6087919256).jpg Pole.\njourney is like.\n190 Antarctica Ice Melt exploration into more and more remote regions as resources are\nInteractive 8.16 Is\ngradually depleted in other lands. If this happens, it could\nAntarctica Melting?\n98% of Antarctica is covered in\ndestroy one of the last untouched areas on our Earth. What is\nice. The ice averages a little\nbeing done to protect it?\nover a mile thick.\nIs Antarctica Who Owns Antarctica?\nmelting? We hear\nLooking at the claim map,\na lot about global\nwhat countries maintain a\nwarming these\nterritorial claim in\ndays. But is it\nClick on this link to read about\nAntarctica? Which country\nwhat is happening to cause a\nreally happening?\nchange in ice mass. holds the largest claim?\nClick on the link\nYou may be wondering\nbelow to read about what is happening to cause a\nwhy don’t you see the\nchange in ice mass to this continent.\nUnited States name on this\nmap. The United States\ndoes not hold a claim but\nWhy are countries interested in Antarctica?\ndoes reserve the right to\nmake a claim in the future.\nEven though Antarctica is an extremely desolate and\nTerritorial claims were\ndifficult place to live, there are many natural\nclaims on the land made\nresources that make it very financially attractive for\nby different countries. The\nmany countries. Petroleum, coal, ice, copper, and\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/0b\/\nAntarctic Treaty was\niron are just a few of the many natural resources\nAntarctic_Region.png\ncreated in 1961 but neither\navailable in Antarctica. However, the harsh climate,\ndenies nor recognizes these claims.\nthick ice and short work season make it very difficult to retrieve\nany resources. Many believe that as resources are depleted\nworldwide, economic pressure will force mineral and petroleum\n191 What is the Antarctic Treaty? The Protocol on Environmental Protection to the Antarctic Treaty\nwas signed in Madrid on October 4, 1991 and entered into force\nThe Antarctic Treaty was signed December 1, 1959 in\nin 1998. It designates Antarctica as a “natural reserve, devoted to\nWashington, D.C., and was entered into force on June 23, 1961.\npeace and science”, establishes the principles pertaining to\nThe objective of this international agreement is \"to ensure that\nhuman activities in Antarctica and prohibits all activities relating to\nAntarctica is used for peaceful purposes, for international\nthe exploitation of mineral resources, except for scientific\ncooperation in scientific research, and does not become the\nresearch.\nscene or object of international discord.\"\nThe current moratorium that bans drilling and mining in Antarctica\ncan be reviewed after the 50-year anniversary of the ratification,\nwhich will occur in 2048. What is being done today to insure that\nMovie 8.2 Go South\nthis treaty will continue?\nWhat is 2041 and Who Is Robert Swan?\n“The greatest threat to our planet is the belief that someone else\nwill save it.” - Robert Swan\n2041 was founded by polar explorer, environmental leader and\npublic speaker Robert Swan. Robert’s goal is to increase\nawareness now and garner support by the year 2041 (the 50-year\nanniversary of the signing of the Antarctic Treaty) to ensure the\ncontinued protection of the Antarctic Treaty so that the last great\nwilderness on earth is never exploited. 2041’s mission is to build\non Swan’s dedication by informing, engaging and inspiring the\nnext generation of leaders to take responsibility, to be\nsustainable, and to know that now is the time for action in policy\nCourtesy, 2041\n192 development, sustainable business generation and future Video Questions:\ntechnologies.\nAs the first person in history to walk to both the North and South\nPoles, Swan has dedicated his life to the preservation of\n1. What are people doing around the world to help\nAntarctica by the promotion of recycling, renewable energy and\npreserve this Earth?\nsustainability to combat the effects of climate change.\n2. What can we do to help preserve Antarctica?\nMovie 8.3 Tetrapak in India\nGlobal Connections\nWhy is Antarctica Important?\nWendy Gideman is a teacher in England and has been on two\ntrips to Antarctica. She has blogged about her trip and set up a\nsite with information about the beautiful continent. The following\nactivity that she has created on her site contains a lesson about\nthe global impact of humans on Antarctica and the importance of\ndoing our part to preserve it for generations. Please take a few\nminutes to read her ideas: https:\/\/sites.google.com\/site\/\nfrozenclassroom\/journal-blog\/lesson-7--environmental-issues\nCourtesy, 2041\n193 What are some things you can do to help preserve our World? You have taken a tour of Antarctica and learned about the\nphysical and human geography. Now take what you learned and\nanswer the inquiry questions in your journal:\n•Recycle and reuse things instead of throwing them in the\ngarbage How does the history of Antarctica impact it’s role in the\nworld today?\n•Turn off lights when you leave a room\nHow are we, as members of a global society, connected?\n•Don’t leave the water running\n•Keep learning about the environment and as you learn, apply\nyour new knowledge to help the environment and Antarctica!\n•Tell your friends and continue to pass along accurate and\ninformative information\nMore web resources:\nInteractive 8.17 Interactive\n•Reduce the use of paper\nJournal\nhttp:\/\/\n•Reduce use of bottled water classroom.antarctica.gov.au\n•Compost\n•Exercise, study, or work outside or in areas that do not need https:\/\/sites.google.com\/site\/\nelectricity frozenclassroom\/\n•Eat at restaurants that source local produce\nPlease note: once you have\ncreated your own copy of this\n•Avoid businesses\/products that use harmful tactics or practices\ndocument, this widget will only\nreturn you to the blank copy. You\n•Be active in public sustainability forums and then share acquired will need to access yours by\nopening from your own Google\nknowledge\nDocument.\n194 Chapter 9\nThemes In\nAction -East\nand South\nEast Asia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global society connected?\n2. How do the five themes of geography help geographers\nstudy the world? Section 1\nLocation\nQUESTIONS TO\nGUIDE INQUIRY\nIn the first six chapters of this book you studied a theme of\n1. How are we, as\ngeography and how it related to the region under study. In\nmembers of a\nthe last two chapters of this book you studied multiple\nglobal society\nconnected? themes and how they related to the regions. In this final\nchapter of the book you will put all five themes into practice\n2. How do the\nfive themes of by studying the most populous of the continents - Asia.\ngeography help\nMore specifically, you will study the themes in practice in\ngeographers\nEast Asia, which includes large countries in terms of land\nstudy the\nmass and population such as China and Mongolia, as well\nworld?\nas smaller nations such as North and South Korea and\nJapan.\n196 image source: http:\/\/www.iu.edu\/~iaunrc\/sites\/default\/files\/lat-long%20map.jpg\nImage source: http:\/\/www.jrank.org\/history\/article_images\/Asia_p96_2.jpg\nWhere is it?\nChina and Mongolia are only two countries in Asia however,\nTake a look at the map above. Two prominent Asian countries are\ndepicted in the map above are three more. Using your\ncircled in blue. Using your knowledge of latitude and longitude,\nknowledge of latitude and longitude, describe where Japan and\ndescribe where China and Mongolia are.\nthe Koreas are located.\n197 Image source: http:\/\/www.theodora.com\/maps\/new3\/eurasia_color.gif\nThe map above is at a larger scale than the previous. It\nNow think beyond longitude and latitude. Using the map above\nshowcases the region under study in terms of several other areas\nas well as the previous ones, describe where China, Mongolia,\nthat you have already spent some time learning about. Africa is\nJapan, and the Koreas are. Are you taking into account the\nclearly labeled on the map, but above the blue circle is Russia.\nbodies of water that you can see on the map? What about\nWhat lies to the west? Describe East Asia’s location using the\nphysical features such as mountains?\nmap above.\n198 Image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/9\/91\/Winkel_triple_projection_SW.jpg\nFinally, If you view the region in terms of its location on a world\nmap, what do you notice about its relative size, its relationship to\nother regions you have studied this year, and its similarities in\nterms of latitude and longitude to other regions?\nWrite a brief paragraph describing where East Asia is located.\nYou may use any of the notes you have taken regarding location\nin this region so far.\n199 Section 2\nPlace\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global\nWhen studying this region it is difficult to call attention to one defining\nsociety connected?\ncharacteristic. To answer the geographic question of “What is it like there?” you\n2. How do the five themes of geography help\nneed to focus in on certain countries to get an answer. This is a region that has a\ngeographers study the world?\nlittle bit of almost everything.\nChina for example borders the region identified earlier as South Asia with the\nHimalayan mountains. You may recall that the Himalayas contain the world's\nhighest peak - Mount Everest. Travel north from South Asia into China through the\nHimalayas and you’ll reach what is sometimes referred to as the “roof of the\nworld”, the Plateau of Tibet. With an elevation over 13,000 feet, this is the world’s\nhighest plateau.\nIf you move further north and east you’ll end up with another answer to the\nquestion of “What is it like there?” The Gobi Desert occupies much of Mongolia.\nIt is over 1,000 miles long and is the fifth largest desert in the world.\n200 Think back to the chapter on Northern Africa. What is it like in\nthe Sahara Desert?\nImage source: Image source: https:\/\/en.wikipedia.org\/?title=Gobi_Desert#\/media\/\nImage source: https:\/\/en.wikipedia.org\/wiki\/North_China_Plain#\/media\/File:ChinaGeography.png\nFile:Gobi_desert_map.png\nTravel further east and you’ll hit the North China Plain. Due in\nIf you have studied the Sahara desert you might be surprised to\npart to how close several important water supplies are, including\nlearn that not all deserts share the same characteristics. The\nthe Huang He (Yellow river) and the Chang Jiang (Yangzi river)\nGobi is a very cold desert. Because it is a higher elevation, as\nmuch of China’s population is located in this region.\nwell as much farther north of the Equator than the Sahara, the\ntemperatures are much lower. Sometimes the differences in\nGiven what you have already studied about where\ntemperature within a 24 hour period of time can be as much as 63\ncivilizations tend to arise, make a prediction: Where do you\ndegrees!\nbelieve most of the population concentration is in this area?\n201 Moving further east into the East China Sea you’ll travel across it While discussing the location of the region you might be able to\nand reach the Korean Peninsula and the islands that make up say: “It is north of the Equator” and “Above the Tropic of\nJapan. Mountains cover almost 75% of the Japanese islands. Cancer”, what it’s really like there depends on many of the\nThe climate in the northern part of Japan and much of the Koreas physical characteristics discussed already.\nis similar. Generally the summers are cool and the winters very\ncold. Further south\nhowever the winters are\nActivity: Take one of the\nmilder and the summer\ncountries discussed in this\nhot.\nsection and use CIA\nFactbook to try and\nMuch of the Korean\nanswer the question “What\npeninsula is also made up\nis it like there?” Discuss\nof mountains. The Koreas\nyour answer with a\nalso have large plains\nclassmate.\nfound along the western\ncoast. There are more\nrivers in Korea than in\nJapan.\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/b\/b0\/World_map_indicating_tropics_and_subtropics.png\nWhat is it Like There?\nAs you may have guessed, to answer the question “What is it like\nthere?” depends entirely on where you go in the region.\n202 Section 3\nRegions\nQUESTIONS TO GUIDE INQUIRY What is a region’s characteristics? You have already learned that it is sometimes\ndifficult to classify a region as a region. All classifications are labels which mean\n1. How are we, as members of a global\nsociety connected? different things depending on your perspective. Typically the world has been\nclassified in a “Eurocentric” way.\n2. How do the five themes of geography help\ngeographers study the world?\nIt is even more difficult to classify Asia as a region on its own due to the physical\nand human diversity of the region. Russia is part of Northern Asia, but the sheer\nsize of that country also places it in Eastern Europe. India is part of Southern Asia.\nThat region can be partially categorized by the mountain ranges that run through\nit.\nThe Asian continent cannot be easily labeled by climate, or physical\ncharacteristics. It contains both the highest and lowest points in the world.\nDepending on the location, the land could range from rugged and inhospitable to\nfertile and suitable for farming.\n203 It is also difficult to label the region based on human\ncharacteristics. The region contains multiple forms of\ngovernment, multiple religious practices, and many distinctly\ndifferent cultural characteristics. Over time many of these have\nblended (particularly religion and certain cultural characteristics\nwhich you’ll learn more about in a later section) but the people\nliving in Asia are all distinctly different from one another.\nImage source: https:\/\/en.wikipedia.org\/wiki\/Boundaries_between_continents#\/media\/\nFile:Europe_Asia_transcontinental.png\nIt is generally considered that there is an imaginary border\nbetween Europe and Asia which separates one continent into\nImage source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/0\/08\/Eurasian_mass.jpg\ntwo. This line runs along the Ural mountains. To the south of\nthe Urals, it generally follows major river and mountain ranges,\nthough even this division is difficult to make.\nUsing the map above, where would you mark the division\nbetween Europe and Asia? Explain why.\nOnce you finally have Asia sectioned off, look once again at some\nof the regional divisions you have already studied in this book.\n204 Explain why it can be difficult to label a region.\nImage source: http:\/\/www.indiandefencereview.com\/wp-content\/uploads\/2012\/02\/South_Asian_Region.jpg\nOn this map you studied the region labeled “West Asia” in the\nchapter on North Africa and the Middle East. Northern Asia and\nCentral Asia was addressed in the Europe and Russia chapter.\nSoutheast Asia was covered in Oceania. East Asia as depicted\non this map utilizes both mountain ranges and physical country\nborders to finally receive a label “East Asia”\nHow else might you regionally label East Asia?\n205 Section 4\nHuman\/Environment Interactions\nQUESTIONS TO GUIDE INQUIRY In several other chapters you have already explored the theme of Human\/\nEnvironment interaction. The question geographers ask in studying this theme is\n1. How are we, as members of a global\nsociety connected? “How do we adapt to and change the environment?” All across the globe humans\nhave modified and changed the environment to make things suitable for people to\n2. How do the five themes of geography help\ngeographers study the world? live. The people living in Eastern Asia are no different.\nIn this section you will learn about how people live in the Gobi Desert regions of\nChina and Mongolia. You will also learn about the Three Gorges Dam and some of\nthe environmental risks and benefits that this massive project has created.\n206 The Gobi Desert - From Deforestation to Reforestation Every year the Gobi Desert expands, and this expansion\nthreatens farmland in China and Mongolia. This has far-reaching\neffects far beyond these two countries. The main cause of this\nproblem is similar to problems found in other large desert regions\nin the world, including the Sahara. Overgrazing, deforestation,\nand farming practices all contribute to the spread of this desert.\nThe problem doesn’t just affect China. The spread of the Gobi\nDesert and the deforestation of the country has led to what is\nknown as “Yellow Dust Storms” as far away as the Korean\nPeninsula. The storms are occurring\nwith increasing frequency, carrying\nInteractive 9.1 Yellow Dust\ndust and toxic inhalable substances Storms\nfrom mainland China and Mongolia\nup the Korean Peninsula. These\nImage source: Shutterstock, Murosvur\nstorms can also last several days.\nBecause of this the storms have a\nnegative effect on both the personal\nOver one thousand years ago, small collections of walls were\nhealth and well being of Korean\nfortified to create the “Great Wall of China” which served to\ncitizens, as well as the economic\nprotect the country from outside invaders. This same idea is now\nLearn more about the Yellow Dust\nhealth of the country. Learn more\nbeing utilized to protect the natural resources of the country to Storms in this video from CNN\nabout the Yellow Dust Storms in the\nhalt the spread of the desert and eventually reclaim the land that\nwidget on this page.\nhas been lost to the desert.\n207 Question for consideration: Is finding a solution to this issue over time. The government of China is calling the project a\na global concern? Why or why not? success, though critics worry that without the ability to bring\nwater to all of these trees it might not be a viable long term fix.\nThe proposed solution is called the Three-North Shelter belt\nProgram or the Green Great Wall of China, widely believed to be Even though the project will not stop the desert’s expansion, or\nthe largest ecological project in history. Trees are being planted - the yellow dust storms in the Koreas by the time you wake up\nmore than 9 million acres of forest, to help stop the desert from tomorrow, China has reported that the project has improved the\nvegetation in the Green Wall region. In the future, this sustainable\nspreading further. The term for this is known as Reforestation.\nproject could lead to the increase in available farmland and serve\nThis will not turn back the desert overnight, but is part of a long\nas a place for the large population of China to expand. The\nterm strategy to help cut off the effects of the expanding desert\nGreen Wall, if successful, may also be able to help other regions\nof the world, particularly North Africa, in combating similar\nproblems.\n208 Three Gorges Dam the Three Gorges Dam was envisioned and created. Brought\nonline in 2006 and finally completed in 2014, the dam has helped\nAs the economy and population of nations grow one of the\nsolve energy and transportation problems. Critics of the project\nproblems they face is how the country is powered. You’ve\nworry that the environmental impact of the dam could offset the\nalready learned about how the Green Wall of China has helped\nbenefits.\nstem the problem of desertification, but another large scale\nproject undertaken by the government has helped with the The graph on this page shows historical information in the\nproblem of providing energy for the country. In December of production of energy in China. Like many countries China relies\n1994 construction began on one of the largest scale dam projects heavily on fossil fuels to power the country, but hydroelectric\nin the world. In the hopes of harnessing the power of energy use is on the rise, partially due to the creation of the Three\nhydroelectric energy, energy created from the movement of water, Gorges Dam. It will take a long time for the blue line on the chart\nto overtake the red line, but significant progress has been made\nsince the dam became operational in 2006.\nThe dam project cost $22.5 billion dollars to complete, and\nconsists of 32 main generators which continue to create power.\nThe cost of the project is expected to be recovered through\nenergy creation by the mid 2020s.\nFrom an economic standpoint the Three Gorges Dam is about\nmore than just energy creation. The dam is intended to\nincrease the shipping capacity on the Yangtze river by allowing\ntravel both upstream and downstream.\nAll of these benefits have come at more than just a financial\ncost. 1.3 million people were forced to move away from their\nhomes along the river due to the construction of the dam.\nBecause the dam creates a barrier in the river, many species of\n209\n(Image source: https:\/\/en.wikipedia.org\/?title=Three_Gorges_Dam#\/media\/File:Electricity_Production_in_China.svg) fish will not be able to travel upstream to spawn. It is believed The dam has also resulted in lower water levels in other parts of\nthat the population of these species will decrease. The project the country. That has caused large droughts which disrupt\ndestroyed many communities forcing the people to relocate. farming. Shanghai, the largest city in China is experiencing a\nshortage of water. Less freshwater flows downstream for them to\nutilize, and with the river emptying into the ocean, salt water is\nmixing with the fresh water farther upstream each year.\nThe reservoir for the dam ended up creating a lake. The water\nbegan to erode away the land around and underneath the\naffected area which resulted in landslides, many of which\ndisplaced more people and killed others. With both positive and negative consequences already surfacing,\nit will remain to be seen whether or not the Three Gorges Dam will\nbe viewed as a massive success or failure for the Chinese\ngovernment.\nThe reservoir also sits on two\nmajor fault lines. The strain from a Interactive 9.2 Trouble for\nthe 3 Gorges Dam\ndam built in America in the 1950s\nand 60s along a similar fault line After reading this section and viewing the video clip, make an\ncaused a large number of argumentative claim either for or against the Three Gorges\nearthquakes. The filling of the\nproject. Use evidence to support your claim.\nreservoir is widely believed by\nscientists to be the cause, and\nwhile the Three Gorges Dam has,\nas of 2015, experienced small\nWatch this video describing some\ntremors, people are worried that of the problems with the Three\nGorges Dam: https:\/\/\nthe occurrence of larger ones are\nwww.youtube.com\/watch?\nv=YtgOntg0ofc\nonly a matter of time.\n210 Section 5\nMovement in South East Asia\nQUESTIONS TO GUIDE INQUIRY\n1. How are we, as members of a global\nHave you been reading this digital textbook on a device like a Chromebook, an\nsociety connected?\niPad, or a Samsung tablet? If so, chances are the device was either assembled in\n2. How do the five themes of geography help\nparts of Asia, or many of the internal components came from there. China, Japan,\ngeographers study the world?\nand South Korea are major producers of automobiles, electronic technologies, and\nmany smaller consumer goods such as clothing and toys. These products are then\nexported and sold around the world.\nWhy do you think so many products are made in this region?\nMade in China\nThe United States, as well as many other economic powerhouses in the world, has\nmany corporations which are based in North America, but assemble their products\nin other countries. If the goal of a business is to make a profit, the reason why so\nmany things are assembled in Asian countries such as China, Korea, and Japan\ncomes down to a company’s bottom line - costs. Companies operating in the\nUnited States (for example) have restrictions on who can work, how long an\n211 average work day is, and what the minimum amount of pay a countries, and the conditions at the\nInteractive 9.3 Made in\nworker can receive is. factories have sometimes caused China\ninjuries, high turnover rates among\nemployees, and even in extreme\ncases - death. China in particular\nis able to manufacture products\nlike iPads at an enormous rate,\nbut the factory that creates these\ndevices is a good example of\nLearn more about conditions at\nmany of the problems in the\nthe factory that produces iPads by\nviewing this video from the New\nregion.\nYork Times.\nhttp:\/\/www.nytimes.com\/video\/\nbusiness\/100000001313019\/\nmade-in-china.html\nShould companies based in the United States “outsource”\nthe creation of their product to another country? Why or\nwhy not?\n(Image source: https:\/\/upload.wikimedia.org\/wikipedia\/commons\/a\/ae\/CE_Made_in_China.jpg)\nMade in America\nDespite many claims that America imports too much from Asia,\nFactories in Asia are able to produce consumer goods at an over 28% of everything produced in America is exported to Asia.\nextremely fast rate, faster than many factories in America. This Computers and electronics make up 17% of everything we\ncomes at a risk to the people who work at these factories export and send to Asian countries. Equipment for\nhowever. The workers are paid far less than workers in other transportation, as well as heavy machinery make up the next\n212 largest chunks of this pie. With so many products moving from\nAsia to North America, and the reverse also being true, a\ndisruption in production or the supply chain in one region could\nbe devastating to the other.\nHow are the countries in Asia and the rest of the world\ninterconnected through trade?\nMoving People\nJapan is considered to be one of the pioneers in moving people\nover high-speed railways. The Japanese Bullet Train known as\nthe Shinkansen was first envisioned in 1959 and opened to the\npublic in 1964. With much of the land in Japan being covered in\nmountains and much of the population centered around the\ncoast, travel to certain parts of the country was difficult.\nImage source: https:\/\/en.wikipedia.org\/wiki\/High-speed_rail_in_Asia#\/media\/\nFile:Shinkansen_map_201503_en.png\nWhy might the railways be set up along the routes depicted in\nWhy might a series of high speed trains be beneficial to a\nthis map?\ncountry?\n213 The solution in Japan became a solution eventually copied by China’s developed beginning in the early 1990s and as of\nChina, the Koreas, and other parts of the world. The Shinkansen December 2014, have the longest railway network with almost\nis a fast train often referred to by locals as the “Bullet Train” due 10,000 miles of track laid across the country. China, as well as\nto its speeds and shape. When first opened in the 1960s, the Japan and Korea, continue to invest in improving the technology\ntrain was able to travel an unprecedented 130 miles per hour. and expanding the service.\nImprovements to the train now give it the ability to travel almost\n300 miles per hour. If a Japanese person wanted to drive from\nKyoto to Tokyo, even under the best driving conditions, it would\nThe technology behind the Japanese, Chinese, and Korean high\ntake 6 hours to travel the 284 miles. On the bullet train, that time\nspeed rails has been studied by other countries and has\nis cut down to just over an hour.\ninfluenced the development of similar lines in other countries.\nMoving people around the world has become faster due to the\nexpansion of technology that had its first commercial successes\nMany people in Japan live in one city and work in another. It is in Asia.\nnot uncommon for a Japanese person to live 50 (or more) miles\naway from the city in which they work. How might a high speed\nrail system benefit their country? How might developing a high\nspeed rail system in other countries benefit the citizens living\nthere?\nSouth Korea developed their high speed railway system over a\nlong period of time, bringing it operational in 2004. While not as\nfast as its Japanese counterpart, the KTX high-speed rail has\nsignificantly cut down the travel time from place to place in South\nKorea.\n214 "}