{
    "text": "Chapter 4. Europe\n4.1 Opportunity at the edge of a Continent.\nLearning Objectives:\n1. Overview the physical dimensions and physiographic regions of Europe,\n2. Describe how Europe’s geography is an advantage for trade and interaction,\n3. Apply the concept of Complimentarity, Transferability, and Intervening Opportunity,\nLocated on the far western portion of the Eurasian Continent, the realm of Europe hosts a unique array\nof environments and opportunities for the people who call it home. Europe is often called a continent;\nan unfortunate hold-over from a geographic perspective of England looking east. The north, west, and\nsouth boundaries of this realm are marked easily enough by a series or seas, oceans, straights, and bays.\nThe east is much more problematic. Some sources like to place Europe’s eastern border at the Ural\nMountains, but this is more of a desire to use physical elements as boundaries (see figure 4.1). For the\nsake of this text, and consistent with cultural definitions of Europe taught in most college geography\nsettings, Europe’s eastern edge is the border of Russia, which is in a separate realm and a chapter unto\nitself. Figure 4.1. Relief map of Europe with labels of countries in and around the realm. Parts of the North\nAfrica/Southwest Asia are shown. Russia’s western flank also is seen. These fall outside of the European\nRealm as defined in this text. Map courtesy of “San Jose,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Europe#/media/File:Europe_topography_map_en.png .\nA look at Europe’s physiography reveals some general patterns, and are overlain on the map below\n(figure 4.2). In the south are found geologically active mountains such as the Pyrenees, Alps, and\nCarpathians. These mountains are being uplifted under collisional stress, and as a whole, contribute to\nsome of the realms most spectacular scenery (figure 4.3).\nFigure 4.2. Four regions of relief are found in Europe. Derivative cartography by Lincoln DeBunce. CC BY-\nSA 3.0. Based on the image by “San Jose,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Europe#/media/File:Europe_topography_map_en.png Figure 4.3. The Bavarian Alps in Germany is part of a larger Alpine system of mountains. St Coloman's\nSanctuary is in the foreground. This scene is one of countless examples showing the photogenic qualities\nfound in this region. Image courtesy of Rebecca Kennison, Creative Commons Attribution-Share Alike 3.0\nUnported license. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Germany_bavaria_alps-church.jpg\nUpland portions of central Europe, called the Massif Central in France, and the mountainous Black and\nBavarian forests of Germany, are much older volcanic formations. Together, they create a buffer\nbetween the elevated mountains to the south, and an extensive low lying plain extending from France\ninto Russia.\nThe North European Plain is home to several hundred million Europeans who historically utilized the rich\nlowland soils in agricultural pursuits. Dense cities and rural countryside are typical of the wide-ranging\nlandscape region (figure 4.4).\nFraming the North European Plain on the north and west are a series of old, worn highland areas,\nincluding much of Norway, Scotland, and arcing south into the Iberian Peninsula of Portugal and Spain.\nHistorically, these highland areas have been used for pastoralists and are generally inhospitable to\nhorticulture. These areas, like much of Europe, have outstanding scenic appeal (see figure 4.5). Figure 4.4. The topography of this rural scene in Lithuania is typical of the North European Plain. Image\ncourtesy of “Algirdas,” Creative Commons Attribution-Share Alike 3.0 Unported license. Retrieved from\nWikimedia: https://commons.wikimedia.org/wiki/File:Tveru_seniunija,_2007-06-12.jpg\nFigure 4.5. Eilean Donan Castle in the Scottish Highlands is emblematic of the ruggedness and beauty of\nthe Western Highland region. Image courtesy of Guillaume Piolle, CC BY 3.0. Retrieved from Wikimedia\ncommons: https://commons.wikimedia.org/wiki/File:Eilean_Donan_castle_-_95mm.jpg Europe’s climate is also diverse. High mountain zones and northern locations tend toward “Df” and “ET”\nclimates, where hardened trees give way to low growing vetches and bushes in the Tundra zone. In the\nsouth, the hot, dry summers and wet winters are hallmarks of luxurious Mediterranean climates (Cs).\nEast of the southern mountains, in dry rain-shadows, some semi-desert “BS” climates prevail. In the\nwest, buffeted by warm waters of the North Atlantic Drift, humid continental “Cf” climates dominate\n(see figure 4.6 below).\nFigure 4.6. Europe’s climates show variety from hot Mediterranean climates of the south to cold tundra\nclimates to the north. The western edge of Europe is warmed by the North Atlantic Drift. Image courtesy\nof Peel, M. C. and Finlayson, B. L. and McMahon, T. A. (2007). \"Updated world map of the Köppen-\nGeiger climate classification\". Hydrol. Earth Syst. Sci. 11: 1633-1644. ISSN 1027-5606. Free use\ndocumented in Wikimedia: https://commons.wikimedia.org/wiki/File:Europe_K%C3%B6ppen_Map.png\nThis physical diversity, both in terms of topography and climate, has allowed people in different\nenvironments to specialize in different economic activities. For instance, South Europe’s Mediterranean\nclimates have helped foster agricultural products adapted to this climate such as wine grapes and wines,\nolives, figs, citrus, and pears (figure 4.7). In the Scandinavian north, forestry, fishing, mining are more\ntypical. In the highlands of the Alps, dairy, cheese and precision machinery, like clockworks were\nfostered. These different activities and products provide an opportunity for trade and exchange. Figure 4.7. Several varieties and preparations of olives are seen in in the marketplace of Toulon, France.\nRegional specialization of products is a hallmark of Europe. Image courtesy of David Monniaux, CC BY-SA\n3.0. Retrieved from Wikimedia:\nhttps://en.wikipedia.org/wiki/Olive#/media/File:Olives_au_marche_de_Toulon_p1040238.jpg\nThe geographic conditions needed for trade are viewed in the terms complimentarity, transferability,\nand intervening opportunity. Complimentarity means that “place one” has something “place two” can\nuse, and that “place two,” in return, has something “place one” wants; they have potential for a\ncomplimentary relationship. For example, France has olives that German markets would like, and\nGerman irrigation equipment is something that French farmers want. Therefore, an exchange would be\nmutually beneficial. Yet, complimentary relationships don’t automatically happen in regions in Europe or\naround the globe. For instance, if French olives are the same as Spanish olives, why trade? No\ncomplimentarity exists.\nEven if two places have complimentary things to trade, it doesn’t mean they are able or wish to do so,\nfor a variety a reasons. It could be the two places are adversaries. In Europe, Germany and France didn’t\nalways get along, and trade would be limited. An extreme example in another realm today involves the\nKorean Peninsula. South Korea could use the minerals to make fertilizers that North Korea has, and\nNorth Korea could use the food South Korea produces. But there is a hard boundary and political\nreasons for not trading these things. In additional to political barriers, which can include tariffs, quotas and embargos, physical barriers can\ninhibit exchange too. A river, a mountain range, poor roads and transportation methods, as well as\ndistance, can inhibit would-be complimentary partnerships to not work out. These aspects are covered\nunder the idea of Transferability, the second part of the trade equation. In the case of Europe, its\nnumerous inlets, bays, peninsulas, islands, and other points of contact to waterways have enabled\npeoples to trade and interact more easily than many other world regions. And various European peoples\nhave historically enhanced the waterways by building canals and numerous protected ports that can\nharbor vessels, as well as load and off-load cargo. Today, highways, high-speed rail lines, numerous\nairports, and relaxed border protections augment these historical connections.\nThe third ingredient to the exchange equation is intervening opportunity. This is the idea that when two\nplaces are engaged in trade (place one and place two), another place (place three) can disrupt trade\nbetween the other two by having a more attractive location and thereby replace an original trade\npartner. An example of this at a local scale is having a convenience store act as an intervening\nopportunity for you wishing to buy a soft drink that you would have had to otherwise purchase at a\nmore distant big box grocery store. At the global scale, an example is the evolving trade of Australia with\nits former colonial sponsor, Great Britain. For both cultural, historical and economic reasons, much of\nAustralia’s early trade was with Great Britain. Britain could use the wool Australia produced, and\nAustralia could use the finished goods manufactured back in Europe. But over time, East Asia has\nbecome an intervening opportunity for Australia. Australia has raw materials countries like Japan needs,\nand Japan can furnish the finished products and provide the influx of cash Australia wants. In many\nother circumstances, however, Europe has an advantage when it comes to intervening opportunities of\ntrade. As shown in the map below (figure 4.8), Europe can be seen as central to a land-based northern\nhemisphere, while in contrast, regions like Oceania are at a disadvantage. In essence, Europe is in a\nprime intervening location to other world realms. Figure 4.8. Europe is in the center of the land hemisphere of the north, while Oceania is far away from\ntrade northern trade partners. Derivative cartography by Lincoln DeBunce, based on the maps by\n“Citynoise,” CC BY-SA 4.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Land_and_water_hemispheres#/media/File:Hemisphere_land.png\n4.2 Cultural Patterns of Europe.\nLearning Objectives:\n1. Associate Europe’s language and religious spatial patterns.\n2. Differentiate Europe’s regional cultural landscape variety.\n3. Contrast urban, village, and rural places.\n4. Describe Europe’s major regions.\nEurope’s cultural diversity matches it physical diversity. Many different groups of people, who\ndistinguish themselves by their ethnic designation, their nationality, their language, their religion, or a\ncombination of the above and more, create a patchwork mosaic across the realm. A look at language\ntells us a bit about these differences. Examining figure 4.9 below reveals numerous languages, many of\nwhich have a common origin and some that are not related to others at all. Germanic languages, such as\nEnglish, German, Danish, and Norwegian, are found in a north-central wedge pattern. Romance\nlanguages, like Spanish, French, and Italian, are generally found in Southern Europe. A northeast to\nSouthwest pattern of Slavic languages, like Polish, Ukrainian, and Croatian are also seen. Isolated\nlanguages, like Basque, located between Spain and France, as well as remnant Celtic tongues like\nBreton, and Welsh Gaelic, are evidence of languages more widespread in the past than today. Figure 4.9. Languages of Europe. Germanic, Romance, and Slavic language groups interplay with a\nnumber of other unrelated groups and individual remnant languages. Image Courtesy of “Andrei nacu,”\nCC BY-SA 3.0. Retrieved at Wikipedia:\nhttps://en.wikipedia.org/wiki/Eurolinguistics#/media/File:Languages_of_Europe.svg .\nReligion is another cultural feature that bears some geographic overlap with languages. Protestantism is\npredominant in north-central Europe, and Eastern Orthodoxy is found in Slavic and Hellenic (Greek)\nareas. Roman Catholicism is dominant in southern European, but is also widespread where the\nProtestant Reformation did not displace the older Catholic pattern (see Figure 4.10. below). Figure 4.10. Predominant religious patterns in Europe. Image courtesy of “San Jose,” Creative Commons\nAttribution-Share Alike 3.0 Unported license. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Europe_religion_map_situation_1950_en.png\nOf course, cultural patterns and contrasts show in many other forms, including Inheritance patterns,\nmusic, foodways, political preferences, stylistic architecture, and the like. When cultural patterns are\ncrafted into the existing physical landscape, distinct cultural landscapes emerge. Traditional “folk”\nhousing, for instance, reflects the regional places in which it was crafted. Contrast the following use of\nmaterials used in figures 4.11 through 4.13 below. Wood is very common in Scandinavian houses (figure\n4.11). Half-timber half-stone “timbered” construction is used in traditional housing in much of central\nEurope (figure 4.12), while stone is a common architectural component in southern Europe (figure 4.13). Figure 4.11. The use of local material ranges in Europe from a northern preference for wood and earth,\nto a southern predilection for stone. Trønderlåne house in Norway, is an example of the former.\nCourtesy of Leif Knutsen, CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Architecture_of_Norway#/media/File:Tronderlaane_in_Oppdal_Norway.j\npg .\nFigure 4.12. Half-timbered houses in Backnang, Germany, show a combination of stone and wood in\ntraditional construction. Courtesy of “Miebner,” CC BY 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Timber_framing#/media/File:Weihnachtsmarkt_Backnang_2010.jpg . Figure 4.13. The predominant use of stone is seen in the Southern European town of Orvieto, Italy.\nCourtesy of “rdesai,” CC BY 2.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Orvieto#/media/File:Orvieto_in_Italy.jpg\nFood and drink show relationships of land and culture as well. The plentiful herring of the Baltic Sea\nhave led to the well-known pickled herring of Sweden. France’s wine-grape regions (appellations) of\nBurgundy, Champagne, and others, are known world-wide for their specific qualities. Germany, beer,\nbratwurst and sauerkraut are a natural and National combination. Hungary is known for its use of local\nand plentiful paprika in its goulashes. These are a few of numerous cultural combinations that\nintertwine a people’s heritage and creativity with local distinctive environments, producing distinctive\nlandscapes (figure 4.14). Figure 4.14. Culture modifies the natural environment, producing cultural landscapes. This scene is of Le\nmoulin de Verzenay, in the Champagne appellation of France. Photo courtesy of “Vassil,” released into\nthe public domain. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/File:Verzenay_moulin.jpg\nAnother obvious cultural contrast in Europe is seen in the views of urban, village, or rural life. Older\nEuropean cities were not designed for motorized traffic. They often are located along both sides of the\nold transportation linkage of rivers, and often include fortified walls or other means of defense. These\nremnants, along with less government support for automobile traffic and a heightened focus on\npedestrian, bicycle, and mass transit, makes these central cities appear generally much more compact\nthan U.S. counterparts. European cities are a combination of old and new. The maintenance of historic\nplaces sit alongside whole districts rebuilt after fires or repurposed by city leaders (see figure 4.15\nbelow). Figure 4.15. Historic structures in Grzybowski Square lie near modern skyscrapers in the central city of\nWarsaw, Poland. Photo courtesy of “Lukaszmalkiewicz.pl,” CC BY 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Warsaw#/media/File:Plac_Grzybowski_noc%C4%85.jpg\nSome European cities have gained a sense of being the symbolic, political, and economic heart of the\ncountry, such that it looms large over other cities of the country. These cities are called primate cities, a\nterm coined by geographer Mark Jefferson, who cited Paris as the exemplar primate city. When one\nthinks of France, Paris often comes to mind. The iconography, large symbolic structures like the Eiffel\nTower and the Arc de Triomphe, are powerful national symbols that ground the notion of modern\nFrance.\nSmaller towns and villages are commonplace landscape elements in Europe and speak of the time when\ntransportation was less developed and local farmers, fisherfolk, and others, relied on services and\nprotection found in a central place. In Western Europe, villages are mostly modernized with transport\narteries leading to and from major cities. Some villagers who live close to larger places might be inclined\nto commute. In other cases remote villages have been abandoned, and village to city migration has\noccurred. Eastern Europe is less modernized and here you will still find the trappings of village-life as it\nwas historically, though modern roads, electricity, and other conveniences are common (figure 4.16). Figure 4.16. The village of Dolno Lukovo, Bulgaria, is one of hundreds of villages that shows modern\nconveniences, traditional economies, and buildings reflecting a combination of construction types.\nPhoto courtesy of Красимир Косев, CC BY 3.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Dolno_Lukovo#/media/File:6586_Dolno_Lukovo,_Bulgar\nia_-_panoramio_(49).jpg\nThe industrial revolution began in England and spread unevenly throughout Europe and beyond. The\nrevolution sparked changes in society including the move of people to cities. Nevertheless, countryside\nhomes, farms, and manor houses are part of the European countryside and are sought after scenery for\ntourists and landscape photographers. Farmsteads, such as the one seen in figure 4.17 are an important\nelement in understanding the variety of European cultural landscapes. Figure 4.17. The historic Crevecoeurenauge chateau colombier ferme riviere, Normandy, is part of the\nscenery in France. Photo courtesy of “Karldupart,” CC BY 3.0. Retrieved from Wikimedia:\nhttps://commons.wikimedia.org/wiki/Category:Farms_in_France#/media/File:Crevecoeurenauge_chate\nau_colombier_ferme_riviere.JPG\nThe cultural differences in Europe are many, but generalities relating to regions have been attempted\n(see map below). Broadly speaking, Nordic Europe is characterized by high incomes and taxation that\nsupports the welfare of all citizens. High quality of life and democratic principles are a hallmark of the\nNorth. Eastern Europe is a shatterbelt of changing boundaries and country affiliations that are caught\nbetween a well-established Western Europe and Russia. Income and measures of quality of life are\nlowest in Europe, but rapid change and betterment for the majority of peoples is occurring since the fall\nof the Soviet Union. Southern Europe is characterized by poor soils and land fragmentation that inhibits\nproductive agriculture. Parts of Southern Europe compare positively with Western Europe, but rural\nareas are stagnant and poor. Southern Europe is home to great empires of the past. Greek and Roman\ncultures spread their ideas and traditions. Portuguese and Spanish explorers and conquerors imprinted\ntheir cultures onto much of Latin America and changed the way Europeans saw the world’s dimensions.\nWestern Europe is an economic powerhouse, the core of which is central Europe, anchored by an\nindustrial Germany. Figure 4.18. Major regions of Europe. Borders are approximate. Derivative cartography by Lincoln\nDeBunce. CC BY-SA 3.0. Based on the image by “San Jose,” CC BY-SA 3.0. Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Europe#/media/File:Europe_topography_map_en.png\n4.3 Cultural Awareness lesson: Europe’s Grand Experiment.\nLearning Objectives:\n1. Define supranational organization and illustrate reasons for joining one.\n2. Recite a shortened history of the European Union.\n3. Describe the relationship of Switzerland, Norway, Turkey, and the United Kingdom, with the\nEuropean Union.\n4. Contrast globalization and nationalism.\nEurope is involved in a political experiment. Countries are coming together, voluntarily, to form a\nsupranational organization called the European Union. Supranational organizations occur when three\nor more state of the world come together for some mutual benefit. In the case of the European Union,\nthe benefit is largely seen in the realm of economics. Creating a common currency, eliminating trade and transportation barriers, and negotiation for the mutual benefit of all members on the world stage is\na primary reason. But mutual protection, a court that can oversee and rule on cases between countries\nin the Union, as well as setting policy on immigration, environmental protection, and the like, are also\npart and parcel of the association. There was even a time when a common language was proposed,\nEsperanto, which borrows upon many European words and usages of grammar. It was ultimately not\nadopted, but illustrated a sentiment of some for a truly united Europe.\nThe seeds of the European Union began in the aftermath and rebuilding of World War II. The small\ncountries of Belgium, Luxembourg, and The Netherlands, formed a mutually beneficial trade alliance\nacknowledging that they are too small to go it alone, but together could be a trading force in Europe and\nbeyond. In 1957, France, West Germany, and Italy added themselves to the alliance, rebranding it the\nEuropean Economic Community. In the years following, many others made their way into the group,\nforming the present-day European Union (EU.). Today the membership totals twenty-seven. The\ncountries involved as well as hopeful future members are seen in figure 4.19. Figure 4.19. Member States in the European Union are shown in blue, candidate countries are in green,\nand potential candidate countries are shown in yellow. Modified image courtesy of “Glentamara,” CC\nBY-SA 3.0, based on an original by “Mflorian.” Retrieved from Wikipedia:\nhttps://en.wikipedia.org/wiki/Enlargement_of_the_European_Union#/media/File:European_Union_Me\nmbers.svg\nOf course, not every European country sees an advantage of joining the European Union. Switzerland,\nfor example, has one of the highest standards of living in Europe, and much of its success has been its\nstaunch neutrality for hundreds or years. Coupled with a very stable and desirable banking system, the\nreasons for not joining the EU outweigh any perceived benefit. Another country that almost joined the\nEU but didn’t is Norway. In this case, Norway’s northern citizens voted not to join. Southern Norway\ncitizens voted in favor. Economically, the folks around Oslo and other southern locales saw a benefit\nfrom being included in the nearby powerhouse of central Europe. Some Northerners, on the other hand,\nalready on the periphery of Norway’s economic core, could not see an advantage of joining. Coupled\nwith Norway’s access to lucrative North Sea Oil, the advantage of joining, just to share the revenue of oil\nwith poorer countries like Portugal, seemed illogical.\nOther countries are seeking to be part of the European Union but have a number of obstacles to\novercome. Turkey, for instance, has long sought entrance into the EU. Already a member of the North\nAtlantic Treaty Organization (NATO), its’ membership might make sense. But a lagging economy, and\nperhaps far more importantly, its policies on human rights have been a barrier. Culturally there is an\nissue as well. Turkey is not in Europe and its people do not see themselves as first and foremost as\nEuropean. Europeans also do not necessarily see Turkey as belonging to their realm. Religion is also an\nissue. Since the rise of terrorist groups like Al-Qaeda have emerged, and as Islamic refugees and\nmigrants flow into European countries, an anti-Islamic sentiment among a significant number of\nEuropeans has developed.\nThis brings us to the situation of the United Kingdom. A long-time member of the EU, one would think\nits place is secure. But British sentiment against perceived assimilation into a European amalgam\nculture, including loss of their British cultural ways and sovereignty, as well as a perception that their\ncountry would be at the mercy of migrants, has resulted in an anti-union backlash. A referendum vote to\nleave the EU passed by a small margin in 2016. Negotiations on how best to leave were tumultuous, but\nfour years later, in January 2020, the United Kingdom had officially left the Union, 47 years after it had\njoined.\nThe experiment of the European Union brings out the tensions involved when culture groups are asked\nto give up some sovereignty (control of their own affairs) to a larger governing body that they may not\nfeel attached to in meaningful ways. This is the tendency toward globalization, the ongoing\ninterconnected of peoples, places, and states, largely through market economics. Often, the economic\nand political benefits outweigh the sense of cultural diminishment and loss of control—but not always.\nNationalism, the strong feeling of connection to one’s own group and country, sometimes wins out."
}