{
    "text": "World Mythology World Mythology\nMyth, Metaphor, and Mystery\nANDY GUREVICH\nMHCC LIBRARY PRESS\nGRESHAM, OR. World Mythology by Andrew Gurevich is licensed under a Creative Commons\nAttribution 4.0 International License, except where otherwise noted.  Contents\nAttribution and OER Revision Statement vi\nIntroduction to the Course & Text 1\nChapter One - What is Mythology? 3\nAndy Gurevich\nChapter Two - Myth & Metaphor 10\nAndy Gurevich\nChapter Three - Myth & Archetype 14\nAndy Gurevich\nChapter Four - Myth & Meaning 18\nThe collaborative construction of mythological meaning.\nAndy Gurevich\nChapter Five - Myth & Ritual 23\nAndy Gurevich\nChapter Six - Myth & The Hero 30\nAndy Gurevich\nChapter Seven - Myth & The Anti-Hero 36\nAndy Gurevich\nChapter Eight - Myth & Revenge 41\nAndy Gurevich\nChapter Nine - Final Thoughts 47\nAndy Gurevich Attribution and OER\nRevision Statement\n“World Mythology: Myth, Metaphor, and Mystery” by Andrew\nGurevich is licensed under CC BY 4.0\nCover Image: “Cuneiform tablet: administrative account with\nentries concerning malt and barley groats (ca. 3100–2900\nB.C.)” by Sumerian, The Met Museum is licensed under CC BY 4.0\nThis text hopefully provides a resonate and dynamic approach to\nteaching mythology because it emphasizes the importance of\nmystery, awe, humility, and generative co-creation in the study of\nthe world’s wisdom traditions. We are, as Carl Sagan once said,\nthe Cosmos getting to know itself. So this means, as the wisdom\ntraditions have always taught, that each of us is a unique\nmanifestation of the whole. That the virtues of diversity, equity,\nand inclusion that are finally becoming more mainstream in social\nand academic settings are woven into the symbolic tapestries and\nmythological narratives of our ancestors. The universe is a complex,\nanimated, integrated and manifesting mystery. And we are, indeed,\na reflection of all of it. The exterior world reflects what the interior\nlandscapes also reveal during deep states of transformative\nmediation and ritual practice: the ultimate reality is ultimately a\nMystery. For all we have learned, we have yet to scratch the surface\nof the infinite ocean of our collective being. So we need each other.\nWe are each other. And the fluidity and permeability of essence we\nfind within the mythic traditions honors the uniqueness of every\nbeing, of every tradition, every identity, while simultaneously\nexposing a common core of essential unity that reminds us of our\nultimate home in each other.\nvi | Attribution and OER Revision\nStatement This book seeks to honor the\nspirit of these traditions by\npresenting the material in ways\nthat preserve and highlight the\nuniversal qualities of respectful\ncultural inquiry, deep\nengagement, transformative\nlearning, and student\nempowerment.\n(Unless otherwise linked and “Bronze foot in the form of a sphinx ca.\n600 B.C.” by Collection of George Ortiz,\nnoted, all versions of the myths\nGeneva, Switzerland; [with Robin\nin this text are from the Internet Symes, London, England]; by 1989 and\nuntil 2000, collection of Howard J. and\nSacred Text Archive or are in the\nSaretta Barnet, New York; acquired in\npublic domain. Some historical 2000, gift of the family of Howard J.\nand cultural information ha Barnet., The Met Museum is licensed\nunder CC BY 4.0\nbeen adapted from the now out\nof print “World Mythology: An Anthology of the Great Myths And\nEpics” by Donna Rosenberg McGraw Hill. 1999. )\nAttribution and OER Revision Statement | vii Introduction to the Course &\nText\n“What does our great historical hunger satisfy, our clutching about\nus if countless other cultures, our consuming desire for knowledge,\nif not the loss of myth, of a mythic home, the mythic womb?”\n–Friedrich Nietzsche\nErnst Cassirer writes in Language and Myth that myth is a\n“miracle of the spirit.”\nOne of its distinctive features\nis that it doesn’t necessarily\nrefer back to an objective\nreality. It may refer to an\ninternal, abstract, conceptual\nor emotional (invisible)\nreality. In as far as it tries to\ndescribe that which can’t be\nknown or named in an ordinary\nway-the mystical experience of\nGod, or Gods-it is a language of\nsymbols, of metaphors, a\nlanguage of correspondence\nrather than reference.\n“Medusa” by Alice Pike Barney,\nThis text uses insights\nSmithsonian American Art Museum\ngleaned from the fields of and its Renwick Gallery is licensed\nanthropology, religious studies, under CC BY 4.0\ndepth psychology, literature,\nand archaeology to explore the fundamental wisdom of the world’s\ngreat mythological traditions. Special attention is paid to\nconnecting the symbolic narratives and ceremonies of the ancients\nto the experiences, thoughts, and beliefs of people living today\nacross a wide spectrum of identities and cultural perspectives. The\n1 | Introduction to the Course & Text material is updated regularly to be as relevant, engaging, and\nscholarly as possible.\nThrough readings, videos, journal and essay writing, discussion\ngroups, and special projects, the students will not only come to\nlearn more about the deepest truths expressed within these\ntraditions, but be encouraged to respond in ways that express how\nthese fundamental truths align with their own experiences, beliefs,\nobservations, and values.\nThe text aligns with the Blackboard course ENG 250: World\nMythology by Andy Gurevich at Mt Hood Community College.\nIntroduction to the Course & Text | 2 Chapter One - What is\nMythology?\nANDY GUREVICH\nThis week, we will begin to explore what myth is, no easy question\nto answer, and also look at some of the ways humans have\ndeveloped and used their myths. We might discover as we go that\nthe stories and mythological images of our ancestors speak to us\ntoday in more relevant and meaningful ways than we thought\npossible.\nFirst we need to try to define\nmyth. One textbook offers a\nsimple definition at the\nbeginning of the introduction,\n“Myths symbolize human\nexperience and embody the\nspiritual values of a culture.”\n(Rosenberg xiii)\nThe problem with this\ndefinition is the phrase\n“symbolize human experience.”\nJust what does that\nmean? It is what myths do, but\nit doesn’t really give us much in\nthe way of definition.\nJoseph Campbell, another\n“Plaster sculpture of Apollo in medical\nsomewhat famous scholar and\nmask” by Alena Shekhovtcova, World\nmythologist who we’ll be using Mythology, Pexels is licensed under CC\nBY 4.0\noften this term, defined myth\nas follows,\n“A whole mythology is an organization of symbolic images and\n3 | What is Mythology? narratives, metaphorical of the possibilities of human experience and\nthe fulfillment of a given culture at a given time.”\n“Metaphorical of…” Hmm. What does that mean, exactly? Onward.\nPsychoanalyst Rollo May, in his book “The Cry for Myth” suggests,\n“A myth is a way of making sense in a senseless world. Myths are\nthe narrative patterns that give significance to our existence. Myths\nare like the beams in a house: not exposed to outside view, they are the\nstructure which holds the house together so people can live in it.”\nYou will soon see that although most scholars of mythology agree\nthat it is a foundational component of how any society, culture,\nand individual define themselves, none can agree absolutely on how\nto define it. But this isn’t really a problem. They may all be right,\ngiven the aspects of myth they are emphasizing in their different\ndefinitions.\nThat is why I encourage you to define myth for yourselves during\nyour readings and ponderings.\nFrom the many definitions of myth in books and on the web, we\ncan see that myths have four basic attributes in common:\n• They are cultural—they reflect the beliefs and values of a group\nof people.\n• They are sacred—they concern the spiritual or divine aspects\nof existence that human beings cannot understand.\n• They are didactic—they seek to explain the unexplainable, and\nthey teach humans how to behave, live, and relate to each\nother and the gods.\n• They are foundational—they provide basic rules, beliefs, and\nrituals for a culture to establish shared beliefs and practices.\nJoseph Campbell adds that all living myth must serve four primary\nfunctions:\n• Cosmological—Its cosmological function is to describe the\n“shape” of the cosmos, the universe, our total world, so that\nthe cosmos and all contained within it become vivid and alive\nWhat is Mythology? | 4 for us, infused with meaning and significance; every corner,\nevery rock, hill, stone, and flower has its place and its meaning\nin the cosmological scheme which the myth provides.\n• Mystical—Its metaphysical function is to awaken us to the\nmystery and wonder of creation, to open our minds and our\nsenses to an awareness of the mystical “ground of being.” Many\nwould say that this is the primary function of myth-to find a\nway to communicate whatever mystical insight has been\ngained on the journey: an understanding of the mysteries that\nunderlie the universe; an appreciation of its wonders; the\nsense of awe or rapture experienced. Since this experience\noften can’t be communicated directly, myth speaks in\nmetaphors, symbols, and symbolic narratives that aren’t\nalways bound by objective reality.\n• Sociological—Its sociological function is to pass down “the law,”\nthe moral and ethical codes for people of that culture to follow,\nand which help define that culture and its social structure.\n• Psychological—Its psychological (or pedagogical) function is to\nlead us through particular rites of passage that define the\nvarious significant stages of our lives-from dependency to\nmaturity to old age, and finally, to our deaths, the final\npassage. These rites of passage bring us into harmony with the\n“ground of being” (a term used by Campbell to refer to an\nunnamed, unspecified universal mystical power) and allow us\nto make the journey from one stage to another with a sense of\ncomfort and purpose.\nToday, in our culture, we often dismiss myth as a falsehood, or\nfanciful, untrue stories, like urban myths or “false news.”. This is\nnot the definition of myth we will concern ourselves with. For each\nof the myths we read, the culture from which they arose believed\nthem to be true and foundational to their individual and collective\nidentities. It was how they understood the great mysteries of the\nuniverse and our place in it—How did the earth come to be? How\n5 | What is Mythology? was mankind created? What is my purpose? Can I know god? Is\nthere a life after death?\nToday, we are still asking the same questions, and for many\npeople, the answers are in their religious beliefs, many of which\nhave their roots in the myths. Campbell once said, “a mythology\nis another person’s religion, and a religion is your own personal\nmythology.”\nThis first group of myths (Lessons 1 through 4) are Creation\nmyths. They seek to explain “how it all started.” There are 8 basic\nmotifs (a recurring pattern or object) for creation myths:\n1. Conjunction: mingling of waters or primal elements creates a\nfirst entity or a livable surface\n2. Divine emission: blood or other body fluids create man or\nbeings or other gods\n3. Sacrifice: a god sacrifices himself or is sacrificed to achieve\ncreation of the earth or humans\n4. Division/Consumption: marriage of earth and sky or\nseparation of earth and sky creates livable space for humans\n5. Cosmic egg: all humans, and the earth sometimes, are\ncontained in a great egg to be opened when the god wills it\n6. Emergence: first “people” emerge from an original cramped or\nhostile world into a new world or a series of worlds\n7. Deus Faber: the god consciously crafts the world and humans\nout of a substance necessary for the survival of mankind (like\nclay, mud, stone, corn)\n8. Ex Nihilo-out of nothing: creation by thought, breath, dream\nor word\nThese eight methods are creation are easy to see in the myths\nwe read. What might each method say to the people about their\nimportance to the gods? Think about this question as your read the\nmyths.\nAs you read, you will see that myths are narratives; they tell a\nstory. It is the culture’s way of trying to explain the creation of\nWhat is Mythology? | 6 the universe and mankind in a way everyone could understand.\nThese stories (myths) were passed down through generations orally\nbecause they existed long before humans created writing.\nWe don’t know for sure, but it is likely that the myths evolved\nover time as they were retold, perhaps to include new myths from\nother cultural groups, or to reflect man’s more sophisticated\nunderstanding of the world and the gods.\nOften these myths were retold in celebrations of a religious\nnature, such as a New Year celebration or the beginning of spring,\nor at the harvest.\nThe myths, although simple as narratives, are complex in trying\nto explain existence and the gods. In some cases, you will find\ncontradictions, missing pieces, and some just plain confusing ideas.\nRemember, these are myths, not fact-based explanations. We need\nto read them differently than we would a history or science book.\nBut when we know how to read them as intended, as metaphors for\nthe journey of the soul back to the ground of its own being, then\nthey can reveal timeless truth to us, whether we “believe” in them or\nnot.\nSo…A closer look: It’s about time!\n• Legend is defined as a traditional story that may be based on\nhistorical facts, but is not easily proven to be historical (like the\nlegend of King Arthur and the Knights of the Round Table).\n• Folklore is more like myth in that it is stories about traditional\nbeliefs, customs, and stories of a community passed down\nthrough word of mouth. This definition is very much like myth,\nbut as we will see, there is one attribute of myth that may be\nmissing from folklore.\nIn the Indian (Hindu) creation myth, time is presented as cyclical—a\nconstant repetition of creation, destruction and rebirth. The Mayan\nculture also saw time as cyclical as presented in their\ncalendars. Most Western religions have from their beginning seen\ntime as linear, having a clear, set beginning (On the first day, God\n7 | What is Mythology? created…) and a clear, set ending. When our world ends, there is no\nindication that there will be a regeneration or re-creation as there\nis the Hindu myth.\nYet, everything about our world indicates that time is cyclical—the\ntrack of the sun and moon through the sky, the passing of the\nseasons, the celebration of recurring events like Thanksgiving and\nour birthdays, even our clocks are round.\nTime is one of those puzzling questions that underlies many of the\ngreat questions of mankind. We are obsessed with time, and much\nof our language is devoted to time—we try to save time (a bizarre\nnotion); we spend time; we think time is money; we take time; we\nwaste time. We even upset our lives twice a year by setting clocks\nahead and back.\nScientists and philosophers tell us time is an illusion, it isn’t real,\nand we can’t measure it. Why then does it seem so real to us? We\ncan’t function without schedules, or knowing what time it is.\nSo, think about this: how might believing in time as linear or\ncyclical influence a culture’s attitude toward death or how we live\nour lives in the present time? What if we do come back for another\ntry? What if X marks the spot and when we get there, there is no\nhope to return to life as we know it?\nNow you are ready to read the myths (Please do not panic. Many\nof these are quite short and you can use open book and open notes\nto do your assignments.):\n• The History & Functions of Myth\n• The Enuma Elish: Historical Context\n◦ The Babylonian Creation Epic: The Enuma Elish\n◦ Click here for another version of the myth.\n• The Mayan Creation: Introduction and Historical Context\n◦ The Creation (Mayan)\n◦ Click here for a video version.\n• The Chinese Creation: Introduction and Historical Context\nWhat is Mythology? | 8 ◦ The Creation Myths:\n▪ Pan Gu\n▪ Nu Kua (or Nu Wa)\n▪ Yin and Yang\n▪ Click here for an alternate version of all three.\n• The Indian Creation: Introduction and Historical Context\n◦ The Hindu Creation Myths\n◦ Alternative video versions of the Hindu Creation:\n▪ Hindu Creation Stories\n▪ The Hindu Creation Myth\n▪ Hindu Mythology Creation Story\n9 | What is Mythology? Chapter Two - Myth &\nMetaphor\nANDY GUREVICH\nThe Greeks believed human thought functioned through two\nseparate avenues, Logos and Mythos.\nLogos is the analytical, logical\nmethod for dealing with the\ninformation and complexity of\nthe world. It is governed by\n“rules” such as we still use in\narguments and more formal\nlogical exercises.\nThen there is Mythos which\nfollows our basic definition of\nmyth: a collection of stories and\nbeliefs held in common by a\ngroup of people. Unlike Logos,\nMythos deals with non-logical,\nnon-concrete, non-linear\naspects of the world and our\npsyches. There are not rules\n“Stone mythical creature statue in\ngoverning how we interpret\njungle” by Nick Bondarev, World\nmyths as they often deal with Mythology, pexels is licensed under CC\nBY 4.0\nthose things outside the realm\nof human consciousness and\nunderstanding.\nThe way that we can attempt to explain the unexplainable, those\nthings beyond the world of Logos, is through metaphor. It takes\na little work to wrap our heads around this concept, but it is\nimportant in helping us understand how to interpret the meaning\nof the myths. This idea of metaphor is not without controversy; it\nMyth & Metaphor | 10 encourages us to view myths (and religion) in a different way. I ask\nyou to read and consider before you judge.\nLet’s start with a simple definition of metaphor: it is a comparison\nbetween two different things without using the words “like” or\n“as.” Simple, right? Maybe not so simple. Here is a comparison\nusing like or as:\nMy love is like a red, red rose.\nThis clearly states a comparison, but let’s look at it as a metaphor:\nMy love is a red, red rose.\nMakes a difference, doesn’t it? What the metaphor does is invite\nus to take the statement literally; we sometimes miss the idea of a\ncomparison.\nLet’s look at another metaphor:\nHe is such a snake in the grass.\nThis we know not to take literally. The metaphor suggests a\ncomparison between the person and the qualities or attributes we\nassociate with snakes (evil, dangerous, slimy). Furthermore, we\nknow that not all snakes are dangerous, and they are evil only\nbecause we are using the snake as a metaphor. The snake’s\nassociation with evil is cultural. (More about snakes in the future.)\nSo our metaphor—he is a snake—invites us to attach various ideas\nabout the man through associating him with ideas we have about\nsnakes, whether they are accurate or not.\nWe use metaphors every day to describe our feelings (I’m feeling\nblue) our troubles (My life is a train wreck) our happiness (I’m on\ncloud 9). Our dream are metaphors (dreams of flying, being chased,\ndemons). We too often take our metaphors literally.\nMyths are metaphors. The whole myth is a method of trying to\nconvey things we don’t understand in a way that we can begin to\nunderstand. How must it have felt, before science and technology,\nto look up at the night sky and try to explain all those points of\n11 | Myth & Metaphor light? Or how do you explain the phases of the moon and its\ndisappearance for three days? Even with a “scientific\nunderstanding” of the world, myths help us to create narrative\ncontainers for the awe we feel at the very mystery of existence itself.\nAnd metaphors are the primary vehicles of myths.\nThe use of metaphor helped ancient cultures understand. They\ncreated pictures with the brightest stars and named them after\ntheir gods. The moon became the goddess, dying and being reborn,\njust like the crops in the spring. The metaphors tied humans to the\nearth and the gods; they were both a part of creation, and separate\nfrom the gods.\nHave a look at a illuminating encounter the late mythologist\nJoseph Campbell had with a radio host about the concept of\nmetaphor by clicking here.\nSo, to sum up the main points:\n• Metaphors suggest\ncomparisons, although\nthey don’t explicitly state a\ncomparison.\n• Myths are metaphors.\n• Metaphors can often\nreveal truths that are\ndeeper and more lasting,\nbut harder to unpack.\n• We cannot take the\nmetaphor (or the myth)\nliterally and expect to\nunderstand its full\nsymbolic value.\nNow you are ready to read the “Crozier Head (ca. 1350)” by Gift of J.\nmyths: Pierpont Morgan, 1917, The Met\nMuseum is licensed under CC BY 4.0\n• History of Greek Myth\nMyth & Metaphor | 12 ◦ The Creation of the Titans and the Gods, Greece\n• History of Norse Myth\n◦ The Creation, Death and Rebirth of the Universe, N.\nEurope\n• History of Yoruba Myth\n◦ The Creation of the Universe and Ife\n• History of Aztec Myth\n◦ The Creation Cycle\n• History of Iroquois Myth\n◦ The Woman Who Feel from the Sky, Iroquois\n13 | Myth & Metaphor Chapter Three - Myth &\nArchetype\nANDY GUREVICH\nBy now, you have most likely noticed that there are common ideas,\nthemes or objects that recur in some of these myths. Take the flood,\nfor example. If you look at myths from across the globe, almost all of\nthem have a flood story of some sort. How can we explain this?\nOne way is that these myths\ncontain a historical account of a\ngreat flood. We know there was\na huge flood in the area of the\neastern Mediterranean Sea into\nthe Black Sea. Depending on\nthe source, it happened\nanywhere from 11,000 BC to\n3,000 BC. It is possible as the\nlast great ice age ended, it did\ninundate this area. Check out\nthis Historical Evidence for the\nGreat Flood.\nBut areas that are far inland, “The Deluge (ca. 1630–38)” by Pierre\nBrebiette, The Met Museum is licensed\nhigh in elevation and otherwise\nunder CC BY 4.0\nnot likely to be flooded have\nthese deluge stories too. How can historical fact explain this?\nArcheologists are fairly certain that the entire globe was not under\nwater.\nAnother explanation may be that through trade routes or\nconquest, these stories were shared with new populations who\nfound them so compelling they incorporated these myths into their\nown. Again the same problem presents itself: —were there trade\nroutes between, say, Greece and Argentina or the southwestern\nMyth and Archetype | 14 United States. It is unlikely. Remember these early societies did not\nhave Facebook or Twitter; in fact, they were unaware the rest of the\nglobe even existed.\nOne explanation that fits nicely, although there is no real proof\nin the scientific sense, is the idea of archetypes and the collective\nunconscious. These ideas were put forth by the 20th century\npsychiatrist, Carl Gustav Jung. His ideas are highly speculative, but\nthey do offer an avenue for studying these recurrent ideas we see in\nmyth.\nBasically, what Jung said is that there exists in every human’s\nmind the collective unconscious. This is the area of our psyche\nwhere dreams and myths are stored. They contain themes and ideas\nthat humans have had in common since the beginning of human\nexistence. We can see these ideas and themes in the myths: —the\nflood, the creation of man from clay (or other substance that is\ncritical to sustain life), symbols like the world tree, or the world\negg. These common symbols, themes and patterns are called\narchetypes. To clear up the difference:\n• A symbol is an object that stands for something else or calls\nthat something else to mind. A symbol is cultural, shared by a\ngroup of people. We do not naturally understand what a\nsymbol means; we must learn its meaning. The alphabet and\nlanguage are symbols. The logos of companies are symbols.\nLike the Nike swoosh, we need to learn to associate the symbol\nto what it is referring to (its referent).\n• An archetype is a symbol that is not tied to one culture. It is\nshared by all cultures, across time. We can readily see, and\nrespond to, archetypes we see in movies: —the villain, the hero,\nthe wise old man (The Lord of the Ringstrilogy is a good film to\nsee archetypes). Archetypes can also be objects-the circle, the\nmandala. They can be themes-the hero’s journey, travel to the\nunderworld, fighting dragons (or some such creatures). The\nthing that distinguishes archetype from symbol is that all\nhumans respond and understand the archetypes in similar\n15 | Myth and Archetype ways.\nIf we think back to myth and metaphor, it may be easier to\nunderstand the idea of the collective unconscious and archetype.\nOur myth and dreams are metaphors and they use the archetypes\nto manifest themselves to us. That accounts for the similarity of the\nideas and symbols in myths and our dreams. So as an explanation for\nthe existence of myth across the globe as well as the commonality\nof the ideas and symbols in myth, this explanation serves a purpose.\nIt’’s an interesting look at the\nconsciousness of mankind. We\nare really linked in our myths\nand dreams. Carl Jung says\nthese symbols are never clearly\ndefined or fully explained, as\nthey are part of the\nunconscious. We can “learn”\nthe meaning of archetypes, but\nthey become understandable\nonly on an individual basis.\nAgain, Jung says that\narchetypes are, at the same\ntime, image and emotion. When\nthere is merely the image, then\nthere is a word-picture with\n“Old carved metal lion head sculpture”\nlittle consequence, but when\nby Plato Terentev Follow Message,\ncharged with emotion, it World Mythology is licensed under CC\nBY 4.0\nbecomes dynamic.\nI think of the Goya picture of\nCronus devouring his children. It is both an image that is symbolic,\nbut also arouses deep emotional responses. Think also of those\nimages we relate to evil, like snakes. Many people are afraid of\nsnakes, spiders, bats…things we fear and associate in ways with evil\nand danger. That’’s how an archetype works. We unconsciously\nassociate the image and emotion and respond.\nMyth and Archetype | 16 (For more information on archetypes and the collective\nunconscious, see Man and His Symbols edited by Carl G Jung.\nMaterial on Jung is from this book.)\nThe myths for this week:\n• History of Navajo Myth\n◦ The Emergence, (Navajo)\n• History of Norse Myth\n◦ The Creation, Death and Rebirth of the Universe, (Norse)\n• History of Aztec Myth\n◦ The Creation Cycle, (Aztec)\n• History of Maori Myth\n◦ The Creation Cycle (Polynesia/Maori)\n17 | Myth and Archetype Chapter Four - Myth &\nMeaning\nThe collaborative construction of mythological\nmeaning.\nANDY GUREVICH\nGenesis is apart from other myths in that it has one god only; he\nis all-powerful and all-knowing, and doesn’t seem to have the usual\nhuman-like failings of gods from other myths.\nIn a monotheistic belief system, God is generally removed from\nthe people and is perceived as the creator who grants us life but\ndemands pretty strict obedience.\nIf we proceed with the idea\nthat myth is metaphor, let start\nwith “on the first day”—is this\nliterally a day as we experience\nit? Since we can’t really know\nGod, how can we know what a\n“god-day” is? So, is it literal or\nmetaphor?\nAfter God creates the world, “Close-Up Photo of Bible” by Brett\nJordan, World Mythology is licensed\nanimal and plants, he creates\nunder CC BY 4.0\nAdam and Eve. There are two\ndifferent accounts of the creation of Adam and Eve in Genesis:\n• The first, Chapter 1, lines 26 and 27, has God creating both\nAdam and Eve in his own image.\n• Then in Chapter 2, lines 7 and 21-23, we get the more familiar\nstory of Adam being created from the earth and Eve being\ncreated from one of Adam’s ribs. This picture of God giving life\nChapter Four - Myth & Meaning | 18 to Adam is part of the ceiling of the Sistine Chapel in Vatican\nCity. It is a Renaissance metaphor for creation. (You can see\nmore images of the ceiling on line.)\nBible scholars agree that there were two authors of Genesis,\nreferred to as J-E and P:\n• J-E used the name Elohim (lords) and referred to god as\nYahweh.\n• The P version is believed to have been compiled for use by the\npriestly class.\nThe stories merged somewhere around the 6th to 7th centuries BC:\n• The older version calls to mind many of the creation myths we\nhave read so far.\n• The second version of the creation of Eve from Adam’s rib is\nunique. Do we take these literally? I think an important\nquestion to ask is why such a reversal here? A woman is born\nfrom man! (That’s the metaphor).\nThe next big metaphor is the temptation by the serpent and the loss\nof the Garden of Eden for Adam and Eve.\nOur archetypal serpent plays an interesting role here. The\nserpent symbolizes many things, from evil (probably best elaborated\nin Genesis) to rebirth (it sheds its skin).\nKeeping this complex symbol in mind, what does the snake\nactually accomplish? It tempts Eve to eat the fruit from “the tree\nof the knowledge of good and evil,” despite God’s warning that if\nthey ate of this tree (which is in the center of the garden) they\nwould “surely die.” If this is so, why does Eve eat it and tempt\nAdam? Notice it didn’t take much to get Adam to go along with this.\nIn the picture below, we can see the metaphor clearly. Notice that\nAdam and Eve here have covered themselves before they have eaten\nof the fruit. Genesis clearly tells us that they ate, then they became\n19 | Chapter Four - Myth & Meaning ashamed of their nakedness, and then covered themselves. This\npicture shows the force of the metaphor on the human imagination.\nThis tree is a great\nmetaphor. Did Adam and Eve\nhave no knowledge of good and\nevil before they ate? Let’s go\nbeyond the metaphor—what\ndoes it mean to have no\nknowledge of good and\nevil? This is an important idea\nto think about. By eating the\nfruit, they became ashamed of\ntheir nakedness (another\nmetaphor) and they hid from\nGod. But God knows all, so, of\ncourse, they disobeyed and\n“Adam and Eve (1504)” by Albrecht\nDürer, The Met Museum is licensed were served punishment and\nunder CC BY 4.0\nkicked out of the garden. If god\nis all-knowing, did he know\nthey would disobey?\nThere is a theme in myth of the one forbidden thing—Pandora’s\nbox is a good example. It is human nature to be told not to do\nsomething yet feel compelled to do it. Have you ever done\nsomething forbidden? Don’t we feel a complex of guilt and\nexhilaration that we did it, even though we knew we shouldn’t?\nThe unspoken lesson we take from this is don’t disobey god, but it\nalso explains why life is so hard. The punishment accounts for the\nsubmission of women to men and the hard work we have to do just\nto be alive.\nBut it also casts a new light on innocence (no knowledge of good\nand evil) and awareness of it. Why is knowledge of good and evil\nsuch a bad thing? Does it make us god-like in some way? If you\nremember from the Mayan myth, the gods clouded the vision and\nreduced the wisdom of their “perfect” creations. What does god say\nto Adam and Eve when he discovered their disobedience?\nChapter Four - Myth & Meaning | 20 This myth, more than telling a story, causes us to ponder very\nbig ideas—the role of knowledge of good and evil—does that make\nus god-like? It certainly suggests that the fall from the Garden was\na loss of a golden or perfect age, maybe like the first yuga in the\nHindu cycle. God also makes sure Adam and Eve couldn’t re-enter\nthe garden. What reason does he give? Think about this on top of\neverything else!\nThis myth informs millions of people about their nature, our\nrelationship to god, our relationship to each other and the world we\nlive in. If we go beyond the metaphors, we can see the degree to\nwhich this myth has meaning for the way we live our lives.\nWe can do this with all the myths; it’s easier to see with Genesis\nbecause many of us are familiar with it. For an online copy of the\nKing James version of Genesis, go to: Genesis-Chapters 1, 2, and 3.\nWanadi\nNow to Wanadi. This myth is unique in a few ways. If you read\nthe introduction in the book, you know that the Yekuhana were\nso isolated that they were never conquered or Christianized. This\nmakes the myth clean of outside influence.\nThe myth in some ways reflects some Christian beliefs, the idea\nof a last judgment, the duality of good and evil, to name a few. But\nit has a quite unique view of reality.\n21 | Chapter Four - Myth & Meaning Briefly, this myth is pretty\nclear cut—it explains the\nexistence of evil, how living\nbeings were created (Was\nWanadi smoking just\ntobacco?) It outlines how man\nshould live his life and what\nhappens at death. It does pose\nan interesting view of what is\nreal.\nBut what Wanadi does is\nanswer questions. Genesis, on\nthe other hand, perhaps raises\nmore questions than gives\nanswers. Myth will often do this\nas well. Forcing us to dig deeper\n“Blue Yellow and Red Abstract\ninto it, and into ourselves, to\nPainting” by Mikhail Nilov, World\nuncover its more precious and Mythology is licensed under CC BY 4.0\nlasting meaning and relevance.\nReadings:\n• The opening chapters of Genesis (also linked above)\n◦ Genesis-Chapters 1, 2, and 3\n• History of Greek Myth\n• History of The Ages of Man\n◦ The Ages of Man, Greece\n• History of Venezuelan Myth\n◦ Wanadi, The Creator, Venezuela\nChapter Four - Myth & Meaning | 22 Chapter Five - Myth & Ritual\nANDY GUREVICH\nThese fertility myths are metaphoric and archetypal. They involve\nsome kind of journey into the underworld where the goddess\nsymbolically dies.\nHer death causes the\ndesolation of the earth—crops\nshrivel, animals die, water\ndisappears—and humans grow\nweaker. In time, all will die and\nthere will be no one to praise\nthe gods. These goddesses are\ntied to nature-they are the\ngoddess of the earth, the crops,\nand all living things. Salvation\nof the earth occurs when the\ngoddess somehow manages to\nreturn to the earth.\nBut a deal must be made;\neither the goddess or a\nrepresentative must return to\n“Woman in Yellow Dress Standing on\nthe underworld for a season.\nBrown Sand Under Blue Sky” by Engin\nThis explains winter, the Akyurt, World Mythology is licensed\nunder CC BY 4.0\nseason of no growing plants,\nand it explains the cycle of the\nseasons—spring is the return of the earth goddess; summer she\nproduces the abundance of the earth; fall celebrates the harvest and\nthe preparations for the goddess’s return to the underworld.\nThese myths seek to explain the mystery of life and death and the\nafterlife.\nThese myths are also known as fertility or vegetation myths. The\ngods are called “chthonic” pronounced “tonic.” The term means\n23 | Myth & Mystery subterranean, or below the earth, so you can see their association\nwith growing plants.\nBut these myths evolved into a much deeper, much more complex\nmeaning that goes beyond the fertility of the land. These goddesses\nrepresent life itself. If the goddess can return from death, is there\nhope for us?\nThe cycle of human life mirrors the cycle of the seasons-spring is\nour birth, summer, our growth to adulthood, fall our productive life\nwhen we bring forth new life, and winter, our old age when we still\nnurture, but will soon die. If the plants can be reborn in the spring,\ncan we? These myths tell us that there is a life after our physical\ndeath. It is one of the great mysteries of our existence.\nAs rituals grew around the worship of these goddesses, they\nbecame more formal and became cults, not in our modern sense\nof cult. The most wide-spread cult was that of Isis. Originating in\nEgypt, it spread to Greece, Italy, and beyond. It persisted until the\n4th century CE. The early Roman Catholic Church had an extremely\ndifficult time suppressing it.\nMyth & Mystery | 24 The next important cult was\nthat of Demeter, in\nGreece. Historians from the\nearliest times knew little about\nthis cult. There was an\nelaborate initiation ritual and\ncertain requirements to\njoin. Initiates had to be Greek-\nspeakers, slaves could join at\nthe consent of their\nmasters. Every spring, initiates\nwalked from Athens to Eleusis,\nthe location of the shrine of\nDemeter.\nThe march was to honor\nDemeter’s search for\n“Terracotta statuette of a draped Persephone after she was\ngoddess (late 5th–4th century B.C.)” by\nabducted to the underworld by\nacquired in 2000, gift of Robin Symes,\nThe Met Museum is licensed under CC Poseidon. Initiates fasted,\nBY 4.0\ndrinking only kykeon, a mixture\nof barley, water and\nhoney. Once the initiates reached Eleusis, they sacrificed a pig,\ncleansed themselves in the waters, and prepared to be admitted to\nthe cult. Once in the temple, the ceremony included specific rites\nperformed.\nThe important thing about these rites was that they were\nsecret. Once initiated into the cult, members were forbidden, under\npenalty of death, to speak about the rites.\nOver time, scholars were able to piece together what we know\nabout the cults today. As we can see from Homer’s hymns to\nDemeter, part of the mystery involved a type of symbolic rebirth,\ngiving a hope of life after death. Persephone, representing spring,\nis abducted by Hades, god of the Underworld. He intends to marry\nher (how’s that for a metaphor!) Demeter searches in vain for her\n25 | Myth & Mystery daughter. In her grief, the land is rendered barren, and nothing can\ngrow.\nAfter Demeter’s futile search, she finally bargains with Zeus for\nPersephone’s return. But Persephone has already eaten a single\nseed of the pomegranate; she has eaten the food of the dead. So,\nshe is allowed to return for the spring, summer and fall, the fertile\nseasons, but must return to Hades for the winter.\nCheck the following link to read about the rites of Demeter at\nEleusis: Eleusinian Mysteries\nOsiris, Isis, and Horus\nFor ritual and the message of\nlife after death, the myth of\nOsiris, Isis and Horus clearly\nshows the impact myths can\nhave on a society. From the\nmyth arose the complex burial\npractices of Egypt. The\nEgyptian Book of the Dead\noutlines the processes, the\nprayers, and the confessions\none must perform in order to\nmake the journey to the\nafterlife.\nIsis became a cult figure for\nseveral reasons: she did bring “Triad of Osiris, Isis, and Horus\n(664–30 B.C.)” by Purchased from Stora\nOsiris back to life for the\nArt Galleries, New York, 1942, The Met\npurpose of becoming Museum is licensed under CC BY 4.0.\nimpregnated with Horus. Here,\nthe myth closely ties life and death—from death comes life.\nAs your read the myth in our text, you will see that there is a\nclose tie between death and sex; Isis fans life into Osiris and he lives\nMyth & Mystery | 26 long enough to impregnate Isis with Horus. The cycle is complete,\nand the generations will go on. So, the message is, life comes from\ndeath. (For many centuries, people thought that every orgasm was\nlike a little death: the French call it “la petite mort” literally the little\ndeath.)\nMost religions address the issue of an afterlife in a very similar\nway to the Greek and Egyptian. Our funeral rites are a direct\nevolution of the Egyptian Book of the Dead. Why would we want\nto preserve a body for as long as possible? But more than that, our\nreligions have us look to a movement to a life different than that on\nearth, but a life nonetheless, often with rewards and comfort we do\nnot get in our earthly lives.\nIt’s a great metaphor for the rebirth of the soul into the\nafterlife. Isis is also the goddess of crops and other growing\nthings. She is fertility. Isis is mother, the giver and sustainer of\nlife. Osiris takes on the role of final judge in the soul’s journey to\nimmortality. It is he who oversees the weighing of the heart, hears\nthe confession, and welcomes the soul into the afterlife.\n27 | Myth & Mystery Sedna\nHow can a culture so far\nremoved from the fertility of\nthe Nile and Greece have such a\nsimilar myth? The Inuit do not\ngrow any crops, yet Sedna\nrepresents fertility. Life comes\nfrom her very body.\nUnlike the other myths,\nSedna does not return in the\nspring, but stays beneath the\nseas. In place of winter, the fish\nand sea mammals are held back\nfrom the hunters when Sedna is\n“Topless Woman With Yellow and angered because her hair is\nOrange Floral Headdress” by\ntangled. But notice the shaman\nJEFERSON GOMES, World Mythology\nis licensed under CC BY 4.0 must go down into the sea (the\nparallel of the underworld) to\nappease her and comb her hair so she will return the bounty of the\nseas to the people.\nThe same metaphors are here as in the other myths. Perhaps\nmore so than the creation myths, these myths show the archetypal\npattern of the descent into the underworld, and the return of the\ngod or goddess with hope for life after death.\nOther myths with this same basic archetype are Dionysius,\nOrpheus, Attis, Adonis, and Innana from Sumer/Babylon. You may\nwant to read them, and they are easily found on the internet.\nReadings:\n• History of Egyptian Myth\nMyth & Mystery | 28 ◦ Osiris, Isis and Horus, Egypt\n• History of Greek Myth\n• History of Demeter Myth\n◦ Demeter and Persephone, Greece\n• History of Japanese Myth\n◦ Amaterasu, Japan\n• History of Inuit Myth\n◦ Sedna, Inuit\n29 | Myth & Mystery Chapter Six - Myth & The\nHero\nANDY GUREVICH\nThis week, we will be exploring the role of the hero in mythic\ncontexts. Not all heroes look or act alike, and it will be important to\nexplore the many ways we look to each other for help, rescue, and\nsalvation.\nWe will begin at the\nbeginning, and explore the very\nfirst hero story ever written. Or\nat least, the earliest surviving\nexample of one. Gilgamesh is a\ngreat story; it has all the\nmakings of a typical hero myth.\nJoseph Campbell briefly\noutlines the hero quest:\n• The call to the quest–the\nhero consciously seeks the\nquest. In Gilgamesh, he\nseeks immortality. In\nanother variation, the\nquest is thrust upon the\n“Woman in Black Blazer Sitting on\nhero—he or she may\nWheelchair” by cottonbro, World\nwander into a woods or Mythology is licensed under CC BY 4.0\narea that is magical or\nstrange and dangerous and have to navigate the dangers to\nreturn.\n• The going out–the hero ventures out on the quest. There\noften are “helpers” along the way. Gilgamesh, in his first quest\nto kill Humbaba, has the help of Enkidu and other men, and the\nMyth &The Hero | 30 god Samash.\n• Fulfillment of the quest–after a series of tests or challenges,\nthe hero completes the quest.\n• Return–the hero return with a great gift or boon for his\npeople. It may be a physical item like gold or a magical object,\nor it may be some great knowledge that will aid his people.\n(Moses is a great example—his return with the Ten\nCommandments set up the principles for a new society.)\n• The hero undergoes tests that change him, usually for the\ngood. We can see the pattern in the lives of Buddha,\nMohammed, and Jesus.\nHere is a chart of the hero’s journey based on the works of Joseph\nCampbell:\n31 | Myth &The Hero “The Hero’s Journey” by scan from an Unknown authorUnknown\nauthorpublication by an / anonymous poster, in a thread, gave permission to\nuse it. Re- Vectorization: Slashme, Public domain, via Wikimedia Commons,\nWorld Mythology is licensed under CC BY 4.0\nMyth &The Hero | 32 Reading:\n“”Gilgamesh\nThe King””\nby Jim Burns,\nThe British\nMuseum is\nlicensed\nunder CC BY\n4.0\n• Please read:\n◦ The Epic of Gilgamesh History & Culture\n◦ The Epic of Gilgamesh History & Culture (Downloadable\nversion)\n◦ The Epic of Gilgamesh\n◦ The Epic of Gilgamesh (Downloadable version)\n• Please watch:\n◦ The Epic of Gilgamesh\nI hope you enjoy it! Things to look for as you read:\n• The early character of Gilgamesh—does he change in the end?\n• The symbolic role of Enkidu—what does he represent in the\nstory?\n• The two quests—what is each one’s purpose and are they\nfulfilled?\n33 | Myth &The Hero • The second quest is nicely done up in archetypes. What are\nsome of the archetypes?\n• Is Gilgamesh a hero a modern audience can relate to? (Check\nout Wikipedia: Gilgamesh in Popular Culture.)\nThe story was one of the first\nwritten narratives, written in\nCuneiform, a series of wedges\npressed into wet\nclay. Unfortunately, these clay\ntablets break easily. There\nwere also different versions;\nstories of Gilgamesh were\nfound scattered throughout the\nregion of what is now modern\n“Cuneiform tablet: fragment of the\nWeidner God List (ca. late 1st Iran, Iraq, and Turkey.\nmillennium B.C.)” by Acquired by the\nScholars have pieced\nMuseum in 1886, purchased from the\nReverend William Hayes Ward., The together the story as best they\nMet Museum is licensed under CC BY can, although we still have\n4.0\nquestions about certain\nevents. For example, when Gilgamesh goes to find Urshanabi to\ntake him across the Waters of Death, Gilgamesh smashes the sacred\nstatues. We don’t know what their purpose was or why Gilgamesh\nsmashed them.\nGilgamesh goes on two journeys. His first is a physical quest-to\nkill Humbaba and bring cedar back to Uruk. He succeeds at both.\nHis second quest is a spiritual or intellectual quest. He seeks\nimmortality after the loss of his friend Enkidu.\nLook at the two challenges he faces: he must go through the\n36 mile tunnel, suggesting death. When he exits the tunnel, he is\nin an orchard with trees which bore jewels. He was convinced he\nwas in the garden of the gods. Then he must cross the Waters\nof Death. He meets with Utanapishtim, but is told he cannot have\nimmortality.\nSo Gilgamesh fails to gain immortality. He is given a consolation\nMyth &The Hero | 34 prize of sorts. If he can dive deep into the waters (what’s the\nsymbolism here?) he can gather a plant which will endow him with\neverlasting youth. He loses his plant to a snake (more symbolism),\nwho immediately sheds its skin. Gilgamesh has failed in his\njourney. Or has he? What does Gilgamesh gain? What does he take\nback to his people? Does the experience change him?\n35 | Myth &The Hero Chapter Seven - Myth & The\nAnti-Hero\nANDY GUREVICH\nThe story of Jason and the\nArgonauts is among the most\npopular of hero myths. It has\nadventure, danger, the\nintervention of the gods, the\ngreat prize—the fabled Golden\nFleece. But, as you will see as\nyou read Jason and the\n“Peleus and Talamon, from the series\n‘Vessels of the Argonauts,’ for the Argonauts and Medea, there is a\nwedding celebration of Cosimo de’\ndarker side to this hero. This\nMedici in Florence, 1608” by Remigio\nCantagallina , The Met Museum is version, written in the\nlicensed under CC BY 4.0 3rd century BC by Apollonius, is\nthe earliest, most complete\nversion of the myth. It is edited in our book. The original is a much\nlonger story.\nWhat is interesting here is to see how Jason changes throughout\nthe story. Change is a characteristic of the hero, but how he or she\nchanges is important as well. Jason’s change is caused by a flaw\nin his character, what the Greeks referred to as hubris—pride. Pay\nattention as well to Medea. The author, Apollonius, was quite\nsophisticated in her character development and insight into her\nthought processes.\nWe also get a good insight into the relationship between the gods\nand Jason and Medea. One thing to think about as you read this is,\ndo Jason and Medea really have a choice in what happens?\nAs you read, you will notice the repetition of phrases that can be\nannoying to modern readers. The repetition comes from the oral\nMyth & The Anti-Hero | 36 tradition. The phrases are like aids to the oral storyteller, kind of\nlike the refrain of a song. Try not to let them distract you.\nAn anti-hero is a protagonist who lacks the characteristics we\ntypically associate with a hero—nobility of mind and spirit, humility,\ncompassion, things like that. Modern audiences don’t expect our\nheroes to be perfect; that would make them pretty predictable and\nboring. But there should be limits on how imperfect a hero can\nbe before he turns into a villain. Jason perhaps walks the line. You\ndecide.\nI have given you a brief chapter by chapter overview. I ask a\nlot of questions in the sections. I do not expect you to answer\nthem. They are just things to look for as you read, and maybe think\nabout as you answer the questions.\nChapter 1\nJason does start out with good intentions. He is to avenge the\ntheft of the kingdom of Iolcus from his father, Aeson. The bad guy\nis his uncle, Pelias. Jason seems a little short-sighted early on. He\nseems to set himself up to find the Golden Fleece, a dangerous\nand long trip to a faraway kingdom whose ruler has a very\nscary reputation. In fact, Pelias is convinced that Jason will never\nreturn. Jason sets off with the Argonauts, one of whom was Pelias’s\nonly son.\nIt is important to note the role that Hera plays in the story. What\nare her reasons for getting so involved? What is her plan? How\ndoes this affect the way you evaluate the actions of Jason and\nMedea?\n37 | Myth & The Anti-Hero Chapter 2\nThere are a lot of messages and hidden warnings for Jason\nfrom Phineus. Do you feel he helps Jason? What is the cause\nof Phineus’s fate? What lessons does his life have for people? In\nthis chapter we are introduced to Medea. How is she\npresented? What’s your first impression of her? How is Hera using\nher?\nChapter 3\nJason finally gets to Colchis, land of the Golden Fleece. On a quest,\nthere are tests or adventures one must perform in order to move\nforward. What is the task here and what does is show that Jason\nmust have? On page 182, Jason says “Why should my heart flood\nwith fear? Heroes and cowards alike share the same fate.” What\ndoes this say about his role as hero? Do you agree with this\nstatement? Jason also realizes he cannot perform the task set out\nby Aeetes, so he realizes that Medea can be a great help. “I will even\nrely on a woman!” he states. (I’m already not liking him.) Medea goes\nthrough mental turmoil. What are her concerns? What position is\nshe in?\nChapter 4\nAfter a long internal struggle, Medea decides to help Jason. She has\nthe powerful herbs that will make him invincible and meets with\nhim. She gives him the herbs and tells him exactly what he must\ndo to complete the tasks. She promises she will help him get the\nGolden Fleece from the serpent who guards it. She is totally in love\nwith him at this time, which plays into Hera’s plan nicely. Jason is\nMyth & The Anti-Hero | 38 warming up to Medea, promising her to be remembered and have\nher name known.\nThere is also a very strange ritual she performs that is a great\narchetype of rebirth. (This will be important when we read Medea\nnext week.) She kills him, makes Jason stew, and brings him back to\nlife, strong, renewed and ready for the challenge. Jason pledges his\nundying, everlasting love to Medea in an over the top way (see page\n191). As they plan to flee after getting the fleece, Jason insists they\ntake Medea’s little brother with them, as an insurance policy, and\nthis will become important at the end of the myth.\nChapter 5\nOf course Jason is successful in plowing the field taming the bulls\nand defeating the warriors. Aeetes is pretty smart and realizes the\nJason must have had help to succeed, and the only person capable\nof this kind of help is Medea. She is now a traitor. Aeetes decides\nthat Jason has not earned the fleece. He plots to kill not just Medea,\nbut Jason and all the Argonauts.\nChapter 6\nJason, with a lot of help from Medea, acquires the Golden\nFleece. They prepare to flee, taking the fleece and Medea’s little\nbrother, Apsyrtus. On page 197, Medea reminds Jason of all she has\ndone for him and begs him to save her from her father’s anger, and\nto take her away and not hold her in contempt. Do you find this\nodd? Do you think she realizes Jason may not be as he seems? He\npromises to take her to his home and marry her, and love her until\ndeath. They all safely escape Aeetes.\n39 | Myth & The Anti-Hero What are Jason’s first words after he gets the fleece? Does he\nchange as a result of having the fleece?\nReadings:\n• Jason and the Golden Fleece (Historical Background)\n• Jason and the Golden Fleece, Greece [This is a longer one!]\nMostly for next week, but it will help to dive in to this as soon as you\ncan as well:\n• Medea (Historical Background)\n• Medea, Greece [This is a longer one!]\nMyth & The Anti-Hero | 40 Chapter Eight - Myth &\nRevenge\nANDY GUREVICH\nIn addition to some pretty horrific events that take place in Medea,\nthe way the characters of Jason and Medea degenerate is pretty\nprofound. It has all the making of a Greek Tragedy.\nAristotle set out the characteristics and requirements for tragedy\nin The Poetics. The intention of a tragedy is to bring about a feeling\nof pity and fear in the audience which leads to the purging of\npowerful emotions.\nA good tragedy causes us to place ourselves in the place of the\ntragic hero, and evaluate the reasons for his downfall. The hero is\nusually someone above the ordinary man—he is a part god, or super\nhero. His position and his fall remind us that no one is exempt from\nthose great flaws in character that cause a downfall.\nFor the Greeks one of the great character flaws is pride,\noverbearing pride, hubris, the Greeks called it. It is a pride that\ncauses the hero to think he is like the gods.\n41 | Myth & Revenge Does Jason fill this bill? If you\nremember Jason’s first words\nonce the Golden Fleece was in\nhis hands was “What a great\nprize I have won!” In fact, he\ndid very little to gain the\nfleece. He quickly forgets\nabout all Medea has done. She\nhas to remind him, and he\nrealizes he still needs her help\nto escape from Colchis and\nAeetes.\nChapter 1\n“Medea (ca. 1715)” by Charles Antoine\nCoypel (French, Paris 1694–1752 Paris),\nThe Met Museum is licensed under CC\nEarly on, Medea realizes the BY 4.0\ntruth about Jason, but she\ncontinues to help him, with horrifying results. What does Medea do\nas they are escaping from Aeetes and his fleet? What is the meaning\nof the goddess Athena’s words? It’s not in this version, but in trying\nto return to Greece, the Argos traveled all over, lost, for years. The\nreturn voyage bears several similarities to the places in\nthe Odyssey. Here is a copy of a map of Jason’s travels (there are\nseveral variations).\nIn order to be safe, Medea must be married to Jason so the king\nof Phaeacia will protect her from Aeetes. A quick wedding is\nprepared and Hera blesses their union.\nChapter 2\nWhen Jason is back in Iolcus, he must take revenge on Pelias. This\nMyth & Revenge | 42 is all part of Hera’s scheme to punish Pelias. Again, Medea takes\nthe lead. In an ironic and cruel plot, Medea uses her powers on\nPelias the same way she did on Jason. If Medea is aware of Jason’s\nfalseness and self-centeredness, why does she continue to help\nhim? Hera is pleased with the outcome; she has her revenge on\nPelias. Take note of what Hera does now that her plot has come to\nfruition.\nChapter 3\nThe son of Pelias, Acastus, is now the king of Iolcus. He was also one\nof the Argonauts and friend to Jason. He is another person between\na rock and a hard place. The law gives him leave to kill Jason and\nMedea, but he can’t, so he banishes them. They have no home, but\ncome to Corinth where they are accepted by King Creon. For ten\nyears they live happily, having two sons.\nWe are told by the Apollonius that Medea wore the crown of\nmodesty on her head. So what causes this happiness to come\nunraveled? Medea’s only flaw here is that she grew old. Jason is\ndisgusted by Medea and seeks out the beautiful young daughter of\nKing Creon, Glauce. What is his motivation?\nWhat “loophole” does Creon find in Jason and Medea’s marriage\nthat would allow Jason to freely marry Glauce? Why does Medea’s\nbeing a barbarian become an issue after ten years of marriage?\nAt the end of Chapter 3, Medea makes a remarkably modern\nspeech about the status of women in the society and her own status\nin particular. It gives a good insight into the position of women in\nancient Greece.\n43 | Myth & Revenge Chapter 4\nMedea and Jason argue at the beginning of this chapter. It’s almost\nlike we are eavesdropping because the conversation is so realistic\nand modern in many of the points each one makes. Who do you\nthink is more justified in their anger? Does this conversation reflect\nthe character and personalities of Jason and Medea?\nChapter 5\nWhile Medea ponders her fate, King Aegeus from Athens\ncomes. Medea knows the king and greets him. She tells him that\nJason has abandoned her. In this scene, one can feel sympathy\nfor Medea through Aegeus’s words. He says, “For those who\ndishonored you are inviting the gods to judge them.” Medea begs\nAegeus to take her to Athens and he agrees. Maybe because she\nknows she will have a safe haven, she plots some terrible revenge\non Creon and especially Glauce. For Jason, she has another plan—to\ndeprive him of everything he loves, including his sons.\nChapter 6\nMedea anguishes over her plan to kill her own sons. She considers\ntaking them into exile with her, but realizes she must not spare\nthem. Pay attention to the reasons she gives early in the chapter for\nkilling her sons. What do they say about her? Did you expect her\nto offer reasons like this? One thing to note is that the Greeks very\noften would leave unwanted children on hillsides to die, so there\nmay not have been the same respect and reverence we have for\nchildren today. From the ancient Greek perspective, this act may\nnot have been as profoundly horrid as it is to us.\nMyth & Revenge | 44 A messenger arrives to tell the story of the death of Glauce and\nCreon. In Greek drama, graphic deaths took place off stage and\nwere reported by a messenger. The death is pretty ghastly.\nAfterward, Medea puts all love, passion and tears aside and gives\nher sons herbs to put them in a deep sleep and kills them.\nJason arrives soon after, and Medea presents his dead sons to\nhim. How does Jason react? Read his response carefully as it\nprovides great insight into his character. Some versions show how\nJason wandered, homeless and unhappy, and sought shelter on the\nArgos. One day, while he was sleeping under the stern of the boat it\ncollapsed and killed him.\nThe ending of this story is a bit ambiguous. Medea has killed her\nown brother, King Pelias, Glauce, Creon, her two sons. The most\ndifficult to imagine is her killing her sons. Wouldn’t the gods punish\nher? How come Jason didn’t try to kill her, after all he has just lost\neverything. Helios, Medea’s grandfather, arrives from the heavens\nand takes her and her sons away to Athens (some versions say she\nwent to Mt Olympus). Is the author, Appolonius, trying to justify her\nbehavior to us?\nFinally, there is Jason’s final words about man’s suffering. It is a\nremarkable statement Jason makes—“…the deathless gods are not to\nblame. For there are no gods!” Jason, the first atheist? Why does he\nsay this? Does this provide a clear insight into Jason’s character?\nWith all of this to consider, let’s turn to Jason as a hero. Does\nhe fit the hero’s journey? He does get the Golden Fleece. He has\nhelp, maybe too much, from Medea. He returns with the\nprize. Everything is good. What, then, causes the tragic events of\nthis story? How much is Medea to blame? So, do Jason’s character\nflaws make him less of a hero, even an anti-hero? More\nimportantly, what lessons do we learn from this story?\n45 | Myth & Revenge Readings:\nMake sure to revisit the\n“History and Culture” materials\nfor this myth in the previous\nchapter.\n• Jason and the Golden\nFleece, Greece, [This is a\nlonger one!]\n• Medea, Greece, [This is a “Terracotta column-krater (bowl for\nmixing wine and water) ” by Attributed\nlonger one!]\nto the Orchard Painter, The Met\nMuseum is licensed under CC BY 4.0\nMyth & Revenge | 46 Chapter Nine - Final\nThoughts\nANDY GUREVICH\n“A myth is a way of making\nsense in a senseless world.\nMyths are the narrative\npatterns that give significance\nto our existence. Myths are like\nthe beams in a house: not\nexposed to outside view, they\nare the structure which holds\nthe house together so people\ncan live in it.”\n-Psychoanalyst Rollo\nMay, The Cry for Myth\n“The person who thinks they\n“Kwan Yin (Goddess of Mercy)” by\nUnidentified (Chinese), Smithsonian can live without myth, or\nAmerican Art Museum, Gift of John outside it, like one uprooted,\nGellatly is licensed under CC BY 4.0\nhas no true link either with the\npast, or with the ancestral life which continues within them, or yet\nwith contemporary human society. This plaything of their reason\nnever grips their vitals.”\n-C.G. Jung\nPlease remember that our journey with these transformative\nnarratives continues as long as we are alive, perhaps longer.\nThrough myths, we are able to engage with the consciousness that\nis the ground of being itself. Thank you for spending time on this\njourney with me and with each other, and thank you for bringing\nyour full selves to the experience as well.\n47 | Final Thoughts & Instructions I hope you will continue to engage with the folktales, myths,\nstories, and cultures of the living world of our ancestors. These rich\nnarratives provide a vivid, experiential context of understanding\nthat both honors the uniqueness of each individual and culture\nwhile simultaneously uncovering a deep human connection at the\nbasis of all of them. The myths of our ancestors tell the stories of\nour shared becoming. The stories we tell today, of our struggles,\nour hopes, our fears, and our triumphs, will be the myths of future\ngenerations who look to us, their ancestors, for the eternal hope\nand spiritual grounding that only myths can provide. I pray you\nhave enjoyed the course and our time together. I look forward to\nengaging you final projects.\nFinal Thoughts & Instructions | 48"
}