{
    "text": "By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nHistory\nPAPER -V\nUNIT I Concept of History\nMeaning, Nature and Scope of History\nAims and Objectives of Teaching History at secondary level\nValues of Teaching History\nStructure\n1.0 Introduction\n1.1 Objectives\n1.2 Concept of History\n1.2.1 Defining History\n1.2.2 Nature of History\n1.2.3 The modern concept of history\n1.2.4 History – a Science or an Art\n1.2.5 Arguments against History as a science\n1.2.6 History is both a Science and an Art\n1.3 Scope of History\n1.4 Aims and objectives of teaching History at secondary level\n1.4.1 General Aims of Teaching History\n1.4.2 Aims of Teaching History at Secondary Stage\n1.4.3 Objectives of teaching History at Secondary Stage\n1.5 Values of teaching History\n1.6 Summary\n1.7 Unit End Questions\n1.8 Suggested Readings\n1 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n1.0 Introduction\nHistory is the study of life in society in the past, in all its aspect, in relation to present\ndevelopments and future hopes. It is the story of man in time, an inquiry into the past based\non evidence. Indeed, evidence is the raw material of history teaching and learning. It is an\nInquiry into what happened in the past, when it happened, and how it happened. It is an\ninquiry into the inevitable changes in human affairs in the past and the ways these changes\naffect, influence or determine the patterns of life in the society. History is, or should be an\nattempt to re-think the past. Collingwood (1945) is particularly interested in this concept of\nhistory.\nHistory aims at helping students to understand the present existing social, political, religious\nand economic conditions of the people. Without the knowledge of history we cannot have the\nbackground of our religion, customs institutions, administration and so on. The teaching of\nhistory helps the students to explain the present, to analyze it and to trace its course. Cause-\nand-effect relationship between the past and the present is lively presented in the history.\nHistory thus helps us to understand the present day problems both at the national and\ninternational level accurately and objectively.\nIn this unit we will be dealing with meaning, nature and scope of history, aims and objectives\nof teaching history at secondary level and values of teaching history.\n1.1 Objectives\nAfter completing this unit, the student will be able to:\n Define History\n Explain the nature of History\n Describe the scope of History\n Explain the aims and objectives of teaching History at Secondary level\n Describe the values of teaching History\n1.2 Concept of History\nHistory is the analysis and interpretation of the human past enabling us to study continuity and\nchanges that are taking place over time. It is an act of both investigation and imagination that\nseeks to explain how people have changed over time. Historians use all forms of evidence to\nexamine, interpret, revisit, and reinterpret the past. These include not just written documents, but\nalso oral communication and objects such as buildings, artifacts, photographs, and paintings.\nHistorians are trained in the methods of discovering and evaluating these sources and the\nchallenging task of making historical sense out of them. History is a means to understand the\npast and present. The different interpretations of the past allow us to see the present differently\nand therefore imagine—and work towards—different futures. It is often said to be the “queen” or\n“mother” of the social sciences. It is the basis of all subjects of study which fall under the\ncategory of Humanities and Social Sciences. It is also the basis of the study of philosophy,\n2 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\npolitics, economics and even art and religion. No wonder, it is considered an indispensible\nsubject in the complete education of man.\n1.2.1 Defining history\nThe origin of the word History is associated with the Greek word ‘Historia’ which means\n‘information’ or ‘an enquiry designed to elicit truth’.\nHistory has been defined differently by different scholars. Following definitions indicate the\nmeaning and scope of History.\nBurckhardt: “History is the record of what one age finds worthy of note in another.”\nHenry Johnson: “History, in its broadest sense, is everything that ever happened.”\nSmith,V.S: “The value and interest of history depend largely on the degree in which the present\nis illuminated by the past.”\nRapson: “History is a connected account of the course of events or progress of ideas.”\nNCERT: “History is the scientific study of past happenings in all their aspects, in the life of a\nsocial group, in the light of present happenings.”\nJawaharlal Nehru: “History is the story of Man’s struggle through the ages against Nature and\nthe elements; against wild beasts and the jungle and some of his own kind who have tried to keep\nhim down and to exploit him for their own benefit.”\nThe above definitions explain History as a significant records of events of the past, a meaningful\nstory of mankind depicting the details of what happened to man and why it happened. Mainly it\ndeals with the human world.\n1.2.2 Nature of History\n1. A study of the present in the light of the past: The present has evolved out of the past.\nModern history enables us to understand how society has come to its present form so that\none may intelligently interpret the sequence of events. The causal relationships between\nthe selected happenings are unearthed that help in revealing the nature of happenings and\nframing of general laws.\n2. History is the study of man: History deals with man’s struggle through the ages. History\nis not static. By selecting “innumerable biographies” and presenting their lives in the\nappropriate social context and the ideas in the human context, we understand the sweep\nof events. It traces the fascinating story of how man has developed through the ages, how\nman has studied to use and control his environment and how the present institutions have\ngrown out of the past.\n3 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3. History is concerned with man in time: It deals with a series of events and each event\noccurs at a given point in time. Human history, in fact, is the process of human\ndevelopment in time. It is time which affords a perspective to events and lends a charm\nthat brightens up the past.\n4. History is concerned with man in space: The interaction of man on environment and vice\nversa is a dynamic one. History describes about nations and human activities in the\ncontext of their physical and geographical environment. Out of this arise the varied trends\nin the political, social, economic and cultural spheres of man’s activities and\nachievements.\n5. Objective record of happenings: Every precaution is taken to base the data on original\nsources and make them free from subjective interpretation. It helps in clear understanding\nof the past and enables us to take well informed decisions.\n6. Multisided: All aspects of the life of a social group are closely interrelated and historical\nhappenings cover all these aspects of life, not limited only to the political aspect that had\nso long dominated history.\n7. History is a dialogue between the events of the past and progressively emerging future\nends. The historian’s interpretation of the past, his selection of the significant and the\nrelevant events, evolves with the progressive emergence of new goals. The general laws\nregulating historical happenings may not be considered enough; attempts have to be made\nto predict future happenings on the basis of the laws.\n8. Not only narration but also analysis: The selected happenings are not merely narrated;\nthe causal relationships between them are properly unearthed. The tracing of these\nrelationships lead to the development of general laws that are also compared and\ncontrasted with similar happenings in other social groups to improve the reliability and\nvalidity of these laws.\n9. Continuity and coherence are the necessary requisites of history: History carries the\nburden of human progress as it is passed down from generation to generation, from\nsociety to society, justifying the essence of continuity.\n10. Relevant: In the study of history only those events are included which are relevant to the\nunderstanding of the present life.\n11. Comprehensiveness: According to modern concept, history is not confined to one period\nor country or nation. It also deals with all aspects of human life-political, social,\neconomic, religious, literary, aesthetic and physical, giving a clear sense of world unity\nand world citizenship.\n1.2.3 The modern concept of history\nModern history has gone beyond the traditional status of an antiquarian and leisure time\npursuit to a very useful and indispensible part of a man’s education. It is more scientific and\nmore comprehensive. It has expanded in all directions both vertically and horizontally. It has\nbecome broad-based and attractive. According to modern concept, history does not contain\n4 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nonly the history of kings and queens, battles and generals, but the history of the common\nman-his house and clothing, his fields and their cultivation, his continued efforts to protect\nhis home and hearth, and to obtain a just government, his aspirations, achievements,\ndisappointments, defeats and failures. It is not only the individual but the communities and\nthe societies are the subject of study of history. Study of history deepens our understanding\nof the potentialities and limitations of the present. It has thus become a future-oriented study\nrelated to contemporary problems. For all these reasons, history has assumed the role of a\nhuman science.\n1.2.4 History-a Science or an Art\nOpinions are very much divided on the question whether history is a science or an art.\nHistory is a science in the sense that it pursues its own techniques to establish and interpret\nfacts. Like other natural sciences such as the Physics and Chemistry uses various methods of\nenquiry such as observation, classification, experiment and formulation of hypothesis and\nanalysis of evidence before interpreting and reconstructing the past. History also follows the\nscientific method of enquiry to find out the truth. Though historian uses scientific techniques,\nexperiment is impossible since history deals with events that have already happened and cannot\nbe repeated.\n1.2.5 Arguments against History as a science\n1. No forecasting: Rickman has rightly said, “History deals with sequence of events, each of\nthem unique while Science is concerned with the routine appearance of things and aims at\ngeneralizations and the establishment of regularities, governed by laws.”A historian\ncannot arrive at general principles or laws which may enable him to predict with certainty\nthe occurrence of like events, under given conditions. A scientist on the other hand, looks\nat knowledge from a universal angle and arrives at certain generalizations that help him\nto control the present and predict the future.\n2. Complex: The facts of history are very complicated and seldom repeat in the real sense of\nthe term.\n3. Varied: The underlying facts of history have wide scope. They are so varied that they can\nseldom be uniform.\n4. No observation and experimentation: Historical data are not available for observation and\nexperimentation.\n5. No dependable data: Historical data are the products of human thoughts and action which\nare constantly changing. They therefore cannot provide dependable data for the formation\nof general principles and laws.\n5 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n1.2.6 History is both a Science and an Art\nHistory is a unique subject possessing the potentialities of both a science and an art. It does\nthe enquiry after truth, thus history is a science and is on scientific basis. It is also based on\nthe narrative account of the past; thus it is an art or a piece of literature. Physical and natural\nsciences are impersonal, impartial and capable of experimentation. Whereas absolute\nimpartiality is not possible in history because the historian is a narrator and he looks at the\npast from a certain point of view. History cannot remain at the level of knowing only. The\nconstruction and reconstruction of the past are inevitable parts of history. Like the work of\nart, its wholeness, harmony and truth are inseparable from a concrete and vivid appreciation\nof its parts. History, in fact, is a social science and an art. In that lie its flexibility, its variety\nand excitement.\n1.3 Scope of History\nThe scope of History is vast; it is the story of man in relation to totality of his behavior. The\nscope of history means the breadth, comprehensiveness, variety and extent of learning\nexperiences, provided by the study. History which was only limited to a local saga, has\nduring the course of century become universal history of mankind, depicting man’s\nachievements in every field of life-political, economic, social, cultural, scientific,\ntechnological, religious and artistic etc., and at various levels-local, regional, national, and\ninternational. It starts with the past; makes present its sheet-anchor and points to the future.\nEvents like wars, revolutions, rise and fall of empires, fortunes and misfortunes of great\nempire builders as well as the masses in general are all the subject matter of history. History\nis a comprehensive subject and includes-History of Geography, History of Art, History of\nCulture, History of Literature, History of Civilization, History of Religion, History of\nMathematics, History of Physics, History of Chemistry, History of Education, History of\nBiology, History of Atom, History of Philosophy-in fact history of any and every social,\nphysical and natural science we are interested in. History today has become an all-embracing,\ncomprehensive subject with almost limitless extent.\nSelf Assessment Questions\n1) What is the modern concept of history?\n…………………………………………………………………………………………………………………\n…………………………………………………………………………………………………………………\n…………………………………………………………\n2) Is history a science or an art?\n…………………………………………………………………………………………………………………\n…………………………………………………………………………………………………………………\n………………………………………………………....\n3) Briefly write the scope of history.\n…………………………………………………………………………………………………………………\n…………………………………………………………………………………………………………………\n…………………………………………………………\n6 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n1.4 Aims and objectives of teaching History at secondary level\nThe aims and objectives of teaching history have undergone changes with the shift in the\nphilosophical thinking of the time and changes in the social and political practices. Education\nis the process of bringing about desirable changes in the behavior of pupils. The idea of the\ndesirable changes has varied at different times in accordance with the dominant philosophical\ncreed of the society and prevalent social and political practices.\nDetermination of aims and objectives is necessary to point to the broad ideals and to enable\nus in selecting significant and meaningful content, teaching methods and techniques. Aims\nare a true compass to make our journey safe and secure in the pedagogical sea. They are the\ncrux and the key of the entire process of teaching and learning.\nThe aims of teaching history will have to be in consonance with the broader aims of\neducation and the objectives, which teachers should view while teaching the subject, have to\nbe precise and definite. Aims refer to general and long term goals whereas the Objectives\nindicate immediate, specific and attainable goals.\n1.4.1 General Aims of Teaching History\n1. To promote self-understanding: History needs to be taught to promote self-\nunderstanding. Everyone has a heritage which is uniquely his, a combination of racial,\nnational, family and individual traditions which are woven into his very being. Without\nenquiry into these historical factors, man will remain a stranger to himself. Similarly in\nthe absence of historical study, groups and persons will fail to comprehend their own\nidentity. Being a key subject, history provides useful information necessary for\nunderstanding the common allusions in daily reading-names, places, dates and events etc.\nThus the knowledge of history is a part of the self-awareness and realization of our\nenvironment.\n2. To give proper conception of time, space and society: History gives a proper\nunderstanding of the concept of time, space and society. It reveals the relationship of the\npresent with the past, the local with the distant and personal and national life with the\nlives and the cultures of men and women in other countries, in time and space. History is\na link uniting each of us as an individual with a whole greater than ourselves.\n3. To enable the pupils to assess the values and achievements of their own age: History\nprovides the youths the standards of reference against which they can measure the values\nand achievements of their own age. This enables them to have an enlightened awareness\nof the problems of modern communities, political, social and economic.\n4. To teach tolerance: History teaches tolerance- tolerance with different faiths, different\nloyalties, different cultures, different ideas and ideals.\n7 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n5. To develop right attitudes: Development of right attitudes is based on an appreciation of\nthings which are worth-while in life. Attitudes depend upon intellectual and emotional\nfactors. Scientific attitude is intellectual, like, judgment based on facts are unaffected by\npersonal feelings. The teacher has to help his pupils in building up the right attitudes. But\nbefore being able to develop desirable attitudes among his pupils by his own example, he\nhimself must exhibit self-control, patient, sympathy and self-respect.\n6. To foster national feelings: An important objective of teaching history is the emotional\nand national integration of Indian people. Emotional integration is a feeling of oneness\namong the people of different cultures, religions, castes and languages. It is the sharing of\ncertain common objectives, ideals and purposes and giving them high place over smaller\nand sectional loyalties. History can play a very important role in realizing this aim.\n7. To develop international understanding: The swift growth of means of communication\namong various nations has hastened the exchange of ideas and dependence on each other\non various aspects of life. History is one subject that can promote international\nunderstanding in the best possible way. It can destroy prejudices existing among nations;\nit can also overplay the fundamental unity and interdependence among nations and\nunderplay the sources of disunity.\n8. To give training for handling controversial issues: Teaching history helps pupils to\nhandle controversial questions in a spirit that searches for truth-insists on free discussion\nand permits compromise. It can expose the pupils to a vast knowledge which will enable\nthem to tackle controversial issues objectively.\n9. To impart mental training: History can stimulate thought, judgement and discrimination\nand create a scientific attitude in the adolescent as a counterbalance to his emotional\ninstability. It trains the pupils to be accurate in comprehension and expression.\n10. To teach moral principles: History teacher is in an excellent position to inculcate moral\nvalues in pupils’ mind. Life stories of great saints, heroes and reformers, like\nShankracharya, Buddha, Rama, Maharana Pratap, Guru Nanak, Swami Dayananda,\nSwami Vivekananda and Mahatma Gandhi, etc. encourage pupils to be truthful,\ncourageous, just and selfless.\n11. To help resolve our contemporary social and individual problems: History helps in\nresolving our contemporary social and individual problems and developing mature\njudgments on immediate social issues, trends and prospects in the field of commerce,\nindustry, international affairs, regional politics and other aspects of the contemporary\nsociety.\n12. To promote socialization among pupils: An important aim of history teaching is the\nsocialization of pupils in order to make them well informed and enlightened citizens,\ncapable of promoting common welfare. Socialization awakens a sense of developing\nconfidence, courage and happiness within oneself. It develops individual and social\nvirtues of initiative, thoughtfulness, righteousness, constructive thinking, critical\njudgment, justice, tolerance, co-operation, fellow feeling and sacrifice etc.\n8 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n1.4.2 Aims of Teaching History at Secondary Stage\nThe intellectual maturity of pupils at this stage reaches almost adult standards. The main\nfocus at this level is on the stages in the growth of human civilizations and the evolution of\nsocial systems and on cultural and scientific development.\nThe main aims of teaching history at this stage are:\n1.To promote an understanding of the process of change: History is the only subject that can\nunfold the process of change and development through which human societies have evolved\nto their present stage of development.\n2.To acquire knowledge of significant world events: The pupils through the learning of history\nget the knowledge of happenings outside the life of the nation which are significant to the life\nof the world as a social group or significant to some happening in the life of the nation (such\nas French revolution, the Industrial revolution, etc.).\n3.To promote an understanding of the common roots of human civilization: All major\ncivilizations of the world have common roots, leaving aside some major local characteristics;\nmost of them have common features which point to the basic unity of mankind. One of the\nimportant aims of history is to point to this basic unity.\n4.To develop an appreciation of the contributions made by various cultures: The cultures of\ndifferent countries have contributed in one way or the other to the total heritage of mankind.\nHistory can bring this to the knowledge of the pupils and that is to be understood and\nappreciated.\n5.To develop an understanding of causal relationships: By the understanding of the causal\nrelationship between historical happenings, pupils may be able to have some insight into the\nprocess of framing historical laws and utilizing them for prediction. For example, from the\nfacts studied in history regarding the French Revolution they may be able to conclude that\nother things being equal, when the social, political and economic frustrations of the general\nmass of people in a social group reaches an unbearable point, revolution is bound to break\nout. With this law as the basis the pupils may discuss, whether India has reached the point of\nrevolution at the moment or not and what India might do to avert a revolution.\n1.4.3 Objectives of teaching History at Secondary Stage\n1. Knowledge: The pupil should acquire knowledge of terms, concepts, facts, events,\nsymbols, ideas, conventions, problems, trends, personalities, chronology and\ngeneralizations, etc. related to the study of history. The pupil should be able to:\n Recall facts, terms, concepts, events, etc;\n Recognize facts, terms, concepts, events, etc;\n Show information on maps, charts, diagrams, etc;\n Read information presented in various forms.\n9 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n2. Understanding: The pupil should develop understanding of terms, facts, principal events,\ntrends, etc, related to the study of history. The pupil should be able to:\n Classify facts, events, terms, and concepts, etc;\n Illustrate events, trends, etc., by citing examples;\n Compare and contrast the events, trends and concepts, etc;\n Explain events, terms, and concepts, causes and effects, trends, etc;\n Discriminate between the significant and insignificant, important and less\nimportant causes, effects events, etc;\n Identify relationship between cause and effect, means and ends;\n Arrange facts, trends, etc., in a particular known order;\n Detect errors in the statement and rectify them;\n Interpret the maps, charts, etc. and\n Extract from the different courses of history.\n3. Critical Thinking: The subject should enable the pupils to develop critical thinking. The\npupil should be able to:\n Identify the problems;\n Analyze the problems;\n Collect evidence;\n Sift evidence, facts and opinion;\n Select relevant evidence and facts and weigh them;\n Establish relationship and marshal facts;\n Draw conclusions;\n Advance arguments in support of his contention;\n Verify the interferences.\n4. Practical Skills: The subject should enable the pupils to develop practical skills helpful in\nthe study and understanding of historical facts. The pupil should be able to:\n Draw maps, charts, diagrams, etc;\n Prepare models, tools, etc.\n5. Interests: The subject should enable the pupil to develop interest in the study of history.\nThe pupil, on his own, should be able to:\n Collect coins and other historical materials;\n Prepare illustrative material aids;\n Participate in historical dramas and mock sessions of historical events;\n Visit places of historical interests, archeological sites, museums and archives;\n Read historical documents, maps and charts;\n Write articles on historical and other related topics.\n6. Attitudes: The subject should enable the pupil to develop healthy social attitudes. The\npupil should:\n Possess the sense of patriotism;\n10 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n Show respect towards other people’s opinion, ideas, beliefs and ways of life;\n Read about other faiths and religions;\n Establish friendship with pupils of other communities and faiths;\n Practice the spirit of noble ideal;\n Cooperate with others in the social and civic activities;\nAppreciate cultural variations; contributions made by various countries, interdependence\nof nations and peoples and the need for settling disputes among nations in a peaceful\nmanner through world organizations like the U.N.O.\nBelieve in the equality of man irrespective of race, castes, religion and colour.\nSelf Assessment Questions\n1) What are the aims of teaching History at the secondary stage?\n………………………………………………………………………………………\n………………………………………………………………………………………\n………………………………………………………………………………………\n2) Describe various objectives of teaching history at the secondary stage.\n………………………………………………………………………………………\n………………………………………………………………………………………\n………………………………………………………………………………………\n1.5 Values of teaching History\nValue is that experience or fruit which one gets in the path of achieving aim whereas aim\nis a conscious and active purpose that we always keep before our mind. It always remains\nbefore us in the path of achievement. History is valuable as a study in more ways than\none. Some of the values are general that is they apply to the teaching of the subject in all\ncircumstances. Other values are limited and specific. They apply to particular types of\nhistory, hold for a particular level of schooling or are the necessary result of teaching if\ncarried out in a particular way.\nThe values of teaching history may be stated as under:\nDisciplinary value: History is quite fruitful for mental training. It trains the mental\nfaculties such as critical thinking, memory and imagination. It quickens and deepens\nunderstanding, gives an insight into the working of social, political, economic, and\nreligious problems.\n11 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nInformative value: History is a wonderful treasure-house of information and can offer\nguidance for the solution to all human problems pertaining to science and art, language\nand literature, social and political life, philosophical speculation and economic\ndevelopment. History shows us the roots without uprooting the tree. A mere emotional\nattachment to our past can do us little good, unless it is accompanied with a sober,\nmatured and rational assessment of the values involved. History is a path finder of man’s\nfuture.\nCultural and social values: It is essential that one should understand the importance of\nhis/her own cultural and social values. We should also develop attachment towards our\ncultural heritage. History makes us able to understand our present culture. It expounds the\nculture of the present time by describing the past. It explains the origin of existing state of\nthings, our customs, our usages, our institutions. It enables us to understand that the\ntransformations in human history were brought about by change of habits and of\ninnovation. One of the main motives of history teaching has been to convey to the pupils\nthe rich heritage of the mankind. It develops an understanding of the different forces\nwhich have shaped the destiny of man and paved the way for his development in society.\nPolitical values: History is regarded to be the past politics. According to T.S. Seeley,\n“The historian is a politician of the political group or organization, the state being his\nstudy. To lecture on political science is to lecture on history.” History stands as a beacon\nof hope when some nation is overcast with dark clouds. History is extremely necessary\nfor completing the political and social sciences which are still in the making. History\nsupplements them by a study of the development of these phenomena in time.\nNationalistic value: History teaching renders an effective service in imbibing the young\nminds with a sense of patriotism. It is through history alone that an Indian child comes to\nknow of the various deeds performed by such patriots as Shivaji, Rana Pratap, Guru\nGobind Singh, Rani Lakshmibai, Bhagat Singh, Gandhiji, Nehru, etc. By reading their\ngreat lives and deeds, the child can easily be inspired to emulate them. A proper teaching\nof history can prepare the way for sober nationalism.\nInternationalistic value: History shows the dependence and interdependence of nations\nwhich is the root of internationalism. The domain of history is very extensive and wide.\nThrough a survey of world history, the young learners will come to realize that although\ndifferent peoples had and still have different customs, habits, laws, and institutions; they\nhave been striving towards the same end. The realization of essential unity of human race\nis the first step towards fostering universal understanding based on the virtues of\ntolerance, kindliness, love, sympathy, and goodwill.\nEducational value: History has unique value and importance because it is the only school\nsubject which is directly and entirely concerned with the behavior and action of human\n12 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nbeings. The imagination of the children is developed through the teaching of history. It is\nlogical to treat history as a temporal canvas against which the facts learned in other\nsubjects can be arranged. History is a veritable mine of stories-stories can illustrate even\nsubject of curriculum- the only condition is that the teacher should know enough stories\nand should know how to narrate them.\nIntellectual value: A large number of intellectual values accrue from the teaching of\nhistory. It sharpens memory, develops the power of reasoning, judgement and\nimagination. It cultivates the qualities of reading, analyzing, criticizing, and arriving at\nconclusions. In historical writings our past is alive and treasured in the form of\nchronicles, biographies, stories and other forms of literary tradition. Once the pupils’\ncuriosity is aroused and interest awakened, he can easily browse the vast pastures of\nhistorical knowledge.\nEthical value: History is important in the curriculum because it helps in the teaching of\nmorality. Through it a child comes close to the valuable thoughts of saints, reformers,\nleaders, important persons and sages. The children get inspired by the life stories of these\ngreat leaders. There are other arguments that go against this notion that history gives\nethical teaching.\n Truth or virtue does not always have the victory and falsehood or wickedness\ndoes not always come to grief. Many times it has been seen that honest and truth-\nloving man faces difficulties throughout the life and wicked and liars succeed in\nlife.\n On the basis of experience and observations it has been seen that students do not\ntake any interest in the work and life of saints and holy persons. They take more\ninterest in the deeds of warriors and they almost worship them.\n One more argument is that the lives of great men are full of complexities. Both\ngood and evil are present in their characters. It would be unscientific if only their\ngoodness is described. It is possible that students may emulate evils from the\ncharacters presented if both the elements are presented.\nAbove given arguments are quite convincing. Teachers should be given this suggestion\nthat in teaching history they should impart the ethical teaching not directly but indirectly.\nVocational value: History has its vocational value. There are several openings for persons\nwell qualified in the subject. They can get jobs of teachers, librarians, archivists, curators\nof museums, secretaries of institutions, social service workers, and political journalists\netc.\n13 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nSelf Assessment Questions\n1) Describe Disciplinary and Informative values of teaching history.\n………………………………………………………………………………………\n………………………………………………………………………………………\n………………………………………………………………………………………\n2) Both Nationalistic and Internationalistic values are received through teaching of\nhistory. Explain.\n………………………………………………………………………………………\n………………………………………………………………………………………\n………………………………………………………………………………………\n3) Discuss Intellectual, Ethical and Vocational values of teaching history.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n……………………………………………………………………………………………….\n1.6 Summary\nHistory is the basis of all subjects of study which fall under the category of Humanities and\nSocial Sciences. It is often said to be the “queen” or “mother” of the social sciences. History is\nconsidered an indispensible subject in the complete education of man and it has been defined\ndifferently by different scholars. According to modern concept, history does not only contain the\nhistory of kings and queens, battles and generals, but also the communities and the societies are\nthe subject of study of history as well. History is a unique subject possessing the potentialities of\nboth science and art. As an enquiry after truth, history is a science and as a narrative account of\nthe past, it is an art or a piece of literature.\nHistory is a study of man. It is concerned with man in time and space. It explains the present in\nthe light of the past. Continuity and coherence are the necessary requisites of history. The scope\nof history is vast; it is the story of man in relation to totality of his behavior. It starts with the\npast; makes present its sheet-anchor and points to the future.\nThe aims and objectives of teaching history have undergone changes with the shift in the\nphilosophical thinking of the time and changes in the social and political practices.\nDetermination of aims and objectives is necessary. Instructional objectives need to be clearly\ndefined. The pupils should acquire knowledge, should develop specific understandings, attitudes,\ninterests and appreciations, relevant to history.\nHistory is valuable as a study in more ways than one. The values of teaching history are-\ndisciplinary, informative, educational, ethical, cultural, intellectual, political, nationalistic,\ninternationalistic and vocational.\n14 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n1.7 Unit End Questions\n1) What do you mean by History? How is it interpreted in its modern context?\n2) History is a science as well as an art. Discuss.\n3) “The scope of history is wide-the theme is the past, present and future of man.” In the light\nof this statement, discuss the scope of the subject.\n4) “History is a scientific study and a record of our complete past.” In the light of this\nstatement, discuss the nature of history.\n5) Explain the difference between aims of teaching history and instructional objectives of\nteaching history.\n6) Discuss briefly the values of teaching history in our schools.\n1.8 Suggested Readings\nCarr, E.H., What is History? New York: Macmillan, 1961;\nCentral Board of Secondary Education, Syllabi and Courses for All India Senior School\nCertificate Examination, 1979, published in 1981.\nChaudhry,K.P., Effective teaching of History in India, New Delhi; National Council of\nEducation and Research and Training, 1975;\nCollingwood,R.G, The Idea of History, London; Oxford University Press, 1951;\nGhate, V.D., Suggestions for the Teaching of History, Bombay; Oxford University Press,\n1953;\nJeffrey, M.V.C., History in Schools; The Study and development, London: Pitman, 1948;\nMathias, Paul, The Teachers Handbook for Social Studies, London; Brandford Press, 1973;\n15 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nUNIT-II History Syllabus\nSelection and grading of the subject matter in History\nDifferent approaches in arrangement of content in History\nStructure\n2.0 Introduction\n2.1 Objectives\n2.2 History Syllabus (A- Selection and grading of the subject matter in history)\n2.2.1 Principles of selecting History Curriculum\n2.2.2 Selection of the subject matter for different stages\n2.2.2.1 Cultural Epoch Theory\n2.2.2.2 Biographical Approach\n2.2.2.3 Psychological Theory\n2.2.3 History syllabus for different classes as recommended by Ishwar Bhai Patel\nCommittee\n2.3 History Syllabus (B-Different Approaches in arrangement of content in history)\n2.3.1 Topical Approach\n2.3.2 Chronological Approach\n2.3.3 Concentric Approach\n2.3.4 Regressive Approach\n2.4 Summary\n2.5 Unit End Questions\n2.6 Suggested Reading\n2.0 Introduction\nHistory enables students to appreciate the human achievements of the past, for their own\ninterest and for the legacy left to later generations. The aim of history syllabus should be to\nstimulate students’ interest in and enjoyment of exploring the past, to develop a critical\nunderstanding of the past and to enable them to participate as active, informed and\nresponsible citizens. In the history syllabus students are given opportunities for self-\nunderstanding, proper conception of time, space and society, handling controversial issues\nand developing national and international understanding.\nUnderstanding about the past requires us to seek out knowledge as well as apply historical\nskills to determine why events occurred and what motivated the people to take the action\nthey took. This is an inquiry based approach. An inquiry based approach helps students to\n16 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\ngrapple with the problems and issues of history. Skills in History must be taught in\nconnection to content. Skills need to be practiced and reinforced throughout a unit of work.\nHistory as an independent subject or a part of environmental studies or social sciences\nforms an important part of the high school curriculum. The primary purpose of inclusion of\nhistory broadly, is to widen the horizons of the students. While framing the syllabus proper\ncare should be taken to develop the child’s awareness and understanding of the society in\nwhich he lives, from his immediate environment to the country and to the world as a whole.\nThis unit is focused on the selection and grading of the subject matter in history and different\napproaches in arrangement of content in history.\n2.1 Objectives\nAfter completing this unit, the student will be able to:\n Explain the principles of selecting History curriculum at different levels\n Describe various theories of selecting subject matter for History curriculum at different levels\n Describe the History syllabus for different classes as recommended by Ishwar Bhai Patel\nCommittee\n Describe the different approaches in arrangement of content in history\n2.2 History Syllabus\na) Selection and grading of the subject matter in history\nThe development of curriculum in history is a complex and intricate process. Although the\ncurriculum in our country is mainly done by a committee of specialists, the teachers are also being\nassociated in this work in a big way. It is the teachers who have to implement the curriculum. The\nstudy of history offers a wide range of materials involves numerous skills and leads to insight and\ngeneralizations which will challenge the varied capacities of each student. As the scope of history is\nvast, within the limited period of time, the decision on what to teach at different grades needs to be\nmade wisely and carefully. A good curriculum for a particular class is that which is convenient,\nwell-planned, appropriate, presenting a sensible and orderly appearance. As an independent subject\nor a part of environmental studies or social sciences history forms an important part of the high\nschool curriculum. In classes XI and XII, it is included as a separate subject, usually an optional\nsubject.\n2.2.1 Principles of selecting History Curriculum\n1. The curriculum selected should help in the achievement of aims of teaching history: The main\naim of the course of history is not only to provide information to pupils but also it should make\npossible among them a growth of knowledge, skills, attitudes, interests and values. The power\nof reasoning, thinking, memory and decision are all related to it. Fulfillment of these aims\nshould be taken into account while selecting the subject matter.\n2. The curriculum selected should be appropriate to the age and ability of that group of pupils to\nwhom it is to be taught: The study material of history should be kept according to traits and\n17 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\npsychological growth of children. The curriculum must answer the needs of the pupils at a\nparticular age. The material selected must be up-to-date. Thus the curriculum should be child\ncentered.\n3. The contents of the subject matter should have functional relationship between them: The entire\ncurriculum in each class should be well connected with the previous and the succeeding classes.\nNo effort should be spared in coordinating our work in history with the political, social,\neconomic, cultural and religious history and other activities that are going on in the\nneighbourhood.\n4. The curriculum must be wide and comprehensive: The selection of curriculum should be such\nthat the pupil can learn about the story of humanity starting from the local history, proceeding\nthrough the regional and national history and ultimately reaching the world history. The\ncurriculum should be so comprehensive as to enable the pupils to comprehend the present world\nof human thought and activity.\n5. The curriculum selected should lay emphasis on national and world history: The curriculum\nshould serve as an instrument of social regeneration. It should bring out not only the political,\nsocial, cultural and economic features of the different countries that are studied but also the\nprocess of inter-communication and cooperation between different nations and continents.\n6. The curriculum should be based on the principle of concentration and correlation: According\nto Ziller while concentrating on one subject, education of other subjects should be imparted. For\nthis history should be attached to the daily life and the materials of local history should be kept\nin curriculum. Those materials of history should be selected which can form co-relation in both\nthe forms-vertical and horizontal. When one lesson of history helps in understanding of the\nother it is known as vertical correlation where as the correlation between the subject-topics of\none subject with the subject topics of other subjects is known as horizontal correlation.\n7. The curriculum should be based on the principle of integration with the daily lives of the\ncommon man: Such material should be given place in the curriculum of history which can fulfil\nthe needs of the society and students. This can help the students to take active part in their\nfuture social life. History today is considered to have four dimensions; people, places, time and\nideas. These are all indispensable for making the story of humanity intelligible. Now the focus\nof history curriculum has changed from the life and work of heroes, kings, queens and\nimportant personalities to the evolution and growth of societies in all their aspects.\n2.2.2 Selection of the subject matter for different stages\nVarious theories have been advanced to select the subject matter.\n2.2.2.1 The Culture-Epoch theory: This theory has been developed by Dr. Stanley Hall.\nAccording to Stanley Hall, the child in his own life repeats his successive stages or\nepochs through which the human race has passed in its course of evolution. The child, in\nrepeating these epochs in his life, recapitulates the experience or culture of the race of\neach stage. Stanley Hall, went to the extent of believing that there is some biological\narrangement in the makeup of the child because of which he naturally goes through the\n18 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\ndifferent stages of the evolution of the culture of the human race and the child will not\ngrow into a normal adult unless he is given the opportunity to go through these stages.\nAccording to this theory there is similarity between man and race; means, man repeats his\nstages through which the entire human race’s cultural development has taken place. Therefore,\nthe material of history should be taken from the stage of the cultural development of a race\nthrough which a child is passing. It means that a child, if he is very small, then he should be\ntaught the story of early man and if he is grown up, he should be taught the history of youth of\nthe race. The selection of facts for history should be done from this point of view. According to\nthis theory we can arrange the teaching of history in the following manner:\n(i) Ancient history for the primary stage.\n(ii) Medieval history for the middle school stage.\n(iii) Modern history for high school stage.\n(iv) Present age history for higher classes.\nArguments against Cultural Epoch theory\n(i) It was believed that the primitive life would be suitable for the young. The complexity\nof the medieval period would be suitable for the boys and the highly complicated\nmodern history would be suitable for the grown up. But, it will have to be admitted\nthat the complexity of the medieval period is in no way less than that of the modern\nperiod. It is the imaginative presentation of a period in all its picturesque details that is\nmore valuable than the period chosen for the study. So what is claimed for the\nprimitive period could be easily achieved even for a topic in the modern period.\n(ii) A curriculum must have flexibility and not rigidity. It must be subject to revision in\nthe light of historical research and of the changing needs of the times.\n(iii) All races do not pass through identical stages of evolution. A cursory look at the world\nto-day will suffice to show that different races are at different stages of evolution.\n(iv) Supporter of this theory feel that there is similarity between man and the evolution of\nrace. There is no doubt to find to parallelism in the stages of child life. But latter on it\nis much more difficult to find such a parallelism in the life of the human race in\nhistorical period and that of the mental stage in the life of the boy.\n2.2.2.2 Biographical Approach: Carlyle is the main exponent of this approach. The supporters\nof this approach are of the opinion that the selection of facts for history can be done\naccording to the life histories. They feel that great men represent their time. They\ninfluence great historical movement. Therefore the stories of their life should be included\nin the curriculum of history. The teaching of history should be imparted through stories\nof these great men. According to this approach, history is taught as a series of stories of\nthe great men of our country in a chronological order. The hero-worship in history is the\noutcome of this theory. At the early stage, general history is beyond the comprehension\nof children who understand individuals but not institutions, particular facts but not\n19 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nprinciples. So, a preliminary study of these lives gives the pupils an insight into history\nand, at a later stage, they would be prepared to study the movement.\nArguments against Biographical Approach\n(i) The theory is opposed to democracy. It puts emphasis on individualism and ignores\ncollectivism. Therefore it cannot create a path for socialism. It also does not think anything\nfor the common man.\n(ii) The great men of history are not representatives of their times. They are away from the\ngeneral society. They are revolutionary and rebels of the time. They may be great in their\nfield; they cannot represent the development or the genius of the entire human life.\nIn spite of all these criticisms, this approach has been greatly influencing the history teaching in\nschools and has been responsible for the selection of content for the early classes. Even in the new\nsyllabus suggested by the Patel Committee, this principle has been followed. What is needed is that\na teacher of history while using this approach, should keep the following points in mind:\n(i) Proper selection of personalities is needed for the content of the syllabus. Not only the\ngreat men and women of our country but also from different parts of the world should find\na place in the syllabus. Along with the heroes, warriors, statesmen, rulers, who have shaped\nthe destiny of mankind; scientists, explorers, inventors, artists, apostles of peace, religious\nprophets etc. should be included in the history syllabus.\n(ii) We will not be benefited by the life story of any single great man unless the complete\npicture related to his life, his principles, his disciples, his followers , his activities, are not\npresented. Therefore, if we are studying about Buddhism, it would be incomplete unless the\nknowledge of Gautam Buddha’s character, his disciples, followers, propagators of\nBuddhism, his opponents are given.\n(iii) The selected life story should be made keeping in mind the utility and its relevance of time.\nThe system of such teaching of history should be done for the early stage.\n2.2.2.3 The psychological theory: This theory aims at selecting that subject matter which satisfies\nthe needs of the child in the successive stages of his mental life. A process of progression\nneeds to be followed. This process has three definite stages: study of personalities, events\nand ideas.\nIn the initial stages, history will be taught through the medium of personalities. For the\nyoung minds, personalities are easy to understand. History will be made as concrete as possible\nat the early stage which is presentative in nature.\nAt the second stage, actions of the personalities resulting in events will be studied. Events\nlike the conquests of Chengiz, the splitting of the atom and the flights in the space have\ncompletely overwhelmed us, changed us. This is the representative type of history which needs\nto be presented to the child who has strong imagination and takes interest in facts.\nIdeas are the basis of all actions of personalities and are behind occurrence of all events\nand are, therefore, superior to both. This thought history which aims at giving a deeper\n20 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nunderstanding of historical movements, and helps pupils to draw inferences and unify\nconclusions, will be taught in the third stage of child’s development.\nA judicious combination of the three theories is needed to achieve the best results. The\nfollowing suggestions will be found useful in selecting the subject matter for various stages:\n(i) At the primary stage (up to class V) the whole of Indian history and some parts of the\nworld could be presented in the form of stories of leading historical characters. Events\ncan be grouped round such individuals.\n(ii) At the junior high school stage (classes VI, VII, and VIII) the course may be repeated\nin the form of narrative history in which events and not persons may be emphasized.\n(iii) At the secondary stage, significant movements, events from the ancient, medieval\nIndian history, and other countries of the world and modern world history may form an\nimportant part of the curriculum.\nSelf Assessment Questions\n1) Write the principles of selection of content in history.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n2) Explain Psychological theory.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n……………………………………………………………………………………………....\n3) Write the merits of Cultural Epoch Theory.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n4) What are the limitations of Biographical Approach?\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n……………………………………………………………………………………………….\n2.2.3 History syllabus for different classes as recommended by Ishwar Bhai Patel Committee\nEnvironmental Studies, Class I and II\n1. Our family\n2. Our home\n3. Our school\n4. Our neighbourhood\n5. Our earth\n6. Our sky\n7. Man’s life\n21 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nEnvironmental Studies (Social Studies), Class III\n1. The world we live in\n2. Life in the district\n3. Life in our state\n4. Life in our country\n5. Institutions which help us\n6. Our heritage\nEnvironmental Studies (Social Studies), Class IV\n1. India: physical divisions\n2. India: resources\n3. India: transport and communication\n4. The people of India\n5. Indian heritage I\n6. Indian heritage II\n7. Our freedom struggle\nEnvironmental Studies (Social Studies), Class V\n1. The globe and map of the world\n2. India and neighbouring countries\n3. Our shrinking world\n4. How we govern ourselves\n5. The United Nations\n6. The changing world\nHistory, Class VI, Ancient India\nClass VII, Medieval India\nClass VIII, Modern India\nClass IX and X, History of Mankind\nHistory syllabus suggested by NCERT\nClass VI, Ancient India\nClass VII, Medieval India\nClass VIII, Modern India\nClass IX and X, History of Mankind\n22 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nClass XI, Ancient India and Early Medieval India\nClass XII, Modern India and Contemporary World\n2.3 (B) Different Approaches in arrangement of content in history\nAbove mentioned theories i.e., cultural epoch theory, biographical approach and psychological\ntheory are useful for the selection of subject matter in history syllabus for different stages. No\ntheory is by itself is complete or satisfactory though it may be valuable for focusing our attention\non certain aspects of the problem. In addition to all these theories there are a number of\napproaches that can also be used for organizing the subject matter of history which are briefly\ndiscussed below.\n2.3.1 Topical Approach\nTopical approach suggests dividing the history course into small units called topics, each topic\nrepresenting an idea or a particular movement in history. These topics are generally selected on\nthe basis of their suitability for the age, ability and interest of children. According to Professor\nWalsh, “when two or more events can be shown to be expressing the same purpose or policy,\nthen the historian demonstrates the relationship. Topics in teaching consist in taking a group of\nevents so related and teaching them as a group. Each topic or group contains several events, but\nthey are logically and intelligently related as being part of the same movement or policy. The\nessential difference with line of development is that its basis of grouping is an institution or\naspect of life, and secondly that the group is dealt with in isolation throughout the whole\nchronological period of the syllabus. With topics, the basis of grouping is a policy; it may be of\nlong or short duration; it may contain several events or only two; it is essentially an empirical\ngrouping.”\nThis approach is quite worthwhile for secondary and higher secondary classes. A careful and\ndetailed study of the topics provides opportunities to the students for an intensive study of a\nparticular problem. In this case instead of repeating the content a number of times, we can\ndiscuss all the aspects of a problem, once.\nAdvantages of Topical Approach\n1. Topical approach allows a comprehensive treatment of the subject-matter from different\nangles.\n2. It can be adopted according to the age, ability, and aptitude of the children.\n3. This approach is quite worthwhile as it allows the teacher to organize his teaching around\nactivities and projects. It enables the teacher to control the subject matter he may adapt it\nto the varying needs of the children.\n4. Unnecessary details of historical dates and events can be eliminated. Only significant and\nmeaningful subject-matter is provided.\n23 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n5. Chronological method of the organization of facts is only possible through topical\napproach.\nLimitations of Topical Approach\n1. It lays more emphasis on the social aspect of history and neglects other aspects of human\nlife.\n2. This approach does not put emphasis on interrelationships of events in a given period.\n3. If the topical approach is used, a large time chart of all the basic themes should be used\nconstantly.\n2.3.2 Chronological Approach\nThis approach spreads the whole course of history over the entire period of school instruction.\nContents are taught in a chronological sequence year by year. In other words, the whole course\nof history is divided into certain marked stages called periods which have to be taught in\nchronological order. The ground once covered is never repeated. Indian history, for instance, can\nbe divided into the Ancient, the Medieval, the Mughal, and the British period. Chronology helps\nto show how an event, a movement, a custom or an institution has developed into its present\nform. The idea behind this approach is that sections of history conform to the stages of mental\ndevelopment of man.\nAdvantages of Chronological Approach\n1. This approach helps the student to see the natural development of the history of a\nparticular country.\n2. In the successive years of school instruction, pupils are introduced to new periods-periods\nefflorescent with new problems- and their interest in the subject is sustained. Every time\na fresh ground is covered and there is no room for dullness and monotony to set in the\nprocess of instruction.\n3. The students get a clear idea of the time factor in history.\n4. The treatment provides an intensive study of the topic which lends itself to the use of\ninteresting details.\nLimitations of Chronological Approach\n1. This approach is against the principles of psychology of teaching. If history is divided\ninto periods, then it may happen that one period may be simple and the other may be very\ncomplex. Taking them chronologically it is just possible that we may take the complex\nfirst and the simple later which would be a serious violation of the teaching maxim-\nsimple to complex.\n2. Since history is not repeated under this arrangement, students are likely to forget a period\nwhich was studied at an earlier stage.\n24 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3. Under the chronological arrangement, a comprehensive treatment is not possible at every\nstage as the students do not possess the necessary comprehensive power to assimilate\nfacts, events or principles.\n4. Early school leavers or drop-outs fail to have an adequate knowledge of history of their\ncountry.\n5. The strict adherence to chronology breaks up a topic into too many fragments and makes\nit difficult to understand.\n6. The order of occurrence of events is the only principle followed for selecting material.\nThere are no theories around which facts are grouped. It becomes difficult to give the\npupils a sense of purpose or direction. The pupil does not work for anything except for\ncompleting the chapter.\n2.3.3 Concentric Approach\nThe concentric approach was initiated by Pestalozzi. Under this approach the prescribed course\nof history is taught again and again with increasing fullness in every successive class, each time\ngiving more and more details. The entire matter of history is taught every year, but the outline\nremains the same. Every year only the outline will be made detailed and addition will be made in\nit. In this way, the topics of knowledge remain the same, but the dimensions of knowledge keep\non multiplying.\nAn extreme illustration of this approach is the teaching of history in pre-independence era. A\nfull seven year course of history was divided into three stages. During the first three years, a\ngeneral outline of the whole course was covered. In the next two years the same course was\nrepeated with additional details. This was again repeated at the third stage in two years with the\naddition of still more details.\nThe concentric approach is nothing but devising a strategy that fosters continuous, unbroken\nlearning of the subject matter of history through the elementary and secondary stages.\nAdvantages of Concentric Approach\n1. It is based on the principles of ‘simple to complex’, ‘general to specific’.\n2. It postulates that repetition makes learning effective.\nLimitations of Concentric Approach\n1. Repetition of the subject matter is likely to make lessons dull and students feel little\ninterest in learning the same facts again and again.\n2. Pupils develop a sense of familiarity without the fullness of knowledge. Thus students\nfail to develop the actual sense of time and age. It becomes difficult for them to\nunderstand characteristics of time and different characters.\n25 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3. Full treatment of historical facts under this arrangement will be difficult as the entire\ncourse of history has to be gone through within the comparatively short period of a year\nor two.\n2.3.4 Regressive Approach\nThe famous educational maxim, “go from the known and the familiar to unknown and the\nunfamiliar” lends support to this approach. Here we start from the present and work backwards.\nThe past is studied as an outgrowth of the present. The teacher chooses a certain vital social or\neconomic problem of today as a starting point or introduction, goes back to the origin of the\nproblem in the remote past, again comes back to the period that immediately concerns him. Thus\nthe teacher regresses to come forward again. We follow a chronological order in this treatment,\nbut in the reverse direction. Present is studied in the light of the past. This approach impresses on\nthe child’s mind, the essential connection between the present and the past by bringing out the\ntruth that the present is only an evolution of the past.\nAdvantages of Regressive Approach\n1. It emphasizes the true nature of history, that is, the present is more important to history\nthan the past.\n2. This arrangement enables the child to develop a better intelligent outlook on some of the\nfamiliar features of modern life.\n3. Self activity on the part of the students is enlisted as they study the present events.\nLimitations of Regressive Approach\n1. This approach completely reverses the chronological order which is the very soul of\nhistory.\n2. The regressive approach cannot do justice to the study of the enriching aspects of history\nenshrined in arts and literature.\n3. Problems of today may be discussed without a reference to the past and thus we are likely\nto ignore the past.\n4. This approach demands too much from pupils. A liberal and correlated knowledge of the\nsocial sciences is needed to understand a contemporary problem. The young learner is not\nexpected to posses such a fund of knowledge and in this manner.\nSelf Assessment Questions\n1) Discuss the limitations of Topical Approach.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n2) Describe the advantages of Chronological Approach.\n………………………………………………………………………………………………\n26 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n………………………………………………………………………………………………\n……………………………………………………………………………………………....\n3) Explain the importance of Concentric Approach in arrangement of content in history.\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n4) What are the limitations of Regressive Approach?\n………………………………………………………………………………………………\n………………………………………………………………………………………………\n……………………………………………………………………………………………….\n2.4 Summary\nA good curriculum for a particular class is the one which is convenient, well-planned,\nappropriate, presenting and sensible and have orderly appearance. History curriculum should\nbe selected on the basis of the principles of achieving aims of teaching history, appropriate to\nthe age and ability of pupils, functional relationship between the contents, wide and\ncomprehensive curriculum, emphasis on national and world history, concentration and\ncorrelation and integration with the daily lives of the common man.\nTheories for selecting subject matter for different stages are the Cultural Epoch Theory of\nStanley Hall, Carlyle’s Biographical Approach and the Psychological Theory. Content in\nhistory can also be organised using the Topical approach, Chronological approach,\nConcentric approach and Regressive approach.\nIshwar Bhai Patel Committee and NCERT have recommended syllabi for different classes\ntaking into consideration the different principles, theories,approaches and methods.\n2.5 Unit End Questions\n1) What principles would you bear in mind while framing curriculum in history?\n2) Distinguish between Concentric and Chronological approaches of organizing history\nsyllabus clearly bringing out the comparison between the two.\n3) Discuss the merits and limitations of different theories for the selection of the subject\nmatter for different stages.\n4) Discuss the advantages and limitations of Topical and Regressive approaches of\norganizing the content of history.\n5) Suggest suitable guidelines for organizing curriculum in history.\n27 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n2.6 Suggested Readings\nChaudhry, K.P., Contents of History in Indian schools, New Delhi: Ministry of Education,\nGovernment of India, 1953;\nJohnson,H., An Introduction to the History of Social Sciences in Schools, New York;\nmacmillan, 1932;\nMinistry of Education and Social Welfare, Government of India Report of the Review\nCommittee on the curriculum for the Ten-Year School, New Delhi, 1977;\nNational Council of Educational research and Training, The Curriculum for the Ten-Year\nSchool, New Delhi, 1975;\nPierce, B.L., Some Aspects of Social Studies in the Schools. Washington, D.C.: First Year\nBook of the National Council for the Social Studies, 1931;\nWilson, H.E.,The Social Studies Curriculum in the schools, Washington, D.C.: Fourth Year\nBook,1934.\n28 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nUNIT III\nUNIT STRUCTURE\n3.0 Objectives\n3.1 Introduction\n3.2 Narration cum Discussion Method\n3.3 Project Method\n3.4 Dramatization\n3.5 Source Method\n3.6 Let us sum up\n3.0) Objectives\nAfter reading this unit you will able to:\n State different methods of teaching history\n Describe the procedure of narration cum discussion method\n Explain the concept of project method\n Describe the steps of project method\n Explain the importance of dramatization technique in teaching history.\n Describe the source method of teaching history.\n3.1) Introduction\nCorrect history teaching means not only providing the pupil a background of historical\nknowledge but also an insight into the meaning and significance of history and the ability to\ncontinue his studies for himself.\n29 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n-T.S. Meheta-\nThe Secondary Education commission has rightly observed that “Even the best curriculum and\nthe most perfect syllabus remain dead unless quickened into life by the right methods of teaching\nby the right kinds of teachers.\nThere is no single method to successful teaching. The choice of a suitable method by a teacher\ndepends upon many factors such as the learner, the nature of the subjects ,the facilities available\nand above all the attitude of the teacher.\nA method of teaching arises out of the needs of the learner and learning situations. Therefore\nthe same methods of teaching can not be same for all time and all situations. Even it can not be\nsame for all teachers and all subjects.\nTraditionally when we talk about methods of teaching we mean that what a teacher does in the\nclass room to teach the students. But now the scene is totally changed. Methods of teaching are\nnow associated with the learning activities of the students. For Example discussion method,\nproject method, Laboratory method, source method, constructive approach, Inductive method,\ndeductive method, co operative learning, communicative approach, narration, dramatization,\nstorytelling method etc. So these are various methods, approaches and techniques use for\nteaching. The role of teacher is to select his own method of teaching according to his subject and\nstudents. There is no method which is universally applicable. In this unit we will discuss various\nmethods which are used in teaching of history.\n3.2 Narration cum Discussion method.\nYou know teaching should be a two way process in order to be successful. So the narration\nmethod & storey telling methods are not fulfilling this objective. Students are not getting\nopportunities to actively participate in this process of teaching. But this cannot be totally\nrevamped from our teaching process. Therefore the narration cum discussion method originated\nwhich will be more beneficial than only individual methods of teaching.\nThe narration cum discussion method provides dual benefits of listening to teacher as well as\nparticipation of students. This method provides adequate scope for student’s participation in the\nselection of topic or problem presenting ideas, analyzing ideas through exchange of ideas and\ntaking decision with suitable support material. Discussion is almost equally shared by pupils and\nteachers.\n30 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nOn the whole, truth is searched and conclusions are drawn through free exchange of opinions.\nNarration cum discussion is a group activity and a process of collective decision making.\n3.2.1 Steps and procedures\nTeaching of History through this method calls for systematic planning. The entire\nteaching – learning process is carried on mainly through three steps (1) Preparation (ii) Conduct\nof discussion and (iii) Evaluation.\n1.\nPreparation\nIt is an important step in planning. The topic must be carefully selected and the teacher\nmust be confident of the details of the theme. Points to be discussed should be informed to\nstudents earlier. The topic and questions may be written on the black board for this\npurpose. Both the teacher and students should be prepared for taking active part in the\ndiscussion.\nII. Conduct of Discussion\nThis steps is the most significant part of teaching; it includes arrangement of seats,\nmaintenance of discipline, initiation and presentation of the topic, students participation in a\nreleased, free and informal atmosphere. All students should be encouraged to participate in the\ndiscussion and express their own points of view without any hesitation and reservation. Such\ndiscussion will be a process of loud, as well as silent thinking, it is an experience in cooperation,\nnot in competition.\nIII. Evaluation\nThis steps on discussion and narration aims at providing information, facts figures,\nremoving doubts and difficulties, changing attitudes, developing interests and good qualities that\nare necessary for effective citizenship. All these objectives are evaluated at this stage and\nmeasures are taken for making up the deficiencies, if any.\nRole of Teacher\nThe teacher has to play an important role in this teaching – learning process. He has to take\ninitiative and all the steps that are found necessary for encouraging student’s participation.\nSuccess of this method largely depends on the better qualification, wide knowledge, varied skills,\nample resourcefullness and favourable attitude of the teacher. The teacher has to direct all the\nactivities of the class and co-ordinate their opinions and views express there on the topic. He has\nto bring about solution of the problems faced and truth out of all controversial arguments and\ncounter arguments. He is required to play the role of a director or manger of the whole show and\ntake all the steps for ensuring realization of learning objectives.\n31 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3.2.3 Advantages\n1) This method of teaching is very suitable for higher classes.\n2) It discourages rote– learning and encourages understanding and\ncritical thinking\n3) It enables students to discover facts, collect relevant\ninformation and clarify doubts.\n4) It promotes academic work through joint and cooperative efforts.\n5) It facilitates pupil’s participation and individual initiative.\n6) It enables the teacher to identify potentiality of the students and\nprovide favourable scope for its development.\n7) It enhances attentiveness, interest speaking, capacity and self –\nevaluation.\n3.2.4 Limitations\n1) This method is not effective for junior class students.\n2) It calls for immense earlier planning and preparation, which\nmost of the teacher do not afford.\n3) Without proper control & co-ordination over the discussion, it\nwill be difficult to arrive at conclusion and may lead to wastage\nof time and energy.\nStudents gain sufficient knowledge through narration. The main aim of narration is to provide\nknowledge to students of indirect things where as discussion is an educational group activity in\nwhich teacher and the students talk over some topic. Narration cum discussion method provides\nknowledge about a problem or topic in which the students are actively involved and clarified\nabout the topic.\n32 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nCheck your progress\nQ. 1 What are the steps of narration cum discussion method?\nQ. 2 Explain the merits and limitations of narration cum discussion\nmethod?\n3.3 Project Method\nOrigin and Significance\nProject method is a natural, whole-hearted, problem solving and purposeful activity carried to\ncompletion in a social environment. It is the practical outcome of the pragmatic educational\nphilosophy of John Dewey, a well-known American philosopher and educationist. It was\ndeveloped and perfected by William Kilpatrick of the University of Columbia. It is a revolt\nagainst the traditional, bookish and passive environment of the school wherein children as\nobedient masses are carefully drilled and spoon-fed with unrelated and disconnected facts,\nwatertight compartments and pigeon hole time-tables.\nDefinition of the Project\n1. Ballard: A project is a bit of real that has been imported into the school.\n2. Burton: The problem is a project which results is doing. The motor element is not what makes\nthe activity a project, but the problem solving of a practical nature accompanying the activity.\n3. J.A. Stevenson: A project is a problematic act carried to completion in its natural setting.\n4. Snedden: Project is a unit of educative work in which the most prominent feature is some form\nof positive and concrete achievement.\n5. W.W. Charters: In the topical organisation principles are learned first while in the projects the\nproblems are proposed which demand in the solution the development of principles by the\nlearner as needed.\nCharacteristics of a project:\nA project has the following characteristics\n1. Problematic act.\n2. Purposeful activity.\n3. Whole-hearted activity.\n33 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4. Activity in a natural setting.\n5. Activity in a social environment.\n6. Bit of real life introduced in school.\n7. Problem solving of a practical nature.\n8. Positive and concrete achievement.\n9. Activity through which solutions of various problems are found out.\n3.3.1 Principles of Project method\nIn project method one should follow the following principles:\n1. The principle of purpose: Knowledge of purpose is a great stimulus and motivates the\nchild to realize his goal. The chid must have an idea ‘why is he doing certain things?’\nPurpose motivates learning. Interest cannot be aroused by aimless and meaningless\nactivities.\n2. The principle of activity: Children are active by nature. They love activity. The instincts\nof curiosity, construction, pugnacity and herd make them active by nature and learn\nthings by doing. Physical as well as mental activities are to be provided to them.\n3. The principle of Experience: Experience is the best teacher. What is real must be\nexperienced. The children learn new facts and information through experience.\n4. The principle of Social experience: The child is a social being and we have to prepare\nhim for social life. Training for a corporate life must be given to him in his childhood. In\nthe project method, the child works in groups. The project method is a method of\neducating the child and therefore it must also be real. Real life situations should be\npresented in the life of the school.\n5. The principle of freedom: The desire for an activity must be spontaneous and not forced\nby the teacher. The child should be free from imposition, restrictions or obstructions so\nthat he may express himself fully and freely.\n6. The principle of reality: Human life is itself a big project. Since education is a\npreparation for life, we must create real life situations in the school. In Project Method\nthe pupils are provided with opportunities to exercise their powers in real life situations.\nHence, they feel genuinely interested in such activities.\n7. The principle of utility: The knowledge gained through activity must be useful and\npractical. Experiences obtained through projects ensure utility because they are carried\nout under natural conditions. As the method gives useful training and full satisfaction to\npupils they feel that their efforts have not gone wasted because their activity must end in\nsomething concrete which is useful from educational point of view.\n34 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3.3.2 Steps in the Project Method:\nThe teacher & students should follow the following steps in the project method.\n1. Providing a situation: A project should not be forced upon pupils. The teacher should\nprovide a situation according to the interest and aptitude of the pupils which may give them a\nspontaneous urge to carry it out .Situation may be provided by conversation on different topics,\ndiscussions on pictures, buildings or cities, by telling stories or taking out children on excursions\nand educational tours and trips.\n2. Choosing a Project: Only such a project should be selected as may satisfy some real need of\nthe pupils and is for the good of all of them. They must feel that the project is their own. In the\nwords of Dr. Kilpatrick, “The part of the pupils and the part of the teacher in most of school\nwork depends largely on who does the purposing. It is particularly the whole thing.” The project\nmust be chosen according to the capacities of pupils and the expenses involved.\n3. Planning: After a good deal of discussion planning is to be done by the pupils under the\nguidance of the teacher, who offer suggestions. The entire plan should be put in black and white\nby the pupils in their project book before working on that plan.\n4. Executing: Now teacher should encourage the pupils to put it into practice. He should ask the\npupils to assign duties and distribute work among themselves, according to their individual\ninterests and capacity. Each child must be given some work to do, for the successful completion\nof the project. They should be asked to work in cooperation with one another till the project is\ncomplete.\n5. Judging or Evaluating: After the completion of the project, the students should be asked to\nreview their work. They should note down their mistakes, if any, and see whether they had\nproceeded, according to the plan. It is sort of self-criticism which is a very important form of\ntraining and should never be neglected.\n5. Recording: The pupils should maintain a project-book to put down a complete record of\nall the activities, connected with the project. This record will include the choice of the\nproject, its planning, discussions held, duties assigned, references and books consulted,\ninformation gathered, difficulties felt, experiences gained, guidance sought etc. Important\npoints for future reference and guidance are also to be noted down.\n\\\n35 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nCharacteristics of a Successful Project:\n1) Usefulness: It must be individually and socially valuable and must have a practical aim.\n2) Maximum Activities: It should provide activities of various types suitable to pupils\nundertaking the project. It should be able to draw the best from them.\n3) Availability of Resources: The material connected with the project, should be readily\navailable in or in the neighborhood of the school. The pupils should be able to handle it\nwithout difficulty.\n4) Economy: The project should give the best of results in the shortest possible time and\nwith the least possible expense. It should not be expensive.\n5) Best Experience: The project must fulfill some educational purpose. It should provide\nexperiences of a very high standard, including social.\n3.3.4. Example of Project in History\nA Unlimited number of projects may be used in teaching history including field trips, school\nelections, making card-board, clay or wood models of various objects, writing play based upon a\nperiod of history, preparing scripts for radio programmes, writing a song or a poem inspired by a\nhistorical event, dramatizing events, making displays for the bulletin board, preparing pageants,\narranging community surveys and starting a collection of old coins, stamps, specimens and other\nsuch things for the scrap-books and for the school museum.\n3.3.5 Advantages of Project Method.\n1) Based on the laws of learning: Project method works in accordance with the\npsychological laws of learning, such as the law of readiness, the law of exercise and the\nlaw of effect.\ni. The law of readiness: It requires the child’s mind to be ready for acquiring knowledge.\nThe planning and selection of the project, prepares the child’s mind for the work, he is\nabout to do.\nii. The law of exercise: It requires the child to practice what he has learnt.\niii. The law of effect: It requires that learning should be accompanied by happiness and\nsatisfaction.\n36 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n2) Learning by living: Project method is based not only on learning by doing but also on\nlearning by living. The actual doing of things gives effective knowledge. By actually\ndoing and achieving things in the project, the child gets pleasure and satisfaction. All this\nmakes the study of history interesting and effective.\n3) Economical: As the project is of the children’s own choice and interest, it is completed\nspeedily. It gives best of results in the shortest possible time and with the least of\nwastage of money and energy.\n4) Training for democratic way of life: As the pupils work in co-operation with one\nanother for a common purpose they acquire foresight, power of judgment, independence\nof thought and action, initiative, responsibility, resourcefulness, tolerance, self respect,\netc. These useful social habits lead to real training in citizenship and a democratic way of\nlife.\n5) Dignity of labour: Project upholds the dignity of labour as pupils are required to do all\ntypes of work with their own hand, including manual work.\n6) Correlation: Knowledge gained as a whole in its natural setting. All the subjects are\ncorrelated and there is no isolation of learning in water-tight compartments.\n7) Education according to real conditions of life: The projects are related to everyday\nneeds and experiences of the child. As various subjects are taught to the extent, they are\napplicable in practical life knowledge gained is real, practical and useful, leading to the\nformation of proper habits and attitudes.\n8) No cramming and memory work: Learning is effective as it does not come as the\nfinished thought-product of the teacher. It comes as a by-product of useful activity.\nChildren learn by doing things themselves. They learn the problem solving attitude and\nexercise thinking and reasoning power.\n9) Arousing individual interests and skills: Project activities have very broad range.\nEvery pupil finds a challenge somewhere for himself.\n10)Individual learning: As the project is pursued by the pupil a lot of incidental\nlearning takes places. To attain fair accuracy and success in the project, the pupils seek\nanswers and solutions to many questions and problems which are covered in a text book.\n3.3.6 Limitations of Project methods.\n1) Expensive: For its successful completion project requires a lot of material, which may\nnot be easily available locally. Therefore, ordinary schools cannot afford to adopt this\nmethod as they are not in a position to spend so much project requires a lot of money\nmaterial and time, which can be seldom snatch out of busy school programme.\n2) Haphazard and scrappy knowledge: The project method disturbs the essential logical and\nchronological arrangement of teaching history. Lose ends of knowledge are left here and\nthere, if work in different subjects is done according to this plan. Certain portions of the\nsubjects do not come into the project at all. Therefore, this method may be taken up only\noccasionally.\n37 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3) Too much strain on the teacher: Project method expects too much from the teacher. Every\nteacher cannot be efficient in all subjects, nor as intelligent and resourceful as to suggest\nsuitable projects and impart knowledge through them in a correlated manner.\n4) Lack of suitable text books: Suitable text books of history written on project method\nlines are also not available. This adds to the difficulties of the teacher.\n5) Disrupting school work: lf the school is to be run on project method is not possible to\nfollow any fixed time table. In the absence of any fixed curriculum, the prescribed\nsyllabus in various subjects is seldom finished in time. It is possible only if usual\nprocedure of teaching is followed.\n6) No Balanced learning for all pupils: Some more developed and capable children are\ninclined to take all the responsibility upon them. Keeping others in the background they\nwant to do all the work. This provides ample opportunities to students to look on and do\nvery little. All the pupils are expected to engage themselves in activities with equal\nseriousness and zeal.\n3.3.7 Suggestions for use.\nHowever, most of the disadvantages of project method would disappear, when modem\nconcepts are accepted. Pupil’s growth and development are much more important in the\neducational process than the memorisation of facts, forgotten too soon. In the project\nprocedure, pupil’s co-operation in planning and execution is almost secured. Both the\nindividual and the group enjoy an immeasurable satisfaction and pleasure, at the\nsuccessful conclusion of the project. If utilized in accordance with class desires and\nteacher’s aptitude and interest, this method gives excellent results. However, method is\nnot an educational panacea. The projects are rich in possibilities for teaching only when\ncombined with direct learning. Systematic study, demonstration experiments and\ndiscussion on development of subject-matter. It should be used as a supplement to\nclassroom teaching. The projects may be carried on for half the day and for the\nremaining half, there may be class-teaching in essential subjects. Home projects may be\ngiven to individual students or groups of students, living in the neighbourhood. The\nteacher may complete the first two steps and the last step in the class. Execution may be\ndone at home.\n3.4 Dramatization\nDramatization has been described as ‘a synthetic art’, involving the purposive coordination and\ncontrol of the delicate organs of speech and muscles of the body combined with a sense of\nrhythm, with a view to free and intelligent expression of emotions and ideas.\n38 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nDramatization is one of the most important tools in the teaching of history. It is not only a co-\ncurricular activity but also a very useful teaching device. The introduction of this device in\nteaching is useful due to the following reason.\n1. Gives Reality and Concreteness to the Learning Situation\nIt makes the abstract ideas concrete and real. The story of Rana Pratap told verbally does not\nmake such a lasting effect on the mind as when it is presented to them in the form of a living\ndrama. In that case, a Rana suffering and sacrificing, struggling and striving for a very high ideal\nis just before the pupils and his every action is concrete and real.\n2. Serves as an Audio-Visual Aid\nt\nA drama is just like an audio-visual aid. The learners visua lize the learning situations and hear\nabout it at the same time. As many sense organs cocperate in receiving the impression, therefore,\nthe effects are deep and lasting.\n3. Selected Learning Situations\nA drama in teaching presents selected learning situations which are more valuable than ordinary\nepisodes which we see every day. The life in itself is a drama and all the people around us are\nactors in this big play. But all the actors in this drama may not have an educative value for\nchildren while some of them are definitely undesirable in their effects. But in our planned\neducational dramas we present the most desirable things only.\n4. Concentrated Effect\nThe movements in a drama are very quick. Something good of the whole life of somebody may\nbe put before the audience in a short time of three hours. Good things come swiftly one after the\nother in a concentrated form and therefore the effects are also very quick and deep.\n5. Opportunity of Expression\nThe urge of expression is very strong in childhood and even\nafterwards. Dramatization offers opportunity to the children for this purpose.\n6. Training of Organization\nChildren organise such activities themselves and therefore they\nare trained in the traits of leadership and responsibility.\n39 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n7. Development of Social Virtues\nChildren learn to co-operate and work for others in such\nactivities.\n8. Motivations for learning\nChildren are motivated to learn effectively. They prepare their own parts allowed to them\nin the drama thoroughly. They study the parts of others also to be able to give continuity to\nthe story. In this way. every actor prepares the whole study thoroughly. On the other\nhands, the audience also hear and try to understand everything spoken with a great interest.\n9.A Boon for the Withdrawan\nDramatization is a boon for the shy and withdrawn child. He gets opportunities to come up and\nto overcome his feelings of inferiority.\nKinds of dramatization\nVarious types of drama can be played ranging from simple action to well rehearsed full length\nplay.These forms of drama are:\nFull length play\nThe Pantomine\nThe Pageant\nThe Tableau\nPuppetry\nAdvantages:\nAdvantages-\n1)Dramatic art affords innumerable opportunities for the correlation of a large number of\nsubjects.\n2)In the preparation of roles the students indirectly and unconsciously improve their speech\nhabits and language.\n3. A systematic study of historical events is made when pageants of the life of great persons are\nprepared i.e. pageant on the life of\nBuddha, Chandragupta, Vikramaditya, Gandhiji, etc.\n40 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4. Preparing costumes suiting different ages, thus, children come to know about the dresses of\nthe people during different periods of history.\n5. Dramatics add to the geographical knowledge of the students.\n6. Carpentry and other mechanical arts facilitate the work of construction of the stage.\n7. Dance and music add to the beauty of a drama.\n8. Drama has great social value. It is a cooperative enterprise and develops qualities of\ncooperation and social understanding. It helps in fostering spirit of cooperation among the\nstudents, In various school functions dramas form the chief items of the programme. Every\nstudent works to the best of his capacity for the honour of the school. Dramatics afford the\nstudents many opportunities for training in team work.\n9. They are very helpful in providing the students with opportunities for the release of the\ninhibitions to which they are subjected by the conventions of society.\n10. Students of diverse aptitudes get chances to choose items for which they are best suited and\nsatisfy their urges, e.g., self-expression through the various activities of a drama.\nConditions for Success\n1. Rehearsals: A number of rehearsals bring grace and success to the play when it is staged.\nPupils should prepare as much stage material as they can.\n2. Roles: Children should be encouraged to write their own plays. The usual participants in this\nactivity should be given opportunities to play different roles. The same pupils as far as possible\nshould, however, not be allowed to play the role of a villian.\n3. Selection of play: (i) Plays should depict the evils of the social customs.\n(ii) They should have a literary value. (iii) The students should be able to understand and\nappreciate the play. (iv)It should also have entertainment value. (v) It should be free from\nobjectional subject-matter (vi)There should be novelty in the play.\n3.5 Source Method\nThe study and use of original material and original sources called the Source Method of teaching\nand learning give a much better understanding of history than any other method.\n41 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n3.5.1 Classification of sources according to traces.\nHistorical sources are “traces” left behind in the past. A historian tries to construct a systematic\naccount of the past event with the help of historical sources classified as follows:\n1. Archaeological sources\n2. Literary sources\n3. Oral tradition.\n1. Archaeological Sources:\n(i) Monumental Finds: Building images pottery and terracotta figures and other antiquities are\nmonumental finds. Ancient buildings, sculptures, paintings, potteries and terracotta figures,\nthrow light on the type of civilization of the period, to which they belong. The Archaeological\nDepartment of the Govt. of India has excavated a large number of sites at various places in India,\nwhich provide considerable material of historical value. With the help of this material, the\nhistorians have reconstructed the history of ancient and medieval India.\n(ii) Epigraphics: India is very rich in such authentic sources. Consisting of inscription of stones,\npillars, rocks, copper-plates bricks, seals, terracotta and images. Epigraphic give us concrete\nevidence for the various phases of Indian history.\n(iii) Numismatics: Old coins are very helpful in constructing ancient history. The extent of the\nkingdoms of particular ancient Indian kings, the length of their regions and the succession of\ndifferent rulers of the same dynasty, are known through these sources. Coins also throw light on\nthe economic and religious conditions of their times. They also illustrate political and\ncommercial relations with neighbours in the past.\n2. Literary Sources: These are as follows:\n(i) Sacred or religious literature: In India this includes the four Vedas describing\nsocial and political life of the Indo-Aryans. The Kalpasutras are manuals of rituals\nthrowing light on the development of sciences of Geometry and Architecture in\nancient India. The Ramayana and Mahabharata and the’ Puranas throw light on\nthe social and political conditions of the Aryans settled in nonhein India as well as\nthe history of several dynasties. The saced literaiui e includes the Tripitakas, the\nBuddhist and the Jam canonical literature.\n(ii) Secular literature: It includes novels, dramas, poems, books on medicine,\ngrammar and astronomy, biographies ,autobiographies, travellers, accounts,\npersonal diaries and official orders and despatches. Indian examples are\nShakuntala of Kalidasa, Mudra Rakshasa of Visakhadatta, Artha-shastra of\n42 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nKautilya, Ashtadhyayi of Panini, Babar Nama of Babar, Tuzak-i-Jahangir; of\nJalfangir, Akbar Nama of Abul Fazal, Queen’s Proclamation of 1858 and official\ndespatches of various Governors and Viceroys, treatise and official reports.\n(iii) Foreign Accounts:The accounts of foreign travellers to India include the\naccounts of Greek writers like Herodotus, Nearchus and Megasthenese, the\nChinese pilgrims like Fa-hien, Hieun Tsang and Itsing and the Arab scholar,\nAlberuni. These form an important source of Indian history.\n3. Oral Tradition: The noble deeds and heroic exploits of local heroes may not be mentioned in\na general history of India but they live on in the oral form. Tod’s Annals of Rajasthan, are mostly\nbased on the local tradition. For the reconstruction of the earliest history of India, one has to\ndepend on the tradition of the ancient tribal people found only in oral form.\nClassification of Primary and Secondary Sources according to data\n1. Primary sources: Also called original sources these include primary data, the accounts\nprepared by persons directly connected with an event or the eye-witnesses to it, like official\norders, treaties, laws, autobiographies and personal memories.\n2. Secondary sources: Known as secondary data these are prepared by those persons who were\nnot directly connected with the actual happening but -who prepared their accounts with the help\nof eye-witnesses, like standard historical works, based on original accounts. The teacher should\nselect and use them very carefully for class-room purposes. As some of these might have been\nbased on personal prejudices or bias. He should use only reliable and\nauthentic sources.\n3.5.2. .Methods of Utilising Sources.\n1 Demonstration: A teacher can best convince his pupil’s sources by giving a demonstration of\nhow to utilise. By reading a particular passage from the original source, supporting or illustrating\nhis point or throwing additional light on his opinion he should make it clear to his pupils that\nsource material is to be employed at appropriate times. This will motivate his pupils to go\nthrough some such sources for clarifying certain controversial issues or for arriving at truth about\na certain point.\n3. Assigned reading: The teacher can introduce the use of source by assigning selected\npassages to be read by selected students, selected passages should be interesting and\nimmediately connected with the topic in hand.\n43 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4. Problem solving: Problems can best be solved with the help of sources. The pupils\ndiscover and correct errors in the text-books and in other secondary accounts if any.\nThus, sources can be utilized in the beginning of the lesson, during the course of the lesson as\nwell as after finishing the lesson. Certain useful extracts from the original or secondary sources\nmay be selected for introducing or developing the lesson. Students may also be asked to write\nanswers to some questions, based on those sources. The main aim is to help students to cultivate\na proper skill for their use and to develop the habit of self-study.\n3.5.3. Difficulties in utilizing original sources\n1. Sources of real value are not available: In India original sources of real worth, suitable\nespecially for school students, are too scanty and too disjoined. Efforts have not been made to\nedit and compile source books, suitable for school students.\n2. Difficulty of language: Almost all the original sources of historical or cultural value are in\nforeign languages. School children cannot be expected to deal with long passages in English,\nSanskrit, Pali, Arabic or Persian, the languages in which most of the original sources are\navailable. Relevant and short extracts from contemporary documents in the pupils’ mother\ntongue alone serve the desired purpose and these are seldom available.\n3. Conflict among contemporary writers: Like all other writers, source writers also have their\nown prejudices, faults, preference and Limitations. According to their own points of view\nauthors of different sources give different account of events or movements during the same\nperiod. Lost in the maze of conflicting views about the same event or movement, the students\nfeel that they cannot solve all the problems through the source method.\n3.5.4. Advantages of Source Method\n1. Gathering reliable evidence: Students using source, realize the difference between a guess\nand assertion, between the exact words, spoken or written by a person and what someone else\nhas said about that person’s statements. Thus, they gather reliable evidence.\n2. A sense of reality: The use of sources gives a sense of reality if properly handled and utilized.\nSource accounts enrich and supplement the text book account.\n3. Training in reasoning and judgment: The use of source develops one’s critical faculty of\nreading, thinking, reasoning and judgment. It teaches a person to examine carefully before\narriving at final decision. Its application can be transferred profitably to other situations in one’s\nlife.\n44 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4. Functional Knowledge: Learning become interesting and functional in this method.\nDramatization is one of the most important tools in the teaching of history. It is not only a co-\ncurricular activity but also a very useful teaching device. The introduction of this device in\nteaching is useful due to the following reason.\n1. Gives Reality and Concreteness to the Learning Situation\nIt makes the abstract ideas concrete and real. The story of Rana Pratap told verbally does not\nmake such a lasting effect on the mind as when it is presented to them in the form of a living\ndrama. In that case, a Rana suffering and sacrificing, struggling and striving for a very high ideal\nis just before the pupils and his every action is concrete and real.\n2. Serves as an Audio-Visual Aid\nA drama is just like an audio-visual aid. The learners visua lize the learning situations and hear\nabout it at the same time. As many sense organs cocperate in receiving the impression, therefore,\nthe effects are deep and lasting.\n3. Selected Learning Situations\nA drama in teaching presents selected learning situations which are more valuable than ordinary\nepisodes which we see every day. The life in itself is a drama and all the people around us are\nactors in this big play. But all the actors in this drama may not have an educative value for\nchildren while some of them are definitely undesirable in their effects. But in our planned\neducational dramas we present the most desirable things only.\n4. Concentrated Effect\nThe movements in a drama are very quick. Something good of the whole life of somebody may\nbe put before the audience in a short time of three hours. Good things come swiftly one after the\nother in a concentrated form and therefore the effects are also very quick and deep.\n5. Opportunity of Expression\nThe urge of expression is very strong in childhood and even\nafterwards. Dramatization offers opportunity to the children for this purpose.\n6. Training of Organization\nChildren organise such activities themselves and therefore they are trained in the traits of\nleadership and responsibility.\n7. Development of Social Virtues\nChildren learn to co-operate and work for others in such activities.\n45 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n8. Motivations for learning\nChildren are motivated to learn effectively. They prepare their own parts allowed to them in\nthe drama thoroughly. They study the parts of others also to be able to give continuity to the\nstory. In this way. every actor prepares the whole study thoroughly. On the other hands, the\naudience also hear and try to understand everything spoken with a great interest.\n9.A Boon for the Withdrawan\nDramatization is a boon for the shy and withdrawn child. He gets opportunities to come up and\nto overcome his feelings of inferiority.\n3.6 Let us Sum up\nTeaching history means not only providing knowledge but to give an insight into the meaning\nand significance of history which will develop the ability of the students to study for himself.\nVarious methods and techniques for teaching history helps in this direction. In this unit we have\nstudied the following methods and techniques.\nNarration cum discussion method:\nThis method helps to make the descriptive material simple, smooth, clear and unambiguous. It\nprovides opportunity for exchange of ideas. It enhances attentiveness, interest, speaking capacity\nand self evaluation.\nProject Method: This method helps the students to learn by doing in the school environment.\nThe activity of the students has been given importance in this method. Pupils are active and\nlearning is joyful & interesting in this method if the proper procedures and steps discussed will\nbe guided and followed by the teacher and students.\nDramatisation: It is a technique used in the history teaching in the form of drama in which\nstudents enact scenes of history by dialogue & by wearing the dresses. This method helps the\nstudents to express their emotions and ideas freely and intelligently.\nSource Method: Pupil learns from the original materials by this method. The source may be\nprimary and secondary. Sources like monuments, coins, seals, religions, literature, foreign\naccounts, secular literature all comes under:-\n Archaeological Sources\n Literary sources and\n Oral tradition\nStudents get functional knowledge by this method.\n46 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nEvery method has its own merits and limitations. But we can minimize the limitations of any\nmethod by using a variety of methods in our teaching. The teaching can be interesting and lively\nby using various methods and technologies as per the level of the students.\nUnit End Questions:\n1. What is a Project? What steps you will follow to carry out a project.\n2. What is the value of utilizing original sources in teaching history? Explain the difficulties\nin following this method in teaching.\n3. Write Short Notes on:\na) Types of sources\nb) Merits of Narration cum Discussion method\nc) Characteristics of a project\nd) Conditions for success of a drams\ne) Principles of project method.\nBibliography\nDr. Bhatia R.L “Contemporary Teaching of History”,\n2004, Surjeet Publications, Delhi\nYadav Nirmal “Teaching of History”, 2004\nAmol Publications Pvt. Ltd, Delhi\nDr.Vibh Nigan\nDr. J.K. Verma “Teaching of History” 2009\nDr. Gursaran Das Tyagi Shri Vinod Pustak Mandir Agra\nS.D Khanna\nV.K Saxena “Teaching of History with\nT.P. Lamba lesson plans made easy” 2005\nV. Murthy Doaba House Delhi\n47 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nHistory method\nUNIT – IV\nModern Trends in History Teaching\nUNIT STRUCTURE:\n4.1 Introduction\n4.2 Objectives\n4.3 Critical Thinking\n4.3.1 Concept of Critical Thinking\n4.3.2 Need for Skill of Critical Thinking\n4.3.3 Strategies for Development of Critical Thinking\n4.3.4 Importance of Critical Thinking\n4.4 Using Sources\n4.4.1types of Sources\n4.4.2 Importance of Using Sources\n4.5 Teaching Correct Events\n4.5.1 Bias\n4.5.2 Overcoming Biases\n4.6 Developing International Understanding\n4.6.1 Concept of International Understanding\n4.6.2 Role of History in Developing International Understanding\n4.7 Teacher’s Guide Book\n4.7.1 Concept of Teacher’s Guide Book\n48 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4.7.2 Advantages\n4.8 Suggested Reading\n4.9 Questions\n4.1 INTRODUCTION\nThere is no doubt that the role of education is undergoing one of its most significant changes in\nrecent history. Social studies have to play a significant role in development of young minds\ncapable to live intelligently. The future role of teachers is rapidly changing from providers to\nmoderators of knowledge. The changes in the field of education directed in use of different\nstrategies in teaching history.\n4.2 OBJECTIVES\nAfter learning this unit you will able to-\n Understand concept and need of critical thinking\n Realise the strategies for developing critical thinking\n Identify different type of sources and its importance in teaching history\n Identify the biases and overcome it\n Understand the role of history in developing international understanding\n Realise importance of teacher’s guide book\n4.3 CRITICAL THINKING\n\"Important abilities and qualities of mind are acquired through the study of History.\nThey are particularly valuable for the graduate as citizen and are readily transferable to many\noccupations and careers.\"\nApart from being extremely enjoyable and enabling students to learn about the past - that\nis, to understand the past and, through it, come to a far better understanding of the present -\nhistory also offers students the opportunity to acquire and improve on many of the key skills\nwhich have been identified as a priority for Higher Education after consultation with employers.\nHistory has ability to promote understanding between cultures and between national traditions.\nHistory places particular stress on the development of independent thought and analytical skills.\n49 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4.3.1 CONCEPT OF CRITICAL THINKING\nCritical thinking is a rich concept that has been developing throughout the past 2500\nyears. The term \"critical thinking\" has its roots in the mid-late 20th century. Socrates discovered\nby a method of probing questioning that people could not rationally justify their confident claims\nto knowledge. He established the importance of seeking evidence, closely examining reasoning\nand assumptions, analyzing basic concepts, and tracing out implications not only of what is said\nbut of what is done as well. His method of questioning is now known as \"Socratic Questioning\"\nand is the best known critical thinking teaching strategy. In his mode of questioning, Socrates\nhighlighted the need in thinking for clarity and logical consistency.\nCritical thinking is that mode of thinking - about any subject, content, or problem - in\nwhich the thinker improves the quality of his or her thinking by skilfully taking charge of the\nstructures inherent in thinking and imposing intellectual standards upon them.\n“Critical thinking” generally refers to the examination of ideas that goes on at the higher\nlevels of Bloom’s taxonomy. The term critical, despite its somewhat negative connotations,\nrefers to the evaluative thinking characteristic of highest levels of thought and reflects the\nimportance of doing so, as well.\nMuch critical thinking involves problem solving. Many problem-solving models have\nbeen formulated, some specific to a particular academic field, some more all-purpose. Regardless\nof the model and how many steps are in it, virtually all begin by seeking a clear statement of the\nproblem. In solving any problem or indeed in working successfully with any concept, we must\nfirst define it as precisely and specifically as possible. We should do this by asking students to\nstate exactly what they are doing on a particular task or assignment and why they are being asked\nto do it. Getting the student to articulate the problem constitutes the first important step in\neffective problem solving and often begins to bring the solution into focus for them.\nOnce a problem or idea has been clearly identified, the student must be encouraged to\ntalk it through. Students should be encouraged to look for more than one answer--the more the\nbetter, in fact. At other times, the tutee may not be problem solving per se, but trying to\nunderstand and work with a concept. Here too the tutor can use questioning strategies to assist\n50 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nthe tutee. The questions will vary depending on the subject area, the level of the student’s\nunderstanding of the subject, and the task. To move the student through progressively more\ndemanding levels of thinking, the tutor should “pull” or “draw” knowledge from the tutee by\nframing questions which will elicit the desired kind of thinking.\n4.3.2 NEED FOR SKILL OF CRITICAL THINKING\n For decision making process\n For creative and practical solutions\n For developing scientific attitude\n4.3.3 STRATEGIES FOR DEVELOPMENT OF CRITICAL THINKING\n Provide different sources to analyse and interpret\n Use of Social Inquiry method will help students to analyse the problem and to come up\nwith the solution for solving the same\n Organize debates: ask students to take sides on an issue, choose groups of 2 or 3 to brains\ntorm, then have them present their positions in front of the class.\n Use counter‐factual questions: ʺBut what if...?ʺ “Why not…?”\n Encourage discovery rather than memorization: give problem‐solving assignments\n Have them organize and classify a group of short documents by points of\nview.\n Use Socratic questioning: ʺWhat precisely do you mean?ʺ ʺHow do you\nknow?ʺ ʺWhat is your reason?ʺ ʺWhat else has to be true for that to be so?ʺ etc.\n Talk less; give them time to think about what you’ve said .\n Promote collaboration: have small groups solve problems and adopt positions\n51 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4.3.4 IMPORTANCE OF CRITICAL THINKING\nThe student are able to:\n Compare and contrast differing sets of ideas, values, personalities, behaviours, and\ninstitutions by identifying likenesses and differences.\n Consider multiple perspectives of various peoples in the past by demonstrating their\ndiffering motives, beliefs, interests, hopes, and fears.\n Analyse cause-and-effect relationships bearing in mind multiple causation including\n(a) the importance of the individual in history; (b) the influence of ideas, human interests,\nand beliefs; and (c) the role of chance, the accidental and the irrational.\n Draw comparisons across eras and regions in order to define enduring issues as well as\nlarge-scale or long-term developments that transcend regional and temporal boundaries.\n Distinguish between unsupported expressions of opinion and informed hypotheses\ngrounded in historical evidence.\n Compare competing historical narratives.\n Challenge arguments of historical inevitability by formulating examples of historical\ncontingency, of how different choices could have led to different consequences.\n Hold interpretations of history as tentative, subject to changes as new information is\nuncovered, new voices heard, and new interpretations broached.\n Evaluate major debates among historians concerning alternative interpretations of the\npast.\n Hypothesize the influence of the past, including both the limitations and opportunities\nmade possible by past decisions.\n52 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nCHECK YOUR PROGRESS\nWhat is need for skill of critical thinking?\n__________________________________________________________________________\n____________________________________________________________________\nExplain importance of critical thinking?\n__________________________________________________________________________\n__________________________________________________________________________\n__________________________________________________________________________\n______________________________________________________________\n4.4 USING SOURCES\nA source is anything that has been left behind by the past. It might be a document, but it\nmight alternatively be a building or a picture or a piece of ephemera – a train ticket perhaps or a\nplastic cup. They are called 'sources' because they provide us with information which can add to\nthe sum of our knowledge of the past.\nHistory as the subject of study is more or less at the mercy of the sources. The past can\nneither easily be observed directly nor can it be recalled. Historians get their information from\ntwo different kinds of sources: primary and secondary. Primary sources are first hand\nsources; secondary sources are second-hand sources.\n4.4.1 TYPES OF SOURCES\nPRIMARY SOURCES\nA primary source is a document or physical object which was written or created during\nthe time under study. These sources were present during an experience or time period and offer\nan inside view of a particular event. Primary sources give us first hand, you-are-there insights\ninto the past. They are also the most important tools an historian has for developing an\nunderstanding of an event. Primary sources serve as the evidence an historian uses in developing\n53 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nan interpretation and in building an argument to support that interpretation. Primary sources\nprovide a window into the past—unfiltered access to the record of artistic, social, scientific and\npolitical thought and achievement during the specific period under study, produced by people\nwho lived during that period. Bringing young people into close contact with these unique, often\nprofoundly personal, documents and objects can give them a very real sense of what it was like\nto be alive during a long-past era.\nSome Examples:\n ORIGINAL DOCUMENTS: Diaries, speeches, manuscripts, letters, interviews, news\nfilm footage, autobiographies, official records\n CREATIVE WORKS: Poetry, drama, novels, music, art\n RELICS OR ARTIFACTS: Pottery, furniture, clothing, buildings\nExamples of primary sources include:\n Diary of Anne Frank - Experiences of a Jewish family during WWII\n The Constitution of India\n Coins of Mughal period\n Forts of Shivaji Maharaj\nSECONDARY SOURCES :\nA secondary source is a document or recording that relates or discusses information\noriginally presented elsewhere. Secondary sources involve generalization, analysis, synthesis,\ninterpretation, or evaluation of the original information.\nExamples of some secondary sources are books, newspapers, pamphlets and\nencyclopaedias.\nExample:\n PUBLICATIONS: Textbooks, magazine articles, histories, criticisms, commentaries,\nencyclopaedias\n54 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nExamples of secondary sources include:\n A journal/magazine article which interprets or reviews previous findings\n A history textbook\n4.4.2 IMPORTANCE OF USING SOURCES:\n1. Engage students\nPrimary sources help students relate in a personal way to events of the past and promote a deeper\nunderstanding of history as a series of human events. Because primary sources are snippets of\nhistory, they encourage students to seek additional evidence through research. First-person\naccounts of events helps make them more real, fostering active reading and response.\n2. Develop critical thinking skills\nIn analyzing sources, students move from concrete observations and facts to questioning and\nmaking inferences about the materials. Questions of creator bias, purpose, and point of view may\nchallenge students’ assumptions.\n3. Construct knowledge\nInquiry into sources encourages students to wrestle with contradictions and compare multiple\nsources that represent differing points of view, confronting the complexity of the past. Students\nconstruct knowledge as they form reasoned conclusions, base their conclusions on evidence, and\nconnect sources to the context in which they were created, synthesizing information from\nmultiple sources. Integrating what they glean from comparing sources with what they already\nknow, and what they learn from research, allows students to construct content knowledge and\ndeepen understanding.\n4. First hand Knowledge:\nPrimary sources provides first-hand knowledge to the students. It helps students to understand\nthe events in history.\n5. To consider different points of view in analysis:\nIn analyzing primary sources, students move from concrete observations and facts to inferences\nabout the materials. “Point of view” is one of the most important inferences that can be drawn.\n55 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n6. To understand the continuum of history:\nStudents come to understand that we all participate in making history every day, leaving behind\nprimary source documentation hence may examine as a record of “the past.” The immediacy of\nfirst-person accounts of events is compelling to most students.\n7. To acquire empathy for the human condition:\nPrimary sources help students relate personally to events of the past, gaining a deeper\nunderstanding of history as a series of human events.\nCHECK YOUR PROGRESS\nDifferentiate between primary sources and secondary sources.\n___________________________________________________________________________\n___________________________________________________________________________\n___________________________________________________________________________\n___________________________________________________________________________\n4.5 TEACHING CORRECT EVENTS\nHistory is not really about the past. It is about the present. The past is not about us and it\nis better buried behind. Rather, history may be the only option we have toward understanding the\npresent. Young people today cannot relate their present-day predicaments with events of long\nago. Most students find history boring and stale. Without proper orientation, they cannot find\nanything in history useful to make their life more meaningful. Good history teachers should be\ngood storytellers. The story they tell should be powerful enough to move them into thinking\nabout themselves and about their country. As we do not teach history correctly, we reap the kind\nof society we have today. We seemed to have been trapped in a deep and murky mud hole\nbecause we do not learn anything from history. As social studies teachers are responsible for\nensuring that students have proper exposure to events. Connecting the current events to the study\n56 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nof history in the classroom can help bridge that gap between study and reality, between the\npresent and the past. The biasness is found while teaching events in history.\n4.5.1 BIAS\nBias is an inclination of temperament or outlook to present or hold a partial perspective\nand a refusal to even consider the possible merits of alternative points of view.\nMerriam Webster: A tendency to believe that some people, ides etc. are better than others that\nusually result in treating some people unfairly.\nOxford dictionary: Inclination or prejudice for or against one person or group, especially in a\nway considered to be unfair\nPeople may be biased toward an individual, a race, a religion, a social class, or a political\nparty. Biased means one-sided, lacking a neutral viewpoint, not having an open mind. Bias can\ncome in many forms and is often considered to be synonymous with prejudice. No country is\nfree from biases. The biases are seen in behaviour, writings and can easily creep into textbooks.\nAll subjects could carry biased statements; however, the history textbook is generally an easy\ntarget for bias to enter. And hence as a teacher of history one needs to be extra sensitive to detect\nbias in the textbook. There are different types of biases: Gender bias, Cultural bias, Religious\nbias, Racial bias, Caste bias , Class bias, Political bias. Many countries and states have guidelines\nagainst bias in education. Eg.In 1980, the council on Interracial Books for Children published\nthe book Guidelines for selecting Bias- Free Textbooks and storybooks.\nHistory in the New NCERT Textbooks: A Report and an Index of Errors by Irfan Habib,\nSuvira Jaiswal, and Aditya Mukherjee; Indian History Congress, Kolkata, 2003; shows the\nnumerous prejudices history books carry. They have quoted an example from a social studies\ntextbook for the ninth-grade- \"Problems of Scheduled Castes and Scheduled Tribes,\" the authors\nsay: \"Of course, their ignorance, illiteracy and blind faith are to be blamed for lack of progress\nbecause they fail to realize the importance of education in life.\"\n57 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4.5.2 OVERCOMING BIASES:\n Review school textbooks and identify each of these forms. Then think of the ways to\nremove the bias and create more equitable textbooks.\n Understand the concept of bias, prejudice and stereotypes\n Read various texts to understand and interpret historical accounts\n Learn simple ways to detect bias- inflammatory language, one sided view, falsified view,\nmaking larger claims.\n Inform students about the bias manners\n Be careful in use of language while discussing sensitive issues.\nCHECK YOUR PROGRESS\nWhat is mean by bias?\n__________________________________________________________________________\n4.6 DEVELOPING INTERNATIONAL UNDERSTANDING\nToday distance between countries have been annihilated, physical barriers removed and\nno nation can survive alone. The world has come much closer so sense of world citizenship has\nbecome as imperative as that of national citizen. History should endeavour to give the students\nnot only a sense of National patriotism and of National Heritage, but also a keen and lively sense\nof the world unity and world citizenship.”\n4.6.1 CONCEPT OF INTERNATIONAL UNDERSTANDING\nIn our rapidly changing society an urgent need exists for schools to address and infuse\nglobal awareness into curriculum instruction. Students are increasingly confronted with many\nissues that require a global education focus. According to Kirkwood (2001), these students will\nface a new world order thereby creating a need to acquire a global education. He states:“Their\ndaily contacts will include individuals from diverse ethnic, gender, linguistic, racial, and\n58 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nsocioeconomic backgrounds. They will experience some of history's most serious health\nproblems, inequities among less-developed and more-developed nations, environmental\ndeterioration, overpopulation transnational migrations, ethnic nationalism, and the decline of the\nnation-state.” The globally educated people are those who possess high-tech skills, broad\ninterdisciplinary knowledge about the contemporary world, and adaptability, flexibility, and\nworld mindedness to participate effectively in the globalized world. Therefore, the teacher needs\nto strive for and possess the above characteristics in order to validate her/himself as an educated\nperson of the 21st century.\nWalter H.C.: “International understanding is the ability to observe originality and objectively\nappraise the conduct of conduct of men everywhere to each irrespective of nationality or culture\nto which they belong”\n“International understanding implies a noble idea of world peace. It means one world family of\nman”\n“International understanding is ability to observe originality and appraise the conduct of men\neverywhere to each irrespective of the nationality or culture to which they belong.”\n4.6.2 ROLE OF HISTORY IN DEVELOPING INTERNATIONAL UNDERSTANDING:\nThe role of history in the secondary school curriculum is of vital importance in education.\nThe subject matter of history directly relate to the organisation and development of human\nsociety. It is teaching of history can enhance the knowledge, attitude and skills to foster the\nability of the child to understand the world problems, to promote world understanding and\npromote universal brotherhood.\nFollowing strategies could be followed to develop international understanding:\nA] Study of historical personalities:\nThe historical personalities could be selected from the various countries such as Sun Yet Sen\nfrom China, Karl Marx from USSR, and Mahatma Gandhi from India etc. It will help in\ndevelopment of a world outlook. The students will understand the work done by great\npersonalities in their respective countries to solve the problems faced by them.\n59 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nB] Study of various Religions, cultures:\nEvery religion stresses on the brotherhood, mutual cooperation, equity of man. The fundamentals\nof each religion if properly understood by the students will bring unity, bind people in common\npursuit, develop tolerance, and understand each other’s believes. The knowledge of various\nculture will enrich students. The emphasis on similarities among the cultures will help in develop\nbonding with others. It will help them to inculcate the great cultural value among them. It will\nimpress on the minds of the students how human cultures have developed and inventions and\ndiscoveries taken place and development in art literature and science are common heritage of\nmankind and not of any single country.\nC] Celebration of international days:\nA teacher of history should organise programmes to celebrate days of international importance .\nFor example UNO day, Human rights day etc.\nD] Experts:\nThe lectures of the foreign national could be organised which will help students understanding\nthe historical events.\nE] Pen friends:\nTeacher should encourage the students to make pen friends with students living in oter countries.\nIt will help them understand the way of living of others and will make them aware about the\ndifferent cultures.\nF] Through Audio Visual material:\nOne of the most effective ways of developing international understanding is use of films, film\nstrips, art reproduction, and transcripts suitable for particular classroom situation. It depicts the\nprogress and downfall of the various cultures of the world.\nG] Use of Map:\nA glance at world map gives idea as to how closer are the countries to each other. It also depicts\nhow significant position does one country occupy in the world and how it is dependent on each\nother. The trade relationship and cultural exchange among the countries will make students\nunderstand the sense of being world citizen.\n60 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nH] Understanding Role of various agencies:\nUNO and various other organisation are playing important role in promoting peace and settling\ndisputes at international level. The knowledge of these organisation will help in developing\nunderstanding for world peace.\nI] Participation in student exchange programmes:\nDifferent organisations are working for and implementing students exchange programme with\nforeign countries wherein students can experience the culture of the different countries. It helps\nin sharing the information at different levels.\nThe teacher of history must develop international outlook himself. He should make students\nunderstand “Since wars begins in the minds of the men, it is only in the minds of men that\ndefences of peace must be developed.” Through developing a global dimension in education\nyoung people can start to critically engage with complex global problems which transcend\nnational borders. Adopting a global approach can empower pupils to imagine alternative futures\nand act to realize them.\nCHECK YOUR PROGRESS\nExplain role of history in developing international understanding\n_____________________________________________________________________________\n_________________________________________________________________________\n4.7 TEACHER’S GUIDE BOOKS\nThe teacher's guide book is the key resource containing practical teaching and learning\nideas and materials.\n4.7.1 CONCEPT OF TEACHER’S GUIDE BOOKS\nTeacher’s Book helps to plan and execute the lessons. It provides guidance and\ninspiration to teachers.\nThe Teacher’s Guide book provides information about:\n- States objectives of teaching particular unit\n- The methodology to be followed while teaching a particular subject.\n- Different strategies could be utilize to teach particular topic\n61 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n- Provides ideas about the evaluation procedure\n- Also states the time required to each a particular activity\n- Deals with the details about the activities included in the textbook\n- Provides information about the reading material regarding the specific unit\n4.7.2 ADVANTAGES:\nGood teacher’s guide book-\n Save time when it comes to lesson planning\n Offer ideas for bringing a topic alive\n Provide a wealth of extra materials to give the students practice in the areas find challenging.\nCHECK YOUR PROGRESS\nWhat is teacher’s guide book?\n___________________________________________________________________________\n4.8 Suggested Reading\n Teaching of History- Arora\n Teaching of History- Kothari\n Teaching of History-Aggarwal\n History in the New NCERT Textbooks: A Report and an Index of Errors by Irfan Habib,\nSuvira Jaiswal, and Aditya Mukherjee; Indian History Congress, Kolkata, 2003\n http://qcpages.qc.cuny.edu/\n http://www.textbookleague.org\n http://www4.uwsp.edu/\n http://www.nchs.ucla.edu\n62 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n4.9 Questions\n What is critical thinking? How will you develop critical thinking among the students?\n Explain importance of using different sources in History.\n What are biases? Explain the ways to overcome biases in History.\n “History develops sense of international understanding.” Justify.\n Which information is consisted in teacher’s guide book? What is importance of using\nteacher’s guide book?\n63 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nUNIT – V\nUNIT STRUCTURE:\n5.1 Introduction\n5.2 Objectives\n5.3 Developing Lesson Planning and Scheme of Lessons\n5.3.1 Lesson Plan\n5.3.2 Scheme of Lessons\n5.4 Evaluation in History: Instructional Objectives and Construction of Objective\nType Test in History.\n5.4.1 Instructional Objectives\n5.4.2 Objective Type Test in History\n5.4.3 How to Construct Objective Test Items\n5.5 Suggested Reading\n5.6 Questions\n5.1 INTRODUCTION\nPlanning integral part of any activity. Therefore teacher has to plan the classroom activities very\ncarefully. Even the assessment at the end of the period helps in understanding the level of\nachievement of objectives.\n5.2 OBJECTIVES\nAfter learning this unit you will able to-\n- Understand the essential components of lesson plan.\n- Meaning of objective type of test.\n- Identify different types of objective test items.\n64 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n5.3 DEVELOPING LESSON PLANNING AND SCHEME OF LESSONS\nGood lesson planning is essential to the process of teaching and learning. A teacher who\nis prepared is well on his/her way to a successful instructional experience.\n5.3.1 LESSON PLAN\nGood lesson planning is essential to the process of teaching and learning. A teacher who is\nprepared is well on his/her way to a successful instructional experience. A lesson plan is the\ninstructor’s road map of what students need to learn and how it will be done effectively during\nthe class time. Before you plan your lesson, you will first need to identify the learning objectives\nfor the class meeting. Then, you can design appropriate learning activities and develop strategies\nto obtain feedback on student learning. A successful lesson plan addresses and integrates these\nthree key components:\n Objectives for student learning\n Teaching/learning activities\n Strategies to check student understanding\nSpecifying concrete objectives for student learning will help in determining the teaching and\nlearning activities to be used in class, while those activities define how evaluation technique to\ncheck whether the learning objectives have been accomplished.\n5.3.2 SCHEME OF LESSONS\nContent Analysis:\nThe teacher has to analyse the content selected for teaching in the classroom. The teacher has to\nfind out the key concepts from the content\nLearning objectives:\nLearning objectives determine what you want students to learn and be able to do at the end of\nclass. To help you specify your objectives for student learning\n65 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nPrevious Knowledge:\nThe previous knowledge of the students could linked to the content. The teacher should check\nthe previous knowledge of the students before taking up the new content.\nIntroduction of the lesson:\nWell begun is half done. The introduction of the lesson arouses curiosity among the students. It\nshould be based on the previous knowledge of the students. The introduction should be brief, to\nthe point. The success of the lesson depends on the introduction. A creative introduction to the\ntopic to stimulate interest and encourage thinking. Variety of approaches could be used to\nengage students (e.g., personal anecdote, historical event, thought-provoking dilemma, real-\nworld example, short video clip, practical application, probing question, etc.).\nStatement of the topic:\nAfter introducing the topic the teacher should state the topic which she is going to deal with.\nPresentation:\nThe teacher has to now proceed in the new content matter after stating statement of aim. Lesson\nshould be divided into sections. It should be arranged in chronological manner. Teacher has to\nprepare several ways of explaining the material (real-life examples, analogies, visuals, etc.) to\ncatch the attention of students and appeal to different learning styles. Teacher has to manage time\nfor extended explanation or discussion, and also be prepared to move on quickly to different\napplications or problems, and to identify strategies that check for understanding.\nChalk board work:\nChalk board summery has to be developed as and when teacher explains different sections of the\ncontent.\nTeaching Aids:\nTeacher could take help of different teaching aids to support explanation. It will help in making\nthe lesson more interesting for the students and also will help in clear understanding of the\nconcepts.\n66 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nRecapitulation:\nThe purpose of recapitulation is to consolidate the lesson in the minds of the students. Some\nquestions could be used for this purpose.\nEvaluation:\nIt is essential to check for student understanding. Teacher has to think about specific questions\ncould be asked to students in order to check for understanding. Different strategies could be used\nhere for example quiz, worksheet, crossword etc.\nCHECK YOUR PROGRESS\nExplain components in lesson plan.\n____________________________________________________________________________\n____________________________________________________________________________\n____________________________________________________________________________\n________________________________________________________________\n5.4 EVALUATION IN HISTORY: INSTRUCTIONAL OBJECTIVES AND\nCONSTRUCTION OF OBJECTIVE TYPE TEST IN HISTORY\n5.4.1 INSTRUCTIONAL OBJECTIVES\nBloom, an American Educationalist made an effort to make teaching process objective centred.\nHe made educational objectives as the basis for teaching activities and evaluation techniques.\nDuring the 1990's a new group of cognitive psychologists, led by Lorin Anderson (a former\nstudent of Bloom), updated the taxonomy to reflect relevance to 21st century work.\n67 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nInstructional Objectives:\n1. Remembering: Retrieving, recalling, or recognizing knowledge from memory.\nRemembering is when memory is used to produce definitions, facts, or lists, or recite or retrieve\nmaterial.\n2. Understanding: Constructing meaning from different types of functions be they written or\ngraphic messages activities like interpreting, exemplifying, classifying, summarizing,\ninferring, comparing, and explaining.\n3. Applying: Carrying out or using a procedure through executing, or\nimplementing. Applying related and refers to situations where learned material is used through\nproducts like models, presentations, interviews or simulations.\n4. Analyzing: Breaking material or concepts into parts, determining how the parts relate or\ninterrelate to one another or to an overall structure or purpose. Mental actions included in this\nfunction are differentiating, organizing, and attributing, as well as being able to distinguish\nbetween the components or parts. When one is analyzing he/she can illustrate this mental\nfunction by creating spreadsheets, surveys, charts, or diagrams, or graphic representations.\n5. Evaluating: Making judgments based on criteria and standards through checking and\ncritiquing. Critiques, recommendations, and reports are some of the products that can be\ncreated to demonstrate the processes of evaluation. In the newer taxonomy evaluation comes\nbefore creating as it is often a necessary part of the precursory behavior before creating\nsomething.\n6. Creating: Putting elements together to form a coherent or functional\nwhole; reorganizing elements into a new pattern or structure through generating, planning, or\nproducing. Creating requires users to put parts together in a new way or synthesize parts into\nsomething new and different a new form or product. This process is the most difficult mental\nfunction in the new taxonomy.\n68 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nSource: http://ww2.odu.edu/\nImportance of stating instructional objectives:\n- Provide direction for instructor\n- Convey clearly instructional intent to others\n- Provide guide for selecting content matter\n- Provide guide for selecting appropriate teaching methodology\n- Provide guide for selecting suitable material for teaching\n- Provide guide for constructing reliable test and choose instrument for evaluating\n5.4.2 OBJECTIVE TYPE TEST IN HISTORY:\n“Evaluation is the process of gathering and interpreting evidences on changes in the behaviour of\nthe students as they progress through the school.”- Quillen and Hanna\nAn objective test item is defined as one for which the scoring rules are so exhaustive and specific\nthat they do not allow scorers to make subjective inferences or judgments; thereby, any scorer\nthat marks an item following the rules will assign the same test score. Objective tests began to be\nused early in the twentieth century as a means of evaluating learning outcomes and predicting\n69 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nfuture achievement, and their high reliability and predictive validity led to the gradual\nreplacement of the essay test.\nThe features of objective type tests in History:\n- Greater reliability\n- Economy of time in the administration of tests\n- Higher diagnostic value\n- Easy to conduct\n- Uniformity of scoring the answers of the students\nCategories of objective type of tests:\nThe objective type tests could be classified into two broad categories- Recall type , Recognition\ntype.\nRecall type:\nIn Simple recall type of questions the response must be easily recalled by the students. These\nquestions begin with what, who, where, how. Answer in one word, arrange the event\nchronologically are examples of simple recall type questions.\nThe completion item is consider where student supply the answer. In this type incomplete\nsentences to be completed. It checks how much students know the specific information. Fill in\nthe lank questions fall into this category.\nRecognition Type:\nAlternative response items are those in which only two alternatives are presented to the students\nfor their response. True or false is the simplest form of this type of questions. A major\nadvantage of the true/false test is its efficiency as it yields many independent responses per unit\nof testing time. Therefore, teachers can cover course material comprehensively in a single test.\nThe limitation of the true/false test is its susceptibility to guessing.\nAnother selected response format type is the multiple-choice test. It require the examinee to\nselect one or more responses from a set of options. The correct alternative in each item is called\n70 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\nthe answer (or the key), and the remaining alternatives are called distracters. Examinees have\nless chance of guessing the correct answer to a multiple-choice test question compared to a\ntrue/false test question. In addition, the distracter an examinee selects may provide useful\ndiagnostic information.\nThe matching test, which consists of a list of premises, a list of responses, and directions for\nmatching the two. Examinees must match each premise with one of the responses on the basis of\nthe criteria described in the directions. A major strength of the matching test is that it is space-\nsaving and, therefore, can be used to assess several important learning targets at once.\n5.4.3 HOW TO CONSTRUCT OBJECTIVE TEST ITEMS\nThe scoring of objective test items is easy. It only requires one to follow the scoring rules.\nHowever, constructing good objective test items requires much more skill and effort.\nFirst step: to develop a set of test specifications that can serve to guide the selection of test items.\nIt is called as blue print.\nSecond step: to create specific test items. Typically, it is particularly important for objective test\nitems to be written in clear and unambiguous language to allow examinees to demonstrate their\nattainment of the learning objectives. It is also important for each objective test item to focus on\nan important aspect of the content.\nCHECK YOUR PROGRESS\nWhich are instructional objectives of teaching History.\n_____________________________________________________________________________\n_____________________________________________________________________________\n_____________________________________________________________________________\n_________________________________________________________________\nWhich are different types of objective questions?\n71 of 72 By : Pallavi Talekau, Dr. Jyotrimayee Nayak , Dr.S.Harichandan\n_____________________________________________________________________________\n_____________________________________________________________________________\n_____________________________________________________________________________\n_________________________________________________________________\n5.5 Suggested Reading\n Teaching of History- Arora\n Teaching of History- Kothari\n Teaching of History-Aggarwal\n5.6 Questions\n “A lesson plan is the instructor’s road map of what students need to learn and how it will\nbe done effectively during the class time.” Justify.\n Explain the instructional objectives teaching History.\n Which questions will you include in objective type History test?\n72 of 72"
}