{
    "text": "Lesson Plans Teacher's Guides Media Resources\nNEH.GOV\nTeacher's Guide\nAfrican American\nHistory and\nCulture in the\nUnited States\n“Those who have no record of what their forebears have\naccomplished lose the inspiration which comes from the teaching\nof biography and history.”\n―Carter G. Woodson\nOur Teacher's Guide o\u0000ers a collection of lessons and resources for K-\n12 social studies, literature, and arts classrooms that center around\nthe achievements, perspectives, and experiences of African Americans\nacross U.S. history. Below you will \u0000nd materials for teaching and\nlearning about the perspectives of slaves and free African Americans\nduring the American Revolution, the work of the Freedman’s Bureau\nduring and after Reconstruction, the artistry of Jacob Lawrence, the\nreality faced by African American soldiers returning home after\n\u0000ghting in WWI, the songs and e\u0000orts of the Freedom Riders during\nthe long civil rights movements, and the works of Lorraine Hansberry,\nLangston Hughes, Zora Neale Hurston, and Maya Angelou.\nGuiding Questions\nWho is included in your What are the lasting\ncurriculum and who contributions of African\ncan be added when Americans to the\nteaching African culture and history\nAmerican history? of the United States?\nHow has change come\nabout during the long\ncivil rights movement?\nAfrican American History\nThe first national Negro History Week was organized by Carter G. Woodson in\nFebruary 1926 to coincide with the birthdays of Abraham Lincoln and\nFrederick Douglass. As interest and advocacy for expanding the study of\nAfrican American history developed, a desire to expand beyond just one week\nalso grew. In 1970, students at Kent State University celebrated Black History\nMonth from January to February of that year, and since 1976, each President\nof the United States has endorsed commemorating February as Black History\nMonth across the country.\nThe resources and lessons provided below are organized chronologically to\nillustrate that the achievements, perspectives, and experiences of African\nAmericans are important to social studies and history curricula all year long.\nUsers will find connections between these materials and those provided in\nsubsequent sections of this Teacher's Guide to develop cross-disciplinary\nlearning activities and projects.\nSlavery and the Early Republic\nTaking Up Arms and the Challenge of Slavery in the Revolutionary Era: This\nlesson is designed to help students understand the transition to armed\nresistance and the contradiction in the Americans' rhetoric about slavery\nthrough the examination of a series of documents.\nSlavery and the American Founding: The “Inconsistency not to be\nexcused”: Framed by the compelling question \"How did the American\nfounders' views on slavery shape the creation of the republic?\", this lesson\nasks students to examine the views of American founders regarding\nslavery and evaluate the extent to which they reflect the principles of the\nAmerican Revolution.\nAfter the American Revolution: Free African Americans in the North: What\nwere the experiences of African-American individuals in the North in the years\nbetween the American Revolution and the Civil War? To what extent were\nfreed slaves citizens in the newly independent nation? This lesson provides\nprimary sources for students to analyze in order to evaluate these questions.\nSlavery in the Colonial North: Philipsburg Manor, located in Sleepy Hollow,\nNew York, is a historic site owned and operated by Historic Hudson Valley. The\nsite tells the story of the 23 enslaved Africans who were the only full-time, year\nround residents of the Manor, and whose forced labor was the backbone of\nthe Philipse’s international trading empire.\nTwelve Years a Slave: Analyzing Slave Narratives: What does Solomon\nNorthup’s narrative reveal about the relation between slavery and social\ninstitutions such as marriage and the family? Why are slave narratives’\nauthenticity and truthfulness questioned? Examine the primary sources that\nbecame the basis for a major motion picture.\nPerspectives on the Slave Narrative: Working with primary sources that\nprovide insight into the lives of slave owners, slaves, abolitionists, students\ngather evidence to respond to the compelling question \"What role did the\nslave narrative have both in historical and in literary traditions?\"\nAbolition and Reconstruction\nHarriet Tubman and the Underground Railroad: In this lesson, students will\ncomprehend the organizational structure of the Underground Railroad; learn\nabout one of its most famous conductors, Harriet Tubman; and consider the\nlegacy of the heroines and heroes of slavery resistance.\nFrederick Douglass's Narrative: Myth of the Happy Slave: In this lesson,\nstudents analyze Douglass's first-hand account to see how he successfully\ncontrasts myths with the reality of life under slavery.\nFrom Courage to Freedom: Frederick Douglass’s 1845\nAutobiography: Frederick Douglass's 1845 narrative of his life is a profile in\nboth moral and physical courage. In this lesson sequence, students examine\nhow he contrasts reality with romanticism and powerfully uses imagery and\nrhetorical appeals to persuade the reader of slavery's evil.\n\"I say it with a sad sense of the disparity between us. I am not included\nwithin the pale of glorious anniversary!\nYour high independence only reveals the immeasurable distance\nbetween us.\nThe blessings in which you, this day, rejoice, are not enjoyed in\ncommon.\"\n—Frederick Douglass, \"What to the Slave is the 4th of July?\"\nFrederick Douglass What to the Slave is the Fourth of July?: This student\nactivity brings together video and audio media, along with the text of\nDouglass's speech, to give students opportunities to discuss and deliberate\nwho the 4th of July is for and the extent to which Douglass is justified in his\nposition.\nDavid Walker vs. John Day: Two Nineteenth-Century Free Black Men: David\nWalker, a free African American, invoked the Bible and the Declaration of\nIndependence to challenge the inequities of American slavery in his Appeal to\nthe Coloured Citizens of the World (1829). John Day, also a free African\nAmerican, was a major proponent of colonization and an early Liberian\ncolonist who argued that African Americans would never achieve equality in\nthe United States. Through this lesson, students examine the conflicting\nperspectives over slavery, abolition, and equality.\nMission US 2: Flight to Freedom: In Mission 2: “Flight to Freedom,” players\ntake on the role of Lucy, a 14-year-old slave in Kentucky. As they navigate her\nescape and journey to Ohio, they discover that life in the “free” North is\ndangerous and difficult.\nTeacher’s Guide: The Reconstruction Era: This Teacher’s Guide provides\ncompelling questions to frame a unit of study and inquiry projects, along with\nactivity ideas on Reconstruction that include use of newspapers from the era\nand resources for social studies, ELA, and music education.\nJim Crow and War\nBirth of a Nation, NAACP, and Balancing of Rights: Why did the NAACP\nchallenge the showing of Birth of a Nation? The lesson asks students to\nanalyze the efforts of the NAACP and evaluate the decision to not censor the\nfilm.\nNAACP's Anti-Lynching Campaigns in the 1920s: This lesson sequence\nengages students with the deeply serious issues of Jim Crow and lynching in\nthe United States during the inter-war period.\nAfrican American Soldiers in World War I: The 92nd and 93rd\nDivision: Students combine their research using a variety of sources, including\nfirsthand accounts, to develop a hypothesis evaluating contradictory\nstatements about the performance of the 92nd Infantry Division in World War\nI.\nAfrican American Soldiers after WWI: Had Race Relations\nChanged?: Analyze archival photographs and archival newspaper accounts\nabout race relations in the United States to evaluate different points of view\nabout post-war riots in Chicago.\nAfrican Americans and the New Deal's Civilian Conservation Corp: Students\nconsiders documents that present the CCC from the perspective of black\nparticipants in order to evaluate the impact of this New Deal program on race\nrelations in America.\nCivil Rights and Now\nThe Green Book: African American Experiences of Travel and Place in the\nU.S.: How have the intersections of race and place impacted U.S. history and\nculture? This inquiry-based lesson combines individual investigations with\nwhole or small group analysis of primary sources and visual media.\nCivil Rights and the Cold War: This lesson plan attempts to dissolve the\nartificial boundary between domestic and international affairs in the postwar\nperiod to show students how we choose to discuss history.\nThe Freedom Riders and the Popular Music of the Civil Rights\nMovement: Through collaborative activities and presentations, students will\nfind the meaning behind the music, and compare and contrast the major\nfigures, documents, and events of the day to better understand the political\nand cultural messages.\nMalcolm X: A Radical Vision for Civil Rights: This essay examines the\nconflicting points of view surrounding how best to advance the civil rights\nmovement in the U.S. during the 1960s with a comparative analysis of the\nphilosophies of Dr. Martin Luther King, Jr. and Malcolm X.\nBlack Separatism and the Beloved Community: Malcolm X: This lesson will\ncontrast the respective aims and means of Malcolm X and Martin Luther King,\nJr. to evaluate how best to achieve black American progress in the 1960s.\nJFK, Freedom Riders, and the Civil Rights Movement: Resources provided in\nthis lesson support student analysis of the critical role of activists in pushing\nthe Kennedy Administration to face the contradiction between its ideals and\nthe realities of federal politics.\nGrassroots Perspectives on Civil Rights: Focus on Women: This essay not only\nlooks at the work of the Student Non-Violence Coordinating Committee\n(SNCC), but specifically the role of women within the activism of this student-\nled civil rights organization.\nRevolution 67: Protest Why & How?: The intent of this lesson sequence is to\nhelp students comprehend and explain the changes in how the people of\nNewark, New Jersey viewed government and how those attitudes affected\npolitical change in the 1960s and 1970s.\nCompeting Voices of the Civil Rights Movement: This lesson\nsequence presents the views of several important black leaders who shaped\nthe debate over how to achieve freedom and equality in a nation that had\nlong denied a portion of the American citizenry the full protection of their\nrights.\nLet Freedom Ring: The Life and Legacy of Dr. Martin Luther King, Jr.: Students\nwill learn about the life and work of civil rights leader Martin Luther King, Jr. by\nlistening to a brief biography, viewing photographs of the March on\nWashington, and reading a portion of King's \"I Have a Dream\" speech.\nThe Election of Barack Obama: This lesson focuses on the relationship\nbetween the Civil Rights Movement and Obama's election, but it also asks\nstudents why they think Barack Obama's election is \"historic.\"\nAfrican American Literature and Poetry\nPoetry, literature, and plays make up the collection of resources and lessons\nprovided below for K-12 literature and language arts courses. Users will find\nconnections between these materials and those provided in subsequent\nsections of this Teacher's Guide to develop cross-disciplinary learning activities\nand projects.\nTeacher's Guide: The Works of Langston Hughes: This Teacher's Guide\nincludes video of public readings, access to NEH supported projects\ndedicated to the work of Langston Hughes, and classroom ready materials for\nteaching his poetry.\nThe Poet's Voice: Langston Hughes and You: This lesson asks students to\nconsider what is meant by voice in poetry, and what qualities have made the\nvoice of Langston Hughes a favorite for so many people?\nTeacher's Guide: Maya Angelou: A Phenomenal Woman: This Teacher's Guide provides\naccess to collections of poetry, lesson activity ideas, and multimedia resources\nto hear and see Dr. Angelou perform her poetry.\nGwendolyn Brooks' Poem \"We Real Cool\": In this lesson, students will closely\nanalyze the poem's line breaks and the effect of enjambment on their reading\nand interpretation of the poem.\nThe Pool Players.\nSeven at the Golden Shovel.\nWe real cool. We\nLeft school. We\nLurk late. We\nStrike straight. We\nSing sin. We\nThin gin. We\nJazz June. We\nDie soon.\n\"A Raisin in the Sun\": Whose American Dream?: This interdisciplinary lesson includes a\ncritical reading and analysis of the play, close examination of biographical and\nhistorical documents produced at different times during the long civil rights\nmovement, and a variety of assessment options.\nToni Morrison's Beloved: For Sixty Million and More: Close reading and\nreflective activities guide thoughtful inquiry into the novel and its major\nthemes, while also providing teachers and students with creative outlets for\nmaking connections with one of the great novels of the twentieth century.\nTheir Eyes Were Watching God: Folk Speech and Figurative Language: This lesson provides\nstudents with an opportunity to observe how Hurston creates a unique literary\nvoice by combining folklore, folk language, and traditional literary techniques.\nScottsboro Boys and To Kill a Mockingbird: Two Trials for the Classroom: In this\nlesson, students will perform a comparative close reading of select\ninformational texts from the Scottsboro Boys trials alongside sections from To\nKill a Mockingbird to see how fictional “truth” both mirrors and departs from\nthe factual experience that inspired it.\nAfrican American Arts and Culture\nThe resources and lessons provided below are designed for the study of art,\nmusic, and culture in K-12 classrooms. Users will find connections between\nthese materials and those provided in subsequent sections of this Teacher's\nGuide to develop cross-disciplinary learning activities and projects.\nTeacher’s Guide: The Reconstruction Era: This Teacher’s Guide provides\ncompelling questions to frame a unit of study and inquiry projects, along with\nactivity ideas on Reconstruction that include use of newspapers from the era\nand resources for social studies, ELA, and music education.\nThe Freedom Riders and the Popular Music of the Civil Rights\nMovement: Through collaborative activities and presentations, students will\nfind the meaning behind the music, and compare and contrast the major\nfigures, documents, and events of the day to better understand the political\nand cultural messages.\nThe Music of African American History: This lesson traces the long history of\nhow African Americans have used music as a vehicle for communicating\nbeliefs, aspirations, observations, joys, despair, resistance, and more across\nU.S. history.\nLearning the Blues: Students take a virtual field trip to Memphis, Tennessee,\none of the prominent centers of blues activities, and explore the history of the\nblues in the work of W. C. Handy and a variety of country blues singers whose\nmusic preserves the folk origins of this unique American art form.\nMartin Puryear's Ladder for Booker T. Washington: Students examine Booker\nT. Washington’s life and legacy through Martin Puryear’s sculpture and\nconsider how the title of Puryear’s sculpture is reflected in the meanings we\ncan draw from it.\nJacob Lawrence's Migration Series: Removing the Mask: Focusing on composition,\nimage, setting, characterization, and tone, while also analyzing the poetry of\nPaul Laurence Dunbar and Helene Johnson, students are invited to compare\nand contrast the works while considering how each work represents the life\nand changing roles of African Americans from the late nineteenth century to\nthe Harlem Renaissance and The Great Migration.\nRomare Bearden's The Dove: A Meeting of Vision and Sound: How do art and\nmusic reflect & inspire change in American society? This lesson asks students\nexamine this and other questions about history, art, and culture.\nPicturing Freedom: Selma to Montgomery in March, 1965: After analyzing\nphotojournalist James Karales's iconic photograph of the march, reading\nbackground material on it, and considering what the marchers might have\nthought and felt, students write and illustrate a postcard describing this civil\nrights event from a marcher's viewpoint.\nHistoric Sites of African American Culture\nThe forced migration of Africans reshaped cultural practices, traditions, and\nidentities. In this country, Black community building and identity\nformation have created a heritage found in music, language, cuisine, art, and\nmore. This heritage is also apparent in the physical spaces built by Black\nAmericans and significant to Black culture.\nHistorically Black Towns and Settlements\nThe town of Princeville, North Carolina reflects a cultural landscape of the\nBlack community following the end of the Civil War. Founded in 1865 by\nformerly enslaved people, many of these refugees remained in the area\nand created their own settlement called Freedom Hill, a name derived from\nthe location where a Union solider shared news about the Emancipation\nProclamation. In 1885, a Black carpenter named Turner Prince led the formal\nincorporation of the town, making Princeville the first Black incorporated town\nin the United States.\nFor over a century, the town has symbolized African American determination\nand endurance. Despite Princeville’s continued adversity in the face of natural\ndisasters, lack of government support, and white supremacy, residents share a\nstrong sense of pride in their history and community. The town’s location in a\nfloodplain has resulted in numerous destructive floods, and after each of these\nevents residents have chosen to rebuild in the interest of communal\npreservation. Although many of the town’s historic buildings have\nbeen destroyed by flooding, the cultural landscape of\nPrinceville retains its historical significance through its ability to evoke a sense\nof place.\nSchools and HBCUs\nSchools offer not only a physical space for building community but also a\nframework for exploring identity. In segregated public school systems,\neducational facilities for Black children were underfunded compared to\ntheir white counterparts. Beginning in 1917, educator and Tuskegee Institute\nco-founder, Booker T. Washington, and Julius Rosenwald, philanthropist and\npresident of Sears Roebuck, built more than 5,000 schools for African\nAmerican children across the rural South. By 1928, one-third of the South’s\nrural Black school children and teachers attended or worked at a Rosenwald\nSchool.6 When the landmark Supreme Court decision Brown v. Board of\nEducation of Topeka I and II (1954) found segregation in schools\nunconstitutional, Rosenwald Schools became obsolete as classrooms\nintegrated.\nFounded in 1870, Dunbar High School is the country’s first public high\nschool for African Americans. Throughout the 20th century, Dunbar became\nrenowned for its excellent academics, and some parents moved to\nWashington, D.C. specifically so their children could attend the school. Noted\nfaculty include educator and activist Mary Church Terrell, father of Black\nHistory Month Dr. Carter G. Woodson, and Dunbar graduate Julia Evangeline\nBrooks, who was one of the pioneers of the Alpha Kappa Alpha Sorority.\nOther celebrated graduates include businessman H. Naylor Fitzhugh, educator\nand activist Nannie Helen Burroughs, surgeon Charles R. Drew, lawyer Charles\nHamilton Houston, and Air Force General Benjamin O. Davis Jr. Dunbar High\nSchool continues to educate generations of Black leaders to this day.\nHistorically Black colleges and universities (HBCUs) are higher education\ninstitutions that primarily serve African American students. Although most of\nthese colleges and universities are found in the South, there are over one\nhundred HBCUs in locations across the United States, both public and private\ninstitutions. Established in 1837, Cheyney University of Pennsylvania is the\ncountry’s oldest HBCU. Other HBCUs include Spelman College, Howard\nUniversity, Xavier University, Tuskegee University, Hampton University, and\nMorehouse College.\nBurial Grounds\nOne of the country’s earliest and largest known Black cemeteries was\nrediscovered in 1991 in New York City. Before construction began for a thirty-\nfour-story federal office building, the area was archeologically surveyed to\ncomply with the National Historic Preservation Act of 1966. The excavation\nuncovered the burial site of more than 419 free and enslaved Africans laid to\nrest during the late 17th and 18th centuries. Recognizing\nthe historical significance of the site, the Secretary of the Interior designated\nthe African Burial Ground to the National Register of Historic Places. In 2006,\nthe site became a national monument.\nHistoric Preservation\nAlthough Black cultural landscapes are ubiquitous throughout the\ncountry, they are often neglected and erased from historical narratives. The\nlack of national recognition given to Black cultural landscapes stems from\ntrends within the field of historic preservation that favor architectural\nsignificance over social histories embedded within a place. Even with recent\nadditions, fewer than 8% of the sites listed on the National Register of Historic\nPlaces in the United States are associated with women, African Americans,\nLatinx Americans and other minority groups combined.\nPrior to 1973, there were only three Black historic sites designated across the\nentire United States: the Frederick Douglass House in Washington, D.C., the\nBooker T. Washington House in Virginia, and the George Washington Carver\nHouse in Missouri. Following the Civil Rights Movement and leading up to the\nBicentennial, activist groups like the Afro-American Bicentennial\nCorporation argued for the inclusion of Black history in the preserved, built\nenvironment and American history more broadly. Through a contract with the\nNational Park Service, the Afro-American Bicentennial Corporation drastically\nincreased Black representation in the National Register of Historic\nPlaces, designating historic sites such as the Mary McLeod Bethune House in\nWashington, D.C. and W. E. B. Du Bois Boyhood Home in Great Barrington,\nMassachusetts.\nNEH Connections\nThe National Endowment for the Humanities continues to fund a wide array\nof projects, programs, and publications focused on telling the many stories of\nAfrican Americans in the United States. The following collection supplements\nthe resources provided above and extends the work that can be done across\nK-12 classrooms when teaching African American history and culture.\nColored Conventions Project: From 1830 until well after the Civil War, African\nAmericans gathered across the United States and Canada to participate in\npolitical meetings held at the state and national levels. A cornerstone of Black\norganizing in the nineteenth century, these “Colored Conventions” brought\nBlack men and women together in a decades-long campaign for civil and\nhuman rights.\nThe Right to Love: The Case of Loving v. Virginia: This Humanities magazine\narticle tells the story of how the freedom to marry across racial lines was\ntested by a shy Virginia couple, who were very much in love.\nAugust Wilson: The Ground on Which I Stand: This 2005 documentary tells the\nstory of legendary playwright and 1999 NEH Humanities Award Medal\nrecipient August Wilson.\nVoyages: The Trans Atlantic Slave Trade Database: Track the journeys of over\n10-12.5 million Africans forced into slavery with this searchable database of\npassenger records from 36,000 trans-Atlantic slave ship voyages.\nW.E.B. Du Bois Papers: This digitized collection of almost 95,000 items was\ncompleted by the University of Massachusetts at Amherst with the support of\na grant from the NEH.\nAfropop Worldwide: This Peabody award-winning radio program and online\nmagazine is dedicated to music from Africa and the African diaspora.\nThurgood Marshall Before the Court: Stephen Smith presents the story of\nThurgood Marshall's remarkable career in this American Radio Works podcast\nand website.\nRelated on EDSITEment\nLesson Plan Lesson Plan Teacher's Guide\nLesson Plan\nThe Green Book: African Jacob Lawrence's Migration The Works of Langston\nA Raisin in the Sun: Whose\nAmerican Experiences of Series: Removing the Mask Hughes\n\"American Dream\"?\nTravel and Place in the U.S.\nMedia Resource Media Resource Media Resource\nMedia Resource\nVoices of Democracy: Women Blues Re\u0000ections Music of the Harlem\nThe Long Road to Freedom:\nLeaders of the Civil Rights Renaissance\nBiddy Mason’s Remarkable\nStruggle\nJourney\nCurriculum Teacher's Guide Media Resource\nLesson Plan\nNAACP's Anti-Lynching Maya Angelou: A Phenomenal Thurgood Marshall Before the\nToni Morrison's Beloved: For\nCampaigns: The Quest for Woman Court\nSixty Million and More\nSocial Justice in the Interwar\nYears\nLesson Plans Student Activities American Landmarks\nTeacher's Guides Media Resources About EDSITEment\nEDSITEment is a project of the\nContact Disclaimer Privacy Policy Conditions of Use\nNational Endowment for the Humanities"
}