{
    "text": "Mythology Unbound: An Online\nTextbook for Classical\nMythology  Mythology\nUnbound: An\nOnline\nTextbook for\nClassical\nMythology\nJESSICA MELLENTHIN AND SUSAN O.\nSHAPIRO   Mythology Unbound: An Online Textbook for Classical\nMythology by Jessica Mellenthin and Susan O. Shapiro is\nlicensed under a Creative Commons\nAttribution-NonCommercial-ShareAlike 4.0 International\nLicense, except where otherwise noted.\nMythology Unbound: An Online Textbook for Classical Mythology\nby Jessica Mellenthin and Susan O. Shapiro is licensed under\nCC-BY-NC-SA 4.0 Contents\nTable of Contents xi\nMap xiv\nPART I. MAIN BODY\nAegis 1\nAgamemnon and Iphigenia 3\nAphrodite 7\nApollo 13\nAres 24\nThe Argonauts 30\nArtemis 41\nAthena 48\nCaduceus 60\nCentaurs 61\nChthonian Deities 62 The Delphic Oracle 63\nDemeter 72\nDionysus or Bacchus 80\nHades 93\nHephaestus 97\nHera 100\nHeracles 105\nHermes 115\nHestia 126\nThe Iliad – An Introduction 127\nJason 141\nMiasma 146\nThe Minotaur 148\nThe Odyssey – An Introduction 150\nThe Oresteia – An Introduction 160\nOrigins 165\nOrpheus 176\nPersephone 180\nPerseus 185\nPoseidon 196\nPrometheus 205 Sphinx 208\nStory Pattern of the Greek Hero 214\nTheseus 217\nThe Three Types of Myths: 230\nAetiological, Historical, and\nPsychological\nThe Twelve Labors of Heracles 233\nWhat is a Myth? 248\nWhy Are There So Many Versions of 249\nGreek Myths?\nXenia 251\nZeus 252\nImage Attributions 265  Table of Contents\n• Map\n• Aegis\n• Agamemnon and Iphigenia\n• Aphrodite\n• Apollo\n• Ares\n• The Argonauts\n• Artemis\n• Athena\n• Caduceus\n• Centaurs\n• Chthonian Deities\n• The Delphic Oracle\n• Demeter\n• Dionysus or Bacchus\n• Hades\n• Hephaestus\nxi MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\nxii\nCLASSICAL MYTHOLOGY\n• Hera\n• Heracles\n• Hermes\n• Hestia\n• The Iliad – An Introduction\n• Jason\n• Miasma\n• The Minotaur\n• The Odyssey – An Introduction\n• The Oresteia – An Introduction\n• Origins\n• Orpheus\n• Persephone\n• Perseus\n• Poseidon\n• Prometheus\n• Sphinx\n• Story Pattern of the Greek Hero\n• Theseus\n• The Three Types of Myths: Aetiological,\nHistorical, and Psychological\n• The Twelve Labors of Heracles\n• What is a Myth?\n• Why Are There So Many Versions of Greek xiii\nMyths?\n• Xenia\n• Zeus\n• Image Attributions Map\nxiv MAP xv  Aegis\nThe aegis was a goat skin (the name comes from the\nword for goat, αἴξ/aix) that was fringed with snakes\nand often had the head of Medusa fixed to it.\nAccording to the Iliad (15.307-328), Hephaestus made it\nfor Zeus and it had magical powers; when a god held it\nover an army on the battlefield and shook it, it would\ninduce panic in the opposing army and cause it to flee.\nAlthough Zeus was the owner of the aegis (and Zeus is\nsometimes called “aegis-bearing Zeus”), he would\nfrequently allow other gods to use it. In the Iliad\npassage cited above, Apollo uses the aegis to make the\nGreek army run away in panic. But Athena uses it most\nof the time (Athena is arguably Zeus’ favorite child),\nand Athena is usually depicted wearing it like a cloak,\nwith Medusa’s head attached to the front and snakes\nwrithing along the edges. The word “aegis” is used in\nEnglish today. Can you explain what it means and how\nits current usage is connected to its mythological\norigin?\n1 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n2\nCLASSICAL MYTHOLOGY\nAthena wearing the aegis on a lekythos found in the\nMetropolitan Museum of Art in New York City Agamemnon and Iphigenia\nAgamemnon was the King of Mycenae [see Argos on\nmap] and brother to Menelaus, the King of Sparta\n[map]. (Together the brothers are called the Atreidae,\nmeaning “the sons of Atreus”.) When Menelaus’ wife,\nHelen, was abducted by the Trojan Prince, Paris, the\nAtreidae sought out their Greek allies to sail to Troy\nand bring Helen back; they also planned to punish the\nTrojans for stealing Helen of Sparta and violating xenia\n[see Xenia]. All the Greek allies were planning to meet\nat Aulis. The process of gathering their forces took a\nfew years because the kingdoms were spread out and\nunconnected. Finally, the greatest Greek warriors\ngathered at Aulis and were ready to cross the sea to\nattack Troy [see Ilium/Troia on map]. However, the\nwind kept blowing against them, preventing them from\nsailing out towards Troy. This kept up for weeks, long\nenough for the troops to get restless and consider\ngoing home. The seer Calchas was among the group,\nand he told Agamemnon that he had angered the\ngoddess Artemis and that the wind would not allow\nthem to make their voyage until Agamemnon\nsacrificed his daughter, Iphigenia, to the goddess.\nSources differ on why exactly Artemis was so angry\n3 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n4\nCLASSICAL MYTHOLOGY\nwith Agamemnon. Some say he boasted that he could\nhunt better than the goddess, while others say that he\nhad not done anything; she just was angry at him.\nThe Sacrifice of Iphigeneia by François Perrier (1632–1633) in the\nMusée des Beaux-Arts in Dijon, France AGAMEMNON AND IPHIGENIA 5\nWith the campaign in trouble and the Atreidae’s\nreputations at stake, Agamemnon chose to sacrifice his\ndaughter. He sent Odysseus and Diomedes to his wife,\nClytemnestra (who happened to be Helen’s sister), to\ntell her that he had arranged a marriage between their\ndaughter, Iphigenia, and the hero Achilles, and that\nAchilles wished to marry her before he went off to\nfight. Agamemnon told this lie because he suspected\nthat if he told his wife the real reason why he wanted\nIphigenia to come to Aulis, Clytemnestra would not go\nalong with the plan. But Clytemnestra suspected\nnothing; she prepared her daughter for marriage and\nsent her off to Aulis. Once there, Agamemnon\nsacrificed his own daughter (though some sources\ncontend that Artemis replaced her with a deer at the\nlast second and whisked the girl off to live as her\npriestess among the Taurians). This action earned\nAgamemnon the undying hatred of his wife. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n6\nCLASSICAL MYTHOLOGY\nA fresco of the sacrifice of Iphigenia from Pompeii in the\nNational Archaeological Museum in Naples Aphrodite\nRoman name: Venus\nEpithets: Cypris (Lady of Cyprus), Cythereia (Lady of\nCythera, an island off the southern coast of the\nPeloponnese), Paphian (Lady of Paphos, a town on\nCrete), Urania (Daughter of Uranus), Smile-Loving\nGoddess, Goddess of Smiles and Deceit\nSymbols: doves\nFunctions: goddess of erotic love and beauty\n7 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n8\nCLASSICAL MYTHOLOGY\nThe Birth of Venus in the Casa della Venere in Conchiglia in\nPompeii\nTWO STORIES ON THE BIRTH OF APHRODITE\nAphrodite has two origins. Hesiod says that Aphrodite\ncame from the frothy mix of sea foam and Uranus’\ngenitals when Cronus dismembered his father [see\nOrigins]. She washed ashore either at the city of Paphos\non Cyprus (accounting for her epithets Cypris and\nPaphian) or on the island Cythera (thus the epithet\nCythereia). Paphos was also the site of Aphrodite’s main\ntemple on Cyprus. Homer calls Aphrodite the daughter\nof Zeus and Dione, who was either a Titan or one of\nthe daughters of Oceanus. The name Dione is also the\nfeminine form of Zeus’ name. APHRODITE 9\nAphrodite rising from the sea with the help of her attendants on\nthe Ludovisi Throne in the Palazzo Altemps in Rome\nAPHRODITE’S UNHAPPY MARRIAGE\nAphrodite was married to the blacksmith god,\nHephaestus, but the two never had any children. This\nis not to say Aphrodite never had children, in fact, she\nhad several children from her long-standing affair with\nthe war god, Ares. Together they had Harmonia (who\nwas married to the Theban King, Cadmus), Eros (known\nas Cupid in Latin), Phobus (Panic), and Deimus (Fear).\nHephaestus was not happy when he learned of this\naffair and trapped the lovers in a net [see Hephaestus].\nAPHRODITE AND ADONIS\nAphrodite also had notable mortal lovers, including\nAdonis and Anchises. Adonis was a handsome young\nman and Aphrodite fell deeply in love with him. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n10\nCLASSICAL MYTHOLOGY\nPersephone was also in love with Adonis, so they went\nto Zeus to decide who would have the youth’s love [see\nPersephone]. Zeus split Adonis’ time into three parts.\nHe gave one part to each goddess and one to Adonis\nhimself to decide where to spend it. Adonis chose to\nspend his portion of the year with Aphrodite. The deal\ndid not last long though, because Adonis was quite fond\nof hunting. On a boar hunt, he was gored by the animal\nand died. Aphrodite was distraught, and she induced an\nanemone to grow from Adonis’ blood.\nAPHRODITE AND ANCHISES\nAnchises was a young Trojan nobleman who tended\nto herds on Mount Ida. Zeus was angry at Aphrodite\nfor making the gods, especially himself, fall in love with\nmortals and make fools of themselves pursuing them,\nso he caused Aphrodite to fall madly in love with\nAnchises. After she consummated her love for\nAnchises, Aphrodite made him promise never to tell\nanyone they slept together, on pain of a thunderbolt\nfrom Zeus. (This story is told in the Homeric Hymn to\nAphrodite.) But apparently, Anchises could not keep his\npromise. The next time we see Anchises, in the Aeneid,\nhe is lame from having been struck by Zeus’\nthunderbolt. Anchises clearly did not die from this\npunishment, but he seems to have been crippled for\nthe rest of his life. The product of their union was\nAeneas, whom Aphrodite saved from death multiple\ntimes during the Trojan War. APHRODITE 11\nAPHRODITE’S ANGER\nLike other gods, Aphrodite would punish anyone,\nmortal or god, for slights against her. Theseus’ son\nHippolytus became a devotee of the virgin goddess,\nArtemis, and thus shunned the pleasures of the flesh.\nThis angered Aphrodite, who felt that Hippolytus did\nnot worship her sufficiently. To get back at Hippolytus,\nshe caused his death by making his step-mother,\nPhaedra, fall in love with him [see Theseus]. She also\npunished Eos (the goddess of the dawn) for having an\naffair with Ares by making her fall in love with mortal\nafter mortal.\nIn a story not seen until the Roman period, Venus\nhounded the beautiful girl, Psyche, just for being\nbeautiful. Psyche (whose name means “soul” in Greek)\nwas so beautiful that the people around her\nworshipped her instead of Venus. Psyche did not ask\nfor this worship, but Venus wanted to punish her\nanyway. Venus sent her son Cupid to shoot Psyche with\nhis arrows and make her fall in love with some hideous\nbeast. This didn’t go according to plan, though, and\nCupid fell in love with Psyche himself. Cupid hid Psyche\nin his palace, not telling her who he was, until she\nlearned his identity through a trick. In his anger at being\ntricked, Cupid threw her out of his house. Psyche\nwandered around Greece until she came to a temple\nof Venus and submitted herself to Venus’ wrath. Venus\ngave her several impossible tasks, like sorting a large\npile of grain in one night or bringing back a jar of water\nfrom the Styx. Venus gave her these tasks hoping she\nwould fail, but the world helped Psyche along the way. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n12\nCLASSICAL MYTHOLOGY\nSome ants helped her sort the grain, and an eagle took\nthe jar and filled it with water from the Styx for her.\nAfter Psyche had successfully completed these and\nother impossible tasks, Cupid forgave her for her\ndeceit. He then brought her to Jupiter, who put an end\nto the enmity between Psyche and Venus and allowed\nCupid and Psyche to marry. This story is told in The\nGolden Ass by Apuleius.\nTHE ORIGIN OF APHRODITE\nAphrodite originally began as a fertility goddess and\nhad close connections with other Near Eastern fertility\ngoddesses such as Astarte, Cybele, and Ishtar. At one\npoint, these may all have been the same goddess.\nAphrodite’s main centers of worship were on Cyprus,\nan island that served as a crossroads between Greece\nand the Near East, and in Near Eastern sites. Her\neastern origins may explain why she favored the\nTrojans during the Trojan War. Apollo\nRoman name: Apollo\nEpithets: Pythian (for killing the Python), Lycian\n(unknown, may be connected to Lycia), Far-Shooter (for\nhis archery skills), Delian (for his birth myth), Phoebus\n(Shining One), Delphinius (God of the Dolphins)\nSymbols: lyre; bow and arrow; laurel, myrtle, or bay\ntree; crow or raven; omphalos; dolphin; tripod\nFunctions: god of youth, music, prophecy, archery,\nand medicine (both disease and healing). The Romans\nconflated him with the Greek god of the sun, Helius.\n13 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n14\nCLASSICAL MYTHOLOGY\nThe Apollo Belvedere in the Vatican Museum APOLLO 15\nTHE BIRTH OF APOLLO\nApollo was one of the two children born to Zeus and\nthe goddess, Leto. When Leto was pregnant with Apollo\nand Artemis, she was looking for a place to give birth,\nbut no place was willing to allow her to give birth on its\nterritory. There was a rumor that Apollo was going to be\na wild and terrible divinity, and no place wanted to take\nthe risk that Apollo might harm his birthplace after he\nwas born. But Leto finally convinced the small island of\nDelos to allow her to give birth there by promising that\nApollo would have a great temple there.\nBut even though Leto wanted to give birth on Delos,\nat first she wasn’t able to do so. This was because Hera,\nwho was jealous of Zeus’ affair with Leto, kept Eileithyia,\nthe goddess of childbirth, away from the island.\nBecause no birth could take place unless Eileithyia was\npresent, this was one way that Hera could at least\ntemporarily prevent the children of her rivals from\nbeing born. Hera would later play a similar trick with\nHeracles [see Heracles]. In the case of Apollo and\nArtemis, Iris (who was a rainbow, and was one of the\ngods’ messengers) was dispatched to bring Eileithyia,\nand according to the Homeric Hymn to Apollo, as soon as\nshe stepped onto the island, Apollo and Artemis were\nborn.\nAPOLLO AND ARTEMIS\nApollo and his sister often avenged their mother for the\nwrongs done to her. The twins killed the giant Tityus\nbecause he had attempted to rape Leto. The twins also MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n16\nCLASSICAL MYTHOLOGY\ntook vengeance on Niobe, who had seven sons and\nseven daughters. Niobe boasted that she had born\nmore and greater children than Leto. Angered at\nNiobe’s hubris (arrogance, excessive pride, and the\ndesire to challenge the gods), Apollo and Artemis shot\nNiobe’s children with arrows until they were all dead.\nNiobe wept uncontrollably until she turned into a stone\nwhich still spouts tears.\nBoth Apollo and his sister were excellent archers, and\nthe bow and arrow were important symbols for both of\nthem. Plagues and unexplained deaths were attributed\nto Apollo or Artemis shooting the victims with arrows\n(the beginning of the Iliad is a good example of this).\nThe lyre was most associated with Apollo as the god of\nmusic, however, it was created by the god Hermes [see\nHermes].\nAPOLLO’S UNHAPPY LOVE AFFAIRS\nApollo was unlucky in a number of his love affairs; in\nfact, he seems never to have been happy in love. He\nfell in love with Cassandra, the daughter of Priam, king\nof Troy, and in order to win her consent, he offered\nher the gift of prophesy. But after she was given the\ngift, Cassandra changed her mind and refused his\nadvances. Because a god cannot take back a gift once\nit has been given, Apollo could not prevent Cassandra\nfrom correctly predicting the future, so he cursed her\nto never be believed even though her predictions were\nalways correct. Another time, Apollo pursued the\nnymph, Daphne, but she fled from him, calling upon the\ngods to save her. The gods transformed Daphne into a APOLLO 17\nlaurel tree and Apollo, being disheartened, vowed that\nthe laurel would be his special plant forever. Another\nnotable love of Apollo was Hyacinth, a Spartan boy.\nHyacinth was killed accidentally by a discus that Apollo\nthrew toward him in a game. From the blood of the boy,\nthe god made a flower grow and named it hyacinth,\nafter the boy. The flower is red and has white markings\nthat resemble the letters AI, which sound like the Greek\nmourning cry. (How would you categorize this myth?) MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n18\nCLASSICAL MYTHOLOGY APOLLO 19\nApollo and Daphne by Bernini in the Galleria Borghese in Rome MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n20\nCLASSICAL MYTHOLOGY APOLLO 21\nClose up of Daphne’s face\nApollo bedded the mortal Coronis, but she then\ndecided to take a mortal lover. Apollo was informed\nof her betrayal by a crow, which he changed from its\nprevious white color to black. (This explains why all\ncrows are now black.) Coronis was pregnant with\nApollo’s child when she decided to sleep with the\nmortal, so Apollo killed them both, but he rescued the\nchild from her womb. The child, Asclepius, was raised\nby the good centaur Chiron [see Centaurs], from whom\nhe learned how to heal. Asclepius became so good at\nhealing that he started to bring the dead back to life.\nThis angered Zeus, so he killed Asclepius with his\nthunderbolt. Apollo was furious, so he killed the\nCyclopes who made the thunderbolts as retaliation.\nZeus wanted to imprison Apollo in Tartarus as\npunishment, but Leto intervened on her son’s behalf\nand convinced Zeus to force Apollo to live as a mortal\nfor a year. Asclepius was deified and became a god of\nmedicine and healing. The caduceus, Asclepius’ special\nstaff, became a symbol of healing. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n22\nCLASSICAL MYTHOLOGY\nA kylix depicting Apollo with his symbols in the Delphi Museum\nAPOLLO IN THE TROJAN WAR\nIn the Trojan War, Apollo was on the side of the Trojans.\nThe reason for this is unclear, although his epithet,\nLycian, may mean “from Lycia” (in what is now southern\nTurkey).\nTHE ORIGIN OF APOLLO\nIt is unclear where the god Apollo came from. He was\nnot originally a god of the Mycenaeans (the Greek- APOLLO 23\nspeaking peoples who migrated into the Greek\npeninsula sometime around 1900 BC), nor was he one\nof the pre-Hellenic gods of the indigenous people. His\nmother and sister were both Asiatic goddesses, but\nthere is no clear connection between them in origin.\nAgain, his epithet, Lycian, may point to a Near Eastern\nconnection. Ares\nRoman name: Mars\nFunction: god of war\n24 ARES 25 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n26\nCLASSICAL MYTHOLOGY\nThe Ludovisi Ares with Eros in the Palazzo Altemps in Rome\nAres was the son of Zeus and Hera, but because of his\nbloodthirstiness, not many of the gods cared much for\nhim, except Aphrodite. Ares and Aphrodite had a long-\nstanding affair [see Aphrodite]. Ares had four children\nwith her as well as many children with Thracian women\n[map]. He was the father of several of the Argonauts\nand of the Amazon Queen, Penthesileia.\nAres was worshipped mostly in areas outside of\nGreece and thus had barbaric connotations (in Greek,\nthe word “barbaros” [βάρβαρος] means “foreign”).\nThrace and Scythia were centers for his worship, and\nin myth he was largely associated with the Amazons\nand Colchians [map]. The belt Heracles stole from the\nAmazon Queen Hippolyte had been given to her by\nAres [see 12 Labors of Heracles]. The grove in which the\nGolden Fleece rested was sacred to Ares.\nDespite his bloodthirstiness, Ares was often beaten\nby others. Athena wounded him gravely while fighting\nat Troy. Heracles managed to take him down four times\nwhile fighting at Pylus. The giants Otus and Ephialtes\ntrapped him in a pot and he was stuck there for over a\nyear until Hermes rescued him.\nThe Greeks were not fond of Ares because he was so\nbloodthirsty. In fact, Zeus tells Ares, “To me, you are the\nmost hateful of the gods who hold Olympus, because\nquarreling is always dear to you, and war and battles”\n(Iliad 5.890-91). Zeus’ outburst is particularly striking\nbecause Ares was his own son. On the other hand, Mars\nwas always a favorite god of the Romans. Mars was the\nprotector of Rome, and he was their patron god similar ARES 27\nto the way Athena was for the Athenians. Mars was also\nespecially important to the Romans because he was not\nonly their war god but also an agricultural god. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n28\nCLASSICAL MYTHOLOGY ARES 29\nMars Resting by Diego Velázquez (1640) in the Prado Museum in\nMadrid The Argonauts\nTHE ARGO\nThe hero Jason was asked by his uncle, Pelias, to bring\nhim the Golden Fleece. [For more on the hero’s life\nand how Pelias came to give him this command, see\nJason]. The Golden Fleece was a ram’s fleece of pure\ngold; it was the prized possession of Aeëtes, the King\nof Colchis, which was located on the far-away shores\nof the Black Sea [map]. Jason organized an expedition\nof heroes from all over Greece to sail with him on this\nadventure. The roster of heroes varies from source to\nsource, but there are a few who appear on almost every\nlist: Heracles; Orpheus; Castor and Polydeuces (also\nknown as Pollux), the Dioscuri (meaning sons of Zeus);\nTelamon, father of the Greater Ajax; Peleus, father of\nAchilles; and Argus, the builder and eponym of the\nArgo, the ship on which the Argonauts sailed. Argus had\nbuilt the ship (with the help of Athena) with one beam\nfrom the sacred oak of Dodona. This beam could speak,\nand at some points it gave advice to the crew.\n30 THE ARGONAUTS 31\nTHE LEMNIAN WOMEN\nThe expedition first came to Lemnos, an island\ninhabited only by women, because all the men had\nbeen killed. Sometime before this, the women on the\nisland had neglected the cult of the goddess Aphrodite.\nAphrodite, becoming angry, of course, had caused the\nwomen to give off a terrible odor. The women’s\nhusbands naturally began to avoid their wives, and\neventually they sailed to Thrace and brought back\nconcubines to sleep with instead of their wives. The\nwomen were so angry that they killed all the men and\nthe Thracian women as well. (Only one man survived;\nthe princess, Hypsipyle, hid her aged father in a chest\nand put him out to sea; he drifted ashore on the island\nof Oenoë.) Because of this terrible deed, the Lemnian\nwomen lived in constant fear that the Thracians would\ncome and attack them in retaliation. When the\nArgonauts landed on Lemnos, the Lemnian women\nbelieved that the Thracians had come to kill them and\ngot ready for battle. Jason sent one of his crew, a son\nof Hermes, as a messenger to ask the women if the\nArgonauts could camp out on their shore. His words\nconvinced the women they were not in immediate\ndanger, so they convened a council in which they\ndecided that having a group of strong and handsome\nheroes around would not be a bad idea. The women\nsent a messenger to bring the heroes into the city.\nMost of the Argonauts were thrilled to spend the\nnight in the city (apparently the women no longer\nsmelled bad), but Heracles and a few others stayed with\nthe ship. Queen Hypsipyle became quite enamored MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n32\nCLASSICAL MYTHOLOGY\nwith Jason and offered to allow the Argonauts to come\nand stay. If Jason had any skill, it was charming women.\nHe thanked Hypsipyle graciously but told her that he\nand his men had to continue on with their journey.\nMost authors say that the Argonauts spent only a few\ndays on Lemnos, but this was long enough for a new\ngeneration of Lemnians to result.\nTHE DOLIONES\nAfter leaving Lemnos, the Argonauts sailed for the\nHellespont [see Hellespontus on map]. They landed on\nan island in the Sea of Marmara inhabited by a people\ncalled the Doliones. Their king offered to give them\nshelter and to restock their supplies because an oracle\nhad told him to offer aid to such travelers. Only a few\nmen were left to guard the ship, so when a group of\ngiants came upon the guards, the ship would have been\neasily destroyed had the mighty Heracles not been one\nof the guards. Heracles singlehandedly shot several of\nthe giants and chased the others away. The King of\nthe Doliones showed Jason the route for the next leg\nof their journey and the Argo soon headed off, but\ncontrary winds pushed the ship back into the harbor.\nBy now it was dark, however, and no one could see\nvery well. When the Argonauts disembarked, they did\nnot realize where they were; the Doliones believed a\ngroup of raiders had come to attack them, and so a\nbattle ensued. Eventually the Doliones retreated,\nhaving lost a large number of their men. The next\nmorning, the Argonauts realized their mistake when\nthey found the body of the king. The Argonauts and the THE ARGONAUTS 33\nDoliones together celebrated a magnificent funeral for\nall the deceased. A few days later, the Argonauts moved\non.\nHERACLES AND HYLAS\nThe next day they came to the coast of Mysia [map].\nHere, Heracles broke his oar, so the group put ashore\nto make a new one. Heracles went into the woods to\ncut down the wood for a new oar while his lover, Hylas,\nwent to a stream to get some water. At the stream,\nHylas’ striking beauty caused the nymph of the stream\nto abduct him by grabbing him and taking him down\nto her palace under the water. Heracles was\nunderstandably upset by Hylas’ disappearance and\nspent the entire night searching for him. He was still\nout searching the next day when the rest of the crew\nwere getting ready to leave, and in their hurry they\nleft Heracles behind. Heracles managed to find his way\nhome, where he continued his labors.\nPHINEUS AND THE HARPIES\nNext, the Argonauts headed for the Bosphorus [map]\nand landed in Salmydessus, the capital of Thynia. Here\nthey met the king, a man named Phineus, who was\nblind and was being hounded by the Harpies. The\nHarpies were women with the wings, beaks, and talons\nof birds. Their name comes from the Greek verb\nharpazein (ἁρπάζειν) meaning “to snatch,” and that’s\nwhat they did. Whenever Phineus tried to eat anything\nthe Harpies would swoop down and steal some of the MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n34\nCLASSICAL MYTHOLOGY\nfood; they left droppings on the rest, so as to make\nit inedible. So, Phineus was slowly starving to death.\nPhineus was very weak by the time the Argonauts\nfound him. He asked them for their help, and they of\ncourse obliged. Two of the Argonauts, Zetes and Calaïs,\nwere the sons of Boreas, the North Wind, and because\nof this, they had wings on their backs. A wonderful feast\nwas prepared, and when the Harpies came to snatch\nit, Zetes and Calaïs took flight and chased the Harpies\naway. The brothers would have killed the Harpies with\ntheir bows and arrows, but Iris (who was the rainbow\nand also the messenger of Zeus) told them that Zeus\nwanted them to spare the Harpies’ lives as long as the\nHarpies promised never to bother Phineus again. When\nZetes and Calaïs returned to Salmydessus, everyone\nenjoyed the feast. In return for their help, Phineus gave\nthem the information they needed to get past the\nSymplegades (otherwise known as the Clashing Rocks). THE ARGONAUTS 35\nThe Harpies stealing Phineus’ food on a krater in the\nArchaeological Museum in Ferrara, Italy\nTHE CLASHING ROCKS\nThe expedition now headed for the Clashing Rocks,\nlocated at the entrance to the Bosphorus [map]. These\nwere floating islands that would crash together with\ntremendous speed at unpredictable intervals. When\nthey got there, the Argonauts did as Phineus had\ninstructed and sent a dove to fly between the rocks.\nThey watched to see what would happen to the bird,\nsince Phineus had told them that if the bird survived,\nthey had a chance of making it through. If the bird\ndid not, it was useless and they would most definitely\nperish if they tried. The dove successfully made it\nthrough the rocks, though it lost its tail feathers. As the\nrocks separated, the sailors prepared to row as hard as\nthey possibly could because their lives depended on it. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n36\nCLASSICAL MYTHOLOGY\nThe boat rushed forward at top speed, but the waves\ncreated by the moving rocks nearly capsized the Argo.\nThe crew would have perished had Athena not stepped\nin and held the rocks apart while pushing the Argo\nthrough. But after the Argo escaped, the rocks stayed\nin place; the gods had decided long ago that once a\nship had passed through them, they would never crash\ntogether again.\nTHE SONS OF PHRIXUS\nThe rest of the journey to Colchis was relatively easy for\nthe Argonauts. Zeus steered the group away from the\nisland of the Amazons, Themiscyra, where the Amazons\nwere already prepared for a fight. After a little more\nsailing, the ship came to a desert island sacred to Ares\nwhich Phineus had advised them to visit because they\nwould find something vital to their mission while there.\nThe island was filled with birds with feathers so sharp\nthey could cut through flesh. To get onto the island,\nthe Argonauts held their shields over their heads to\nmake cover. They then clashed their weapons together\nto scare the birds away. Now able to move around, the\ncrew found the sons of Phrixus stranded on the island.\n(Phrixus was the youth who had been carried to Colchis\nby the golden ram. He had stayed in Colchis and had\nmarried King Aeëtes’ daughter.) The boys were able to\nshow the group the rest of the way to Colchis.\nJASON’S TASKS\nWhen the crew finally arrived in Colchis, they had no THE ARGONAUTS 37\nidea how they were going to get the golden fleece,\nbut Hera and Athena asked Aphrodite for her help.\nAphrodite sent her son, Eros (also known as Cupid),\nto shoot Medea, the daughter of King Aeëtes, with his\narrows so she would fall in love with Jason (Apollonius\nRhodius, Argonautica). The moment Medea saw Jason\nshe instantly fell in love with him. She brought them\ninto the house and her father, on account of xenia\n[see Xenia], had to allow the strangers to join them for\ndinner.\nAt the dinner banquet, Argus (one of Phrixus’ sons)\nexplained who they were and that they had come for\nthe Golden Fleece. Unexpectedly, Aeëtes told the\nArgonauts that he would certainly give them the Fleece;\nhe said he would only ask Jason to perform a few tasks\nfirst. All Jason had to do was yoke a pair of fire-\nbreathing bulls to a plow, sow a field with dragon’s\nteeth, and then, when fully-armed warriors sprang up\nfrom the teeth, he would have to kill all of the warriors.\nJason had no idea how he was going to perform these\ntasks, but he reluctantly agreed. Later that night,\nMedea, who was a priestess of Hecate and a very skilled\nwitch, paid a visit to Jason. Medea made Jason promise\nthat he would take her back to Iolcus with him if she\nhelped him complete these impossible tasks. Jason\neagerly agreed, and Medea gave him a potion and told\nhim what to do.\nThe night before he had to complete his tasks, Jason\nsacrificed to Hecate in the manner Medea had\ninstructed him. Then early the next morning he rubbed\nthe potion into his skin and went to find the fire-\nbreathing bulls. Jason was able to yoke the bulls to MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n38\nCLASSICAL MYTHOLOGY\nthe plow because the potion protected him from their\nfire. He plowed the field with the bulls and sowed the\ndragon’s teeth. From the soil came hundreds of fierce\nwarriors, but Jason had been told by Medea what he\nneeded to do. Jason threw a rock into the middle of the\nwarriors, and they, thinking their fellows were attacking\nthem, began to attack one another. Jason waited while\nthey fought one another until only one was left, and\nthen he killed the remaining warrior.\nSTEALING THE GOLDEN FLEECE\nAeëtes, angry that Jason had been able to complete\nthese impossible tasks, refused to hand over the Fleece,\nand the Greeks retreated to their camp. That night,\nMedea snuck out to the Greek camp and met with\nJason. She told him that if he agreed to marry her, she\nwould help him steal the Fleece. Jason agreed and they\nwent to the grove which housed the Golden Fleece. A\ndragon stood guard over the grove, but Medea put it\nto sleep with drugs. Jason killed the dragon and stole\nthe Fleece, and then he and Medea rushed back to the\nGreek camp, jumped into the ship, and sailed toward\nGreece, taking Medea’s younger brother, Apsyrtus, with\nthem. Aeëtes soon learned what had happened and\nsailed after them with his entire fleet.\nTHE MURDER OF APSYRTUS\nAs Aeëtes and his fleet began to gain on the Argo,\nMedea had run out of ideas. But she was desperately\nin love with Jason, so she did the only thing she could THE ARGONAUTS 39\nthink of. Medea killed her younger brother, Apsyrtus,\nand chopped him into pieces. Then she threw the\npieces over the side of the ship, one by one. Aeëtes,\nwhen he saw the pieces of his son floating by, stopped\nto pick up each of the limbs and eventually the head.\nHe forgot all about pursuing the Argo, but he returned\nto Colchis to give his dead child a decent burial. This\nallowed the Argonauts to escape the clutches of Aeëtes,\nbut it meant that Medea began her life with Jason by\nmurdering her own brother.\nCIRCE\nZeus was angry at the crew for the murder of Apsyrtus,\nso Hera blew them off their course, sending them to the\nwaters around Italy to protect them from Zeus’ wrath.\nThe beam of the ship with the ability to speak told the\ncrew that they could not return home until they had\nbeen purified of Apsyrtus’ murder by Aeëtes’ sister, the\nwitch Circe, who lived on the island called Aeaea. They\nfound Circe and she performed the proper sacrifices\nand purification rituals. After this was done she asked\nwho they were. Medea explained the story (minus the\ndeath of Apsyrtus) to her, and Circe was appalled to\nlearn that her niece had stolen the Golden Fleece. She\nordered the Argonauts to leave her island.\nTHE SIRENS\nNow that they had been purified of the murder, Hera\nhelped the crew of the Argo make their journey to\nIolcus. They passed the Sirens, who are described as MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n40\nCLASSICAL MYTHOLOGY\nbirds with the heads of women and the ability to sing so\nwonderfully that any sailor who heard their song would\njump out of the boat and swim toward their island\nwhere they would die of starvation. The Argonauts had\nOrpheus amongst their crew, and he played a song\nthat rivaled the song of the Sirens and allowed the\nArgo to pass unharmed. The Argo also passed by Scylla\n(a monster with six dogs for legs) and Charybdis (a\nwhirlpool that would suck up water and then\nregurgitate it) and would have surely perished had\nThetis (a sea nymph) and her sisters not guided the\nArgo through the waters. Thetis would later become the\nbride of one of the Argonauts, Peleus.\nRETURN TO IOLCUS\nAfter much wandering, the Argo finally made it back to\nIolcus, where Jason and Medea were married. For the\nrest of the story about Jason and Medea, see Jason. Artemis\nRoman name: Diana\nEpithets: Potnia Therōn (Mistress of Wild Beasts)\nSymbols: bow and arrow, quiver, hunting dogs, deer\nand other animals, fawn skin\nFunctions: goddess of hunting, wild animals\n(especially baby animals), and childbirth. The Romans\nconflated Diana with the Greek goddess of the moon,\nSelene (just as they identified Apollo with Helius, the\nGreek god of the sun).\nBIRTH OF ARTEMIS\nArtemis was the twin sister to Apollo and was the\ndaughter of Zeus and Leto [see Apollo]. Both Apollo and\nArtemis took revenge against anyone who attempted to\nharm their mother. Apollo and Artemis slew the giant\nTityus and killed the children of the mortal woman\nNiobe [see Apollo].\n41 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n42\nCLASSICAL MYTHOLOGY\nApollo and Diana Punishing Niobe by Killing her Children by\nAbraham Bloemaert (1591) found in the National Gallery of\nDenmark in Copenhagen\nARTEMIS’ CRUELTY: CALLISTO, ACTAEON,\nAGAMEMNON, ORION\nArtemis, like many other deities, was known for her\ncruel behavior, but Artemis seems to have been one of\nthe cruelest and most vengeful of the deities. In some\ncases, she would become angry and punish human\nbeings even if (at least in their own minds) they had\ndone nothing wrong. Artemis was a virgin goddess, and\nshe was accompanied by nymphs, who also were\nexpected to remain virgins. If any of these nymphs\nslipped up and lost their virginity, Artemis treated them ARTEMIS 43\nvery harshly. One such attendant was Callisto, whom\nZeus raped. Afterwards, Artemis changed Callisto into\na bear for breaking her vow of chastity. In another\nexample, the hunter Acteon was out hunting and\naccidentally stumbled upon the goddess bathing. She\nturned Acteon into a deer and allowed him to be torn\napart by his own hunting dogs. When Agamemnon, the\nMycenaean king, angered her, Artemis demanded that\nhe sacrifice his daughter Iphigenia to her before he was\nable to sail for Troy [see Agamemnon and Iphigneia].\nDespite the fact that Agamemnon did as she\ncommanded, Artemis’ sympathies in the Trojan War\nwere always with the Trojans. In some versions of the\nmyth of Orion, his death, too, was caused by Artemis’\nanger. He either challenged her, tried to rape her or\none of her attendants, or he had an affair with Eos, the\ngoddess of dawn; in any case Artemis shot him. But\nafter his death he was placed in the sky to become the\nconstellation, Orion. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n44\nCLASSICAL MYTHOLOGY\nThe Death of Actaeon by Titian (between 1559 and 1575) in the\nNational Gallery in London ARTEMIS 45\nDiana and Actaeon by Titian (between 1556 and 1559) in the\nScottish National Gallery in Edinburgh\nARTEMIS’ ORIGINS\nArtemis seems to have originally been a goddess of\nwild beasts from the Near East. She was similar to the\ngoddess Potnia Therōn (Lady of Wild Animals), with\nwhom she later became identified. She also has strong\nconnections to the Gorgon, Medusa. Many of the\nimportant figures among her retinue of nymphs are\nbelieved to be local goddesses who were similar in\nfunction to Artemis. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n46\nCLASSICAL MYTHOLOGY\nPotnia Theron with a gorgon’s head on a plate in the British\nMuseum ARTEMIS 47\nA plate depicting Potnia Theron with a woman’s head in the\nMykonos Museum Athena\nRoman name: Minerva\nEpithets: Pallas (maiden), Tritogeneia (unknown\nmeaning), Promachus (one who fights for her city),\nErgane (artisan or worker), Owl-Eyed, Polias (protector\nof the city), Parthenios (virgin), Gray-Eyed\nSymbols: owl, Nike, olive tree, aegis, snake\nFunctions: goddess of just wars, wisdom, and crafts;\npatroness of Athens; and helper of heroes\nTHE BIRTH OF ATHENA\nAthena was the daughter of Zeus and his first wife\nMetis. Gaia told Zeus that Metis would first bear a\ndaughter then a son who would overthrow his father.\nZeus, like his father and grandfather before him,\nwanted to avoid this fate, so when Metis became\npregnant, he swallowed his wife whole [see Zeus]. After\na few months, Zeus developed a splitting headache and\nasked Hephaestus (or in some versions, the Titan\nPrometheus) to help him relieve the pressure.\nHephaestus took up his axe and split open Zeus’ head,\nand out jumped Athena, fully dressed in armor.\n48 ATHENA 49\nAnother tradition has it that Athena was born near a\nriver called Triton, an etymological aetiological myth\nthat was created to explain her epithet Tritogeneia.\nThe birth of Athena on a pyxis in the Louvre\nATHENA AS THE PROTECTOR OF HEROES\nAthena was particularly fond of courageous youths and\nhelped many heroes in their quests. When Perseus was\nsent to kill the Gorgon, Medusa, Athena provided the\nsword and shiny shield needed to slay the Gorgon\nwithout looking at her. She gave the hero Bellerophon\nthe golden bridle he needed to ride the winged horse,\nPegasus; by riding on Pegasus’ back, Bellerophon was\nable to kill the monster, Chimera. The Argonauts were\nsaved from the Clashing Rocks by Athena’s help [see\nArgonauts]. Odysseus, however, because of his\ncunning, was one of Athena’s favorite mortals. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n50\nCLASSICAL MYTHOLOGY\nOdysseus’ return home after the Trojan War was only\npossible because of Athena’s machinations. Her\nintervention also helps him survive the Greater Ajax’s\nwrath in Sophocles’ Ajax. Whenever Odysseus is\ndepicted in a myth, Athena is never far away. ATHENA 51\nThe statue of Athena in the Nashville Parthenon is based upon\nthe ancient statue in the Athens Parthenon made from ivory and\ngold. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n52\nCLASSICAL MYTHOLOGY\nATHENA AND ARACHNE\nAthena, like the other gods, was quick to punish mortals\nwho thought they were equal to the gods. One such\nmortal was the weaver, Arachne. Arachne boasted that\nher weaving was as good as Athena’s. Athena was angry\nand challenged Arachne to a contest of weaving.\nAthena wove a tapestry depicting mortals who\nchallenged the gods and were punished. Arachne\nanswered with a tapestry depicting the scandalous\nbehavior of the Olympians. It was obvious that\nArachne’s skill was equal to Athena’s, and Athena was\nlivid so she beat the girl mercilessly. Arachne chose to\nhang herself to end her suffering, but Athena was not\nyet done with her and turned Arachne into a spider,\ngiving the tiny animal its name in Greek (arachne,\nἀράχνη) and its practice of weaving webs.\nATHENA AS THE PROTECTOR OF ATHENS\nThe city of Athens was named after Athena because she\nwas the Athenians’ protector and benefactor, but she\nhad earned that right by winning a competition with\nPoseidon for patronage over the city. Differing versions\nsay that either Zeus (and possibly other gods) or a\ncommittee of Athenian kings judged the contest. Either\nway, each divinity was asked to provide a gift for the city\nand the judges would decide who had given the better\ngift. Poseidon struck a rock with his trident and out\ncame a spring of saltwater, but Athena grew an olive\ntree. The judges decided that the olive was more useful\nthan the spring and awarded Athena the city. When ATHENA 53\nAthena was not living on Olympus, she often lived in\nthe Parthenon, the temple to her on the Acropolis in\nAthens. Thus, when Orestes came to Athena to judge\nwhether he should be punished for the murder of his\nmother, Clytemnestra, he came to her in Athens.\nAthena used this opportunity to establish the\nAreopagus council as the official court in Athens [see\nOresteia].\nThe Parthenon on the Acropolis of Athens MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n54\nCLASSICAL MYTHOLOGY\nThe west pediment of the Nashville Parthenon ATHENA 55 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n56\nCLASSICAL MYTHOLOGY\nAthena mourning a fallen Athenian soldier on a grave stele now\nlocated in the Acropolis Museum\nATHENA’S VIRGINITY\nLike the other virgin goddesses (Artemis and Hestia),\nAthena sometimes had to work to preserve her virginity\nagainst the advances of other immortals. One such\ninstance was when Hephaestus attempted to rape her.\nShe managed to break away from him before he could\nviolate her, but his semen fell to the ground. A child was\nborn from the mixing of the semen and the earth, and\nhe was named Erichthonius. Athena took the child and\nraised him in her temple, and he eventually became\none of the earliest Kings of Athens.\nTHE AEGIS\nAthena held the unique favor of her father and was\nallowed to use his aegis [see Aegis]. More often than\nnot, it is Athena, not Zeus, who is depicted with the\naegis. Athena is usually shown with the severed head\nof Medusa either on her aegis or on her shield. Perseus\ngave her Medusa’s head in gratitude for her aid in\nhelping him kill the Gorgon. ATHENA 57\nA statue of Athena in the Naples Museum\nATHENA AND THE LESSER AJAX\nBecause of Paris’ decision in the beauty contest\nbetween Athena, Hera, and Aphrodite, Athena sided MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n58\nCLASSICAL MYTHOLOGY\nwith the Greeks when the Trojan War broke out [see\nIntro to Iliad]. This did not stop her from brutally\npunishing the Lesser Ajax for an atrocity he committed\nduring the sack of Troy. (The Lesser Ajax was so called\nto distinguish him from the more famous warrior who\nwas also named Ajax. The more famous Ajax was\nknown as the Greater Ajax.) As the Greeks were sacking\nTroy, raping and pillaging as they went, Cassandra, a\ndaughter of Priam, sought protection in Athena’s\ntemple. When a person seeks the protection of a god\nor goddess in that deity’s temple, that person becomes\nsacred and should not be harmed. But Ajax pulled\nCassandra away from the statue of Athena, which she\nwas clutching. He then raped Cassandra in Athena’s\ntemple, enraging the goddess with his sacrilege and\ndesecration of her temple. She enlisted the help of\nPoseidon to destroy him. On his way home, Ajax’s ships\ncrashed onto rocks, but Ajax survived, shouting to the\nheavens, “not even the gods can kill me!” This boast\ninfuriated Poseidon, who split the rock Ajax was\nclutching, causing him to fall into the sea and drown\n(Homer, Odyssey, 4.499-511).\nTHE ORIGIN OF ATHENA\nAthena may possibly have originated as a warrior\ngoddess of the Mycenaeans, an early Greek-speaking\npeople based in the Peloponnese. She is associated\nwith snakes, but it is not clear what the significance of\nthe snake is to Athena. ATHENA 59\nStatue of Athena from the depiction of the Gigantomachy from\nthe Old Athena Temple on the Acropolis, now in the Acropolis\nMuseum Caduceus\nThe caduceus (kerykeion in Greek) was a herald’s staff\nwith two snakes wound around it. It was carried by\nHermes to signify his role as messenger and as guide\nfor souls to the Underworld. Hermes sometimes used\nthe caduceus as a way to channel his powers, such\nas waking or putting mortals to sleep [Homer, Iliad,\n24.343-345]. It should be carefully distinguished from\nthe rod of Asclepius, which had only one snake and was\nused by Asclepius in healing.\n60 Centaurs\nHalf-man, half-horse creatures\nCentaurs (sometimes called hippocentaurs) were\ncreatures with the torso and head of a man and the\nbody of a horse. As befits their part-beast, part-human\nstatus, they had trouble controlling their passions. Also,\nthey had a strong taste for wine but could not hold\ntheir liquor. At the wedding of the Lapith, Peirithoüs,\nthey all got very drunk and abducted all the women\npresent, including the bride. The Lapiths fought back,\nalong with Peirithoüs’ good friend, Theseus, and most\nof the centaurs were killed or banished. There were,\nhowever, a few civilized centaurs, such as Pholus, who\nhelped Heracles in his battle against the centaurs [see\nthe 12 Labors of Heracles], and the immortal Chiron,\nwho served as the teacher and mentor of several\nheroes, such as Jason, Asclepius, and Achilles.\n61 Chthonian Deities\nAll Greek deities can be divided into two types: the\nOlympians, who were thought of as living on Mount\nOlympus (or somewhere in the heavens), and the\nChthonians, who were thought of as living below the\nearth. Their name comes from chthōn (χθών), which\nis the Greek word for “earth” or “ground.” In order to\nsacrifice to one of the Olympian gods, an animal would\nbe ritually slaughtered and the less edible pieces would\nbe burned on an altar so the smoke could waft up to\nthe Olympians and nourish them. In a sacrifice to one\nof the Chthonians, on the other hand, a pit would be\ndug in the ground and an animal would be slaughtered\n(without any burning) in such a way that the blood\nwould pour into the pit. Libations (such as milk or wine)\ncould also be poured into the pit to give the gods\nsustenance. For a good example of chthonian sacrifice,\nsee Odyssey Book 10 lines 515-530 (in the Greek) or\nOdyssey Book 11 lines 23-37 (in the Greek).\n62 The Delphic Oracle\nThe word “oracle” comes from the Latin word oraculum,\nwhich means both a prophecy made by a god (or priest)\nand the place where the prophecy is given. Similarly,\nthe English word “oracle” has both meanings. So, the\nDelphic Oracle refers to the place where the prophecies\nwere given, but an “oracle” can also refer to a prophecy\nthat Apollo gave there.\nThe Delphic Oracle belonged to Apollo, and his\npriestess, called the Pythia, gave her oracles from inside\nApollo’s temple.\nThe Oracle at Delphi [map] seems to have originally\nbeen held by Gaia (Aeschylus, Eumenides 1-8).\nAccording to some accounts, Gaia had a snake or\ndragon, named the Python, that guarded her oracle.\nWhen Apollo came to take over the oracle, he first had\nto kill the dragon in order to take possession of it.\nApollo’s priestess got her title, the Pythia, from the\nPython.\n63 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n64\nCLASSICAL MYTHOLOGY\nThe Sacred Way at Delphi with the remains of the Athenians’\nTreasury\nDelphi was (and still is) located in central Greece, on the\nside of Mount Parnassus. The temple of Apollo, where\nthe prophesies were given, was (and still is) situated\nin an incredibly beautiful spot about half way up the\nmountain. This is one of the most beautiful places on\nearth, and the Greeks clearly chose this spot for the\ntemple with good reason. THE DELPHIC ORACLE 65\nThe Temple of Apollo at Delphi\nTHE CONSULTATION PROCEDURE\nThere were many other oracles in Greece, but the\nOracle at Delphi was the most famous, and everyone\nwho could afford to consult the Oracle at Delphi\npreferred to do so. Of course, there was a long waiting\nperiod to consult the oracle (sometimes several\nmonths), and there were a number of expensive,\npreliminary sacrifices. Most of the people who\nconsulted the Oracle at Delphi were wealthy individuals\nor even heads of state. The long path leading up the\nmountain to Apollo’s temple, called the Sacred Way,\nwas lined with treasure houses. These treasuries were\nfilled with costly gifts that leaders and cities had given\nto Apollo. Some of these treasuries are still standing,\nand a very few of those precious gifts can still be seen\nin the museum at Delphi. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n66\nCLASSICAL MYTHOLOGY\nAlbert Tournaire’s recreation of Apollo’s Temple at Delphi and\nthe Sacred Way leading up to it.\nWhen someone came to ask a question of the Oracle,\nhe would need to make a preliminary sacrifice of a\ngoat, and then purify himself in the nearby Castilian\nSpring. Then he would approach the adyton of Apollo’s\ntemple. The adyton is a room inside the temple that\nwas off limits; no one could go in. It is unclear whether\nthose who were consulting the oracle were allowed to\ngo inside the adyton or if they had to remain outside.\nThe Pythia is usually conceived of as sitting on a tripod\nwhen she gave her prophecies. A tripod (as its name\nimplies) was a three-footed stand, usually made of\nmetal. Tripods had a round, metal band around the top,\nand they were usually used to hold a cauldron over the\nfire for cooking. But in this case, the Pythia would sit on\nit, almost like she was sitting on a three-legged stool, to\ngive her prophecies. THE DELPHIC ORACLE 67\nThe Pythia on her tripod giving an oracle on a kylix in the Altes\nMuseum in Berlin\nAfter the person consulting the Oracle asked his\nquestion, the Pythia would go into a trance; it was\nbelieved that Apollo himself possessed her. She would\nspeak and a priest (or several priests) who were\nstanding nearby would take down what she said and\ntranslate her words into a poem written in hexameters.\nIt is usually assumed that the Pythia’s original words\nwere coherent, but not very clear. Of course, there is no\nway to know for sure what her words were really like,\nbut perhaps we can get a good idea from Cassandra’s\nprophecies in Aeschylus’ play, the Agamemnon. In that MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n68\nCLASSICAL MYTHOLOGY\nplay, Cassandra gives several prophecies that make\nsense to the audience (because we know what is going\nto happen), but are so fragmented and confusing that\nthe other characters in the drama do not understand\nthem.\nThe Oracle by Camillo Miola (1880) in the Getty Museum\nOnce the Pythia’s words were translated into\nhexameter poetry, the poem was written down and\ngiven to the person who sought the advice; it was\nalways the responsibility of the recipient to interpret\nthe oracle correctly. And the oracles, even in their final\nform, were always ambiguous. Frequently (though not\nalways), the recipients did not interpret them correctly,\nand they suffered as a result. THE DELPHIC ORACLE 69\nFAMOUS EXAMPLES OF ORACLES\nFor example, Aegeus, the king of Athens, asked the\nDelphic Oracle how he could have children, and the\nOracle said: “Do not open the foot of the wineskin until\nyou return home.” [see Theseus]\nAccording to Herodotus, Croesus, the king of Lydia,\nasked the oracle if he should go to war with Persia.\nLydia was a large and very prosperous kingdom in what\nis now central Turkey, but Cyrus, the king of Persia,\nhad recently expanded his kingdom so that it bumped\nup against Lydia’s borders. Croesus felt threatened by\nthe Persian expansion, so he wanted to know if he\nshould attack Persia before Persia attacked him. The\nPythia answered: “If you go to war against Persia, you\nwill destroy a great empire” (Herodotus 1.53). Croesus\ninterpreted this to mean that he would destroy Persia,\nand so he gathered his forces and attacked. But\nCroesus lost the war, and in the end he was forced\nto admit that he had destroyed his own great empire\n(Herodotus 1.91).\nThere are many examples of people misinterpreting\noracles (usually because, like Croesus, they interpret it\naccording to what they want to hear), but there are\na few examples of people who interpret their oracles\ncorrectly, and benefit greatly as a result. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n70\nCLASSICAL MYTHOLOGY\nTHE OMPHALOS\nThe Omphalos, or the navel stone of the earth, in the\nArchaeological Museum of Delphi\nThe Greeks believed that Delphi was located at the THE DELPHIC ORACLE 71\ncenter of the earth. Near Apollo’s temple was a rock\n(about 2-3 feet high) shaped similarly to a beehive and\ncarved with a floral pattern. This was the omphalos (or\n“navel” in Greek), which was considered to be the navel\nstone of the earth. In art, Apollo is sometimes shown\nusing this as his seat, implying that his oracle was in\nsome sense the epicenter of everything that occurred\non earth. According to Hesiod (Theogony 497-500), this\nwas originally the stone that Rhea had given to Cronus\nto swallow instead of Zeus. Zeus placed it at Delphi\nafter Cronus had vomited it up (with the other\nOlympians) and Zeus had won the battle with the Titans\nto gain control over the cosmos (see Origins).\nThis coin, minted in Sardis, depicts Antiochus Hierax of the\nSeleucid Empire. The reverse side depicts Apollo sitting on the\nomphalos. Demeter\nRoman name: Ceres\nEpithets: Chthonian (shared with daughter\nPersephone; refers to their status as goddesses\nassociated with the earth, χθών [chthōn] being a Greek\nword for earth or land)\nSymbols: wheat, grain\nFunctions: goddess of agriculture and grain\nDEMETER AND PERSEPHONE\nDemeter was a daughter of Cronus and Rhea, and was\nswallowed by her father (along with the rest of Cronus\nand Rhea’s children) shortly after her birth [See\nOrigins]. After Zeus rescued his older siblings from their\nfather, Demeter had an affair with her brother Zeus,\nwhich resulted in a daughter, Persephone. Hades fell\ndeeply in love with Persephone, and the following story\nabout them is told in the Homeric Hymn to Demeter.\nZeus gave his consent for Hades to marry his daughter,\nbut because he believed that Demeter would not\napprove of the match, he told Hades to abduct\nPersephone and take her to his realm in the\n72 DEMETER 73\nUnderworld. With the aid of Gaia (Mother Earth, who is\nalso known as Ge), Hades did just that.\nPersephone was out gathering flowers with other\nyoung nymphs and goddesses, and she spotted an\nunusual and beautiful narcissus flower, blooming with\nthe help of Gaia in a particular spot where a trap had\nbeen set by Zeus and Hades. When Persephone went\nto pluck the flower, the earth split open and out came\nHades in his chariot. He snatched up the girl and took\nher down to his kingdom beneath the earth.\nFor nine days Demeter searched far and wide for\nher daughter, but no one knew what had happened to\nPersephone until Demeter happened upon Hecate, a\nmoon goddess who had heard the abduction but could\nnot say who had taken Persephone. Together, Hecate\nand Demeter continued to search for Persephone until\nthey came upon Helius, the sun god. Helius, who sees\neverything, told the goddesses the information they\nwished to know, that Zeus had allowed Persephone\nto be taken by Hades. Helius encouraged Demeter to\naccept the situation, but instead she grew so angry that\nshe refused to go back to Olympus [see Olympus Mons\non map]. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n74\nCLASSICAL MYTHOLOGY DEMETER 75\nThe Rape of Proserpina by Bernini in the Galleria Borghese in\nRome.\nClose up of Bernini’s Rape of Proserpina\nDEMETER IN ELEUSIS\nDemeter wandered the earth in the likeness of an old\nwoman named Dos until she came upon the city of\nEleusis. There, at the town well, she met the daughters\nof the king, who offered to help her find work as a\nnurse. (They did not recognize her as a goddess\nbecause of her disguise.) In fact, they said that their\nmother, Metaneira, had just given birth to a baby boy,\nand that she would probably welcome Dos into her\nhome as a nurse.\nSo Demeter, disguised as Dos, became the nurse for MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n76\nCLASSICAL MYTHOLOGY\nthe son of the king, Demophon. As a way of thanking\nthe family for their kindness, Demeter began a process\nthat would make the boy immortal. She gave him\nambrosia to eat (ambrosia is the food of the gods) and\nevery night she would place him in the fire to burn\naway his mortal parts. One night, Metaneira, the child’s\nmother, visited the nursery to see how the old woman\nwas doing with the boy and found him in the fire. She\nscreamed in alarm, but this angered Demeter, who\n(being a goddess) did not like her actions questioned.\nDemeter took Demophon out of the fire (informing\nMetaneira that her son would have become immortal)\nand then she revealed her divinity to the queen.\nDemeter now revealed herself in her true form; she\nbecame young and beautiful, and the house was filled\nwith a brilliant light. The Eleusinians were distraught\nat having angered a goddess, and they wanted to\npropitiate her. Demeter instructed the Eleusinians to\nbuild a temple to her, which they did, and she\nestablished her mystery cult in the city. But Demeter\ntook up her abode in her new temple, and she refused\nto return to Olympus.\nPERSEPHONE AND THE SEASONS\nStill without her daughter, Demeter was so angry at\nZeus that she stayed in her temple in Eleusis and would\nnot join the other gods on Olympus. Furthermore, she\ncaused a drought on the earth which lasted for an\nentire year, and nearly killed all the mortals. Zeus\nrealized that if all the mortals died there would be no\none to sacrifice to the gods, so he sent Hermes to DEMETER 77\npersuade Hades to let Persephone return to her\nmother. Hades agreed to allow Persephone to return,\nbut before she left, he tricked her into eating a seed\nfrom a pomegranate. Demeter was ecstatic to reunite\nwith her daughter, but her spirits fell when she learned\nthat Persephone had eaten during her time in the\nUnderworld. There seems to have been a rule that if\nsomeone eats anything in Hades, even something as\nsmall as a pomegranate seed, they can never leave. A\nbargain was struck, however, between the god of the\nUnderworld and the goddess of grain: for two thirds of\nthe year (spring, summer, and early fall), Persephone\nwould live with her mother and the plants would grow,\nbut for the remaining third (late fall and winter), she\nwould live with her husband below the earth and all\nthe plants would die (Homeric Hymn to Demeter). This,\nof course, is the origin of the seasons (a natural\naetiological myth).\nTRIPTOLEMUS\nIn some versions of the story, after Demeter’s time in\nEleusis, the goddess lent her chariot to a young man\nfrom the city, Triptolemus, so he could spread\nknowledge of her gifts, such as the planting and\nharvesting of crops—especially wheat. She aided him\nwhen foreign kings did not take kindly to the gifts and\nhelped him gain the throne of Eleusis. In return, he\nbegan the tradition of the festival to Demeter called the\nThesmophoria. This was a festival celebrated by women\nall over Greece, and it was the second most prominent\nrite for Demeter after the Eleusinian Mysteries. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n78\nCLASSICAL MYTHOLOGY\nDemeter and Kore (Persephone) with Triptolemus on a relief in\nthe museum at Eleusis DEMETER 79\nTHE ORIGIN OF DEMETER\nDemeter was probably an indigenous pre-Hellenic\ngoddess of fertility. Her name means “Mother Da,”\nwhich may or may not mean “Mother Earth”. She is\nclosely connected with her daughter and is worshipped\nin the manner of chthonian deities. [See Chthonian\nDeities] Dionysus or Bacchus\nRoman name: Bacchus or Liber Pater (Free Father)\nEpithets: Twice-Born, Bromios (Thunderer)\nSymbols: the thyrsus (a staff carried by maenads),\nthe maenads or bacchae or bacchants (his female\nfollowers), vines, satyrs, wine, drinking cup, bull,\npanther, snakes\nFunction: god of wine and drunkenness\nTHE BIRTH OF DIONYSUS\nDionysus was the son of Zeus and the mortal woman\nSemele, who was the daughter of Cadmus, King of\nThebes [see Thebae on map]. When Hera learned that\nSemele was pregnant with her husband’s child, she\ndisguised herself as Semele’s nurse and convinced the\ngirl she should demand that Zeus show himself to her\nas he did to his wife, but first she should make him\nswear to meet any demand she might make. Semele\ndid so and Zeus was forced to comply. Unfortunately, it\nseems that Zeus showed himself to Hera in the form of\na lightning bolt. So, Semele was struck by Zeus’ lightning\nand died in a blaze. Hermes rescued the unborn baby\n80 DIONYSUS OR BACCHUS 81\nfrom Semele’s womb and the child was sewn into Zeus’\nthigh, where he stayed for the rest of the pregnancy.\nWhen he was ready to be born, Dionysus was delivered\nfrom his father’s thigh, which explains Dionysus’\nepithet, Twice-Born. Hermes spirited the boy away to\nlive with his aunt, Ino (one of his mother’s sisters). Ino\nand her husband, Athamas, raised Dionysus as a girl\nto try to hide him from Hera’s wrath, but Hera was\nnot fooled and caused Ino to go mad. After several\nmishaps, Ino jumped into the sea, where she became\nthe goddess Leucothea.\nDIONYSUS AND THE TYRRHENIAN PIRATES\nWhen Dionysus was still a young boy, he found himself\nin need of passage to the island of Naxos [map]. He\nasked some Tyrrhenian (Etruscan) pirates for a ride and\nthe pirates agreed, but they actually planned to kidnap\nhim, believing that he was the son of a wealthy family\nwho would pay a hefty ransom for their child. While\nat sea, the crew tried to tie him up, but the bonds fell\naway of their own accord. At this point the helmsman\nrecognized that this was no ordinary boy and tried to\nprevent any harm coming to Dionysus, but the captain\nignored the helmsman’s warning and told the sailors to\nhold on to the boy. Suddenly, wine began to flow all\nover the ship; vines began to grow from the sails and ivy\nbegan to twine around the mast. Then Dionysus turned\ninto a lion and a bear appeared on the deck. The lion\nseized the captain and began to tear him apart, and\nthe sailors jumped into the sea, turning into dolphins.\nDionysus, now back in human form, prevented the MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n82\nCLASSICAL MYTHOLOGY\nhelmsman from following his comrades into the sea\nand told him that his aid would be rewarded and no\nharm would come to him.\nDionysus and the Tyrrhenian pirates on a kylix in the Staatliche\nAntikensammlungen in Munich\nDIONYSUS AND PHRYGIA\nHera still hated Dionysus and she drove him mad,\ncausing him to run away and wander around the world\nuntil he came to Phrygia (in what is now central Turkey).\nHere he met Cybele, a Phrygian mother goddess whose DIONYSUS OR BACCHUS 83\nworship had been accepted by the Greeks. Cybele\ncured him of his madness, and Dionysus established his\ncult and rites of worship. Dionysus’ rites were similar\nto those of Cybele, and they involved drinking, wild\ndancing, playing the tambourine, and a feeling of\necstasy, or divine possession. (“Ecstasy” is from a Greek\nword meaning “to stand outside oneself.”) Dionysus\nalso gained a group of female followers, called\nmaenads (or bacchae or bacchants), who followed him\naround, singing, dancing, drinking, and playing the\ntambourine. Maenads (their name means “mad\nwomen”) are usually shown in a state of ecstasy.\nDionysus is also usually accompanied by satyrs. Satyrs\nare men with goat’s legs, horse’s tails, and a vigorous\nappetite for wine and sex. They are often shown with\nhuge erections. Dionysus then set his sights on\nestablishing his worship in his homeland, so he traveled\nback to Greece. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n84\nCLASSICAL MYTHOLOGY DIONYSUS OR BACCHUS 85\nA dancing maenad found in the Metropolitan Museum of Art in\nNew York City\nGOD OR MORTAL?\nDionysus’ status as a god was always an issue. There\nis an informal rule that if you have one divine parent\nand one human parent, then you are a human (usually\na hero) and not a god. Examples include Achilles,\nTheseus, Helen of Troy, Sarpedon, Aeneas, and many\nothers. But there were two exceptions to this rule:\nHeracles (Hercules), who became a god and was taken\nup to Mt. Olympus upon his death, and Dionysus.\nDionysus insisted that he was always a god (maybe\nbecause he was born from Zeus’ thigh), and stories like\nthe Tyrrhenian Pirates (told above) seem to confirm\nthis. But no one believed him because his mother was\na mortal. So, when Dionysus traveled back to Greece\nto establish his rites, he had trouble convincing people\nthat he really was a god.\nRESISTANCE MYTHS\nThere are several Resistance Myths connected with\nDionysus. Resistance Myths are stories about men or\nwomen who try to resist the worship of a particular\ngod or goddess. In these Resistance Myths, the attempt\nof the mortal to resist the god’s worship always ends\nbadly: the god or goddess destroys the resisting human\nand succeeds in establishing his or her worship. There\nare a number of Resistance Myths attached to MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n86\nCLASSICAL MYTHOLOGY\nDionysus, more than for any other god or goddess.\nMortals resisted Dionysus’ worship partly because they\ndid not believe he was a god, and partly because his\nworship involved drinking, drunkenness, open sexual\nexpression, and the loss of one’s reason or self-control.\nA maenad and an ithyphallic satyr on a kylix in the Staatliche\nAntikensammlungen in Munich\nThe most famous Resistance Myth connected with\nDionysus occurred in his city of origin, Thebes, with his\ncousin Pentheus. After Semele died, her sisters, most\nnotably Agave, spread the rumor that Semele had lied\nabout the paternity of her child and Zeus had punished DIONYSUS OR BACCHUS 87\nher for it with his thunderbolt. As a result, no one in\nThebes believed that Dionysus was divine. The years\npassed, and because Cadmus, the King of Thebes, had\nonly daughters, he gave the throne to Agave’s son\nPentheus when he decided to retire. He was a very\nyoung man, perhaps only about twenty or twenty-one\nwhen he became King of Thebes. Dionysus came to\nThebes to introduce his worship to his homeland, but\nPentheus forbade any of the Theban women to worship\nhim. Pentheus probably did this because he did not\nbelieve Dionysus was a god, but he also seems to have\nbeen a straight and narrow kind of guy, who was\ndisgusted by Dionysus’ rituals. A third reason may have\nbeen that Pentheus felt that this was a good\nopportunity to establish his authority. At any rate,\nPentheus did not allow the women of Thebes to\nworship Dionysus. Dionysus, however, caused all the\nwomen of Thebes to go mad and run away from home.\nThey all left their fathers and husbands and ran away\nto Mount Cithaeron, where they became maenads,\nsinging, dancing, drinking wine, and worshipping\nDionysus. Pentheus was upset at this behavior and\ntried to imprison Dionysus, who had disguised himself\nas a priest of Dionysus. The god easily escaped from\nprison, of course, and he took a terrible revenge upon\nPentheus, which is depicted in Euripides’ play, The\nBacchae. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n88\nCLASSICAL MYTHOLOGY\nAgave and Ino tearing apart Pentheus on a lekanis found in the\nLouvre\nMIDAS\nDionysus extensively traveled around the world. While\nhe was traveling to India, one of his older satyrs, Silenus\n(when referred to in the plural, sileni, they are a group\nof older and prophetic satyrs, and Silenus is usually\nconsidered their leader), wandered away from the\ngroup and (as he was a little drunk) he fell into a deep\nsleep. While he was sleeping, he was captured by a\ngroup of Phrygians, who sent Silenus to their king,\nMidas. Midas cared for Silenus until Dionysus came to\ncollect him. Dionysus was grateful and offered Midas\nany wish he desired as thanks. Midas asked for the\nability to turn anything he touched into gold, and being\nunable to dissuade Midas from this wish, Dionysus\ngranted it. Midas was initially thrilled, but before too\nlong it became apparent that he could not eat or drink\nbecause anything he tried to place in his mouth turned\nto gold. Midas begged Dionysus to take the gift back, DIONYSUS OR BACCHUS 89\nbut once a god gives a gift, it cannot be taken back.\nHowever, Dionysus was able to help Midas and told him\nto bathe in Pactolus river so that his gift would transfer\nto the river (this myth explains why there is so much\ngold in the river).\nDIONYSUS AND ARIADNE\nWhen Ariadne was abandoned by Theseus on Naxos,\nDionysus found her there and married her [see\nTheseus]. She gave birth to several sons, and Hesiod\nsays that Zeus granted her immortality so she could live\nwith her husband. Some scholars believe that Ariadne\noriginated as a Cretan goddess who was downgraded\nto a mortal when the Greeks appropriated the story. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n90\nCLASSICAL MYTHOLOGY\nBacchus and Ariadne by Titian (1520–1523) in the National\nGallery in London\nTHE ORIGIN OF DIONYSUS\nScholars are divided on the origins of Dionysus. He\nseems to be a Mycenaean god because his name is\nfound in a Mycenaean inscription, but his myths and\nrites (called orgia) are very eastern. His rituals involved\nintoxication and a loss of control of the body (called\necstasy, with ec- meaning “out” and -stasy meaning\n“stand”; together they mean “to stand outside of\noneself and allow Dionysus to possess the body”) and\nhis sacrifices were performed by tearing the animal DIONYSUS OR BACCHUS 91\nlimb from limb (this process is called “sparagmos”).\nSometimes Dionysus’ worshippers would eat the\nsacrificial victim raw (this is called “homophagia”). These\nstrange rituals made the Greek traditionalists uneasy\nbecause they had that foreign flair and flew in the face\nof the Greek ideals of self-control and moderation\n(sophrosyne).\nAt some point the theater was connected to\nDionysus, but it is unclear how that relationship began.\nIn Athens, the City Dionysia, a festival to Dionysus,\nbecame the premier competition for playwrights to\nshow off their work and for Athens to show off its\ncultural achievements to travelers coming through the\ncity. Dionysus may have been connected through his\nability to alter perception, much like theater did, and\nthe addition of the art form to the festival made the\nproceedings more Greek in nature. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n92\nCLASSICAL MYTHOLOGY\nA maenad performing ritual “sparagmos” on a vase found in the\nCabinet des Médailles in Paris Hades\nRoman name: Pluto, Dis (wealth), or Orcus\nEpithets: Aïdoneus (the Unseen One), All-Receiver,\nPluto (wealth)\nSymbols: scepter, grain (fertility), rooster (fertility),\nCerberus\nFunctions: god of the Underworld and the dead\nA krater depicting Hades and Persephone in the\nAntikensammlungen Museum in Munich\n93 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n94\nCLASSICAL MYTHOLOGY\nHades was one of the children of Cronus and Rhea\nwhom their father swallowed. After being rescued by\nhis brother Zeus and helping Zeus gain control of the\ncosmos [see Origins], the three brothers Zeus,\nPoseidon, and Hades all drew lots to decide who would\nrule over various parts of the world [See Zeus]. Hades\nbecame the ruler of the Underworld. Hades was\nmarried to his niece, Persephone, whom he abducted\n[See Demeter].\nA kylix depicting Persephone and Hades in the British Museum\nThere are very few myths about Hades other than the\nstory of how he abducted and married Persephone. HADES 95\nAfter the kerfuffle created by this incident had\nsubsided, Hades and Persephone seem to have settled\ndown to a rather ordinary married life as King and\nQueen of the Dead.\nHades depicted as the Egyptian god Serapis with Cerberus and\nPersephone depicted as the goddess Isis in the Museum in\nHeraklion, Crete\nThe name of the Underworld is sometimes referred to\nas Erebus (Ἔρεβος), which means “darkness” in Greek,\nbut it is more frequently called the House of Hades.\nIn practice, however, the name, “House of Hades,” is\nusually shortened to just “Hades.” For this reason, the\nterm “Hades” refers to both the name of the god and\nthe name of the place over which he rules. Different\nauthors describe Hades (the Underworld) differently, MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n96\nCLASSICAL MYTHOLOGY\nbut there are several common features. The three-\nheaded dog, Cerberus, acts as a guard dog who\nprevents dead souls from escaping as well as\npreventing live people from getting in. There are\nseveral rivers in Hades, including the Styx (Στύξ,\nmeaning “hateful”), which the gods swear by, and the\nAcheron (Ἀχέρων, meaning “woeful”). Later authors\nadded the river Lethe (Λήθη, meaning “forgetfulness”),\nwhich causes the souls who drink from it to forget their\npast lives; see Plato, Republic 10.621 a-d and Vergil,\nAeneid 6.714-715.\nFor most people, life in the Underworld was a hollow\nexistence where their souls slowly lost consciousness\nand continued on as shells of their former selves. (For\nan extended portrayal of the souls in Hades, see\nHomer, Odyssey, Book 11.) The Islands of the Blessed,\nhowever, sometimes called Elysium or the Elysian\nFields, was a place where a select group of souls lived\nin bliss. They kept their former personalities as well as\ntheir consciousness, and they continued to pursue the\nactivities that had brought them pleasure while they\nwere alive. Homer says that Elysium is reserved for the\nclose relatives of the gods (Homer, Odyssey, 4.561-569)\nwhile later authors, like Pindar (Olympians 2.68-78),\nsuggest that a virtuous life would allow a soul to spend\neternity in Elysium. Hephaestus\nRoman name: Vulcan or Mulciber\nFunction: god of the forge\nHephaestus was sometimes considered the son of\nboth Zeus and Hera, though other accounts say that\nHera gave birth to Hephaestus parthenogenically in\nresponse to Zeus giving birth to Athena by himself. In\nsome versions of his birth, Hephaestus was born lame;\nHera was less than pleased and threw him off Mount\nOlympus [see Olympus Mons on map]. Hephaestus\nlanded in the sea, where he was cared for by the sea\ngoddesses Thetis and Eurynome while he grew. He\nsoon proved to be a master craftsman, and he built a\nbeautiful throne for his mother that trapped her when\nshe sat in it. Numerous gods tried to convince\nHephaestus to release Hera, but he refused until\nDionysus came and got Hephaestus really drunk. This\naid rendered to her is often cited as the reason Hera\nput aside her hatred of Dionysus [see Dionysus].\nAccording to another version of his birth myth,\nHephaestus was born perfectly healthy, but when he\nintervened on behalf of his mother in a dispute\nbetween his parents, Hera and Zeus, Zeus flung\nHephaestus off Mount Olympus. Hephaestus fell for a\n97 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n98\nCLASSICAL MYTHOLOGY\nfull day until he crash-landed on the island of Lemnos.\nThe Lemnians took care of him as best they could, but\nthe god was left crippled. Hephaestus was grateful to\nthe Lemnians and established his workshop on the\nisland. The Romans claimed that Vulcan’s forge was\nlocated beneath Mount Aetna on the island of Sicily.\nWhen the volcano on Mount Aetna erupted, the\nRomans said that Vulcan was working in his forge.\nHephaestus was married to Aphrodite, but theirs was\nnot a happy marriage. Aphrodite had a long-standing\naffair with the war god, Ares. Whenever Hephaestus\nwould leave home, Aphrodite and Ares would jump into\nbed. When the sun god, Helius, informed Hephaestus\nof what his wife did while he was away, Hephaestus\ncame up with a plan to catch the two in the act. He built\na golden net which was so fine that it was invisible and\nset it up above his bed. He then told his wife that he\nwas taking a trip to Lemnos to visit his forge and hid.\nSoon, Aphrodite and Ares were in the bed together and\nthe net fell upon them, trapping them right where they\nwere. Hephaestus came in with all the other Olympians\nto jeer at the lovers, who were caught in flagrante delicto\n(in a blazing crime). HEPHAESTUS 99\nVenus and Mars Surprised by a Net by Costantino Cedini in the\nPalazzo Emo Capodilista in Padua, Italy Hera\nRoman name: Juno\nEpithets: Cow-eyed, Eileithyia\nSymbols: cow, peacock, scepter\nFunctions: goddess of marriage and consort to Zeus\nTHE BIRTH OF HERA\nHera was a daughter of Cronus and Rhea, and, like\nher siblings (except Zeus), she was swallowed by her\nfather only to be rescued by her youngest brother, Zeus\n[see Origins]. She married Zeus and became Queen\nof the Gods. Together, they had three children: Ares,\nHebe (goddess of youth), and Eileithyia (goddess of\nchildbirth). Some versions say that Hephaestus is also\nher son by Zeus, but more commonly she gave birth\nto Hephaestus independently because she was angry\nat Zeus for giving birth to Athena on his own [see\nHephaestus]. According to the Homeric Hymn to Apollo,\nhowever, Hera actually gave birth to the monster\nTyphoeus as a way to get back at Zeus for giving birth\nto Athena.\n100 HERA 101\nHera and Prometheus on a kylix in the Cabinet des Médailles in\nParis\nHERA’S CHARACTER\nHera’s character is defined by her wrath. Despite being\nthe goddess of marriage, she was unable to prevent\nher husband from constantly taking up new lovers. She\ncould not punish him, so she would punish the lovers\nand the children produced from these affairs. She tried\nto prevent Leto from giving birth [see Apollo], she\ntricked Semele into her death [see Dionysus], and she MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n102\nCLASSICAL MYTHOLOGY\ndoggedly tortured Heracles throughout his life [see\nHeracles]. Because Dionysus and Heracles eventually\nbecame immortals, Hera had to make peace with them,\nbut it did not come easily [see Dionysus and Heracles].\nZeus once seduced and abducted a girl by the name of\nAegina, and he took her to the island of Oenone. Hera\nthrew a snake into the source of water for the entire\nisland, poisoning and killing most of the island to get\nrevenge on one girl. When Zeus fell in love with her\npriestess, Io, and turned the maiden into a cow, Hera\nwas furious with the girl. After Hermes killed Argus,\nwho was keeping watch over Io [see Hermes], Hera\nmade Io wander the world as a cow until she came\nto Egypt. She was transformed back into her human\nform and bore a son. Hera arranged for the child to\nbe kidnapped. With the help of Zeus, mother and child\nwere eventually reunited and settled in Egypt where\nIo eventually became the Egyptian goddess Isis (this\nis only what the Greeks believed, the Egyptians had\nworshiped Isis long before Greek culture began). HERA 103\nJuno and Argus by Peter Paul Rubens from 1610 in the\nWallraf-Richartz Museum in Cologne\nThe goddess’ wrath was not exclusive to Zeus’ lovers.\nShe helped the Argonauts over the course of their\nadventure so she could punish Pelias for his impiety.\nShe blinded the seer, Teiresias, because he sided with\nZeus in an argument they asked him to solve. She sent\nthe Sphinx to Thebes to punish the king, Laïus, for\nabducting Chrysippus, the son of Pelops. The Greeks\nhad Hera’s support in the Trojan War because she was\nstill angry over Paris’ decision to award Aphrodite the\nApple of Discord [see Intro to Iliad]. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n104\nCLASSICAL MYTHOLOGY\nHERA’S ORIGIN\nHera most likely originated as a Pre-Hellenic goddess\nof fertility, which runs into her role as a goddess of\nall the stages of life for a woman: girl, new bride, and\nold woman. She is often conflated with her daughter,\nEileithyia, as a goddess of childbirth, as is her Roman\ncounterpart, Juno, with the Roman goddess of\nchildbirth, Lucina. Hera had the unique ability to\nbecome a virgin again every year by bathing in a spring\ncalled the Canathus. Heracles\nRoman name: Hercules\nFunctions: son of Zeus, mortal hero, and eventually a\ngod\nTHE BIRTH OF HERACLES\nHeracles was the son of Zeus and a mortal woman\nnamed Alcmene. Alcmene was married to Amphitryon,\nthe heir to the throne of Tiryns. But Alcmene refused\nto consummate her marriage until Amphitryon had\navenged the murder of her brothers, who had been\nkilled by the Taphian Pirates. So before even sleeping\nwith his wife, Amphitryon traveled to the Taphian\nIslands (off the western coast of Greece, near Ithaca)\nand stayed there for several weeks until he had killed all\nof the Taphian Pirates. On the night before Amphitryon\nreturned from his journey, Zeus came to Alcmene in the\nform and shape of her husband. He told her that he\nhad just come home from killing the pirates. Alcmene\nwas overjoyed, and gladly allowed him into her bed.\nThe next day when the real Amphitryon returned home,\nhe wondered why she did not give him a hero’s\n105 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n106\nCLASSICAL MYTHOLOGY\nwelcome. After speaking with his wife, he discovered\nthe truth: Alcmene had spent the previous night with\nsomeone else. Amphitryon did not believe Alcmene’s\nstory, that the man she had been with had looked and\nsounded exactly like him, but the seer Teiresias told\nhim that the interloper had been Zeus himself and that\nAlcmene’s story was true. Now Amphitryon believed\nher and they finally consummated their marriage.\nWhen Hera discovered that Alcmene was pregnant\nwith Zeus’ child, she was very unhappy, needless to\nsay. When Alcmene went into labor, Hera sent Eileithyia\nto prevent the birth from taking place. Eileithyia sat\noutside the delivery room crossing her fingers and legs,\nwhich halted the delivery. (No birth can take place\nunless Eileithyia is physically present and allows the\nbirth to proceed.) Alcmene, who was pregnant with twin\nboys, was in a bad state and was close to breathing her\nlast breath when her nurse, Galanthis, came up with\na trick to break Eileithyia’s spell. She shouted that the\nbaby had already come. Eileithyia, in confusion as to\nhow this could have happened, jumped up and broke\nher spell, allowing Alcmene to deliver two baby boys. In\nher anger at being tricked, Eileithyia turned Galanthis\ninto a weasel. The two babies were named Iphicles and\nHeracles. But the parents did not know which one of\ntheir sons was Zeus’ child and which one was the child\nof Amphitryon. HERACLES 107\nHeracles killing the snakes in his cradle on a stamnos in the\nLouvre\nHERACLES’ EARLY ADVENTURES\nHera did not leave Heracles alone for long. When he\nwas about eighteen months old, she sent two snakes to\nkill both Iphicles and Heracles while they were sleeping\nin their crib. While Iphicles screamed in terror and\ncowered in the corner, Heracles grabbed hold of the\nsnakes and strangled one in each hand. Any doubt as\nto which was the son of Zeus and which the son of\nAmphitryon was solved by this event. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n108\nCLASSICAL MYTHOLOGY\nThe Infant Hercules Strangling Serpents in his Cradle by Joshua\nReynolds (1788), in the Hermitage Museum in St. Petersburg,\nRussia\nAs he grew, Heracles learned many important skills\nfrom great teachers, but he had a short temper and did\nnot realize his own strength. When his music teacher,\nLinus (who was the brother of Orpheus), reprimanded\nhim for not practicing enough, Heracles took his chair\nand smashed it over Linus’ head, killing him instantly.\nAmphitryon decided to send Heracles to live at his\ncountry estate to protect his family. HERACLES 109\nHeracles killing his music teacher, Linus, on a cup in the\nAntikensammlungen Museum in Munich\nBy the time Heracles was seventeen, he had grown to\nbe a tall and strong youth. Around the same time, a\nlion was roaming in the area of Mount Cithaeron and\nwas terrorizing the countryside. Thespius, the king of\nthe area, asked Heracles to come and stay with him\nand help his men kill the lion. Thespius also happened\nto have fifty daughters. For fifty days Heracles went\nout to find the lion, and each night Thespius sent a\ndifferent daughter in to sleep with Heracles, though\nHeracles thought it was the same daughter each night.\nAfter the fifty days, Heracles had killed the lion and all\nof Thespius’ fifty daughters were pregnant. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n110\nCLASSICAL MYTHOLOGY\nHERA SENDS MADNESS\nHeracles stayed in the area of Thebes [see Thebae on\nmap] long enough to distinguish himself in a war the\nThebans were fighting against a people called the\nMinyans. The king of Thebes was so happy to have had\nHeracles’ help that he offered his daughter, Megara,\nto Heracles as a wife. Megara and Heracles married\nand had two sons. They lived for a few years in peace,\nbut Hera was still out to torment Heracles, so she sent\nmadness to drive him mad. In his madness, Heracles\nkilled his wife and children. When he regained his\nsanity, Heracles was devastated and decided to go to\nthe Oracle at Delphi [map] to ask Apollo how he could\nbe purified for this murder. The Pythia told him that\nhe must go to Tiryns and perform twelve labors for\nthe ruler, Eurystheus. If he could complete all twelve\nlabors successfully, he would not only be purified of the\nmurders, but he would achieve immortality. (The rule\nis that if a hero has one mortal parent, he or she is\nmortal. So Heracles was born a mortal, and this was\nhis opportunity to achieve immortality.) Heracles did\nmanage to successfully complete his twelve labors [see\n12 Labors of Heracles].\nTHE DEATH OF IPHITUS\nAfter these twelve labors, Heracles set out, looking for\na new wife with whom he could start over. Eurytus of\nOechalia, who had taught Heracles how to shoot a bow\nand arrow, was looking for a husband for his daughter,\nIole. Eurytus had set up the condition that whoever HERACLES 111\ncould beat him in an archery contest would win Iole,\nand Heracles won easily.\nHowever, Eurytus knew about the misfortunes\nHeracles had had with Megara and refused to give Iole\nto Heracles. Heracles was furious, but at this point\nthere was nothing he could do. At the same time this\nwas happening, some of Eurytus’ mares went missing\n(sources vary on whether Heracles had anything to do\nwith the disappearance). Eurytus’ son, Iphitus, who\nbelieved Heracles was innocent, went with Heracles to\nfind the mares. The two eventually ended up in Tiryns\nat Heracles’ house. After they located the mares, the\ntwo friends were drinking on the roof of Heracles’\nhouse. What happened after that is not clear, but\nsomehow they got into an argument and Heracles\nended up throwing Iphitus from the roof. Heracles was\nstricken with a disease as punishment for his crime.\nWhen he consulted the Delphic Oracle, the Pythia told\nHeracles that he had to sell himself as a slave for three\nyears for whatever price Iphitus’ sons established.\nOMPHALE\nHeracles did as the Pythia said and he was sold to\nOmphale, the Queen and ruler of Lydia, who had\ninherited power from her late husband. The kingdom\nof Lydia had some enemies, and now that Omphale\nhad control of the kingdom, those enemies took the\nopportunity to cause problems. Heracles used his\nstrength and fortitude to solve these problems for\nOmphale, who was incredibly grateful. She freed\nHeracles and the disease left him. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n112\nCLASSICAL MYTHOLOGY\nDEÏANEIRA\nAfter many years, and many adventures, Heracles\nfound himself in Calydon, where he fell in love with\nKing Oeneus’ daughter, Deïaneira. Heracles had a rival\nfor her hand, though, in Acheloüs, a local river god.\nThe two fought until Heracles managed to break off\none of the god’s horns, which caused the god to yield.\nHeracles and Deïaneira married, but they were not able\nto live happily very long. Heracles, still not aware of\nhis strength, killed Oeneus’ cupbearer when he gave\nthe boy a quick blow as punishment for some offense.\nOeneus forgave his son-in-law, but Heracles, in his guilt,\ninsisted that he go into exile for his crime. Heracles left\nCalydon with Deïaneira in tow.\nAt some point in their trip, Heracles and Deïaneira\ncame to a very deep and very large lake. Heracles could\neasily swim across the lake, but Deïaneira could not,\nand Heracles could not carry her while swimming\nacross. Just at that time, the centaur Nessus\napproached the newlyweds and offered to ferry\nDeïaneira across the river. Heracles gratefully agreed\nto let Nessus swim across the river carrying Deïaneira\non his back. Halfway across the lake, however, Nessus\nbegan to rape Deïaneira. Heracles heard her screams\nand shot off one of his arrows dipped in the Hydra’s\nblood. Of course, the arrow hit its mark and, as Nessus\nknew, Hydra’s blood was a deadly poison. But Nessus\ndecided to get back at Heracles, even though he would\nnot live to see his revenge. As he lay dying, Nessus told\nDeïaneira that if she took some of his blood and wiped\nit on a robe for Heracles to wear, it would act as a love HERACLES 113\npotion. Of course, this was a lie. Deïaneira was aware\nof her husband’s wandering affections, so she collected\nsome of Nessus’ blood and kept it in case she ever\nhad need of it. She had no idea that the deadly Hydra\npoison was also a part of her “love potion”.\nHeracles fighting the centaur Nessus on a nestoris found in the\nLouvre\nTHE DEATH AND APOTHEOSIS OF HERACLES\nDeïaneira was justified in her suspicions of her\nhusband, although nothing happened right away. But\nmany years later, Heracles decided to get revenge on\nEurytus, who had refused to give Heracles his daughter,\nIole, in marriage. Heracles killed Eurytus and his sons in\nbattle and brought Iole back home to be his concubine.\nDeïaneira knew about her husband’s many affairs, but\nshe did not want to live in the same house with a MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n114\nCLASSICAL MYTHOLOGY\nyounger rival, so she decided to put Nessus’ plan into\naction. She smeared Nessus’ blood on a beautiful new\nrobe and gave it to her husband when he returned\nhome, bringing Iole with him. Heracles put on the\nhandsome robe to give a thanksgiving offering to Zeus\nfor a successful return home, but as soon as he put\non the robe, his skin immediately caught fire. When\nHeracles tried to take off the robe, parts of his skin\ncame off with it, and Heracles (now with parts of his\nskin missing) continued to burn. Realizing the terrible\nmistake she had made, Deïaneira took her own life. But\nHeracles was in agony; he could not take off the robe\n(because it was sticking to his skin), but he could not put\nout the fire, and Heracles was burning so slowly that\nit seemed to be taking forever for him to die. Heracles\ndecided to end his life as soon as possible.\nHe took his son Hyllus up into the mountains and\nasked him to build a funeral pyre Hyllus agreed to build\nthe pyre, but he refused to light it because he could\nnot bear to end his father’s life. A passing shepherd\nand his son, Philoctetes, agreed to light the pyre, and\nso Heracles gave his famous bow and arrows to\nPhiloctetes.\nThe fire burned away Heracles’ mortal flesh and he\nbecame immortal. He was taken up to Olympus to live\nwith the other gods and he married his half-sister,\nHebe. And Hera finally put aside her anger against him.\nIt seems that Heracles could only find peace after his\ndeath. Hermes\nRoman name: Mercury\nEpithets: Argeïphontes (Killer of Argus),\nPsychopompos (Guide of Souls), Hermes the Helper\nSymbols: caduceus (kerykeon), winged sandals,\npetasos (traveling hat)\nFunctions: messenger to the gods and god of\ntravelers, traders, thieves, herds, and heralds\n115 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n116\nCLASSICAL MYTHOLOGY\nHermes carrying a ram on an olpe found in the Louvre\nTHE BIRTH OF HERMES AND THE THEFT OF HERMES 117\nAPOLLO’S CATTLE\nHermes was the son of Zeus and Maia, a nymph who\nlived on Mount Cyllene. Hermes was very mischievous,\nand within hours of his birth, Hermes was already\ngetting himself into trouble. When he was only one day\nold, he left his mother’s cave to see the world and ran\ninto a tortoise, which he killed and then fashioned into\nan instrument, inventing the lyre. Later that day, he\nslipped out again and made his way to Pieria, the place\nthe gods used to pasture their cattle, and stole fifty\nof Apollo’s cattle, taking great care to confuse anyone\ntrying to track them by forcing the cattle to walk\nbackwards. He also made sandals for himself by tying\ntwigs to the bottoms of his feet in order to hide his\nfootprints. Hermes drove the cattle far away, and hid\nthem in a cave not far from the river Alpheios, in the\nPeloponnese [map]. Hermes then decided to sacrifice\ntwo of the cattle to the gods. He rubbed two sticks\ntogether, thus inventing both fire-sticks and fire. He\nslaughtered two of the cattle and sacrificed the meat to\nthe gods, not keeping any for himself. He then hid the\nevidence of his crime by burning the carcasses of the\nanimals and throwing his make-shift sandals in a river.\nBy this time, it was evening. Hermes hurried home,\nwrapped himself in his swaddling clothes, and slipped\nback into his cradle, feigning innocence. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n118\nCLASSICAL MYTHOLOGY\nA Muse playing a lyre, the instrument invented by Hermes, found\nin the Staatliche Antikensammlungen in Munich\nThe next morning, Apollo noticed that some of his cattle\nwere missing and came looking for them. Despite HERMES 119\nHermes’ efforts to hide his crime, Apollo managed to\ndiscover the fate of his cattle and came to confront\nhis younger half-brother. Apollo threatened to throw\nHermes into Tartarus and imprison him there if he\ndidn’t give back the cattle, but Hermes replied, “I was\nborn yesterday! How could I possibly steal anyone’s\ncattle? I don’t even know what cattle are!” The two were\nunable to settle their dispute, so they took their case\nto their father. Zeus was amused by Hermes’ insistence\nthat he was innocent, but decreed that the infant return\nthe cattle to Apollo. Hermes showed Apollo where he\nhad hidden the cattle, but before Apollo could take\nthem away, Hermes picked up the lyre he had created\nand began to play. The music so enraptured Apollo\nthat he begged Hermes to give it to him. Hermes then\nsuggested a deal: in exchange for the instrument,\nApollo would trade his cattle and the position of divine\nherdsman. Apollo agreed. Zeus confirmed the pact\nbetween the two half-brothers, and decreed that\nHermes would become the messenger of the gods\n(Homeric Hymn to Hermes). Hermes also became a\ntrickster god and the god of thieves, as well as the\ngod of travelers and traders and a helper to men. He\nalso carried the caduceus or herald’s wand (a gift from\nApollo) as a sign of his position. And he invented the\npanpipes (several reeds or hollow bamboo sticks of\ndifferent lengths, tied together with string) so he would\nhave his own instrument to play. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n120\nCLASSICAL MYTHOLOGY\nThe caduceus of Hermes has been appropriated by the Medical\nCorps as their symbol.\nHERMES AS GUIDE OF DEAD SOULS\nAs an extension of his role as protector of travelers,\none of Hermes’ jobs was to lead the dead souls down\nto Hades. He would take the souls to the river Styx\nwhere Charon, the ferryman, would take the souls of HERMES 121\nthe dead to the other side as long as they had been\nburied properly with a coin placed under the tongue\nas a payment for Charon. Hermes is often depicted in\nart as leading away a dead person’s soul. One example\nis the famous relief sculpture in the Naples Museum\nof Hermes leading Eurydice back into Hades just after\nOrpheus had looked back at her on their way out of the\nUnderworld [see Orpheus].\nHERMES THE HELPER\nHermes earned his epithet “the helper” many times\nover by aiding both gods and mortals. Zeus often\nemployed him not only in sending messages but also\nin performing tasks the father of gods and men was\nnot able to do himself. One such instance was with\nIo, a mortal woman Zeus amorously pursued. Io was a\npriestess to Hera who caught Zeus’ eye, and so Zeus\nsent her dreams commanding her to join him in the\nfields where her father kept his flocks. Eventually, she\ncame to the meadow, but when she realized what Zeus\nwanted, she ran away, and Zeus pursued her. Hera,\neager to catch her husband in the act, had been\nobserving him and came down from Olympus to\nconfront her husband. Zeus quickly turned Io into a\ncow to hide his promiscuity from his wife. Hera, who\nknew the cow was really a girl, asked her husband if\nhe would give her the beautiful cow as a present and\nhe had to acquiesce in order not to give away his trick.\nHera placed Io in a grove, guarded by Argus Panoptes\n(meaning “all-eyes”), a hundred-eyed monster. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n122\nCLASSICAL MYTHOLOGY\nMercury and Argus by Peter Paul Rubens (1635–1638) in the\nGemäldegalerie Alte Meister in Dresden\nZeus sent the god of thieves to bring him Io, but not\neven Hermes could steal her away because Argus was\nable to make his eyes sleep in shifts so he could\nconstantly watch the girl. Hermes decided to disguise\nhimself as a goatherd. He sat down by Argus and gently\nplayed his panpipes until all of Argus’ eyes had closed\nin sleep. Once he had done this, Hermes took up his\nsword and cut off the head of the monster, earning his\nname Argeïphontes. HERMES 123\nMercury and Argus by Peter Paul Rubens (1636–1638) in the\nPrado Museum in Madrid\nHermes helped his father another time by rescuing his\nunborn half-brother Dionysus from womb of his\nmother, Semele, as she perished in flames [see\nDionysus]. Zeus was not the only beneficiary of Hermes’\nhelp; mortals were also guided by Hermes. He showed\nOdysseus how to overcome the dangerous witch, Circe\n[Homer, Odyssey, 10]; he helped Priam, king of Troy,\ntravel safely into the Greek camp during the Trojan War\nto plead with Achilles for the body of his son, Hector\n[Homer, Iliad, 24]; and he, along with Athena, gave the\nhero Perseus all the equipment he needed to slay the\nGorgon, Medusa.\nPAN\nHermes had many children, one of which was Pan, a\ngod born with horns and a goat’s legs. Pan was also MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n124\nCLASSICAL MYTHOLOGY\nsaid to have invented the panpipes, which he frequently\nplayed. Pan was able to inflict fear, or “panic” (which\ncomes from the god’s name), in the hearts of mortals\nwith just a shout.\nHERMS\nSince he was the protector of travelers, statues of\nHermes’ head and a phallus on stone pillars (called\nherms) were placed along roads, at cross roads, and\nin courtyards and town squares for good luck. These\nstatues were taken very seriously, since they were\nrepresentations of the god; harm to them could have\ndisastrous consequences. According to Thucydides, just\nbefore the Athenians started on their ill-fated Sicilian\nExpedition, someone smashed the faces of almost all\nof the herms throughout the city, a bad portent for the\nfate of the expedition and an ominous foreshadowing\nfor when the expedition ultimately failed (Thucydides\n6.27). HERMES 125\nAn ithyphallic herm in the National Archaeological Museum in\nAthens Hestia\nRoman name: Vesta\nFunction: goddess of the hearth\nHestia was the oldest child of Cronus and Rhea, thus\nshe was the first to be swallowed by Cronus and last\nto come back out when Zeus rescued his siblings [see\nOrigins]. She is both anthropomorphic (i.e., she is a\ngoddess with a human form) and the physical\nmanifestation of the actual hearth in every home,\ntemple, and city. In fact, her name (῾Εστία) is also the\nGreek word for the hearth. Hestia was a virgin goddess\nwho does not appear in many myths. She was highly\nhonored, usually receiving the first offering at sacrifices,\nbut she had few cult activities that were specially\ndedicated to her. However, to the Romans, Vesta was\none of the most important deities. The priestesses of\nVesta, called the Vestal Virgins, tended to the city\nhearth, keeping the goddess’ flame burning.\n126 The Iliad – An Introduction\nThe Iliad is an epic that tells about only a few weeks\nduring the Trojan War. The Iliad does not tell the entire\nstory of the war, which is supposed to have lasted for\nten years. But the audience is expected to be familiar\nwith the entire story of the Trojan War, including all the\nevents that occurred before and after the war. These\npre- and post-war events are referred to in the Iliad, but\nthey are not explained, so here are a few of the most\nimportant stories.\nTHE BIRTH OF PARIS\nThe story begins in Troy with King Priam and his wife,\nHecuba. Hecuba was pregnant and one night she had\na dream in which the child she was carrying was a\nfirebrand (a piece of burning wood used to start fires),\nand the firebrand set fire to the entire city. When\nHecuba told her dream to her daughter, Cassandra,\nCassandra prophesied that the child Hecuba was\ncarrying was destined to destroy the city. Cassandra\nadvised her parents to expose the child as soon as he\nwas born. But Cassandra was fated never to be believed\n127 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n128\nCLASSICAL MYTHOLOGY\n[see Apollo], and so her parents said they would not\nthink of doing such a terrible thing. When Paris was\nborn, he was a very handsome baby, and his parents\ntreasured him greatly. (By the way, in the Iliad, Paris\nis also sometimes referred to as Alexandros or\nAlexander.)\nTHE WEDDING OF PELEUS AND THETIS\nMany years later, all the gods were excited about\nattending the wedding of Peleus and Thetis. Peleus was\na mortal man who had distinguished himself as one of\nthe Argonauts [see Argonauts]. Thetis was a gorgeous\nand desirable sea goddess, but she was fated to give\nbirth to a son who would be stronger than his father.\nWhen Zeus and Poseidon, who were both very\ninterested in her, learned of this prophesy, they were\nsuddenly very eager to marry her off to a mortal man. THE ILIAD – AN INTRODUCTION 129\nJupiter and Thetis by Jean-Auguste-Dominique Ingres (1811) in\nthe Musée Granet in Aix-en-Provence, France\nThe wedding was a splendid affair, attended by all the\ngods and goddess except one. Eris, the Goddess of\nDiscord, was not invited because of her tendency to\ncause problems among the gods. Eris was, of course,\noffended by the slight and created a sure way to cause\nas much strife as possible. She took a golden apple and MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n130\nCLASSICAL MYTHOLOGY\ninscribed the words “for the fairest” upon it and threw\nit among the party guests. There were three goddesses,\neach of whom believed that the apple was meant for\nher: Athena, Hera, and Aphrodite.\nTHE JUDGMENT OF PARIS\nThe goddesses took their dispute to Zeus, who wisely\nrefused to judge the matter, knowing it would only\ncause trouble for him. Zeus decided that the\nhandsomest man on earth should decide the contest,\nand the handsomest man on earth turned out to be\nnone other than Paris, who was now about twenty\nyears of age. So all three goddesses went to Troy and\nasked Paris to decide which one of them was the most\nbeautiful and should be awarded the golden apple.\nEach goddess secretly promised a gift to Paris if he\nshould pick her. Athena offered to make sure he was\nalways victorious in battle, Hera promised to make him\nruler of the world, and Aphrodite promised to give him\nthe most beautiful woman in the world. Paris naturally\nawarded the apple to Aphrodite. There was just one\ncatch: the most beautiful woman in the world\nhappened to be Helen of Sparta, and she was already\nmarried to Menelaus, the king of Sparta. THE ILIAD – AN INTRODUCTION 131\nThe Judgement of Paris by Peter Paul Rubens (1638–1639) in the\nPrado Museum in Madrid\nTHE ABDUCTION OF HELEN\nParis decided to take a trip to Sparta [map]. Paris was\naccepted into the house of Menelaus, the king of\nSparta. Because of the laws of guest-friendship [see\nXenia], Paris was invited to stay as long as he wished.\nSoon after Paris’ arrival, Menelaus had to journey to\nCrete [see Creta on map] for his grandfather’s funeral.\nHe left his wife and household, instructing them to\nmake sure Paris was treated well. Aphrodite took the\nopportunity to send Eros to shoot Helen with his arrow,\nand Helen fell in love with Paris. Paris absconded with\nHelen (and quite a bit of Menelaus’ treasure) and went\nhome to Troy while Menelaus was still away.\nWhen Menelaus found his wife and wealth gone, he\nwas quite angry. In addition to his personal desire for\nvengeance, Menelaus knew that Paris had violated the\nlaws of xenia, and that Zeus punished those who MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n132\nCLASSICAL MYTHOLOGY\nviolated these laws. So Menelaus called upon his\nbrother, Agamemnon, who was the king of Mycenae\n[see Argos on map] and the richest and most powerful\nof all the Greek kings. Together, Menelaus and\nAgamemnon called on all the other Greek kings to join\nan expedition to Troy to bring Helen back to Sparta.\nBut why would the other kings want to join such\na dangerous expedition? Before Helen and Menelaus\nmarried, nearly every eligible bachelor in Greece\nwanted to marry her, since she was the most beautiful\nwoman in the world. Tyndareüs, Helen’s earthly father,\ndeclared (at the advice of one of the suitors, Odysseus)\nthat before he made his decision, all the suitors should\nswear an oath to come to the aid of the man he chose\nas Helen’s husband if he should ever have a problem\nwith Helen being abducted by someone else. The\nsuitors all agreed and swore an oath. And now\nMenelaus invoked this oath and asked for their help to\nfight against Troy. Besides, Troy was the wealthiest city\nin the world, so all the Greek warriors would be sure to\nbring back a great deal of loot (assuming they won the\nwar).\nODYSSEUS JOINS THE EXPEDITION\nNot all the Greeks were easily persuaded to join the\nfight. Odysseus, the King of Ithaca [map], preferred to\nstay home with his wife and infant son. When Menelaus\ncame to Ithaca to remind Odysseus of his oath,\nOdysseus decided to pretend to be crazy. Menelaus\nfound him plowing his fields and sowing the fields with\nsalt instead of seed (sowing salt prevents anything from THE ILIAD – AN INTRODUCTION 133\ngrowing). Menelaus knew this was exactly the sort of\ntrick Odysseus would pull, so to test how crazy\nOdysseus really was, he placed Odysseus’ son,\nTelemachus, in the path of Odysseus’ plow.\n(Telemachus was about a year and a half old at this\ntime.) When Odysseus pulled the plow away so he\ndidn’t hurt the baby, he showed how sane he was. So\nMenelaus forced him to be true to his oath and join the\nexpedition against Troy.\nACHILLES JOINS THE EXPEDITION\nOdysseus was instrumental in recruiting Achilles for the\nTrojan War. Achilles’ mother, Thetis, knew that if\nAchilles went to Troy he would not come back, so she\ndid not want to let him go. Besides, Achilles was only\nabout fifteen years old at this time. So Thetis dressed\nher son in girl’s clothing and she hid him on the island\nof Scyrus among the daughters of King Lycomedes. But\nOdysseus knew how to find out which one was Achilles.\nOdysseus dressed as a merchant and traveled to\nScyrus, where he displayed his wares for all the girls to\nsee. He set out some lovely jewelry and clothing, but\nhe also set out some handsome weapons. All the girls\nflocked to the jewelry except one, who was examining\nthe weapons. Odysseus knew that this “girl” was\nAchilles in disguise, and he easily persuaded the young\nhero to join the expedition to Troy. By the way, by\nthe time Achilles left, one of Lycomedes’ daughters,\nDeïdameia, was pregnant with Achilles’ child.\nDeïdameia later gave birth to Neoptolemus. Because MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n134\nCLASSICAL MYTHOLOGY\nAchilles never did return from Troy, Neoptolemus was\nhis only child.\nDiscovery of Achilles on Skyros by Nicolas Poussin from around\n1651 found in the Museum of Fine Arts in Boston\nTHE SACRIFICE OF IPHIGENIA\nThe Greek warriors and their ships all gathered at Aulis\nfor the long voyage to Troy. But just when they were\nabout to leave, Artemis sent contrary winds, preventing\nthem from leaving. The Greeks were forced to stay at\nAulis for a month; their supplies were getting low and\ntheir tempers were getting short. In the end,\nAgamemnon was forced to sacrifice his daughter,\nIphigenia, to Artemis so that Artemis would stop the\ncontrary winds and allow them to set sail for Troy. For THE ILIAD – AN INTRODUCTION 135\nthe full story of how this happened, see Agamemnon\nand Iphigenia.\nTHE BEGINNING OF THE TROJAN WAR\nWhen the Greek fleet finally reached Troy, they found\nthat the fight was not quick or easy. The walls of Troy\nwere very strong (they had been built by Poseidon and\nApollo [see Poseidon]), and the Trojans and their allies\nwere great warriors. So the Greeks beached their ships\nand built a camp on the shore, and they settled in\nfor a long war. The Trojan War went on for ten years;\nsometimes the Greeks came very close to taking the\ncity, and sometimes the Trojans came very close to\ndestroying the Greeks’ ships and their camp. The Greek\ntroops also raided the nearby allies of the Trojans to\ngain plunder and supplies for themselves and to\nprevent food from reaching Troy. The Iliad picks up in\nthe ninth year of the war when everyone is extremely\ntired and cranky from the long, protracted struggle. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n136\nCLASSICAL MYTHOLOGY\nAjax and Achilles playing draughts on an amphora in the Vatican\nMuseum\nFIGHTING AT TROY\nThe Greeks fought at Troy for ten years without being\nable to conquer the great, walled city. Although the Iliad\ndoes not tell the story of the death of Achilles, we know\nthat he dies before Troy falls. Paris kills him with an\narrow. Remember, the entire Iliad takes place during a\nfew weeks of the 9th year. THE ILIAD – AN INTRODUCTION 137\nHypnos (Sleep) and Thanatos (Death) carry away the body of\nSarpedon on a krater housed in the Archaeological Museum of\nCerveteri, Italy\nAfter Achilles’ death, the Greeks were still unable to\nconquer Troy, even though they had fulfilled the four\nconditions that Helenus, the Trojan seer, had said were\nnecessary before Troy could fall. (Those conditions\nwere: Achilles’ son Neoptolemus had to fight on the\nGreek side, the bow and arrows of Heracles must be\nused against the Trojans, the remains of the famous\nhero Pelops must be brought from Greece to Troy, and\nthe ancient statue of Athena, called the Palladium, must\nbe stolen from the Trojan citadel.) The cunning\nOdysseus finally thought of a plan that would allow\nthem to get inside the walls and capture Troy. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n138\nCLASSICAL MYTHOLOGY\nThe Trojan Horse depicted on a pithos in the Archaeological\nMuseum of Mykonos\nTHE TROJAN HORSE\nDuring the night, the Greeks built a huge, wooden\nhorse, too big to fit inside the walls of Troy. They hid\nsome of their best warriors inside, and sailed off to\nthe neighboring island of Tenedos. When the Trojans\nawoke to find the Greek army gone and a huge wooden\nhorse in its place (inscribed with the words: “For their\nreturn home the Greeks dedicate this thank offering to\nAthena.”), they joyfully brought the horse into their city,\neven breaking down part of their city walls in order to\ndo it. That night, while the Trojans slept soundly after\na day of feasting and celebrating, the Greek warriors\ncrept out of the horse and opened the city gates to\nthe rest of the Greek army, which had sailed back from\nTenedos, and the Greeks captured the city and burnt it THE ILIAD – AN INTRODUCTION 139\nto the ground. During the fall of Troy, Ajax the Lesser\n(the son of Oïleus, called “the Lesser” to distinguish him\nfrom the great warrior Ajax, the son of Telemon) raped\nCassandra in Athena’s temple. For the full story, see\nAthena.\nAjax the Lesser raping Cassandra while she seeks refuge at the\nstatue of Athena on a cup in the Louvre\nRETURNS (ODYSSEY)\nAfter fighting at Troy for ten years, many of the Greek\nprinces had long and difficult voyages home. Menelaus\nwandered the seas for seven years before returning MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n140\nCLASSICAL MYTHOLOGY\nhome to Sparta, and Odysseus took ten years to reach\nhome, so that he was gone for twenty years in all.\nAgamemnon returned home quickly and safely, but as\nsoon as he returned he was murdered by his wife,\nClytemnestra (with help from her lover, Aegisthus), who\nwas angry over the sacrifice and murder of her\ndaughter, Iphigenia. For more on the stories of the\nGreek warriors’ returns, see The Odyssey. Jason\nFunctions: hero and leader of the Argonauts\nTHE BIRTH OF JASON\nJason was the son of Aeson, the rightful king of Iolcus.\nBefore Jason was born, his uncle, Pelias, took the\nthrone from Aeson. Aeson and his wife still lived in\nIolcus, but they lived with the constant threat of death\nover them. After Jason was born, in order to protect him\nfrom the wrath of his uncle, Aeson sent his son to the\nnearby Mount Pelion to be raised by the centaur [see\nCentaurs], Chiron.\nFor years, Pelias lived in fear of a man with one\nsandal because he had been told by the Delphic Oracle\nthat he was fated to be killed by a man who was\nwearing only one sandal. When Jason turned twenty-\none, he decided to reclaim the throne and returned to\nIolcus to confront his uncle. In order to get there, he\nhad to cross a river, and on the bank sat an old woman\nasking to be carried across. Jason did not know that the\nwoman was Hera in disguise, testing the young man to\nsee if he was worthy to help her in destroying Pelias,\n141 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n142\nCLASSICAL MYTHOLOGY\nwho had scorned her many times. In the process of\ncarrying the goddess through the water, Jason lost one\nof his sandals, and he continued the rest of the way\nwearing only one.\nHOW JASON WAS SENT TO BRING BACK THE\nGOLDEN FLEECE\nOnce the youth came to Iolcus, news of the man with\none sandal quickly reached Pelias. He met with the\nyoung man, who revealed his identity and stated his\nintention to regain his father’s throne. Pelias was afraid\nto kill Jason outright, so he asked him what he would\ndo with a man who was destined to kill him. Jason\nresponded saying that he would ask the man to retrieve\nthe Golden Fleece. (The Golden Fleece came from a\nmagical golden ram who had saved the youth Phrixus\nfrom death by carrying him to the land of Colchis. Once\nthey had arrived in Colchis, the ram told Phrixus to\nsacrifice him and hang the fleece in a grove sacred to\nAres, where it was guarded by a dragon.) Upon hearing\nJason’s answer, Pelias asked his nephew to fetch the\nFleece from Colchis. Another version states that Pelias\nwas kind to his nephew and told him that the oracle\nat Delphi had told him that the dishonored spirit of\nPhrixus needed to be returned home to Thessaly along\nwith the Fleece to appease the underworld gods\n[Pindar]. In either case, Jason agreed to go to Colchis\nand bring back the Golden Fleece, and he organized an\nexpedition which included some of the greatest heroes\nin Greece at the time [See Argonauts]. JASON 143\nJASON AND MEDEA\nThe Argonauts returned to Iolcus with the Golden\nFleece, bringing with them Jason’s new wife, the\nColchian princess Medea (who was also a witch). Jason\nsuspected that his uncle would not hand over the\nkingship, so the group stayed outside the city while\ntrying to figure out what to do. Medea came up with\na plan to rid them of the problem. Using her magic,\nshe disguised herself as an old woman and went to the\npalace, claiming to be a priestess of Artemis who had\ncome to rejuvenate the king. When she transformed\nfrom an old woman into her real, youthful form, Pelias\nagreed to allow her to bring back his youth. Medea\ntold his daughters that they needed to cut their father\ninto pieces and boil him in her cauldron with some\nmagical herbs in order for the process to work. The girls\nwere naturally skeptical, but Medea convinced them\nby performing the procedure on a ram. When a little\nlamb leaped from the cauldron, they agreed to cut their\nfather into pieces. Of course, when the daughters of\nPelias tried this, their rejuvenated father did not spring\nout of the cauldron. Medea probably “forgot” to put the\nright herbs into the cauldron; in any case, Pelias was\ndead.\nPelias’ son, Acastus, who was one of the Argonauts,\nbecame king at his father’s death and exiled Jason and\nMedea for the brutal killing of his father. The king of\nCorinth, Creon, offered them a home in his kingdom\non account of the fame the expedition of the Argo had\nbrought to Jason. There they lived peacefully for about\nten years, and they had two sons. Eventually though, MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n144\nCLASSICAL MYTHOLOGY\nJason grew tired of living with a barbarian witch who\nbrought him no social standing, and Creon offered his\ndaughter, named either Glauce or Creusa, in marriage\nto the hero. Jason divorced Medea and married the\nprincess.\nMedea was devastated and most of all angry at the\nbetrayal. After all, she had helped Jason steal the\nGolden Fleece, she had helped him sail safely back to\nGreece, and she had helped him punish Pelias for\nseizing the throne; she had also born him two sons to\nperpetuate his line. But Medea was not about to suffer\nin silence; she hatched a plan to hurt Jason in every\nway possible. She sent her sons to deliver wedding gifts\nfor the princess: a tiara and a beautiful dress. As soon\nas the princess put them on, however, they burst into\nflames. Her father, hearing her screams, ran to help,\nbut once he had touched her he could not pull away,\nand he burned alive alongside his daughter. Medea’s\nsons, because they were accessories to the murders,\nwere in danger as well. Some versions say the\nCorinthians killed the boys and later the spirits of the\nchildren punished the city for their murder, but the\nmore prominent version, popularized by Euripides, has\nMedea herself killing the children to take revenge on\ntheir father. Medea, who was the granddaughter of\nHelius, the sun, asked for and received her\ngrandfather’s chariot (drawn by four winged horses) to\nhelp her escape. Medea flew to Athens in Helius’ chariot\nand went to live with King Aegeus [see Theseus]. Some\naccounts say that Jason took his own life, but the more\npopular story is that many years after these events he\nwas sitting under the rotting ruins of the Argo, the ship JASON 145\nthat had made him so famous, when a beam from the\nship fell and struck him on the head, killing him. Miasma\nMiasma (μίασμα) means “stain,” “defilement,” or “the\nstain of guilt” in Greek. It is usually translated as\n“pollution” in English, although there is no concept in\nEnglish that precisely corresponds to miasma. Miasma\nis a god-sent disease that is caused by a murder that\nhas not been atoned for (with proper purification\nrituals). A miasma can fall upon an entire city when one\nman in that city is guilty of a murder and has not atoned\nfor it. A miasma can infect everyone on board a ship if\none man on that ship is guilty of murder.\nMiasma can spread like a disease, and it seems to\nbe the objectification of guilt. In other words, the guilt\nis understood as a kind of disease that can spread to\neveryone who comes in contact with the guilty person.\nThe concept of germs was not developed until the\n1880s, but the effects of contagion were clearly visible\nfrom a very early time. The Greeks seem to have\nbelieved that the cause of contagious disease was guilt\nfor an unexpiated crime. The only way to stop the\nspread of the disease was to find the guilty party, have\nthat person atone for their crime by paying a penalty\n(usually a fine or banishment), and undergo an\nexpiation ritual (frequently a sacrifice of a suckling pig).\n146 MIASMA 147\nYou could classify miasma as a psychological myth\n(since it is the manifestation of the emotion of guilt) or\nyou could understand it as a natural aetiological myth,\nsince it explains the natural phenomenon of contagious\ndisease.\nWhen Oedipus the King begins, the city of Thebes is\ninfected with a miasma: a disease has fallen on the\ncrops, the cattle are dying, a plague is raging through\nthe land, and all the children are stillborn. The Oracle\nat Delphi proclaims that the miasma is caused by the\nunexpiated murder of Laius, the previous king. Apollo\ndeclares that the murderer is still living in Thebes and\nthat he must be found and punished (either by\nbanishment or death) in order for the miasma to come\nto an end. The Minotaur\nFunction: half-man, half-bull monster\nThe Minotaur (which means “Minos’ bull”) was the\nson of Pasiphaë, the wife of Minos (the king of Crete),\nand a large and handsome bull. Minos had asked\nPoseidon for a magnificent bull to sacrifice to him and\nthe god obliged, sending a handsome bull from the\nsea. However, when Minos saw the bull, he refused\nto sacrifice it because it was so beautiful. Poseidon,\ncompletely enraged, caused Minos’ wife, Pasiphaë, to\nlust after the bull. She convinced Daedalus, the famous\nengineer, to aid her in consummating her desire for\nthe bull by making her a hollow wooden cow. Pasiphaë\nthen climbed into the cow and was able to mate with\nthe bull. The result was a child who was half human and\nhalf bull. Minos then had Daedalus build a maze, called\na labyrinth, to house the Minotaur. To read the story of\nhow Theseus killed the Minotaur, see Theseus.\n148 THE MINOTAUR 149\nTheseus Slaying the Minotaur by Antoine-Louis Barye (1843) in\nthe Baltimore Museum of Art The Odyssey – An\nIntroduction\n150 THE ODYSSEY – AN INTRODUCTION 151\nOdysseus blinding Polyphemus on an amphora in the\nArchaeological Museum in Eleusis\nThe Odyssey tells the story of the Greek hero Odysseus’ MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n152\nCLASSICAL MYTHOLOGY\nreturn home from the Trojan War. Although the Odyssey\nfocuses on Odysseus’ story, it also tells about the\nreturns of four other heroes: Nestor, Agamemnon,\nMenelaus, and the Lesser Ajax. These stories are told\npiecemeal and in flashbacks, so they are a little more\ndifficult to follow. Furthermore, there are also a few\nevents that happened between the end of the Iliad and\nthe beginning of the Odyssey that are helpful to know.\nA bronze figurine of one of the men turned into pigs by Circe in\nthe Walters Art Museum in Baltimore\nTHE DEATH OF ACHILLES\nThe first of these events is the death of Achilles, which\ncame at the hands of Paris with the help of Apollo. The\nGreeks were fighting near the gates of Troy and Paris\nshot at Achilles with his bow, which Apollo guided to\nAchilles’ one vulnerable spot, his ankle. This was the\nonly vulnerable spot on Achilles’ body because his THE ODYSSEY – AN INTRODUCTION 153\nmother tried to make him immortal when he was a\nbaby by dipping him in the River Styx. Since she held\nhim by the ankle, the waters of the Styx did not touch\nthat part of him, so he was mortal and vulnerable in\nthat spot.\nTHE SUICIDE OF AJAX\nAfter Achilles’ death, it was decided that his armor\nshould be given to the second-greatest Greek warrior\nafter Achilles. As we know from Book 18 of the Iliad,\nAchilles had immortal armor, which had been crafted\nfor him by the god Hephaestus to make up for the\narmor he had lost when Patroclus had worn it into\nbattle (and Hector had taken it after he killed Patroclus).\nNow that Achilles, the greatest of the Achaeans, was\ndead, it was agreed that his immortal armor should\ngo to the second greatest warrior. Everyone knew that\nthe second greatest warrior was the Greater Ajax, the\nson of Telamon. He was huge, he was brave, and he\nwas selfless; he spent all his time protecting the other\nAchaeans. But Odysseus used his amazing speaking\nability to convince Agamemnon and Menelaus (who\nwere judging the contest) that his cleverness made him\nmore valuable than Ajax (who was not known for his\nwits) and that he, Odysseus, was in fact the second-\nbest Greek warrior. As a result, Odysseus was awarded\nAchilles’ armor, even though everyone knew in their\nhearts that Ajax really deserved it. Ajax was so mortified\nby being passed over for an honor that he felt was\nrightfully his that he killed himself in shame. And, as we MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n154\nCLASSICAL MYTHOLOGY\nwill see when we read the Odyssey, Odysseus later came\nto deeply regret his “win”.\nA small bronze figurine of Odysseus tied to the underside of a\nram to escape Polyphemus in the Archaeological Museum of\nDelphi\nTHE BOW OF HERACLES AND THE PALLADIUM\nMeanwhile, the Trojan War raged on, despite the\ndeaths of both Hector and Achilles. The Greeks learned\nfrom Helenus, a son of Priam whom they had captured,\nthat they needed to complete two tasks before they\ncould capture Troy. First of all, they needed Heracles’\nbow, and second, they needed to capture the\nPalladium, a wooden statue of Athena that was kept\nin Athena’s temple in Troy. The Greeks first set out\nto acquire Heracles’ bow, which was a difficult task\nbecause Heracles had given it to his friend, Philoctetes, THE ODYSSEY – AN INTRODUCTION 155\nbefore he died. Many years earlier, at the beginning\nof the Trojan War, the Greeks had abandoned him on\na desert island, so he hated the Greeks and did not\nwant to give them Heracles’ bow. But eventually, with\nthe help of Achilles’ son, Neoptolemus, they were able\nto convince him to give them Heracles’ bow. The entire\nstory, including the reason why the Greeks abandoned\nPhiloctetes in the first place, is told in Sophocles’ play,\nPhiloctetes.\nThen the Greeks needed to somehow acquire the\nPalladium, since Helenus had told them that as long as\nthe Palladium was inside Athena’s temple, the city could\nnot fall. Odysseus and Diomedes snuck into the city in\ndisguise and stole the Palladium, taking it with them to\nthe Greek camp.\nTHE TROJAN HORSE\nNow the only thing standing between the Greeks and\nvictory were the impressive walls of Troy. Odysseus\nhatched a scheme to get the Greeks inside the city.\nA giant, hollow wooden horse was constructed and a\nselect group of warriors was placed inside. The rest\nof the Greeks sailed just out of sight of Troy, waiting\nfor a signal from the city to come back. The Trojans,\nwhen they saw that the Greek army had left, assumed\nthat the Greeks had finally admitted defeat and had\nsailed back home. The Trojans took the horse, which\nthey believed to be a thank-offering to Athena for a safe\ntrip home, inside their city. That night they celebrated\nthe end of the war with an amazing party and then fell\ninto a drunken sleep. While the city slept, the Greek MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n156\nCLASSICAL MYTHOLOGY\nwarriors came out of the wooden horse. They quickly\nwent to the gates, opened them, and then lit a fire as\na signal to the Greek fleet that they were ready for\nreinforcements. The Greek fleet returned, the warriors\ninside the city opened the gates, and the Greeks burned\nand pillaged the city, razing it to the ground. THE ODYSSEY – AN INTRODUCTION 157\nThis is a famous Athenian red-figure vase (c. 480–470 BC)\nshowing Odysseus tied to the mast, listening to the Sirens’ song,\nas his crew rows past their island. This vase shows the Sirens as\npart-woman and part-bird, although Homer seems to imagine\nthem in completely female form. This very well-known vase, on\ndisplay in the British Museum, has become the basis for several\nmodern depictions of the Sirens, including the one by N. C.\nWyeth, below. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n158\nCLASSICAL MYTHOLOGY\nN. C. (Newell Convers) Wyeth was one of the greatest American\nillustrators of the early twentieth century. This painting, from a\n1929 edition of The Odyssey, is clearly modeled on the Sirens\nvase in the British Museum, but it depicts Odysseus tied to the\nmast in a Christ-like pose, while the Sirens seem to embody\nsexual temptation. N. C. Wyeth (1882–1945), The Sirens, 1929, oil\non canvas, 48 1/2 x 38 1/4″. Brandywine Museum purchase,\n1991. THE ODYSSEY – AN INTRODUCTION 159\nTHE SACK OF TROY AND THE RETURNS\nThe Greeks were savage in their sack of the city and\ntheir actions had lasting consequences on their\njourneys home. The Lesser Ajax (the son of Oïleus,\ncalled “Lesser” to distinguish him from the more\nfamous warrior named Ajax) raped Cassandra in\nAthena’s temple. As you can imagine, Athena was\nfurious, and she found a way to punish him so that\nhe did not survive [see Athena]. Neoptolemus killed\nPriam at the altar of Zeus, but when he arrived home\nhe was killed by Orestes in a quarrel over Hermione,\nthe daughter of Helen and Menelaus. Menelaus had\npromised Hermione to Neoptolemus but then later\ngave her to his nephew, Orestes. Agamemnon arrived\nhome quickly and without incident, but as soon as he\narrived he was killed at a banquet by his wife’s lover,\nAegisthus. Menelaus was blown off course to Egypt,\nand he spent seven years in Egypt before finally arriving\nhome to Sparta. Odysseus was blown around the entire\nMediterranean Sea and was not able to return home\nuntil ten years after the Trojan War was over (as we will\nsee in the Odyssey). Only one important Greek warrior\nmade it home quickly with no negative consequences:\nNestor. We will discuss why Nestor alone had no\ndifficulties getting home when we read the Odyssey. The Oresteia – An\nIntroduction\nThe Oresteia is a cycle of three plays, written by the\nplaywright Aeschylus, about Orestes, the son of\nAgamemnon. All Greek tragedies were written in\ntrilogies, but this is the only example of a trilogy that\nstill exists. The Oresteia was produced at the Greater\nDionysia Festival in 458 BC, where it won first prize.\nTHE AGAMEMNON\nThe first play in the trilogy is called the Agamemnon,\nand it centers around Agamemnon’s homecoming from\nthe Trojan War and his subsequent death at the hands\nof his wife. In it, Agamemnon has been gone for ten\nyears, and all that time his wife, Clytemnestra, has been\nangrily plotting her revenge on her husband for\nsacrificing their daughter, Iphigenia [see Agamemnon\nand Iphigenia]. Clytemnestra has taken a lover,\nAgamemnon’s cousin Aegisthus, who also wants\nrevenge on Agamemnon. Clytemnestra has sent her\nten-year-old son, Orestes, away so he will not get\n160 THE ORESTEIA – AN INTRODUCTION 161\ninvolved in the intra-familial feud. Aeschylus makes\nseveral changes to the story of Agamemnon’s death\nfrom the way that it is told in the Odyssey. In the\nAgamemnon, it is Clytemnestra, not Aegisthus, who kills\nher husband.\nTHE LIBATION BEARERS\nThe next play in the cycle is called The Libation Bearers,\nand it takes place seven or eight years after the death of\nAgamemnon. Orestes, Agamemnon’s son, now around\neighteen, comes back to Mycenae with his cousin,\nPylades. Apollo had instructed Orestes to avenge his\nfather’s murder by killing both Clytemnestra and\nAegisthus. Orestes has no trouble killing Aegisthus, but\nit is extremely difficult for him to kill his own mother.\nOnly after Pylades reminds Orestes of Apollo’s\ncommand is Orestes finally able to kill Clytemnestra.\nAgamemnon’s murder has now been avenged, but the\nfact that Orestes has killed his mother creates a further\nproblem. The Erinyes are female monsters who punish\nmurderers, especially those who have murdered\nmembers of their own family. (The Erinyes, known as\nthe Furies in Latin, are depicted as ugly women with\nsnakes for hair. They are thought to have originated\nfrom the curses of the person who has been killed.)\nSo now that Orestes has killed his mother, the Erinyes\npursue Orestes and start to drive him mad. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n162\nCLASSICAL MYTHOLOGY\nOrestes and Pylades kill Clytemnestra and Aegisthus on a\ncinerary (funerary) urn in the Museo Archeologico Regionale\nAntonino Salinas in Palermo, Italy\nTHE EUMENIDES\nThe final play in the trilogy is The Eumenides, a play\nthat also serves as a foundation myth for the Athenian\ncourt system. It opens with Orestes, still pursued by\nthe Erinyes, fleeing to Delphi to appeal to Apollo for\nhelp, since Apollo sent him to kill his mother in the first\nplace. Apollo cannot send the Erinyes away, but he does\nmake them fall asleep so Hermes can escort Orestes to\nAthens. THE ORESTEIA – AN INTRODUCTION 163\nApollo purifying Orestes while the Erinyes sleep nearby with the\nghost of Clytemnestra trying to awaken them, found on a krater\nin the Louvre\nOnce in Athens, Orestes appeals to Athena for help,\nand Athena organizes a trial for Orestes. The goddess\npresides over the trial with twelve Athenian citizens\nacting as jury; this is the mythical origin of the jury\ntrial. The vote splits down the middle; six jurors find\nOrestes innocent and six find him guilty. It is up to\nAthena to cast the deciding vote, and she votes in favor\nof Orestes. This is the mythical origin of the Athenian\ncustom that a tied vote is always decided in favor of the\ndefendant. But the Erinyes do not accept the verdict;\nthey still want to punish Orestes for the murder of his MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n164\nCLASSICAL MYTHOLOGY\nmother. Athena convinces the Erinyes to have mercy on\nOrestes; they also agree to change their name to the\nEumenides (meaning “The Kindly Ones”) in return for\nreceiving perpetual honor in Athens. Origins\nTHE FIRST GENERATION OF GODS\nThere are several different versions of how the world\nbegan in Classical mythology, but the version most\nrecognized is found in Hesiod’s Theogony (theo-\nmeaning “god” and -gony meaning “origin/birth”).\nHesiod says that the first being to exist was Chaos, a\ndark and murky void who becomes the progenitor of\nthe gloomy and negative aspects of the universe, such\nas Nyx (Night), Thanatos (Death), and the Moerae (the\nFates; sometimes, however, the Fates are said to be\nthe daughters of Zeus and Themis). Next came Gaia\n(Earth, sometimes called Gē), Tartarus (the lowest part\nof the Underworld), and Eros (Erotic Love). Gaia alone\ngave birth to Uranus (Ouranos or Οὐρανός, meaning\n“sky/heavens”), Urea (Ourea, or Mountains), and Pontus\n(Sea). Now that Eros existed, future births could\nproceed with the aid of erotic love. Gaia and Uranus\nmarried and had three sets of children: the twelve\nTitans (including Cronus and Rhea), the three Cyclopes\n(meaning “circle-eyed,” because each one had only one\nbig eye in the middle of his forehead), and the three\n165 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n166\nCLASSICAL MYTHOLOGY\nHundred-Handers (so named because each one had a\nhundred hands; they also had fifty heads).\nTHE SECOND GENERATION OF GODS: THE\nTITANS\nThe Mutilation of Uranus by Saturn by Cristofano Gherardi in the\nPalazzo Vecchio in Florence\nUranus disliked his children, particularly the monstrous\nCyclopes and Hundred-Handers, so he prevented them\nfrom being born by blocking up Gaia’s many wombs\n(caves). This was painful for Gaia and she became angry\nat her husband; she also wanted her children to see\nthe light of day. She asked her children to help her\noverthrow their father and one, the Titan Cronus,\nvolunteered. Gaia made a sickle out of adamant (a\nmythical metal that was extremely hard) and gave it\nto her son, telling him to lie in wait for his father. In\nthe evening, Uranus came down from the sky to sleep\nwith his wife, and Cronus used the opportunity to cut\noff his father’s genitals. He threw the genitals into the\nsea, and the goddess Aphrodite was born from the\nmixture of semen and sea-foam that formed around\nthem [see Aphrodite]. As they fell, some bloody drops ORIGINS 167\ndripped onto the ground, impregnating Gaia with the\nErinyes (known as the Furies in Latin) and the Gigantes,\nor Giants.\nThe sickle was used for harvesting grain.\nCronus replaced his father as ruler of the universe,\nand soon his subordinates were chafing under his rule.\nHe imprisoned his brothers, the Cyclopes and the\nHundred-Handers, in Tartarus, the deepest and darkest\nplace in the universe. Gaia and Uranus, who, now\nwithout his genitals, was able to live in peace with his\nprogeny, warned Cronus that one of his children was\ndestined to overthrow him. Cronus, hoping to avoid this\nfate, swallowed each of his children (Hestia, Demeter,\nHera, Hades, and Poseidon) in turn as soon as his wife\nand sister, Rhea, gave birth to them. Rhea was upset\nthat she was not able to spend time with her children,\nso when she became pregnant with another child, she\nmade a plan with the help of her parents, Gaia and\nUranus. When Rhea gave birth to her youngest child, MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n168\nCLASSICAL MYTHOLOGY\nZeus, she replaced the infant with a stone wrapped in\nswaddling clothes and gave it to Cronus to swallow.\nMeanwhile Gaia hid Zeus in a cave on Crete [see Creta\non map]. Zeus stayed there for a year, suckled by the\ngoat Amalthea, until he was mature enough to confront\nhis father (the gods grow up quickly). On the advice of\nGaia, Zeus gave his father an emetic which caused him\nto regurgitate his other children. Cronus also vomited\nup the stone he had swallowed, and Zeus placed it in\nDelphi, where it became the navel stone of the earth.\nTogether, the sons and daughters began a war against\ntheir father, which is referred to as Titanomachy, or the\nBattle of the Gods and the Titans. ORIGINS 169\nThe Omphalos, or the navel stone of the earth, in the\nArchaeological Museum of Delphi MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n170\nCLASSICAL MYTHOLOGY\nTHE BATTLE OF THE GODS AND THE TITANS\nThe Battle of the Gods and the Titans lasted for ten\nyears, and for a long time both sides were evenly\nmatched. But eventually Zeus turned the tide of battle\nto his advantage by releasing his uncles, the Cyclopes\nand the Hundred-Handers, from Tartarus. The Cyclopes\nforged the thunderbolts (what we would call lightning\nbolts) for Zeus and the Hundred-handers threw huge\nrocks from their three hundred hands. The sea roared\nand the whole earth shook with the battle, and the sky\nechoed in response. Zeus threw so many thunderbolts\nthat the whole world caught on fire, and finally the\nTitans were defeated. ORIGINS 171\nAtlas with the Farnese Globe in the Naples Archaeological\nMuseum\nAfter Zeus finally won, he threw the Titans into Tartarus\nexcept for Atlas, who was the son of the Titan Iapetus.\nAtlas was ordered to hold up the sky so it did not fall\nonto the earth. Atlas’ brothers, Prometheus MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n172\nCLASSICAL MYTHOLOGY\n(Forethought) and Epimetheus (Afterthought), had\nfought on Zeus’ side, so they were not punished. The\nCyclopes became Zeus’ personal team of metallurgists;\nthey were the ones who forged his thunderbolts. The\nHundred-Handers were given the task of guarding the\ngates to Tartarus. ORIGINS 173\nThe sculpture of Atlas at Rockefeller Center MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n174\nCLASSICAL MYTHOLOGY\nTHE THIRD GENERATION OF GODS: THE\nOLYMPIANS\nThe three sons of Cronus divided the universe into\nthree kingdoms, one for each to rule, and drew lots to\ndetermine who would rule which part. Zeus became the\nRuler of the Heavens and King of the Gods, Poseidon\nheld dominion over the seas and waterways, and Hades\nruled the Underworld as King of the Dead. Gaia became\nangry with the Olympians for their treatment of her\nchildren, the Titans, so she joined with Tartarus and\nbore Typhoeus (sometimes called Typhon), a monster\ndescribed differently by each author, though Hesiod\ndescribes him as having a hundred dragon heads\ngrowing from his shoulders. Typhoeus breathed fire\nfrom his dragon heads and caused the entire world to\nshake; he wanted to take power in Zeus’ place. Zeus\ncame down from Olympus to meet the monster head\non, beating him down and hurling many thunderbolts\nat him. Once again, the earth, sea, and sky were\nengulfed in flames and the entire world was shaken.\nZeus finally defeated the monster and threw him into\nTartarus, where he became the source of typhoon\nwinds. Some authors say that he was buried under Mt.\nEtna, in Sicily, where he became a volcano.\nANALYSIS\nThe story of how Zeus came to rule over gods and men\nis certainly a violent one, and it has several important\nthemes. One theme is the establishment of the rule of\nthe Olympian gods (who sometimes symbolize justice, ORIGINS 175\nlaw, and order) over the Titans (who sometimes\nsymbolize brute force) and the Gaia-Uranus generation\n(who symbolize the unbridled forces of nature). This\ntheme is sometimes referred to as “from chaos to\ncosmos,” since cosmos (kosmos, κοσμός) means “the\nordered universe” in Greek. Another more troubling\ntheme is the conflict between the generations, as each\nfather tries to suppress the rule of his sons. Orpheus\nHermes taking Eurydice back to the Underworld on a relief in the\nNaples Archaeological Museum\n176 ORPHEUS 177\nOrpheus, said to be the son of Apollo and Calliope, lived\nin Thrace in Northwest Greece, and was the best lyre\nplayer in the world. Some say that Apollo was the one\nwho taught him to play. Orpheus played and sang so\nbeautifully that he enchanted everyone who heard him.\nEven animals stopped to listen to him, and stones and\ntrees moved closer to hear him sing.\nOrpheus fell in love with a beautiful nymph (or nature\nspirit) named Eurydice, and he won her heart by his\nsinging. They were married in an open-air ceremony\non a hillside. In the late afternoon after the wedding,\na former admirer of Eurydice’s began to pursue her.\nShe became frightened and ran away without looking\nwhere she was going. In her fright, she stepped on\na snake, which bit her. The snake turned out to be\npoisonous, and Eurydice died almost immediately.\nOrpheus grieved constantly for Eurydice. He would sit\nand sing songs of mourning all day every day and weep\nas he sang. The animals and even the trees and grasses\ntried to comfort him, but it was no use. Every reason for\nliving seemed to have gone away when Eurydice died.\nAt last Orpheus decided to go into Hades and try to find\nher.\nOrpheus found the cave that led to Hades and slowly\ndescended into the Underworld. He sang to Cerberus\nand charmed him until the three-headed dog allowed\nhim to enter. Orpheus played for Hades and\nPersephone and sang them a song about the beginning\nof the world and the origin of gods and men. Then he\nsang about the joys of love and the sadness that comes\nwith love’s loss. Orpheus’ singing charmed even the\nhearts of Hades and Persephone, rulers of the dead. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n178\nCLASSICAL MYTHOLOGY\nThey allowed him to bring his dear Eurydice back to life\non one condition: he could not turn back and look at\nher until they reached the upper world.\nOrpheus agreed and turned to go, hoping that\nEurydice was following him. But the journey to the\nupper world was long and difficult, and Orpheus\ndesperately longed to see if Eurydice was really behind\nhim. Orpheus resisted this impulse until the opening\nof the cave was in sight, just ahead; then he could no\nlonger resist. Orpheus turned back, just for an instant,\nto see if Eurydice was really there. But that instant was\nhis undoing. As he looked back, he saw Hermes leading\nher back down to Hades, even as she stretched out her\narms to him in her heart-aching sorrow.\nOrpheus was inconsolable over his loss of Eurydice\nfor the second and final time. He sang constantly of his\nlove for her and refused to look at any other women.\nAlso, he became a devoted worshipper of Apollo, the\nsun god. It was his custom to go up to the top of a\nmountain every morning in order to greet the sun. This\nmade Dionysus very angry. Dionysus was at that time\nwinning the region of Thrace over to his own worship,\nand he was celebrated at night with frenzied music\nand dancing. Dionysus resented Orpheus and began to\ncomplain to his Maenads about Orpheus’ neglect. The\nMaenads already hated Orpheus because he refused\ntheir advances, so one day, in a Dionysiac frenzy, they\nattacked Orpheus and tore him limb from limb.\nThe Muses gathered up some parts of his body and\nburied them, but Orpheus’ head and his lyre fell into\nthe River Hebros. From there they floated to the island\nof Lesbos, off the coast of Asia, the head still singing as ORPHEUS 179\nit went. The Lesbians took the head and the lyre and\ntreated them with great respect. They dedicated the\nlyre to Apollo, and it was kept for many years in Apollo’s\ntemple there. Some say that the Lesbians buried\nOrpheus’ head nearby; others say that they kept it, too,\nin Apollo’s temple, where it not only continued to sing,\nbut also gave oracles and prophesied the future.\nAfter many years a religion grew up, said to have\nbeen inspired by Orpheus. Orphic religion told of a life\nafter death. It hinted that the soul did not die with the\nbody, but went on a journey to another world. Those\nwho had lived good lives and had purified themselves\nof all evil lived permanently in a beautiful place,\nsometimes called the Elysian Fields. There the sun\nalways shone and the souls enjoyed an ageless and\ndeathless existence. Those who had lived sinful lives\nremained in Hades, suffering dreadful tortures. Those\nwhose lives had been partly good and partly evil were\ngiven a glimpse of the Elysian Fields, but were forced to\nbe reincarnated into new bodies and return to this life\nonce more. Persephone\nRoman name: Proserpina\nEpithets: Chthonian (with mother Demeter), Kore\n(maiden)\nSymbols: pomegranate (fertility symbol), torch, crown\nFunctions: goddess of the dead and fertility\n180 PERSEPHONE 181\nHades and Persephone with all their symbols on a terracotta\npinax in the Cleveland Museum of Art\nPersephone was the daughter of Zeus and Demeter.\nShe was married to Hades, ruler of the Underworld,\nwho abducted her and took her as his bride. After\nDemeter discovered what had happened, Demeter and MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n182\nCLASSICAL MYTHOLOGY\nHades struck a deal. Persephone would spend two\nthirds of the year with her mother, during which crops\nwould grow, and the rest of the year she would live\nwith her husband, during which the earth would die\n[See Demeter]. This is a natural aetiological myth that\nexplains the origin of the seasons: Persephone is with\nDemeter during the spring, summer, and fall, but\nduring the winter, when Persephone is in Hades with\nher husband, it is winter on the earth and the crops do\nnot grow.\nPersephone is always depicted as happy in her role\nas Queen of the Dead despite the violent nature of her\ncapture, which raises some interesting questions about\nhow marriage was perceived in ancient Greece.\nPersephone does not have a large role in myth. One\nnotable exception is one of the versions of the myth\nof Aphrodite and Adonis. Aphrodite was smitten by the\nbeauty of the young and handsome Adonis and gave\nhim to Persephone for safe keeping, but Persephone\nwas also smitten. The Queen of the Dead refused to\ngive Adonis back, and Aphrodite went to Zeus to help\nsettle the quarrel. Zeus declared that the boy should\nspend a third of the year with Persephone, a third with\nAphrodite, and a third as he pleased, which he chose to\nspend with Aphrodite. This mirrors the deal brokered\nfor Persephone’s time, and similarly, Adonis became\nassociated with death and rebirth in the Adonia festival\n[see Aphrodite]. PERSEPHONE 183 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n184\nCLASSICAL MYTHOLOGY\nProserpine by Rossetti (1874) in the Tate Gallery of Modern Art in\nLondon Perseus\nPerseus is the only Greek hero (that I am aware of)\nwho does NOT fit the Story Pattern of the Greek Hero\n(see the Story Pattern of the Greek Hero). To be sure,\nPerseus does fit parts of the pattern: he certainly has\nan Unusual Birth, and he does go on a Heroic Journey\nin which he accomplishes Heroic Tests. But Perseus\ndoes not accomplish any Early Tests (that I know of),\nand, most importantly, Perseus is the only one of all\nthe Greek heroes who has a happy life after he has\naccomplished his heroic journey and who does NOT\nhave an unhappy death. I guess you could say that\nPerseus is the exception that proves the rule.\nI. UNUSUAL BIRTH\nAcrisius, the king of Argos [see map], had a daughter,\nbut no sons, so he consulted the Delphic Oracle to\nsee how he could get an heir to the throne. But the\noracle he received made him forget the reason why he\nhad consulted the Oracle in the first place. The Delphic\nOracle said: “Your daughter’s son will kill you.”\n185 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n186\nCLASSICAL MYTHOLOGY\nDanaë by Correggio (1530) in the Galleria Borghese in Rome\nOf course, Acrisius wanted to do everything he could to\nprevent this. So he put his daughter, Danaë, in a bronze\nprison, and he would not let any man near her. But\nZeus fell in love with her, and he visited her in the form\nof a shower of golden rain. Nine months later, Danaë\ngave birth to Perseus. PERSEUS 187\nDanaë and Zeus disguised as a shower of gold on a krater in the\nLouvre\nAcrisius put them both in a wooden chest and put them\nout to sea. But the chest floated safely to the island\nof Seriphos, where it was found by Dictys, the brother\nof the king. Dictys took both mother and child into his\nhome, and treated them like members of his family.\nPerseus received a good upbringing in Dictys’ care.\nAll went well for many years, until Polydectes, Dictys’\nbrother and the king of Seriphos, fell in love with Danaë\nand wanted to marry her. Danaë refused, and Perseus,\nwho was now a young man, defended his mother, so\nPolydectes decided to find a way to get rid of Perseus. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n188\nCLASSICAL MYTHOLOGY\nII. EARLY TESTS\nApparently none.\nIII. & IV. HEROIC JOURNEY & TESTS\n1. Polydectes told everyone that he was planning to\nmarry Hippodameia, the daughter of the wealthy King\nOinomaos of Pisa, and he asked all the men in his\nkingdom to contribute something toward the\nsubstantial bride price that he would have to pay. When\nasked for a contribution, Perseus said (a bit\ndramatically) that he would begrudge Polydectes\nnothing, and that he would even give him the Gorgon’s\nhead. But Polydectes held the youth to his promise.\nSo Perseus set out to retrieve the head of the Gorgon,\nMedusa. Of course, Polydectes had no intention of\nmarrying Hippodameia, and he was well aware of the\nproblematic nature of Perseus’ quest.\nThere were actually three Gorgon sisters, but the\nother two Gorgons were immortal. Since Medusa was\nthe only Gorgon who was capable of being killed, it was\nher head that Perseus was going to seek. But there\nwas one, huge problem: anyone who looked at Medusa\nwould instantly be turned into stone. So how could\nanyone kill her without dying before he could complete\nthe mission? Fortunately for Perseus, however, Athena\nalready hated Medusa (for the reason why, see\nPoseidon), so Athena decided to help Perseus kill her. PERSEUS 189\nPerseus killing Medusa and Pegasus being born from her head\non a lekythos in the Metropolitan Museum of Art in New York\nCity\nFirst, Athena helped Perseus find the Graeae. The\nGraeae were three old sisters who shared a single eye\nbetween them. The Graeae did not want to help MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n190\nCLASSICAL MYTHOLOGY\nPerseus, but he managed to steal their eye as they were\npassing it from one to another; Perseus refused to give\nback the eye until they helped him, so they agreed. The\nGraeae told Perseus about some nymphs and where\nto find them. And when Perseus found the nymphs,\nthey gave him three important gifts: winged sandals,\nwhich would allow him to fly through the air, a cap\nof darkness, which would make him invisible, and a\nspecial metallic pouch for Medusa’s head. PERSEUS 191\nPerseus by Cellini (1554) found under the Loggia dei Lanzi in\nFlorence\nAthena also told Perseus not to look at Medusa directly MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n192\nCLASSICAL MYTHOLOGY\nwhile killing her with his sword, but to look at Medusa’s\nreflection in his shield to avoid being turned into stone.\nPerseus was able to avoid the two immortal Gorgons\nbecause he was wearing the cap of invisibility; he flew\ndown to the Gorgons without being seen, and, looking\ncarefully at his shield, he cut off Medusa’s head and\nplaced it in his pouch. Much later (after his adventures\nwere over) Perseus gave Medusa’s head to Athena, and\nAthena put it on the aegis (or, in some versions, on her\nshield). PERSEUS 193\nPerseus with the Head of Medusa by Antonio Canova from\n1804–1806, found in the Metropolitan Museum of Art in New\nYork City\n2. As Perseus was flying home on his winged sandals,\nPerseus passed by Ethiopia (or in some versions,\nPhoenicia) and saw a beautiful girl, Andromeda, who MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n194\nCLASSICAL MYTHOLOGY\nwas the princess of the land, chained to a rocky cliff\nand about to be devoured by a sea serpent. Perseus\nimmediately fell in love with her. Using his sword and\nwinged sandals, Perseus killed the sea serpent (in some\nversions, he turns the monster to stone by showing\nit Medusa’s head). And, of course, he marries\nAndromeda.\nPerseus rescuing Andromeda from the sea serpent on an\namphora found in the Altes Museum in Berlin\nV. HAPPY LATER LIFE\nUnlike the other Greek heroes, Perseus does not have\nan unhappy later life and a terrible death. On the\ncontrary, Perseus seems to be the only Greek hero who\nlives happily ever after. PERSEUS 195\nPerseus returned to Seriphus, where he found that\nPolydectes was about to marry his mother, although\nshe still did not want to go through with the marriage.\nAs he entered the hall where Polydectes and his friends\nwere having a feast to celebrate his upcoming\nmarriage, Perseus pulled Medusa’s head out of its bag,\nturning the king and all his friends into stone. Perseus\nnow had no more use for Medusa’s head, so he\ngratefully gave it to Athena, and he sailed home to\nArgos with Andromeda and Danaë.\nAcrisius received them kindly, and Perseus did not\nresent his grandfather for all the trouble he had caused\nhim and his mother. But not long afterward, when he\nwas competing at an athletic contest, Perseus threw a\ndiscus and accidentally hit Acrisius, killing him instantly.\nHe did not feel comfortable ruling his grandfather’s\nkingdom, after having killed him, so he and Andromeda\nmoved away, and Perseus founded the kingdom of\nMycenae. And Perseus and Andromeda lived happily\never after! Poseidon\nRoman name: Neptune\nEpithets: Enosichthon (Earth-Shaker), Hippios (the\nHorse God)\nSymbols: trident, horse, bull\nFunctions: god of the sea, salt and fresh water\nsprings, earthquakes, and horses\nPOSEIDON’S BIRTH MYTH\nPoseidon was the son of Cronus and Rhea. Most stories\nrelate that he was swallowed by his father like all his\nolder siblings [see Origins] and was rescued by Zeus\nalong with his other siblings. After the Olympians\noverthrew their Titan parents, the three Olympian\nbrothers, Zeus, Hades, and Poseidon, drew lots to divvy\nup the realms. Poseidon was allotted domain over the\nseas, but he always remained immensely jealous of\nZeus’ position of King of the Gods. He once convinced\nHera and Athena to join him in a rebellion against Zeus,\nwhom they managed to imprison in chains until Thetis\nbrought Briareüs, the chief of the Hundred-Handers, to\nrelease him (Homer, Iliad, 1.396-405).\n196 POSEIDON 197\nPOSEIDON’S PATRONAGE\nThe gods often competed with each other to win\npatronage over areas in Greece. Poseidon vied with\nseveral of his fellow gods for several areas, and\nPoseidon did not often fare well in these contests. He\nand Helius (god of the sun) both wanted Corinth [see\nCorinthus on map] and could not agree, so they took\ntheir dispute to Briareüs, who divided the area between\nthe two, giving the citadel to Helius and the isthmus\nto Poseidon. Hera and Poseidon fought passionately\nover Argos [map], and when the three river gods who\nwere given the task of judging the dispute were found\nin favor of Hera, Poseidon flooded the city and dried\nup the rivers in anger. Athena and Poseidon argued\nover possession of Troezen, and Zeus ruled that they\nwould share possession of the city. The most famous\nof Poseidon’s contests for power was over Athens [see\nAthenae on map], where he competed unsuccessfully\nwith Athena [see Athena]. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n198\nCLASSICAL MYTHOLOGY\nAthena and Poseidon competing for patronage of Athens on an\namphora in the Cabinet des Médailles in Paris\nFAMILY LIFE\nPoseidon was married to Amphitrite, a daughter of\nOceanus and Tethys, and they had a few children, most\nnotably Triton, but like his brother Zeus, Poseidon had\na tendency to pursue extramarital affairs. The cyclops POSEIDON 199\nPolyphemus (who figures in the Odyssey) was his son\nby the sea nymph, Thoösa, and he fathered the hunter\nOrion [see Artemis] with Euryale, the daughter of\nMinos. Poseidon seduced Tyro (the mother of Aeson\nand the grandmother of the hero, Jason) in the form\nof a river and became the father of Pelias [see Jason]\nand Neleus, who, in turn, became the father of Nestor\n(who figures in both the Iliad and the Odyssey). Theseus\nwas also a son of Poseidon [see Theseus]. Unlike Hera\n[see Hera], Amphitrite does not seem to have cared\nmuch that her husband often looked for love outside\nof marriage. In fact, in one version of Theseus’ journey\nto Crete [see Theseus], when Theseus arrived in Crete,\nMinos questioned his paternity, and Theseus\nquestioned Minos’. So, each one had to prove to the\nother that he was the son of a god. Minos prayed to\nhis father Zeus for a sign and received thunder and\nlightning. Theseus jumped into the sea and Amphitrite\ngave him her tiara to prove his connection to her\nhusband.\nPOSEIDON’S AFFAIRS\nIt seems strange that a sea god should be connected\nto horses, but Poseidon has several myths establishing\nhim as a god of horses. While Demeter was wandering\nthe earth looking for Persephone [see Demeter],\nPoseidon decided to pursue her. Demeter, trying to\navoid her brother, turned into a mare, but Poseidon\nresponded by turning into a stallion and having his\nway with her anyway. The product of this union was\nthe divine horse, Arion. On another occasion, Poseidon MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n200\nCLASSICAL MYTHOLOGY\nseduced the gorgeous maiden, Medusa, in one of\nAthena’s temples. Naturally, the virgin goddess was\nenraged that her temple was so defiled. Athena\nretaliated by transforming Medusa into a hideous\nmonster with snakes for hair who would turn anyone\nwho looked at her into stone. Later, when Perseus cut\noff Medusa’s head, the winged horse Pegasus sprang\nout from her neck, the product of Medusa and\nPoseidon’s tryst. Pegasus was later tamed by another\nof Poseidon’s sons, Bellerophon. Peleus, the father of\nAchilles, was given the immortal horses, Xanthus and\nBalius, at his wedding by Poseidon. The god was also\na friend to the centaurs and helped hide them from\nHeracles when he waged war on them [see 12 Labors\nof Heracles]. POSEIDON 201\nCaravaggio’s Medusa (1597) in the Uffizi Gallery in Florence\nPOSEIDON’S ROLE IN THE TROJAN WAR\nDuring the Trojan War, Poseidon sided with the Greeks\nat least in part because he was still angry with Troy\nfor the treatment he had received at the hands of\nLaomedon, the father of King Priam. Apollo and\nPoseidon were contracted by Laomedon to build walls\naround the city. The two gods agreed to perform this\nmanual labor either because they wanted to test him\nor because Zeus had decreed, as punishment for a MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n202\nCLASSICAL MYTHOLOGY\nrebellion of which they had both been a part, that they\nwork for Laomedon for a year. In any case, at the end\nof the year Laomedon would not pay them and even\nthreatened to sell them as slaves. Apollo responded by\nsending a plague, and Poseidon sent a sea monster\nto terrorize them. Apollo, apparently, did not hold a\ngrudge, since he always favored the Trojans, but\nPoseidon sided with the Greeks in the Trojan War.\nDespite favoring the Greeks, however, Poseidon, like\nAthena, was quickly angered by the less-than-perfect\nbehavior of the victorious Greeks. Poseidon helped\nAthena punish the Lesser Ajax for his rape of Cassandra\nduring the sack of Troy [see Athena], and he kept\nOdysseus from his home for ten years to punish the\nhero for blinding his son Polyphemus.\nPOSEIDON, KING MINOS, AND THE MINOTAUR\nTo read about this myth, see the Minotaur. POSEIDON 203\nThe temple to Poseidon at Sounion\nPOSEIDON’S HISTORY\nPoseidon seems to be a merging of the Mycenaean\ngod, Poseidaon (meaning “husband of Da”, as πόσις/\nposis = husband), who may have been the consort of\nDemeter, and one or more pre-Greek sea gods. Since\nthe Mycenaeans migrated into Greece from central\nEurope, they had no sea gods and thus had to adapt\nsome of their gods to new functions. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n204\nCLASSICAL MYTHOLOGY\nThe cape at Sounion Prometheus\nPrometheus (Forethought) was the son of the Titan\nIapetus and was brother to the Titans Epimetheus\n(Afterthought) and Atlas. Prometheus and Epimetheus\nsided with Zeus and the other Olympians against the\nTitans and their brother and father because\nPrometheus could foresee the outcome of the conflict.\nBecause of this, Prometheus and Epimetheus did not\nsuffer the same fate as Iapetus and Atlas.\nPrometheus was considered the father of mankind\nbecause he created them from clay. He made only\nmen—no women—and let them loose to live in the\nworld. The world was not a kind place, though, as it\nwas filled with beasts and getting enough food to stay\nalive was a difficult task. This was not made any easier\nby Zeus, who insisted that mortal men sacrifice to the\ngods frequently and give the entire animal to the gods.\nPrometheus appealed to Zeus to allow the mortals to\ngive only a portion of the animal to the gods and to\nkeep the rest for themselves. Zeus agreed, but the two\ncould not agree on which parts would be reserved for\nthe gods. Prometheus knew that Zeus wanted all the\ngood parts of the animal and came up with a plan to\ntrick him. Prometheus took an animal and divided the\n205 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n206\nCLASSICAL MYTHOLOGY\nchoice cuts of the meat from the bones and other less\nsavory tissues. On the pile of bones he placed fat and\na small portion of nice meat on top to disguise it, but\non the pile of good meat he placed some lesser meat\nand gristle. He had Zeus choose from the two piles,\nand Zeus chose the bones and fat. Zeus was very angry\nwhen he found out, and he never forgave Prometheus\nfor tricking him.\nMen now had meat, but they still had difficulty\nsurviving because they could not keep warm or cook\ntheir food. Prometheus knew that fire would save them,\nbut Zeus kept fire for the gods alone. So again,\nPrometheus thought up a plan. He took a red-hot coal\nand hid it inside a woody fennel stalk to give to mortals.\nNow the mortals could cook and keep warm and they\nwere much happier; they worshipped Prometheus as\nthe inventor of all the arts of civilization. But when Zeus\nsaw mankind using fire, he became furious at having\nbeen tricked once again. He ordered that Prometheus\nbe nailed to a lonely spot in the Caucasus Mountains.\nEvery day an eagle would come to peck out his liver, but\nevery night Prometheus’ liver would grow back so the\neagle could eat it again. But Zeus was not finished with\nhis punishments; now he wanted to punish mankind.\nZeus then had Hephaestus build a beautiful woman,\nnamed Pandora (All Gifts) because each of the gods\nhad given her a gift, and he sent her to Epimetheus.\nEven though Prometheus had warned his brother not\nto accept any gift from the gods, Epimetheus (true to his\nname) forgot all about his brother’s warning. As soon as\nEpimetheus saw Pandora, he knew he had to have her\nfor his wife. But Pandora brought with her a jar (not a PROMETHEUS 207\nbox) that was filled with evils. And once she opened her\njar, all the evils flew out into the world; only hope stayed\nbehind as a comfort for mankind.\nPrometheus remained chained to the mountains\nuntil Heracles shot the eagle with his arrow and set the\nTitan free while on his labor to bring back the Apples\nof the Hesperides [see the 12 Labors of Heracles]. Zeus\nallowed Heracles to free Prometheus because he held\nsome very useful knowledge that he would only divulge\nonce he had been freed. After he was freed,\nPrometheus informed Zeus that the goddess Thetis,\nwith whom Zeus was infatuated, was fated to give birth\nto a son who would be greater than his father [see\nIntro to Iliad]. Before Zeus knew this prophecy, he and\nPoseidon had been rivals for Thetis’ hand, but once\nthe prophecy was known, neither god wanted anything\nto do with her. Zeus and Poseidon agreed that Thetis\nshould be safely married off to a mortal. And that is\nhow Thetis, a sea-goddess, came to marry Peleus, who\nwas only a mortal. For the story of their wedding and\nthe identity of the son (who did turn out to be greater\nthan his father), see the Introduction to the Iliad. Sphinx\nThe Greek sphinx was clearly inspired by the Egyptian\nsphinx, but the Greeks modified it and made it their\nown. The Greek sphinx had a woman’s face and breasts,\na lion’s body, and a bird’s wings. The word sphinx is\nGreek (σφίγξ), and it means “strangler,” perhaps\nstemming from the fact that lionesses usually kill their\nprey by strangling it.\nSince sphinxes were very intimidating, the Greeks\nfrequently put them on gravestones, to frighten away\nwould-be grave robbers. This use is called\n“apotropaic”—meaning “causing someone to turn\naway.” Most of the examples of ancient Greek sphinxes\nthat we have today are from ancient gravestones.\n208 SPHINX 209\nA Sphinx statue from a grave stele found in the Archaeological\nMuseum in Corinth\nIn myth, there was one famous Sphinx, who turned up\nin Thebes shortly after its king, Laius, had been killed\nwhile on his way to consult the Delphic Oracle. This\nSphinx flew on top of the city walls, and asked all the MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n210\nCLASSICAL MYTHOLOGY\nTheban youths a riddle. When they could not answer\nit, she ate them! At the time, Creon was the regent in\nThebes (since Laius had died), and he was so desperate\nto get rid of the Sphinx that he promised the kingship\nand the hand of the widowed Queen Jocasta (who also\nhappened to be his sister) in marriage to anyone who\ncould solve the Sphinx’s riddle. This was the Sphinx’s\nriddle: “What goes on four feet in the morning, two feet\nin midday, and three feet in the evening?”\nOedipus answering the Sphinx’s riddle on a kylix found in the\nVatican Museum\nAt around this time Oedipus came to Thebes (since he\ndidn’t want to go back home to Corinth), and he solved\nthe riddle. Oedipus said, “The answer is ‘man’. A man\ncrawls on all fours in the morning of his life, he walks\non two feet in the midday of his life, and he uses a cane\nfor extra support when he is old.” The sphinx was so SPHINX 211\nupset that Oedipus had answered the riddle correctly,\nthat she threw herself down from the walls of Thebes\nand died. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n212\nCLASSICAL MYTHOLOGY SPHINX 213\nOedipus and the Sphinx by Gustave Moreau (1864) in the\nMetropolian Museum in New York\nSo Oedipus was welcomed to Thebes as a hero. He\nmarried Queen Jocasta and became the King of Thebes.\nOedipus and Jocasta had four children: Eteocles,\nPolynices, Ismene, and Antigone. Story Pattern of the Greek\nHero\nMyths from many lands illustrate the archetypal\npattern of the hero, in which a hero’s life follows a\npredictable pattern of types of events. These include an\nunusual birth, early tests, a heroic quest (with heroic\ntests), and a return and a reward. This pattern is drawn\nfrom the work of the comparative mythologist Joseph\nCampbell. Campbell discovered that the story of a\ntypical hero follows a predictable pattern across the\nmythologies of many different cultures.\nCampbell’s Story Pattern of the Hero applies to the\nGreek hero to some extent, but Greek heroes differ\nin one, crucial respect: the last stage. Greek heroes,\ncontrary to heroes from other cultures, usually have an\nunhappy later life and a violent or unhappy death.\nIn setting forth our own Story Pattern of the GGrreeeekk\nHero, we will concentrate especially on the heroes’\nunhappy later lives (after they have completed their\nheroic journeys) and their unhappy deaths because\nthey differentiate Greek myths from the myths of most\nother cultures.\n214 STORY PATTERN OF THE GREEK HERO 215\nSTORY PATTERN OF THE GREEK HERO\nI. Unusual Birth – usually has one divine parent &\none mortal parent\n• sometimes the god (if Zeus) changes his shape\n• sometimes there is both a divine and a human\nfather (both slept with the mother on same\nnight)\nII. Early Tests – must prove heroic nature while still\nyoung\nIII. Heroic Journey – motivated by a noble cause\n• often because his family has been deprived of\nrightful power\n• often imposed by a wicked king\n• often includes a descent to Hades & return\n• in psychological terms this often means facing\nhis own death\nIV. Heroic Tests\n• must pass series of difficult tests; often part of\nheroic journey\n• includes performing difficult and dangerous\nacts that greatly benefit his people MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n216\nCLASSICAL MYTHOLOGY\n• sometimes imposed by a wicked king\n• sometimes includes killing a monster or\ndragon\n• often wins princess bride as a reward\nV. Unhappy Later Life and Violent or Unhappy\nDeath\n• this aspect is peculiarly Greek\n• different from heroes of other cultures, e.g.\nour own\nNote: variations are important\n• most heroes don’t follow the pattern fully\n• it is interesting to note that each Greek hero is\nunique and not all of them fit into every\naspect of this general pattern\n• but all Greek heroes (except, perhaps, for\nPerseus) do have an unhappy later life and\nviolent or unhappy death\n• Heracles is perhaps the best example of this\npattern Theseus\nFunctions: hero and king of Athens\nTHE BIRTH OF THESEUS\nTheseus was either the son of Poseidon and Aëthra,\nthe daughter of King Pittheus of Troezen, or the son of\nAëthra and Aegeus, the king of Athens [see Athenae on\nmap]. Apparently both Aegeus and Poseidon slept with\nAëthra on the same night.\nAegeus, the king of Athens, was having trouble\nproducing an heir, so he went to the Delphic Oracle\n[map] to ask how he could solve his problem. The\nPythia said: “Do not open the foot of the wineskin until\nyou return home.” The meaning of this oracle, as was\noften the case, was unclear. On his way home to\nAthens, Aegeus stopped at Troezen to ask his friend,\nPittheus, who was known for his wisdom, what the\noracle meant. In ancient Greece, wineskins were made\nfrom a whole skin of a goat; one foot of the goatskin\nwas used for the spout. So when the Pythia said, “Don’t\nopen the foot of the wineskin,” she was literally saying,\n“Don’t uncork the wine.” But the foot of the wineskin\n217 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n218\nCLASSICAL MYTHOLOGY\nwas also very long and straight, so it was also a phallic\nsymbol. And that is what the Pythia meant; she meant\nto advise Aegeus not to sleep with any woman until\nhe returned home since the next woman he slept with\nwould bear him a son.\nA wineskin was made from the skin of a goat to hold wine. One\nof the feet of the goat would be made into the opening and thus\nit is called the foot. In this sculpture (found in the Naples\nMuseum), the wineskin is placed on top of a lion skin.\nPittheus knew the meaning immediately, but instead of\ntelling Aegeus what it meant, he chose to get Aegeus\ndrunk and have him sleep with his daughter, Aëthra.\nHe did this because Aegeus, as king of Athens, was\nvery powerful, and he wanted Aëthra’s son to become\nking of Athens. However, Aegeus did not know that\nPoseidon also slept with Aëthra later that same night. THESEUS 219\nTHESEUS’ EARLY TESTS\nThe next morning, before Aegeus left Troezen to return\nhome to Athens, he placed a pair of sandals and a\nsword under a large and heavy rock. He told Aëthra\nthat if she gave birth to a son, she should raise him. If\nhe became strong enough to remove the rock, he told\nher to send the boy to him in Athens with the sword\nand sandals as tokens of his parentage. If he could\nnot move the rock, however, she should keep him in\nTroezen.\nAëthra, of course, did give gave birth to a son. She\nnamed him Theseus, and he was so strong that he\nwas able to move the rock and take the tokens when\nhe was only sixteen. So, Theseus set out for Athens.\nNow, he could have taken the easy route to Athens by\nsea, but he chose the dangerous land route because\nhe wanted to have plenty of opportunities to perform\nheroic deeds. He had heard of the great deeds of\nHeracles, of course, and he wanted to show that\nHeracles was not the only hero in Greece. Theseus soon\nran into Periphetes, a son of Hephaestus who was\nknown by the name Corynetes, which means “club-\nbearer,” because he carried around a large bronze club\nwhich he used to cave in the skull of anyone who\npassed by him. Theseus could not defeat him with\nbrute strength, but he was clever and quick as well as\nstrong, so he managed to maneuver around Periphetes\nand take away his club. Once Theseus had the club,\nit was not difficult to overpower and kill Periphetes.\nHaving done so, Theseus continued on his journey.\nNext Theseus ran into the thief Sinis, who had earned MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n220\nCLASSICAL MYTHOLOGY\nthe name Pityocamptes, meaning “pine-bender,”\nbecause of his habit of bending down two separate\ntrees and tying men’s limbs to them. After that, he\nwould let the trees go, causing the man’s body to tear\napart. Theseus did the same to Sinis. He then decided\nto go a little out of his way to kill the Crommyonian Sow.\nHe dispatched her easily and returned to his journey,\nstopping next at the Sceironian Rocks, named for the\nthief who lived at the top, Sceiron. This thief would\nterrorize travelers by forcing them to wash his feet and,\nwhile they were doing that, kicking them off the cliffs\nto a giant turtle living below them which would eat the\ntravelers. Theseus defeated Sceiron by taking a hold of\nthe thief by the legs before he could kick and throwing\nhim over the edge.\nThe last two major deeds Theseus accomplished\nalong the way happened just outside Athens. First, he\nmet the king of Eleusis, Cercyon, who would challenge\nanyone who passed by to a boxing match and kill his\nopponent. Theseus overpowered him with his speed\nand killed Cercyon. Then, in a nearby town, he ran into\na man named Damastes, who had earned the name\nProcrustes, which means “stretcher,” because he would\ninvite travelers to stay the night, but when they did\nnot fit the bed he provided, he would cut down those\nwho were too large and stretch out those who were\ntoo small. Again, Theseus treated his foe to the same\npunishment he dealt out to his victims. And even today\npeople use the term “Procrustean bed” to describe a\ntheory that has been artificially made to fit the facts\n(because the facts have been altered). THESEUS 221\nTHESEUS AND MEDEA\nFinally, Theseus arrived in Athens and went to the\npalace of Aegeus. Tales of his deeds on his journey\nhad arrived before he did. Aegeus was impressed and\ninvited the young hero to feast with him. Because of\nthe rules of xenia [see Xenia], Theseus had not yet\nintroduced himself, and this allowed Aegeus’ wife,\nMedea, to act. Medea was a witch, and by this time\n(sixteen years after Aegeus had consulted the oracle)\nshe had married Aegeus and had born him a son,\nMedon. [For the background on how Medea came to\nAthens to be Aegeus’ wife, see Jason.] Medea\nrecognized Theseus immediately and knew that if\nAegeus discovered the hero’s identity, her son would\nnot be able to inherit the throne.\nMedea convinced Aegeus that the hero would side\nwith Aegeus’ brother Pallas, who had been trying to\ntake the throne away from Aegeus for years. She\nsuggested that Aegeus put poison in Theseus’ wine,\nand the King, who was easily fooled, agreed to do this.\nBut when the unsuspecting Theseus raised his hand\nto drink his wine, Aegeus recognized his own sword\nhooked to Theseus’ belt. In a panic, he dashed Theseus’\nwine cup to the ground just as Theseus was about to\ndrink it. Needless to say, Medea and Medon were\nbanished from Athens.\nTHESEUS, ARIADNE, AND THE MINOTAUR\nNot long after Theseus was publicly recognized as\nAegeus’ son, it was time for Athens to send seven MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n222\nCLASSICAL MYTHOLOGY\nyouths and seven maidens to Crete to be fed to the\nMinotaur [see Minotaur]. The Athenians had to do this\nevery nine years to atone for a previous crime. When\nTheseus heard about this, he was appalled that\nAthens—a great and powerful city—was so subservient\nto King Minos of Crete. So Theseus volunteered to be\none of the youths taken. Theseus vowed to kill the\nMinotaur, bring back all the Athenian youths and\nmaidens alive, and free Athens from such a terrible\nburden. Aegeus was distraught; he had finally found\nthe son he had longed for, and now the boy was about\nto be taken away again. But he finally agreed to let his\nson go because Theseus was doing it for such a noble\ncause. But Aegeus asked only one thing. He put black\nsails on Theseus’ ship as it set out for Crete, and he\nrequested that the Athenian ship’s sails should remain\nblack if Theseus died in the attempt against the\nMinotaur, but he asked Theseus to switch the sails to\nwhite if he survived. Theseus agreed, and they all sailed\nto Crete.\nWhen the Athenians arrived on Crete, there was a\npublic parade of the prisoners, and as soon as Ariadne,\nMinos’ daughter, saw Theseus, she immediately fell in\nlove with him. Now the Minotaur was a monster, half-\nman and half-bull, who lived in the labyrinth [See\nMinotaur]. Ariadne knew that Theseus would need her\nhelp to kill the Minotaur and then escape from the\nlabyrinth. So, she secretly visited Theseus in prison the\nnight before the Athenians were going to be fed to\nthe Minotaur, giving him a sword and a ball of thread.\nShe told him to tie the thread to the entrance of the\nlabyrinth, and, after he had killed the Minotaur, he THESEUS 223\ncould use the thread to find his way out again. Ariadne\nasked only one thing of Theseus: after he had killed the\nMinotaur and escaped from the labyrinth, he should\ntake her back to Athens with him to be his bride.\nTheseus agreed.\nTheseus took the ball of thread and the sword into\nthe labyrinth, unwinding the string as he went. When\nhe found the Minotaur, he cut his throat and then led\nthe Athenian youths and maidens out of the labyrinth,\nfollowing the trail of Ariadne’s thread. He then picked\nup Ariadne, who was waiting by the Athenian ship, and\nthey quickly sailed away. Minos’ fleet could not pursue\nthem because Ariadne had somehow found a way to\nbore holes into all their ships. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n224\nCLASSICAL MYTHOLOGY\nA kylix depicting Theseus dragging the Minotaur from the\nlabyrinth, located in the British Museum\nOn the way back to Athens, the group stopped on the\nisland of Dia (modern day Naxos) [map]. Theseus and\nAriadne slept together on the island that night, but\nTheseus woke up around midnight. He had already\nescaped the labyrinth, so he no longer had any use for\nAriadne, and he felt a little embarrassed at the prospect\nof marrying into a family that was a little strange in their\nsexual habits. So, while Ariadne was sleeping, Theseus\nquietly gathered the group of Athenians together and\nleft the island without her. When she awoke, she found THESEUS 225\nherself alone on a desert island. Ariadne was\ndevastated, of course, and she was sure she was going\nto die a horrible death. But it just so happened that,\nlater that same day, Dionysus was passing by in the\nmidst of his travels to promote his worship. He saw\nAriadne and was so smitten by her beauty that he\nimmediately made her his wife and she became a\ngoddess. So, everything turned out well for Ariadne (no\nthanks to Theseus). And if you travel to the island of\nNaxos today, you will see a statue of Ariadne, looking\nout to shore. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n226\nCLASSICAL MYTHOLOGY\nA modern statue of Ariadne of the island of Naxos, the island on\nwhich she was abandoned by Theseus\nTheseus, however, either because he was feeling guilty THESEUS 227\nabout his treatment of Ariadne (and thus was\npreoccupied) or just acting from sheer cockiness, forgot\nto change the sails on his ships. So when Aegeus,\nwatching for the return of his ship, saw the black sails,\nhe was overcome with grief and threw himself into the\nsea. And the part of the Mediterranean Sea that is just\noff the coast of the Athenian peninsula, the Aegean Sea,\nis still named after him. When Theseus came home to\nAthens in triumph, he found his city in mourning for the\ndeath of the king.\nTHESEUS AND HIPPOLYTE\nAt some point, Theseus helped the hero Heracles fight\nagainst the Amazons and brought back with him the\nQueen of the Amazons, Hippolyte, as his wife. The\nAmazons were unhappy to lose their queen and sent\na force to attack Athens to regain her. The two groups\nfought, and Hippolyte died in battle, but not before\nbearing Theseus a son, Hippolytus.\nTHE STORY OF HIPPOLYTUS\nMany years later, Theseus married Minos’ youngest\ndaughter, Phaedra, to smooth over relations with Crete.\nBut when he brought Phaedra back to Athens, she fell\nin love with Hippolytus, who was now about 19 or 20\nyears old (and much closer to Phaedra in age than\nTheseus was). Some say that Aphrodite had caused\nPhaedra to do this because Hippolytus was a devotee of\nthe virgin goddess Artemis. Since Artemis was a virgin,\nHippolytus had vowed to remain a virgin as well, and MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n228\nCLASSICAL MYTHOLOGY\nAphrodite took this as a personal affront. In any case,\nPhaedra was sick with love for the handsome young\nman. But despite her personal pain, she vowed never to\nbreath a word of her feelings. Nevertheless, Hippolytus\nsomehow found out. And when he found out, he was\nboth furious and disgusted. He confronted Phaedra\nand called her a lot of terrible names (as you can\nimagine). As a result, Phaedra became bitterly angry at\nHippolytus and vowed revenge. She knew she had to\ncommit suicide; she could not live with the shame of\nwanting to commit adultery with her own stepson. But\nbefore she killed herself, she wrote a note to Theseus,\nfalsely claiming that his son had raped her. Theseus\nbelieved what he read in the note despite Hippolytus’\nprotestations that he had nothing to do with his\nstepmother. But at this point, Theseus was in a rage.\nHe banished Hippolytus from Athens and called upon\nhis father, Poseidon, to kill the youth. As Hippolytus was\ndriving his chariot out of Athens along the seashore,\na terrifying bull emerged from the water. The horses\nwere so frightened that they all reared up and ran in\ndifferent directions. Hippolytus got tangled in the reins\nof his chariot and was eventually pulled apart by his\nhorses. After this had happened, Artemis told Theseus\nthe truth.\nTHE DEATH OF THESEUS\nTheseus now had to live with the terrible truth that he\nhad killed his own son, and for no good reason. He\ncontinued on as king of Athens, but life was never the\nsame. He became moody and sullen, and he neglected THESEUS 229\nhis duties as king. The Athenians asked him to leave,\nand Theseus agreed. He decided to go to the island\nof Scyrus, Aegeus’ homeland, and Lycomedes, the king\nof Scyrus, agreed to give Theseus some land that had\nonce belonged to Aegeus. But deep down, Lycomedes\nfelt threatened by the presence of such a great hero.\nAs Theseus was walking with Lycomedes along the cliffs\nat the edge of the island, somehow Theseus tripped (or\ndid Lycomedes push him?) and he fell to his death. The Three Types of Myths:\nAetiological, Historical, and\nPsychological\nThere are actually many different types of myth, not\njust three. In fact, there are several entire theories of\nmyth. The theoretical study of myth is very complex;\nmany books have been written about theories of myth,\nand we could have an entire class just on theories of\nmyth (without studying any of the myths themselves).\nThe problem with theories of myth, however, is that\nthey are not very good; they don’t do a great job of\nexplaining the myths or helping us understand them.\nFurthermore, the myths themselves are much more\ninteresting than the theories. For these reasons, this\ntextbook will not say very much about the theories of\nmyth. But we don’t want to ignore the theoretical study\nof myth entirely, so we will limit ourselves to discussing\nonly three types of myth.\n230 THE THREE TYPES OF MYTHS: AETIOLOGICAL,\n231\nHISTORICAL, AND PSYCHOLOGICAL\n1. AETIOLOGICAL MYTHS\nAetiological (sometimes spelled etiological) myths\nexplain the reason why something is the way it is today.\nThe word aetiological is from the Greek word aetion\n(αἴτιον), meaning “reason” or “explanation”. Please note\nthat the reasons given in an aetiological myth are NOT\nthe real (or scientific) reasons. They are explanations\nthat have meaning for us as human beings. There are\nthree subtypes of aetiological myths: natural,\netymological, and religious.\nA natural aetiological myth explains an aspect of\nnature. For example, you could explain lightning and\nthunder by saying that Zeus is angry.\nAn etymological aetiological myth explains the\norigin of a word. (Etymology is the study of word\norigins.) For example, you could explain the name of\nthe goddess Aphrodite by saying that she was born in\nsea foam, since aphros is the Greek word for sea foam.\nA religious aetiological myth explains the origin of\na religious ritual. For example, you could explain the\nGreek religious ritual of the Eleusinian Mysteries by\nsaying that they originated when the Greek goddess\nDemeter came down to the city of Eleusis and taught\nthe people how to worship her.\nAll three of these explanations are not true: Zeus’\nanger is not the correct explanation for lightning and\nthunder, Aphrodite’s name was not actually derived\nfrom the Greek word aphros, and Demeter did not\nestablish her own religious rituals in the town of\nEleusis. Rather, all of these explanations had meaning MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n232\nCLASSICAL MYTHOLOGY\nfor the ancient Greeks, who told them in order to help\nthemselves understand their world.\n2. HISTORICAL MYTHS\nHistorical myths are told about a historical event, and\nthey help keep the memory of that event alive.\nIronically, in historical myths, the accuracy is lost but\nmeaning is gained. The myths about the Trojan War,\nincluding the Iliad and the Odyssey, could be classified\nas historical myths. The Trojan War did occur, but the\nfamous characters that we know from the Iliad and the\nOdyssey (Agamemnon, Achilles, Hector, etc.) probably\ndid not exist.\n3. PSYCHOLOGICAL MYTHS\nPsychological myths try to explain why we feel and act\nthe way we do. A psychological myth is different from\nan aetiological myth because a psychological myth does\nnot try to explain one thing by way of something else\n(like explaining lightning and thunder with Zeus’ anger\ndoes). In a psychological myth, the emotion itself is\nseen as a divine force, coming from the outside, that\ncan directly influence a person’s emotions. For\nexample, the goddess Aphrodite is sometimes seen as\nthe power of erotic love. When someone said or did\nsomething that they did not want to do, the ancient\nGreeks might have said that Aphrodite “made them” do\nit. The Twelve Labors of\nHeracles\nAs a punishment for the murder of his own children\n[see Heracles], Heracles was told by the Pythia that he\nhad to perform twelve tasks for Eurystheus, the king\nof Tiryns. Eurystheus was also king of Mycenae [see\nArgos on map]. Eurystheus had inherited the throne of\nMycenae from his father, Sthenelos, who had usurped\nit from Amphitryon, Heracles’ mortal father [see\nHeracles], so Heracles should really have been king of\nMycenae instead of Eurystheus. Heracles had to\nperform any twelve tasks that Eurystheus set for him\neven though Eurystheus had usurped Heracles’ throne\nand was neither as strong or as brave as Heracles was.\nThis subordinate relationship to Eurystheus was\nhumiliating for Heracles, and that was no doubt part of\nthe punishment. The first six of Heracles’ labors take\nplace in the Peloponnese. The last six labors take place\nthroughout the Greek world.\n233 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n234\nCLASSICAL MYTHOLOGY\n1. THE NEMEAN LION\nEurystheus first told Heracles to kill the lion that had\nbeen terrorizing the area of Nemea. This lion was no\nordinary lion; it was the offspring of Typhoeus [for\nmore on Typhoeus, see Origins]. Heracles tracked the\nNemean Lion to its cave, blocked off the entrance, and\ntried to kill the lion by shooting it with his bow and\narrows. But the arrows bounced right off the lion’s hide,\ndoing the animal no harm. Undeterred, Heracles used\nbrute force to strangle the beast and brought the lion\nback to Tiryns for Eurystheus. Eurystheus, surprised\nthat Heracles had survived the adventure, became very\nfearful of Heracles. Because Eurystheus did not want\nthe lion, Heracles skinned it and used the hide as a\ncloak, with the lion’s head serving as a sort of helmet.\nThe lion’s skin became Heracles’ trademark, and he\nwore it on all his future endeavors. THE TWELVE LABORS OF HERACLES 235\nHeracles killing the Nemean Lion while Athena stands near on a\nlekythos found in the British Museum\n2. THE LERNEAN HYDRA\nNext, Eurystheus sent Heracles to kill the Hydra. The\nHydra was a sea monster (its name comes from hydōr\n[ὕδωρ], which means “water” in Greek), that had many\nsnake-like heads. The Hydra lived in a swampy area\nnear Lerna, and Heracles came to its den. He engaged\nthe Hydra by grabbing at one of the heads and hacking\nat it with his sword until the head was severed from the\nbody. But as soon as Heracles had cut off the Hydra’s\nhead, two more heads grew in its place. At this point,\nHeracles realized that simply cutting off the Hydra’s\nheads was not going to work. He also realized that\nhe could not kill the Hydra alone, so he called Iolaüs, MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n236\nCLASSICAL MYTHOLOGY\nhis charioteer, to bring a burning brand so he could\ncauterize the neck to prevent new heads from growing\nback after Heracles cut off each head. Heracles and\nIolaüs managed to destroy each head and burn the\nneck for all the Hydra’s heads until just one head, which\nwas immortal, survived. This head he buried beneath a\ngiant rock. The Hydra’s blood was a deadly poison, so\nHeracles dipped his arrows in the blood to make sure\nthat anyone he hit would die of his wound. Heracles\nwould one day regret that the Hydra’s blood was so\ndeadly. THE TWELVE LABORS OF HERACLES 237\nHeracles fighting the Lernaean Hydra on a lekythos found in the\nLouvre\n3. CERYNITIAN HIND\nEurystheus then sent Heracles to capture the Cerynitian\nHind, a deer with golden horns that was sacred to the\ngoddess Artemis. Because the deer was sacred to\nArtemis, Heracles could not kill it; he had to capture MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n238\nCLASSICAL MYTHOLOGY\nit alive. For a year he tracked the deer, which was the\nfastest deer in the world, around the forests of the\nPeloponnese. He finally captured it in Arcadia when it\nhad paused for a little rest by creeping up behind it\nand surprising it. On his way back to Tiryns, Heracles\nencountered Apollo and Artemis hunting. Artemis was\nnot happy to find her sacred deer so constrained, but\nafter he explained his task, Artemis allowed Heracles\nto take the deer so long as it remained unharmed and\nwould be released after he was finished with it.\n4. ERYMANTHIAN BOAR\nAfter the Cerynitian Hind had been released, Heracles\nhad to capture the Erymanthian Boar, which was\nravaging the countryside around Mount Erymanthus\nand doing a lot of damage to the crops. On his way\nto find the Erymanthian Boar, Heracles met Pholus, a\ncentaur who, unlike his fellow centaurs, was quite well\nmannered. Pholus hosted Heracles like a proper guest\nand offered him some wine. This wine was noticed by\nthe other centaurs, however, who are notorious for\nloving wine but also for being unable to hold their\nliquor. When the centaurs smelled the wine, they went\ncrazy and started attacking Heracles and Pholus in\norder to steal it. The two successfully drove the\ncentaurs away, but in the process, Pholus dropped one\nof Heracles’ arrows on his foot and, unfortunately, the\nHydra’s poison caused him to die in agony. This is yet\nanother example of Heracles hurting anyone who gets\ntoo close to him. In this case it was an accident, but it\nwas no less deadly for Pholus. After this unfortunate THE TWELVE LABORS OF HERACLES 239\nincident, Heracles caught up with the Erymanthian Boar\nand trapped it by driving it into deep snow. He brought\nthe boar back alive to Tiryns to show to Eurystheus. But\nEurystheus was so frightened of the enormous beast\nthat he hid in a large storage jar (called a pithos) and\nonly peeked out a little so he could verify that Heracles\nhad completed his task. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n240\nCLASSICAL MYTHOLOGY\nHeracles bringing the Erymanthean Boar to Eurystheus on an\namphora in the Louvre\nAt this point, word had spread throughout Greece that THE TWELVE LABORS OF HERACLES 241\nJason was looking for the greatest Greek heroes to go\nwith him on an expedition for the Golden Fleece.\nHeracles took a break from his labors to join the crew.\nHowever, he did not make the entire journey to Colchis\n[map] (if he had would there be any use for Jason?).\nThe Argonauts left Heracles behind in Mysia while he\nsearched for his lover Hylas [see Argonauts]. Unable\nto find Hylas, Heracles returned to Tiryns for his next\nlabor.\n5. AUGEIAN STABLES\nThe next task Eurystheus had for Heracles was to clean\nthe Augeian stables in one day. Augeias was king of Elis\n[map], and he had massive stables that had never been\ncleaned, so they were filled with many years’ worth of\nhorse dung. Heracles came to Augeias and told him\nthat he could clean out the stables in one day if he paid\nthe right sum: one tenth of his cattle. Augeias agreed,\nand Heracles set to work. He diverted the courses of\ntwo rivers so they flowed right through the stables and\nwashed away the years of filth. Augeias had not\nbelieved Heracles could perform the task, so he refused\nto pay the outrageous sum. Heracles was livid, but at\nthis point there was nothing he could do, so he went\nback to Tiryns.\n6. STYMPHALIAN BIRDS\nNext Heracles was sent to clear away the Stymphalian\nbirds. Lake Stymphalus was overrun by a flock of man-\neating birds. Heracles decided that a loud noise would MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n242\nCLASSICAL MYTHOLOGY\nbe just the thing, so he crashed a few shields together\nto scare the birds into taking flight. As the birds flew\ninto the air, he picked them off one by one with his\narrows.\nHeracles killing the Stymphalian Birds in a mosaic from Valencia\nhoused in the National Archaeological Museum in Madrid THE TWELVE LABORS OF HERACLES 243\n7. THE CRETAN BULL\nHeracles was then sent to capture the Cretan bull. This\nbull was the father of the Minotaur [see Minotaur], and\nHeracles trapped it and brought it back to Tiryns alive.\nEurystheus did not want it, so Heracles let the bull go.\nThe bull wandered up to the area around Athens [see\nAthenae on map], and Theseus later killed him as one\nof his heroic feats [see Theseus].\n8. THE MARE OF DIOMEDES\nThe eighth labor required Heracles to retrieve the\nmares of Diomedes. Diomedes was a Thracian [map]\nking and he had man-eating mares. Heracles, with the\nhelp of his lover Abderus, stole the mares from their\nstable and herded them down to the seashore.\nDiomedes’ men were in hot pursuit, so he left Abderus\nto take care of the mares while he dispatched with\nDiomedes and routed his men. When Heracles came\nback, however, he found that the mares had eaten\nmost of Abderus. Heracles was upset at the death of\nhis lover, and he carefully buried Abderus’ remains. He\nthen gathered the mares into his ship and took them\nback to Eurystheus. Again, Eurystheus did not want the\nterrible creatures in his city, so Heracles let the mares\nloose. They were eventually eaten by wild animals as\nthey wandered on Mount Olympus [see Olympus Mons\non map]. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n244\nCLASSICAL MYTHOLOGY\n9. HIPPOLYTE’S BELT\nFor his next labor, Heracles had to retrieve the belt\nof the Amazon queen, Hippolyte. Hippolyte and the\nAmazons (female warriors) lived in Themiscyra on the\nsouthern coast of the Black Sea. Heracles was joined\non this expedition by his friend Theseus, and they set\noff together. When they reached Themiscyra, Hippolyte\ncame aboard their ship to meet with them. She agreed\nto give them her belt with no fight, and everything\nseemed to be going swimmingly for Heracles and\nTheseus. However, Hera was not about to allow this\nlabor to be easy, so she came down from Olympus,\ndisguised as an Amazon. Hera told the Amazons that\nHeracles was kidnapping their queen, and she roused\nthem to fight the heroes. Being angry because he\nbelieved the whole thing had been a set-up, Heracles\nkilled Hippolyte and left with Theseus, taking\nHippolyte’s sister, Antiope, and the belt. Other versions\nsay that Hippolyte was not killed at all, but that she was\nthe one whom Theseus took with him to Athens, where\nshe became the mother of Theseus’ son Hippolytus\n[see Theseus].\n10. THE CATTLE OF GERYON\nNext, Heracles was sent to steal the cattle of Geryon,\nwho was the King of Erytheia (which is modern-day\nCadiz in Spain). Geryon had three heads and three\nupper bodies as well as six arms and six legs.\nFurthermore, his cattle were guarded by a two-headed\nwatch dog named Orthus. Heracles decided to go THE TWELVE LABORS OF HERACLES 245\nthrough Africa to make his way to Spain, and as he\ncrossed the Strait of Gibraltar, he set up large rocks on\neither side, called the Pillars of Heracles, to show how\nfar he had come across the world. The sun beat down\nupon him, greatly annoying Heracles, so he drew his\nbow and pointed it at the sun, chastising it. Helius, the\nsun god, was amused by this little stunt, so he lent his\ngolden cup to Heracles to use as a boat to take him the\nrest of his way to Erytheia. When he arrived, Heracles\ndispatched of Geryon and Orthus.\nHeracles battling Geryon on a kylix in Staatliche\nAntikensammlungen in Munich\n11. THE GOLDEN APPLES OF THE HESPERIDES\nNearly done with his labors, Heracles now went to\nretrieve the apples of the Hesperides. The Hesperides\nwere nymphs who lived in Libya near the mountains\nwhere Atlas held up the world (now called the Atlas\nMountains) and tended a garden growing golden MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n246\nCLASSICAL MYTHOLOGY\napples. On his way there, Heracles passed by the\nCaucasus Mountains and shot the eagle that had long\ntortured Prometheus [see Prometheus], freeing him\nfrom his bonds. Grateful for his help, Prometheus gave\nHeracles some advice as to how to retrieve the apples.\nPrometheus told Heracles to ask Atlas (who happened\nto be Prometheus’ own brother) to go get the apples.\nHeracles heeded his advice and asked Atlas to get the\napples while he held up the world. Atlas was happy to\nretrieve the apples, but he had no intention of returning\nto his post. When he returned with the apples, Atlas\noffered to take them to Eurystheus for Heracles,\nintending to never return. But Heracles knew what Atlas\nwas planning. He made a show of agreeing to Atlas’\nplan, but he asked the Titan to hold the world just for\na minute so he could place a pad on his shoulders to\nmake the task more bearable. Atlas took the world onto\nhis shoulders again, and Heracles picked up the apples\nand went back to Tiryns. After he had shown them to\nEurystheus, he gave them to Athena, and she, in turn,\nreturned them to the Hesperides.\n12. CERBERUS\nHeracles’ final labor was to bring Cerberus back from\nHades; of course, he could not kill the three-headed\ndog in the process. Heracles began this labor by being\ninitiated into the Eleusinian Mysteries. Then Hermes led\nhim down into the Underworld. In Hades, Heracles saw\nhis friends, Theseus and Peirithoüs, stuck to chairs [see\nTheseus], and they begged Heracles to set them free.\nHeracles managed to pry Theseus loose and began to THE TWELVE LABORS OF HERACLES 247\nmove on to Peirithoüs, but the earth began to shake,\nand Heracles desisted. Heracles and Theseus were\nallowed to leave, but Hades insisted that Peirithoüs\nremain. When Heracles came to Hades’ palace, he\nasked the ruler of the Underworld if he could take\nCerberus with him. Hades agreed as long as Heracles\ndid not use weapons to capture him. Heracles grabbed\nthe hell-hound and dragged him all the way to Tiryns.\nEurystheus hid as soon as he saw Cerberus, and, from\nhis hiding place, ordered that he be taken back to\nHades, and Heracles obliged. With all the labors\ncompleted, Heracles was now free to go about his life\nas he wished. He was also promised that he would\nbecome immortal upon his death.\nHeracles approaching Cerberus on an amphora in the Louvre What is a Myth?\nToday people often use the word “myth” to mean an\nuntrue story or false rumor. For example, if one person\nasked, “Is Friday the 13th an unlucky day?” another\nperson might answer, “No, that is just a myth.” But the\nancient Greeks did not use the word mythos (μῦθος) in\nthis way. For the Greeks, a mythos was simply a story.\nIt was not important whether the story was true or\nfalse; what was important was the fact that the mode\nof speech was that of a story. The Greek word logos\n(λόγος), on the other hand, means a rational\nexplanation or analytical statement. These two words,\nmythos and logos, point to two different kinds of speech,\ncorresponding to two different ways of thinking. One\nwas not considered more important than the other;\nthey were just different. If you put the two words\ntogether: mythos + logos = mythology. And “mythology”\nis the explanation or the analytical study of myths.\n248 Why Are There So Many\nVersions of Greek Myths?\nThe sources we have that tell the stories of the gods\nand heroes come from many different authors from\ndifferent parts of the Mediterranean world and\ndifferent points in time, spanning several centuries.\nCultures and their beliefs change over the course of a\nfew decades, let alone centuries, so their stories adapt\ntoo. But with these myths, even within the confines of\nancient Greek culture, each author had some artistic\nfreedom to reinvent the story and make it more\napplicable or interesting to his audience. In this way,\nmyths function similarly to the stories of comic book\nheroes, like Batman. Every author who tackles the story\nof Batman’s origin has to bring something new to it or\nit gets boring. There are some important elements that\nhave to stay the same (like Bruce Wayne’s parents being\nkilled when he is young as they leave the opera), but\nother elements can change (as in the 1989 Tim Burton\nfilm, which makes Jack Nicholson’s Joker the man who\nkilled Bruce’s parents). In the same way, the different\nauthors who wrote versions of the Greek myths took\nliberties with various aspects of the myths, even though\n249 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n250\nCLASSICAL MYTHOLOGY\n(for the most part) the main outlines of the stories\nremained the same. Thus, even though the Greek\nmyths were in a very real sense sacred stories, in this\nrespect they were more like modern literature, films,\nor the stories of comic book heroes than the Judeo-\nChristian Bible. Xenia\nXenia (pronounced “zenee-a” and written as ξενία in\nGreek) is guest-friendship, the relationship between a\nguest and host. Because there were no hotels in ancient\nGreece, travelers had to rely on the generosity of the\npeople who lived in the area through which they were\ntraveling. A traveler could knock on any door and he\nwould immediately be invited in, at least in theory.\nXenia is protected by Zeus and has specific rules of\nconduct. The host should accept any traveler who\ncomes by and offer him a bath and a meal without\nasking for the person’s name. After the guest has eaten,\nthe host may ask the traveler’s name and place of\norigin. The guest has a responsibility to treat his host’s\nhouse and possessions with respect as well as to\nprovide his name and background when asked. When\nthe guest is taking his leave of his host, the two will\nexchange gifts as tokens of their newfound friendship.\nOnce a xenia relationship has been established\nbetween two families, it can last for generations,\nproviding both families with a place to sleep on future\njourneys.\n251 Zeus\nRoman name: Jupiter or Jove\nEpithets: Kronion (Son of Cronus), Father of Gods and\nMen\nSymbols: throne, scepter, thunderbolt, aegis, eagle,\nbull\nFunctions: ruler of the gods and god of the sky and\nweather\n252 ZEUS 253\nZeus with his thunderbolt on a kylix in the National\nArchaeological Museum of Spain in Madrid\nTHE BIRTH OF ZEUS\nZeus was the youngest son of Cronus and Rhea. He\nrescued his siblings from their father, led a revolt\nagainst Cronus, and took his position as ruler of the\ncosmos [see Origins]. Like his grandfather and father\nbefore him, Zeus faced challenges to his rule, but he\nsucceeded where they failed and managed to thwart\nhis would be usurpers. After Zeus won the Battle of the\nGods and the Titans, Gaia sent the monster Typhoeus\nagainst him [see Origins]. Later a race of giants revolted\nagainst Zeus, but Zeus defeated them with the help of\nhis mortal son, Heracles. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n254\nCLASSICAL MYTHOLOGY\nZeus fighting Typhoeus on a hydria in the Staatliche\nAntikensammlungen in Munich\nZEUS’ MARRIAGE TO METIS\nAs ruler of the universe, Zeus needed a wife, and he\nchose Metis, who had helped him rescue his siblings\n[see Origins]. Metis was the daughter of the Titans\nOceanus and Tethys. Her name means “intelligence”\nor “cunning,” and she is the personification of those\nqualities. When Metis was pregnant with Athena, Zeus\nlearned that Metis was fated to give birth to a son who\nwould one day overthrow his father. This would have\nperpetuated the cycle of rulers of the universe being\noverthrown by their sons, and Zeus wanted to end the\ncycle once and for all. Since swallowing his children\ndid not work out well for Cronus, Zeus’ father, Zeus\ndecided to swallow his wife instead. So, Zeus swallowed\nMetis while she was pregnant, leading to Athena’s very ZEUS 255\nunusual birth [see Athena]. Metis lived on within Zeus,\nproviding him with advice and helping him to become\nknown for his wisdom and thoughtful arbitration (for an\nexample, see Iliad 24.64-76).\nZEUS’ OTHER MARRIAGES AND LIAISONS:\nTHEMIS, DEMETER, LETO, AND HERA\nAfter this marriage ended, Zeus had relationships with\nseveral goddesses: Themis (Natural Order), who bore\nthe Horae (the Seasons) and the Moerae (the Fates);\nEurynome, who gave birth to the Graces; Demeter, who\nbore Persephone; Mnemosyne (Memory), who\nconceived the Muses; Dione, who delivered Aphrodite\n[see Aphrodite]; and Leto, who begat Apollo and\nArtemis. (Zeus, by the way, never has a sexual\nencounter in vain; children are always produced.) At\nsome point Zeus married his sister, Hera, and together\nthey had three children: Ares, Eileithyia, and Hebe.\nZEUS’ RELATIONSHIPS WITH MORTAL WOMEN\nZeus pursued mortal women even more frequently\nthan he pursued goddesses. He sired the god Dionysus\nwith the mortal woman Semele [see Dionysus]. He\ncame to Alcmene in the form of her husband,\nAmphitryon [see Heracles], fathering Heracles. He\nturned Io into a cow to avoid Hera’s wrath [see Hermes\nor Hera]. Io later traveled to Egypt and bore Epaphus,\nwho became an Egyptian god. Zeus abducted Europa in\nthe form of a bull and took her to Crete, where she bore\nhim three sons: Minos, Rhadamanthys, and Sarpedon. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n256\nCLASSICAL MYTHOLOGY\nHe came to Danaë as a shower of gold, causing her\nto become pregnant with Perseus. He came to Leda as\na swan, and she later laid two eggs with two sets of\ntwins. Two, Helen and Polydeuces (Pollux in Latin), were\nimmortal children of Zeus; the other two, Clytemnestra\nand Castor, were the children of her husband,\nTyndareüs, and were mortal.\nHera was notoriously jealous of her husband’s affairs,\nthough this did not stop him from pursuing\nrelationships with both goddesses and mortals.\nThe Flight of Europa by Paul Manship from 1925, copies are in\nthe Indianapolis Museum of Art, the Los Angeles County Museum\nof Art, the Columbus Museum in Columbus, Georgia, and the\nSmithsonian American Art Museum in Washington, D.C. ZEUS 257\nGANYMEDE\nZeus abducting Ganymede found in the Archaeological Museum\nin Olympia\nZeus was also attracted to young boys. Ganymede, a MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n258\nCLASSICAL MYTHOLOGY\nyoung and beautiful Trojan prince, was abducted by\nZeus and taken up to Olympus to be his personal\ncupbearer (and probably his lover as well). In the\nAeneid, Virgil (also spelled Vergil) cites Ganymede’s\npresence on Olympus as one of the reasons why Juno\nwas so angry at the Trojans and constantly harassed\nAeneas despite Jupiter’s commands to cease. ZEUS 259 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n260\nCLASSICAL MYTHOLOGY\nThe Abduction of Ganymede by Correggio in the\nKunsthistorisches Museum in Vienna\nTHE JUSTICE OF ZEUS\nBecause Zeus was the ruler of the gods, the gods often\ntook their quarrels to Zeus for arbitration. He also\nmeted out punishments to immortals and mortals alike\nwho angered him. When the Titan Prometheus stole\nfire to give to mortals, Zeus had him chained to a\nmountain where every day, an eagle would come and\neat out the Titan’s liver only for it to grow back every\nnight and for the process to start again [see\nPrometheus]. The Lydian king, Tantalus, was a son of\nZeus who was favored by the gods, but he wanted to\ntest their knowledge and power. He invited the gods\nto a dinner party and served them a dish made from\nhis own son, Pelops. The gods knew immediately that\nthe meat they were served was human flesh (except\nfor Demeter, who was grieving for her daughter,\nPersephone, and had eaten a bit of Pelops’ shoulder).\nThe gods grew very angry at Tantalus’ sacrilege. They\nput Pelops together again (giving him an ivory shoulder\nto replace the one that had been eaten), and Tantalus\nwas punished in the Underworld by having to stand\nup to his chin in a lake that would recede any time\nhe moved to take a drink. What’s more, there was a\ntree overhead with delicious, ripe fruit that would move\naway from him when he tried to reach up and grab one.\n(This myth is the origin of the word tantalize.) ZEUS 261\nZEUS’ POSSIBLE ORIGINS\nZeus was the sky god of the Mycenaean (Greek-\nspeaking) peoples who migrated to the Greek peninsula\nsometime around 2000 BC. As the sky god, he was in\ncharge of the weather, and he was known to cause\nthunderstorms by hurling his thunderbolt (lightning\nbolt).\nZeus may have been conflated with a pre-Greek\nMinoan fertility god on the island of Crete. This was the\nchild and/or young male consort of a female fertility\ngoddess. This would help to explain the story of Zeus\nbeing brought to Crete as a baby and living on Crete\nfor a year in a cave [see Origins]. The Minoans seem to\nhave sometimes worshipped this god in the form of a\nbull, and that might explain why Zeus sometimes takes\nthat form. The details of the story of the rape of Europa\nprobably came about to solidify Zeus’ connection to this\ngod and to the island of Crete as well as to establish the\nmythological ruling family of the island (the Minoans\nwere said to have descended from King Minos, one of\nthe sons of Zeus and Europa). Zeus was easily adapted\nto the ill-defined Roman god Jupiter (whose name\nmeans “sky father”), as Jupiter did not have a strong\npersonality of his own. MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n262\nCLASSICAL MYTHOLOGY\nZeus or Poseidon (we cannot tell which without the missing\nobject in the figure’s right hand) in the National Archaeological\nMuseum in Athens\nZEUS IN THE TROJAN WAR\nAlthough Troy was one of Zeus’ favorite cities (as he\nexplains to Hera at Iliad 4.44-49), he seems to have\nbeen neutral in the Trojan War. In Book 16 of the Iliad,\nfor example, Zeus first favors Patroclus, as he kills many\nTrojans and their allies (including Sarpedon, another\none of his sons by Europa), but then makes sure that\nPatroclus is, in turn, killed by Hector. Despite his love ZEUS 263\nfor Troy, however, Zeus knew that as long as the\nTrojans made certain decisions, Troy would eventually\nfall (this is clear, for example, at Iliad 4.68-72). (To the\nGreeks, fate was partially determined by choice, as can\nbe seen in Achilles’ choice in the Iliad.) At one point\n(Iliad 8.1-18), Zeus even ordered a cessation of divine\ninvolvement in the conflict, but this was only a\ntemporary pause.  Image Attributions\nAegis\nImage 1: “Athena owl Met 09.221.43” by Marie Lan\nNguyen is licensed under CC BY 2.5\nAgamemnon\nImage 1: “The Sacrifice of Iphigenia” by Web Gallery\nof Art is licensed under Public Domain\nImage 2: “Fourth Style fresco depicting the Sacrifice\nof Iphigenia, from the House of the Tragic Poet in\nPompeii, Naples National Archaeological Museum\n(17430222481)” by Carole Raddato is licensed under CC\nBY-SA 2.0\nAphrodite\nImage 1: “Casa della Venere in Conchiglia Pompeii\n23” by MatthiasKabel is licensed under CC BY-SA 3.0\nImage 2: “Ludovisi_Aphrodite2_Shapiro” by Susan O.\nShapiro is licensed under CC BY 4.0\nApollo\nImage 1: “Apollo of the Belvedere Front view” by\nLivioandronico2013 is licensed under CC BY-SA 4.0\n265 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n266\nCLASSICAL MYTHOLOGY\nImage 2: “Apollo & Daphne Bernini Shapiro1” by\nSusan O. Shapiro is licensed under CC BY 4.0\nImage 3: “Apollo & Daphne Shapiro5” by Susan O.\nShapiro is licensed under CC BY 4.0\nImage 4: “Apollo black bird AM Delphi 8140” by\nFinalgo is licensed under CC-BY-SA 2.0 DE\nAres\nImage 1: “Ludovisi_Ares1_Shapiro” by Susan O.\nShapiro is licensed under CC BY 4.0\nImage 2: “Diego Velázquez – Mars, God of War –\nWGA24429” by Susan O. Shapiro is licensed under CC\nBY 4.0\nThe Argonauts\nImage 1: “The Harpyes annoy the king Phineus” by\nEgisto Sani is licensed under CC BY-NC-SA 2.0\nArtemis\nImage 1: “Abraham Bloemaert – Apollo and Diana\nPunishing Niobe by Killing her Children – Google Art\nProject” by Google Cultural Institute is licensed under\nPublic Domain\nImage 2: “Actaeon” by Aavindraa is licensed under\nPublic Domain\nImage 3: “Titian – Diana and Actaeon – WGA22883”\nby Google Cultural Institute is licensed under Public\nDomain\nImage 4: “Gorgon Kameiros BM GR1860.4-4.2 n2” by\nEaldgyth is licensed under CC BY-SA 3.0\nImage 5: “Potnia Theron c. 650 BC; Mykonos IMAGE ATTRIBUTIONS 267\nMuseum; Shapiro photo” by Susan O. Shapiro is\nlicensed under CC BY 4.0\nAthena\nImage 1: “Athena’s Birth: the earliest picture” by\nEgisto Sani is licensed under CC BY-NC-SA 2.0\nImage 2: “Athena Parthenos The Parthenon\nNashville” by Aaron Archuleta is licensed under CC-BY-\nSA 3.0\nImage 3: “Parthenon” by Onkel Tuca! is licensed\nunder CC-BY-SA 3.0\nImage 4: “parthenon nashville west pediment centre”\nby damian entwistle is licensed under CC BY-NC 2.0\nImage 5: “ACMA Athéna contemplative” by Marsyas is\nlicensed under CC BY-SA 2.5\nImage 6: “Athena in Naples Museum Shapiro” by\nSusan O. Shapiro is licensed under CC BY 4.0\nImage 7: “001MA Athena” by Ricardo Andre Frantz is\nlicensed under CC BY-SA 3.0\nThe Delphic Oracle\nImage 1: “Delphi, The Sacred Way – IX – The\nAthenians’ Stoa” by Egisto Sani is licensed under CC BY-\nNC 2.0\nImage 2: “The Temple of Apollo at Delphi” by Luarvick\nis licensed under CC BY-NC 2.0\nImage 3: “Delphi” by Albert Tournaire is licensed\nunder Public Domain\nImage 4: “Themis Aigeus Antikensammlung Berlin\nF2538 n2“ by Bibi Saint-Pol is licensed under Public\nDomain MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n268\nCLASSICAL MYTHOLOGY\nImage 5: “Camillo Miola – The Oracle [1880]” by\nGandalf’s Gallery is licensed under CC BY-NC-SA 2.0\nImage 6: “Omphalos, AM Delphi, 0004” by Zde is\nlicensed under CC BY-SA 4.0\nImage 7: “Antiochos Hierax Tetradrachm 680534” by\nClassical Numismatic Group, Inc is licensed under CC\n1.0 Universal\nDemeter\nImage 1: “Bernini Persephone Shapiro5” by Susan O.\nShapiro is licensed under CC BY 4.0\nImage 2: “Rape of Prosepina September 2015-2b” by\nAlvesgaspar is licensed under CC BY-SA 4.0\nImage 3: “Eleusis2” by Napoleon Vier is licensed\nunder CC BY-SA 3.0\nDionysus\nImage 1: “Kylix Dionysus on a ship between dolphins\n530 BC, Staatliche Antikensammlungen Munich\n120638x” by Zde is licensed under CC BY-SA 3.0\nImage 2: “Dancing Maenad Met 35.11.3” by Marie-\nLan Nguyen is licensed under CC BY 2.5\nImage 3: “Mainade satyros Staatliche\nAntikensammlungen 2654” by Bibi Saint-Pol is licensed\nunder CC 0.0 Universal\nImage 4: “Death Pentheus Louvre G445” by Jastrow is\nlicensed under CC BY 2.5\nImage 5: “Titian Bacchus and Ariadne” by National\nGallery is licensed under Public Domain\nImage 6: “‘Sparagmos’ By The Achilles Painter – XXII”\nby Egisto Sani is licensed under CC BY-NC-SA 2.0 IMAGE ATTRIBUTIONS 269\nHades\nImage 1: “Greeks in Italy – IX: The Amazing\n‘Underworld Painter’” by Egisto Sani is licensed under\nCC BY-NC-SA 2.0\nImage 2: “Persephone Hades BM Vase E82” by Marie-\nLan Nguyen is licensed under CC BY 2.5\nImage 3: “Pluto Serapis and Persephone Isis\nHeraklion museum” by Jebulon is licensed under CC0\n1.0\nHephaestus\nImage 1: “Venus und Mars werden im Netz\nüberrascht” by McZusatz is licensed under PD-US\nHera\nImage 1: “Hera Prometheus Cdm Paris 542” by Bibi\nSaint-Pol is licensed under CC0 1.0\nImage 2: “IMG_3332M Pierre Paul Rubens.\n1577-1640. Junon et Argus. 1610. Juno and Argus.\nCologne Wallraf Richards Museum” by jean louis\nmazieres is licensed under CC BY-NC-SA 2.0\nHeracles\nImage 1: “Herakles strangling snakes Louvre G192”\nby Marie-Lan Nguyen is licensed under CC0 1.0\nImage 2: “The Infant Hercules Strangling Serpents in\nhis Cradle – Joshua Reynolds (1788)” by Shuishouyue is\nlicensed under Public Domain\nImage 3: “Herakles and Linos” by Egisto Sani is\nlicensed under CC BY-NC-SA 2.0\nImage 4: “Herakles Nessos Louvre K537” by Jastrow is\nlicensed under CC0 1.0 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n270\nCLASSICAL MYTHOLOGY\nHermes\nImage 1: “Hermes kriophoros Louvre F159” by Marie-\nLan Nguyen is licensed under CC0 1.0\nImage 2: “Mousai Helikon Staatliche\nAntikensammlungen Schoen80 n1” by Bibi Saint-Pol is\nlicensed under CC0 1.0\nImage 3: “Caduceus” by Eliot Lash is licensed under\nCC0 1.0\nImage 4: “Peter Paul Rubens 080” by The Yorck\nProject is licensed under GNU Free Documentation\nLicense\nImage 5: “Peter Paul Rubens – Mercury and Argos,\n1636-1638” by Shuishouyue is licensed under Public\nDomain\nImage 6: “Hermes ithyphallicus Herm 520 BC, NAMA\n3728 102563” by Zde is licensed under CC BY-SA 3.0\nThe Iliad – An Introduction\nImage 1: “Júpiter y Tetis, por Dominique Ingres” by\nAlonso de Mendoza is licensed under Public Domain\nImage 2: “Peter Paul Rubens 115” by Crisco 1492 is\nlicensed under Public Domain\nImage 3: “Discovery of Achilles on Skyros by Nicholas\nPoussin ca. 1656 cropped” by Shonagon is licensed\nunder Public Domain\nImage 4: “Ajax and Achilles at Draughts” by Bradley\nWeber is licensed under CC BY 2.0\nImage 5: “Euphronius Krater Shapiro2” by Susan\nShapiro is licensed under CC BY 4.0\nImage 6: “Mykonos Vase Shapiro5” by Susan O.\nShapiro is licensed under CC BY 4.0 IMAGE ATTRIBUTIONS 271\nImage 7: “Aias Kassandra Louvre G458” by Bibi Saint-\nPol is licensed under CC0 1.0\nThe Minotaur\nImage 1: “Theseus Slaying Minotaur by Barye” by\nChhe is licensed under Public Domain\nThe Odyssey – An Introduction\nImage 1: “Odysseus and Polyphemus, Proto-Attic\nneck amphora, ca 650 BC, AM Eleusis, 081141” by Zde is\nlicensed under CC BY-SA 4.0\nImage 2: “Greek – One of Odysseus’ Men\nTransformed Into a Pig – Walters 541483 – Profile” by\nWalters Art Museum is licensed under CC BY-SA 3.0\nImage 3: “Odysseus under ram, archaic small bronze,\nAM Delphi,060080” by Zde is licensed under CC BY-SA\n4.0\nImage 4: “AN7497001” by Trustees of the British\nMuseum is licensed under CC BY-NC-SA 4.0\nImage 5: “The Sirens” by N. C. Wyeth from The\nOdyssey of Homer, translated by George Herbert\nPalmer. Copyright 1929 by N. C. Wyeth; copyright\nrenewed (c)1957 by Carolyn Wyeth. Used by permission\nof Houghton Mifflin Harcourt. All rights reserved.\nThe Oresteia – An Introduction\nImage 1: “Alabaster cinerary urn of Vel Remzna\nCrespe with the murder of Clytemnestra” by Dan\nDiffendale is licensed under CC BY- NC -SA 2.0\nImage 2: “Orestes Apollo Louvre Cp710” by Bibi Saint-\nPol is licensed under CC0 1.0 MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n272\nCLASSICAL MYTHOLOGY\nOrigins\nImage 1: “The Mutilation of Uranus by Saturn” by\nDodo is licensed under PD-US\nImage 2: “Sickle without background” by Amada44 is\nlicensed under CC BY 2.0\nImage 3: “Omphalos, AM Delphi, 0004” by Zde is\nlicensed under CC BY-SA 4.0\nImage 4: “Atlas (Farnese Globe)” by Gabriel Seah is\nlicensed under CC BY-SA 3.0\nImage 5: “Objectivist1” by Michael Greene is licensed\nunder CC BY 2.0\nOrpheus\nImage 1: “Orfeo, euridice ed hermes, da torre del\ngreco, copia augustea da orig. greco del 450 ac ca.\n6727” by Sailko is licensed under CC BY-SA 3.0\nPersephone\nImage 1: “Pinax with Persephone and Hades\nEnthroned, 500-450 BC, Greek, Locri Epizephirii,\nMannella district, Sanctuary of\nPersephone, terracotta – Cleveland Museum of Art –\nDSC08242” by Daderot is licensed under CC0 1.0\nImage 2: “Dante Gabriel Rossetti – Proserpine-\nGoogle Art Project” by Tate Britain is licensed under PD-\nUS\nPerseus\nImage 1: “Correggio – Danaë -WGA05341” by Web\nGallery of Art is licensed under Public Domain\nImage 2: “Danae gold shower CA925” by Marie Lan\nNguyen is licensed under CC0 1.0 IMAGE ATTRIBUTIONS 273\nImage 3: “Perseus, Pegasus, and Medusa (Met)” by\nLucas is licensed under CC BY 2.5\nImage 4: “Perseus Cellini Loggia dei Lanzi 2005 09 13”\nby Marie Lan Nguyen is licensed under CC BY 2.5\nImage 5: “Perseus with the Head of Medusa MET\nDP249451” by Pharos is licensed under CC0 1.0\nImage 6: “Perseus and andromeda amphora” by\nMontrelais is licensed under by CC BY 3.0\nPoseidon\nImage 1: “Athena Poseidon Cdm Paris DeRidder222”\nby Shakko is licensed under PD-US\nImage 2: “Medusa by Caravaggio 2” by “Ghirlandajo”\nis licensed under Public Domain\nImage 3: “Cape Sounion” by Stella*R is licensed\nunder CC BY-SA 2.0\nImage 4: “Poseidon Sounion Shapiro” by Susan\nShapiro is licensed under CC BY 4.0\nSphinx\nImage 1: “Corinth Archaeological Museum Sphinx\nShapiro photo” by Susan O. Shapiro is licensed under\nCC BY 4.0\nImage 2: “Oedipus and the Sphinx of Thebes, Red\nFigure Kylix, c. 470 BC, from Vulci, attributed to the\nOedipus Painter, Vatican Museums (9665213064)” by\nCarole Roddato is licensed under CC BY-SA 2.0\nImage 3: “Oedipus and the Sphinx 1864” by Met\nMuseum is licensed under Public Domain\nTheseus MYTHOLOGY UNBOUND: AN ONLINE TEXTBOOK FOR\n274\nCLASSICAL MYTHOLOGY\nImage 1: “Drunken satyr MAN Napoli Inv5628 n0” by\nMarie Lan Nguyen is licensed under CC BY 2.5\nImage 2: “Theseus Minotaur BM Vase E84” by Marie\nLan Nguyen is licensed under CC BY 2.5\nImage 3: “Statue of Ariadne on Naxos Shapiro1” by\nSusan O. Shapiro is licensed under CC BY 4.0\nThe Twelve Labors of Heracles\nImage 1: “Herakles 1st labor: The Nemean Lion” by\nEgisto Sani is licensed under CC BY-NC-SA 2.0\nImage 2: “Lernaean Hydra Louvre CA598” by Bibi\nSaint-Pol\nImage 3: “Heracles’ fourth Labor: The Erymanthian\nboa” by Egisto Sani is licensed under CC BY-NC-SA 2.0\nImage 4: “Mosaico de los trabajos de Hércules,\nMuseo Arqueológico Nacional, Madrid, España, 2016\n04” by Benjamín Núñez González is licensed under CC\nBY-SA 4.0\nImage 5: “Herakles Geryon Staatliche\nAntikensammlungen 2620” by Bibi Saint-Pol is licensed\nunder CC0 1.0\nImage 6: “Herakles Kerberos Louvre F204” by Bibi\nSaint-Pol is licensed under CC0 1.0\nZeus\nImage 1: “Kylix (29366674371)” by Tm is licensed\nunder CC BY 2.0\nImage 2: “Zeus Typhon Staatliche\nAntikensammlungen 596” by Bibi Saint-Pol is licensed\nunder CC0 1.0\nImage 3: “The Flight of Europa” by Kwork2 is licensed\nunder CC BY 2.0 IMAGE ATTRIBUTIONS 275\nImage 4: “Zeus-Gany-sculpt1” by Tetrakyts is licensed\nunder CC BY-SA 3.0\nImage 5: “The Abduction of Ganymede” by Marsyas is\nlicensed under Public Domain\nImage 6: “NAMA Poséidon” by Marsyas is licensed\nunder CC BY-SA 3.0"
}