{
    "text": "CCiittyy UUnniivveerrssiittyy ooff NNeeww YYoorrkk ((CCUUNNYY))\nCCUUNNYY AAccaaddeemmiicc WWoorrkkss\nOpen Educational Resources Queensborough Community College\n2015\nIInnttrroodduuccttoorryy GGuuiiddee ttoo AAnncciieenntt CCiivviilliizzaattiioonnss\nHelmut G. Loeffler\nCUNY Queensborough Community College\nArturo H. Enamorado III\nCUNY Queensborough Community College\nHow does access to this work benefit you? Let us know!\nMore information about this work at: https://academicworks.cuny.edu/qb_oers/13\nDiscover additional works at: https://academicworks.cuny.edu\nThis work is made publicly available by the City University of New York (CUNY).\nContact: AcademicWorks@cuny.edu Introductory Guide to Ancient Civilizations\nHelmut Loeffler and Arturo H. Enamorado III\n1 Note\nThis book is designed to be used along with a presentation or other supportive material.\nMaps, pieces of art, archaeological evidence etc. have to be presented so that the past can\nbe recreated in context. The individual lecturer needs to fill in the missing parts he/she\nwants to focus on based on their expertise and interest. This guide is kept short and\nsimple on purpose because textbooks on ancient civilizations often are too expensive and\nare only used periodically throughout the semester. We hope to deliver something more\nuseful for students.\n2 Contents\n1. Early Human History ................................................................................................ 4\n2. Ancient Egypt and Nubia ........................................................................................ 18\n3. Early China .............................................................................................................. 26\n4. Early India................................................................................................................ 33\n5. Early Americas ........................................................................................................ 41\n6. Classical Civilizations: Persia ................................................................................. 50\n7. Classical China ......................................................................................................... 61\n8. Classical India .......................................................................................................... 71\n9. Early Greece ............................................................................................................. 83\n10. Archaic and Classical Greece ................................................................................. 95\n11. Macedonian Empire .............................................................................................. 103\n12. Hellenistic Period ................................................................................................... 108\n3 One cannot discuss the ancient civilizations of the world without first mentioning the\nimportance of water. Water is the key to life and to sustaining it; without water and fertile\nland early civilizations of the world would not have been possible. Many of the\ncivilizations in the ancient world would develop in river valleys that provided fertile land\nand fresh water. But first let us discuss the beginning of human development that led to\nthe earliest civilizations.\n1. Early Human History\nThe earth itself as recorded by scientific evidence is around 4.5 billion years old.\nConsidering the age of the planet it was only recently, roughly 40 million years ago, that\nthe first monkey-like animals appeared in the tropical regions of the world. This monkey-\nlike species would remain the dominant mammal until about 4 to 5 million years ago\nwhen the ancestor to the human species emerged. This species was still monkey-like, but\nit represents also the first example of pre-humans (the technical term used is\nAustralopithecus). The most famous example of Australopithecus is “Lucy” whose bones\nwhere discovered in modern day Ethiopia on November 24, 1974. Her remains showed\nthat these pre-humans were bipedal (they could walk on two legs) and that their skulls\ncontained a slightly larger brain than most mammals.\nAbout roughly one million years ago the next leap in human evolution took place:\nHomo erectus appeared. This human ancestor was taller, had a bigger brain and started to\nlook more human than ape. Finally around 200,000 years ago came the birth of our\nspecies, and thus begun the rise of Homo sapiens. One of the reasons why Homo sapiens\nsucceeded was the uniquely structured larger brain (1,500 cubic centimeters) This brain\nenables us to have reflective thoughts, which over time proved to be an evolutionary\nadvantage.\nPaleolithic Period\nThe cradle of mankind was located in East Africa, in modern-day Tanzania, Kenya and\nEthiopia. These regions have yielded the oldest fossil evidence for Australopithecus and\n4 other species that may be direct ancestors of modern humans. The Paleolithic Period,\nwhich is ancient Greek for “Old Stone Age”, begins 4 to 5 million years ago in\nconjunction with the evolution of early human-like species. A main characteristic of this\nage is the hunting and gathering way of life. Members of early human-like species were\nshort and around 1 meter (3 feet) tall on average. These pre-humans were covered in hair\nand made use of their hands. They used an early form of verbal communication. They\ncould stand up and walk on two feet. Yet their brain size was relatively small compared to\nours, measuring only 500 cubic centimeters (equivalent to 1/3 of the modern human\nbrain). Yet with this limited brain these pre-humans were able to create simple stone tools\nand could travel in groups.\nWhen Homo erectus evolved around one million years ago the evolutionary\nadvantage was clear: he had a brain double the size of that of the pre-humans’ (roughly\n1000 cubic centimeters) and a larger body size. Homo erectus and the pre-human figures\nlived alongside each other until Homo erectus became the dominant species. Homo\nerectus would discover how to tend fire. Homo erectus would eventually spread out and\nwith his larger brain he developed better verbal communications than his predecessors,\nwhich made him a very effective hunter.\nHomo sapiens evolved around 200 thousand years ago; he lived alongside Homo\nerectus and gradually became the dominant human species. With his unique brain Homo\nsapiens created better tools, weapons (for example a spear throwing device with which he\ncould hurl spears up to 100 miles per hour) and ornamental pieces of art. Homo sapiens\nalso migrated to many places around the world. This was supported by the Ice Ages.\nFrom about 65,000 to 15,000 BCE the earth experienced global cooling leading to Ice\nAges, which created a lower global sea level; these lower sea levels expanded the land\nmasses, creating the early land bridges which allowed people to move to the Western\nhemisphere (The Americas) and to places like Australia.\nHunting and gathering remained the source of food for Homo sapiens. Our early\nancestors presumably had no sense of private property. Men and women were probably\nmore equal than in later farming communities, because all members of the group were\nessential to the survival of the group. Our early ancestors were so effective at hunting that\nthey killed all horses in the Americas and brought other animals to extinction. Homo\n5 sapiens would develop many larger and sharper stone weapons, which contributed to this\nextinction process. Around 110 thousand years ago Homo sapiens learned to fish in deep\nwater. Somewhat later, our ancestors learned to craft art and jewelry. Examples include\nthe Venus statues, which are believed to be reflections of an early form of religious rite,\ninvoking fertility. One of the most famous and well preserved of these statues is the\nVenus statue found in Willendorf, Austria, dating back to 23,000 BCE. The reason many\nscholars believe that these statues reflect religious worship is that around this time we see\nearly humans around the world creating similar artistic statues, which are mostly female\nand usually possess exaggerated sexual organs. Another form of early art is to be found in\ncaves. Early humans mostly depicted animals on the walls of caves, presumably because\nhunting was an essential and dangerous part of their lives. Today we think that around 30\nthousand hunters and gatherers are still living on this planet, and by studying them we try\nto gain insight into the way of living of hunters and gatherers.\nThe Neolithic Period\nAgriculture became popular among early humans around 10 to 12 thousand years ago,\nmarking the beginning of the Neolithic period (ancient Greek for New Stone Age). At this\npoint we see our early ancestors cease to move around (as had been necessary while\nhunting and gathering) and to begin settling down to cultivate plants and domesticate\nanimals. Although farming was much harder and labor intensive than hunting and\ngathering, agriculture became the dominant way of life because it provides a stable and\nsecure supply of food. In fact, after the end of the Paleolithic age, around 10-12 thousand\nyears ago, the world’s population was only 4 million, but by 500 BCE the world’s\npopulation had skyrocketed to 100 million thanks to agriculture. People would eventually\nmove to better locations to farm, searching for fertile land, and for sources of fresh water.\nThis in turn led to the creation of large settlements of people who banded together to farm\nwhile having a permanent home. One of the oldest permanent settlements, Jericho, dates\nfrom around 8000 BCE, and had a population of about 2000 people. The main crops that\nwere farmed in Jericho were wheat and barley. However, the city also harvested salt,\nwhich was a source of wealth. At this time in human history money did not exist, so\n6 goods and commodities served as the basis for trade and exchange. Wealth meant the\naccumulation of land and (luxury) goods. Luxury goods would be used to fund the\nbuilding of the great walls of Jericho around 7000 BCE, which are mentioned in later\nSacred and Secular texts.\nAgriculture was so successful that many farmers could actually stop being farmers\nand specialize in trades for food. Crafts like pottery making would soon (around 7000\nBCE) develop, which further led to the development of design and art. By marking\ndesigns into the clay before the raw pottery was baked, potters could produce nicer\nlooking pottery and thus increase its value. Next came the craft of textile making, which\ninvolved the production of clothes and fabrics for trade. Next and highly important to the\nfurther development of mankind was the craft of metallurgy, which permitted people to\ncreate goods like jewelry and tools out of copper. Around this time period we also see the\ndevelopment of government and other means of providing security and order, as these\nwere needed in the fast growing settlements. It is with the creation of early government\nthat we can refer to these settlements as the first cities, which had also become larger in\nsize and in population.\nEarly Mesopotamia (Sumer)\nThe word “Mesopotamia” goes back to ancient Greek and means “between (Meso) the\nrivers (Potamoi).” The two major rivers in the region are the Euphrates and Tigris.\nLocated mostly in modern day Iraq, these two rivers provided the fresh water the people\nof the region needed. As early as 6000 BCE people in the region began to irrigate land on\na small scale, and they gradually moved to irrigate more fields. Irrigation techniques\nbegan with simple canals but grew into the construction of large reservoirs off of the two\nrivers. The use of artificial irrigation increased the food supply, which resulted in an\nincrease in population within Mesopotamia. The population booms that Mesopotamia\nexperienced reached far into its Southern area, where we see the rise of one of the first\ncivilizations. Around 5000 BCE the people of this area, called the Sumerians, began\nconstructing complex irrigation systems to produce a larger harvest. By 3000 BCE, 100\nthousand people lived in the land of Sumer. At this point in history, this was the largest\n7 concentration of population in one area. Beginning around 4500 BCE the Sumerians\nbegan constructing the world’s first cities. Unlike the earlier Neolithic villages and towns,\nthese cities were centers of political and military authority. The Sumerians developed\nfunctional aspects of the city, like market places for commerce, and organized religious\nactivity. It is worth noting that religion in the early civilizations was polytheistic. The\nearly Sumerian priests had two basic tasks: overseeing religious ceremonies and keeping\ntraditions alive. The early cities of Sumer made great strides to keep peace and to ensure\nthat food supplies could meet a fast-growing population. The governmental structures of\nSumer were vital to the security of their people. They organized the building of large\ndefensive walls to protect these early cities. In addition to defensive structures the\ngovernment was also in charge of constructing useful projects for the community such as\ntemples and irrigation systems.\nSumerian temples were by no means simple structures; these temples required an\nincredible amount of labor to construct. For instance, the temple to the goddess Inanna in\nthe city of Ur, built around 3200 BCE, is believed to have required the labor of at least\nfifteen hundred people working 10 hours each day for about 5 years. Because Ur is so\nwell preserved, we are able to learn much about the Sumerians from their temples. The\nmost impressive religious structure is called the Ziggurat, a stepped pyramid in design\nthat housed several temples and altars with stairs on the outside. The Ziggurat at Ur still\nexists in modern day Iraq. When these Ziggurats were built, many people would bring\nofferings to the gods for prosperity and good harvests. Besides commissioning the\nbuilding of these massive temple complexes, the government also needed to allocate the\nworkers necessary to build these structures, to maintain irrigation systems, and to build\nnew ones. The Sumerian government had to ensure water was distributed equally, an\nimportant task as the other cities outside of Sumer began to grow wealthier and thus more\npowerful. Many of these cities began building their own defensive walls as a necessity\nsince Mesopotamia’s geography does not provide any natural barriers. It should also be\nnoted that the early Sumerian governments were not monarchies but assemblies of\nprominent wealthy men that made decisions on behalf of the community. When the city\nwas under a threat a single man was elected to handle the crisis with full authority to fight\n8 these wars; he was expected to return power once the crisis was resolved. Some of these\ntemporary single rulers did not hand back power and made themselves kings.\nAkkadian Empire\nBy 3000 BCE each Sumerian city was ruled by a king who possessed absolute power.\nThis would change as one king, Sargon, began to wage a war of conquest against the\nother Sumerian cities. Sargon is believed to have lived from 2370 to 2315 BCE (or 2270\nto 2215 BCE) and ruled over the city of Akkad. Scholars are not sure where exactly\nAkkad was located but most believe it was near the city of Kish. Sargon’s conquest of the\nSumerian cities happened gradually; one by one each city fell under his control. He\ninstalled governors that took the place of the former kings to rule on his behalf. With each\nsuccessful conquest Sargon’s army grew, becoming a very effective military machine that\nwas virtually unbeatable in battle. His warriors became so fierce and effective in battle\nthat the name Akkadian became a source of fear to their opponents. At its peak Sargon’s\narmy consisted of about 5000 soldiers, and in order to secure his area he moved with his\narmy from city to city. The problem he faced was finding enough supplies, food and\nshelter for his massive army. One solution to this problem was to demand provisions\nfrom the city that was housing Sargon’s forces, although this led to resentment, which in\nturn resulted in local rebellions. The second solution was to take control of the trade\ncenters and to block trade routes to other cities, therefore allowing trade to the cities only\nin exchange for the payment of access fees. These supplied the army and kept the cities\nweak. Under Sargon the city of Akkad now became the wealthiest city in the world at that\ntime (ca. 2300 BCE). His successors would manage to keep a secure rule over Akkad for\nseveral generations, approximately for 150 years, until Sargon’s empire collapsed in 2150\nBCE, but not without influencing other rulers who modeled themselves after him.\n9 The Old Babylonian Empire\nInspired by the conquests of Sargon, another Mesopotamian king would move to conquer\nand rule over Mesopotamia. He would become the most popular king of the Old\nBabylonian Empire. His name was King Hammurabi and he reigned from 1792 to 1750\nBCE. Hammurabi created a more central administration; he did not travel around with a\nlarge-scale army like Sargon did but instead ruled from the capital city of Babylon.\nHammurabi would also install deputies in the controlled areas. Unlike Sargon,\nHammurabi would fund his armies not by traveling around but by creating a system of\ntaxes to ensure regular income for his administration. We know Hammurabi mostly for\nanother prominent innovation: the provision of a code of law. This code demanded high\nstandards of behavior and stipulated harsh punishments for perpetrators of many crimes.\nThe death penalty was established for crimes like murder, theft, fraud, false accusations,\nadultery, and incest. The core principle of the code of Hammurabi was Lex Talionis,\nwhich means “law of retaliation.” It basically held that the offender was to suffer a\npunishment equal to the crime committed. However, this principle was only applied to\nequals within a social class, meaning that if a nobleman injured a person of lower\nstanding he was not punished equally, and if a nobleman was harmed by a member of the\nlower classes, the punishment would be death for the latter. The code of Hammurabi\nwould influence later Persian and Hebrew laws.\nSince the Babylonian empire became more and more powerful and wealthy due to\ntheir efficient tax system, it is no surprise that invaders were attracted to the prosperity of\nthe Babylonians. Around 1595 BCE the Hittites defeated the Babylonians, conquering\nand sacking their capital city, and effectively plunging the region into civil unrest for\nseveral hundred years.\n10 The Hittites\nAround 1700 BCE the Hittite empire emerged in what is now Eastern Turkey. Their\ncapital city was Hattusa. They developed a strong monarchy and expanded their empire\nrapidly. The Hittite military was powerful not only because of their great soldiers but also\nbecause of one of their inventions: the light, two-wheeled, horse-drawn chariot. The\nHittite chariot design would soon spread to other civilizations like the Mesopotamians,\nthe Egyptians, and the Mycenaean Greeks. It is important to note that chariots were very\nexpensive because of the equipment and time needed to train the horses. Eventually this\nled to a professional elite group of soldiers because only the rich could afford a chariot.\nOn top of the development of the light chariot, the Hittites developed the ability to make\niron weapons and tools around 1300 BCE. The Hittites became engaged in battles with\nboth the Mesopotamians and the Egyptians. Their empire dissolved after 1200 BCE. The\nHittites spoke an Indo-European language, which is the language family from which\nmany modern European languages originate. Many of the Asian languages are also of the\nsame language family, for example Sanskrit, Persian (Farsi), Hindi, Bengali, Urdu. The\nreason for this widespread use of Indo-European languages is the migration of Indo-\nEuropean speaking peoples out of Eastern Europe into Central and Western Europe and\nparts of Asia. Other language families include Semitic (Hebrew, Phoenician, Arabic) or\nBantu (more than 400 languages spoken in sub-Saharan areas in Africa.)\nAssyrian Empire\nBetween 1900 and 1800 BCE the independent state of Assyria in northern Mesopotamia\nwas a small settlement with no threats to its borders. Assyria’s location in a valley close\nto the Tigris River was beneficial, since it provided the inhabitants access to important\ntrade routes. The Assyrians were quick to establish a powerful military, with armies based\non units and professional commanders. The commanders of these units were not chosen\nbecause of noble birth but rather on the basis of merit: the bravery and skill they showed\n11 in battle. Another reason for the strength of the Assyrian military was the adoption of the\nchariot developed by the Hittites. After this new weapon was added to their very\ncompetent army, the Assyrians began expanding their empire to not only Mesopotamia\nbut as far west as Egypt and Syria climaxing in size around the 8th and 7th century BCE.\nThe cities of Assur and Nineveh became wealthy centers of power and culture. In\nNineveh a massive library was constructed where many texts of the history and culture of\nthe people of Mesopotamia were preserved, including the famous Epic of Gilgamesh.\nThe Assyrians drew heavily from the achievements of the Old Babylonian\nEmpire, and even followed the code of Hammurabi as its own system of law. The\nAssyrian rule became more and more unpopular in other regions; many rebellions against\nthem took place in different locations of their massive empire. By 612 BCE their empire\nwas effectively destroyed when the city of Nineveh was conquered.\nThe New Babylonian Empire\nAfter the fall of the Assyrian Empire the Babylonians returned to power. The return of the\nBabylonian domination of Mesopotamia is often referred to as the New Babylonian\nEmpire or the Chaldean Empire. The most famous king of Babylonia during this period\nwas King Nebuchadnezzar, who reigned from 605 to 562 BCE. Nebuchadnezzar spent\nmuch of his empire’s wealth on the capital city of Babylon, which among other things\nwas protected by enormous defensive walls. It was said that a four horse-drawn chariot\ncould turn around at full speed on top of the walls. Within the city walls were reportedly\nmore than a thousand temples with golden statues, as well as one of the famous seven\nwonders of the ancient world, the Hanging Gardens of Babylon. They were built as a gift\nfor Nebuchadnezzar’s wife Queen Semiramis to bring the beautiful gardens she grew up\nwith to Babylon. In 539 BCE the Persians conquered Babylonia under Cyrus the Great.\nMesopotamian Life\nThe creation of bronze vastly increased the productivity of workers in Mesopotamia.\nMesopotamian craftsmen created bronze around 3300 BCE by smelting both copper and\n12 tin together and creating a hard alloy which was first used to make more effective\nweapons and eventually more effective tools in agriculture and other industries. The\ncreation of bronze marked the beginning of the Bronze Age, which lasted from around\n3300 BCE to around 1400 BCE. With the innovation of iron smelting between 1300 and\n1200 BCE production capabilities reached new heights and the Iron Age began. Iron was\nharder to make than bronze, as it required higher temperatures to smelt the iron ore. This\nheat was achieved through burning charcoal. Iron was vastly superior in strength and\ndurability to bronze, and agricultural tools made out of iron increased the food supply.\nThe large surpluses of food led to increasing populations and because of the possibility of\naccumulating wealth, social classes appear as in the earlier empires in Mesopotamia.\nMembers of the religious class would still oversee religious ceremonies as had been\nexpected of them since the time of Sumer, but the functions of temples expanded around\n2400 BCE as temples became powerful economic centers. They started to possess large\namounts of land and manufactories. These temples would also provide functions of a\nbank and help the community by taking in orphans, supplying grain in times of need, and\neven paying ransom if a community member was captured in battle. The religious class of\nthe society was often made up of royalty and considered privileged along with the royal\nfamily. The less privileged members of societies in Mesopotamia were made up of three\ndifferent classes. First were the free commoners who could own their own land and farm\nit, were expected to pay a tax, and could be drafted for building projects in the various\nkingdoms. The dependent clients formed the second class beneath the free commoners.\nUnlike the free commoners the dependent clients could not own land but were given\npermission to work on the land owned by the free commoners or on land owned by the\nstate or temples. The dependent clients would share the burden of paying taxes and\nsupplying conscripted labor for building projects. Lastly, at the bottom of the social\nclasses of Mesopotamia were the slaves, who were made up of three different types of\npeople. Most slaves in Mesopotamia (as well as the ancient world in general) were war\ncaptives taken from the losing faction. The second type of slaves in Mesopotamia were\nconvicted criminals that were to serve as slaves for punishment. The last group among the\nslave population consisted of individuals who could not pay their debts. The\nconsequences of being a war captive in the ancient world were dire: once you became a\n13 slave you would usually remain a slave for the remainder of your life. In Mesopotamia\nslaves had no rights, in contrast to ancient Egypt, for example, where slaves were granted\nlimited legal rights.\nIn Mesopotamia as well as in most of the ancient world gender equality was not\ncommon practice. Most of the empires in the region were patriarchal: men dominated\nwomen, and in Mesopotamia women were legally subordinate to men. On occasions a\nwoman could have influence and become rather powerful through being a priestess or\nhigh priestess, which was possible only if she was of royal blood. A few women were\nable to become advisors to kings, but all of these were exceptions to the rule. In\nMesopotamia men would gradually tighten their control over women. At some point\nbetween 2000 and 1000 BCE, for example, laws were created to ensure that women had\nto be virgins at marriage, and that married women were prohibited from casual social\ncontact with men outside their family. Already in 1500 BCE, if not earlier, married\nwomen in Mesopotamia were expected to cover themselves with a veil when outside their\nhomes. The reasoning behind these laws was presumably the desire by wealthy men to\ncontrol women to ensure that their fortune was protected from illegitimate members of\nthe family.\nThe Mesopotamians are also responsible for the earliest from of writing, which\nwe call cuneiform or “wedge-shaped” writing. The characteristic wedge-shape was\ncaused by scribes using a reed to imprint wedge-shaped characters into clay tablets. The\nearliest cuneiform writing goes back to the Sumerian period, around 3100 BCE. The\ninitial purpose for this writing system was to keep track of goods; later it was used for\nlegal documentation in court, for correspondence, and for literary texts. The temple\nscribes produced texts of mathematics and science in Mesopotamia. In particular the\nMesopotamians were very advanced in the fields of astronomy and math. We have found,\nfor example, tablets containing multiplication tables, square roots and exponents. Around\n1700 BCE the Mesopotamians created a list of the stars, the sun, moon, and even planets,\nwhich they used to predict events like tidal changes. Literary texts include the famous\n“Epic of Gilgamesh”; the earliest parts of this epic go back to the Sumerian period. This\ntext deals with the topics of friendship, the relationship between humans and gods, and\nlife and death.\n14 Neighbors of the Mesopotamians: Hebrews, Israelites, and Jews\nThe Hebrews were an ancient nomadic people living between Egypt and Mesopotamia\nfrom around 2000 to 1000 BCE and speaking a language called Hebrew. Israelites are\npeople who branched off from Hebrew peoples and settled in Palestine around 1200\nBCE. The proximity to the Mesopotamian advanced civilizations made sure that\nHebrews, Israelites and Jews were influenced by Mesopotamia. Some of the early\nHebrews migrated to prospering Mesopotamian cities, took on Mesopotamian customs\nand belief structures. This becomes evident when one takes a look at the Hebrew\nScriptures or the Old Testament. In both religious texts we find indications of a man\nnamed Abraham migrating from Ur, the Sumerian city around 1850 BCE. The Hebrews\nworshiped many of the Mesopotamian gods and adopted Mesopotamian customs and\nvalues. They were especially influenced by the Code of Hammurabi. The law code of the\nMesopotamians would deeply influence the Hebrews with special focus on the principle\nof Lex Talionis or the right to retaliate. This was not the only area from which the\nHebrews borrowed from their Mesopotamian neighbors; they were also influenced on the\nliterary level. The ancient Hebrew story of Noah, whom god chooses to build an ark to\nsave his family and the chosen animals of the world from a destructive flood, is\ninfluenced by the Mesopotamian Epic of Gilgamesh. The highly advanced Mesopotamian\ncivilization was crucial to the development of the Hebrews, who borrowed and adapted\nthe ideas and patterns into their own customs; this is reflected in the Hebrew Scriptures\nand the Christian Old Testament, probably written after 800 BCE.\nAround 1800 BCE many Hebrew people migrated to Egypt, settling among the\nEgyptian people. By 1300 BCE these Hebrews migrated to Palestine under the leadership\nof Moses to escape Egyptian oppression under Pharaoh Ramses II. These Hebrew people\nwould organize themselves into 12 tribes after arriving in Palestine. It is after this event\nthat we no longer call these people Hebrews but Israelites. These new migrants fought\nintensely against the original inhabitants of Palestine and eventually carved out land for\nthemselves. Later the 12 tribes of the Israelites were temporarily united and ruled by\nmonarchs. The most popular and powerful kings of the Israelites were King David (1000-\n15 970 BCE), and King Solomon (970-930 BCE). King David built up the kingdom of Israel\nto become a power within Palestine, while his successor King Solomon built the capital\ncity of Jerusalem and the famed Temple of Jerusalem. The kingdom of Israel under both\nKing David and King Solomon traded intensively with the Mesopotamians, Egyptians,\nand Arabians.\nIn the beginning the Israelites in Palestine seemed to honor not just some deities\nof the Mesopotamians as mentioned above, but also some gods of the local people of\nPalestine as well. It is only after 800 BCE that one god named Yahweh was recognized\nmore and more as the only “true god”. After the reign of King Solomon the Israelites\nwere divided due to tribal tensions. The final result was the emergence of two kingdoms\nfrom the once powerful united kingdom: in the north the Kingdom of Israel and the\nsmaller Kingdom of Judah in the south (Judea). The Kingdom of Israel fell under the\ndomination of the expanding Assyrian Empire in the 9th century BCE, and in 722 BCE\nthe Assyrians conquered the kingdom and deported many of the inhabitants. The\nKingdom of Judah in the south remained independent, but only briefly. In 597 BCE the\nNew Babylonian Empire conquered the Kingdom of Judah and destroyed the temple of\nJerusalem and the city. Beginning in 587 BCE the New Babylonians also deported many\ninhabitants. This event later became known as the Babylonian Exile. Many of these\ndeported inhabitants from the Kingdom of Judah returned later following the Persian\nConquest of Babylonia by Cyrus the Great. These returning descendants of the Israelites\nbegan to be known as the Jews. These returning Jews had established a strong sense of\nidentity, and felt distinct from the Mesopotamians and other people that they once\nborrowed from. The Jewish people began to attribute their survival more and more to\ntheir special relationship with the god Yahweh, stimulating the rise of monotheism, which\nwould later have a deep impact on Christianity and Islam.\nPhoenicians\nAnother civilization neighboring Mesopotamia was the civilization of the Phoenicians.\nAround 3000 BCE, their homeland was located north of Palestine in modern day\nLebanon. Unlike the Israelites, who eventually formed a unified kingdom, the\n16 Phoenicians were organized as a loose alliance of independent city-states ruled by local\nkings. The unique quality of the ancient Phoenicians was their focus on trade; they were\nnot very much interested in politics and power expansion like many other civilizations.\nThe Phoenician trade network at its peak covered the entire Mediterranean Sea between\n1200 and 800 BCE. The Phoenicians’ trade network was secured by their deep maritime\ntradition, which eventually made the Phoenicians known for having the best ships in the\nregion as well as having excellent sailors. Like the Hebrews and Israelites they were\ninfluenced by the highly advanced civilizations of Mesopotamia: they adopted many of\nthe customs of their Mesopotamian neighbors but developed them in distinctive ways.\nThis can be seen in the writing system: the Phoenicians used the cuneiform script for over\n1000 years until around 1500 BCE when they developed a more simple way to write to\nhelp speed up the documentation of trade goods. This Phoenician writing system was\nbased on an alphabetic script of 22 consonants with no vowels and was used to spell out\nwords, making it easier to use than the hundreds of symbols for individual words in\ncuneiform scripts. This new writing system traveled to other people, especially to the\nancients Greeks, who adopted the system in the late 9th century BCE and advanced the\nPhoenician alphabet by adding vowels to it. The Greek version of the alphabet would\nlater be adopted by the Romans, who used it as the basis of their own writing system,\nwhich evolved into the modern alphabet we use today.\nConclusion\nStarting with the rise of mankind, the development of humans towards civilization\nbecame a natural evolutionary process as we switched from hunting and gathering to\nfarming and started to organize the growing populations made possible by agriculture.\nThe first civilizations appear in the region between the rivers Euphrates and Tigris,\nknown as Mesopotamia. The life giving rivers and the fertile soil first assured the\nsurvival of the people and then slowly enabled them to create empires. The\nMesopotamians expanded their power through economic and military force. They\ninfluenced other kingdoms outside of Mesopotamia such as Hebrews, Israelites, Jews and\nPhoenicians.\n17 2. Ancient Egypt and Nubia\nIntroduction\nMesopotamia was not the only place where vast empires evolved. To the west of\nMesopotamia in northern Africa sprouted the most famous of the ancient civilizations,\nEgypt. The empire that came out of Egypt is remarkable in terms of religion, culture and\npolitics.\nEarly development\nWhen the early settlers arrived in North Africa, it was not the dry, harsh climate of today.\nShortly after the last ice age ended around 10,000 BCE the Sahara Desert was more\ncomparable to the steppes of Mongolia, with grass, small lakes and rivers. In the\nfollowing millennia the people of Sudan developed a primitive form of agriculture, which\nincluded the domestication of several animals and cultivation of certain plants. By around\n5000 BCE the Sudanic (Nubian) peoples organized small monarchies ruled by kings\nregarded as either divine or semi-divine. The people of ancient Nubia practiced the\nexecution of the deceased monarchs’ servants so they could continue to assist and\naccompany the king in the afterlife. After 5000 BCE the climate of North Africa began to\nchange; generally speaking the region became hotter and drier. This caused both plant life\nand water supplies to disappear. Agriculture became far too difficult and the Sahara\nbecame a vast desert. Pushed by the growing desert, the inhabitants of the formerly green\nSahara were pushed to areas with fresh water like Lake Chad and the Nile River.\nIt is because of this migration that the early history of Africa was determined\npredominantly by the Egyptian civilization. Egyptian life was dominated by the vast Nile\nRiver and its delta for most of its history. The Nile provided the necessary resources to\nsustain highly productive agriculture, such as water and fertile soil, which in turn gave\nway to civilization. Yet the Nile River was an advantage not just for the early settlers of\nEgypt; it also provided fresh water and fertile nutrients to the soil of the regions located\nsouth of Egypt like ancient Nubia. The Nile River is the longest river in the world at 4160\n18 miles (6695 kilometers). The source of the river is Lake Victoria. Rainfall along with\nmelting snow caused the river to swell each spring allowing annual flooding of the land\nby the Nile River. When the Nile River receded in the fall it left behind fertile soil that\nmade it possible for domesticated crops to thrive in ancient Egypt. The annual flood\ncreated an abundant amount of fertile land along the river, especially in Lower Egypt, but\nnot as much in Nubia. This natural flooding of Egypt was interrupted only around 50\nyears ago (in 1968), when the Egyptian government built the Aswan Dam.\nLike the Sahara desert, ancient Egypt’s territory was different from Egypt today.\nMore of the plains in the Nile River Valley were flooded annually in ancient Egypt,\nallowing it to become more prosperous than Nubia to the south. The Nile also ensured\nthat both Egypt and Nubia came in contact with Mediterranean and sub-Saharan\ncivilizations, creating a network of trade in the region. This trade network in addition to\nproductive farming gave Egypt and Nubia an agricultural surplus that had also occurred\nin Mesopotamia. This surplus allowed an increase in population after 5000 BCE.\nEgyptian and Nubian societies began to organize public affairs, establishing formal states\nand authorities after 4000 BCE. By 3300 BCE in all of ancient Egypt and Nubia there\nwere small kingdoms ruled by local kings, all of whom practiced the custom of executing\nservants to provide for the kings in the afterlife. These independent kingdoms remained at\npeace until a period of political turmoil around 3500 BCE led to many wars and\nskirmishes between them. Some sources mention a man called Menes and suggest that he\nwas responsible for the unification of Egypt around 3100 BCE. Menes extended his\npower from upper to lower Egypt (the Nile River flows towards the Mediterranean, that\nis, from the south to the north, in the direction of the Nile River’s current creating the\nterritorial distinction of Egypt), and he built a new capital city in the middle of upper and\nlower Egypt called Memphis in order to support the unification process. Memphis\ngradually became a cultural and political center of Egypt. Menes and his successors then\nformed a centralized state ruled by the Pharaoh, king of Egypt.\n19 The Pharaoh During the Archaic and Old Kingdom\nEgyptian national history is usually described as a succession of Pharaohs and their\ndynasties. The Pharaoh embodied the unification of Egypt under one ruler, as was\ndepicted literally on the Pharaoh’s headdress, which combined elements of Upper and\nLower Egypt. Unlike rulers in many other civilizations, the Pharaohs in Egypt were seen\nas more than just leaders; rather they were regarded as divine incarnations, first of the\nhawk-god Horus, and later as the sons of the sun god Amen (-Re). The Egyptian Pharaoh\nwas given absolute power over all of the subjects of Egypt but with one exception: he\nwas subject to Ma-At, a cosmic balance of order and justice handed out by the gods. It\napplied to common people as well as the Pharaohs. This meant the Pharaohs had to be\n(theoretically) wise with their use of absolute power. Pharaohs in ancient Egypt enjoyed\nrule without limitations especially during the periods of Egyptian history known as the\nArchaic Period (3100-2660 BCE) and Old Kingdom (2660-2160 BCE). During the Old\nKingdom of Egypt the most iconic symbols of Egypt were constructed: the massive\npyramids of Giza. The original function of a pyramid in ancient Egypt was simple: to\npreserve and entomb the deceased Pharaohs. Most of the pyramids that remain were built\nbetween 2600 and 2500 BCE. The most famous one ever built in Egypt was the pyramid\nfor Khufu (or Cheops), which required 2.3 million limestone blocks to finish. The\nPyramid of Khufu stands at 479 feet tall and required nearly 100,000 workers to complete\nit over a period of decades since these laborers also had to work the fields for part of the\nyear. The Pyramid of Khufu/Cheops is regarded as one of the seven wonders of the\nancient world, and it is the only one that stands today in a mostly intact state.\nThe pyramids were filled with treasures and goods meant to aid the Pharaohs in\ntheir journey to the afterlife, which required food, water, chariots, and even slaves. The\nEgyptians borrowed the practice of earlier peoples (Nubia) and executed the personal\nslaves of the pharaohs and buried them alongside their master. However, already in\nantiquity these tombs were frequently plundered by thieves. Often only the sarcophagus\nof the king made out of granite remained in the tomb. The word sarcophagus is ancient\n20 Greek for “flesh eater”, which presumably meant the tomb was opened some time later to\nreveal only bones.\nAnother famous structure of Egypt located in Giza is the Sphinx, also created\nbetween 2600 and 2500 BCE. The Sphinx is a mythological creature with the head of a\nhuman and body of a lion (and sometimes wings of a bird). The Sphinx at Giza is\nbelieved by Egyptologists to depict the face of a pharaoh called Khafre.\nThe Sphinx and the Pyramids at Giza show how powerful the Egyptian pharaohs\nduring the Archaic period and Old Kingdom were. The power of the pharaohs led to a\ngrowing fear in Nubia concerning its independence from Egypt to the north. Eventually,\nEgyptian pharaohs conducted several military campaigns against Nubia during the\nArchaic and Old Kingdom periods. Towards the end of the Old Kingdom the Nubians and\nEgyptians concluded a peace of some sort that involved trade deals on many levels. The\nreasons for the end of the Old Kingdom are unknown to Egyptologists and historians. We\nknow for sure that there were two centuries of political chaos from 2181 to 1991 BCE.\nThese two centuries are called the First Intermediate Period, and it is followed by the\nMiddle Kingdom of Egypt, roughly dated from 2000 BCE to 1640 BCE. The pharaohs of\nthis period would end up becoming weaker than their predecessors.\nMiddle and New Kingdom Periods of Ancient Egypt\nThe Middle Kingdom of Egypt can be described as the classical era of ancient Egyptian\nliterature and culture. It was a period of weakened pharaohs and more powerful priests.\nThe Middle Kingdom lasted until around 1640 BCE, when another period of political\ninstability came to fruition, this time named the Second Intermediate Period. It was\nduring the Second Intermediate period that the Egyptians were ruled for around 100 years\nby peoples whom they called “Hyksos”. In 1567 BCE the Hyksos were expelled from\nEgypt and the New Kingdom period of ancient Egypt began and would last until around\n1087 BCE. During the New Kingdom Egypt expanded its power and its borders. Under\nPharaoh Thutmosis III, who ruled from 1479-1425 BCE, Egypt expanded to areas far\nnorth of Egypt like Palestine and Syria. Thutmosis III would achieve this through military\nforce. He personally led more than ten campaigns until these people were conquered.\n21 Egyptian rulers also expanded south into Nubia. By 1400 BCE Egypt was an imperial\npower in the Eastern Mediterranean, Southwest Asia and along the Nile River valley.\nDuring the time of the New Kingdom the pharaohs did not construct huge pyramids or\nmonuments like the Sphinx. Instead these new pharaohs built many large temples and\npalaces with large monumental statues. The most famous of the temples built during the\nNew Kingdom was the temple of Amen (Amun) at Karnak. Amen was a local god of\nKarnak in previous periods. He later was worshiped together with the Sun God Re as\nAmen-Re.\nAround 1100 BCE a long period of decline began in Egypt that resulted in the\nEgyptians being forced out of Nubia, Palestine and Syria by the local people, who were\nno longer willing to be under Egyptian rule. Egypt became so weakened that the Nubians\ninvaded and created the so-called Kingdom of Kush in Egypt, which lasted until the\nAssyrians invaded and pushed out the Kushites from Egypt, and ruled it themselves until\naround 650 BCE.\nEgyptian Life\nDuring the New Kingdom of ancient Egypt there were more slaves in Egypt because of\nall the campaigns in the early part of this period, which led to the capture of many\nprisoners of war. Earlier in the Old and Middle Kingdom slaves were probably rare. The\nPharaoh, the temples, or private persons could own slaves. Slaves in Egypt had some\nlegal rights: they could own property and pass it on to their heirs. Mostly the pharaohs or\nthe temples owned Egyptian land, thus a large part of the population in Egypt worked\neither for the king or the priests. The kings and the temples controlled the economy in\nEgypt. As for the life of the common people in Egypt little is known; more information is\navailable regarding the royal families. The king usually had several wives, but only one\nwas special and referred to as the “Great Royal Wife”, whose children would inherit the\nthrone. Polygamy was probably legal in Ancient Egypt. Pharaohs sometimes married\ntheir own sisters or other close relatives. Men owned or controlled most of the productive\nresources, but there is also evidence of the fact that women in Egypt also frequently\nowned property, slaves and other economic resources.\n22 Egypt was not forced to fight many wars against foreign invaders because the\ndesert, the Mediterranean Sea and the Red Sea protected it. One example of such an\ninvasion we already mentioned: the Hyksos conquered Egypt during the Second\nIntermediate period. The Egyptians were using primitive stone and copper tools and\nweapons that were already considered old. When the Hyksos conquered Egypt they\nbrought with them new technologies to Egypt that included bronze tools, chariots,\ncomposite bows, and the curved sword.\nEgyptian Afterlife and Religion\nMuch of what we know about Egypt comes from the graves and tombs of the Egyptians.\nThis is the reason why there are many artifacts and documents describing death and the\nafterlife. All of this evidence of what the Egyptians believed regarding life after death\nsurvives due to the plentiful tombs and graves that are so often well preserved because of\nthe location of these burial sites in the desert. The Egyptians took great care in the burial\nof the dead. In the early days of Egypt, primarily during the Archaic and Old Kingdom\nperiods, it was thought that only the kings had a fully immortal spirit that required care in\norder to go into the afterlife. During the Middle Kingdom this attitude changed and many\nEgyptians believed everyone would live an afterlife. The afterlife imagined by the\nEgyptians was not that much different from their everyday lives. For that reason the\ntombs were filled with everyday needs like clothes, food, jewelry, and other objects they\nthought were needed for the spirit. The Egyptians would call this spirit the “Ka”, and they\nthought the body was important in the afterlife along with the spirit. The evidence for this\nassumption is the fact that the Egyptians went to great lengths to preserve the body\nthrough the process of mummification, which was expertly done by Egyptian specialists.\nIn the early periods mummification was only performed for the king upon his death as\nwell as his close relatives. Later wealthy individuals and royal officials could also be\nmummified, and eventually the process was open to all people in Egypt. The process of\nproper mummification took seventy days; during this period specialists and priests treated\nthe body of the deceased person and conducted rituals based on prayers and incantations,\n23 which were written on papyrus and placed in the tombs to aid in a smooth passage into\nthe afterlife.\nThe religion of the ancient Egyptians was based on a polytheistic pantheon of\nmany gods. There were two main gods of Egypt which all people would pray to, Amun\nand Re. Amun was originally a local god of Thebes and was associated with the sun and\nfertility while Re was seen as the sun-god. Already during the Old Kingdom both gods\nwere worshiped together as one entity, Amun-Re, and as principal gods of Egyptian\nreligion. Another important god was Osiris, and the cult spawned by belief in him was\nvery popular among the Egyptians. In ancient Egyptian mythology Osiris’ evil brother\nSeth killed and dismembered him. Seth then distributed the body parts of his deceased\nbrother all over Egypt. Yet the wife of Osiris, Isis, gathered the parts and buried him\nproperly. The gods then restored Osiris because they were impressed by Isis’ devotion to\nher husband. The gods did not restore Osiris to live among mortals but to rule as the god\nof the underworld. The Egyptians connected Osiris’ death and resurrection with the Nile\nand agriculture (circle of life). In addition, the Egyptians saw Osiris as the god in charge\nof immortality. Osiris was so important to the belief in an afterlife that Egyptians honored\nhim in a special cult to make sure that Osiris was pleased and was willing to grant\nimmortality to the pious worshiper. Osiris as god of the underworld was to judge over the\n“weighing of the hearts”, which was the final judgment of a person. Based on this ritual\nOsiris determined whether a person would become immortal and enter the afterlife or not.\nIf the heart was found to be heavier than a feather by Anubis, the jackal-god of death,\nbecause it was burdened with guilt and evil, immortality was not granted.\nConclusion\nAncient Egypt was special because of the link between government and religion. Its\npowerful leaders, the pharaohs, were seen as part of or linked to the gods that people\nworshiped. Therefore opposition to a pharaoh was rare. The construction of the great\nmonuments of Egypt (pyramids, statues, temples) was possible only through the use of\nthousands of laborers. The ancient Egyptians built their lives around the great river Nile\n24 which, because of its annual flood, provided extremely fertile conditions for thriving\nagriculture and, as a consequence, a great civilization.\n25 3. Early China\nIntroduction\nAs in the cases of the previous civilizations we have discussed, a source of water was\nimportant for the development of the early Chinese civilizations. The Yellow River area\nbecame the cradle of Chinese civilization. The name Yellow River is derived from the tint\nthe river has from carrying a very fertile soil called Loess. Though the river provided the\nnecessary means for the people of China to create a strong agricultural economy, it was\nalso sometimes a problem: in China the Yellow River is considered “China’s Sorrow”\nbecause of the frequent floods that devastate the fields. Rainfall in the Yellow River\nvalley was so plentiful that the construction of dikes and other means for dredging the\nplains were required to prevent disaster. Yet the harvests the people in early China were\nable to obtain along the Yellow River allowed for the development of societies in early\nChina starting around 5000 BCE.\nXia, Shang and Zhou Dynasties of Early China\nThe earliest Neolithic society in China emerged around 5000 BCE and was called the\nYangshao society; it was located in the middle region of the Yellow River (Huang He.) In\n1952 a city of the Yangshao period was excavated near the modern Chinese city of Xian.\nThis ancient Chinese city was known as Banpo, and we have archaeological evidence for\nthe emergence of many cities like Banpo along the Yellow and the Yangtze River during\nthat period. Between 5000 and 3000 BCE the Yangshao society flourished, and with the\nsuccess of agriculture the population in the region grew exponentially. As was the case in\nmany other civilizations, the growth of population probably resulted in the necessity for a\nstrong authoritative order to organize public works. According to some sources there\nexisted three ancient Chinese dynasties that helped organize China into a more successful\ncivilization. The Xia, Shang, and Zhou dynasties each ruled over some territory around\nthe Yellow and Yangtze River areas.\n26 The first of the three dynasties to emerge in China was the Xia dynasty. It evolved\naround 2200 BCE. Kings ruled over the region and the throne would be passed down\nwithin the royal family, usually to the son. This form of hereditary monarchy established\nby the Xia dynasty became the example for future dynasties to follow. Ancient Chinese\nlegend tells us about a sage-king named Yu, and how he initiated projects to help control\nthe rivers and their disastrous floods. Little is really known about the Xia dynasty;\ncurrently excavations in China are slowly unearthing possible Xia dynasty sites. What is\nknown is that the Xia dynasty was gradually replaced by the Shang dynasty, which in turn\nruled from 1766 to 1122 BCE.\nMore is known about the Shang dynasty than about the Xia because in addition to\nthe archaeological sites and artifacts we also have writings belonging to this period. The\nShang dynasty came to dominate the earlier Xia dynasty mostly because the Shang rulers\nhad access to bronze weaponry, which was a technology brought by Indo-European\nmigrants from Southwest Asia to China. Other advancements like the chariot, wagons,\ncarts, and other wheel-based transportation came to China also through this migration; we\nbelieve the Chinese words for wheels and chariots are similar to Indo-European words.\nThe Shang dynasty made good use of the bronze weapons and chariots, which were very\npowerful and disastrous for the enemy forces, and which allowed the Shang to expand\ntheir control of the Yellow River valley. The new territories acquired by the Shang\ndynasty provided the rulers with an agricultural surplus, which was used mostly towards\nimprovements of the military and for personal interests of the rulers. One such interest\nwas to keep political allies pleased, a crucial part of Shang dominance as the Shang\ndynasty did not establish a centralized government and instead relied on allies like local\nrulers in towns or villages to rule on their behalf. Written evidence states that the Shang\ndynasty had at least 6 different capital cities during its existence; we have found\narchaeological evidence of two capital cities of the Shang dynasty with more excavations\nunder way. These two cities were called Ao and Yin, each possessing unique\nconstructions or remains. The city of Ao for example had a remarkable city wall which\nwas at certain points 66 feet thick in diameter.\nAt Yin archaeologists discovered remains of royal palaces and royal tombs.\nThough most of the tombs had already been raided in ancient times, there remained\n27 enough evidence in these Shang tombs to understand what went into them when they\nwere built. The graves sometimes contained chariots, weaponry, pottery, bronze goods,\ndogs, horses, and even human corpses. One grave discovered had the remains of over 300\npeople. One tomb became famous because it remained undiscovered and untouched by\ngrave robbers for almost 3000 years. In 1976 archaeologists discovered this ancient tomb,\nwhich belonged to Fu Hao, the wife of a Shang ruler. She died around 1250 BCE and in\nher tomb many precious items were found, clearly indicating that Fu Hao was the favorite\nwife of a powerful ruler, probably King Wu Ding. Along with six dogs, sixteen human\nbeings had been sacrificed. It seems that these human sacrifices followed a hierarchy.\nClose members of the family of Fu Hao were buried close to her corpse, which was\nlocated in the lowest part of the tomb. These close relatives seem to have died without a\nstruggle, and they were found with their bodies intact. Most of the victims were found\nnearer to the top of the tomb: these were mostly young males between around 15 to 35\nyears old, and a few children. Most of them have been decapitated, and the fact that their\nhands seem to have been tied together indicates that they were unwilling victims.\nPresumably these victims were prisoners from enemy states.\nThe Shang dynasty was followed by the Zhou dynasty when in 1166 BCE the last\nking of the Shang dynasty was killed and replaced by Zhou authorities. The Zhou rulers\nwere in charge of Northern and Central China officially until 256 BCE. The Zhou\ndynasty influenced Chinese political thinking for many centuries. For example, according\nto the Zhou dynasty the rulers received the right to govern from heaven. This theory was\ncalled “The Mandate of Heaven.” It explains that the ruler must deserve to rule, and he is\nseen as a connection between earth and heaven. These Chinese rulers had to rule to a\nstandard and if they failed to do so, chaos and imbalance of the cosmos would follow as\nheaven would pass the right to rule to another deserving ruler. This helped the Zhou kings\nto acquire legitimacy as the rightful rulers in the eyes of an ever increasing population, as\ntheir territory was larger than the Shang dynasty’s before. The territory in fact was so\nlarge that it could not be governed by a centralized government in the capital city of the\nZhou dynasty, called Hao, nor from any other capital. The solution was that the Zhou\nkings ruled through the use of a decentralized form of government in which they gave\nterritories to subordinates, usually relatives and sometimes allies, who governed these\n28 regions under their supervision, while paying tribute and providing soldiers if the king\nwanted them for a campaign. These subordinate rulers of the Zhou kings gradually\nignored the duty and obligation to pay tribute or to provide military support to the king.\nThe spread of ironworking around 1000 BCE also gave these subordinates weapons to\nchallenge the Zhou kings. Because iron ore was cheaper and more plentiful than copper\nand tin in China, and because iron was stronger than bronze, it proved to be the perfect\nmaterial with which to build weapons.\nIn 771 BCE nomadic peoples came to China from the west. Because the\nsubordinate rulers refused to help the Zhou kings defend their land, these nomadic\ninvaders conquered the Zhou capital city of Hao. This loss forced the Zhou king to move\neastward to Luoyang. As a consequence the Zhou dynasty lost its authority and thus\ncontrol of northern and central China. By the 5th century BCE these former Zhou\nsubordinates made themselves local leaders and began to fight against each other, each\nlonging to create the next powerful kingdom in China. The two centuries between 403\nand 221 BCE are referred to as “The Period of the Warring States” in China because these\nleaders fought intensively and violently against each other. In 256 BCE the last king of\nthe Zhou dynasty had to leave the throne and pass it on to the king of one of the regional\nkingdoms, the kingdom of Qin. In 221 BCE the ruler of Qin unified China through\nconquest and officially established a central government, founding the Qin dynasty.\nChinese Society\nLike many other civilizations in the ancient world, the success of agriculture allowed for\nthe accumulation of wealth. Gradually, as had happened in Egypt and Mesopotamia,\nsocial classes would evolve in ancient China. During the Xia, Shang, and Zhou dynasties\nwe find the royal family and related or allied noble families at the top of society. The elite\nhad bigger houses to live in, made out of pounded earth, while they consumed and\naccumulated the goods provided by their subjects. The distinction between the elite and\ncommoners can also be seen in the households themselves. In the wealthy houses the elite\nwas able to use bronze for pots, wine cups, jars, dishes, mirrors etc., while the common\npeople used items made out of clay, since they could not afford bronze, a rare and\n29 expensive alloy in China. Excellent artisans with incredible skill finely detailed and\npurposely designed impressive ornaments on the bronze utensils of the royal families.\nTrade in China was limited during the early developmental period of Chinese\ncivilization. Long distant trade routes existed during the Xia and Shang dynasties; this is\nimpressive since desert, tall mountains, or the sea surrounded the territories these\ndynasties commanded. On the sea, ships were propelled with oars until around 500 BCE\nwhen sails started coming into use. During the Xia dynasty sea-trade was limited to off-\nshore islands; under the Shang dynasty the trade connections were extended to the\nKorean peninsula. It was under the Zhou that the use of ships for sailing became so\ncommon that Chinese mariners learned how to navigate by using the stars and planets.\nThe use of sailing helped bring many goods into China. A majority of goods in China\nitself was produced through agriculture and thus a majority of the population was\ninvolved in farming. The peasants did not own land but were able to work on land owned\nby others, often the elite, in exchange for performing military service or for providing\nagricultural and other kinds of labor.\nThroughout China the family became a very important aspect in society. Though\nthis was the case in just about all civilizations of the ancient world, in China we see the\nfamily becoming even more important. The reason for this is the influence of the\nveneration of ancestors, which began in China in Neolithic times before the Xia dynasty\nappeared. We can see this in evidence found in excavated grave sites of early Chinese\npeople, which exhibit a very well-maintained appearance with kept memorabilia of the\ndeceased ancestors. The background for this practice was the belief that the ancestors\npassed on to another form of existence from where they could take care of their\ndescendants if those same descendants were to treat them properly. Thus it became\ncommon for descendants to offer sacrifices of food and drink at the graves or to bury\ngoods along with the deceased. In addition, this strong belief in the presence of ancestors\nled to a strong bond between all family members: the living, the dead, and future\ngenerations were seen as being responsible for the prosperity of the family.\nThe head of the family was the father or eldest male member of the family. His\nrole in family and society was very important since ancient China lacked both organized\nreligion and official religious professionals. Thus the father of the family was expected to\n30 conduct rituals during ceremonies honoring the ancestors and other relatives. Also the\nearly Chinese did not recognize a personal supreme god or goddess who would care for\nhuman affairs; instead they acknowledged an impersonal heavenly power called “Tian”:\nheaven.\nEarly civilizations usually became patriarchal; occasionally women played an\nimportant role in these early civilizations, but it seems only if allowed by men to do so. In\nearly China we find evidence of some hint of female power, such as lineage being traced\nthrough the mother’s side. With the growth of the states in China due to military power,\nmen increasingly put women into the shadows. Later this pattern automatically reinforced\nitself because the families would honor mainly male ancestors who performed notable\nand famous deeds. After the Shang dynasty, women no longer played any formal role in\npublic life in Chinese society.\nEarly Chinese Writing\nWriting was presumably first used in China during the Shang dynasty. In other\ncivilizations traders usually invented and used writing systems first to take notice of\nimported and exported goods. In China, however, it seems that the leaders were the first\nto use writing, which appeared after 2000 BCE. Early scribes for the Shang dynasty\nprobably wrote on bamboo or silk, and unfortunately almost all these organic materials\ndecomposed and are gone. Fortunately for historians, early Chinese writing does survive\non artifacts called oracle bones, because the Chinese believed that they could use animal\nbones in a specific ritual in order to predict the future. It was common in ancient\ncivilizations for people to attempt to predict the future, whether through examination of\nthe entrails of sacrificed animals, or the flight patterns of birds, and even the stars.\nChinese rulers had questions about the future inscribed onto the shoulder blades of cattle.\nInterpreters then used heated metal rods to produce cracks in the bones, and helped the\nking to divine answers to the questions based on the shape and location of these cracks.\nThese Chinese fortunetellers used an organized system of pictographic symbols. The\nsymbol for the word “fish” for example would look like a fish, and so on. In order to get\na meaning of something abstract they combined pictographs. For example the word\n31 “good” is an abstract because it is not a material thing. The early Chinese combined the\npictographs of “mother” and of “child”, which together meant “good.” Soon after writing\nappeared in China, it ceased to be an exclusive art used by the rulers and was put to other\nuses. During the Zhou dynasty writing was used to create books of poetry, history,\nphilosophy, and other works.\nConclusion\nThe emergence of the early Chinese societies in the latter half of the Neolithic period\ncreated a unique civilization. No organized religion appeared in this region of the ancient\nworld. The veneration of the ancestors became a concept original to Chinese civilization,\nwhich allowed for the growth of closely-bonded families. The use of writing also had a\nunique history as the early Chinese used writing for more complex purposes than simple\nrecord keeping. The graves of these early Chinese show a gap between the rich elite and\ncommon people.\nThe influence of the early Chinese people made its way south towards the Yangtze\nRiver. The Yangtze unlike the Yellow River brought no disastrous floods and allowed for\nincreased agricultural output. In the southern climate of China a moister subtropical\nenvironment allowed for rice to be the plant of choice, which helped the expansion of the\nChinese civilization. In the valley of the Yangtze River, agricultural surplus led to an\nincrease in population and the development of cities, states, and complex societies.\nThe China that would emerge after the devastating period of chaos called “The\nPeriod of the Warring States” would become the sole power in East Asia for centuries to\ncome.\n32 4. Early India\nIntroduction\nThe sub-continent of India has a unique history of civilizations that built powerful\nempires. In the process, they also laid the foundations of future religions and philosophies\nin the region that are still recognized in modern times. Through foreign encounters the\npeople of these ancient Indian civilizations would continually adapt and grow. Many of\ntheir advances in the sciences, languages and social understanding had an enormous\nimpact on later civilizations.\nHarappan Society\nLike the early civilizations of Mesopotamia and Egypt, the early Indian civilization could\nnot have existed without a source of fresh water. The Indian sub-continent had a great\nsource of water and fertile land in the area known as the Indus River Valley, where the\nearly Indian civilizations originated. One of the first civilizations to evolve around 3000\nBCE along the fertile land of the Indus River was the Harappan society, named after one\nof the main cities of their society called Harappa. The Indus River provided fresh water\nfor irrigation of fields in the area, permitting the inhabitants to develop agriculture and\ncreate a surplus of food, thus allowing for growth and establishment of cities. Very little\nis known about the Harappan society due to two factors: firstly, many of the Harappan\nsites are now under the running Indus River; secondly, the script of this society has yet to\nbe deciphered, which means that any surviving writing we possess cannot be read. Thus\nthe only data we possess on the Harappan society are from material evidence like pottery\nand tools. Like the Nile River in Egypt, the Indus River was at the center of life of these\nHarappan people. Every year, the melting of the snow in the mountains of the Hindu-\nKush and the Himalayas caused the Indus River to flood, carrying with it rich soil from\nthe mountains. Thus the river made productive agriculture in northern India possible; it\nsupported a surplus of agricultural products and thus an increase in population, and the\nsubsequent construction of cities marked the birth of civilization in the region around\n33 3000 BCE. Another major city during the Harappan society period after 3000 BCE was\nMohenjodaro.\nThe Harappan society was located over much of what is now Pakistan and\nNorthern India. The Harappan cities like Mohenjodaro had market places, temples and\nbroad streets. Much of the aspect of daily life for the people of the Harappan society was\nstandardized; for example the size of bricks is the same throughout the cities. The people\nof the Harappan society also engaged in trade with foreigners as far as Mesopotamia,\nwhich resulted in the Harappan Society becoming wealthy, as did the Mesopotamians and\nEgyptians. During the climax of their culture, around 2500-2000 BCE, around 40,000\npeople populated the city of Mohenjodaro, an enormous number for that time period.\nSpecialized labor existed as well: gold smithing, pottery making, weaving, and masonry\nwere practiced in the cities’ many shops. The result of these trades led to more wealth for\nthe people of the Harappan society and thus the division into social classes. The evidence\nfor the existence of social classes in Harappan society is to be found in the size of the\nhouses: many people lived in one room apartments in barrack-like constructions which\nwere obviously for the poor; in contrast the wealthiest lived in very large houses with\ndozens of rooms, while the majority had modest houses with one or two stories.\nUnfortunately, since the script of this society has yet to be deciphered, we still await more\ninformation about their way of life beyond what we already know. One unique piece of\nart from the Harappan society, found during the excavation of Mohenjodaro, is the\n“dancing girl.” Although the name of the statuette is the “dancing girl,” we are not sure if\nshe really is dancing. It is evident that she is naked; thus the statue probably served a\nfertility and/or religious function, much like the many other “Venus statues” we have\nfound in many places around the globe.\nThe end of the Harappan society appears to be mysterious; it did not end abruptly\nbut rather experienced a slow decline beginning around 1900 BCE. Evidence points to\nmany people abandoning their cities for reasons that we can only speculate upon. Climate\nchange leading to problems in agriculture seems to be one likely cause as to why people\nwould abandon their cities. The Harappan society also contributed itself to its own end:\nthe people destroyed many of their forests (deforestation) which turned the lush Indus\nriver valley into practically a desert, with lingering effects on modern day agriculture in\n34 the region, which can only exist through artificial irrigation. On top of climate change the\nHarappan society also experienced natural catastrophes like floods and earthquakes,\nwhich might have contributed to the fact that the Harappan people left their cities rather\nquickly around 1700 BCE. During the excavation of Mohenjodaro archaeologists found\nunburied remains of people who probably could not escape, an observation which only\nfurther provides evidence for a natural disaster as the cause of this civilization’s collapse.\nFew believe that a military campaign by foreigners took place; there is no material\nevidence that would indicate a battle of any kind. After the Harappan society abandoned\nits cities it did not disappear, as many of its aspects were absorbed by other Indian\nsocieties.\nThe Arrival of the Indo-Europeans (Aryans)\nDuring the decline of the Harappan society after 1900 BCE foreign people began to\nmigrate from Eastern Europe to the Indian subcontinent. The most prominent of these\nforeign people were called the Aryans, which translated means “noble people.” The\nAryans spoke an Indo-European language. Around 1500 BCE we can find evidence of\ntheir settlements around the Hindu-Kush and Northern Indian regions. The Aryans did\nnot arrive in India by invading the region in one massive push, but rather slowly over\ncenturies. There is no evidence that the Aryans destroyed the Harappan society. After\n1500 BCE the Indo-European immigrants (including the Aryans) and the local people of\nthe Indus River Valley interacted on all levels. The Aryans were different from the local\npopulation in respect to their daily life: the Aryans were still nomadic people, relying\nmostly on cattle and horses while the locals practiced agriculture. The Aryans consumed\ndairy products and beef since at this time cattle were not yet considered sacred and\nprotected animals. The early Aryans composed religious and literary works, but they did\nnot write them down; they memorized these works and transmitted them orally from\ngeneration to generation in their sacred language, Sanskrit. The early Aryans had an\neveryday language as well called Prakrit, which would later evolve into Hindi, Bengali,\nUrdu and other languages spoken in the northern Indian subcontinent. The earliest of the\norally transmitted works of the Aryans are called the Vedas, songs of prayers and hymns\n35 to honor their gods. We know about the Vedas because later religious professionals wrote\nthem down, around 600 BCE. The Vedas are important in order to understand early\nIndian society and the history of India. Usually scholars call the period between 1500 and\n500 BCE “the Vedic Age”, showing the importance of these texts. From the Vedas we\nlearn that the early Aryans sometimes clashed with the local people called the Dravidians;\nnormally however the Aryans and the Indo-Europeans in general had peaceful relations\nwith their neighbors. The Aryans also fought each other constantly as they were not a\nunified people with a unified state; rather, they had a tribal organization consisting of\nmany independent chiefdoms. The Aryans first settled in the Punjab located around the\nIndus River valley in northern India around 1500 BCE and slowly spread on to the east\nand south. After 1000 BCE the Aryans began to settle between the Himalayas and the\nGanges River. With the beginning of the Iron Age in India, around 1200-1100 BCE, the\nAryans began to make iron tools; this new technology allowed for their population to\nincrease. The Aryans would push into India until 500 BCE when they reached the Deccan\nplateau. The chiefdoms of the early Aryans would develop into small kingdoms governed\nby local kings, and only after 400 BCE do we find an Indian state which reached the size\nof the Harappan society.\nAryan Social Order\nDespite the fact that the Aryans did not establish a large unified state, they were able to\nachieve social order. Since there was no central authority or even a unified state another\ninstrument was needed to create stability. A sharp social distinction existed in the Aryan\nsociety that was based on heritage; individuals or groups belonged to a certain social\nclass according to their birth, occupation and roles in society. This Aryan social system\nbecame the foundation of the caste system in India. The term “caste” goes back to the\nPortuguese word “casta”, which is a term describing a social class established by birth.\nThe Portuguese merchants who came in contact with India during the 16th century CE\nused their words to describe what they saw: the sharp distinction between social classes.\nObviously this social class system was developed over time and was not suddenly\nimposed by the Aryans. It seems likely that after the migration to the Indus river valley,\n36 the frequent conflicts with the Dravidians urged the Aryans to make clear social\ndistinctions in order to create a line between them and the local population. We believe\nthis because the Aryans used a specific term to describe social class: “Varna”- the\nSanskrit word meaning “color.” We conclude that the Aryans based their social\ndistinctions on the color of peoples’ skin, especially since the Aryans referred to\nthemselves as the “wheat-colored” in contrast to the darker-skinned Dravidians.\nGradually the Aryans and the Dravidians mixed, and distinctions between the two could\nno longer be made easily after the Aryans settled in the Indian sub-continent. After 1000\nBCE, in the late Vedic age, the Aryans had mainly four main social classes, or Varnas.\nThey consisted of:\nBrahmins The religious officials or priests\nKshatriyas The aristocrats and warriors\nVaishas They included cultivators, artisans and merchants\nShudras The landless peasants, serfs.\nAfter a couple hundred of years a fifth class of the so-called “Untouchables” was added\nto indicate the people who had to perform what were then considered to be dirty and\nunpleasant tasks. The work these Untouchables had to perform was regarded as being so\ndirty that the mere touch of one of the members of this class was believed to defile\npersons of higher status.\nAfter 600 BCE the Aryans needed a more sophisticated system to describe their\nsocieties. The result was the development of sub-castes called Jati. Later, thousands of\nthese sub-castes existed; they determined the life of the individual Indian for many years\nsince these Jati demanded, for example, marriage within individual Jati. The system of\nthese sub-castes was not unchangeable and social mobility was possible, which explains\nwhy this system was not gradually abolished.\nAlong with clear social distinction the Aryans had a strict gender distinction, as they\nbelonged to a strong patriarchal society. Thus, as in Mesopotamia, Egypt and other early\ncivilizations, we find a male authoritative presence in India. One custom during the Vedic\nage in India was called “Sati”; a widow was expected to follow her deceased husband\n37 onto the funeral pyre, thus showing her total dependence on her husband. This ritual,\nhowever, would never become a widely practiced custom in India.\nAryan Religion\nThe religion of the Aryans and their successors was polytheistic. Among the Aryan gods\nIndra was the most powerful of them all. He is foremost a god of war who likes violence\nand strong drink. What is unusual is despite the prominence accorded to violence and\nrough behavior, the Aryans also had a god overlooking ethics among people. The god\nVaruna was seen as responsible for punishing evildoers and rewarding virtuous people,\nby throwing evil people into a dark subterranean place called the “House of Clay” and by\nletting the virtuous into a realm called the “World of the Fathers”, the Aryan version of\nheaven. The religious activity of the Aryans was based on an elaborate system of rituals.\nDuring some of these rituals sometimes hundreds of animals had to be sacrificed. These\nsacrifices were intended to please the gods who in return were believed to support the\nAryans on military campaigns.\nThe constant pleasing of the gods was time-consuming and expensive. The\nBrahmins sometimes had to perform five sacrifices per day for an individual household.\nAfter centuries the sacrifices and rituals became somewhat mechanical, and many people\nwere not satisfied anymore with these religious practices. Around 800 BCE individuals\nbegan to leave their homes and live as hermits along the Ganges River. There they\nreflected on the relationship between humans and gods. Soon they would gather students\naround them who were interested in finding the truth through spirituality. This new\ngeneration of religious men adapted beliefs of the local Dravidian people, who\nworshipped nature spirits and who believed that the human soul returned to the world in a\nnew physical form after death, whether in plants, animals, or other humans. This idea of\ntransmigration and reincarnation of the soul was very influential since it stimulated even\nmore thinking about religion and about the things that relate to our souls. The evidence of\nthis is found in texts called “Upanishads”, composed between around 800 to 400 BCE, in\nthe late Vedic age. Upanishad literally translates as “sitting in front of” which refers to\nthe sitting of students in front of a wise man or sage with whom they would discuss\n38 religious issues. The Upanishads taught that human beings are not separate beings but are\ninstead part of a universal soul called Brahman. The Brahman is believed to exist forever\nand to never change, whereas our world, the physical world, will always change. All\nthings in the physical world come from the Brahman and it is the goal of the human soul\nto return to the Brahman.\nThe idea of transmigration and reincarnation of the soul is explained in different\nways, as one way of teaching is different from the other. For example one way to explain\nthe migration of the soul is called Karma. Karma explains why certain souls are\nreincarnated as certain beings. According to this explanation, virtuous people would be\nreborn into a purer and better existence or higher caste. Others who were not so virtuous\nwould be “downgraded” into a more difficult existence or lower caste. In general, being\npart of this cycle of birth, death, and rebirth was seen as painful according to the\nUpanishads; humans needed to escape this circle. The way to escape the cycle of\nreincarnation while still alive was through achieving a state of mind called Moksha,\nwhich is described as a deep dreamless sleep while being awake. To reach Moksha all\nconnections to the physical world needed to be cut. Asceticism and meditation were\nnecessary, meaning one had to live an absolute simple life without any comfort, and one\nhad to practice yoga, which is an intense disciplined meditation through motion. People\nthought that the human soul could get out of the circle of reincarnation and be united with\nthe Brahman through this very hard and difficult way of living.\nAn interesting theory claims that this explanation of the reincarnation of the soul\nwas designed by the ruling elite to keep everyone under their rule. Nobody would fight\nagainst the elite if everyone, especially members of the lower castes, believed that they\nwere in that caste because of wrongdoings in their past life, not because of bad\ngovernment. Yet evidence supporting this theory is limited. The Upanishads, however,\nwere very influential, not only in India and its later major religions like Jainism,\nBuddhism and Hinduism, but also on Greek philosophers and Muslim thinkers. The claim\nthat the soul would be reincarnated demanded respect for all living things, animals as\nwell as humans. Necessarily, a vegetarian diet was common for all those who followed an\nascetic lifestyle as described by these teachings.\n39 Conclusion\nOur knowledge of the early Indian civilizations is mostly based on material evidence\nsince we lack written sources. Thus our understanding of early Indian civilizations is\nlimited. There is still much we have to learn about the migration of the Indo-Europeans,\nincluding the Aryans, to India. They have been abused in modern history as an example\nof an elite race although they were among many foreign peoples who migrated to India\nand helped to build the foundation of many customs in India, the Punjab, Pakistan, and\nBangladesh. The Indo-European language gave way to modern languages of the region as\nwell. The accomplishments of these civilizations were not physical monuments, like\nthose in Egypt, or empires like those of Mesopotamia. Instead, the early Indian\ncivilizations are especially noteworthy because of their accomplishments in thought and\nsocial order, all of which functioned without a centralized government, which was\nessential in other areas of the world for civilizations to grow.\n40 5. Early Americas\nIntroduction\nWhen exactly the first people arrived in the Americas is uncertain. It happened before\n15,000 BCE, probably many thousands of years earlier. At the end of the last Ice Age\npeople coming from Siberia had probably already crossed the Bering Strait into modern\nday Alaska. These early people were hunters and gatherers and moved along with the\ngame they hunted. Around 8000 BCE these hunters and gatherers became so efficient at\nhunting that large animals became scarce. For example, by 7500 BCE some animals like\nthe American horse were hunted to extinction. These people needed to find new ways to\nfeed themselves, and they gradually began to fish and farm. Later, productive agriculture\nled to the evolution of complex societies in the Americas.\nThe area between modern day Mexico to Honduras and El Salvador is called\nMesoamerica. Within Mesoamerica, agricultural crops like beans, chili peppers,\navocados, etc. were first cultivated by the region’s inhabitants between 8000 and 7000\nBCE. Around 4000 BCE Maize (corn) became the dominant crop grown in Mesoamerica,\nalong with tomatoes somewhat later. By 2000 BCE agriculture had spread to all parts of\nMesoamerica. No large animals, however, were domesticated in Mesoamerica. The\nreason why no wheeled vehicles were used in Mesoamerica is to be found here: there\nwere no domesticated animals capable of pulling them.\nBetween 1200 and 1000 BCE large ceremonial centers emerged in these\nagricultural societies of Mesoamerica. These centers contained structures like pyramids,\ntemples and palaces. They did not replace the agricultural villages, both existed next to\none another. Within these ceremonial centers lived some permanent residents such as\npriests, rulers and some artisans or craftsmen. Occasionally on festive days the people\nliving in the nearby villages would gather in these centers of ceremony, but would return\nto their homes after the festivals ended. The earliest of these ceremonial centers that we\nknow of is found near the modern city of Veracruz near the Gulf of Mexico, where\naround 1200 BCE San Lorenzo became the earliest ceremonial center of the first\ncivilization we will discuss in Mesoamerica.\n41 The Olmec Civilization\nThe Olmec civilization formed around 1200 BCE. San Lorenzo was its capital until 800\nBCE. Then the capital was moved to La Venta, which remained the capital for another\n400 years (800-400 BCE) until a third capital was established at Tres Zapotes (400-100\nBCE). The name Olmec in translation means “rubber-people” because of the abundance\nof rubber trees found in the region. Historians gave these people the name Olmecs; it is\nnot the term that they actually used themselves. The heartland of the Olmec civilization\nreceived an adequate amount of rainfall so that no artificial irrigation systems were\nneeded for agriculture. Rather the opposite was the case: the problem was not bringing\nwater to the crops but removing excess water. The Olmecs required vast drainage systems\nto remove unneeded water to prevent the flooding of the crops. In fact, the drainage\nsystems of the Olmec became so effective that some are still in use to this day.\nThe drainage systems of the Olmecs, like many of the complex structures of the\ncenters, were all built by the common subjects living in the villages surrounding the\nceremonial centers. These were mostly farmers who usually had to provide agricultural\nproducts to the elite living in the centers. In these Olmec centers we often find temples,\npyramids, altars and tombs, all built by these subjects as well as skilled artisans who\ncreated ornaments. The most famous of Olmec artifacts are the monumental Olmec stone\nheads, carved out of basalt rock. These stone heads stood roughly 10 feet tall (or 3\nmeters) and weighed around 20 tons, all made by hand with simple stone tools and\nmoved on rafts by the hands of thousands of subjects to the desired destination. With no\nwheeled vehicles or big animals to pull these heads or other stone works, the Olmecs\nrelied upon the combined work force of the community of subjects.\nThe Olmecs expanded their influence in two ways: military power and trade. At\nthe peak of Olmec rule their influence reached modern day Honduras and Guatemala. It\nshould be noted that the Olmecs did not possess the technology to create alloys like\nbronze to use for tools. Instead they relied heavily on the volcanic rock obsidian found\noften in Mesoamerica.\nThanks in part to the discovery of pieces of art created by the Olmecs, we are able\nto learn about certain aspects of their society. For example, some statues show men with\n42 elongated skulls. It seems that the Olmecs practiced skull deformation through artificial\nmeans; they used force on the skulls of newborns and children to achieve this desired\nelongated skull. The Mayas would later use this technique for artificial skull elongation\nonly on noble children.\nHow the Olmec civilization ended is one of the mysteries of history.\nArchaeologists discovered that somewhere around 500 BCE the ceremonial centers of La\nVenta and San Lorenzo were destroyed and subsequently abandoned. Little of the\nsurviving evidence shows signs of invaders, but it is possible that the people revolted and\nthat the Olmecs deliberately destroyed their centers. By 400 BCE the dominance of the\nOlmecs waned and faded into the shadows of other civilizations of Mesoamerica. The\nOlmec civilization influenced later civilizations in Mesoamerica heavily by providing\nthem with accomplishments that these successors adopted, such as the cultivation of corn,\nthe ceremonial centers with pyramids, temples, and palaces, the idea of calendars, ball\ngames, and human sacrifice. Around 100 BCE the Olmecs disappeared.\nThe Mayas\nAround 100 BCE the population of Mesoamerica increased, and ceremonial centers\nappeared in regions far from the Olmec heartland. Real cities also appeared because now\npeople permanently settled down around these centers, building off of them. The\nimmediate successors of the Olmecs were the Mayas. Their territory consisted of regions\nlocated in modern Southern Mexico, Guatemala, Belize, Honduras, and El Salvador.\nBetween 300 and 200 BCE there were Mayan villages with permanent residents in what\nis now Guatemala. The first ceremonial center, Kaminaljuyu, evolved where modern\nGuatemala City is now located. Kaminaljuyu remained an influential city until around\n400 CE when it came under the dominance of Theotihuacan in central Mexico. After 400\nCE the Mayans occupied territory which soon lost its fertility. The Mayas solved this\nproblem by building terraces for farming. They placed these farm terraces along rivers,\nwhich passed through them, leaving behind fertile soil. The Mayas harvested mostly\ncorn, but also cultivated cotton, which they used largely to make textiles. These Mayan\ntextiles became a popular trading good throughout the rest of Mesoamerica. The Mayas\n43 also grew cacao, the large bean which only the noble elites used for drinking and chewing\nbecause it was a very valuable commodity for the Mayas.\nBetween the 4th and 9th century CE the Mayan city of Tikal was the most\nimportant city, reaching its peak of wealth and population between 600 and 800 CE. At\nthat time nearly 40,000 people lived in the city. Tikal had temples, pyramids, paved\nplazas, and palaces. The temple of the giant jaguar in Tikal stands 154 feet tall and is a\npyramid structure. It symbolized Tikal’s dominance over the surrounding region, in\nwhich up to 500,000 people lived. Alongside Tikal there existed other cities, which\nformed the center of local Mayan city-kingdoms. The local Mayan kingdoms fought\nconstantly against each other. For the Mayas the winning city would usually be expected\nto destroy the conquered peoples. It was honorable for a Mayan warrior to bring back\ncaptives to his city and show them off. Sometimes high-ranking captives were kept alive\nfor years as a kind of living trophy. In the end, however, the captives usually became\nslaves and were offered as sacrificial victims to the Mayan gods.\nThe constant fighting between cities prevented the Mayas from organizing a larger\nunited authority and central government like other civilizations did before. However,\naround the 9th century CE Chichen Itza, the Mayan center on the Mexican peninsula of\nYucatan, began to establish a more unified Mayan society. Captives were integrated into\nChichen Itza society rather than sacrificed. Between the 9th and 11th centuries CE Chichen\nItza was able to organize a loose empire, integrating other Mayan city centers in Yucatan.\nHowever, the Mayan centers outside of the Yucatan peninsula were already facing\ndecline, which had set in around 800 CE. Within a little more than one century all these\nMayan centers vanished. The reasons for this decline are not exactly known, but\npossibilities include invasion by foreigners, internal civil strife, ecological problems due\nto deforestation, earthquakes etc., many of which may have operated together. Whatever\nthe reasons were, the Mayas outside of Yucatan left their cities, and trading between these\ncenters ended. Slowly the jungle consumed what remained of these Mayan city centers.\n44 Mayan Beliefs\nRituals played an important part in Mayan religion and society. The Mayas, like other\ncivilizations, created a myth explaining how everything came to be on earth, a so-called\ncreation myth, which the Mayas called Popol Vuh. Here the Mayas expressed their belief\nthat the gods had created humans out of maize (corn) and water, which became flesh and\nblood. Mayan priests thought that the gods had to be pleased so that they would continue\nto sustain the agricultural cycle and keep life going. The way the Mayas sought to please\nthe gods was through the sacrifice of human beings. Blood was essential to the sacrifice;\nthe Mayas thought that shedding blood would make the gods pour rain for the all-\nimportant corn. Thus for the Mayas it was necessary to get as much blood from the\nvictim as possible. They would, for example, cut off fingertips before decapitating their\nhuman sacrificial victims. Most of these victims were war captives. The Mayas also\ninflicted wounds on themselves in order to shed ritual blood. This informs us that the\nMayan rituals were a necessity according to their beliefs and were not simply acts of\ncruelty towards captives.\nOther important features and achievements of Mayan society were the ball games\nand the calendar. The Mayan priests created the most elaborate calendar of the ancient\nAmericas. This calendar is based on two cycles: the solar year, which consists of 365\ndays, and a year of 260 days based on Mayan rituals. After 52 years both cycles would\nreturn to their starting point simultaneously. The interpretation of the calendar was an\nimportant task of the priests, who had to figure out the possibilities and dangers each day\nwould bring. It is thought that the Mayas patterned their calendar after the calendar of the\nOlmecs.\nThe Mayas inherited from the Olmecs a ball game, which grew in popularity\nunder the Mayan civilization. Almost every ceremonial center had a ball court paved with\nstones where players could play. The sport itself was played sometimes by two men\ncompeting against each other, and sometimes by teams of two or four. Players had to put\na ball through a ring onto a marker without using hands. The ball was around 20\ncentimeters in circumference (8 inches) and was made out of solid, baked rubber. As such\n45 the ball was very heavy and hard, and should not be compared with modern day soccer-\nor footballs. The sport was played for several reasons: for competitive sport between\nindividuals, sometimes for the sake of bets placed by the spectators or players, sometimes\nto celebrate a political agreement or treaty. Sometimes war captives of higher rank had to\nplay for their lives in public: the losers were sacrificed immediately after the match.\nAlongside some of these courts archaeologists found racks of skulls, most likely the\nheads of the losers.\nTeotihuacan Civilization\nThe Mayas were not the only heirs of the Olmecs in Mesoamerica. As mentioned earlier,\nthe Mayas flourished in Guatemala and in the lower parts of central Mexico, including\nthe Yucatan peninsula. Further north, in Mexico’s higher regions, the Teotihuacan\ncivilization developed. This area was for many centuries shaped by several lakes.\nHowever this valley in central Mexico has since lost these lakes because of changes in\nthe environment and drainage of the waters. During ancient times, however, this region\nhad a fresh supply of fish and water in abundance, and naturally people came there to\nsettle in the area.\nThe city of Teotihuacan was located 30 miles northeast of modern Mexico City.\nBy around 500 BCE Teotihuacan was a small agricultural village of a couple of hundred\ninhabitants, where people had settled permanently and diverted water from the lakes\nthrough channels onto their fields. Within 500 years the population would explode to\n50,000 inhabitants. Two major buildings dominated the city of Teotihuacan in 100 CE:\nthe Pyramids of the Sun and the Moon. It should be noted that these names were given to\nthe pyramids by the Aztecs who visited the place centuries after it had been deserted. We\nare not sure what the people of Teotihuacan called these pyramids; yet it is the Pyramid\nof the Sun that is the largest single building in Mesoamerica. The population of\nTeotihuacan grew even more so that between 400 and 600 CE the city had around\n200,000 inhabitants, making it a metropolis in ancient times, with temples, palaces, and\nsmall apartment complexes for the masses. We know little about the Teotihuacan society\nsince all written books were lost. What we do know we owe to their famous artifacts in\n46 pottery and obsidian. Trade was extensive between the Teotihuacan people and other\nMesoamerican societies. Most of the inhabitants worked on the fields surrounding\nTeotihuacan. Priests played an important role in the everyday lives of the people. Like the\nMayas the people of Teotihuacan adopted both the Olmec calendar and ball games.\nAround 500 CE a period of war with other people started, and by 650 CE the Teotihuacan\ncivilization had entered a period of decline. Shortly afterwards the city was sacked and\nburned to the ground, causing the loss of all written evidence.\nSouth American Civilizations\nMesoamerica was not the only region in the Western hemisphere to host the emergence of\ncivilizations. Hunters and gatherers came to the area south of Central America, towards\nthe Andes Mountains, around 12,000 BCE. These hunters and gatherers were most likely\nfollowing the migration of large animals, like the llamas and alpacas that they hunted.\nThe climate within the Andes was perfect for the natural harvesting of crops like wild\npotatoes. Around 8000 BCE the climate became harsher and drier, making the natural\nharvesting of crops difficult and forcing these hunters and gatherers to begin to settle\ndown and start farming. The population in the region grew as agriculture in the region\nflourished, and by 1000 BCE the civilization in the central Andes was comparable to the\nMesoamerican civilizations.\nWhat is interesting to note is that the Mesoamerican and the Andes civilizations\nevolved at the same time, but mostly independently of each other. The reason for this\nseparate evolution was the lack of vehicles and draft animals capable of connecting these\ncivilizations. However the cultivation of maize would eventually make its way to the\nAndes region, just as Andean techniques of gold, silver, and copper metallurgy would\nmake their way up north to Mesoamerica. Between 2500 and 2000 BCE permanent\nsettlements began emerging in the heartland of the Andes societies, which was located in\nmodern-day Bolivia and Peru. The Andean civilizations began cultivating crops like\nbeans, peanuts, and potatoes along with maize (corn) in the Andean dry highland using\nirrigation systems. After 2000 BCE the early Andes people also began to build temples,\npyramids, and pottery. After 1000 BCE a new organized religion appeared in the region\n47 called Chavin Cult, named after the city of Chavin de Huantar. As suddenly as this\nreligion appeared it disappeared, roughly around 300 BCE. Little is known about this\ncult, not even its proper name. What is known is that the city was a place that functioned\nas a ceremonial center for the people to gather and worship but was not a place of\npermanent residence like Teotihuacan.\nThe first real large cities, with populations of around 10,000 inhabitants appeared\nin the central Andes region around 200 BCE. These large populations needed\norganization. This led to the rise of regional states, which remained largely independent\nfrom each other. These early states appeared on the western side of the Andes Mountains,\nwhere each regional state contained economic zones producing goods which, when\ncombined, contributed to the economy of the whole region. The area by the ocean\nprovided a sustainable source of seafood using nets weaved out of cotton; the valleys of\nthe region cultivated the agricultural crops; and the Andes highland provided meat and\nwool from llamas and alpacas.\nThe success of these economic zones created wealthy regions; this is significant\nbecause this is the only place in the world where this style of economic system was\ndeveloped on purpose. Unfortunately we do not have any writings from this civilization.\nMost of our knowledge is based on material remains like the ruins of their cities, centers\nof worship and pieces of art. One regional state in particular produced many artifacts of\nbeauty and incredible detail. The state of Mochica existed around 300 to 700 CE in\nmodern day Peru and was named after the river which flows in the valley its people\ninhabited. The Moche state (also known as Mochica) was one of the most powerful states\nin the area. The art and ceramic works of these people depict heads of their civilization\nand scenes from everyday life with amazing detail.\nThere were quite a few regional states in Southern America, but no regional state\nwas able to dominate the others because of the geography of the area, which featured tall\nmountains separating the valleys.\n48 Conclusion\nThe separation and distances between cities made contact and unity very difficult in\nMesoamerica and the Andes region. The achievements of the region that stand out are the\ncalendars, the ball games and the religious beliefs. We still await more information\nbecause little is known, especially concerning the reasons why some civilizations\nabandoned their cities. The arrival of European colonists in the 15th century permanently\nchanged the western hemisphere thereafter.\n49 6. Classical Civilizations: Persia\nAfter the preceding survey of early civilizations and the first complex societies around\nthe world, we now turn to a period during which the so-called “Classical Societies” were\nfounded. This period is usually thought to have lasted 1000 years, from 500 BCE to 500\nCE. We once again move around the world and discuss the classical societies we find in\nPersia, China, India and Greece, as well as in neighboring regions.\nPersian Empire\nOf the empires that existed in the ancient world, few can be named great. The Persian\nEmpire is one of the greatest empires ever created. Persian history, however, is mired in a\nproblematic lack of information. Little is known about the ancient past of the Persians\nexcept from the written works of foreigners, often the enemies of the Persian kings.\nThe homeland of the Persians was in modern-day Iran. The ancient Persians were\nsemi-nomadic peoples that migrated to Iran around 1000 BCE, along with another group\ncalled the Medes; both peoples spoke an Indo-European language. These Persians were\nneither powerful nor stable enough to contend with the neighboring powers, the\nMesopotamian empires; in fact the Persians were dominated by the Mesopotamians and\nwere forced to pay tribute to them. The Mesopotamians also influenced the Persians on\nmany levels. The Persians had a society organized on tribal lines with an emphasis on\narchery and horseback riding. By the time the Mesopotamian empires began losing power\nthe Persians started gaining control and power within their heartland region.\nEarly Persian history is dominated by four dynasties. These carved out massive\nempires that eventually stretched from India in the east all the way to Egypt in the\nsouthwest and to Macedonia in the northwest.\n50 Achaemenid Dynasty\nCyrus the Great founded the Achaemenid dynasty. Little is actually known about how the\nPersians managed to transition from a tribal leadership to a dynastic system of rule. What\nwe know about early Persian history comes from second hand sources, for example\nJewish scriptures and the Old Testament of the Christian bible, and the work of the Greek\nhistoriographer Herodotus. In 559 BCE Cyrus was chosen to be the ruler of the Persians\nby the other tribal leaders; however the Medes who lived in the Iranian heartland with the\nPersians at that point dominated them and sought to limit their power. Cyrus and his\nPersian people rebelled against the Medes in 553 BCE and by 548 the Persians controlled\nthe entire heartland of Iran.\nThe Persians with Cyrus as their king now expanded further. To the west in Asia\nMinor (now modern day Turkey) was the Kingdom of Lydia. The kingdom of Lydia is\nvery likely home to the invention of coinage around 640 BCE. Before coins were used\npeople simply traded goods based upon their needs. With coins, trading became easier\nover long distances. Sometime after 546 BCE Cyrus and his Persian armies conquered\nthe kingdom of Lydia and brought the idea of coins to the Persian economic structure. For\nCyrus the greatest accomplishment was the conquest of Babylonia in 539 BCE. Not only\ndid Cyrus conquer the city of Babylon, but he also created a domino effect with the\nsurrounding small kingdoms in the region, taking them all under control after the fall of\nBabylon. Cyrus the Great conquered many regions and expanded the Persian kingdom,\nand he usually allowed the different customs of the conquered peoples to remain intact. In\nfact Cyrus was considered tolerant as he incorporated many of the customs of the\nconquered. One such example was the liberation of the Hebrew people from Babylon,\nwho had been taken as slaves by king Nebuchadnezzar earlier in the century. Cyrus\nallowed these Hebrews to resettle in their ancient homeland of Judea, and they gave\nthanks to Cyrus, calling him Messiah. After leading many successful military campaigns\nand after enjoying success in other projects, Cyrus was killed in 530 BCE while fighting\nnomads.\n51 After the death of Cyrus the Great, the Persian Empire went to Cyrus’ son\nCambyses, who ruled from 530-522 BCE. Cambyses is mostly remembered for the\nconquest of the Egyptian people. In 525, after years securing his power in his father’s\nempire, Cambyses led an expansion southward to Egypt where the Persians defeated the\nweakened Egyptians. According to foreign sources Cambyses went insane, even stabbing\na god-bull. The bull in Egyptian religion was a sacred animal, which was believed to be\nthe reincarnation of an Egyptian god.\nAccording to foreign sources, Cambyses became filled with paranoia towards the\nend of his life, which according to some questionable sources eventually led to the\nmurder of his own brother, whom he killed back in Persia because he feared a rebellion.\nCambyses may have been suffering from malaria, which he presumably contracted while\nhunting in the region (Egypt). In 522 BCE Cambyses died with no son and no brother to\ntake the throne, leaving a small legacy following the success of his father. Political\ninstability in the young Persian Empire was quick to follow Cambyses’ death. In the\nfollowing year the throne went to Darius.\nDarius the Great came to the Persian throne in 521 BCE and had a long reign\nlasting until 486 BCE. Under Darius the Persian Empire expanded to the Indus River\nvalley to the East and into Europe to the West, securing Persian influence through Asia\nMinor (modern day Turkey) and reaching Greece. To put the Persian Empire at this time\nin perspective we have to note that there were over 70 million subjects living under\nDarius, belonging to 35 different ethnic groups. Darius not only expanded the Persian\nEmpire but also consolidated power through public works; he also issued new Persian\ncoins which united the economy through the empire. Darius did not rule without careful\norganizing; for instance Darius shared power with governors (satraps), appointed to rule\nsmall provinces, but kept them in line by using a secret police called “the secret eyes and\nears of the king”; thus he would keep a close eye on these governors to prevent rebellion.\nIn 520 BCE Darius founded a new capital city for the empire called Persepolis. He also\nhad a massive road network built that united the empire from East to West. For this road\nnetwork Darius created a communication system using stations that always had fresh\nhorses and offered the messengers a place to eat or sleep; these stations were placed\nperiodically along the main empire road (every 25-30 miles or so) to be used to deliver\n52 messages from the far reaches of the kingdom to another in about two weeks. Darius’\ncommunication network was so advanced for its time that in a matter of weeks, armies or\ngovernors could be informed and if necessary, alerted. The network was so effective the\nRomans would later copy it.\nIn Asia Minor the province of Ionia (located in western Turkey) was ruled by the\nPersians. The Ionians were Greek by heritage and began to rebel against the tyrants\nplaced in power or supported by the Persians. One thing to note is during this time period\nthe word tyrant did not mean a cruel dictator; rather it only meant that the leader took\nover through unconstitutional means. The Ionians, displeased especially with high taxes,\nstarted the rebellion in 500-499 BCE, yet they were not strong enough and sought help\nfrom their Greek countrymen, especially the Athenians. Athens, a rather small city state at\nthe time, had no intention to become involved with a matter that would drag them into the\nsights of the Persian war machine. The Athenians, however, decided to provide aid to the\nIonians, and participated alongside the Ionians in the burning down of the city of Sardis,\nthe Persian administrative capital in the west. The Ionians were not able to defeat the\nPersians and the rebellion was put down. The Persians out of revenge burned the Ionian\ncity of Miletus, which was considered a city of philosophy and intellectuals, and they\nenslaved every citizen. So the Ionian rebellion was unsuccessful, but it had tremendous\nconsequences. Legend has it that Darius had a servant remind him every day to never\nforget about the Athenians. In 492 BCE the Persians sent a military force consisting of\nland troops and a navy to invade Greece and burn Athens in punishment for their\nparticipation in the Ionian Revolt. In this invasion, the Persians took several northern\nlands in Greece that had rich deposits of silver; yet due to a storm that heavily damaged\nthe Persian navy they left Athens unpunished, and launched a second invasion in 490\nBCE.\nThe Persians arrived in 490 BCE in Greece near Athens at a small village called\nMarathon with a force that outnumbered the Athenians and their Plataean allies by at least\na 2:1 ratio. However, the Greek forces, led by Athenian generals, charged an unprepared\nPersian force at their landing site in a surprise ambush. The Athenian surprise attack,\ntogether with successful battlefield tactics, caused the Persians to retreat back to their\nships; there they regrouped and sailed towards Athens. The Athenian soldiers, tired from\n53 battle, were forced to run in heavy full armor 26 miles back to Athens. When the Persian\nnavy arrived in view of Athens, these soldiers were there in time to fight. The Persians\ndecided not to engage but to retreat altogether and end their Greek invasion as Athens\nstood victorious after the battle of Marathon. In Greek myth it is said that a single\nmessenger was sent from Marathon to Athens after the Greek victory and that he ran the\n26 miles yelling Nike upon his arrival in Athens, which is Greek for “victory”; he\ncollapsed dead thereafter. Yet this defeat was not a substantial loss for the Persians as\nother conquests paid for the invasion and Darius remained confident of a future Persian\nvictory. He began preparing another invasion but he died in 486 BCE before he could\nactually lead the Persians against the Greeks again.\nThe death of Darius spared Greece a third invasion for the time being, as the new\nking of Persia, Xerxes, son of Darius, was not interested in destroying Greece. Xerxes\ninherited the throne in 486 BCE and a Babylonian rebellion kept him busy. It is said (by\nHerodotus, the great Greek historiographer writing around 450 BCE) that Xerxes had\nseveral dreams encouraging the third invasion of Greece. Not sure whether to believe\nthem, Xerxes asked his uncle to sleep in his bed and wear his nightgowns for a night to\nsee what happened. The next night, to the surprise of Xerxes, his uncle experienced the\nsame dream as Xerxes, thus confirming that the gods were encouraging Xerxes to destroy\nGreece and finish his father’s work. In 484 BCE, Xerxes began to prepare the largest\nexpeditionary force in the world at this time to intimidate the Greeks into submission\nwithout a fight. Some cities did in fact submit to Persian rule when they realized what\nwas soon going to happen.\nIn 480 BCE the largest expedition of Persian forces ever assembled reached\nGreece. Xerxes joined the Persian troops himself. The Persians arrived at a place called\nThermopylae, which was ancient Greek for “Hot Gates”. There a coalition force of 300\nSpartans and many more Greek soldiers from neighboring city-states fought against the\nmuch larger Persian army in order to gain time for other Greek military preparations.\nHowever the Greeks were surrounded and the Spartan king sent most of other Greeks\nback home. The Persians crushed the Spartan force and beheaded the Spartan king\nLeonidas as punishment for the death of two of Xerxes’ brothers during those few days of\n54 fighting. The strategic reason for fighting on the side of the Greeks was successful: to buy\ntime for other military preparations.\nAfter fighting the Greeks at Thermopylae, where they lost only a small fraction of their\nenormous army, the Persians headed for Athens. Soon Athens was burned by Xerxes, who\nthus accomplished Darius’ plans. However, the Greek resistance was not destroyed, as\nmany of the Athenian citizens had evacuated the city, going to the neighboring island of\nSalamis. The Greek general with the most influence regarding the defense of Athens was\na man named Themistocles, who had fought in the battle at Marathon 10 years earlier.\nSeeing that the other generals were considering further retreat, Themistocles decided to\nwrite a letter to the Persian King Xerxes detailing his submission to Xerxes and\nencouraging the Persians to attack the Greeks immediately and destroy them while they\nwere in disarray. Themistocles, however, had a strategic ploy in mind. The island of\nSalamis was separated from the Greek mainland by a narrow straight in which the much\nlarger Persian navy could not use their ships to their full advantage because they could\nnot maneuver well. Instead many of the Persian ships fell afoul of one another. The\nunderwater rams of the Athenian ships that had been made sturdier also proved to be\ncrucial since they inflicted severe damage to the Persian ships. As a consequence the\nPersian navy was defeated. The Persian admiral Artemisia, from the Greek city of\nHalicarnassus, was one of Xerxes’ best commanders; although she was a woman, Xerxes\ntreated her as an equal and spared her, unlike other commanders, whom Xerxes executed\nbecause he believed them to be cowards.\nAfter the Persian defeat at Salamis Xerxes decided that he would personally\nwithdraw from Greece but leave his army to fight on. The Persians later burned Athens\nfor the second time. In 479 BCE the Greeks, after the battle at Plataea, pushed the\nPersians out of Greece and thus ended the last large expedition by the Persians to Greece.\nHowever, the Persians and various Greek powers would continue be at war with one\nanother, fighting small battles every so often until 331 BCE, when Alexander the Great\nconquered Persia.\n55 Life in the Persian Empire during the Achaemenid Dynasty\nThe upper class of the Persian Empire consisted of the Persian king and his family as well\nas the former tribal leaders who represented a kind of an aristocratic class. The religious\nmembers of the Persian Empire were different from most ancient empires as they had\nminimal power but several privileges like being exempt from taxes. The common people\nconsisted of artisans, traders and farmers who could own land but had no privileges in the\neyes of the law and were to pay a tribute to the kings of Persia. At the bottom of the\nPersian class system were slaves gained from wars. The economic structure in Persia was\nbased on agricultural dependence. Through advanced irrigation techniques the Persians\nbecame masters of the desert by getting water from deep wells, as well as developing\nbeautiful gardens (Persian word for garden: Paradeisos) like those found in Persepolis.\nAs the Persians expanded into the Mesopotamian valley and Indus river valley, they\ngained access to rich fertile soil not found in the heartland of Persia, Iran, itself. With\nexpansion to Egypt’s Nile River region the Persians gained a massive agricultural\nsurplus, leading to wealth and the ability both to feed everyone in the empire and gain\nprosperity.\nReligion in the Persian Empire\nIt is believed that the early religion of the Persians had a connection with that of their\nIndo-European relatives. Most likely they shared certain gods and rituals. What is certain,\nfor example, is that the Persians and the Aryans shared the use of a drug for religious\nrituals. Later the Persians developed their own unique religion based on the works of a\nprophet named Zoroaster or Zarathustra. Zarathustra lived sometime between around\n1200 BCE-600 BCE. He left his family at age 20 and traveled around for 10 years\nseeking wisdom. Zarathustra later had several visions which convinced him that there\nwas one supreme god in existence called Ahura Mazda who was the most beneficial god\nto man and who wanted Zarathustra to be his prophet. Zarathustra later taught that there\nwas an evil god named Angra Mainyu and that both, Ahura Mazda and Angra Mainyu,\n56 will fight for 12,000 years; after this fight good will win against evil and destroy it\nforever. Thereafter, according to Zarathustra, all mankind would be judged and the\nvirtuous would be given rewards and those who were evil would suffer for eternity. This\nnew Persian religion would be named after Zarathustra/Zoroaster and be called\nZoroastrianism. Following this religion demanded among other things that two important\nrules were never to be broken. These two rules of Zoroaster were living with moderation\nand to always tell the truth. It is believed that both Cyrus the Great and Cambyses\nfollowed Zoroaster; it is certain that Darius the Great was a believer in this religion. The\nPersian upper class celebrated Zoroaster but the Persian kings remained tolerant and\nallowed other people to worship other religions within the empire.\nThe Persian Achaemenid dynasty ended with the death of Darius III in 330 BCE.\nThis represents the end of one of the most powerful dynastic rules of the ancient world.\nThe Persian Empire under the Achaemenid dynasty left behind an empire built on\nconquests that tied together East and West. Despite the Persian defeat in the Greco-\nPersian Wars of the 5th century BCE, the Persians managed to rule one of the largest\nempires in antiquity until the Macedonian king Alexander conquered them. Alexander,\nwho once admired the Persians for their greatness in battle and humble leadership,\ndeclared himself the successor of the Achaemenid dynasty and King of Persia.\nIt would take Alexander nearly three years of fighting throughout the Persian\nEmpire to finally pacify the entirety of the ancient Persian kingdom and force it to submit\nto Macedonian rule. It was during the pacifying of the Persian kingdom that Alexander\narrived at the Persian capital of Persepolis; here Greek author Diodorus of Sicily\ndescribes the events in the sections 17.20-22 in his works.\nAs for Persepolis, the capital of the Persian kingdom, Alexander described it to\nthe Macedonians as their worst enemy among the cities of Asia, and he gave it\nover to the soldiers to plunder, with the exception of the royal palace. It was the\nwealthiest city under the sun and the private houses had been filled for a long\ntime with riches of every kind. The Macedonians rushed into it, killing all the men\nand plundering the houses, which were numerous and full of furniture and\nprecious objects of every kind. Here much silver was carried off and no little gold,\n57 and many expensive dresses, embroidered with purple or with gold, fell as prizes\nto the victors.\nBut the great royal palace, famed throughout the inhabited world, had been\ncondemned to the indignity of total destruction. The Macedonians spent the whole\nday in pillage but still could not satisfy their inexhaustible greed. [...] As for the\nwomen, they dragged them away forcibly with their jewels, treating as slaves the\nwhole group of captives. As Persepolis had surpassed all other cities in\nprosperity, so she now exceeded them in misfortune.\nMany historians believed this act was revenge for the burning of Athens years earlier;\nhowever, regardless of the reasoning, even Alexander claimed to be regretful when he\nreturned to the ruins of Persepolis years later on his way back to Babylon. On June 10th,\n323 BCE Alexander the Great died from a fever caused by malaria in Babylon, leaving no\nheir. Soon Alexander’s generals fought for control amongst themselves upon the death of\ntheir king. These generals later became the successors of Alexander and carved kingdoms\nfor themselves. Alexander’s general Ptolemy for example became king of Egypt while\nanother general called Seleucus claimed as his kingdom the former Persian Achaemenid\nEmpire.\nThe Seleucid Dynasty\nSeleucus I inherited the lands contained in the former Persian Empire under the\nAchaemenid dynasty with the exception of Egypt and northern Greece. It would take\nSeleucus until 305 BCE to control the entire kingdom. Seleucus I kept the political and\nsocial systems of the Achaemenid dynasty in place. The dynasty Seleucus created would\nbe named after him, as would the empire he created; we refer to these as the Seleucid\nDynasty and the Seleucid Empire, respectively. The Seleucid dynasty created new cities\nin the Greek style and invited people to live in them by offering free land. However, even\nwith all the attempts to preserve Persian styles of government, the Persian natives\ndisliked the Seleucids because they were a foreign power dominating them. Revolts and\nseveral attempts to remove the Seleucids occurred, but none of them worked; over time,\n58 however, these revolts began to weaken the Seleucid dynasty’s hold over the region. The\nSeleucid Empire lasted until 83 BCE when the Romans took the remaining part of the\nsmall Seleucid Empire, which had already been weakened by another successor kingdom\nclaiming to restore the Persian Empire of the Achaemenids.\nParthian Empire\nFollowing both the conquest of the Persian people by the Macedonian Greeks and the\ndeath of Alexander the Great, tensions started to grow almost immediately in the satrapies\nof the former Persian Empire. Many of the regional peoples banded together to push out\nthe Greeks and restore the golden age of the Achaemenid dynasty. One such group were\nthe Parthians, who in 238 BCE began to carve a kingdom out of the crumbling Seleucid\nEmpire. This small Persian kingdom developed a parasitic relationship in which the\nParthians grew stronger while the Seleucids grew weaker. The most powerful king of the\nParthian Empire was a man named Mithridates (c. 171 BCE). The war between the\nParthians and Rome eventually culminated in the death of the Roman general Marcus\nCrassus in battle against the Parthians in southern Asia Minor in 53 BCE. The Parthians\nconsidered themselves the true successors to the Achaemenid dynasty; they also followed\nZoroastrianism and cultivated it further.\nSassanid Empire\nThe last Persian Empire was the Sassanid Empire, which arose after the fall of the\nParthians in 224 CE. Like the Parthians, the Sassanids considered themselves the true\nsuccessors of the Achaemenid dynasty. The Sassanids, however, successfully kept the\nRomans at a distance; they created a system of puppet states between them and the\nRomans, which continued even as the Roman Empire split, further strengthening the\nSassanids in the region. The Sassanid Empire started to decline when the Arab Muslims\narrived. Those warriors quickly took hold of Sassanid Syria and eventually absorbed the\nweak Sassanid Empire by conquering its capital Ctesiphon in 651 CE. The Arab invasion\nnot only ended the Persian Empire but also brought a new religion to the region, Islam,\n59 which slowly took over and pushed Zoroastrianism further East into India, where it\nsurvives in some form to this day.\nImpact of the Persian Empire\nThe impact the Persian Empire had on the world was religious tolerance (with\nexceptions), along with cultural expansion, both of which influenced many other regional\nstates. This applies also to the Arab invaders who brought Islam to the Persians, adopted\nPersian customs and administration. With the end of the Sassanid Empire in 651 CE we\nsee the end of the Persian Empire. Though we know little about the mighty Persian\nEmpire because of the lack of Old Persian sources, we still hear much about them in\nGreek literature and other foreign (often enemy) sources.\n60 7. Classical China\nIntroduction\nThe Chinese civilization that emerged in the Yellow River and Yangtze River valleys\nstruggled to find an effective way to organize government. In the 5th century BCE China\nwas generally in a state of political chaos. The early dynasties of China experimented\nwith how to govern large territories, sometimes using subordinates to rule on their behalf\nin exchange for tribute and military aid. These subordinates, however, frequently chose\nnot to abide by the will of their king; they began to establish their own kingdoms. These\nkingdoms would fight so bitterly that a period of around two hundred years (403-221\nBCE) became known as “The Period of the Warring States”. However, this period of\npolitical chaos gave rise to many remarkable cultural achievements. Three Chinese\nschools of thought emerged during this period in an attempt to end the rivalry among the\nsmaller kingdoms and create a unified China. These three schools of thoughts in China\nwere Confucianism, Daoism and Legalism, all of which had a deep impact on Chinese\nhistory.\nConfucianism\nMany people recognize the idea of Confucianism but know little about the man or his\nteachings. He is known to the Chinese as Kong Fuzi (meaning “master philosopher\nKong”) whereas in the West he is called Confucius. He lived from 551-479 BCE and\nbelonged to an aristocratic family from the state of Lu in Northern China. Confucius was\na man with strong principles, which he would not give up for anything, not even for a\npolitical career. He travelled throughout northern China for ten years working as a teacher\nand a political advisor, attracting many students who wanted to pursue a political career.\nSome students of Confucius wrote down his teachings in a book called “Analects.” This\nbook became very influential in Chinese politics and culture. Confucius had practical\nideas and did not ask abstract philosophical questions; he concentrated on creating an\neducated class of superior individuals called “Junzi.” Confucius believed that these Junzi,\n61 being well educated, would best serve the state. His students had to learn works of poetry\nand history that were created during the Zhou Dynasty. For more than 2000 years, until\nthe 20th century CE, his writings were the basis of learning for future Chinese officials.\nAccording to Confucius, education alone was not sufficient to become a government\nofficial; rather, he considered moral integrity and fair judgment equally important. For\nConfucius it was necessary to have high standards of behavior in order to make fair and\njust judgements.\nTo achieve this high standard of behavior Confucius created a set of values. One\nof these values, for example, was Ren, a certain kindness and humanity towards others.\nAnother value in Confucius’ philosophy was Li, the respect humans have to show\ntowards others, especially elders and superiors. The value called Xiao demanded that\nchildren show and provide respect and care towards their parents and other family\nmembers. Ideally, according to Xiao, one was expected to take care of family members as\nthey became older or sick while cherishing their memory once they died. Confucius\nbelieved that a person possessing moral values and who was well educated could become\npart of the Junzi and thus become a supreme individual capable of leading China out of\n“The Period of the Warring States”. Many of Confucius’ ideas were so influential because\nin his teachings he used general terms, not specific ones intended for one special occasion\nthat was unlikely to happen in the real world. Thus Confucian thought became generally\neasier to apply at different times. Another important part of Confucian thought was that\nthe students could easily adjust the teachings of their master to further apply his methods\nin other areas. One such student of Confucius’ teachings was a man named Mencius, who\nlived centuries later, from 372-289 BCE during “The Period of the Warring States”. Like\nConfucius, Mencius travelled widely throughout China and heavily supported harmony\nand cooperation between people, but experienced more criticism than Confucius for\nbeing too optimistic.\nAnother student in the Confucian tradition was Xunzi (298-238 BCE), who in\ncontrast to Confucius and Mencius had acquired practical experience in government by\nworking as an administrator for many years. Presumably this practical experience in\npolitics led to the fact that he was not as optimistic regarding human nature as Mencius.\nHe believed people act based on self-interest and are not willing to contribute to society\n62 voluntarily. Xunzi thought that a very strict social discipline was needed to straighten out\nindividuals with too much self-interest and change them into contributing members of\nsociety.\nWhat Confucius, Mencius, and Xunzi shared was an optimism that people can be\nimproved and that order in society can be restored. This optimism is crucial for\nunderstanding why Confucian thought focused on education and public behavior.\nHowever, this optimism directly challenged other thinkers, who believed that this was\nimpractical in helping to restore order in China. One such group of critics were the\nsupporters of the second school of thought in China, Daoism.\nDaoism (Taoism)\nThe origin of Daoism goes back to the late Zhou Dynasty in China, when the “Period of\nthe Warring States” started to create both political and social unrest. While Confucian\nthought focused on education and on public behavior that required humans to actively do\nsomething to achieve change, Daoism followed a different path, one quite opposite to\nConfucian thought. Daoists thought that the activity of people to bring about change was\na waste of time and energy. They believed that people must look inwards, reflect on\nthemselves to gain knowledge about nature, and learn how to live in harmony with it and\nothers. This school of thought was founded by a sage named Laozi who lived sometime\nbetween 600 and 500 BCE. Daoism itself comes from the word Dao meaning way, the\nway of nature and the cosmos. Thus Daoism is the way to understand nature and the\nworld. Human beings have to self-reflect to acquire knowledge as to their place in this\nuniverse. We as humans must live in harmony with Dao, which in turn meant that humans\nmust let go of ambition and activism in politics or the state and live a very simple\n(ascetic) life. Taoists called this concept of living Wuwei, which, basically translated,\nmeant that human beings were to live simply and in harmony with nature, away from all\ninvolvement and competition in politics. Thus Taoists believed in having less government\nand living in small communities that relied basically on themselves. Confucian thought\nand Daoism were not exclusive, meaning that anyone was allowed to observe more than\none school of thought; so, for example, people who followed Confucian values during\n63 their professional time, say as government officials, could still follow the Taoist line of\nthought in their private lives and reflect on human nature and the place of humans in it.\nLegalism\nA third school of thought soon emerged in China as both Confucian thought and Daoism\nfailed to produce peace and order during the Period of the Warring States. The third\nschool of thought is called Legalism. It differed from the other two schools of thought in\nits emphasis on ruthless efficiency in politics and administration. People actively\ninvolved in Chinese politics developed Legalism. The most prominent person among the\nLegalists was Shang Hang (390-338 BCE). He worked as secretary of the leader in the\nregional state of Qin. Shang Hang wrote a book in which we find his ideas, called The\nBook of Lord Shang. Although he surely was a brilliant thinker to achieve such status, he\nwas presumably rather unpopular, as he along with his family members was executed and\nhis body mutilated by rivals in the court after the death of his patron. Another important\nlegalist was Han Feizi, who was also killed by rival members of the political elite, who\nforced him to drink poison. Both Lord Shang and Han Feizi thought and believed what\ncan be summarized as the Legalism Doctrine: a state is strong when it has strong\nagriculture and a strong army. The Legalists wanted people either to become farmers or to\nperform military service, and not work as merchants, educators, scholars, artists etc.\nThe term Legalists indicates that followers of Legalism believed in strict and clear\nlaws, which would make people put the interest of the state over their personal interests.\nThese strict laws made the expectations of the state clear and offered severe punishments\nfor violations. The Legalists came up with the idea that if people were afraid to commit a\nsmall crime they would be even more afraid to commit a greater crime. A recent example\nof this kind of thinking can be found in modern New York City, where, under former\nMayor Rudy Giuliani, a policy called “Broken Windows” or “Zero Tolerance” was\nimplemented. However, the legalist form of punishment was far more severe than high\nfines or jail time; the Legalists endorsed punishments such as amputation for depositing\nashes or trash in the street.\n64 Another concept the Legalists used to keep the populace in line was the theory of\ncollective responsibility before the law. This meant that all members of the family were\nexpected to observe one another and report violations to the state. Should a member of\nthe family not obey, then the entire family of the violator would be punished.\nThe legalist school of thought was not very popular in China and even centuries\nlater some philosophers did not agree with the views of the Legalists. However, many\nscholars give the legalist doctrine credit for playing a crucial role in ending the period of\nthe Warring States and even helping to unify China under one ruler.\nUnification of China\nDuring the later stages of the period of the Warring States in China, some of the regional\nleaders of the independent states began to adopt legalist ideas; among these states was the\nstate of Qin (pronounced Chin) in Western China. The rule of the Qin dynasty lasted only\nfor some years, but the succeeding Han dynasty would last centuries by following the\nexample of the Qin dynasty. During the 4th century BCE Shang Hang advised the ruler of\nthe state of Qin to introduce important reforms in the Qin state. In following the legalist\ndoctrine, the ruler attracted many peasant farmers to sparsely populated areas by granting\nthem free plots and profits. This caused an agricultural surplus, which was used by the\nQin dynasty to organize a powerful army, equipped with the best iron weapons available\nat the time. With this army the Qin rulers conquered one state after another until they\nbecame the first rulers of a unified Chinese state in 221 BCE, when the former ruler of\nthe regional state of Qin proclaimed himself the first emperor: Qin Shihuangdi. Ironically\nthe accomplishments of the Qin dynasty were overshadowed by its short reign of only 14\nyears over a unified China, which ended officially in 207 BCE. Although the dynasty\nended quickly through civil strife, the Qin dynasty was very influential on future\ndynasties of China, which would also pursue centralized imperial rule.\nThe first emperor Qin Shihuangdi ruled his empire from the city of Xianyang\n(near modern Xi’an). It seems that many welcomed the stability brought about by the\nnew ruler, but others did not accept the new government. The new ruler was, for example,\ncriticized by many followers of Confucianism and Daoism. Qin Shihuangdi reacted with\n65 force: he executed many of those who had criticized him, and ordered books of\nphilosophy, ethics, history and literature to be burned, with the exception of the few that\nhe found to be useful. Shihuangdi also had 460 scholars burned alive for criticizing his\nregime, while he forced other critics to serve in the army in dangerous locations along the\nborder.\nHowever, alongside this harsh punishment, the first emperor of China introduced\nmany reforms that further supported the unification of China. Emperor Shihuangdi\nwould, for example, implement standardized laws as well as standardized currencies,\nweights, and measurements in all regions in China. He also built large road networks,\nwhich interconnected China further, reaching all far-flung areas.\nAnother innovation by emperor Shihuangdi was a standardized script, which he\ndemanded that all the regional states use as a common script. In different regions people\nwould still speak different languages and dialects as they do today, but they were forced\nto use the common language and script for all matters of state.\nAlthough Qin Shihuangdi was a powerful and very ruthless leader, he is still a\nvery important figure in Chinese history, as he must be considered a major factor\nresponsible for Chinese unification. The emperor died not long after Chinese unification\nin 210 BCE and was buried in a luxurious tomb built by maybe around 700 thousand\nlaborers. Along with the emperor, many precious grave goods were placed in the tomb;\nslaves, concubines and even craftsmen who designed the tomb were sacrificed. The tomb\nwas secured with traps and crossbows that could fire at intruders who triggered them. On\nthe celling of the tomb were stars and planets painted by hand, and on the floor was\npainted a map of the entire realm over which he had ruled, which included flowing rivers\nof mercury. Near the tomb, archaeologists discovered buried trenches containing an army\nof life-sized pottery figures (the famous terracotta army), whose job it was to protect the\nemperor in the afterlife. This terracotta army was excavated only recently, in 1974.\nHowever, parts of the tomb have yet to be discovered; only brief accounts of possible\nlocations and designs have survived the centuries.\nShortly after the death of the first emperor, revolts erupted throughout China, as\nmany thousands of laborers who were forced by the new king to work on public building\nprojects like palaces, roads and bridges became so discontent with the obligation to leave\n66 their families and homes that they started to rebel in 209 BCE. In 207 BCE the rebels\noverran the Qin court, slaughtered the government officials, and burned down the state\nbuildings. Chaos erupted and a return to the Period of the Warring States seemed likely.\nYet the end of the turmoil and chaotic situation in China came only one year later in 206\nBCE. The man seemingly responsible for ending the chaos was Liu Bang; after he\npartially restored order in 206 BCE he became the new leader and ruler of a new dynasty\nwhich is called Han dynasty. The Han dynasty would last 400 years from 206 BCE to 220\nCE thus being the longest and most influential dynasty in Chinese history. These 400\nyears of the Han dynasty were only interrupted once, when for 14 years (between 9 and\n23 CE), a challenger took over the throne. Because of this event we talk about the Han\ndynasty in two parts, the early Han dynasty (206 BCE-9 CE), and the later Han Dynasty\n(23-220 CE). At first Liu Bang tried to follow a middle course between centralized\ngovernment and a government based on more powerful regional leaders such as\ngovernors. Later on he switched to a more strict centralized government like his\npredecessors, which would become the model for government throughout the Han\ndynasty.\nThe most successful and influential of the Han rulers was Han Wudi, also known\nas the Martial Emperor. He ruled for 54 years, from 141 to 87 BCE. He expanded\ncentralized government and authority. For this he needed well-educated people who could\nwork as bureaucrats and administrators. However, this was a problem as there was a\nsevere lack of educated people in China, partially because there was no formal education\nsystem in China capable of supplying Han Wudi with the necessary steady supply of\neducated people for these administrative jobs. Rather, most education took place in\nprivate improvised systems like those of Confucius, Mencius, and Xunzi, who would\naccept students on a case by case basis. One reason for this lack of educational\ndevelopment was the contempt for education among certain people of the ruling class. It\nwas said that Liu Bang emptied his bladder into a cap usually worn by Confucian\nscholars. However, Han Wudi had a different view, and in 124 BCE would start his\neducation reform with the establishment of the first imperial university. The goal of this\nuniversity was to produce government officials by using the teachings of Confucius as\n67 part of its curriculum, thus ensuring that the teachings of Confucian thought survived\nover thousands of years.\nHan Wudi was also successful in foreign policy: he expanded his rule into\nVietnam and Korea, both of which came under influence of Chinese culture. For\nexample, both countries adopted Confucian thought in their educational systems. The\nmost important achievement in foreign policy of Han Wudi was his invasion of central\nAsia and his defeat of the nomadic people called Xiongnu. This ensured that the Han\nstate could enjoy uncontested rule in East and Central Asia.\nLife in Classical China\nSociety under the Han rulers was based on male dominance; women were seen more and\nmore as subordinate to men, since devotion to husbands and humility were demanded of\nwomen in Confucian thought. Most of the people in China worked in agriculture,\nencouraged by the adopted legalist doctrine. Under the Han rulers iron was used more\nand more to make plows, shovels, and sickles. This added to agricultural productivity\nand, as was true in many other ancient civilizations, stimulated population growth. One\nvaluable area of craftsmanship under the Han dynasty was sericulture, or the production\nof silk. Sericulture was much older than the Han dynasty, going back as early as 3800\nBCE in the Yellow River valley. But under the Han dynasty silk production was finally\nexpanded to other areas of China, especially modern Sichuan and Guangdong provinces.\nSilkworms can be found in many places through Eurasia, but the Chinese ones were\nespecially fine producers of silk. The Chinese had refined the techniques necessary to\nbreed silkworms and to treat them and their cocoons. Chinese silk thus became a very\nprecious good in India, Persia, Mesopotamia, and even in Rome. The long distant trade\nroutes used to move silk would later be known as the silk roads because of this demand.\nAnother invention under the Han dynasty was the invention of paper around 100 CE;\nprior to this the Chinese wrote on bamboo, silk, or (as we have seen) bones.\nAs mentioned before, the growth in agriculture led to an increase in population,\nand by the year 9 CE, at the end of the early Han dynasty, around 60 million people lived\nin Han China. The problem was that the surplus wealth was rather quickly consumed,\n68 especially by Han Wudi’s military campaigns. Han Wudi raised taxes and confiscated\nland to fund his projects. The distribution of wealth was unequal during those years. This\ncould be seen especially in the distribution of land: more and more land was in the hands\nof fewer and fewer landowners. One reason for this was the fact that a few landlords\nprofited from the ruin of smaller landowners who could not pay their debts, and thus were\nforced to sell their land or even themselves into slavery. So by the end of the first century\nBCE a small number of landowners possessed most of the land while more and more\npeasants faced difficulties just to get by. Because these peasants had no hope of\nimprovement in the future, the situation led to social unrest, rebellions and banditry. The\nlandowners, however, were very important for the Han emperors, since they provided the\nfunds for their projects and courts. Thus the Han emperors were reluctant to implement\nreforms that dealt with the inequality problem. It was only in the year 6 CE, when a six-\nyear-old Han ruler inherited the throne, that a Han secretary was able to start reform; the\nsecretary took over the responsibility of governing on the new ruler’s behalf. His name\nwas Wang Mang, and he was such a capable ruler that others urged him to usurp the\nthrone, which he did in 9 CE. This date is regarded as the end of the early Han dynasty in\nChinese history. Wang Mang started to introduce reforms which have, in modern times,\nearned him the nickname “Socialist Emperor.” An important part of Wang Mang’s rule\nwas the reform of landownership: he limited the amount of land that could be possessed\nby one family, and he also broke up large estates and redistributed them. Unfortunately\nfor Wang Mang, he was not very effective in implementing his policy. The landowners\nwere understandably not very happy with his ideas, but the peasants were dissatisfied as\nwell, because Wang Mang was very inconsistent and ill prepared to meet their\nexpectations and to follow through on what he had promised in his reforms. Later, poor\nharvests and subsequent famine contributed to the dislike of the ruler, and in 23 CE a\nrevolt ended Wang Mang’s rule as well as his life.\nTwo years later, in 25 CE, the Han rulers returned to power and the later Han\ndynasty began. The Han rulers did not take care of the problem of land-owning which\nhad caused the end of the early Han dynasty in the first place. A few wealthy landowners\nstill lived in luxury while many peasants struggled, living in difficulty. Desperate\npeasants still revolted frequently; one of these revolts became known as the Yellow\n69 Turban Uprising due to the headgear worn by the rebels. This revolt was a serious threat\nto Han rulers and raged throughout China at the end of the second century and into the\nthird century CE. Internally, the Han dynasty was also weakened by the emergence of\ndifferent groups that had their own interests in mind. In the end these rivalries and fights\nbrought down the Han dynasty in the third century CE (220 CE), leaving China once\nagain divided into several regional states for more than 300 years.\nConclusion\nThe beginning of the period we refer to as classical China was shaped by political chaos.\nAt the same time, the emerging schools of thought of Confucianism and Daoism\ninfluenced thought and society in China for thousands of years to come. Politically,\nLegalism helped to bring an end to the 200 year period of chaos and to unite China under\none ruler, the former king of Qin. The Han dynasty maintained unity and allowed for the\nschools of Confucian thought and Taoism to survive.\nThe advance of silk production not only provided wealth for China, but also\nstimulated the construction of a large network of roads, which connected many\ncivilizations and facilitated the exchange of ideas. The use of Legalism had a great impact\non future Chinese culture as well as on other civilizations.\n70 8. Classical India\nIntroduction\nEarlier we discussed the birth of the early Indian civilizations that shaped the way India\nwould develop. In the absence of a unified centralized government in the Indian\nsubcontinent, it would not be long before other powerful empires would invade the\nregion, bringing not just devastation but also new ideas and technologies. Gradually, the\nmajority of the Indian subcontinent came under the rule of one dynasty. Eventually,\ninhabitants of the region mad new advances in science, mathematics and medicine that\nhad tremendous influence on later civilizations around the world.\nRise of the Mauryans\nWhen the Indo-Europeans (including the Aryans) migrated to India, starting around 1900\nBCE, they gradually founded regional kingdoms along the subcontinent. These regional\nkingdoms fought with each other constantly until some large regional kingdoms absorbed\nthe smaller ones around 600 BCE. It was not long until each of the remaining larger\nkingdoms attempted to conquer the others, although no single kingdom was able to do so\nearly on. As a result, India continued to be divided into kingdoms, with no single\ncentralized government. Two events changed this state of affairs, and India’s history as\nwell. First, around 520 BCE, Darius the Great of Persia began his conquest of\nNorthwestern India, and made it part of the Persian Empire. He introduced a strong form\nof centralized government for the first time in India, along with appropriate techniques of\nadministration. The second event occurred in 327 BCE with the arrival of another\nconqueror to India, Alexander the Great. When Alexander the Great and his armies\narrived in India they crushed many of the regional states along their path in an attempt to\nexpand the Macedonian Empire. The campaign to conquer India by the Macedonians was\ncut short when the armies of Alexander refused to go any further into the Indian\nsubcontinent and he was forced to leave India in 325 BCE. In leaving India, Alexander\ninadvertently influenced Indian politics by creating a power vacuum: having destroyed\n71 the local authorities and power systems he left no one in charge when he and his troops\nmarched back. In the Northeastern part of India the kingdom of Magadha became the first\nto take advantage of the chaos and secure power in the region. Between 500 and 300\nBCE Magadha dominated the area of northern India. Within the kingdom of Magadha\nlived an ambitious man called Chandragupta Maurya. He would slowly gain control over\nsmall remote parts of the Magadha kingdom, and he continued to do so until he gained\ncontrol over all of Magadha by overthrowing its existing ruling dynasty in 321 BCE.\nHowever, Chandragupta Maurya was not satisfied with ruling just the kingdom of\nMagadha; he began to expand and conquer all of Northwestern India. Chandragupta\nMaurya’s conquest of states in the region allowed him to create an empire containing all\nof Northern India. Such a large empire demanded careful administration. Chandragupta\nMaurya had a very capable advisor named Kautalya, who wrote a political handbook with\nguidelines for how to use power, explaining the principles of governing. This book\nbecame known as Arthashastra, and some of it survived and can still be read to this very\nday. Apart from giving instruction on how to administer a government, Kautalya gave\nadvice on the use of spies; for example he encourages the use of prostitutes as informants\nto the ruler.\nChandragupta’s son inherited the throne from his father in 297 BCE. Indian\nlegend states that Chandragupta left the throne behind to become a monk and that he led\nan ascetic life, which eventually led to his death by starvation. Under Chandragupta’s\nson, the empire expanded to the Southern portion of India. The grandson of\nChandragupta, Ashoka, came to the throne in 268 BCE, and under his rule the Mauryan\nEmpire reached its climax. Ashoka reigned over the Mauryan Empire from 268 BCE to\n232 BCE. His first campaign was to conquer a kingdom called Kalinga, which had\ncontinued to resist Mauryan dominance under his father. Ashoka’s armies defeated\nKalinga in 260 BCE, which resulted in the complete control of the Indian subcontinent\n(except the most Southern point) under one unified empire. With his expansion of control\nover India complete, Ashoka moved his attention towards governing the empire\neffectively. He would establish Pataliputra as his capital city (close to modern day Patna),\nwhich quickly grew into a large cosmopolitan city. All around his realm Ashoka\npublished his edicts as inscriptions on rock faces or on stone pillars he erected for this\n72 purpose. These edicts transmitted imperial orders to his people; they also encouraged\nthem to follow Buddhist values.\nAshoka was a very capable ruler, and as a result India would benefit from a\nbooming economy, good government, and integration of its many different regions. But\nsoon after Ashoka’s death in 232 BCE, the Mauryan Empire started to decline. The\nempire’s large administration needed a lot of money, as did its large military. Later\nfinancial difficulties forced Mauryan leaders to issue unpopular laws (for example raising\ntaxes, confiscations of property), and by 185 BCE the Mauryan Empire had vanished.\nBactrian, Kushan, and Gupta Empires\nFor the next 200 years Northwestern India came under the dominance of a region called\nBactria (located mostly in modern day Afghanistan), where the successors of Alexander\nthe Great mixed with the local population and created a Bactrian Kingdom. This Bactrian\nKingdom invaded Northern India in 182 BCE. Bactria was an important place because it\nconnected China in the East to the Mediterranean world in the West. Very important\ntrading routes went through Bactria and provided the Bactrian rulers with great revenue.\nUnder Bactrian rule, for example, the city of Taxila in Northern India became a wealthy\nand flourishing place due to its function as a trading hub. Taxila was not alone in\nenjoying the economic boost; the whole region of Northern India called Gandhara\nbecame a cultural and commercial center under Bactrian dominance. This dominance\nended when nomadic peoples from central Asia pushed into the region.\nAmong these conquerors were the Kushans, who possessed an empire embracing\nparts of Central Asia and Northern India from 1 CE until 300 CE. The most famous\nKushan emperor was Kanishka, who ruled around 130 CE. Under his reign the Kushan\nEmpire contained modern Pakistan, Afghanistan, Northern India, and the central Ganges\nvalley. For several centuries the Kushan Empire was responsible for safe trade between\nEast and West, having contact with Rome, Persia, and Han China.\nThe Kushan Empire was succeeded by the Gupta Dynasty, which evolved in the\nheart of the Ganges valley region in Magadha. The Gupta Empire was founded around\n320 CE, and the main difference between the Gupta and Mauryan Empire was its\n73 organization. The Mauryans relied on a centralized form of government, whereas the\nGupta Empire left many responsibilities in the hands of local governments and\nadministrations. This worked for many years until in the early 5th century, when nomadic\ninvaders found no central force to stop them. Until then, however, from 320 CE to 400\nCE, the Gupta Empire brought security and stability to India. We know this from the\naccount of a Chinese Buddhist monk named Faxian, who travelled to India during the\nyears of the Gupta Empire. He wrote that it was safe to travel in India and that there was\nprosperity and little crime.\nFor us the Gupta Empire is interesting because very important achievements in\nscience and mathematics were made during its existence. Indian physicians, for example,\ndeveloped techniques of plastic surgery. Indian astronomers discovered that the earth was\na sphere rotating on an axis. Indian mathematicians created the basis for advanced\nmathematics by including the numeral zero into their mathematics. (Later in the 8th\ncentury, scholars from Arabia and Persia met Indian mathematicians and adopted what\nthey called “Hindi numerals.” Europeans later learned these numerals from Arab\nMuslims, which is why the numerals in the Western world are still called Arab numerals,\nnot Hindi or Indian numerals.) Indian mathematicians also computed Pi as 3.1416 and\ndetermined that the solar year consisted of 365.3586805 days.\nThe Gupta Empire ended due to conflict with an enemy against whom they could\nnot fight back: the White Huns. The White Huns were a nomadic people from central\nAsia. Around 490 CE the White Huns crossed the Hindu-Kush from Bactria into\nNorthern India and established kingdoms there. The Gupta Dynasty still existed, but only\nin name, not really having the power to rule effectively. Regional empires evolved once\nagain and it would take another 1000 years for an empire like the Mauryan Empire or the\nGupta Empire to appear in India.\nSociety in India\nDuring the years of the Mauryan Empire, agriculture and manufacturing in India grew\nintensively and trading networks expanded. Extensive trade was conducted within India,\nespecially along the Ganges River. Long distance trade between foreigners and India also\n74 grew more and more, for example with China and the Mediterranean. Long distance trade\nwith India was usually conducted through one of two possible routes: through the Hindu-\nKush Mountains via Taxila to Persia and the Mediterranean, or via the Silk routes of\ncentral Asia to China. From India, black pepper, pearls, cotton, and gems were exported.\nIndia in return imported goods like horses and silk from China. Indian merchants also\nsailed to faraway regions like Indonesia as early as 500 BCE. It was necessary for these\nsailors to understand the rhythms of the monsoon winds in the region, as in the spring and\nsummer the monsoon blows from the southwest while in the fall and winter months the\nwinds come from the northeast. Once these conditions were known, the Indian merchants\nwere able to sail from India to Indonesia and back without much issue. The exotic\nproducts the Indian merchants brought back from Indonesia often ended up in Persia or\nRome. Archaeologists have found many Roman coins in India, which points to a trading\nconnection between these two regions of the world in ancient times.\nThe economy was growing so quickly in India that it allowed for the population\nand the cities to do so as well. This growth led to issues of stability and social order\namong the subjects of India’s empires. The solution in India was different from that in\nother places: rather than focusing on law enforcement, the people in India relied on a set\nof morals created by Indian moralists, who promoted a strong patriarchal family, and on a\nsociety with exact definitions of what roles each member of the family had to play. In\nhigher classes, for example, many generations lived under one house together and were\n“ruled” by a man who was the patriarch.\nWomen usually were subordinate to men in this type of family structure in India,\nas is depicted in the two great Indian epics, the Mahabharata and the Ramayana, both of\nwhich describe women devoting themselves to their husbands. The patriarchal system\ngrew even stronger in the first centuries of the Common Era. By the time of the Gupta\nDynasty (320-550 CE), it reached the point where girls at age 8 or 9 were married to men\nin their twenties. The two would marry formally just after the girl reached puberty. This is\na sign of the patriarchal system in India since these girls were put under the control of\nolder men at a young age; obviously they were forced to devote themselves to a man and\nfamily and therefore were not able to partake in public life or society.\n75 As we have seen earlier, society in India was based on different castes. The\nexpanding trade, industrial activity and the growing economy brought fourth new types\nof workers like craftsmen, merchants, and artisans. These new workers did not fit into the\nold caste system or social order. Usually these workers formed guilds, which were\norganizations of workers within the same craft. These guilds controlled prizes, wages and\ncared for the well-being of their members and their families. Often these guild members\nlived in the same part of town and socialized with one another, which in turn led to\nintermarriage. These guilds began functioning as sub-castes known as the Jati. Unlike the\noriginal castes, the Jati system was built on occupation and not birth. The Jati performed\nservices which in other lands were provided by the government. These services included\norganizing courts to resolve differences between members, or taking care of community\naffairs. Members had to abide by the rules of the Jati; if someone did not, he could be\nexpelled from the Jati and become an outcast. As an outcast there was no protection or\nsupport from the group and it was impossible to find work in the occupation-based Jati.\nThese outcasts were thus forced to take on occupations nobody wanted because they were\nconsidered “unclean”, like butchering, tanning leather, and undertaking. Gradually, they\nestablished another caste called the “Untouchables.”\nThe tendency to be around people of the same occupation was an important\npattern of Indian society.\nChallenge to the Old Social Order in Classical India\nBecause India posessed a healthy economy after 600 BCE, members of the lower castes\nbegan to enjoy prosperity. Vaishas and Shudras would sometimes even become wealthier\nthan their Brahmin or Kshatriya contemporaries. This development created a direct\nchallenge to the old order of society. The religious professionals and warriors enjoyed\nspecial status because of the services they provided. The priests performed sacrifices for\nthe well-being of the community, whereas the warriors obviously protected the\ncommunity from immediate danger. However, because of economic developments after\n600 BCE, members of the wealthy classes (many of whom came from the lower castes)\ngrew tired of the old order and did not like the Brahmins’ attitude of superiority. The\n76 result was the rise of new religions and philosophies during the 6th and 5th centuries BCE.\nThese new schools of thought challenged and sometimes rejected the cults of Brahmins\nand served the interests of the newly-enriched social classes. There is evidence, for\nexample, of an atheistic sect called Charvaka in the area which claimed that the gods\nwere only figments of the imagination created by the Brahmins and that there was no\nafterlife. Other religious traditions like Jainism, Buddhism and Hinduism evolved, all of\nwhich emphasized spirituality against the Brahmins’ influence and dominance.\nJainism\nOne of the most influential new religions in India was Jainism, which existed in the 7th\ncentury BCE but did not grow in popularity until the 6th century. At this time a popular\nteacher in India turned to Jainism. His name was Vardhamana Mahavira. Mahavira\n(which means “great hero”) was born into the second highest class, the Kshatriya\n(warriors). According to legend, he left his prominent family at the age of 30 in order to\nseek a way out of the circle of incarnation. For 12 years Mahavira wandered along the\nGanges river valley while leading an ascetic life, and finally achieved enlightenment. He\ngot rid of all his worldly possessions and preached that humans should not be involved in\nworldly affairs. Mahavira’s teachings became so popular that a group of dedicated\nstudents became monks to spread his message. These students called Mahariva “Jina”,\nmeaning “conqueror.” From the title of Jina the followers of Mahavira began referring to\nthemselves as Jains. Jainism was heavily influenced by the religious philosophy of the\nUpanishads, with their idea of incarnation of the soul into human beings, animals or\nplants. According to Jainism, the soul was no longer limited to living entities, but could\nbe incarnated in everything in the universe, even rocks.\nJainism taught that the only salvation from being trapped in this circle of\nreincarnation was to be found in saying “no” to all selfish behavior. Generally, this could\nbe done by following a principle called Ahimsa, which meant avoidance of all violence\nunto other living things. For the Jain monks, this imposed an extremely difficult way of\nlife. These monks had to sweep the ground before they walked to avoid harming insects,\nthey had to follow a strictly vegetarian diet, and they had to avoid sudden movements and\n77 wear masks so not to harm the souls inhabiting the air. This type of lifestyle was very\ndifficult on its own, but for farmers, leather tanners, and workers in other occupations that\nsomewhat harmed or involved living beings, it was impractical. Thus Jainism was rather\nunpopular among many people and did not become the first choice to replace the existing\ntraditional religion of the Brahmins in India at the time. But for certain people Jainism\noffered something very attractive: it did not allow for social hierarchies or classes, since\neverything in the universe possessed a soul and played an equal part in the universe. In\nparticular, the fact that the Jains did not recognize the different Varnas or Jati only\npromoted more support among the lower castes.\nThe Jainist concept of Ahimsa (nonviolence) greatly influenced other religious\nschools of thought over a long period. To this day around 2 million people in India follow\nJain teachings, in particularly the concept of nonviolence. In addition, many Buddhists\nand Hindus see Ahimsa or nonviolence as the most important part of their faith.\nInfluential people like Mahatma Gandhi, or Martin Luther King in the West, saw the\nconcept of nonviolence as the most important tool for achieving reform.\nJainism remained a minority religion in India, as few people could be persuaded\nto follow the very strict lifestyle demanded by a devout Jainist. With Jainism failing to\nchallenge the faith of the Brahmins, a more practical faith succeeded in becoming more\npopular in India: Buddhism.\nBuddhism\nThe founder of Buddhism was Siddhartha Gautama, born around 563 BCE in a small\ntribal state in the Himalayas as the son of the local ruler. Siddhartha had a very\ncomfortable life and was separated from all the “common” people. He was educated\nsolely to succeed his father as ruler over the state into which he was born. Siddhartha,\nhowever, became gradually unhappy with this life. According to legend, one day\nSiddhartha left his palace and saw a man in the park who was weak and miserable\nbecause of his age and infirmity. When Siddhartha inquired what was plaguing the man,\nthe man responded that all human begins must grow old and weak. Later, Siddhartha saw\na corpse and a sick body, from which he learned about sickness and death. Lastly,\n78 Siddhartha saw a monk who informed him that some people choose to seclude\nthemselves from the world in order to lead a holy life and train their spiritual capabilities.\nAfter seeing both the suffering of the world and the monk, whom he believed to be a\nnoble character, Siddhartha chose the lifestyle of asceticism in the hopes of understanding\nwhy human beings have to suffer. He started wandering along the Ganges River.\nSiddhartha sought understanding by meditating intensively and, later, by living the most\nsimple and ascetic life possible, but neither way provided him with the knowledge he\nsearched for. The question of “why humans beings have to suffer” would remain\nunanswered, until one day Siddhartha sat beneath a large tree in a place called Bodh\nGaya. Siddhartha Gautama decided to sit under this fig-tree until he found the answer to\nthis question, and so he remained under the tree for 49 days, meditating deeply and being\ntempted by demons that offered him pleasures or threatened him with terrors so he would\nabandon his quest. Siddhartha Gautama remained devoted to his meditations under the\nBo-tree (a fig tree found in India, Nepal, Sri Lanka, and China) until he gained the\nknowledge he sought and thus became enlightened. Not only did Siddhartha then\nunderstand why humans suffer, he also understood how to get rid of suffering in the\nworld. This knowledge transformed him into “The Enlightened One”, or Buddha.\nGautama explained his views to the public for the first time in 528 BCE at the\nDeer Park of Sarnath, quickly attracting followers along the Ganges river valley.\nGautama, now known as Buddha, began to organize these followers into communities of\nmonks. These monks possessed only yellow robes and begging bowls. They would travel\nbarefoot and preach Buddha’s teachings. Buddha and his monks reached much of\nNorthern India. In 483 BCE Buddha died at over 80 years of age. His final words to his\ncompanions were: “Decay is inherent in all component things! Work out your salvation\nwith diligence.”\nThe teachings of Buddha were very attractive to many Indians. The most\nimportant part of his teachings were the Four Noble Truths: (1) all life brings suffering;\n(2) desire causes suffering; (3) one has to eliminate desire to end suffering; (4) one can\neliminate desire by leading a disciplined life, following the Nobel Eightfold Path. This\npath demanded right belief, right resolve, right speech, right behavior, right occupation,\nright effort, right contemplation, and right meditation. By following these teachings\n79 Buddhists believed that they would reduce desire, find personal salvation from the circle\nof incarnation, and achieve Nirvana, a state of mind indicating perfect independence in\nspirit. The Noble Eightfold Path and the Four Noble Truths are together called Dharma,\nwhich Buddhists of all sects share as the core of their beliefs. Buddhism was also more\nattractive than Jainism, as Buddhism did not require such an extreme ascetic life style.\nHowever, both orders shared a common belief in the non-recognition of social\ndistinctions, which gave Buddhism the same popularity as Jainism among the lower\nclasses.\nWhat also helped to make Buddhism more popular than the Vedas and the\ntraditional religion of the Brahmins was that Buddhism used the common language of the\npeople and not Sanskrit, making it accessible to a larger audience. Lastly, another reason\nfor Buddhism’s growing popularity was support from the Mauryan Empire under Ashoka,\nwho converted to Buddhism around 260 BCE.\nBuddhism was not easy for everyone to follow, as people were still required to\nmake sacrifices if they hoped to live a righteous life, which could include letting go of\npersonal property, worldly goods, and social distinction. As a result, new developments in\nBuddhism took place between the 3rd century BCE and 1st century CE: Buddha was\nincreasingly considered to be divine and was thus worshipped as a god, and Buddhist\nmonasteries began to accept gifts from wealthy individuals hoping to achieve salvation.\nThis loose form of Buddhism eventually grew in popularity and spread around Asia in the\nearly centuries of the Common Era. However, the strict form of Buddhism did not\ndisappear; it remained in areas like Myanmar, Thailand, and Sri Lanka.\nHinduism\nThe third of the evolving faiths in India was Hinduism. It was inspired by the Vedas as\nwell as the Upanishads. Hinduism became even more popular than Jainism and\nBuddhism among the people in India. The Hindu values and their development are\noutlined in two great epic poems called Mahabharata and Ramayana. The Mahabharata\nwas originally composed around 1500 BCE and was not at first a religious work. It\ndescribes a civil war fought between two groups of cousins over the control of Northern\n80 India. Later, around 100 CE, the Brahmins introduced religious aspects into it, for\nexample by giving the god Vishnu a more important role in this civil war. Originally, the\nsecond poem, Ramayana, was nonreligious as well. It was a love story about prince Rama\nand his wife Sita. The last work offering insight into Hinduism is a shorter poem known\nas the Bhagavad Gita. It was composed by several people between 300 BCE and 300 CE.\nIn this poem we find a dialogue between a warrior called Arjuna and his charioteer,\nKrishna, who is actually a human incarnation of the god Vishnu. The Bhagavad Gita\ndescribes Arjuna’s reluctance to fight when he recognizes relatives and friends among the\nenemies. Krishna tries to convince him to fight by using several arguments. These include\nthe claim that killing relatives and friends does not kill their soul, since only the body\ndies, as well as the claim that it is Arjuna’s duty to fight as a member of the Kshatriyas,\nthe warrior-caste. Lastly, Krishna tells Arjuna that he would find everlasting peace and\nhappiness if he would worship Krishna completely. In short Krishna’s arguments detail\nthe core understanding of Hinduism: understand the soul, know your duties, and worship\nand devote yourself completely to god. These core beliefs of Hinduism are important, as\nunder Hinduism people are able to live non-ascetic lives and perform their duties while\nstill leading a pious life. This new idea was different from core ideas of the other\nreligions, which required detachment from the world to end the cycle of incarnation.\nLater, Hinduism began encouraging participation in worldly affairs: in addition to the\nprinciple of obedience to religion and the moral laws, Hinduism developed the principles\nof the pursuit of economic well-being and prosperity (called Artha), the enjoyment of\nvarious pleasures (called Kama), and the salvation of the soul (Moksha). The balance of\nDharma, Artha, and Kama would make Moksha possible.\nHinduism replaced Buddhism as the most popular religion in India when the\nGupta emperors started to support it. By 1000 CE Hinduism was the dominant religion in\nIndia, and a few centuries later both Hinduism and Islam forced Buddhism into the\nshadows.\n81 Conclusion\nThe advances of Indian culture soon spread, such that all regions of India were able to\nshare a common language, prosperity and faith. The caste system developed in India as a\nunique way to ensure social discipline and order. The advances and developments made\nin science, philosophy and religion during India’s Classical period are still in use around\nthe globe.\n82 9. Early Greece\nIntroduction\nThe achievements of the ancient Greeks helped to develop our modern (Western) world.\nHowever, they did not emerge on their own. The successes and achievements of the\nGreeks are based on advances of prior civilizations, for example those of Mesopotamia\nand Egypt.\nThe area that is modern day Greece was the heartland of Ancient Greece. It is\nlocated in a region called the Balkans, shared by other modern countries like Serbia,\nRomania, Croatia, Bulgaria, Albania, and Macedonia. The sea, that is the Mediterranean,\nwas the dominant factor in the lives of the Ancient Greeks. Around 7250 BCE the first\nboat was built in the area, probably made of papyrus. Like modern Greece, ancient\nGreece was not a very rich and fertile land. Greece consists of large mountain ranges;\nmost mountains are not very tall but, but they are steep and rugged, providing protection\nbut also separation. The source of life for the Greeks was the sea; access to the sea was\nvital as this was an important source of food and the most convenient way to travel. Other\ncivilizations that we have discussed usually had fertile river valleys capable of\nstimulating farming and civilization.\nCycladic Civilization\nThe first civilization to emerge in the area that later became ancient Greece was not itself\na Greek civilization. It is called the Cycladic civilization, a name derived from a chain of\naround 25 islands on which these people emerged. Its origin is dated to around 3200\nBCE, the period when the Neolithic age (New Stone age) turns into the Bronze Age.\nThe Cycladic people created a large collection of female statues over several\ncenturies. These female statues presumably indicate the worship of a mother goddess as\nwell as the existence of fertility rituals. These statues date back as far as 2600 – 2400\nBCE and are remarkable for their elegance and the craftsmanship with which they were\ncreated. Some of these statues were life-sized, which is also remarkable because there\n83 were few places that produced life-sized statues this early in history (Egypt is an\nexample). Few of the statues were male.\nMinoan Society\nOn the island of Crete in the Aegean Sea we have evidence of another early civilization.\nAround 2900 BCE on the island of Crete the Minoans emerged. This name does not\nreflect what these people called themselves, but is rather a name given to them centuries\nlater by modern scholars. The Greek poet Homer wrote about a powerful king on the\nisland of Crete named Minos. Whether king Minos ever existed or ever ruled over the\nisland of Crete is doubtful. Like the Cycladic civilization, the Minoan civilization\nemerged in the area of ancient Greece, but is not considered a Greek civilization.\nThe achievements of the Minoan civilization are numerous. Among them are the\ngreat palace complexes located throughout Crete and other islands that were under\nMinoan dominance. Most of these palaces were built between 2000 and 1700 BCE, and\nthe most famous of these palaces was built at Cnossos (Knossos). Parts of the great\npalace remain and can still be seen there to this day. Historians suggest that the size of the\npalaces and the numerous rooms used for storage helped inspire the tale of the labyrinth\nand the Minotaur.\nMany of the Minoan ruins were found on the island of Crete in the 1920s by the\narchaeologist Sir Arthur Evans. It is important to understand that these palaces were the\npolitical, economic and cultural centers of Minoan society; they contained no defensive\nstructures against invaders. For economic purposes the Minoans invented a script which\nwe call Linear A, which the Minoans presumably used for keeping track of incoming and\noutgoing goods. Linear A has yet to be completely deciphered. In terms of religion the\nMinoans seem to have worshipped a mother (creator/earth) goddess, and priestesses\nplayed an important part in the performance of rituals. Also, it seems that women played\nan important part in Minoan society.\nThe location of the Minoans on the island of Crete played a key role in their\ndevelopment, as the island is located close to both Egypt and Phoenicia. Around 2200\nBCE the Minoans learned advanced shipbuilding and sailing techniques from the\n84 seafaring Phoenicians; accordingly between 2200 and 1450 BCE the Minoans created a\nlarge trading network. During the peak period of their civilization, the Minoans\nflourished because of these networks, which filled their palaces with goods. Minoan art,\nwhich emphasizes peaceful scenes, was likely influenced by Egyptian art. The Minoan\ngraves also give us information about how they lived. The graves were communal, with\nno real emphasis on standing out from other graves, and often show no competitive\npattern.\nAfter 1700 BCE natural catastrophes hit the area in the form of earthquakes, tidal\nwaves, and volcanic eruptions, one of which devastated Thera (Santorini) in 1628 BCE.\nAfter 1450 BCE the Minoan civilization, which at this point was very wealthy from trade,\nhad become an attractive target for invaders eager to conquer the Minoans.\nMycenaean Civilization\nThe first Greek civilization evolved around 1800 BCE. It is called the Mycenaean\ncivilization, named after the city of Mycenae, which is located in the Peloponnesian\npeninsula. Once again the term Mycenaean was not used by the people themselves;\nmodern scholars introduced this term because Homer writes that the Mycenaean king\nAgamemnon led the largest amount of troops against Troy. The assumption is that\nMycenae had to be a dominant city at that time. The German archaeologist Heinrich\nSchliemann excavated key areas in Greece and Turkey in the 1870s and 80s, eventually\ndiscovering the great cities of Mycenae and Troy, both of which had previously been\nthought to be nothing more than myth.\nThe graves found around Mycenae demonstrate a drastic difference between the\nMinoans and the Mycenaeans. The Mycenaeans possessed a competitive class system, as\nis evident in their burial patterns. Graves were built to show social status and sometimes\ncontained the latest technology and luxuries like chariots and silk goods. Unlike Linear\nA, the Mycenaean script, called Linear B, was decoded by Michael Ventris in the 1950s.\nIn Linear B texts we have discovered, among other things, the word “slave”, which\nindicates that slavery was already common during the Mycenaean period. The\nMycenaeans were able to take over the Minoan civilization, seemingly not militarily, but\n85 slowly and more importantly peacefully. Mycenaean art is usually violent, depicting\nmostly scenes of hunting and warfare. Another difference between the Mycenaeans and\nthe earlier Minoans can be found in religion: while the Minoans worshipped a female\ngoddess as a major deity, the Mycenaeans turned to a male sky-god, who is the dominant\ngod among many.\nAround 1200 BCE the Mycenaean empire experienced a period of decline like\nmany other regions around the Eastern Mediterranean. This is the beginning of the so-\ncalled “Dark Ages” of ancient Greece. Between 1200 and 800 BCE the economy of all of\nGreece quickly came to a standstill, and the population decreased. Little evidence points\ntoward what exactly caused this Dark Age in Greece; no evidence exists of a foreign\ninvader attacking Greece nor Mycenae in particular, especially as the Mycenaean palaces\n(unlike the Minoan ones) were protected by thick giant walls said to have been built by\nthe Cyclopes. The agriculture and trade networks of Mycenae during this period began to\nwither away along with the knowledge of Linear B. The reason for the loss of an entire\nwritten script was the fact that not many people actually knew Linear B, as it was\nreserved only for keeping track of trade. Secondly Linear B was very hard to master, as\nonly a few officials in the city centers knew it. Not many people knew how to read and\nwrite, and instead they passed history on in the form of oral tradition through the\ngenerations. Once trading came to a halt there was no more use for Linear B.\nArchaic Period Greece\nWith the fall of the Mycenaean civilization at the start of the 12th century BCE, Greece\nexperienced a setback in culture and development. However, by the 9th and 8th centuries\nBCE Greece began to recover, marking the beginning of a new period between 800 and\n500 BCE, known as the Archaic Period. The economy in Greece began to recover and\ntrade networks were slowly (re)built. The population of Greece also increased in a way\nthat stimulated more trade and also colonization of areas of the Mediterranean Sea\noutside of Greece to serve as trading posts.\nIt was around 850 BCE that the Greek people came in contact with the\nPhoenicians and their system of writing. The Phoenicians, the great sea traders, had\n86 borrowed the cuneiform system from the Mesopotamians and had noticed its inefficiency\nin keeping track of trade goods; the result was the development of a set of letters, the 22\nconsonants of the Phoenician alphabet, which could be combined to create a word. This\nproduced a much faster and superior system of writing than cuneiform, which required\nthe memorization of many symbols. The Greeks, seeing the use of this writing system for\ntrade, adopted the Phoenician alphabet and added vowels, thus creating a phonetic\nalphabetic script.\nDuring this early portion of the Archaic period we see the return of art and\nliterature in Greece. The earliest known use of the Greek alphabet dates to the 8th century\nBCE. The drinking cup now called “The Cup of Nestor” was found in the grave of a boy\nin Italy. It contains a three-line epigram and reads:\n“I am the cup of Nestor from which one can drink with pleasure, but whoever\ndrinks from this cup will immediately be seized by desire for Aphrodite of the\nbeautiful diadem.“\nNot only do these lines represent the earliest known use of the Greek alphabet, they also\nrepresent one of the earliest uses of Greek poetry to have come down to us in its original\nform from the time of Homer’s celebrated epics. The location of the cup of Nestor\nindicates that trading around that time (770 BCE) was again widespread.\nThe Greek expansion and colonization of other parts of the Mediterranean Sea has\nleft traces in many modern day cities that are still flourishing: Naples, Istanbul, Nice,\nMarseilles.\nReligious festival at Olympia\nDuring the early Archaic period, the 8th century BCE, the first monumental temples were\nbuilt in Greece, starting with simple one-room structures to local gods. On the island of\nSamos we find one of the earliest monumental Greek temples, the 8th century BCE\nsanctuary to the goddess Hera. By 700 BCE there were already many of these large\n87 temples all over the Greek world. Along with these temples came the rise of Pan-Hellenic\n(all Greek) festivals that attracted worshippers from all over the Greek world.\nBy the 8th century BCE Greece was divided into hundreds of separate and mostly\nindependent city-states called poleis. All Greeks worshipped the same pantheon of gods,\nbut each city preferred one or some to the whole community of gods. The most famous\nand early shrines were those of Zeus and Hera in Olympia in the Western region of the\nPeloponnese, Apollo and Artemis at Delos, Zeus at Dodona, and Apollo at Delphi.\nIn 776 BCE, athletic contests presumably became a part of the festival of Zeus at\nOlympia. These contests or games were held every four years at Olympia and followed\nan eight year cycle of Babylonian origin with the game being held at the beginning and\nmidpoint of this cycle. The games were open to men who could afford to become\noutstanding athletes, meaning those who could put a lot of time into their training since\nthey did not have to work all day. The athletes competed naked. The two main areas in\nwhich these men would compete were running and wrestling, the main event of which\nwas a sprint of 200 yards (180m) called the Stadion, which described the length of the\nrace in ancient Greek. Unlike the modern Olympic Games, the ancient games did not\nfeature representatives of national teams, but rather individuals competing against each\nother. The prizes for the winners consisted of nothing but a garland made out of olive\nleaves. The prestige or fame of winning the competition, however, led to many material\nrewards, such as a lifelong free eating “ticket” for the winner in his home city.\nAttendance at the Olympic festival was limited to men and unmarried women. According\nto one source (Pausanias), women who were not married competed in their own separate\nfestival in honor of Hera, called the Heraia.\nLater, professional athletes dominated the games. The most famous athlete in\nancient times was Milo from Croton, in Southern Italy. He became famous because he\nhad won the wrestling competition six times in a row beginning in 536 BCE. What\nseparated Milo from other athletes, apart from skill, was an element of showmanship: he\nwas known according to some sources to tie a chord around his head and to hold his\nbreath until the veins around his head enlarged so much that they snapped the cord.\nThese festivals and contests were very important to the Greeks, who used them to\nshow respect to and worship Zeus and the gods; in addition, it is important to note that\n88 the Greeks loved competition in many areas of their lives. Usually a period of truce\nbetween warring city states would be declared to allow for secure travel on the part of the\nathletes to and from Olympia.\nCity Development\nThe development of the polis, or Greek city-state, occured chiefly between 700 and 500\nBCE. The centuries of the Dark Ages had brought a transition from the Mycenaean\npalaces to independent city-states. These were the basic political unit of Greek\ncivilization during the Archaic and Classical periods. A polis is typically defined as a\nfortified urban center, which controlled some amount of territory, together with outlying\nvillages. The size generally would be such that one could walk from one end to the other\nend of the polis in one day. The cities were independent, sovereign states. They guarded\nborders and minted their own coinage. All Greek cities shared several common traits:\nthere was a fortified lower town as well as an acropolis at or near the center. The word\nacropolis literally means “high/elevated city” in ancient Greek, as typically the acropolis\nwas built on a hill, separately fortified, and easily defended. Ideally the acropolis served\nas a final safe place of refuge should the lower town fall. Besides being a place of last\nresort, the acropolis of each polis also served as the home to the sanctuary of the principle\ndeity of the city.\nOverall the lower part of the polis or the town was divided into three different\ntypes of spaces: public, private, and religious. The most important public space was\ncalled the agora, a large central square often home to the markets. There the inhabitants\nwould also hold meetings, elections, festivals, athletic contests, military processions, and\ntheatrical performances. Next to the agora were public buildings necessary to run the city.\nAlso, we usually find a sanctuary in the center of the polis where an altar was located for\nmaking animal sacrifices as burnt offerings to the god/goddess.\nThe Greek landscape for the most part is rugged and mountainous, which is a\nmajor reason why Greek civilization was characterized by the development of many\nisolated city states during the Archaic period. The arable land attached to the polis was\nrarely fertile enough to feed a large body of inhabitants. For this reason many city-states\n89 moved towards the foundation of colonies. The job of these colonists was to help find a\nsource of food or at least help provide for means for the polis to remain functional, even\nif that meant a loss in population through the often harsh long trip to faraway lands. The\nproblem that arose for these colonists was that they were all male. Often they found\nwives among the local neighbors of the new Greek colony, sometimes through peaceful\nnegotiation, other times through violently kidnapping the local girls.\nDuring this period of colonization, the Greeks often asked the gods for approval\nand guidance before embarking on their dangerous trip. Most frequently they consulted\nthe god Apollo, who was the god of light, music, archery, and prophecy. Apollo’s most\nimportant oracle was located at the sanctuary of Delphi, a place surrounded by mountains\nin central Greece. In the Delphic sanctuary a prophetess called the Pythia spoke the will\nof Apollo, responding to questions from visiting petitioners. There are several theories\nthat try to explain what happened there. One of these theories suggests that the Pythia\ninhaled vapors rising from a cleft in the mountain; these vapors probably caused a\nprophetic frenzy; the people then believed that Apollo answered their questions. The high\nconcentration of ethylene gas leaking out of cracks in the ground near the Delphi\nsanctuary today supports this theory. In addition, the fact that the temple at Delphi was\nclosed to visitors in the winter seems to fit in with this idea, since the release of ethylene\ngas is minimal during the winter months. In any case, the people who received blessing\nfrom Apollo to go forth and establish a colony for their polis helped to enhance the\nreputation of Delphi, which lasted for centuries. Thus Delphi played a crucial role in\nGreek international affairs.\nSparta\nThe physical and political separation of Greek city-states produced not just unique\ncustoms but also unique types and forms of government. Many of our modern\ndescriptions of government have roots in ancient Greek: democracy, monarchy, oligarchy,\nand theocracy. Tyranny (a word that did not originate in ancient Greek), for instance, was\ncommon in other cities and sometimes followed oligarchies. However, a tyranny early on\nhad nothing to do with harsh and cruel leadership over people as it does now. During the\n90 Archaic period it meant merely that a man seized power in an unconstitutional manner. It\nhad no meaning as to how the power was wielded. Other city-states (Athens) developed\ndemocracy, meaning “rule by the people”, which differed from most democracies today\nin the sense that in ancient Greece only male citizens had the ability to participate in\ngoverning. In the 5th century BCE the democracy in Athens became one of the earliest\nand the most renowned democracy in Greece.\nThe government form of ancient Sparta was a monarchy, but this monarchy in\nSparta was complex as it also was part of an oligarchic system resulting in a mixed\nconstitution. The city of Sparta is located in a region known as Laconia or Lacedaemon,\nfor which reason the Spartans are also often called Lacedaimonians or Laconians. This\nregion is located in the Peloponnese, where Sparta itself occupied a valley between\nrugged mountains that made it easy to defend. Fresh water came to Sparta by way of the\nriver Eurotas; the Spartans had access to the sea through a harbor called Glytheon, 25\nmiles south of the urban center. Right outside of this harbor, however, was dangerous sea\nknown for high waves and strong currents, which protected the Spartans from seaborne\nattacks. Early on these difficulties also prevented the Spartans from developing into a\nnaval power.\nThe origin of the Spartans is quite unclear. What is known is that at some point\nthe Spartans conquered some of the local inhabitants of Laconia and turned them into\nhelots, who were much like slaves. In the late 8th century BCE Sparta conquered the\nricher land of Messenia in the West and turned the Messenians as well into helots.\nMountains between Laconia and Messenia made it very difficult for Sparta to exercise its\npower over Messenia, which encouraged the Messenians to revolt against the Spartans\nwhenever they saw an opportunity. The consequence for the Spartans was constant\ndanger at home from the helots, especially from those living in Messenia. The hostility\nthat surrounded Sparta led to the creation and development of a harsh military lifestyle,\nwhich was admired already in antiquity. Most information we have on Sparta and its\nmilitarized lifestyle comes from the author Plutarch, who lived from about 45 CE to 120\nCE. Plutarch and other sources identify several customs that they believed to be part of\nthe life of Spartans. Officials, for example, scrutinized the Spartan infants at birth in order\nto determine their vitality; basically, these officials decided if the infants were to be raised\n91 or killed. Additionally, in ancient Sparta all boys and girls, depending on their gender,\nreceived the same education. The fathers were not involved in the process of education.\nWhen the boys reached seven years of age, they were taken away from their families and\nbegan to train to be soldiers in groups called herds. As members of these herds, Spartan\nboys learned obedience, group solidarity, and military skills. By the end of their training,\nthese warriors were in their thirties.\nThe training of the boys into warriors was considered harsh by ancient standards.\nThe boys were forced to go everywhere barefooted all the time in order to toughen their\nfeet, and often completely naked as well. At age 12 their hair was cut short, and everyone\nwas allocated only one cloak annually to wear throughout the year. Magistrates called\nEphors who served as overseers came every day to inspect the boys, and every ten days\nthey came to examine them in the nude. The boys had to sleep in groups on rough mats\nthey made themselves. They were not allowed to speak at will. In fact the word laconic,\nmeaning “not using many words”, has its origin in the Greek word Laconian, one of the\ncommon names for the Spartans. They boys were also kept hungry, forcing them to steal\nfood. This was intended to train young Spartan boys to use stealth, and if the boy was\ncaught he was punished severely. In the Classical period the young boys were sent out to\nlive in the wild in secret bands with which they had to hunt down any helots (slaves) who\nwere thought to have rebelled against the government. If the boys and young men did not\nsurvive these conditions, they could not become equals (known as homoioi) with full\ncitizen rights. Those Spartans that continued in training were expected to grow their hair\nlong and to grow a beard with no mustache by age twenty. The male Spartan was\nexpected to sleep and eat in common barracks and spend his time training for military\nservice until he reached thirty. A Spartan male would eat his meal along with the 15 other\nmembers of his army group, helping to strengthen the bond between its members and to\nenhance their loyalty to one another. On the other hand, whoever could not handle this\nlifestyle was forced to wear colorful cloaks and was forced to shave off part of their\nbeard, making them look ridiculous and disgraced. Spartan society stigmatized those who\ncould not cope with the rigorous military life. The successful members of the Spartan\narmy, however, became the premier fighters of all of Greece. All of the training and the\nharsh living conditions were designed to transform the young Spartan male into the\n92 perfect soldier, who was skilled and courageous in battle, who never ran away or\nsurrendered, who always stood his ground, and who would willingly give up his life for\nthe city.\nSpartan women, on the other hand, also felt the impact of the military lifestyle.\nBecause a Spartan girl was raised to give birth to a tough soldier-to-be, women faced\nconsiderable pressure to help produce manpower for the Spartan army. Men were legally\nrequired to marry; those that remained bachelors too long were fined and ridiculed. The\nrole of women in Spartan society was definitely different from that of women in other\nGreek states. Women were educated in Sparta by the government (in other cities the\nfathers or husbands were responsible). Spartan women were allowed to spend most of\ntheir time outside exercising, which was not allowed anywhere else. And unlike other\nGreek women, Spartan women were well nourished and were allowed to drink wine.\nWhile the men were away it was the duty of the Spartan women to manage domestic\naffairs, which gave Spartan women a lot of responsibility and freedom and the right to\nown property.\nThe Spartan constitution is also rather unique. We find elements of monarchy,\ndemocracy, and oligarchy mixed into one constitution to provide a system of checks and\nbalances. Sparta was ruled by two kings, one to rule at home and the other to take charge\non the battlefield. The two kings served with a group of 28 elders in an assembly called\nthe Gerousia.\nAlong with this unique government the Spartans disliked the concept of private\nproperty. In Sparta there was no form of coinage with only iron spits several feet long\nbeing the valid currency for trade. This economic system actually worked very well for\nthe Spartan state for many generations. Sparta was idealized in antiquity and in that sense\nserved as a counterpart to Athens. In fact this idealized Spartan utopia was also the basis\nof Plato’s Republic. In this book Plato uses Spartan ideas such as a social system based\non commonality and totalitarian control. In Plato’s state men and women of the highest\nclass get the same education, with women also receiving physical training; sexuality is\nguided by eugenic considerations stipulating that only the strongest may live while the\nweak should die. Members of the lower classes do all the housework, while only those\n93 belonging to the top class produce strong children, and thus according to Plato, a strong\nsociety. In this utopian world there is no form of private property and money.\nConclusion\nThe early development of Greece and the region around Greece was vital to the\ndevelopment of the Western world as we know it today. All the city-states of Greece\nworshipped the same group of gods, but specific individual gods were often selected to\nbe the patrons of each city. The colonization stimulated by these growing cities also\nspread Greek ideas like their borrowed alphabet and concept of government to the rest of\nthe western Mediterranean. Delphi became a powerful center because of its connection to\nthe god Apollo and thus to the divine. The Spartan way of life provides us with a source\nfor debate, as many people seem divided over whether we should praise the patriotic and\nbrave people of Sparta, or see their society as the forerunner of totalitarian regimes like\nthat of Nazi Germany, with its emphasis on a perfect society of strong people. Sparta’s\ngovernment and society worked for many generations, playing a crucial part in later\nClassical Greece. In spite of the differences between individual cities, the Greek\ncivilization during the early part of the Archaic period gradually developed a\ncommonality that would result in Pan-Hellenic festivals such as the one at Olympia – a\nfestival to worship Zeus that included an athletic competition in which individual athletes\nof city-states could earn fame and reputation, for them as well as for their city.\n94 10. Archaic and Classical Greece\nIntroduction\nIn the previous chapter we discussed the formation of Greek civilization from the\nNeolithic Period to the beginning of the Archaic Period. As we will see in this chapter,\nthe first steps of democracy as a form of government are deeply tied with the growth of\nAthens as a city-state. Unlike Sparta, which found a way to solve quarrels between\naristocratic families and the people through total control of its citizens, Athens found a\nunique way to deal with these problems: by letting more people participate in politics.\nAthens\nDuring the late Bronze Age (1600-1150 BCE) Athens was already the largest and most\nimportant settlement on the Attica Peninsula. During the Greek “Dark Ages” (1150 to 750\nBCE) Athens first suffered like many other places around the Eastern Mediterranean, but\nit experienced a significant growth in its wealth sooner than many other places in Greece\nthrough trade to overseas regions. Some graves dating back to the 9th century BCE in\nAthens, for example, are full of riches from areas throughout the Mediterranean. At the\nend of the “Dark Ages” in the 8th century BCE the population of Athens rose sharply, an\nindication of growing prosperity in the region. The result was the expansion of Athens\ninto nearby parts of Attica; it is interesting to note that unlike many other city-states,\nAthens did not partake in any colony building overseas. Many of the settlements in Attica\nconsidered themselves Athenian and were not subject to a subordinate role, which shows\nthat Attica was unified under Athens. However, this unification created problems, as the\nmajority of the people under Athenian leadership lived in the countryside of Attica and\nnot in the city of Athens. They therefore faced a lengthy journey to make it to Athens and\nparticipate in government. The fastest growing segments of the population in Attica were\nthe free peasants living outside of Athens. As these landowners became wealthier and\nmore powerful, they began to demand more rights in the politics of the city.\n95 The early government of Athens was aristocratic, as was the case for most other city-\nstates throughout Greece during the Archaic Period. The reason why Athens moved\ntowards a democracy instead of an oligarchy like Sparta was probably the rapid growth in\npopulation among the peasants in Athens and Attica. Their demands to have a say in\npolitics forced the governing members of Athens to recognize them because their role in\nproviding food for Athens gave them increasing power.\nA big problem in Athens and Attica during the Archaic Period was inequality in\nthe distribution of wealth. By the beginning of the 6th century BCE, this inequality\nendangered social peace: in order to pay off debts, some landowners were forced to give\nup the rights to their land, while other people had to sell themselves into slavery. To\nresolve this social conflict a respected member of an important Athenian family had to\nmediate between the rich and poor. His name was Solon. By creating a new set of laws,\nhe prevented further turmoil or even a civil war.\nIn the 6th century BCE Solon introduced reforms in Athens. His legislation took\nplace in the 590s BCE. He was seen as a political figure, a lawmaker, and a poet. Solon's\npoetry is considered an autobiographical source that explains his choice of taking the\nmiddle course between the ambition of the wealthy people and the immoderate demands\nof the poor. His political reforms were made public in writing, making it possible for all\ninhabitants of Athens to read the new laws. Solon’s reforms of Athens primarily dealt\nwith the citizen body of Athens. The reforms in general tried to link political power to\nincome and not to birth and abolished debt slavery.\nThe reforms of Solon helped Athens to avoid turmoil and civil war, but they could\nnot prevent the rivalries that often broke out between members of the noble families.\nThese rivalries in other cities frequently resulted in the rise to power of tyrants. In\nAthens, in 561 BCE, a man named Peisistratus, a distant relative of Solon, seized power\nunconstitutionally. According to Herodotus (1.59), Peisistratus wounded himself and his\nmules and then appeared on the Agora demanding bodyguards for protection. The\nAthenians granted him the requested bodyguards, although Solon warned them not to do\nso. Afterwards Peisistratus seized the Acropolis (in Athens) and with it gained control\nover the city. For about 5 years he stayed in power, until a revolt of aristocrats drove him\nout of office, as well as out of Athens. A few years later, Peisistratus managed to return.\n96 Herodotus describes how Peisistratus dressed a beautiful and extraordinarily tall woman\nin armor and put out the rumor that Athena herself was escorting him back to Athens to\nrestore him to power (1.60). Thus Peisistratus returned to power, but only to be driven out\nagain in 555 BCE. He then returned once again in 546 and remained in power until his\ndeath in 527 BCE. His family would rule Athens until 510 BCE, when the last of his sons\n(Hippias) was expelled. After this period of tyranny in Athens, the people began to\ndevelop a democracy. Beginning in 508, a series of political reforms gradually changed\nAthens into a radical democratic state.\nThe newly formed democratic city-state of Athens, however, would collide with\nthe dominant monarchy in the East, the Achaemenid Dynasty of Persia. Democracy, as\nthe word implies, entrusts a major share of power to the people, who value their freedom\nand responsibility. So did the Athenians. King Darius attempted to invade Greece in 492\nand again in 490 BCE. In 490 BCE the Athenians and Plataeans pushed back the Persian\ninvaders in the Battle of Marathon. This was a huge achievement considering the\nenormous power of Persia and the relatively small size of both Athens and Greece itself,\nwhich up to this point had consisted mostly of separate city-states sharing only a\nlanguage and the worship of the same gods, among other things. Darius’ successor\nXerxes once more tried to conquer Greece in 480 BCE with a far larger army. He too\nfailed to conquer the Greeks, famously losing the naval Battle of Salamis in 480 BCE.\nThese wars between Greece and Persia became known as the Persian Wars. Their\noutcome for the Greeks cannot be underestimated; for one thing, they gave the Athenians\nconfidence that they could achieve the impossible, which further supported the\ndevelopment of democracy.\nAthens reached its peak in the 5th century BCE under the leader Pericles, who\nhelped influence Athenian politics from 461 to 429 BCE, the years often referred to as the\n“Golden Age” of Athens. Pericles was responsible for many of the improvements and\nachievements in Athens that transformed it into the most sophisticated of all Greek city-\nstates. It was also a home to brilliant thinkers, philosophers, dramatists, poets, artists, and\narchitects.\n97 Athenian Architecture and Festivals.\nThe most famous building project of Greece was initiated and undertaken by Pericles.\nThe Athenians had begun rebuilding their temples under Kimon to repair the damage\ninflicted by the Persians during the sacking of Athens. The most conspicuous temple on\nthe Acropolis in Athens is known as the Parthenon for the goddess Athena Parthenos.\nThis temple was designed by the architect Ictinus and took 15 years to complete. The\nParthenon still stands on top of the Acropolis in Athens, even though it was heavily\ndamaged by an explosion in 1687 when the Venetians fought against the Ottoman Turks\nin Athens. (The Turkish army used the Parthenon and the surrounding temples as a\npowder magazine, which was blown up by a cannon shot from a German gunner.)\nHowever what remains of the Parthenon gives us a detailed look at Athens as it emerged\nfrom of the Persian Wars. Inside the Parthenon was a massive statue of Athena created by\nsculptor Phidias, who also created the famed statue of Zeus in his temple at Olympia.\nBoth statues made huge impressions on visitors to these temples. Painters also decorated\nother buildings with scenes of Greek victory: Polygnotus of Thasos, for instance,\ndecorated the Stoa Poikile (a colonnaded porch where the people could discuss politics\nand other issues) with scenes of the Battle of Marathon.\nThe art of Greece changed greatly from the Archaic Period into the Classical\nPeriod of Greece, especially in bronze casting and sculpture. Most notably, the rigid\npostures of archaic bronze or marble statues gave way to increasingly naturalistic\npostures capable of expressing more movement. One of the most famed pieces of\nclassical statuary was the discus thrower by Myron from Eleuthera in Attica. Others\nincluded the spear-bearer (Doryphoros) by Polycleitus. Vase painting reached its peak\nduring the Archaic Period and during the time of Pericles continued to display a high\nlevel of artistic accomplishment. In a speech that he attributes to Pericles, Thucydides,\nthe great historiographer, explains (2.34-46) that in Athens people delighted themselves\nevery day and made attempts to get rid of melancholy. According to Pericles, the\nAthenian people achieved this through festivals and sacrifices. As we discussed, there had\nlong been festivals throughout Greece, most notably the festival at Olympia, which\nincluded an athletic competition. However, there were also other types of festivals with\n98 competitions in song and music; there were even dramatic competitions that called for the\nperformance of tragedies and comedies. The greatest of these drama/theater competitions\ntook place annually in March in Athens and was called the Greater Dionysia. The festival\nhad been founded by the Athenian tyrant Peisistratus and, for the most part, occurred\nevery year. The tragedies and comedies were all performed in honor of the god of ecstasy\nand wine, Dionysus. Guests from all over Greece were welcomed, and it seems that the\nmember states of the Delian league were required to pay tribute to Athens during this\nfestival. Each of these performances took place outside, in an open air theater. The\nGreater Dionysian performances took place on top of the south slope of the Acropolis of\nAthens, not in the theater of Dionysus in the lower level of the city.\nThe Greater Dionysia followed a procedure in which three poets had to compose\nthree tragedies and one satyr play each, for a total of nine tragedies and three satyr plays.\nIn addition, five comedies were added to the festival, which meant that there were 17\nperformances altogether over a four-day period. The performances were judged by a\ngroup of ten people representing each of the ruling tribes of Athens. The judges decided\nwhich poet, which protagonist, and which chorus were to receive first prize. Each day the\npeople participating in the festival would enjoy seven to eight hours of performances,\neven in times of war. Over the years, three great Athenian tragedic playwrights often won\nfirst place at the Greater Dionysia: Aeschylus, Sophocles, and Euripides. Aeschylus, the\nmost successful of the playwrights, may have written as many as 90 tragedies, of which\nonly a few survive to this day. The oldest of his plays that have survived is called The\nPersians and was performed in 472 BCE, only 8 years after the Battle of Salamis. Many\nveterans of the battle against the Persians were presumably present when the play\ndebuted. Aeschylus died in 456 BCE, and up to that point he had dominated the Greater\nDionysia. The play The Persians is fascinating because not a single Greek individual is\nnamed in the play. Instead, the characters of the play are all Persians, and the play as a\nwhole conveys a sense of objectivity instead of simply praising Athenian heroism and\nnationality. In Aeschylus’ own characterization of the Persians, he develops the argument\nthat the Persians lost because of the hybris of Xerxes, who offended and was then\npunished by the gods.\n99 Another famous surviving work by Aeschylus is the three-part tragedy called the\nOresteia. All three plays deal with the family of Orestes. Aeschylus also changed the\ntechnical aspects of the performance by adding a second actor along with the main\nprotagonist and the 12-person chorus.\nThe second great playwright of classical Athens would come to fame after beating\nhis rival Aeschylus in the Greater Dionysia. Sophocles, around twenty years younger than\nAeschylus, became a very successful playwright. He differed greatly from his rival in the\nway he depicted his characters: while Aeschylus usually characterized them as\nsuperhuman on many levels, Sophocles instead created characters who were similar to\nreal people, which allowed the audience members to identify with them more easily.\nSophocles would also add another actor to the play (a third one).\nThe youngest of the three great Athenian playwrights was Euripides, born around\n480 BCE, after the battle of Salamis. He lived until around 407-06 BCE. Between\nSophocles and Euripides a generational change took place: the veterans of the Persian\nwars (like Aeschylus, who had fought in the battle of Marathon himself), had died.\nEuripides stayed far away from politics all his life, and this attitude is detectable in his\ndrama, in which political allusions are not missing, but are not accorded as much\nimportance as in the plays of his predecessors. We are told that Euripides wrote around\n22 tragedies but only won the Greater Dionysia 4 times – a detail which may reflect the\nfact that many of his plays discuss unpopular or complicated matters and did not\nnecessarily appeal to his audience. 18 of Euripides’ plays survive to this day (although\nRhesus is wrongly attributed to him); among these, Alcestis is the earliest, and The\nBacchae was the latest.\nThe theater performances in general can be seen as a key part of democracy, since\nin the comedies, for instance, the citizens could criticize their leaders or unpopular topics.\n5th Century Achievements and the Peloponnesian War\nThe field of medicine advanced greatly during the 5th century BCE under Hippocrates of\nCos, who created the Hippocratic Oath (which is still used today). Hippocrates, along\nwith other members of his school, is regarded as the founder of the science of (western)\n100 medicine. He was born in 460 BCE on the island of Cos, and belonged to the famous\nfamily of the Asclepiads. We possess a so-called Corpus Hippocraticum, a group of\nbooks (72 altogether) supposedly written by Hippocrates. Nowadays we think that not a\nsingle one of these writings can be attributed to Hippocrates himself. However, these\nbooks demonstrate that Hippocrates saw sickness as a malfunction of the whole body; he\nalso developed the humoral pathology, according to which the body consisted of four\nhumors or liquids that had to be maintained in equal balance. The four liquids were\nblood, phlegm, black bile and yellow bile. According to Hippocrates, if these liquids were\nnot in balance, the result was sickness.\nThe Greek language also underwent a change. Attic Greek began to rival Ionic\nGreek as the language of science. As these two main dialects became more widespread\namong the city-states of Greece, they allowed for easier communication among travelers\nand contributed to a feeling of Greek unity. Festivals like those in Olympia, Athens, and\nDelphi, which were all Pan-Hellenic, also helped to bring Greeks together in identity and\nculture.\nMany Greek city-states shared certain common elements of education. Athletic\nexercise was a major part of the education system of Greece. Every city had a gymnasion,\nand the youth would exercise there regularly while older men watched and conversed\nwith one another. Before attending the gymnasion, the children went to an elementary\nschool. These children (usually only boys) learned the works of Homer, Hesiod and\nSolon, memorizing sentences and poems. In the gymnasion, the boys participated in\nphysical exercise in preparation for military service. Boys practiced in the nude and\nfollowed a curriculum based on the pentathlon: running, wrestling, broad jumps, javelin\nand discus throwing. In addition to the pentathlon there existed a precursor to mixed\nmartial arts (MMA) called Pankration, which combined elements of boxing, throwing,\nand grappling. The athletes had their hands covered in leather straps, which could cause\nserious injury considering the fact that almost all blows were legal. Interestingly, the\nsport was prohibited in Sparta.\nAfter the invasion of Xerxes, Athens dominated Greece not only culturally, but\nalso politically. In 478 BCE, many city-states formed an alliance designed to provide\nprotection against future Persian attacks. The alliance was called The Delian League, and\n101 the Athenians assumed a position of leadership within it because they possessed a\nsuperior fleet. Athens became more and more aware of its growing power and behaved\nmore and more arrogantly when dealing with the other members of the alliance and with\nother Greek city-states in general. Soon this created tension among the Greek city-states,\nwhich resulted in a bitter and destructive war called the Peloponnesian War (431- 404\nBCE). The war fractured Greece between Athens and its allies on the one hand and Sparta\nand its own supporters and allies on the other. The historian Thucydides brilliantly\ndescribed most of the Peloponnesian war in an unfinished work of eight books. At first\nthe Athenians seemingly had the upper hand but, in the end, and with assistance from the\nPersians, Sparta forced Athens to accept unconditional surrender in 404 BCE. After this,\nSparta dominated Greece for a short time, but then tensions based on jealousies and on\nthe ineffectiveness of Spartan leadership led to new conflicts among the Greek city-states,\nand made it possible for a new power to emerge in the North and to dominate Greece.\n102 11. Macedonian Empire\nTo the north of Greece was a region known as Macedonia, which was governed by an\nabsolute monarchy. The autocratic Macedonian king's power was only partially limited\nby his companions, called Hetairoi – other Macedonian nobles who served as advisors\nand bodyguards to the king, and who served in an elite cavalry unit commanded by the\nking in battle. Of course, the closeness of the Hetairoi to the king and their proximity to\npower sometimes resulted in conspiracies.\nThe Persians influenced Macedonian early history. Macedonia had served as a\nloyal ally to Persia since the 6th century BCE, even supporting the Persian invasion of\nGreece in 480 BCE. The protection provided by the mighty Persians secured Macedonia’s\ngrowing power so that by the end of the 5th century BCE Macedonia was the strongest\npower in the region. Macedonia became important for Athens and other Greek city states\nsince Macedonian grain and timber was a desired product. The Athenians and their allies,\nfor example, needed the timber from Macedonia to build their fleets, thus making the\nMacedonian kings wealthy. The kings often used this wealth to hellenize their courts by\nimporting Greek intellectuals, artists, and writers like Euripides, who dedicated a play to\na Macedonian king. The royal court in Pella, the main city of Macedonia, became the\nregion’s political and cultural center. However, the growth of Macedonian power caused\nproblems for the Athenians, whose interests in the region were threatened by those of the\nMacedonians. This prompted Athens to make attempts to influence Macedonian politics,\nwhether by supporting rival neighboring states, or by supporting opposition to the\nMacedonian kings in Macedonia itself.\nPhilip II was born in 383. He lived in exile in the Greek city state of Thebes from\n369 to 367. While there, Philip gained insight into contemporary Greek politics and\nmilitary tactics, which Phillip brought back to Macedonia. Upon his return in 364 BCE\nMacedonia was in a chaotic state: three different kings ruled Macedonia over the next 7\nyears, and the political situation remained unstable. This instability, however, became\nuseful to Phillip, who was able to take power in 359 BCE, but the situation at that time\nwas dire since Macedonia and Philip were threatened by foreign enemies and by rivals\nsupported by Athens. It would take Philip only two years to put down the unrest and\n103 secure his power in Macedonia through a combination of diplomacy and military success.\nThroughout the 350s Philip enjoyed ongoing success, so that in only 9 years Philip had\nfreed Macedonia from its enemies. He was then able to strengthen his kingdom through\nreform. Philip's most important military reform was the introduction of a new phalanx to\nreplace the undisciplined former militia of Macedonia. Philip would also strengthen the\nbond between king and soldier by fighting along with his soldiers in battles, losing an eye\nand suffering other wounds in the process. In 338 BCE Philip together with his son\nAlexander defeated an Athenian and Theban army at Chaeronea in Boeotia. After the\nvictory at Chaeronea Phillip gained effective control over Greece and began planning an\ninvasion of the territory of Macedonia's former ally, Persia. However Philip would not be\nable to carry out these plans personally, as he was assassinated in 336 BCE, possibly\nbecause of dynastic conflicts within the Macedonian court. In 338, Philip had married for\nthe 7th time. Most of Philip’s marriages had been arranged for diplomatic purposes and\nserved to cement his relationships with nearby rulers or states. Olympias, Philip’s fourth\nwife and the mother of Alexander, had been Philip’s primary wife and queen for most of\nPhilip's reign. However, Philip’s seventh wife, Cleopatra, was the daughter of a\nMacedonian aristocrat. Philip might have hoped to have a Macedonian heir, since\nOlympias was a foreigner from Epirus (a region in modern-day northern Greece), and\nAlexander was therefore only half Macedonian. Olympias and Alexander fell from favor\nand fled into exile. Cleopatra gave birth to a girl and in Macedonian tradition a girl could\nnot succeed to the throne. Philip reconciled with Alexander, who returned to Pella, while\nOlympias remained in exile in Epirus. This resultant feuds between powerful Macedonian\nfamilies may have contributed to Philip’s assassination in 336 BCE, and to the succession\nof Alexander to the throne at the age of only 20.\nImmediately, Alexander faced challenges to the throne. The city of Thebes, in\ncentral Greece, revolted when its inhabitants heard news of Philip’s death. Alexander’s\nresponse to the revolt was decisive: he besieged Thebes, took it, and utterly destroyed it.\nThe residents who were not massacred were sold into slavery. Alexander did spare one\nhouse, the home of the poet Pindar, whom Alexander admired. The destruction of Thebes\nalso intimidated Greece to the point that all the Greek cities acknowledged Alexander as\ntheir leader out of fear of facing the same consequences.\n104 After the uprising of Thebes was suppressed, Alexander resumed his father’s\ninvasion of the Persian Empire. In the spring of 334 BCE Alexander and his Macedonian\narmy crossed the Hellespont into Asia. Alexander was 21 years old. He would never\nreturn to Macedonia again. In the next 11 years of his life, Alexander brought under his\npersonal control the largest landmass and a larger population than had ever before been\nruled by one man alone.\nThe first decisive battle between the Persians and the Macedonians took place at\nthe river Granicus in Northwestern Asia Minor. Alexander gained control of Asia Minor\nafter routing the Persians in battle, defeating the Persian governors (satraps). The Persian\nking Darius III – who had not been present personally at the battle of the Grancicus –\nthen mobilized his forces in the Persian homeland and met Alexander at Issus in 333\nBCE. The Persian army outnumbered the Macedonian forces, possibly by as much as 3 to\n1, but the geography of the battlefield, which was located in a narrow pass between the\nsea and the mountains, favored Alexander’s troops. Alexander was victorious, and Darius\nwas forced to flee, leaving his family behind at his camp. Alexander pursued him but\nfailed to overtake him. Alexander then marched southward to Egypt, conquering the\ncoastal cities of the eastern Mediterranean on his way. When Alexander arrived in Egypt,\nhe was welcomed as a savior. The Egyptians saw him as a liberator from the Persians\nwho had up to this time occupied Egypt. In 331 BCE Alexander founded the new city of\nAlexandria, which remains a major city in Egypt today. Alexander would establish many\nother cities during his campaign, which he likewise named after himself. While in Egypt\nAlexander also consulted the oracle of the Egyptian god Ammon in the desert; nobody is\ncertain what the oracle said to Alexander. What we do know is that Alexander was\ndepicted on coins as the son of Zeus after this visit.\nLater in the year 331 BCE Alexander continued his pursuit of Darius III. At\nGaugamela in modern day Iraq the two armies met on an open plain. Alexander's brilliant\ntactics led to a decisive victory over the Persians, but Darius escaped yet again.\nAlexander pursued the Persian king until one of the Persian satraps, who did not want\ntheir leader in the hands of the enemy, killed Darius III. For the next three years\nAlexander reclaimed parts of his new empire. Alexander pushed deep into modern day\nAfghanistan, Tajikistan and Uzbekistan, bringing the region under his control. Then he\n105 began the push into India, leaving the Hindu-Kush Mountains and marching down into\nthe Indus river valley. After almost a year of fighting in the Punjab region his troops did\nnot want to go any further. Many of Alexander's men had not seen home in over 8 years.\nUnable to convince his men to carry on, Alexander led a brutal march back to Babylon\nthrough a harsh desert, where many of his soldiers died from dehydration and heat\nexhaustion. In spring of 323 BCE the Macedonian forces arrived in Babylon and\nAlexander immediately planned the conquest of Arabia, but before he could carry out his\nplan he died from what is believed to have been Malaria on June 10th 323, just short of\nhis 33rd birthday. Alexander’s death created a crisis, as he had left no male heir capable of\ntaking the throne, although one of his wives named Roxane was pregnant and later gave\nbirth to a son (whom she named Alexander, and whom modern historians know as\nAlexander IV). Alexander’s closest associates were his generals. Soon after Alexander's\ndeath they began to fight among themselves in a bid to become Alexander’s successor to\nthe throne. The next 150 years were thus determined by the struggles of the kingdoms of\neach general and their successors, each of whom hoped to gain power over the others;\nsince no single ruler could conquer the kingdoms of all of the others, they inevitably\nweakened each other to the point that the rising power in Rome was able to conquer them\nall.\nConclusion\nThe rise of Athens during the classical period of Greece ushered in a new age of\ndemocracy, freedom, and art, but it also created tensions that resulted in the\nPeloponnesian War and ended the Athenian path towards dominance of Greece. After the\nPeloponnesian War the struggles of Greek city-states for power among themselves\nallowed the Macedonians to create their own empire and dominate the Greek city-states\nunder one rule. Under Alexander the Great the Macedonian empire was expanded from\nthe Balkan Peninsula to the East and thus Greek culture and civilization began to mix\nwith other civilizations. Alexander's conquests made sure that many aspects of Greek\ncivilization were spread to Persia and Northern India. The world after Alexander was\n106 shaped by political chaos. The successors of Alexander made attempts to rule over a\nunited empire but instead they weakened each other.\n107 12. Hellenistic Period\nIntroduction\nThe period following Alexander’s death in 323 BCE is called the Hellenistic period. The\nevents of this period were effectively determined by the numerous attempts of the rulers\nof the successor kingdoms of Alexander’s divided empire to become the next great leader\nof the known world. The name Hellenistic has a double meaning. First, it implies that the\nGreeks who had moved to the Near East changed the culture and society in the new area\nthey lived to match Greek customs and culture. Second, it implies that the new culture\nwas not as good as the culture of previous periods, especially the Classical period of\nancient Greece or the Golden Age of Athens in the 5th century BCE. However, it is\nimportant to note that the Hellenistic period was not, in fact, a period of decline; in many\nways this period became more inventive and interesting than the Classical period.\nPartition of Alexander’s Empire\nAfter the death of Alexander in 323 BCE, the Macedonian empire faced a dangerous\npower vacuum, since there was no clear heir to Alexander’s throne. Even though\nAlexander’s widow Roxanne gave birth to a son that same year, the Macedonian throne\ncould not be left to someone so young. Alexander’s other possible heir was a half-brother,\nbut he too was unable to rule, as he was mentally ill. As a result, the generals who had\nserved under Alexander agreed, in order to prevent the division of the empire, that\nPerdiccas should be the so-called guardian of the kingdom until Alexander’s son could\nrule. However, the other generals were not satisfied with this decision; each general\ndecided to seize his own part of the empire in an attempt to gain full control of it later.\nThe generals who struggled over Alexander’s empire were Ptolemy, Antigonus,\nLysimachus, and the so-called gang of three: Perdiccas, Craterus, and Antipater (the latter\nof whom ruled Macedon). Antipater soon faced a revolt in Greece, instigated by Athens.\nThis revolt against Antipater began in September of 323 and ended in August of 322,\nwhen Athens surrendered. The revolt was as a complete disaster for Athens, which was\n108 unable to free itself from Macedonian rule. Instead, Antipater’s soldiers executed many\ndemocratic politicians and effectively ended Athenian democracy, which had existed\nsince 508 BCE with only short interruptions between 411 and 404/03 BCE. Antipater\ndeprived many Athenians of their citizen rights and installed a garrison, which ended\nAthenian independence for good.\nAntigonus' Campaign for a Successor Kingdom\nIt is important to note that nothing had changed from the perspective of the rest of the\nworld and that the three-year-old Alexander IV was still regarded as the designated king.\nThe acting guardian of the kingdom after Perdiccas’ death became Antipater. However,\nthe empire was already falling apart: Antipater, Lysimachus, Antigonus, and Ptolemy had\neach established their own power bases. But throughout history the hunger for power has\nbeen especially strong in some men; this was the case with Antigonus, who tried to gain\npower over the whole empire by force of arms. First, Antigonus’ son, Demetrius,\nbesieged the island of Rhodes in the year 305 BCE. Rhodes was a major commercial\npower, and it was necessary to control Rhodes in order to control the region. The siege of\nRhodes was extraordinary, and it earned Demetrius the nickname “The Besieger”. He\npersonally designed siege towers, which were a hundred feet tall. 34 men could occupy\nthe upper levels of these towers, and they could fight in all directions. Demetrius himself\nwore armor of iron, which weighed around 40 pounds. However in spite of all of this\noffensive equipment, Rhodes still stood its ground even after a yearlong struggle drained\nboth sides. In 304 BCE Rhodes became Demetrius’ ally. The Colossus of Rhodes was\nerected to commemorate Rhodes’ survival of the siege; it stood 105 feet tall, was made\nout of bronze, and represented the god Helios.\nAntigonus and his son Demetrius the Besieger then began the conquest of\nMacedonia in 302 BCE. In 301, the other successors Lysimachus, Seleucus and\nCassander (son of Antipater) joined forces to stop them. The two armies met near a small\ntown called Ipsos in central Anatolia, each one consisting of roughly 75,000 troops. This\nbattle became one of the greatest in the ancient world. Demetrius, who commanded\nAntigonus’ cavalry, made a mistake in the battle when he broke through the enemy line\n109 and pursued his fleeing enemies too far from the field, leaving his father exposed to\nSeleucus’ Indian war elephants. The elephants trampled down Antigonus’ guards, and\nAntigonus himself died when he was hit by many of the javelins thrown by men mounted\non the elephants. The dreams of a unified empire died with Antigonus.\nThe Egyptian Successor Kingdom\nIn Egypt Ptolemy I had established his own power base. He had been present at\nAlexander’s death in Babylon, and saw an opportunity to secure the richest prize of\nAlexander's empire: Egypt. Ptolemy had spent four months in Egypt with Alexander as\none of his companions. There he had seen how rich the country was and how easily it\ncould be defended, as was proven when another former general, the very ambitious\n“Guardian of the Kingdom” Perdiccas, decided to attack Ptolemy I in 320 BCE. While\ntrying to cross the Nile, thousands of his men drowned and hundreds more were victims\nof the crocodiles that inhabited the river. Soon afterward, Perdiccas’ officers revolted\nagainst him and murdered him. These officers then asked Ptolemy I to take Perdiccas’\nplace as “Guardian of the Kingdom”, but Ptolemy I declined the offer. Although the title\nwould bring him honor it would not give him power. Ptolemy I had other plans, as he\nwanted the empire to dissolve so that he could remain in power in Egypt. Ptolemy I was a\nvery cunning man: he even helped to put another one of Alexander’s generals, Seleucus,\nin charge of Babylon, in an attempt to neutralize his opponent Antigonus, whose own\npower base was in Anatolia.\nPtolemy grew up in Pella a son of a noble together with Alexander and was close\nfriends with him, even though Ptolemy was several years older. Gradually, Ptolemy\nshowed his skills on the battlefield, and he eventually became one of Alexander’s\nbodyguards, which was a high honor. Ptolemy was prudent and had character, as\ndemonstrated not only by the fact that he successfully installed a successor to his throne\nand was the only one of the first round of Hellenistic kings to die in his bed of old age (at\n85), but also by his extraordinary career. At Babylon, when Alexander’s generals first\nbegan to follow through with the original plan of electing Perdiccas as guardian of the\nkingdom, Ptolemy succeeded in having himself appointed governor of Egypt. At this\n110 time, Egypt was governed badly by Alexander’s appointee Cleomenes, and overall Egypt\nwas in a sad state. Although the generals at Babylon had decided that Cleomenes should\nbe Ptolemy’s first assistant, Ptolemy thought otherwise: a trial was held and Cleomenes\nwas sentenced to death and executed. Ptolemy would present himself as Pharaoh upon his\narrival in Egypt in 323 BCE. Ptolemy and his successors ruled Egypt and controlled 7 to\n10 million subjects. This made Egypt the most densely populated land on earth at the\ntime. Ptolemy kept most of Egpyt’s old administrative structure intact, but he did make\nsome changes, such as appointing Greek immigrants to top positions. As a result, most\nroyal documents were written in ancient Greek.\nPtolemy I’s successor was Ptolemy II (309-246 BCE), who continued the work of\nhis father. He inherited a stable situation in Egypt. He built the Mouseion (home of the\nMuses), the great museum in Alexandria. This museum functioned both as a library and a\nuniversity, and it was also a center for the arts. The finest intellectuals gathered there,\ncoming from many places: native Egyptians, Jews, Greeks and Carthaginians. The\nmuseum also established Greek as the international language of learning. The librarians\nwanted to place every book ever written inside the museum for safekeeping. As a result,\nthis museum helped transform Alexandria into a culturally dominant city in the\nMediterranean world. While the Ptolemaic dynasty did not make any attempts to rebuild\nAlexander’s empire, they did have to deal with several wars overseas, and with periodic\nrevolts on the part of the native Egyptians.\nSeleucid Empire\nThe other dynasty in the east was that of the Seleucids, who ruled Western Asia as a\nresult of the wars of the “Diadochi” (the successors of Alexander). As a result of these\nwars, Seleucus created the largest of the Hellenistic successor kingdoms. The population\nof his kingdom was said to be around 25 million people, and the kingdom itself\nencompassed most of the territory that the Persians had before. The Seleucid kings did\nnot intervene much in local affairs but rather installed Satraps as governors, who\nadministered their assigned provinces rather independently; what mattered most to the\nSeleucid kings was that taxes and revenues were collected in time and in their full\n111 amount. Thus the territory Seleucus ruled was a combination of many local institutions\nwith their own taxes and customs. Alexander had replaced Persian Satraps with his own\nmen, and so did Seleucus. As a result, many Greeks migrated to Western Asia, hoping to\nmake money. Many administrators had Greek names, which leads scholars to believe that\nSeleucus gave administrative jobs to Greeks; the other possibility is that the former\nadministrators of the old elite changed their names into Greek ones. This was part of the\nso-called Hellenization of the east which took part during this period. Hellenization\nmeans the adoption of Greek culture by the populations of conquered territories. This\nhappened partly because Greek immigrants moved to the Near East. The local people\nbegan learning the Greek language, and adopted Greek customs. The first two kings of\nthe Seleucid Empire, Seleucus I and Antiochus I, made sure that thousands of young men\ncame east to their empire as mercenary soldiers. Once these soldiers left active service,\nthe two kings used them to control the countryside of the empire by giving them land and\ncitizenship. Seleucus and Antiochus also founded large cities and, like Alexander, they\nnamed the greatest of them after themselves. Seleucia is located near modern-day\nBaghdad, and Antioch is in Syria. More than a hundred thousand people soon lived in\nthese cities, which made them bigger than Athens or Syracuse. The Greeks and\nMacedonians who came to the East as settlers preferred to live in these big cities rather\nthan the countryside. Thus, Greek was spoken from Syracuse to central Asia. In the\ncountryside, however, it was a different story; the Greeks there did not interact much with\nthe local population, which saw the Greeks as just the most recent of many conquerors.\nAround 250, this empire entered a long period of decline as the migration of\nGreeks from the West slowed down. Fewer former mercenaries settled in the Eastern\nparts of the Seleucid Empire, which became increasingly isolated. Soon some of the\ngovernors, in Bactria in particular, started to call themselves kings and ignored the new\nKing Antiochus II. Deprived of important revenues, the Seleucids were forced to reduce\ntheir military; the successor of Antiochus II, Seleucus II, was consequently defeated in\nbattle, and was pushed out of his kingdom.\n112 Greece and Macedonia Continued\nMacedonia was the weakest of the successor kingdoms because many talented and bright\nthinkers migrated East. Athens underwent many constitutional changes: from oligarchy to\ndemocracy, then back to oligarchy, and then to tyranny. An Athenian revolt against the\nMacedonians resulted in the installation by the latter of a new dictator in 262 BCE. In\n229 BCE the city was freed, but Athens was in severe decline, and by 200 BCE it became\na kind of tourist attraction in the ancient world.\nIn Sparta the situation was different. The society of Sparta was based on a strong\nmilitary, everything else was subordinate to this. Many young Spartans who had received\na very good and effective military training chose to start a counterrevolution in an attempt\nto return to the glory days and to reinstate the laws given by the legendary Lycurgus.\nAfter some success, these counterrevolutionaries were defeated in a final battle against\nthe Macedonians at Sellasia in 222 BCE. Many Spartans died in the battle, bringing an\nend to the counterrevolution and causing Sparta to decline into obscurity by 220 BCE.\nThe last attempt to create a unified Hellenistic kingdom in Greece was made by\nthe king of Epirus, Pyrrhus. Pyrrhus was a strange, aggressive man who loved war for its\nown sake; he liked to fight with enemies in single combat. In the year 281 BCE the\npeople of Taras asked him for help against the Romans. Because Pyrrhus liked war and\nbecause he saw this as a chance to expand his empire, he agreed to help. Pyrrhus defeated\nthe Romans in two battles, but lost many men; while the Romans could replace their own\nlosses easily, these victories were too costly for Pyrrhus, which led to the creation of the\nexpression “Pyrrhic Victory”. Pyrrhus neglected the Romans and Taras for a while to\nconcentrate on a war with Carthage. After suffering a defeat, the Carthaginians offered\ngenerous terms for peace, which Pyrrhus rejected. His arrogance alienated his allies.\nSoon Pyrrhus was alone, and when he renewed hostilities against the Romans he was\nfinally defeated. The Romans had, by this time, learned how to deal with his war\nelephants. Yet Pyrrhus then went on to invade Macedonia, and was finally killed in battle\nin 272 BCE.\n113 Cultural Achievements during the Hellenistic Period\nAs described above, Ptolemy II endowed the mouseion in Alexandria, the temple for the\nMuses. Ptolemy’s advisor while establishing the mouseion was Demetrius of Phaleron.\nPtolemy assembled or tried to assemble copies of all Greek literature. Thus, he founded\nthe world’s first great library. But besides books, he also needed capable people to\npreserve and copy them. Many skilled men were attracted to his court in the hope of\nreceiving royal patronage. One of the tasks of these librarians in Alexandria was to\nproduce an official text of Homer. When we read the works of Homer today, we need to\nremember that these texts go back directly to the library of Alexandria and the edition\nmade there.\nThe scholars whom Ptolemy attracted were sometimes good poets themselves.\nApollonius of Rhodes, for example, was the director of the mouseion from around 270-\n245 BC. His major work was an epic called the Argonautica. The Argonautica describes\nJason and the Argonauts’ quest for the Golden Fleece. The Argonautica is the only epic\nth st\nfrom the period between Homer (around the 8 cent. BCE) and Virgil (1 cent. BCE) to\nsurvive. Apollonius used the archaic language of Homer, but also introduced new literary\nstyles, which make his poetry sound extremely modern in some passages. Apollonius also\nsometimes stops the narrative to address the reader directly in order to hint at the\ndifficulties of writing an epic. Clearly, his allusions and wordplays demanded well-\neducated readers.\nrd\nAnother poet who worked as a scholar in Alexandria during the 3 century BCE\nwas Callimachus. His work is different from that of Apollonius. Callimachus preferred\nbrief poems. He was an outstanding scholar, and compiled a Catalogue of Persons\nConspicuous in Every Branch of Learning and a List of their Compositions on 120\nscrolls. Callimachus was most famous for his hymn to Zeus. Like Apollonius, he used an\narchaic poetic form and combined it with contemporary elements: among other things, he\nintroduced verbal puzzles and many allusions into his hymn.\nTheocritus was another scholar working in Alexandria. He invented a style of\npoetry known as “bucolic” poetry (meaning “poetry concerning cowherds”). In his\nbucolic poetry, he praised the simple rustic life in Sicily and southern Italy in nostalgic\n114 imagery. Theocritus himself called his poems Idylls in Greek, which should be translated\nas “little pictures”. Written for an urban elite who had probably never seen the\ncountryside, his poems idealized the life out of the city.\nThe novel too was developed as its own genre during the Hellenistic Age. Like\npoems, early novels were written to be read aloud in front of an audience. The earliest\nexample of a novel we possess is a papyrus fragment containing the story of an Assyrian\nwho woos a fourteen year old bride. All the later novels of the Hellenistic period have the\nsame pattern. Boy and girl first fall in love. Fate separates them before or soon after\nmarriage. The couple then has to endure many disasters, such as imprisonment, torture,\nrape, seduction, and sometimes even death, but there is usually a happy end when the\ncouple is reunited and lives happily ever after.\nWhere drama and performance are concerned, the so called “New Comedy”\nstands out. New Comedy developed during the fourth and third centuries. Unfortunately,\nonly a single example of Athenian New Comedy survives. It is called “Dyskolos”\n(“Grumpy old man”) and was written by Menander (342-291 BCE). As far as we can tell,\nNew Comedy used the following patterns: humorous confusion over identity and well-\nknown characters like greedy pimps, romantic young men, and tricky or faithful slaves.\nThe Romans adopted New Comedy, and writers like Plautus and Terence produced\nexamples of the genre in Latin.\nHellenistic Philosophy proved to be very influential. Athens in the 3rd century\nBCE still dominated Greek philosophical life. The school of Plato, the Academy,\nproduced Scepticism, which was shaped by the conviction that nothing can be known\nabout the world for sure. The sceptic, however, could form plausible impressions, and\ncould act as if those impressions were true. Thus he was able to function in a world in\nspite of chaos around him.\nDiogenes (404-323 BCE) was the founder of Cynicism. He was called doglike\n(kynikos) because he was not interested in social conventions: he had no clothes, he lived\nin a barrel, and he both urinated and masturbated whenever and wherever he wanted. He\nalso refused to own private property and material things. The most famous story about\nDiogenes holds that Alexander the Great once travelled to Sinope in the Black Sea to\noffer Diogenes anything he wanted. Diogenes supposedly told Alexander to get out of his\n115 way, because he was blocking the sun. Diogenes’ theory, as far as we can tell, claimed\nthat the common lust for wealth, honor and status was empty of meaning. Some followers\nof Diogenes, the Cynics, travelled from city-state to city-state in order to mock the\nauthorities. They used a type of oration for this purposes which was called diatribe. The\nEnglish word comes from this kind of oration.\nIn total contrast to Diogenes’ damnation of the desire for material wealth and\nstatus stood Epicurus (341-270 BCE). He spent most of his life in Athens, first studying\nwith Platonists, and later founding his own school, the garden (kopos). This garden was\nthe garden of his own house, where wealthy men, women and slaves isolated themselves\nand followed Epicurus’ teaching. Epicurus’ thoughts are rather well known, for two\nreasons. First, in 79 CE, Mount Vesuvius, still an active volcano, erupted and preserved a\nlibrary with many scrolls containing Epicurean philosophy. Second, in the first century\nBCE a Roman called Lucretius wrote a book called “On the Nature of Things”, in which\nhe explained Epicurus’ thought.\nWhen we look at the American constitution we see the evidence of Epicurean\nthought: “We hold these Truths to be self evident, that all Men are created equal, that they\nare endowed, by their creator, with certain unalienable Rights, that among these are Life,\nLiberty, and the Pursuit of Happiness.” For Epicurus happiness was the most important\ngoal in life.\nEpicurus accepted the atomism of Democritus: Epicurus acknowledged that the\ncosmos consists of an infinite number of atoms drifting through space. These atoms have\nsize, shape and weight. They fall down like endless rain without touching each other. But\nsometimes they strike each other, thus creating the cosmos, the arrangement of all things.\nThe mind according to Epicurus also consists of atoms, albeit atoms smaller than\nthe ones in the cosmos or the ones that create the body. Even the gods are made of atoms,\nbut very fine ones. Epicurus believed that the gods lived in the spaces between the stars.\nThey did not interfere and took no interest in the world of humans, living in eternal and\nundisturbed happiness. For Epicurus, undisturbed living (Ataraxia) was the essence of\nhappiness.\nAccording to Epicurus, humans were made exclusively out of matter and ceased\nto exist when they died. Epicurus claimed that humans should not fear death, because\n116 death was simply the end of existence, after death nothing unpleasant could happen.\nBecause of this theory, Epicurus naturally denied any form of afterlife.\nEpicurus’ conception of lust was twofold. On the one hand, there was positive lust\n– the lust for eating, listening to music, or sex. On the other hand, there was negative lust,\nwhich was the lust for the absence of pain. According to Epicurus the negative lust was to\nbe preferred because positive lust often caused pain (by, for instance, leading to excessive\neating) and was transitory. Negative lust, or lust for the avoidance of pain, was lust itself,\nand thus the chief goal.\nThe most influential school founded in the Hellenistic Age was Stoicism. Zeno\n(333-262 BCE) founded this philosophical school. He studied with Cynic philosophers\nand with Platonists at the Academy in Athens. Near the end of the 4th century BCE he\nestablished his own school in Athens in the Stoa Poikile, the “painted stoa”. This meeting\nplace gave the school its name.\nThe concept of happiness of Zeno was different from that of Eipcurus. In Zeno’s\nphilosophy, one has to follow natural law to reach happiness. By following the natural\nlaw one can be happy regardless of circumstances: pain and pleasure can be ignored.\nStoicism influenced some of the Roman emperors, and one of them, Marcus Aurelius,\nwrote a major Stoic book.\nAccording to the Stoics the divine logos, which should be translated as “reason,\nintelligence”, determined everything. Logos also caused all things to happen and gave all\nthings properties. This produced an important question: if the logos determined\neverything, what about responsibility? The Stoics claimed that humans were morally\nresponsible and remained free. According to Stoics the human relationship to moral\nchoice was like a dog tied to a moving cart: the dog could choose to move with the cart,\nin which case everything would go well and he would be happy; or he could choose to\nrun the other way (or to the side, or sit down), in which case he would be dragged along\nby the moving cart, which would inevitably move on. The moral for human beings is\nclear: if one makes choices according to the Logos, everything goes well; if one decides\nagainst it, he or she pays the price. Thus, if one allows the divine Logos to rule his life, he\naligns himself with the intelligence that governs the cosmos. Only few people were\nthought to be able to do this: the elite. The masses were thought incapable of recognizing\n117 this principle, and to decide without reason. Stoicism therefore supported the ruling of\neducated elites.\nMedicine and science advanced rapidly after Alexander. The wealth accumulated\nin the royal centers supported this. We know very little about medicine during the\nHellenistc age. We do know that the Ptolemies allowed and supported human dissections\nrd\nin the 3 century BCE in Alexandria. A man called Herophilus, for example,\ndistinguished between the sensory nerves, and the terms he used for the description of the\neye are still in use today. Furthermore, he examined internal and external organs,\ndistinguishing between veins and arteries. Detailed explanations of the functions of the\nbody were produced later, but without a microscope there were limits to what was\npossible.\nIn mathematics the work of one man was very important: Euclid (325-250 BCE).\nHis work, the “Elements”, is the most widely read Greek work in the modern world\nexcept the New Testament. High school geometry is virtually Euclid’s Elements with\nexamples and applications.\nConclusion\nThe final years of the Hellenistic period can be described as a period of increasing loss of\npower among the successor kings. In Egypt, which had remained the most prosperous of\nall the successor kingdoms, politics became increasingly dominated by Rome, which\nemerged as dominant power at the end of the last Punic wars. In 30 BCE, following the\nsuicide of Queen Cleopatra, the last of the Ptolemaic rulers, Egypt fell entirely into the\nhands of Rome.\nIn the East, the fall of the Seleucid kings allowed for the return of Persian power\nas the Parthians created their own empire on the remains of previous empires. The\nParthians later came into conflict with the Romans, who began to expand further to the\nEast. The Romans incorporated many aspects of the conquered Hellenistic kingdoms.\nFrom the Greeks they borrowed their pantheon of gods, advances in literature, and\narchitecture. The Hellenistic period gave way to the greatest empire of the ancient world:\nRome. For the next four centuries Rome and its emperors would create the foundations\n118 for the modern world, including the ancestors of modern languages, ideas that they\npassed on from the Greeks, and borders that continue, in some cases, to exist today.\n119"
}