{
    "text": "14 - Discontent and Reform\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform\nCreated by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard, Ryan Bernstein, Justin Guillard\nDec. 17, 2018\nCommunity College / Lower Division\nHistory\nSUMMARY:\nThis is a community college History book chapter. Chapter 14 Discontent and Reform is the students text book for this unit.\nLEARNING GOALS: Women suffragists at the head of the parade, marching down Pennsylvania Avenue, with the U.S. Capitol in background, on March 3, 1913.\nAuthor Unknown, [Public Domain] via Library Congress.\n“A great democracy will be neither great nor a democracy if it is not progressive.” Former President Theodore Roosevelt, circa\n1910\nTotal Video (00:41:18)\nAGRARIAN DISTRESS AND THE RISE OF POPULISM\nIn spite of their remarkable progress, late-19th century American farmers experienced recurring periods of hardship. Mechanical improvements\ngreatly increased yield per acre. The amount of land under cultivation grew rapidly throughout the second half of the century, as the railroads\nand the gradual displacement of the Plains Indians opened up new areas for western settlement. A similar expansion of agricultural lands in\ncountries such as Canada, Argentina, and Australia compounded these problems in the international market, where much of U.S. agricultural\nproduction was now sold. Everywhere, heavy supply pushed the price of agricultural commodities downward.\nMidwestern farmers were increasingly restive over what they considered excessive railroad freight rates to move their goods to market.\nThey believed that the protective tariff, a subsidy to big business, drove up the price of their increasingly expensive equipment. Squeezed by\nlow market prices and high costs, they resented ever heavier debt loads and the banks that held their mortgages. Even the weather was\nhostile. During the late 1880s droughts devastated the western Great Plains and bankrupted thousands of settlers.\nVideo (00:01:16) Video: Steam Tractor(https://ensemble.nmc.edu/Watch/n5ZRs37H)\nIn the South, the end of slavery brought major changes. Much agricultural land was now worked by sharecroppers, tenants who gave up to half\nof their crop to a landowner for rent, seed, and essential supplies. An estimated 80 percent of the South’s African-American farmers and 40\npercent of its white ones lived under this debilitating system. Most were locked in a cycle of debt, from which the only hope of escape was\nincreased planting. This led to the overproduction of cotton and tobacco, and thus to declining prices and the further exhaustion of the soil.\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform The American farmer - where he has to sell, and where he has to buy. By Louis Dalrymple. [Public domain], via Library of Congress.\nThe near mania with which the nation had embraced the rails led to over-speculation, rate wars, the organization of farmers and finally--federal\nregulation. The belief that a pair of tracks reaching into the distance would automatically return wealth came to an unpleasant end as railroads\noverbuilt their lines, then found themselves engaged in rate wars with other lines to make ends meet. Caught in the middle were the farmers\nwho were routinely overcharged for shipping due to their “smallness.” The rail companies were in the practice of cutting special rates for big\nshippers to attract their business. The small farmer, meanwhile, made up the difference by paying much higher rates.\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform “Gift for the Grangers.” By Strobridge & Co. Lith. [Public domain], via Wikimedia Commons\nGrangers\nThe first organized effort to address general agricultural problems was by the Patrons of Husbandry, a farmer’s group popularly known as the\nGrange Movement. Launched in 1867 by employees of the U.S. Department of Agriculture, the Grangers focused initially on social activities to\ncounter the isolation most farm families faced. Women’s participation was actively encouraged. Spurred by the economic Panic of 1873, the\nGrange soon grew to 20,000 chapters and one-and-a-half million members.\nThe Grangers set up their own marketing systems, stores, processing plants, factories, and cooperatives, but most ultimately failed. The\nmovement also enjoyed some political success. Grangers sought state regulation over railroad shipping rates and had small state-level\nsuccesses. The major problem was that this shipping was usually an interstate proposition; hence, more confusion resulted as state lines were\ncrossed. The Interstate Commerce Act of 1877 largely settled the matter. Railroads would have to publish their rates, stop discriminating\nbetween large and small shippers, and stop pooling with competitive lines.\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform “Farmers’ Alliance Banner.” Licensed under PD-US via Wikipedia\nFarmers’ Alliance\nBy 1880 the Grange was in decline and being replaced by the Farmers’ Alliances, which were similar in many respects but more overtly\npolitical. By 1890 the alliances, initially autonomous state organizations, had about 1.5 million members from New York to California. A parallel\nAfrican-American group, the Colored Farmers National Alliance, claimed over a million members. Federating into two large Northern and\nSouthern blocs, the alliances promoted elaborate economic programs to “unite the farmers of America for their protection against class\nlegislation and the encroachments of concentrated capital.”\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform “People's party candidates for president and vice president 1892.” Author unknown (Library of Congress), Licensed under Public Domain via\nCommons\nPopulism\nBy 1890 the level of agrarian distress, fueled by years of hardship and hostility toward the McKinley tariff, was at an all-time high. Working with\nsympathetic Democrats in the South or small third parties in the West, the Farmers’ Alliances made a push for political power. A third political\nparty, the People’s (or Populist) Party, resulted. Never before in American politics had there been anything like the Populist fervor that swept\nthe prairies and cotton lands. The elections of 1890 brought the new party into power in a dozen Southern and Western states, and sent a\nscore of Populist senators and representatives to Congress.\nThe first Populist convention was in 1892. Delegates from farm, labor, and reform organizations met in Omaha, Nebraska, determined to\noverturn a U.S. political system they viewed as hopelessly corrupted by the industrial and financial trusts. Their platform stated:\nWe are met, in the midst of a nation brought to the verge of moral, political, and material ruin. Corruption dominates the ballot box,\nthe legislatures, the Congress, and touches even the ermine of the bench [courts]. ... From the same prolific womb of\ngovernmental injustice we breed the two great classes — tramps and millionaires.\nFarmers, traditionally distrustful of banks, sought to abolish national banks, to establish the coinage of silver and to institute a graduated income\ntax. More localized banking, they reasoned, would be more sympathetic and easy to influence. Coined silver would allow farmers to repay\nloans with inflated currency, and a graduated income tax would fall less heavily on farmers and the poor. They also wished to regulate or\nnationalize railroads and telegraph services and establish government warehouses where their surplus crop could be stored until depressed\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform prices rose again.\nThe Populists showed impressive strength in the West and South, and their candidate for president polled more than a million votes. But the\ncurrency question soon overshadowed all other issues. Agrarian spokesmen, convinced that their troubles stemmed from a shortage of money\nin circulation, argued that increasing the volume of money would indirectly raise prices for farm products and drive up industrial wages, thus\nallowing debts to be paid with inflated currency. Conservative groups and the financial classes, on the other hand, responded that the 16:1\nprice ratio was nearly twice the market price for silver. A policy of unlimited purchase would denude the U.S. Treasury of all its gold holdings,\nsharply devalue the dollar, and destroy the purchasing power of the working and middle classes. Only the gold standard, they said, offered\nstability.\nThe financial panic of 1893 heightened the tension of this debate. Bank failures abounded in the South and Midwest; unemployment soared\nand crop prices fell badly. The crisis and President Grover Cleveland’s defense of the gold standard sharply divided the Democratic Party.\nDemocrats who were silver supporters went over to the Populists as the presidential elections of 1896 neared.\nPrint shows a bust portrait of William Jennings Bryan and portraits of his family, also illustrations, at the bottom, of a farmer and a blacksmith;\nincludes the complete text of the \"Cross of Gold\", the speech that helped Bryan win the Democratic Party nomination for president, with 16\nlarge silver dollars and one small gold dollar framing the speech at the top right and left corners. “16 to 1 ...\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform “The sacrilegious candidate - No man who drags into the dust the most sacred symbols of the Christian world is fit to be president of the United\nStates.”​ ​ By Grant Hamilton, printed in \"Judge\" Magazine, 1896. [Public domain], via Library of Congress.\nThe Democratic convention that year was swayed by one of the most famous speeches in U.S. political history. Pleading with the convention\nnot to “crucify mankind on a cross of gold,” William Jennings Bryan, the young Nebraskan champion of silver, won the Democrat’s presidential\nnomination. The Populists also endorsed Bryan. The Democrats had effectively stolen the silver issue from the Populists and won most of them\nover to the party.\nIn the epic contest that followed, Bryan carried almost all the Southern and Western states. But he lost the more populated, industrial North and\nEast —and the election— to Republican candidate William McKinley.\nThe following year the country’s finances began to improve, in part owing to the discovery of gold in Alaska and the Yukon. This provided a\nbasis for a conservative expansion (remember the gold standard) of the money supply. In 1898 the Spanish-American War drew the nation’s\nattention further from Populist issues. Populism and the silver issue were dead. Many of the movement’s other reform ideas, however, lived on.\nWhile the Populists had won some governorships and house seats in Congress, the more populous industrial Northeastern vote and a fear of\nMarxism (nationalized industries) ultimately led to the party's failure. However, by the end of the Franklin Roosevelt administration just 50 years\nlater, nearly all of the Farmer’s Alliance issues would be born out as law—in large part due to the Populist Party’s ability to bring them to\nnational attention.\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform Portraits of Marx (left) by John Jabez Edwin Mayall and Darwin (right) by J. Cameron. Licensed under Public Domain via Wikimedia Commons.\nNEW IDEOLOGIES AFFECT THE WORK-PLACE\nProgress\n“Progress” as a national mindset was a child of both the Enlightenment and the Scientific Revolution. As people the world over saw the great\ngains of Science, in medicine, machinery, and transportation, “Progress” became the moniker for a wildly optimistic future. In this future, people\nwould become more enlightened through education and science and the ills of the world would\nsteadily recede into nonexistence. As a result, two men were poised, in the mid-1800s, to thoroughly rattle western conceptions of the meaning\nand aim of human life.\nCommunism\nMarxism appeared on the world scene in the mid 1800s and forever altered the political, social, and intellectual landscape. Karl Marx introduced\nthe notion of Communism as the inevitable end of history with his Communist Manifesto. Dizzy with enthusiasm over the successes of the\nscientific method, Marx and others proclaimed that most, if not all phenomena would be reduced to science, therefore making all phenomena\nultimately predictable. For Marx, the “science” of history pointed inescapably to Communism—a point at which the laboring millions would\nreplace the nonproductive class of capitalist owners through a series of bloody revolutions. After this point, all would be peace and harmony;\nbut the path to Communism would be gruesome.\nDarwinism\nPerhaps even more influential, Charles Darwin theorized in his “Origin of Species” that in the natural world only the fittest survive. These\nsurvivors then pass on their traits of “fit-ness” to their offspring which continue the process of competition and biological progress. This survival\nof the fittest would find ready-application to society as viewed by the robber barons of big business.\nInterestingly, both Marx and Darwin insisted that a Creator-God was not involved in the process. As half the world eventually embraced Marx\nand two thirds of the scientific community eventually embraced Darwin, the stage was being set for sharp conflict in the next century.\nTHE STRUGGLES OF LABOR\nThe life of a 19th-century American industrial worker was hard. Even in good times wages were low, hours long, and working conditions\nhazardous. Little of the wealth that the growth of the nation had generated went to its workers. Moreover, women and children made up a high\npercentage of the workforce in some industries and often received but a fraction of the wages a man could earn. Periodic economic crises\nswept the nation, further eroding industrial wages and producing high levels of unemployment.\nAt the same time, technological improvements, which added so much to the nation’s productivity, continually reduced the demand for\nskilled labor. Yet the unskilled labor pool was constantly growing, as unprecedented numbers of immigrants —18 million between 1880 and\n1910 —entered the country, eager for work.\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform Children working in a mill in Macon, Georgia. 1909. By Lewis Hine [Public domain], via Wikimedia Commons.\nBefore 1874, when Massachusetts passed the nation’s first legislation limiting the number of hours women and child factory workers could\nperform to 10 hours a day, virtually no labor legislation existed in the country. It was not until the 1930s that the federal government would\nbecome actively involved. Until then, the field was left to the state and local authorities, few of whom were as responsive to the workers as they\nwere to wealthy industrialists.\nThe laissez-faire capitalism that dominated the second half of the 19th century and fostered huge concentrations of wealth and power was\nbacked by a judiciary that time and again ruled against those who challenged the system. In this, they were merely following the prevailing\nphilosophy of the times. Drawing on a simplified understanding of Darwinian science, many social thinkers believed that both the growth of\nlarge business at the expense of small enterprise and the wealth of a few alongside the poverty of many was “survival of the fittest,” and an\nunavoidable by-product of progress.\nWhile the standard of living did increase on the whole during the last half of the 19th century, the number of children in the workforce doubled\nbetween 1870 and 1900. Six day, sixty-plus hour work weeks, tens of thousands of industry related deaths each year (the highest in the world),\nunpredictable unemployment and the monotony of regimentation on the line tended to alienate workers who, in turn, responded by combining\ninto unions to combat such conditions. Strikes and violence in every major American industry created fears of Marxist influence which a growing\nAmerican middle class feared as both godless and anarchical.\nBy Document:Knights of Labor; Image: not known; Image edited: Ulrich Lange, Dunedin, New Zealand [Public domain], via Wikimedia\nCommons.\nThe first major effort to organize workers’ groups on a nationwide basis appeared with theN oble Order of the Knights of Labor in 1869.\nOriginally a secret, ritualistic society organized by Philadelphia garment workers and advocating a cooperative program, it was open to all\nworkers, including African Americans, women, and farmers. The Knights grew slowly until its railway workers’ unit won a strike against the great\nrailroad baron, Jay Gould, in 1885. Within a year they added 500,000 workers to their rolls, but, not attuned to pragmatic trade unionism and\nunable to repeat this success, the Knights soon fell into a decline.\nThe AFL\nUntil this point, unions had been primarily reactive to changes in the workplace; but a new type of union emerged in 1886 led by Samuel\nGompers (a former cigar union official). The American Federation of Labor (AFL) did not try to organize all laborers, but sought to organize by\nindividual craft. It appeared less radical initially by allowing native-born whites only (no foreign born, anarchists or Marxists). The greatest\ndeparture for this union, however, was that it was practical—not utopian. The AFL, rather than trying to turn the clock back to a time when\nskilled labor was king, assumed that a life of wage-earning was the new reality and sought to make conditions as good as possible for such\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform workers. While the AFL noticeably left out immigrants, the unskilled and people of color, it did, usher in the realization that wage earning was\nthe primary mode of \"making it.\" The AFL did much to turn the labor movement away from the socialist views of most European labor\nmovements.\nBy Published by the American Federation of Labor, Washington, DC, 1919 [Public domain], via Wikimedia Commons\nStrikes\nNonetheless, both before the founding of the AFL and after, American labor history was violent. In the Great Rail Strike of 1877, rail workers\nacross the nation went out in response to a 10-percent pay cut. Attempts to break the strike led to rioting and wide-scale destruction in several\ncities: Baltimore, Maryland; Chicago, Illinois; Pittsburgh, Pennsylvania; Buffalo, New York; and San Francisco, California. Troops were ordered\nin but sympathy strikes from other Railroads and coal miners shut down the nation’s rails for a time.\nNine years later, in Chicago’s Haymarket Square incident, someone threw a bomb at police about to break up an anarchist rally in support of an\nongoing strike at the McCormick Harvester Company in Chicago. Some 60 police officers were injured. It ended when a bomb exploded, killing\nseven policemen and at least four strikers. The strike had been intended to secure an 8 hour day and a wage hike but only succeeded in\nsinking public support as German-born anarchists were blamed for both the strike and the bombing.\nIn 1892, at Carnegie’s steel works in Homestead, Pennsylvania, a group of 300 Pinkerton detectives the company had hired to break a bitter\nstrike by the Amalgamated Association of Iron, Steel, and Tin Workers fought a fierce and losing gun battle with strikers. Once again, an\nanarchist (Russian born) torpedoed public opinion by shooting Henry Frick in retaliation for his calling out the Pinkertons to break the strike. The\nNational Guard was called in to protect non-union workers and the strike was broken. Unions were not let back into the plant until 1937.\nIn 1894, wage cuts at the Pullman Company just outside Chicago led to a strike, which, with the support of the American Railway Union, once\nagain tied up much of the country’s rail system. Workers in twenty-seven states joined the strike before the courts ended it by citing the\nSherman Act’s “restraint of trade” clause. As the situation deteriorated, U.S. Attorney General Richard Olney, himself a former railroad lawyer,\ndeputized over 3,000 men in an attempt to keep the rails open. This was followed by a federal court injunction against union interference with\nthe trains. When rioting ensued, President Cleveland sent in federal troops, and the strike was eventually broken.\nSherman Anti-trust Act\nIronically, “restraint of trade” was a term coined by theS herman Antitrust Act of 1890 which was an attempt to prevent monopolies,\ncombinations, conspiracies or anything else that hindered “trade or commerce.” The intention had been to reign-in big business; however, in the\ncase of the Pullman strike, big business successfully accused the American Railway Union of restraining trade by stopping the rail system. Big\nbusiness caught on and seized on the Sherman Act to end strikes, and strengthen monopolies.\nThe most militant of the strike favoring unions was the Industrial Workers of the World (IWW). Formed from an amalgam of unions fighting for\nbetter conditions in the West’s mining industry, the IWW, or “Wobblies” as they were commonly known, gained particular prominence from the\nColorado mine clashes of 1903 and the singularly brutal fashion in which they were put down. Influenced by militant anarchism and openly\ncalling for class warfare, the Wobblies gained many adherents after they won a difficult strike battle in the textile mills of Lawrence,\nMassachusetts, in 1912. Their call for work stoppages in the midst of World War I, however, led to a government crackdown in 1917 that\nvirtually destroyed them.\nTHE REFORM IMPULSE\nThe presidential election of 1900 gave the American people a chance to pass judgment on the Republican administration of President\nMcKinley, especially its foreign policy. Meeting at Philadelphia, the Republicans expressed jubilation over the successful outcome of the war\nwith Spain, the restoration of prosperity, and the effort to obtain new markets through the Open Door policy. McKinley easily defeated his\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform opponent, once again William Jennings Bryan. But the president did not live to enjoy his victory. In September 1901, while attending an\nexposition in Buffalo, New York, he was shot down by an assassin, the third president to be assassinated since the Civil War.\nAuthor Unknown [Public domain], via Wikimedia Commons.\nTheodore Roosevelt, McKinley’s vice president, assumed the presidency. Roosevelt’s accession coincided with a new epoch in American\npolitical life and international relations. The continent was peopled; the frontier was disappearing. A small, formerly struggling republic had\nbecome a world power. The country’s political foundations had endured the vicissitudes of foreign and civil war, the tides of prosperity and\ndepression. Immense strides had been made in agriculture and industry. Free public education had been largely realized and a free press\nmaintained. The ideal of religious freedom had been sustained. The influence of big business was now more firmly entrenched than ever,\nhowever, and local and municipal government often was in the hands of corrupt politicians.\nIn response to the excesses of 19th-century capitalism and political corruption, a reform movement called “progressivism” arose, which\ngave American politics and American thought its special character from approximately 1890 until the American entry into World War I in 1917.\nThe Progressives had diverse objectives. In general, however, they saw themselves as engaged in a democratic crusade against the abuses of\nurban political bosses and the corrupt “robber barons” of big business. Their goals were greater democracy and social justice, honest\ngovernment, more effective regulation of business, and a revived commitment to public service. They believed that expanding the scope of\ngovernment would ensure the progress of U.S. society and the welfare of its citizens.\nThe years 1902 to 1908 marked the era of greatest reform activity, as writers and journalists strongly protested practices and principles\ninherited from the 18th-century rural republic that were proving inadequate for a 20th-century urban state. Years before, in 1873, the celebrated\nauthor Mark Twain had exposed American society to critical scrutiny in The Gilded Age. Now, trenchant articles dealing with trusts, high\nfinance, impure foods, and abusive railroad practices began to appear in the daily newspapers and in such popular magazines as McClure’s\nand Collier’s. Their authors, such as the journalist Ida M. Tarbell, who crusaded against the Standard Oil Trust, became known as\n“muckrakers.”\nIn his sensational novel, The Jungle, Upton Sinclair exposed unsanitary conditions in the great Chicago meat-packing houses and\ncondemned the grip of the beef trust on the nation’s meat supply. Theodore Dreiser, in his novels The Financier and The Titan, made it easy for\nlaymen to understand the machinations of big business. Frank Norris’s The Octopus assailed amoral railroad management; his The Pit depicted\nsecret manipulations on the Chicago grain market. Lincoln Steffens’s The Shame of the Cities bared local political corruption. This literature of\nexposure roused people to action.\nThe hammering impact of uncompromising writers and an increasingly aroused public spurred political leaders to take practical measures.\nMany states enacted laws to improve the conditions under which people lived and worked. At the urging of such prominent social critics as Jane\nAddams, child labor laws were strengthened and new ones adopted, raising age limits, shortening work hours, restricting night work, and\nrequiring school attendance.\nROOSEVELT’S REFORMS\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform By the early 20th century, most of the larger cities and more than half the states had established an eight-hour day on public works. Equally\nimportant were the workman’s compensation laws, which made employers legally responsible for injuries sustained by employees at work. New\nrevenue laws were also enacted, which, by taxing inheritances, incomes, and the property or earnings of corporations, sought to place the\nburden of government on those best able to pay.\nIt was clear to many people — notably President Theodore Roosevelt and Progressive leaders in the Congress (foremost among them\nWisconsin Senator Robert La Follette) — that most of the problems reformers were concerned about could be solved only if dealt with on a\nnational scale. Roosevelt declared his determination to give all the American people a “Square Deal.”\nDuring his first term, he initiated a policy of increased government supervision through the enforcement of antitrust laws. With his backing,\nCongress passed the Elkins Act (1903), which greatly restricted the railroad practice of giving rebates to favored shippers. The act made\npublished rates the lawful standard, and shippers equally liable with railroads for rebates. Meanwhile, Congress had created a new Cabinet\nDepartment of Commerce and Labor, which included a Bureau of Corporations empowered to investigate the affairs of large business\naggregations.\nRoosevelt won acclaim as a “trust-buster,” but his actual attitude toward big business was complex. Economic concentration, he believed,\nwas inevitable. Some trusts were “good,” some “bad.” The task of government was to make reasonable distinctions. When, for example, the\nBureau of Corporations discovered in 1907 that the American Sugar Refining Company had evaded import duties, subsequent legal actions\nrecovered more than $4 million and convicted several company officials. The Standard Oil Company was indicted for receiving secret rebates\nfrom the Chicago and Alton Railroad, convicted, and fined a staggering $29 million.\nRoosevelt’s striking personality and his trust-busting activities captured the imagination of the ordinary individual; approval of his\nprogressive measures cut across party lines. In addition, the abounding prosperity of the country at this time led people to feel satisfied with the\nparty in office. He won an easy victory in the 1904 presidential election.\nVideo (00:10:00) The Presidents: Roosevelt's Legacy (https://login.proxy.nmc.edu/login?url=http://fod.infobase.com/PortalPlaylists.aspx?\nwID=105019&xtid=43178&loid=400042)\nEmboldened by a sweeping electoral triumph, Roosevelt called for stronger railroad regulation. In June 1906 Congress passed the Hepburn\nAct. It gave the Interstate Commerce Commission real authority in regulating rates, extended the commission’s jurisdiction, and forced the\nrailroads to surrender their interlocking interests in steamship lines and coal companies.\nOther congressional measures carried the principle of federal control still further. The Pure Food and Drug Act of 1906 prohibited the use\nof any “deleterious drug, chemical, or preservative” in prepared medicines and foods. The Meat Inspection Act of the same year mandated\nfederal inspection of all meat-packing establishments engaged in interstate commerce.\nConservation of the nation’s natural resources, managed development of the public domain, and the reclamation of wide stretches of neglected\nland were among the other major achievements of the Roosevelt era. Roosevelt and his aides were more than conservationists, but given the\nhelter-skelter exploitation of public resources that had preceded them, conservation loomed large on their agenda. Whereas his predecessors\nhad set aside 46,400,000 acres of timberland for preservation and parks, Roosevelt increased the area to 145,000,000 acres. They also began\nsystematic efforts to prevent forest fires and to re-timber denuded tracts.\nTAFT AND WILSON\nVideo (00:10:00) Taft (https://login.proxy.nmc.edu/login?url=http://fod.infobase.com/PortalPlaylists.aspx?\nwID=105019&xtid=43178&loid=449209)\nRoosevelt’s popularity was at its peak as the campaign of 1908 neared, but he was unwilling to break the tradition by which no president had\nheld office for more than two terms. Instead, he supported William Howard Taft, who had served under him as governor of the Philippines and\nsecretary of war. Taft, pledging to continue Roosevelt’s programs, defeated Bryan, who was running for the third and last time.\nVideo (00:06:53) One Woman, One Vote Hard Times (https://login.proxy.nmc.edu/login?url=http://fod.infobase.com/PortalPlaylists.aspx?\nwID=105019&xtid=44178&loid=446447)\nThe new president continued the prosecution of trusts with less discrimination than Roosevelt, further strengthened the Interstate\nCommerce Commission, established a postal savings bank and a parcel post system, expanded the civil service, and sponsored the enactment\nof two amendments to the Constitution, both adopted in 1913.\nThe 16th Amendment, ratified just before Taft left office, authorized a federal income tax; the 17th Amendment, approved a few months\nlater, mandated the direct election of senators by the people, instead of state legislatures. Yet balanced against these progressive measures\nwas Taft’s acceptance of a new tariff with higher protective schedules; his opposition to the entry of the state of Arizona into the Union because\nof its liberal constitution; and his growing reliance on the conservative wing of his party.\nVideo (00:03:03) Wilson Part 1 (https://login.proxy.nmc.edu/login?url=http://fod.infobase.com/PortalPlaylists.aspx?\nwID=105019&xtid=43179&loid=446448)\nBy 1910 Taft’s party was bitterly divided. Democrats gained control of Congress in the midterm elections. Two years later, Woodrow\nWilson, the Democratic, progressive governor of the state of New Jersey, campaigned against Taft, the Republican candidate — and also\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform against Roosevelt who ran as the candidate of a new Progressive Party. Wilson, in a spirited campaign, defeated both rivals.\nDuring his first term, Wilson secured one of the most notable legislative programs in American history. The first task was tariff revision.\n“The tariff duties must be altered,” Wilson said. “We must abolish everything that bears any semblance of privilege.” The Underwood Tariff,\nsigned on October 3, 1913, provided substantial rate reductions on imported raw materials and foodstuffs, cotton and woolen goods, iron and\nsteel; it removed the duties from more than a hundred other items. Although the act retained many protective features, it was a genuine attempt\nto lower the cost of living. To compensate for lost revenues, it established a modest income tax.\nThe second item on the Democratic program was a long overdue, thorough reorganization of the ramshackle banking and currency\nsystem. “Control,” said Wilson, “must be public, not private, must be vested in the government itself, so that the banks may be the instruments,\nnot the masters, of business and of individual enterprise and initiative.”\nThe Federal Reserve Act of December 23, 1913, was Wilson’s most enduring legislative accomplishment. Conservatives had favored\nestablishment of one powerful central bank. The new act, in line with the Democratic Party’s Jeffersonian sentiments, divided the country into\n12 districts, with a Federal Reserve Bank in each, all supervised by a national Federal Reserve Board with limited authority to set interest rates.\nThe act assured greater flexibility in the money supply and made provision for issuing federal-reserve notes to meet business demands.\nGreater centralization of the system would come in the 1930s.\nThe next important task was trust regulation and investigation of corporate abuses. Congress authorized a Federal Trade Commission to issue\norders prohibiting “unfair methods of competition” by business concerns in interstate trade. The Clayton Antitrust Act forbade many corporate\npractices that had thus far escaped specific condemnation: interlocking directorates, price discrimination among purchasers, use of the\ninjunction in labor\ndisputes, and ownership by one corporation of stock in similar enterprises.\nFarmers and other workers were not forgotten. The Smith-Lever Act of 1914 established an “extension system” of county agents to assist\nfarming throughout the country. Subsequent acts made credit available to farmers at low rates of interest. The Seamen’s Act of 1915 improved\nliving and working conditions on board ships. The Federal Workingman’s Compensation Act in 1916 authorized allowances to civil service\nemployees for disabilities incurred at work and established a model for private enterprise. The Adamson Act of the same year established an\neight-hour day for railroad labor.\nThis record of achievement won Wilson a firm place in American history as one of the nation’s foremost progressive reformers. However,\nhis domestic reputation would soon be overshadowed by his record as a wartime president who led his country to victory but could not hold the\nsupport of his people for the peace that followed.\nVideo (00:10:46)Ellis Island(https://ensemble.nmc.edu/Watch/Le43KrWo&sa=D&ust=1483623572840000&usg=AFQjCNH5g-\nSdkohq5TTT3HFpSOvmxMed9Q)\nA NATION OF NATIONS\nNo country’s history has been more closely bound to immigration than that of the United States. During the first 15 years of the 20th century\nalone, over 13 million people came to the United States, many passing through Ellis Island, the federal immigration center that opened in New\nYork harbor in 1892. (Though no longer in service, Ellis Island reopened in 1992 as a monument to the millions who crossed the nation’s\nthreshold there.) ​\nThe first official census in 1790 had numbered Americans at 3,929,214. Approximately half of the population of the original 13 states was of\nEnglish origin; the rest were Scots-Irish, German, Dutch, French, Swedish, Welsh, and Finnish. These white Europeans were mostly\nProtestants. A fifth of the population was enslaved Africans. ​\nFrom early on, Americans viewed immigrants as a necessary resource for an expanding country. As a result, few official restrictions were\nplaced upon immigration into the United States until the 1920s. As more and more immigrants arrived, however, some Americans became\nfearful that their culture was threatened. ​\nThe Founding Fathers, especially Thomas Jefferson, had been ambivalent over whether or not the United States ought to welcome arrivals\nfrom every corner of the globe. Jefferson wondered whether democracy could ever rest safely in the hands of men from countries that revered\nmonarchs or replaced royalty with mob rule. However, few supported closing the gates to newcomers in a country desperate for labor. ​\nImmigration lagged in the late 18th and early 19th centuries as wars disrupted trans-Atlantic travel and European governments restricted\nmovement to retain young men of military age. Still, as European populations increased, more people on the same land constricted the size of\nfarming lots to a point where families could barely survive. Moreover, cottage industries were falling victim to an Industrial Revolution that was\nmechanizing production. Thousands of artisans unwilling or unable to find jobs in factories were out of work in Europe. ​\nIn the mid-1840s millions more made their way to the United States as a result of a potato blight in Ireland and continual revolution in the\nGerman homelands. Meanwhile, a trickle of Chinese immigrants, most from impoverished Southeastern China, began to make their way to the\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform American West Coast. ​\nAlmost 19 million people arrived in the United States between 1890 and 1921, the year Congress first passed severe restrictions. Most of these\nimmigrants were from Italy, Russia, Poland, Greece, and the Balkans. Non-Europeans came, too: east from Japan, south from Canada, and\nnorth from Mexico. ​\nBy the early 1920s, an alliance was forged between wage-conscious organized labor and those who called for restricted immigration on racial\nor religious grounds, such as the Ku Klux Klan and the Immigration Restriction League. The Johnson-Reed Immigration Act of 1924\npermanently curtailed the influx of newcomers with quotas calculated on nation of origin. ​\nThe Great Depression of the 1930s dramatically slowed immigration still further. With public opinion generally opposed to immigration, even for\npersecuted European minorities, relatively few refugees found sanctuary in the United States after Adolf Hitler’s ascent to power in 1933. ​\nThroughout the postwar decades, the United States continued to cling to nationally based quotas. Supporters of the McCarran-Walter Act of\n1952 argued that quota relaxation might inundate the United States with Marxist subversives from Eastern Europe. ​\nIn 1965 Congress replaced national quotas with hemispheric ones. Relatives of U.S. citizens received preference, as did immigrants with job\nskills in short supply in the United States. In 1978 the hemispheric quotas were replaced by a worldwide ceiling of 290,000, a limit reduced to\n270,000 after passage of the Refugee Act of 1980. ​\nSince the mid-1970s, the United States has experienced a fresh wave of immigration, with arrivals from Asia, Africa, and Latin America\ntransforming communities throughout the country. Current estimates suggest a total annual arrival of approximately 600,000 legal newcomers\nto the United States. ​\nBecause immigrant and refugee quotas remain well under demand, however,illegal immigration is still a major problem. Mexicans and other\nLatin Americans daily cross the Southwestern U.S. borders to find work, higher wages, and improved education and health care for their\nfamilies. Likewise, there is a substantial illegal migration from countries like China and other Asian nations. Estimates vary, but some suggest\nthat as many as 600,000 illegals per year arrive in the United States. ​\nLarge surges of immigration have historically created social strains along with economic and cultural dividends. Deeply ingrained in most\nAmericans, however, is the conviction that the Statue of Liberty does, indeed, stand as a symbol for the United States as she lifts her lamp\nbefore the “golden door,” welcoming those “yearning to breathe free.” This belief, and the sure knowledge that their forebears were once\nimmigrants, has kept the United States a nation of nations.​\n\"14 - Discontent and Reform\" by Tina Ulrich, Joelle Hannert, Tom Gordon, Michelle Schneider, Michele Howard,\nRyan Bernstein, Justin Guillard under Creative Commons Attribution Non-Commercial Share Alike\nhttps://oercommons.org/authoring/19384-14-discontent-and-reform"
}