{"text":"Context\nContext\nWe live in an ever more complex globalised world. This globalisation has a paradoxical effect on our lives. On the one\nhand it increases conformity through the power of the market (products, tastes, culture); on the other it leads to ever\ngreater diversity (assertions of local and regional identities, social and cultural conflicts).\nOne striking feature of globalisation is the impact of multilingualism, and the related phenomenon of multiculturalism.\nVery few contemporary societies can be considered homogenous; they are increasingly diverse, whether in the\nlanguages spoken or in the ways that people live and express themselves (their cultures).\nMultilingualism – the normal human condition. ‘Speaking two or more languages is the natural way of life for\nthree-quarters of the human race. [This] principle … has been obscured in parts of Europe as a consequence\nof colonial history. We urgently need to reassert it, and to implement it in practical ways, for, in the modern\nworld, monolingualism is not a strength but a handicap.’ (David Crystal 2006:409)\nIn one sense, it might be thought that linguistic diversity is in decline. Some languages are dying out, some are spoken\nby smaller numbers of people, and there are linguists who believe that the rise of English is accelerating this trend.\nDespite this, however, one estimate suggests that there are still over 7,000 distinct languages spoken by substantial\npopulations as first or mother tongues, and many more countries than is commonly known need to operate in multiple\nlanguages. At the same time, the rise in identity politics across the world appears to be supporting a renewed sense of\nconfidence in and wish to maintain local, regional and national languages.\nOn being Welsh ‘To be Welsh is an experience. To both be and speak Welsh is a related, more robust experience.\nEach time we erase one of those options from the world of human experience, we lose an incomprehensibly\ncomplex realm of knowledge. We lose a way of thinking about the world. We lose a way of being in our world.\nFor to live with a language is to live as part of an organic, long-developed tradition and identity.’ (Conor\nWilliams 2015)\nMulticulturalism is less easy to define and can be a controversial term. If, though, we understand culture in a broad\nsense as the way that people live their daily lives (the food they eat, the way they dress, their preferred entertainment)\nand also the way that they see the world, we can say that different cultures coexist but also that cultures become\nincreasingly mixed. Language is an important aspect of this culture – especially as it determines identity. But language\nand culture are not always identical.\nAlthough these phenomena have existed since ancient times they are given greater focus by some of the key\ncharacteristics of this globalised world.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 5 Context\nThe new economy and new forms of communication\nThere is a direct link between the way we communicate today and the new economy of this globalised world.\nAccording to Manuel Castells (2000), this economy has three salient features\n• new economic processes which generate information\n• economic production which takes on a global scale of organisation, (lowering national boundaries and eroding\nthe exclusive control of national economies)\n• competition which is organised in networks that are themselves located globally.\nThese factors, which have certainly intensified and developed in ways not even imagined in the last decade, are\nhaving a major impact on the way we communicate, and thus on language, making possible a major change in what\nhas always been assumed about ‘community’ and ‘communication’. Communication becomes both local (often\nmultilingual) and global (instantaneous and standardised). Local communication and global interaction ‘These new\neconomic processes allocate decision-making responsibilities to more local zones of production. This in turn\nrequires local communication and discussion and involvement. Local literacy and communication is needed to\nproduce effective coordinated actions across large economic enterprises. In growing numbers of multilingual\nworkplaces this necessitates multilingual communication. The new economy involves consistent interactions\nacross geographical locations. These exchanges and interactions are inconceivable without an instantaneous\nand effective process for communication and standardised forms for coding and receiving information.’\n(Castells 2000)\nNew technologies – electronically mediated communication\nThe technologies to facilitate communication further facilitate the globalisation of economies and communication.\nLocal sites are linked in networks, which need to agree on how to organise, talk and distribute functionally different\nlanguages, and at the same time local sites are themselves multilingual as a result of migration. The potential of\ntechnologies to transcend physical distance, also gives rise to the whole question of the distribution of language(s).\nThis was the case within the national state, with its defined territory over which a single standardised language would\nprevail, but now this spatial distribution can be across national borders (between sites, universities and cities for\nexample) and the mode of operation is increasingly multi- rather than monolingual.\nThe most striking manifestation of this communication shift is in the development of electronically mediated\ncommunication (EMC), most obviously but not exclusively the Internet. The phenomenal speed (and unpredictability)\nof this change over the last 20 years has been vividly illustrated by many observers.\nElectronic communication takes over the airwaves ‘In 1990 there was no World Wide Web; that arrived in\n1991… Most people did not send their first e mail until the mid-90s. Google arrived in 1999. Mobile phones\n(and)… text messaging at about the same time… Blogging as a genre did not take off until the early 2000s.\nInstant messaging is another development of the early 2000s, soon to be followed by social networking\naround 2003–5… In 2006 we encounter Twitter..… ‘If someone had said to me in 2005, that the next EMC\ndevelopment was going to be a system where you were given an online prompt, ‘What are you doing?’ and a\nlimit of 140 characters for your reply, I would have written them off as deluded.’ (David Crystal 2010: 26)\nIt is not surprising that educational policy and social policy have lagged behind these unprecedented developments in\nthe practice of global communication. The traditional model for developing policy based on evidence of some kind and\nseeking to reach defined and agreed goals is disrupted by the unpredictability of EMC. There is probably also an age\nfactor – EMC is the world of the young in particular, which is generally not the case for policy development.\n6 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Context\nNew mobility\nIn the new economy not only does technology enable networking across distance but the populations in each locality\nare increasingly diverse. The flows of population and their impact are greater, and also the types of movement in terms\nof gender, status, age and professional category are different from what has been historically the case. Although current\nmigrations can be seen as the continuation of a historical trend of population movement from the country to the city,\nthey also differ significantly in that they are global – multicultural, multilingual – and on an unprecedented scale. Also\ndifferent are the directions of movement, so that nations whose recent image is of emigration now are solidly nations of\nimmigration. Ireland and Italy are classic cases of this, but there are many others. (Castles and Miller, 2009)\nSo while the vast movements of people are highly differentiated, there are some common tendencies, affecting\nvirtually all parts of the globe. In particular, this movement is taking place at an accelerating rate, and it involves many\ndifferent kinds of population transfer (in terms of timing, motivations, legal status for example). This was the case even\nbefore the current mass migrations from the Middle East and Africa.\nThe fifth-largest country ‘Over the past 15 years, the number of people crossing borders … has been rising\nsteadily. At the start of the 21st century, one in every 35 people is an international migrant. If they all lived in\nthe same place, it would be the world’s fifth-largest country.’ (BBC News Online 2009)\nMigration also has a significant impact on general policy – both the idea of migration as well as its rate and numbers\nprovoke political responses, from planning and integration policies to rejection and hostility. This has become a major\nchallenge in Europe since 2012, but it is not limited to Europe.\nThus while the period of the consolidation of nation states involved making internal cultural patterns homogenous,\nthe combined effects of the Age of Migration with the Information Age, both motivated by the new economy, have\nproduced more communication-rich workplaces and communities, linked across multilingual spaces and themselves more\ncommunication-dependent and multilingual. These changes are having a major impact on societies more generally.\nThe emergence of English as a lingua franca\nIf the new economy enables the proliferation of multilingual communication, it also greatly encourages and is in turn\nfacilitated by the development of a lingua franca. Most observers now agree that English has effectively become that\nlingua franca and that its scale and influence is unprecedented in world history. There is of course debate about why\nthis has happened and about the extent to which this is to the detriment of other languages.\nWithout stepping far into that particular discussion, the reality of English as a lingua franca must be confronted today.\nThis reality is shown most clearly by the language choices being made worldwide.\nCurrent economic and social realities\nThese ‘globalisation factors’ represent long-term shifts in the economy and in society and their impact on language policy\nmay as yet only imperfectly understood. There are also other important factors – it is to be hoped more short term –\nwhich cannot be ignored. Of particular significance has been the economic downturn since 2008. The effect of this has\nbeen at one level to reduce public support for various kinds of policy intervention, for example policies on Diversity and\nMultilingualism, as those responsible for public finances will not necessarily see the point of funding such development.\nAt a deeper level, such economic pressures also impact on the social fabric, and this is likely to exacerbate the tensions\ninherent in the longer-term social and cultural changes associated with the new economy. Mobility in particular – and\nmore specifically immigration – is becoming a major area of political controversy. Many previously accepted liberal\nconsensual views about multiculturalism and the role of the state in promoting inclusivity are being called into\nquestion. Multilingualism and multiculturalism have become hot topics.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 7 Section I: Multilingualism and plurilingualism\nSection I: Multilingualism and plurilingualism\nDefinitions of ‘multilingualism’ can be tricky. The term can be applied to people who have competences in a number\nof languages or to places where many languages are used. It is probably helpful, therefore, to use the Council of\nEurope’s distinction between multilingualism as the characteristics of a place – city, society, nation state – where\nmany languages are spoken, and plurilingualism as the attribute of an individual who has a ‘plurilingual repertoire’ of\nlanguage competences (Council of Europe 2007).\nMultilingualism refers to the presence in a geographical area, large or small, of more than one ‘variety of\nlanguage’ i.e. the mode of speaking of a social group whether it is formally recognised as a language or not; in\nsuch an area individuals may be monolingual, speaking only their own variety.\nPlurilingualism refers to the repertoire of varieties of language which many individuals use, and is therefore\nthe opposite of monolingualism; it includes the language variety referred to as ‘mother tongue’ or ‘first\nlanguage’ and any number of other languages or varieties. Thus in some multilingual areas, some individuals are\nmonolingual and some are plurilingual.\nEven this more precise definition has its problems as is illustrated by many accepted descriptions of the cosmopolitan\ncity – a major locus for multilingualism There is a common narrative which defines such urban multilingualism in\nterms of the number of languages spoken and used, including particularly the linguistic background of school children,\nbut also the workforce’s competence in foreign languages, the use of languages for trade and in business and the diverse\nappearance of the urban landscape. However, this ‘headcount of languages’ may not be a convincing indicator of effective\nmultilingualism. At best it is a blunt measure. Even in the major multilingual cities this celebrated multilingualism often\nmeans multiple separate monolingual or bilingual communities. A more valid test of multilingualism might be the extent\nto which there is interaction between linguistic communities, the degree of public acceptance of and support for linguistic\ndiversity, and the ways in which this ‘multilingual capital’ is part of the political and economic infrastructure, including in\nthe all-important area of education. Multilingualism is not just a question of numbers.\nMultilingualism is often invisible. Even in the great multilingual cities a large number of languages are used principally\nin the family or the community (the private sphere) and emerge in public only on special occasions. Then they may\nindeed become a part of the lived urban experience of many people, including those from other linguistic groups. In\nother ways, too, citizens experience multilingualism almost unconsciously in their daily lives. The most ubiquitous\nexample of this is commercial – as in the local shop run by different language communities (Bengali, Turkish,\nKurdish, Chinese, Polish, and Italian) but serving the whole local community, and increasingly preferred over national\nsupermarket chains. There are many other local and community initiatives (cultural, sporting, educational and\nreligious) which constitute practices which become an accepted and essential part of the daily fabric of urban life.\nA less positive distinction in people’s understanding of multilingualism is the distinction between what might be\ntermed ‘valued’ and ‘non valued’ languages. With some exceptions the relatively invisible, non-valued languages still\ntend to be the languages of relatively recent immigration, which are seen as ‘different’ (less valued) than the super-\ncentral languages of communication such as French, German, Mandarin Chinese, Hindi and above all English.\nMultilingualism is often interpreted to mean having a population who know or use one or more national languages plus\none or two major languages learned in school. The provision of multilingual services can often mean use of the national\nlanguage with English alternatives, on the assumption that most visitors will speak English. On the other hand, in some\nAfrican countries children are multilingual before beginning primary school, learning one language at home, one or more\nin the surrounding community and then a third or even fourth as a school language, a medium of instruction.\n8 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section I: Multilingualism and plurilingualism\nAttitudes to multilingualism\nJust as the realities of multilingualism are diverse, so too is its image. In many places there is a strong aspiration to\nsee multilingual identity as a marker of global vitality, something of which to be proud. Utrecht in the Netherlands,\nfor example, presents itself as a ‘multilingual hotspot’, where individuals speak more languages than anywhere else in\nEurope and the administration of the city presents this as a positive thing and sign of a better way of life.\nMelbourne, as home to people from more than 140 countries, describes itself as a richly multicultural city, whose\nhistory, economy and current identity are intimately connected to migration. This image is vividly articulated in the\nSandridge Bridge development in Melbourne’s city centre which illustrates the history of all of the nations and people\nwho have shaped the city’s (and state’s) current identity.\nAcross the world, cities from Johannesburg to Kuala Lumpur are pleased to proclaim their multilingual assets – ‘Kuala\nLumpur is an ethnically diverse city with well-educated, multicultural, multilingual inhabitants.’ – although the\nimportance of English in this equation is also stressed: ‘Even if the official language is Bahasa Malay, most people\nspeak good English. The English language is a compulsory subject in all schools.’ (Visitkualalumpur.com)\nIt is undoubtedly significant that many cities now claim to promote some degree of multilingualism as a positive factor\nin a globalised world. Other places – usually more recent arrivals to the globalised table – are not, however, considered\nby their inhabitants to be multilingual in the same way as more typically diverse cities such as London, New York,\nMumbai or Melbourne. Even though they may encompass many languages, this can be regarded as almost incidental, or\neven temporary, by people living there.\nIn general, also, individual inhabitants may have a less settled view than the city authorities. To take the most\nemblematic example of a European cosmopolis, London, for many people it is the quintessential vibrant, cosmopolitan,\ncreative city of over 200 languages. It is the place where they want to live, and language diversity plays a part in that\nchoice. For some, however, it is an uncomfortable place where so many languages are heard on the train that it makes\nthem feel ‘slightly awkward’. For others, though, as shown in David Block’s book Multilingual identities in a global city:\nLondon stories, multilingualism becomes part of their new and broader identity: ‘And sometimes I say to myself, Oh\nmy God, she’s so rude … and in fact it’s because I’m used to the English way of talking and sometimes when I\ngo back to France, in the supermarkets, for example, I say to myself “they are so rude” because they never say\n“sorry”.’ ‘I think in both languages English and Bengali, together they make me truly me.’ ‘When you speak a\ndifferent language … you immerse yourself into a completely different person.’ (David Block 2005)\nWhat this underlines, perhaps, is that while the massive and rapid effects of globalisation – new mobility, new\ncommunication modes, new ways of working – have often been accepted and welcomed as creating an exciting and\ndynamic space for work and living, for others the very speed of change has been a rather more disturbing phenomenon.\nThis applies to the newcomers who feel ‘lost in the cities that would not pause even to shrug’ (Monica Ali in the novel\nBrick Lane) as well as to the inhabitants for whom change has come too rapidly and who find diversity disconcerting.\nAt a time of economic crisis like the present, such feelings of loss and uncertainty are also fuelled by the simplistic\npromises of nationalism and extremism of all kinds.\nOne thing, though, is certain, and that is that such diversity is becoming the norm and if anything it will become more,\nrather than less, complex.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 9 Section II: The multilingual landscape\nSection II: The multilingual landscape\nThere is a widespread view, for example in parts of Europe and in the USA, that monolingualism is normal and\nmultilingualism is therefore a challenge to that normality. In fact historically and globally quite the opposite is the\ncase. It was only with the development of European nationalism, particularly in the 19th and 20th centuries, that the\nidentification of language and nation became ‘normalised’.\nNational monolingualism – a recent phenomenon ‘It is easy to forget that multilingualism is historically the\nnorm and that national monolingualism has been of relatively short historical duration in certain parts of the\nworld only: the reason we talk about pluralism (in the city) as though it is disrupting something is because we\nhave normalized the idea of that “something” being the national state.’ (LoBianco 2014)\nHistorical multilingualism\nThere is evidence for multilingualism in ancient Greek, Egyptian and Roman times, including languages such as\nHebrew, Aramaic, Egyptian, Lycian, Greek and Latin. The emblematic Rosetta stone itself is evidence for this.\nThere are even tantalizing suggestions in the written archives of the strength of spoken multilingualism, for example\nin this story from the Old Testament: ‘When those Ephraimites which were escaped said “Let me go over”,… the\nmen of Gilead said unto him. “Art thou an Ephraimite?” If he said “Nay” then they say unto him, “Say now\n‘Shibboleth’”: and he said “Sibboleth”: for he could not frame to pronounce it right. Then they took him and\nslew him at the passages of Jordan.’ (Judges 12:6)\n42,000 of them failed to pass this “first phonetic test in recorded history” (Blanc, 2008) and were put to death.\nIn the Roman Empire, internal governmental communications from the Emperor and other official documents were in\nLatin. Until the beginning of the 7th century it was also the language of the army but generally speaking the Romans\ndid not impose their language on others. In the Eastern Roman empire, laws and official documents were regularly\ntranslated into Greek from Latin. Latin–Greek bilingualism was characteristic of the Roman and Greek intellectual\nelites and both languages were in active use by government officials and the Church during the 5th century. From\nthe 6th century, Greek culture was studied in the West almost exclusively through Latin translation. Bilingualism and\ntrilingualism were also common in regions where languages other than Latin or Greek were spoken such as the western\n(Gaulish, Brithonic), eastern (Aramaic), northern (Germanic) and southern (Punic, Coptic) parts of the empire. Roman\ncitizenship was given to nationalities throughout the Empire (with no test of linguistic competence and no\n10 flag to salute) and the movement of people – in the army, administration and for trade – was extensive. Perhaps\nnot surprisingly therefore we have evidence from across the enormous Empire of a relaxed and non-controversial\nmultilingualism – memorial stones for example attest to marriage (and other relationships) between communities\nand may be written in several languages. While continuing to use their own languages, illiterate people all over Europe\nlearned Latin, even without the help of language teachers and interactive whiteboards.\nRegina and Barates – a mixed couple from the North East of England ‘For a real glimpse into the kind of\ncomplexity you find on the northern frontier (of the Empire) ... this tombstone is absolutely extraordinary. It is\na tombstone to a woman called Regina and she is an ex-slave … and she’s the wife … of a man called Barates,\nwho wants us to know that he is from a long way away.… He is a man of Palmyra.in Syria. ‘She came from down\nsouth … a member of the Catalauni tribe, somewhere around St Albans now. Interestingly underneath [the\nLatin inscription] we’ve got another text written ... in Palmyrene.… It says “Regina, the ex-slave of Barates.\nHow much I miss her!” ‘I wonder … how a poor girl from the Catalauni tribe ended up being the slave of a\nPalmyrene and eventually married him, ending up here on Hadrian’s wall.… Did the couple stick out or did\nthey blend in with a lot of other people enjoying very mixed relationships? What language did they speak at\nhome? … This looks to be an absolutely perfect example of the kind of clash of cultural identity, the merging\n10 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section II: The multilingual landscape\nof cultures ... in the community ... here.’ (Mary Beard’s Ultimate Rome: Empire without limit Episode 3 28.47-\n32.09; BBC 2016)\nOutside Europe – in India, China, Africa and the pre-conquest empires of America – multilingualism was the norm\nand in many cases continues to be so to this day. Although in the past dominant languages and linguae francae\ndeveloped (Quechua, Nahuatl, Urdu, Hindi, Swahili and classical Chinese) this was not generally to the detriment of\nother languages and dialects. In the 21st century, official multilingualism – both India and South Africa being striking\nexamples – is relatively non-controversial in much of the world.\nIn Europe itself until the 19th century a dominant form of political entity was the multiethnic and multilingual\nmonarchic empire such as the Austro-Hungarian Empire, the Russian Empire, and the Ottoman Empire. These empires\nwere ruled by one ethnic group, but were generally characterised by ethnic, religious and linguistic tolerance. Much of\nthe administration of the Ottoman Empire, for example, was in the hands of the Greek-speaking Phanariots.\nThe ideology of monolingualism\nIt was really with the formation of European nation states, beginning in the 15th century but associated especially with\nthe French Revolution and the nationalist movements of the 19th century, that the idea of ‘one language, one nation’\ntook hold. This was itself facilitated by an earlier communications technology – the printing press – which underpinned\nthe standardisation and diffusion of the vernacular languages of Europe. These movements often took place in conflict\nwith the great empires and eventually, for example, led to the unification of Germany and Italy.\nLanguage and nation ‘Has a people anything dearer than the speech of its fathers? In its speech resides its whole\nthought-domain, its tradition, history, religion and basis of life, all its heart and soul.… The best culture of a\npeople cannot be expressed through a foreign language; it thrives on the soil of a nation most beautifully and\nmay I say, it thrives only by means of the nation’s inherited and inheritable dialect. With language is created the\nheart of a people.’ (von Herder 1784)\nThis process continued after World War I across central and Eastern Europe and more recently with the formation of\nseveral nation states in the Balkans following the break-up of former Yugoslavia, where the language question continues to\nhave a major influence on ideas of identity. For example, the language once known as Serbo-Croat now has three variants\n– Serbian, Croatian and Bosnian – mutually comprehensible but each linked to a different nation state.\nNationalist rhetoric and policy have left a strong and lasting legacy of ideological monolingualism in Europe and\nelsewhere. This has also resulted in linguistic hegemonies.\nLinguistic hegemony ‘Thus English elbowed Gaelic out of Ireland, French pushed aside Breton, and Castilian\nmarginalised Catalan.’ (Anderson 1983:78)\nMonolingualism has been promoted by dominant groups and has posed a great challenge to the languages\nof indigenous, regional, local and immigrant minorities worldwide. Despite the existence of several thousand\nlanguages across almost two hundred countries, a majority of countries recognise only one language for legal and\nofficial purposes, and even where several languages are officially recognised, one is usually dominant carrying\n‘disproportionate amounts of social, economic and political power’ (Edwards 1994: 2f).\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 11 Section II: The multilingual landscape\nThe vitality of contemporary multilingualism\nThere is an undeniable vitality to multilingualism. The increased complexity of our diverse globalised world increases\nrather than reduces this vitality, as the experience of any of our major cities will confirm. Running counter to the idea\nof ‘one language one nation’ is not only the reality of great cities from Kolkata to São Paulo, but an opposing ideology\nof ‘unity in diversity’. It would, however, be counter-intuitive to expect that this diverse identity could be represented\nby a single and simple model of multilingualism. Not only does the weight of history influence present-day realities, so\ntoo do current economic and political tensions, and the social and cultural consequences which ensue have an impact\non how we see ourselves. The model therefore is not one of ‘the multilingual entity’, but of a more complex typology\nof places – states, cities – which share some common characteristics, but which are essentially distinct and rooted in\nparticular landscapes.\nThe Cosmopolis and the world\nOne obvious result of this ‘unity in diversity’ is that political and social priorities relating to languages may vary\nsignificantly from place to place. In what has been characterised as the ‘Cosmopolis’ (Sandercock1986, LoBianco 2013) –\nthe cities which others have called hyper-diverse, such as New York, São Paulo, Mumbai and London – the major linguistic\nissues concern on the one hand the impacts of immigration and settlement and the consequent diversity of languages\nused in the urban context, and on the other the demands of the global market in relation to trade and exchange.\nThis also involves a significant interest in ‘temporary’ migrants such as tourists and students, who now constitute a\nmajor part of the city’s ecology and economy. These issues have an effect both on language policy planning – in health,\npublic services and above all education – and also on peoples’ attitudes to the image of the city – whether largely\npositive or negative.\nPreparing for diversity\nIn other places the linguistic priority may be to prepare for globalisation by increasing plurilingual competence among\nthe indigenous population, and creating better conditions for welcoming visitors, whether for trade or tourism. In these\ncases policy may be directed firstly towards language education at school and university, in particular in relation to\nthe major languages of international communication, and secondly towards the provision of multilingual services and\ninformation for visitors. Significantly these cities and states will often choose to use English as the recognised ‘hyper-\ncentral’ language.\nThe languages of immigrants may remain largely invisible, even though they are usually present. Indeed in a number of\nplaces, in particular those which until relatively recently were cities of emigration rather than immigration, there may\nbe no systematic response to the linguistic challenges of immigration or the needs of new migrants since immigration\nis still regarded as a temporary phenomenon which might pass. Many cities have moved from having inbound\nimmigrant flows to outbound emigrant flows in times of economic difficulty and then back again to net immigrant\nflows as the economy improves (e.g. Buenos Aires, São Paulo).\n12 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section II: The multilingual landscape\nThe language of my neighbour\nAnother noticeable variant in the diversity spectrum is the importance for some places – in particular those close to\nnational borders – of the position of historical minorities and of the languages of close neighbours. Such concerns\nmay be a result of an historical juxtaposition of language groups, predating the growth of 19th century nationalism,\nfor example in the multilingual Ottoman Empire, or they may be consequences of 20th century wars, population\ndisplacement and the redrawing of borders. Policy in this domain is not only a matter of equity and equal access\nto information and resources, but very importantly about the maintenance of national or ethnic identity and the\nresolution of conflicts, including quite recent ones.\nIn comparison with the ambiguous and rather lukewarm attitudes of many countries and international institutions\ntowards supporting immigration and ‘migrant’ languages, support for these ‘national minority languages’ is quite\nexplicit and widespread in Europe, although such support may often be not much more than lip service.\nThese are three examples of the range of reactions to mobility and globalisation and three different types of priority\nwhich ensue. They are not solid and impermeable categories. For example, many of the characteristics mentioned\nin relation to the Cosmopolis are also relevant for other, less developed jurisdictions. In some cases it is a matter of\ndegree. Nonetheless there are important variations which lead to different degrees of visibility for languages (and so\ninstitutional and legal support) and different views on the vitality of multilingualism.\nIn most cases, nonetheless, the English language is present and plays an important role. We consider this further in the\nnext section.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 13 Section III: The role of English\nSection III: The role of English\nMost observers now agree that English has effectively become the global language and that its role is unprecedented in\nworld history. There is of course debate about why this has happened and about the extent to which this is or will be to\nthe detriment of other languages (Philippson 2004, De Swaan 2004, for example ). It is probably not too controversial\nto say that English has acquired this ‘hyper-central’ role not because it is a superior or intrinsically more useful\nlanguage, but as a reflection of geo-political realities.\nA historical contingency ‘The predominant position currently enjoyed by English is a historical contingency\narising from the mercantile and colonial expansion of the British Empire which was followed by American\neconomic and technological hegemony.’ (Umberto Eco 1995)\nNevertheless it is the reality of English as a lingua franca that we must confront today. How does this relate to the apparent\nparadox that at the same time as the dominance of English has grown, our world has become more not less multilingual?\nLanguage choice favours English\nThis reality is shown most clearly by the language choices being made across the world. When a representative group of\nstudents from mainland Europe (none of them specialist linguists) were interviewed in 2010, the dominant role of English\nwas for them beyond question (King et al. 2010). According to Eurostat, already in 2006\/7 within the countries of the\nEuropean Union, ‘In the great majority of cases, English was the language that all pupils have to learn’ (Eurydice 2008\np. 45). Worldwide it has been estimated that some 2 billion people – one-third of the human race – are learning English.\nChina and India are described by many observers as being in a competition to invest in the teaching and learning of\nEnglish (LoBianco, Orton & Gao 2009; Graddol 2006, 2010), and English is said to be the first foreign language in 100% of\nsecondary curricula, including in countries which have been opposed to US hegemony, such as Iran.\nThere are also major initiatives to make English the language of instruction. This has had a considerable effect on\nuniversity-level provision, influenced undoubtedly by the role of English as a vehicle for research. In the 2015 Shanghai\nJiao Tong index of universities, for example, 19 out of the 20 top-ranked universities were American or British; 69% of\nthe top 100 were located in English language settings.\nEnglish dominating university rankings ‘These university rankings favour universities … from English language\nnations because English is the language of research … non-English work is published less & cited less ...\nAmericans tend to cite Americans.’ (Simon Marginson 2007)\nThe effect of this on the university sector is to accentuate a tendency towards English becoming a major vehicle for\nthe transmission of advanced knowledge, notably in the fields of science and technology. There are many successful\nexamples of such Anglicisation of the university curriculum, although these can also have a rather less propitious\nimpact on the integrity of national languages as vehicular languages. Inevitably this has also affected school level\nprovision, and in a number of countries there has been a significant growth of ‘English medium’ education but with\nrather more mixed results.\nA qualitative change – English as a basic skill\nThe significance of such a massive and unprecedented development of English language learning is not simply a matter\nof degree. What seems to be happening is on the one hand the emergence of more than one ‘English’, and at the same\ntime a new orthodoxy is being developed which sees English – or possibly Englishes – as no longer a ‘foreign language’\nbut as a necessary communication tool for study and work – in other words as a basic skill to which all people aspire.\nDavid Graddol (2010) describes a paradigm shift in English language learning from the traditional ‘English as a foreign\n14 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section III: The role of English\nlanguage’ progression route, which although it will vary from learner to learner and country to country is a fairly\nrecognisable description of foreign language learning progress. to a new model for the ‘global English curriculum’\nwhich, although still aspirational for many and in many ways idealised, marks a qualitative break with the old paradigm\nand reaches the higher levels of proficiency at much younger age groups:\nThis new model is far more critical for teachers and learners, mainly because a sufficient level of English is required\nnot solely for its intrinsic value (access to Anglophone culture, commerce, etc.) but as a condition of employment and\nhigher education within national as well as international contexts.\nMany observers have commented on these changing objectives of English language learning. Current practice gives\nprimacy to language in use, not least for employability, often linked to such essential ‘soft skills’ as teamwork, creative\nthinking, communication and presentation skills. (Graddol 2010, LoBianco 2011). Increasingly, a specified level of\nEnglish is an entrance requirement for university. The consequence of all of this is a tendency to begin teaching in\nEnglish in primary schools, to include teaching part of the curriculum in English at secondary level and at the very least\nto expect university students to be able to access information and knowledge in English.\nNew expectations for English ‘The relationship between age and expected levels of proficiency in English has\nshifted – with major implications for textbooks, curriculums, methodologies and assessment. English learning at\nbasic – and sometimes intermediate – levels is becoming a childhood matter across the world.’ (Graddol 2010)\nEnglish has in many countries become no longer the preserve of an elite but an aspirational language for all. Just as our\nEuropean students assume that English is an inevitable part of their linguistic repertoire, so too in India a 2009 poll\nshowed that 87% of those surveyed felt that ‘knowledge of English is important to succeed in life’ (Graddol 2010).\nIn Armenia it is commonly said that ‘every mother knows that for children to succeed they need just three things:\ncomputer literacy, a university education and English. (Council of Europe 2009).\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 15 Section III: The role of English\nThe realities of provision and performance\nSuch lofty aspirations do not always correspond to the realities of language provision, particularly in the school sector.\nThere are a number of aspects to this.\nThe most obvious is the educational challenge of developing appropriate pedagogies for what has become a mass\ndemand, often in educational systems which have traditionally been elitist and formal in their approaches. This may be\na particularly challenge for language teaching and learning.\nThere are also issues of capacity. This includes actual resources – budgets and infrastructure, for example. These are\nchallenges in the developed world (Europe, Australia, Canada), but they are particularly acute in developing countries\nwhere the potential numbers of learners are so great and facilities and teacher competence often only rudimentary. In\ngeneral there is a major issue of teacher supply for teachers of languages; competence in English (and other languages) is\na marketable asset beyond education and this can make the recruitment and retention of teachers particularly difficult.\nImplementation is also a major challenge. This includes the ways that resources are used and the management and\nmonitoring of projects for which expertise is often limited. It also involves making use of appropriate delivery routes\nand mechanisms involving central government, devolved and local authorities, individual institutions and in some\ncases the very important voluntary sector. Managing change faced with this diversity can be difficult and frustrating.\nLanguage policy is not only a question of effective pedagogy, resources or implementation; it is also a political and\nideological issue about power and identity and access to opportunities. It is therefore particularly subject to political\ninfluences – changes of policy by new governments or different linguistic interest groups, for example. It is sometimes\ndifficult to engage in calm and well-informed debate about such issues as language choice when the political and\ncultural stakes are so high. As recent history in England shows, this is not a problem only for developing countries.\nThe National Strategy for Languages (England) 2003–2011 ‘In 2003 the UK Government announced a national\nstrategy aimed at improving language performance in English schools. Key elements of the strategy included\nthe introduction of languages into the primary sector, increasing take up post-14 and developing more effective\ncurricula and assessment tools. By 2008 the annual budget for the strategy had reached £55million. This\npolicy was effectively ended by the new government elected in 2010 which removed all targeted funding for\nlanguages and terminated all of the initiatives developed as part of the strategy.’\nA major consequence of the dislocation between aspiration and reality is that standards of language competence in the\nschool sector do not generally reach the levels expected or in some cases claimed. Most of the European jurisdictions\nthat have reviewed their language education policy identify shortcomings in both quality and standards at school level,\nin all languages including English (Byram, in Council of Europe 2009). A similar disjuncture has been identified in Asia,\noften related to the size of the challenge: ‘Most of the school teachers in Shanghai have their BA, while English\nteachers in remote areas cannot speak English correctly.’ (Bai Mei 2012) and from India: ‘Even in the active\nclassrooms, pupil achievements were very poor. Teaching methods are dominated by mindless rote learning, for\nexample, chanting endless mathematical tables or reciting without comprehension. It is therefore not surprising\nthat children learn little in most schools.’ (The Hindu 2009 (cf. PROBE report (1999) & De et al (2011)) Despite a\ncommon assumption that English is widely spoken in India, it has been estimated for example that about two-thirds of\nIndians are below the A1 (basic) level of proficiency (Graddol 2010).\n16 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section III: The role of English\nEnglish and diversity\nAnother factor which might help us to understand this dislocation between aspiration and reality is the relationship\nbetween English and other languages. English as desired lingua franca and multilingual realities do not always coexist\nin harmony.\nIn countries where general levels of education and literacy are low, there are major challenges, particularly among the\nrural population and the urban poor, to introduce basic literacy without which operational competence in another\nlanguage (English) is unlikely beyond a very elementary level. At the same time there are growing expectations fuelled\nby modern mass media that education (and the English language) are keys to progress and desirable for all. If English is\nseen as an alternative to first language competence, the results are likely to be confusing at best. Even in jurisdictions\nwith relatively high levels of education, unless basic mother tongue literacy is secured, overall linguistic progress is\nimpeded. We discuss this question in greater detail in Section 5. It is a dilemma which has caused confusion and policy\nchanges in a number of countries in recent years.\nOne example is Malta, where there are two official languages – Maltese, the national language, and English. There is\nmuch concern about standards of literacy, often linked to when and how to introduce mother tongue literacy and\nto concerns about the common practice of code-switching. Outside Europe, in Rwanda the government policy of\nswitching the official language (and so language of schooling) from French to English had to be modified when it was\nunderstood that neither French nor English was the first language of most learners and that they needed to become\nliterate in that first language before they could acquire another language of instruction. This is a debate which is taking\nplace in many parts of Africa and South Asia.\nCASE STUDY – Rwanda ‘The Government wanted to switch the national official language from French to\nEnglish, and gave the teachers one year to prepare to teach in English from grade 1. All 54,000 teachers were\ngiven a three-week course each November (in their school holidays). It became clear that the teachers were not\nall highly proficient in French, let alone English, and the same was true of students. For most learners, L1 was\nKinyarwanda, and they were not fluent in French or in English.\n‘Rwandan society had used French, and was now using English, as some kind of common public language but\nonly a small elite is fluent in this official language, English. The majority of the population has a first language,\npossibly an African or regional second language (e.g. Swahili). The ‘official’ language of instruction – whether\nFrench or English – is a foreign language, not a significant part of their plurilingual repertoire.\nWhen it became clear that the learners needed to become literate and confident in their first language(s),\nbefore learning any language of instruction which was in fact a foreign language, the government decided to\npush English as a language of instruction back to Grade 4.’ (Michael Carrier 2016 (and cf. British Council 2011))\nMore broadly there can be a tension between the diverse linguistic realities of the world and the expectation that\nEnglish is the key to education and economic progress. That this does not need to be the case is illustrated by our\nEuropean students for whom on the one hand English was vital, but who also saw no benefit in English replacing their\nnational language or indeed other languages.\nEuropean identity ‘The most crucial part … will be to make people understand that speaking multiple languages\nand having interest and respect for other cultures is very important. Even though every country in Europe has\nits own identity, Europe has to develop an identity for its own to become a unity, comparable to one single\ncountry with a lot of official languages.’ (‘Tamara’ in King et al. 2010)\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 17 Section III: The role of English\nHowever, both in the countries where diversity has been mainly the result of mobility and immigration, and in\ncountries like India with over 1,000 identified mother tongues and 22 ‘scheduled’ or official languages (not including\nEnglish) there is a clear hierarchy of languages which sees English as the language of power and status, and where\nthe language of ‘lower’ classes or immigrants are regarded as inferior. One consequence of this is that these other\nlanguages can be undermined, with negative effects on cognitive development.\nOne complicating factor arising from this widespread support for English language learning is that it also becomes an\nideological issue – and policies become driven by what people believe rather than by any objective reality. It is very\ndifficult to stand in the way of ‘what every mother knows’, even if in the real world there are not enough teachers or\ntextbooks. There is therefore a risk of dislocation between the believed value and efficacy of the English ‘panacea’ and\nthe realities of provision which may be minimal.\nImpact of the lingua franca on English speakers\nSo far we have considered mainly the effect of English as lingua franca on the speakers of other languages. It has also\nhad a major impact on both the thinking and the language competence of first language English speakers and on the\neducational policies of Anglophone countries.\nLife in the Anglobubble ‘Well, it’s that part of the world, with a concentration of monolingual English speakers,\nthat operates in English, thinks it only natural that everything should happen in English and should logically be\nexperienced and understood in English. Of course, in this worldview, everything is always best in English too.\nSometimes it’s just plain crazy thinking.… English is often said to open up the world for you. And while that is\ncertainly true in many respects, it’s amazing what you don’t see and what you can’t do when you only speak English.\n‘Where is the Anglobubble exactly? Well, when you’re ensconced in it as a monolingual English-speaker, it feels\nlike the entire planet. For those with a more discerning eye and ear, it’s particularly concentrated around the\nUS, Canada, the UK, Ireland, Australia and New Zealand. But its reach is certainly huge and in many respects\nglobal.” (John Hajek, University of Melbourne)\nIt is now a cliché and a subject for jokes to equate English native speakers with monolingualism. Yet behind the caricature\nthere is an important truth. Provision for language learning in most anglophone countries is less than in other parts of\nthe developed and in some cases developing world. Proficiency has also been consistently measured at a lower level, in\nparticular among school children, many of whom have only marginal competence. This monolingual default position\nwhich is by no means confined to the UK and USA, has if anything become accentuated as competence in English has\nincreased in other countries. It is also affecting some non-anglophone countries, where levels of English competence are\nparticularly high. English becomes regarded as the only important second language to the detriment of other languages,\nincluding languages of international communication such as French, German and Russian.\nA major consequence of the assumption that ‘English is enough’ is to exclude both individuals and organisations\nfrom access to the multilingual world described in Section 1. The employment market is multilingual and employers\nincreasingly require levels of language competence and intercultural sensitivity in addition to high levels of English and\nnative language competence. The world and its cultures are also diverse and increasingly the ‘Anglobubble’ is excluding\nitself from those cultures. The result is not only impoverishment of the spirit but a lack of understanding of and useful\nengagement with other peoples and cultures.\nA problem of identity\nFinally in this context we need to be aware of the cultural and indeed psychological impact of English on national\nidentities. In the anglophone countries this underpins misplaced attitudes of cultural and even racial superiority, which\nfind an echo in political attitudes and actions. In other countries the dominance of English can be perceived as a threat to\nthe national language – seen as important for the unity of the nation.\n18 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section III: The role of English\nEven in some major European countries this has become an issue for some academics and governments who have\nsought to stem the tide of anglicisation. In other places there are concerns about linguistic confusion – the place of code\nswitching, for example – and uncertainty about how to respond to the phenomenon. Such debates have taken place\nnot only in Europe but in South Africa and Asia where this has been a matter of considerable debate. In response to the\n‘English question’ there have been policy shifts in Malaysia (Guardian online 2009) and it is still a matter of controversy in\ncountries such as Indonesia, Singapore and India. Even where there is no perceived threat to the national language – as in\nChina – an identity issue has been reported in relation to the position of English, leading to rejection and antipathy.\nHatred of English learning ‘When I interviewed an outstanding freshman of China Central Academy of Fine Arts\non English learning, the No.1 art university in China, I can feel the feeling of hate toward English learning in her\nvoice. It seems to her learning English is totally waste her life, and it is just a way to entry the university. When I\ninterviewed the university lecturers in English in the Mongolia Technology University, two lecturers even cannot\nhelp to crying because of the embarrassment and feeling of failure on using English. I was very shocked at the\nmoment, but at the same time I deeply understood them.’ (Bai Mei (and see also LoBianco, Orton & Gao))\nAt the very least any proposals to support and develop English language learning should take account of these sensitivities\nand seek to ensure that English can be a support for other languages and literacy and not a threat. The corollary of this is\nan understanding that to be a fluent native speaker of English is not sufficient if we are to understand and participate in\nthe world. This implies that we should consider the ways in which English can become not a replacement for diversity but\na key component of the diversity which seems to be an enduring characteristic of humankind. What kind of education will\nenable our future citizens to develop as global citizens with a plurilingual repertoire, open to the world, its cultures and its\npossibilities, where English is necessary but not sufficient?\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 19 Section IV: Trends and issues in multilingual education\nSection IV: Trends and issues in multilingual education\nThe language of schooling – a complex issue\nThe role of language and communication in the educational process is rightly seen as a critical issue. It has long been\na preoccupation in the English-speaking world. In 1975 the influential Bullock Report (A Language for Life) argued that\nlanguage was more than just a subject in school but in fact the key to learning across the whole curriculum. Language\nis used in every subject area both to impart and acquire knowledge and understanding. In that sense it was said by\nBullock that ‘every teacher is a teacher of language’. The Bullock Report has had significant impact on educators and\npolicy makers in the English-speaking world\nCanadian reflections on Bullock ‘In all subject areas, the use of language involves the student in the formation\nof concepts, the exploration of symbols, the solving of problems, the organisation of information, and\ninteraction with his or her environment. Teachers need to recognise and reinforce the central role of language in\nthis learning process.’ (Ontario Ministry of Education 1977: 5)\nThe discussion was taken further by researchers and educators such as Douglas Barnes in England, Jerome Bruner in the\nUS and Jim Cummins in Canada, to name but a few. In essence they all argued that ‘there can be no learning without\ncommunication and that our knowledge is inseparable from the language that we use to express, store and access it’\n(Little, in King & Carson 2010). One important aspect of this argument, which is of particular relevance for today’s diverse\nclassrooms, is the distinction between ‘action knowledge’ – the knowledge which learners bring with them into the school\nenvironment – and ‘school knowledge’, which uses the more formal and abstract language of the curriculum.\nBarnes on school learning ‘We partly grasp it, enough to answer the teacher’s questions, but it remains\nsomeone else’s knowledge, not ours. If we never use this knowledge we probably forget it.’ (Barnes 1976)\nAccording to Barnes, unless learners are able to access this ‘school knowledge’ and incorporate it into their view of the\nworld (action knowledge) they will only half understand it and will be unable to progress. This is a major challenge for\nall teachers.\nThe distinction was developed further by Jim Cummins in Canada who contrasted what he called ‘BICS’ (basic\ninterpersonal communication skills) and ‘CALP’ (cognitive academic language proficiency), later simplified to\n‘conversational’ and ’academic’ language proficiency. ‘Conversational’ language is the language used for informal\ncommunication outside the classroom. It is highly contextualised and is the means by which children first experience\nthe world, and indeed assimilate other languages, apparently instinctively.\nConversational and academic language ‘The playground situation does not normally offer children the\nopportunity to use such language as: “if we increase the angle by 5 degrees, we could cut the circumference into\nequal parts.” Nor does it normally require the language associated with the higher order thinking skills, such as\nhypothesising, evaluating, inferring, generalising, predicting or classifying. Yet these are the language functions\nwhich are related to learning and the development of cognition; they occur in all areas of the curriculum, and\nwithout them a child’s potential in academic areas cannot be realised.” (Gibbons 1991: 3)\nBy contrast, ‘academic’ language proficiency depends on linguistic rather than contextual clues, and to make sense of\nit the learner needs to be able to decipher more complex meanings. In addition, different subject areas have their own\n‘academic language’, whether in science, geography or the arts. Some mastery of academic language is therefore critical\nfor all learners, and indeed in wider society beyond school it can be regarded as an important life skill. Without it citizens\nare unlikely fully to understand and assimilate abstract meanings – scientific, cultural, social and indeed political.\n20 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nLanguage proficiency misleading ‘The children seem to have much greater English proficiency than they\nactually do because their spoken English has no accent and they are able to converse on a few everyday,\nfrequently discussed subjects. Academic language is frequently lacking. Teachers actually spend very little\ntime talking with individual children and tend to interpret a small sample of speech as evidence of full English\nproficiency.’ (Vincent 1996: 195)\nUnderstanding this distinction has a particular relevance in a multilingual classroom, where there are many home\n(conversational) languages and where a level of conversational fluency may be acquired in the national language – the\nlanguage of schooling – which disguises the learner’s difficulty in accessing more abstract, academic language.\nIn recent years the Language of Schooling has been a particular concern of the Council of Europe which since 2005 has\norganised conferences and seminars and developed a number of tools and guidelines to support teachers and learners\nacross the curriculum, both in the context of speakers of the national language and second language speakers.\nCouncil of Europe and Language of Schooling ‘This project deals with the language(s) of instruction in school\nwhich is most often the national or official language(s) and also the mother tongue of the majority of students; in\na number of contexts this language is of course their second language where they have a different mother tongue.\nWithin the wider concept of plurilingualism and respect for linguistic diversity, the project … also address[es] the\nneeds of these learners with regard to competence in the national\/official language.’ (Council of Europe)\nYet despite the recognised importance of the language(s) of schooling, since 1975 very few countries have developed a\nclear and coherent policy for language across the curriculum. There is certainly an interest at policy level, as evidenced\nby the profiles on national language policy carried out by the Council of Europe since 2003, but very little has been\ncarried though systematically in practice.\nWhy is this case?\nThere are two major issues – challenges – which may have a bearing on this policy void:\n• a policy vacuum in relation to languages\n• confusions over the dominance of English.\nPerhaps understanding these will create a better context for supporting English in a multilingual world and for\nmaintaining diversity.\nA policy vacuum\nIn most jurisdictions there is little explicit policy on languages in general. The stress is increasingly on the importance\nof the national language and only lip service is paid to multilingualism, with the exception of English (as a second\nlanguage). The general issue of languages across the school curriculum or in society is rarely addressed.\nMore generally, the traditional or common sense way of thinking about language policy – an approach which we\ncould call ‘language planning’ – involves an explicit differentiation between different aspects of language. In one\ncomprehensive categorisation of language policies throughout the world (LeClerc 1999), language policies are\ncharacterised in many different ways (for example ‘assimilation’, ‘non-intervention’, ‘bilingual’) but interestingly\nthere are few if any models of state-level language policy which are truly comprehensive. Instead, there are policies\nconcerning the national language, there are policies about foreign language teaching, there are policies to support\nor restrict minority languages. At this point in the 21st century it would appear that in the political sphere at least,\nlanguage is viewed as if composed of a set of different and not always connected phenomena – national language,\nsecond languages, foreign languages, minority languages – each with a separate policy framework.\nThis general perspective is confirmed by the experience of the Language Education Policy Profiles carried out under the\nauspices of the Council of Europe (Council of Europe 2009). We may therefore conclude that although conceptually\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 21 Section IV: Trends and issues in multilingual education\nthere is a clear interrelationship between language in all its manifestations, in most realities there is a range of\nlanguage policies and these policies can be – and often are – contradictory.\nDespite an emphasis on the importance of literacy and communication skills, the realities of a communication in a\nmultilingual world tend to be ignored, and their significance underestimated.\nConfusion about English as a lingua franca\nIt seems just a small step from recognising the importance of English as a lingua franca to supposing that ‘English is\nenough’. The difference, however, is critical. English will not replace the world’s languages and the dominance of English\ndoes not obviate the need for other languages. On the contrary: the world is likely to become more not less multilingual.\nAs a result of this confusion, as we have outlined in Section 4, there remain a number of unresolved questions about\nthe relationship between English and national languages. There are examples of a wholesale and relatively sudden\nswitch from the national language to English as the favoured language of schooling. For a number of reasons – not\nleast teacher competence – this can prove problematic. In particular it ignores what we know about the acquisition of\nliteracy and access to the ‘academic’ language of learning, initially through the mother tongue.\nThere can also be a false dichotomy between English and other languages, whether major languages of communication\nor regional and minority languages. Research and observation tell us that the human brain is capable of using\nmore than one language and in fact suggest that speakers of more than one language can often achieve more than\nmonolinguals. There is no inherent conflict therefore between an emphasis on English as the first foreign language\nor even as a language of schooling and the promotion of plurilingual competences. It is almost a truism to say that\n‘the more foreign languages you learn, the easier it becomes’. And despite the undoubted educational challenges\nfor children whose first language is not the national language, the evidence shows that they too are able to flourish,\nlinguistically and academically. A striking example of this comes from the borough of Tower Hamlets in East London,\nwhere a majority of pupils speak English as a second language.\nThe Example of Tower Hamlets, London ‘Fifteen years ago, the schools in Tower Hamlets were derided as the\nworst performing in the country. Things were so bad that Ofsted, the education standards watchdog, insisted\nthat its damning report on them should be presented in full to every councillor in the east London borough to\nunderline how much they were failing local children.\n‘But from today, the history books need a new chapter: a report on education in Tower Hamlets has reached the\nconclusion that it has some of the best modern urban schools in the world. It is a remarkable achievement for\nwhat is one of the poorest boroughs in England, where 57 per cent of pupils are entitled to free school meals\nand 89 per cent speak English as a second language. National curriculum test results have shown its schools\nnow post above-average grades for the UK in reading and writing, even outperforming wealthy Kent in English\ntests for 11-year-olds. It was not always so.\n‘In 1997, the borough came last out of 149 English education authorities in terms of performance. An\nearlier Ofsted report described reading standards as poor and the quality of teaching often unsatisfactory.\n(Independent 2013)\nBut our accepted wisdom often reverts to a model of ‘one nation one language, one brain one language’. Not\nonly lay people and policy makers but even academics may assume that certain children should not learn foreign\nlanguages, and that learners should suppress their mother tongue in favour of the lingua franca. This ‘accepted’ view of\nbilingualism as a ‘problem’ does not hold up in reality.\n22 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nFinding solutions 1 – the bilingual ‘problem’\nThis view of bilingualism as a deficit leads to a conclusion that a monolingual approach should generally be adopted\nin learning situations, whether learning through the national language or acquiring and then using a major world\nlanguage – often English. However, as the example of Tower Hamlets shows, raised expectations combined with\nintensive language support in the language of schooling together with civic and community support and valuing of\nhome languages can turn this ‘problem’ into an asset.\nDespite such evidence there are few examples of mother tongue support in schools for non-native speakers of the\nnational language, and even they may be declining as a result of the economic downturn. Teachers have also found it\ndifficult to adopt such a bilingual approach when there are many second languages (as opposed to a dominant second\nlanguage such as Spanish in the USA).\nThere is, however, an alternative approach based on the interdependence of languages – using both (or several)\nlanguages, and not necessarily requiring teachers to master many other languages. This is different from bilingual\nteaching and has been described as ‘functional multilingual learning’ (Sireens and van Avermaet 2013: 217).\nThree examples of multilingual integration\nDespite the strength of the ‘deficit’ view of bi- and multilingualism, there have been a number of successful positive\npractical approaches to integration. The following examples are taken from David Little’s chapter in King and Carson\n(2016:155–160). Although different in scope, they all involve ways of breaking down barriers between the languages\ninvolved in the education process.\nIn Ireland the English Language Support Programme ran from 2007 to 2010 as part of Trinity College Dublin’s Trinity\nImmigration Initiative. Its aim was to enable immigrant pupils to access the academic language so vital for educational\nsuccess by providing practical tools for teachers in six core curriculum subjects.\nThe English Language Support Programme ‘The ELSP set out to describe the language of six core curriculum\nsubjects – English, Geography, History, CSPE (Civic, Social and Political Education), Mathematics, and Science\n– in the first three years of Irish post-primary schooling, the so-called junior cycle. It did so by carrying out a\ncorpus linguistic analysis of the most commonly used textbooks and recent public exam papers in each subject.\nThis approach was chosen because textbooks are the principal source of disciplinary knowledge, underpinning\nteacher talk in the classroom and the spoken and written production required of pupils, and the academic\nlanguage used in exams reflects the language of textbooks.’\nA very striking example of how to raise literacy achievement for all pupils, and especially those with other mother\ntongues, comes from Canada and Cummins’ Literacy Engagement Framework. Based on the premise consistently\nconfirmed in the PISA studies that there is a strong relationship between reading engagement and reading\nachievement, the framework sets out how to engage learners, linking their abilities in their first language to the\ndevelopment of second language competence and their cognitive development through the language of schooling.\nEngaging with learners’ identity and their prior knowledge in their home language, enables them, in Douglas Barnes’\nterms, to use their existing ’action knowledge’ in order to acquire ‘school knowledge’.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 23 Section IV: Trends and issues in multilingual education\nLiteracy Engagement Framework ‘The Literacy Engagement Framework is based on the belief that literacy\nengagement, which presupposes free access to books and other printed materials, directly determines literacy\nachievement. Cummins bases this claim on the findings of empirical research, pointing out that the PISA studies\nhave ‘consistently reported a strong relationship between reading engagement and reading achievement\namong 15-year-old students in countries around the world’ (Cummins 2013: 18). The framework specifies four\ninstructional dimensions that Cummins argues are critical to enabling all pupils, but especially immigrants,\nto engage actively with literacy from an early stage of their schooling. First, their ability to understand is\nscaffolded in a variety of ways; second, instruction connects to their lives outside school by activating and\nbuilding on prior knowledge (which may be encoded in their home language); third, instruction affirms their\nidentity – academic, linguistic and cultural – by enabling them to showcase their literacy achievements in their\nhome language as well as the language of schooling; and fourth, a variety of techniques are used to extend their\nknowledge of and control over language across the curriculum.’\nA larger-scale project took place in Germany between 2004 and 2013 – the FörMig project, which was followed by a\nresearch project, LiMA, both at the University of Hamburg.\nFörMig and LiMA ‘The FörMig project (Förderung von Kindern und Jugendlichen mit Migrationshintergrund\n[Support for children and adolescents from migrant backgrounds]; was funded for five years, from 2004\nto 2009, involved ten of the sixteen German federal states, and brought together expertise from across\nthe country to address questions of learning and education in linguistically and culturally heterogeneous\nsettings. One of the project’s central concerns was to foster close links between schools and the surrounding\ncommunity. Accordingly, it implemented a network of ‘developmental partnerships’ comprising a ‘basic unit’\n(for example, local schools, a municipal day care centre, a parents’ initiative, and the town administration) and\n‘strategic partners’ (for example, the public library, the local education authority, the educational psychology\nservice, a centre for early child development, and a medical association).\n‘FörMig’s principal research-lead activities were in diagnostics and integrated language education. It helped to\ndevelop and test tools to support the diagnosis of individual language development and inform the design and\nimplementation of individualised language support plans (Gogolin et al. 2005; Reich et al. 2007). The work on\nintegrated language education adopted a language-across-the-curriculum approach, a major concern being to\npromote cooperation between the different language areas of the curriculum and subjects traditionally thought\nnot to have a language focus. A separate strand was devoted to the competences and resources young people\nneed if they are to make a successful transition into vocational and workplace training.‘ (Ohm et al. 2007)\n‘When the FörMig project ended in 2013 it was succeeded by the LiMA (Linguistic Diversity Management\nin Urban Areas) research cluster. Its main objective was to explore ways of translating migration-induced\nmultilingualism into advantages for individuals and society and benefits for the cultural and economic\ndevelopment of urban centres. To that end the unit analysed the development of plurilingual school students\nand identified ways of orienting instruction to their specific needs, especially in relation to the development of\ntheir proficiency in academic language.’ (https:\/\/www.foermig.uni-hamburg.de\/)\nThese involved both research and development, creating tools to support young people’s language competence across\nthe curriculum and based on a wide collaboration with a range of institutions from education, business and the family\nand across ten German states. In David Little’s concluding comments on this initiative:\n‘Their particular strength derives from the strong links they forged not only between universities and schools\nbut also between educational institutions and their wider administrative and social contexts . In this respect\nin particular they provide an example that could usefully be followed in other multilingual cities.’ (King and\nCarson 2016: 160)\n24 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nFinding solutions 2 – Foreign Language learning\nIn most countries, great importance is attached, at least in words, to foreign language learning, the main exceptions\nbeing some of the countries where the idea that of ‘English is enough’ still has significant influence both on policy\nmakers and on public perceptions.\nDespite this public manifestation of support for increased language competence, the unfortunate reality is that school\nlanguage learning results in less than satisfactory outcomes in many countries, and not only in the anglophone world.\nAccording to the European Survey on Language Competences involving 16 European jurisdictions in 2010\/11, after at\nleast four years of study in school (and often more) less than 50% of 15-year-olds in England, France, Belgium, Spain,\nPortugal, Poland and Bulgaria had reached beyond A1, or beginner’s level in their first foreign language (European\nCommission 2012).\nThis is paralleled by dissatisfaction about the performance of French in Africa and of English in India and China (see\nSection 4).The question therefore has to be asked: Is much school language learning failing and what could be done\nto help successful learning?\nMany years of study and reflection on language teaching and the responses of learners to new languages leads\nto a conclusion which can be frustrating for policy makers. There is no ‘magic potion’ or simple solution which\nwill guarantee successful learning of a language. Learners learn in many different ways – some preferring formal\napproaches and others more spontaneous activities, for example, and there are many complex factors involved in the\nlearning process, not least the competence and the personality of the teacher.\nFortunately, however, we can also say that certain key conditions are required if successful learning is to take place.\nLearners need to hear and use a lot of the language being learned (the ‘target language’); they must have opportunities\nto interact with that language and they must be motivated to learn. As they progress in language learning they will\nalso need to understand how language works. The successful language learner is therefore likely to be using both\n‘action’ knowledge and ‘school’ knowledge. She\/he will also be interested in what she is doing!\nThe Languages Review on successful language learning (UK) ‘Successful language learning can take place when:\na Learners are exposed to rich input of the target language b They have many opportunities to interact through\nthe language c They are motivated to learn. In addition … learners need to understand both what and how\nthey are learning if they are to have long-term success. We need to “capitalise on language learners’ relative\ncognitive maturity” which means that they are able to understand and talk about how language works and to\nbenefit from feedback on their performance.’ (DfES 2007)\nIn many school situations this ‘target’ language is used insufficiently or poorly and many pupils are not engaged and\nsoon become demotivated. They therefore lack spontaneity and are unable to generate language for themselves. There\nis also another major challenge in school language learning, which is the way that time is organised and the amount of\ntime available. In most school situations only a few hundred hours are allocated to foreign language learning, spread\nover a number of years with large gaps during school holidays. It is difficult to imagine what progress could realistically\nbe expected in such a short time, spread over such a long period. In addition, the necessary ‘exposure to language’ is\nmade even more difficult, as it is offered in a series of short lessons interrupted by many other lessons, mainly in the\nlanguage of schooling. It has been described very memorably as ‘gardening in a gale’.\nGardening in a gale The context is England and the learning of another language. In other places the ‘gale’ could\nbe French, Russian or Hindi.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 25 Section IV: Trends and issues in multilingual education\n‘For 40 minutes [the language teacher] strives like a keen gardener to implant … a few frail seedlings of speech\npatterns on the foreign language. Just as the seedlings are taking root … the bell goes and the class is dismissed\ninto the English language environment.\n‘For the next 24 hours the pupils are swept along by a gale of English, listening to different teachers, reading\ntextbooks, asking for more custard with the lunch time pudding, surviving amid the playground witticisms ,\nshouting on the games field, gossiping on the bus going home, relaxing in front of the “telly”. Even in bed the\nEnglish speech patterns the weird logic of dreamland.\n‘Next morning the foreign language teacher finds yesterday’s tender seedlings of French, German or Spanish lying\nblighted and flattened by the gale of English. She(he) gently revives and waters them, but just as they reach the\ncondition they were in yesterday, the bell rings again and the gale of English sweeps in.’. (Eric Hawkins 1981: 97f.)\nThis is why much successful school language learning has been based on a more intensive approach – using the new\nlanguage in a range of activities over a week or even a few days, often supported by self-learning with digital resources\nsuch as online vocabulary exercises, mobile phone apps, online games. A similar benefit is attributed to learning other\nsubject matter through languages, if organised in a sensitive and systematic way, an approach that is generally called\nCLIL (Content and Language Integrated Learning). There have been major CLIL initiatives, for example in Spain and\nItaly, leading to some significant success.\nWhat is key about these approaches is that they intensify the learning process, mirroring language learning in the\noutside world, and they are related to real content, rather than the artificial constructs of the traditional language\ntextbook. They encourage and enable learners to engage with their own learning and in the long term to become\nautonomous language learners.\nA comprehensive language learning model from Australia\nA recent review of language policy in Australia (LoBianco and Slaughter 2009) developed this point and broadened\nits scope. The authors argue that the first condition for successful learning is high-quality teaching – ‘the single most\nimportant controllable variable in successful language learning’. If that can be achieved, then the main goal of the\nteaching and learning process should be to develop and implement immersion modes (whether total or partial). These\nprovide both a significant increase in input and also greater intensity (cognitive challenge). Among the benefits which\ntheir research has identified are a major increase in target-language proficiency and also gains in cognitive flexibility,\ncreativity and intercultural awareness.\nA strategic approach to language provision (Australia) ‘The relevant strategies will be general ones, responding\nto the calls made by students for more serious and communication-based language curricula and language\nspecific, targeting the particular needs of individual languages. At the higher education level there should be\na nationally co-ordinated approach to reform language teacher education both to increase the numbers of\ncandidates attracted to training as language teachers (existing bilinguals and graduates of language degrees)\nand to reform language teacher education methods by supporting teachers to deliver content-based programs\nsuch as partial immersion.’ (LoBianco and Slaughter 2009: 61)\nThere is also a major source of language capability which is largely neglected within the educational system: the\nexisting language competence of immigrant groups. Here we are speaking of Australia, but the argument applies\nto many jurisdictions throughout the world. Such ‘immigrant’ capability is often ignored or regarded as a problem\nby policy makers, despite the enormous societal benefit to be gained by more systematic support for language\ncompetencies in our communities. What is suggested therefore is an explicit combination of this immigrant ‘donation’\nwith the more focused language skills developed in the educational system. All of which presupposes a comprehensive\nlanguage policy in and out of school.\n26 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nGenerating bilingual human capital ‘It is clear that Australia relies principally on the language maintenance\nactivities of its immigrant communities.… While education and training and especially universities are\nindispensable for generating high-literate and discipline-based knowledge of language, and along with diverse\nprivate providers generate most of the new language competencies in society, overall they contribute relatively\nlittle of the total stocks of national bilingual capability.\n‘If Australia were able to articulate the public “donation” of bilingualism offered by minority communities\nwith the focused and instructed language skills produced in public institutions, the nation could generate a\nwidespread, effective and less wasteful distribution of bilingual human capital.”\nTranslanguaging and code-switching\nMultilingual speakers use a variety of discourse practices and linguistic strategies to communicate most effectively in a\nmultilingual context. ‘Translanguaging’ and ‘codeswitching’ describe some of these practices.\nTranslanguaging is used to describe the way that bilingual or multilingual people use their languages (their discourse\npractices), and also to describe a pedagogical approach where the bilingualism of the students is used as a benefit, as a\nresource, in their learning of a new language, rather than being ignored (e.g. when only the target language is used\nin class).\nIn other words, students do not just switch from one language to another (see Code-switching below) but have one\nlinguistic repertoire that covers aspects of both languages. They use both together or separately, or elements of one in\nthe other, to achieve the most effective form of communication for their context.\n‘Translanguaging refers to the language practices of bilingual people. If you’ve ever been present in the home of\na bilingual family, you will notice that many language practices are used. Sometimes the children are speaking\none language, and the parents another, even to each other! Often both languages are used to include friends\nand family members who may not speak one language or the other, and to engage all.’ (Garcia 2011)\nThe theory of translanguaging suggests that ‘A bilingual person is not two monolinguals in one, with each language\nlinked to a separate culture’ (Garcia 2011).\nCode-switching is the discourse practice of being able to alternate the use of two languages, or two registers or dialects\nof the same language, usually in conversation rather than in writing. This example demonstrates code-switching in a\nNorth American context: ‘I ... work in a bilingual school, and my coworkers and I code-switch constantly. Here\n... code-switching centers around lexical gaps … if I learned about a piece of equipment or software in English\nI have a hard time discussing it in French. It’s not just a language proficiency issue, my coworkers who are\nnative French speakers follow the same pattern. So we tend to talk about “le smartboard” or “un programme\nde planned giving.” And some concepts just don’t translate. French kids eat lunch in the school cafeteria; the\nnotion of bringing lunch from home is, well, foreign. So is the notion of having a designated container to bring\nyour lunch from home. So we all refer to “le lunchbox.” (NPR 2013)\nThe potential for learning outside school\nIn the European Survey on Language Competences, by far the highest levels of attainment among 15-year-olds were\nachieved in Sweden and Malta. It is possible that teaching approaches in these two countries are of an exceptional\nlevel, but another factor is likely to have had an even greater impact. In both cases English (the first foreign language) is\nalso acquired and used outside school. A similar phenomenon can be observed in many parts of Asia and Africa. There\nis widespread exposure to English in the media, through culture (films, music and television), in day-to-day commerce,\nand also through the power of the Internet.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 27 Section IV: Trends and issues in multilingual education\nThis is a growing phenomenon in many societies and is particularly powerful in the context of the multilingual city.\nThe reality of life beyond school is increasingly urban and in urban centres we find a concentration of changing cultures\ncreating new kind of identity – living examples of a ‘common sense of belonging based on cultural and linguistic\ndiversity’ referred to in one of the most challenging documents published by the European Union in recent years, Amin\nMaalouf’s 2008 report on Intercultural Dialogue.\nChange is also happening outside the city, but the multilingual city can be seen as a signpost to the future and to\nthe creation of new realities. What we are learning is that they are repositories of language vitality, where different\ncultures and languages can coexist and interact. Within that context the English language does not need to be a threat\nbut rather a support. In the LUCIDE study of multilingual cities, mainly in Europe it was striking to see how many\ncity administrations – Utrecht, Sofia, Madrid and Rome for example – used English as a means of communication\nfor visitors to their cities. This does not need to undermine other languages but can actually facilitate their vitality. A\nsimilar phenomenon can be observed in the strictly educational sphere.\n‘An identity based on diversity’ ‘While most of the European nations have been built on the platform of their\nlanguage of identity, the European Union can only build on a platform of linguistic diversity. This, from our point\nof view, is particularly comforting. A common sense of belonging based on linguistic and cultural diversity is a\npowerful antidote against the various types of fanaticism towards which all too often the assertion of identity\nhas slipped in Europe and elsewhere, in previous years as today. ‘\nBorn of the will of its diverse peoples who have freely chosen to unite, the European Union has neither the\nintention nor the ability to obliterate their diversity. On the contrary, its mission historically is to preserve,\nharmonise, strike a balance and get the best out of this diversity, and we think that it is up to the task.\n‘We even believe that it can offer the whole of humanity a model for an identity based on diversity.\nMultilingualism – a commonly used vehicular language of communication facilitating communication between\ndifferent language groups.’ (European Commission 2008: 5)\nA related reality is that both language use and language learning are no longer confined to educational establishments.\nIn particular the highly volatile and creative world of the Internet is giving a whole new impetus to informal learning.\nAccording to David Crystal our era is the dawn of ‘a genuinely multilingual internet age’ where there is a huge gap\n‘between the political agenda, the technological possibilities, and the educational realities’. He points out how the\nInternet may be providing a context for new concepts of citizenship and social identity.\nDavid Crystal on the Netizens ‘It is not possible to tell, simply by looking at someone’s Internet name, what\ntheir nationality, age, or gender is, or even whether they are native-speakers or non-native-speakers of the\nlanguage they are using. User profile information is sometimes provided, as on Facebook or LinkedIn, but there\nis no guarantee that it is truthful. As the Peter Steiner cartoon caption said (The New Yorker, 5 July 1993),\nshowing one dog in front of a computer talking to another dog nearby: ‘On the Internet, nobody knows you’re a\ndog’. New communities have become established, via the domain name system, and only some of these relate\nto national identities. A website ending in .org, .net, or whatever could be located anywhere. The participants\nin a website forum, likewise, could be from any part of the world. Many of those who are frequent users of\nthe Internet say that they think of themselves as members of an online community first and of their national\ncommunity second. They call themselves Netizens – citizens of the Internet.’ (King et al. 2010: 38)\nThe possibilities and power of this economically mediated communication have increased dramatically in the past two\ndecades, and as is often the case the worlds of education and policy making have been slow to adapt. Much language\neducation is still based on an essentially 19th-century model of the gradual acquisition of one new language through\ncareful study over a number of years with the aim – for some – of reaching near native proficiency. Meanwhile the\nreality is that people of all ages, and especially the mobile young, are managing to communicate across cultures and\nlanguages because they want to and need to, making use of prior knowledge, language acquired on line or through the\n28 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nmedia and electronic translation tools. The realities of the 21st century therefore suggest the need for a much more\ncomplex yet more coherent policy on languages in education, one in which English will play a major but not exclusive\nrole. It will involve links between school and community and the world of employment as well as learning out of school\nin multilingual urban settings, in universities’ language centres and by making use of the new technologies.\nPlurilingual education for the 21st century\nThe traditional goals of language education policy have concentrated in particular on what is called ‘acquisition’\nplanning. In other words societies – governments, local administrations, schools – have been concerned with the\nlanguages to be offered and the degree to which they should be learned.\nLanguage policy and planning ‘Most classifications distinguish three types of LPP according to whether a policy\nhas been designed to have an effect on the learning of languages (acquisition planning), an effect on how\ncitizens speak or write their language(s) (corpus planning), or an effect on the uses of language(s) in different\nadministrative or social domains (status planning). In addition to these three areas, some writers have added\nattempts to influence the social esteem of languages (prestige planning; … as well as attempts to shape social\nideas and discourses about language(s) (discourse planning).’ (Skrandies in King and Carson 2016: 119)\nThis traditional language policy has quite explicit political and economic objectives, for example in the domains\nof trade, diplomacy and employment. More recently language policy has also been associated with ideas of\nmodernisation and is expressed in terms of democratic values such as human equality, the rule of law, human\nrights, equality of access to education. Whatever the underpinning rationale, however, such goals, at least as far as\neducation is concerned, have been based on a concept of individuals’ acquisition over time of one or perhaps two other\nlanguages, usually classified as ‘foreign’. It would not be an exaggeration to say that this has in many ways been the\ndriving force and the core of explicit and implicit language policy.\nIncreasingly, however, we may now conceive of language and communication in another – and much more holistic\n– way. We may be moving away from an additive and fairly inflexible view of competence = L1+L2+L3, towards the\nidea of setting goals for acquiring competence in particular languages, and to different degrees. Through descriptive\ninstruments such as the Common European Framework of Reference (CEFR) ways are being found to measure language\ncompetence that can put all languages on an equal footing and which anticipates their use in a range of appropriate\ndomains. This more neutral way of looking at languages opens the way to creating a range of plurilingual repertoires\nas the possible outcomes of language policy. Significantly not all elements of language have in this case to be learned\nin school, but may include what learners bring with them into the classroom. This effectively narrows the distance\nbetween languages and allows the accommodation in one room even of languages that might previously have been in\ncompetition as international languages. It can reinforce the important function of English as a lingua franca, without\nundermining other languages or the learning and use of those languages.\nIt is only one further, but significant, step to allow us to see language skills as part of learners’ basic\/key competences\n– already an aspiration for English in much of the world – and as part of the concept of literacy, so including mother\ntongue learning and use within the language paradigm – a 21st-century realisation of Bullock’s ‘language across the\ncurriculum’.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 29 Section IV: Trends and issues in multilingual education\nEU Multilingualism Policy ‘The European Union supports multilingualism as part of the cultural heritage of\nits citizens and nations, and has developed a number of policies supporting multilingualism, based on shared\nbeliefs about the benefits of a multilingual and linguistically diverse society. The EU’s multilingualism policy\nhas 3 strands:\n– working to protect Europe’s rich linguistic diversity\n– promoting language learning and multilingualism\n– importance of languages for trade and competitiveness.\n‘The citizens of the EU speak over 60 regional or minority languages, in total spoken by some 40 million people.\nThey include Basque, Catalan, Frisian, Saami, Welsh and Yiddish. It is the job of the national governments\nto decide on the legal status and use of these languages, but the EU aims to encourage multilingualism and\nlinguistic diversity as much as possible.\n‘It is this diversity that makes the European Union what it is: not a “melting pot” in which differences are\nrendered down, but a common home in which diversity is celebrated, and where our many mother tongues are\na source of wealth and a bridge to greater solidarity and mutual understanding. Language is the most direct\nexpression of culture; it is what makes us human and what gives each of us a sense of identity.’ (European\nCommission 2005)\nEU Language Policy ‘One of the EU’s multilingualism goals is for every European to be able to speak 2 languages\nin addition to their mother tongue. The EU’s language policy can be summarised as:\n‘“The aim of EU language policy is to promote the teaching and learning of foreign languages in the EU and to\ncreate an environment that is friendly towards all Member State languages. Foreign language competence is\nregarded as one of the basic skills that all EU citizens need to acquire in order to improve their educational and\nemployment opportunities within the European learning society, in particular by making use of the right to\nfreedom of movement of persons.”\n‘Within the framework of education and vocational training policy, therefore, the EU’s objective is for every\ncitizen to master two languages in addition to his or her mother tongue. In order to achieve this objective,\nchildren are to be taught two foreign languages at school from an early age.’ (European Parliament 2016)\nBroadening the concept of language policy\nSuch change already indicates that in actual practice a broader concept of language policy is being created than the\ncurrent models contained in official policy documentation. Policies in various countries (such as France and the UK)\nhave been linked, for example, to wider issues of cohesion and cognitive development. Language policy can thus be\nviewed not only as a means of improving competence in one or two languages but as an important way of solving non-\nlinguistic aims or problems associated with other political, social, economic and cultural challenges. These are mostly\nrelated to the challenges of social cohesion, the integration of migrants, citizenship issues and governance.\nClash of Civilisations over an elevator in Piazza Vittorio ‘But then who is Italian? Only someone who is born in\nItaly, has an Italian passport and identity card, has an Italian name and loves in Italy. As you see the question\nis very complicated … you need a lifetime to understand its meaning and only then will your heart open to the\nworld and tears warm your cold cheeks.’ (Amara Lakhous 2008: 14f.)\nThere is also a major issue relating to language as a marker of identity with both positive and dynamic aspects in the\nincreasing language diversity and openness of many individuals as well as some sense of confusion and loss on the part\nof others.\n30 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section IV: Trends and issues in multilingual education\nIf an education system is to adapt to the realities and possibilities of our diverse and changing world and to offer answers\nto these feelings of confusion, then the role that language and communication plays will be a crucial one. This was well\nexpressed at a Conference in December 2009 by Sir Keith Ajegbo, a head teacher in a London comprehensive school (and\nnot a language teacher), reflecting on the role that a school’s languages policy can play in developing cohesion:\n‘We mean working towards a society in which there is a common vision and sense of belonging by all communities;\na society in which the diversity of people’s backgrounds and circumstances is appreciated and valued; a society in\nwhich similar life opportunities are available to all; and a society in which strong and positive relationships exist\nand continue to be developed in the workplace, in schools and in the wider community.‘\nWhat do such aspirations mean concretely?\nTo move from a vision to action will require an orientation and a strategy. From what we have seen, this is likely to\ninvolve three broad themes, adapted to concrete conditions in different countries and societies:\nA new model for language\nWe are moving towards a new kind of paradigm for languages. This is based on a plurilingual and asymmetric model\nwhere not all language competence needs to be the same, and where experience and learning out of school, whether in\nthe street or on the Internet, will also contribute to the language profile of the individual. Intercultural understanding\nwill also have a significant role. In this paradigm English as the major vehicular language of communication has a key\nrole to play.\nAn integrated language policy for schools\nLanguage teaching and learning should no longer be compartmentalised into separate streams for language of\nschooling, ‘foreign’ languages and ‘immigrant’ languages. They are all part of a common core and require a collective\nunderstanding on the part of teachers. This begins with an integrated language policy, something which is already\nbeing developed in some jurisdictions (Catalonia) and will need to be more widespread.\nA review of teacher education\nIf ‘all teachers are language teachers’, it remains true that many are not trained to be so. Some understanding of the\nstages of language learning – for example the transference of conversational to academic language – needs to be part\nof all teachers’ training and education.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 31 Section V: Recommendations for national systemic change\nSection V: Recommendations for national systemic change\nIf those responsible for educational policy are to help develop a language policy for the 21st century, there are probably\ntwo broad areas which need to be considered: the overall societal context, which of course is wider in scope than\neducation; and the specific direction of educational provision and resource allocation. It should be understood that\nthese suggestions are put forward not as a blueprint, but as a possible framework which could be adapted to specific\ncircumstances and traditions.\nSocietal change to support multilingualism\nLanguage is not only an issue for education and educators. This truth was understood by such major writers and educators\nas Comenius in the 16th century and more recently by Jean Piaget , the Swiss psychologist of the 20th century.\nComenius and Piaget on language, education and society ‘A society’s fate in the end depends on the quality of\nthe schooling its children get in language.’ (Comenius 1657)\n‘Education is … an integral part of the formative process to which all beings are subject and is only one aspect\nof that vast development.… It is therefore not limited to the action of school and family but is part and parcel\nof general social life. Human society is an educational society.’ (Piaget 1993)\nSo what are the areas of societal development which may help to promote multilingual societies, and to improve\ninclusivity and social harmony, and therefore long-term prosperity?\nWe have suggested that the multilingual city is an important indicator of how societies will develop in this century – ‘a\nsignpost to the future and to the creation of new realities’. There is nothing new about the vitality of the city. Cultural\ndiversity has been a characteristic of the city since its origins, even in ancient societies. This mobility and perpetual\nmovement of people (and so of ideas and languages and ways of thinking) has underpinned the creativity and growth\nof the great cities of the past. What is new in the 21st century is that this process is becoming more widespread and\ngeneralised and now affects cities worldwide, from New York to Johannesburg to Bangalore and Melbourne.\nHow then does the city nurture such diversity and help it to thrive? In part this is something which grows from below as\nnew communities put down roots and then open shops and create businesses which serve the wider city community as\nwell. It develops through cultural exchanges – Christmas, Chinese New Year celebrations, Diwali and Eid, for example, are\nnow celebrated throughout the world, as are the football teams of Europe and the fairy tales of Hans Christian Andersen.\nMusic, theatre and food become the shared experiences of city communities. And people also change in terms of their\npersonal lives – not only in in the food that they eat and the music they enjoy, but in the friends that they make and the\nfamilies that they create. Such sharing is characteristic of thriving multilingual communities.\nIn our uncertain world there are also threats and fears and uncertainties – people’s understandable concerns over rapid\nchange and the pressures of economic crises and social conflicts.\n32 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section V: Recommendations for national systemic change\nThis is why public authorities could help support the positive gains from diversity and multilingualism, allowing\nthe inevitable growth from below to prosper. Our research suggests that there are three areas which policy makers\nshould consider:\n• Validation: Positive messages about the benefits of diversity and seeing multilingualism as a norm in society, not\na threat.\n• Practical encouragement: Providing resource and opportunities for all communities within a city to develop –\nfor example culturally and educationally and in the economic sphere – thus promoting good relations rather than\nseparation.\n• Specific planning: This would include the provision of translation and interpreting services and educational\nopportunities for all citizens, particularly in relation to language.\nMultilingualism in Hamburg ‘Multilingualism is presented as an asset of the Free and Hanseatic City of\nHamburg … visitors are welcomed in many languages at the airport or on the city’s official “Welcome” portal;\nmultilingual competences are sought by employers in the public and private sectors; in public media we\nfind many languages from all over the world. We can report on a kind of affirmative action concerning the\nemployment of young people with a migrant background in Hamburg’s administration.\n‘A number of migrants’ heritage languages are taught in the general school system, and many semi-private\nor private initiatives are also engaged in the fostering of these languages. It may be taken as an indicator of\ngrowing acceptance of language diversity that migrants’ heritage languages are also learned by members of the\nmajority community.’ (LUCIDE 2015: 29)\nSuch a framework of support could create the conditions for growth and social cohesion and a vision of the future such\nas that put forward in Hamburg, rather than more pessimistic views of change.\nEducational change\nIn the educational sphere, the central aims are likely to be those of improving multilingual competence and developing\nintercultural understanding as the key contributions of language learning. We have suggested that this would involve\nconsideration of change in three broad areas: the model, the policy and teacher education. So what specific measures\nmight be considered?\nA new model\nWe need to be thinking about moving towards a more flexible model of ‘education for plurilingualism’. This implies\nthe creation of programmes which may differentiate language goals for a range of languages, rather than the ‘one\nsize fits all’ approach born in the 19th century. Some languages – probably major languages of communication and\nnotably English – will be learned to the highest level; others may already be ‘known’ and so be supported in school;\nnew languages may be learned to a satisfactory level for basic communication, whether spoken or with written text,\nwhile yet others may be brought into the classroom primarily to help language awareness and the understanding of\ndifferent cultures. The Common European Framework of Reference (CEFR) is a powerful tool to support such a process.\nWe should also be learning from good practice, such as the Canadian ‘literacy engagement programme’ or Australian\nsuggestions on generating bilingual human capital.\nIt will also mean looking beyond the classroom for the sources of language learning. We know that much language\nlearning takes place informally – listening to music, playing games and watching films, using the Internet and\ncommunicating electronically, and increasingly in our multilingual cities in the diverse street. How will educators\nrespond to this reality, treating it not as diversion but as major source of knowledge and incorporating what learners\nbring with them from their outside world as well as supporting them, particularly in making good use of the Internet?\nWe should also understand better the key conditions for successful language learning: exposure to the target\nlanguage (which can of course come from beyond the school walls) preferably from an early age; learning for a\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 33 Section V: Recommendations for national systemic change\npurpose using real contexts and content, including CLIL. Above all, educators need to consider how to provide a more\nproductive intensive experience of language learning, making use of resources beyond the school and harnessing\nlearners’ familiarity with the internet and electronic communication in general.\nIn many countries across the world, English is the main language being learned and used in schools. This puts it in a\npotentially privileged position and one which can be used to support rather than threaten our new model. In particular,\nthe use of English as the means of instruction (EMI) which has grown rapidly in Europe and Asia should be used to help\nstudents become multilingual in higher order contexts.\nAn integrated language policy\n‘Language across the curriculum’ and ‘languages for all’ are not new ideas. They are, however, less obvious in practice\nthan in theory. Although attempts have been made and are continuing to be made to turn such ideas into concrete\nsyllabuses, reality suggests that much remains to be done. In particular there have been few examples which integrate\nthe languages of schooling with ‘foreign’ language learning.\nThe elements of such a policy would involve consideration of the following:\n• The languages of schooling: which might be more than one language in some circumstances.\n• Mother tongue and the acquisition of literacy: For many this would be in the same language as the language of\nschooling, but increasingly in our diverse societies there would be other mother tongues and literacies. In yet\nother contexts this would also include local or regional languages.\n• Code-switching: This is a widespread phenomenon, in particular in bilingual and multilingual contexts, from\ncountries as different as Malta and India. Language educators need to take a view on this, and if necessary to\nincorporate a level of code-switching into their policy. It can be a positive thing, but is often ignored by teachers\nand policymakers and not explicitly taught as a language strategy.\n• The introduction of another language: When should this take place? Much evidence and public opinion suggests\nthat the earliest possible learning of foreign languages is desirable – but when is this ‘earliest possible’? We also\nknow that success in a new language depends on some level of security in the mother tongue. Decisions also\nneed to be taken on the approach at the initial stages of language learning – when for example is it appropriate to\noffer more formal modes of learning? The question of ‘which language’ is decided for many countries, as English\npredominates, but there is no educational reason why the first foreign language could not be another major\nlanguage of communication such as Spanish or Chinese, assuming that a basic level of English will be learned\nbeyond school. If not, when should such a second language be learned?\n• Other languages, including less widely used home or immigrant languages: How will speakers of these languages\nbe taught equitably so that they have access to the school curriculum? How will speakers of the national\nlanguage learn to appreciate and value this diversity? And more broadly how does society make use of the gift\n(donation) of immigrant languages and link it to the academic rigour which could be offered by universities?\n• Common approaches: How will this integration take place in practice, if not through dialogue between language\nteachers of all kinds and the development of common approaches and links between the different learning\nexperiences being offered to learners?\nTeacher education\nIn the final analysis teachers are the most important variable in the educational system – the main determinant of\nsuccess or otherwise.\n34 The Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 Section V: Recommendations for national systemic change\nThe key role of teachers ‘Whereas students’ literacy skills, general academic achievements, attitudes,\nbehaviours and experiences of schooling are influenced by their background and intake characteristics, the\nmagnitude of these effects pale into insignificance compared with class\/teacher effects. That is, the quality\nof teaching and learning provision are by far the most salient influences on students’ cognitive, affective, and\nbehavioural outcomes of schooling – regardless of their gender or backgrounds. Indeed, findings from the\nrelated local and international evidence-based research indicate that ‘what matters most’ is quality teachers\nand teaching, supported by strategic teacher professional development!’ (Ken Rowe 2003)\nWe are talking about a new paradigm, linking a range of existing strands of education into something more holistic\nwhere ‘all teachers will be language teachers’. Furthermore, the expansion of approaches such as EMI and CLIL require\nnew skills for many teachers, and not only a relatively small group of language specialists. Teachers will need support\nboth in initial education and through continuing professional development, if such aspirations as those outlined here\nare to become a reality.\nThe core function of the teacher in this new paradigm is no less than one of preparing young people for the\ncommunication age.\nThe Impact of Multilingualism on Global Education and Language Learning | © UCLES 2018 35 "}