{"text":"Language Acquisition\n• Language is extremely complex, yet children\nalready know most of the grammar of their native\nlanguage(s) before they are five years old\n• Children acquire language without being taught\nthe rules of grammar by their parents\n– In part because parents don’t consciously know the\nmany of the rules of grammar ’ ’\nWhat s Learned, What s Not?\n• The innateness hypothesis asserts that\nchildren do not need to learn universal principles\nlike structure dependency because that is part of\nUG\n– They only have to learn the language-specific aspects\nof grammar\n• The innateness hypothesis provides an answer\nto Chomsky’s question:\n– What accounts for the ease, rapidity, and uniformity of\nlanguage acquisition in the face of impoverished\ndata? ’ ’\nWhat s Learned, What s Not?\n• An argument for the innateness hypothesis is\nthe observation that we end up knowing more\nabout language than we hear around us\n– This argument is known as the poverty of the\nstimulus\n– Children are exposed to slips of the tongue, false\nstarts, ungrammatical and incomplete sentences\n– Also, children learn aspects of language about which\nthey receive no information\n• Such as structure dependent rules\n• The data the children is exposed to is impoverished ’ ’\nWhat s Learned, What s Not?\n• For example, children somehow know to invert\nthe auxiliary of the main clause when forming a\nquestion like:\n• Is the boy who is sleeping __ dreaming of a new car?\nRather than\n• *Is the boy __ sleeping is dreaming of a new car?\n• To do this, the child must somehow understand\nstructure dependency and constituent structure,\nsomething that adults do not consciously know Stages in Language Acquisition\n• Children acquire language in similar stages\nacross the world\n• When children are acquiring language, they do\nnot speak a degenerate form of adult language\n– Rather, they speak a version of the language that\nconforms to the set of grammatical rules they have\ndeveloped at that stage of acquisition The Perception and Production of\nSpeech Sounds\n• Infants display an ability to discriminate\nand recognize speech sounds\n– They will even respond to linguistic contrasts when\nthose contrasts are not present in the language(s)\nspoken around them\n– They can perceive differences in voicing, place of\narticulation, manner of articulation\n– But they do not react to nonlinguistic aspects of\nspeech (loudness, gender-based pitch differences,\netc.) The Perception and Production of\nSpeech Sounds\n• Infants appear to be born with the ability to\nperceive and focus on the sounds that are\nimportant for language, so they can learn\nany human language\n– But by 6 months babies begin to lose to ability\nto discriminate between sounds that are not\nphonemic in the language(s) they are\nacquiring Babbling\n• Babbling begins at about 6 months and is considered the\nearliest stage of language acquisition\n– Babies may babble phonemes that do not occur in the\nlanguage(s) they are acquiring\n– 95% of babble is composed of the 12 most common consonants\naround the world\n• Early babbles mostly consist of CV sequences but become more\nvaried later on\n• By 1 year babbles are composed only of the phonemes used in the\nlanguage(s) they hear\n– Deaf babies babble with their hands like hearing babies babble\nusing sounds First Words\n• After the age of one, children figure out that\nsounds are related to meanings and start to\nproduce their first words\n• Usually children go through a holophrastic\nstage, where their one-word utterances may\nconvey more meaning\n– up used to indicate something in the sky or to mean\n“pick me up”\n• This suggests that children know more language\nthan they can express Segmenting the Speech Stream\n• A major obstacle that babies must overcome is to be\nable to identify where word boundaries are\n• English-speaking children may be able to use stress as a\ncue for word boundaries (prosodic bootstrapping)\n– Every content word in English has stress\n• If a word has two syllables, the stress either falls on the first syllable\n(trochaic stress) or the second syllable (iambic stress), but the\nvast majority of English words have trochaic stress\n– Experiments have shown that children do use stress as a cue for\nword boundaries since most English words have stress on the\nfirst syllable Segmenting the Speech Stream\n• But how do children know the stress pattern of the\nlanguage they are acquiring?\n– Babies may use statistical frequency of syllable sequences to\ndetermine word boundaries\n• In one experiment, babies were able to recognize the nonsense\nwords pabiku, tutibu, golabu, and babupu out of strings of nonsense\nsyllables because those strings of syllables in the ‘words’ occurred\nmore frequently than the random strings of syllables\n• Children may use statistical strategies to determine a few words,\nand from there may be able to determine the rhythmic, allophonic,\nand phonotactic properties of the language and then can determine\neven more words from this knowledge The Acquisition of Phonology\n• Children tend to acquire the sounds common to all\nlanguages first, followed by the less common sounds of\ntheir own language\n• Vowels tend to be acquired first, and consonants are\nordered:\n– Manner of articulation: nasals, glides, stops, liquids, fricatives,\naffricates\n– Place of articulation: labials, velars, alveolars, palatals\n• Uncommon but high frequency sounds may be acquired\nearlier than expected The Acquisition of Phonology\n• Children can perceive more sound contrasts than they\ncan make in early stages\n– Thus they know more about phonology than we can tell by\nlistening to them speak\n• When they cannot yet produce a sound, they may\nsubstitute an easier sound\n– These substitutions are rule-governed\n– Children tend to reduce consonant clusters ([pun] for spoon),\nreduplicate syllables ([wawa] for water), and drop final\nconsonants ([ke] for cake) The Acquisition of Word Meaning\n• When children learn the meanings of words they must learn the\nrelevant features of the class of things that are referred to by that\nword\n– They must learn that dog refers to pugs and Great Danes, but not cats\n• When learning words, children often overextend a word’s meaning\n– For example, using the word dog to refer to any furry, four-legged\nanimal (overextensions tend to be based on shape, size, or texture, but\nnever color)\n• They may also underextend a word’s meaning\n– For example, using the word dog to refer only to the family pet, as if dog\nwere a proper noun The Acquisition of Word Meaning\n• The whole object principle: when a child learns a\nnew word, (s)he is likely to interpret the word to\nrefer to a whole object rather than one of its\nparts\n– This principle and others may help the child learn\n5,000 words per year\n• It has also been put forth that children can learn\nthe meaning of verbs based on the syntactic\nenvironments of the verbs\n– This is known as syntactic bootstrapping The Acquisition of Morphology\n• The acquisition of morphology clearly demonstrates the\nrule-governed nature of language acquisition\n– Children typically learn a morphological rule and then\novergeneralize\n– Children go through three stages in the acquisition of an irregular\nform:\n• In phase 1 they use the standard irregular past tense forms\nbecause they have learned these irregulars as separate lexical\nitems (broke, brought)\n• In phase 2 the child has learned the rule for past tense and\ntherefore attaches the regular past tense morpheme to the irregular\nverb (breaked, bringed)\n• In phase 3 the child realizes that there are exceptions to the\nmorphological rule and bring the standard irregular forms back into\ntheir vocabulary (broke, brought) The Acquisition of Morphology\n• The “wug test” demonstrates that children apply the\ncorrect plural allomorph to nouns they have never heard\nbefore\n– Which shows they have an understanding of natural classes of\nphonemes and are not just imitating words they have heard\nbefore\n• Children acquiring languages other than English learn\nsubject-verb agreement very early\n• Children also demonstrate their knowledge of\nderivational rules and can create new words\n– E.g. broomed (“swept”) The Acquisition of Syntax\n• At about two years of age, children start to put\nwords together to form two-word utterances\n– The intonation contour extends over the two words as\na unit, and the two-word utterances can convey a\nrange of meanings:\n• mommy sock = subject + object or possessive\n• Chronological age is not a good measure of\nlinguistic development due to individual\ndifferences, so instead linguists use the child’s\nmean length of utterance (MLU) to measure\ndevelopment The Acquisition of Syntax\n• The telegraphic stage describes a phase when\nchildren tend to omit function morphemes such\nas articles, subject pronouns, auxiliaries, and\nverbal inflection\n– For example: He play little tune or Andrew want that\n• However, while function morphemes are absent,\nthese sentences have hierarchical constituent\nstructure like adult sentences\n– Telegraphic utterances are not just words strung\ntogether and reveal the child’s knowledge of syntactic\nrules The Acquisition of Syntax The Acquisition of Syntax\n• A child must know the syntactic categories of words\nin order to apply syntactic rules\n– Semantic bootstrapping: the notion that children first use\nthe meaning of a word to figure out its syntactic category\n– Word frames may also help children determine the\nsyntactic categories for words\n• Some frames such as you__it and the___one occur frequently\nenough that kids may be able to identify which words can occur\nin each frame (verbs for the former and adjectives for the latter) The Acquisition of Syntax\n• Between 2;6 and 3;6 a language explosion occurs and\nchildren undergo rapid development\n– By the age of 3, most children consistently use function\nmorphemes and can produce complex syntactic structures:\n• He was stuck and I got him out\n• It’s too early for us to eat\n• After 3;6 children can produce wh-questions, and relative\npronouns\n• Sometime after 4;0 children have acquired most of the\nadult syntactic competence Acquisi’on of movement What do you think what is in that\nbox The Acquisition of Pragmatics\n• Deixis:\n– Children often have problems with the shifting\nreference of pronouns\n• Children may refer to themselves as ‘you’\n– Problems with the context-dependent nature\nof deictic words\n• Children often assume the hearer knows who she\nis talking about The Development of Auxiliaries:\nA Case Study\n• In the telegraphic stage children often omit\nauxiliaries from their speech but can form\nquestions (with rising intonation) and negative\nsentences\n– I ride train? I not like this book\n• As children acquire auxiliaries in questions and\nnegative sentences, they generally use them\ncorrectly\n– The child always places the negation in the correct\nposition in relation to the auxiliary Setting Parameters\n• Children acquire the parameters of UG very\nearly\n– The child listens to the language around her and then\nchooses between the options provided to her by UG\n• Does this language have the head or the complement come\nfirst?\n• Are VPs in this language ordered VO or OV?\n• Does this language allow verb movement?\n– Parameters greatly reduce the difficulty of acquiring a\nlanguage because, rather than starting from scratch,\na child only needs to choose between a small set of\nlinguistic options based on what she hears Parameters\n• Xʹ′ theory says structures are all built hierarchically\nlike this—but different languages can choose\ndifferent orders.\nXP\nSpecifier Xʹ′\nX Complement\nHead The Acquisition of Signed Languages\n• Deaf babies acquire sign language in the same\nway that hearing babies acquire spoken\nlanguage:\n– babbling, holophrastic stage, telegraphic stage\n• When deaf babies are not exposed to sign\nlanguage, they will create their own signs,\ncomplete with systematic rules\n– This demonstrates the drive humans have to\ncommunicate, and also the innate basis for language\nsince these children create a rudimentary language\nwithout any input The Role of Imitation, Reinforcement,\nand Analogy\n• Children do imitate the speech heard around them to a\ncertain extent, but language acquisition goes beyond\nimitation\n– Children produce utterances that they never hear from adults\naround them, such as holded or tooths\n– Children cannot imitate adults fully while acquiring grammar\n• Adult: Where can I put them?\n• Child: Where I can put them?\n– Children who develop the ability to speak later in their childhood\ncan understand the language spoken around them even if they\ncannot imitate it The Role of Imitation, Reinforcement,\nand Analogy\n• Another theory posits that children learn through\npositive and negative reinforcement\n– But, parents rarely correct their children’s speech,\nand when they do they correct based on\npronunciation and factual accuracy rather than\ngrammatical accuracy\n– Parents do sometimes recast children’s utterances,\nbut not consistently, and they also tend to recast\ngrammatical sentences to reinforce correct content Children resist correc’on\nCazden (1972) (observa’on aIributed to Jean Berko Gleason)\n– My teacher holded the baby rabbits and we paIed them.\n– Did you say your teacher held the baby rabbits?\n– Yes.\n– What did you say she did?\n– She holded the baby rabbits and we paIed them.\n– Did you say she held them ’ghtly?\n– No, she holded them loosely. The Role of Imitation, Reinforcement,\nand Analogy\n• Another theory asserts that children hear a sentence and\nthen use it as a model to form other sentences by analogy\n– But while analogy may work in some situations, but certainly not in\nall situations:\n• I painted a red barn.\n• I painted a barn red.\n• I saw a red barn.\n• *I saw a barn red.\n– Children never make mistakes of this kind based on analogy\nwhich shows that they understand structure dependency at a very\nyoung age The Role of Structured Input\n• It has also been suggested that children are able\nto learn language because adults speak to them\nin a simplified version of language known as\nmotherese, child-directed speech (CDS), or\nbaby talk\n– But, motherese is not syntactically simple and does\nnot drop verb inflections or omit function words\n– In many cultures adults do not engage in motherese,\nyet children in those cultures acquire language in the\nsame way as children who are exposed to motherese Childhood Bilingualism\n• Bilingual language acquisition, or\nsimultaneous bilingualism refers to the\nacquisition of two languages\nsimultaneously from infancy\n– About half the people in the world are bilingual\nor multilingual\n– In many parts of the world, bilingualism (or\nmultilingualism) is the norm Theories of Bilingual Development\n• Unitary system hypothesis: the idea that the\nchild initially constructs only one lexicon and one\ngrammar\n• Evidence for: language mixing similar to codeswitching;\nlexical items existing in only one language\n• Evidence against: there is a lot of overlap in the lexicon for\neach language, and children may have gaps because each\nlanguage is used in different contexts and they can only learn\nso many words each day Theories of Bilingual Development\n• Separate systems hypothesis: the idea that\nthe child builds a distinct lexicon and grammar\nfor each language\n– Evidence for:\n• where the two languages diverge grammatically, the child will\nacquire two different sets of rules\n• bilingual children select which language to use based on the\ncontext\n• children bilingual in sign language and a spoken language\nmay say a word in one language and sign it in the other\nsimultaneously The Role of Input & Cognitive Effects of\nBilingualism\n• It’s unclear how much input in each language a\nchild needs to become bilingual\n– Une personne-une langue (one person, one\nlanguage) is the strategy where one parent speaks\nonly language A to the child and the other speaks only\nlanguage B\n• Bilingual children tend to have better\nmetalinguistic awareness than monolingual\nspeakers, meaning they have more conscious\nknowledge about language Second Language Acquisition\n• Most adult language learners never become fully\nproficient in their second language\n– They make errors unlike children’s errors and these\nerrors may become fossilized\n• Fundamental difference hypothesis: learning\na second language is a different process than\nlearning a first language\n– Different principles are drawn upon in L2 learning\nthan L1 acquisition\n– However, L2 learners do demonstrate rule-governed\ninterlanguage grammars Second Language Acquisition\n• One obvious difference between L1 and L2\nacquisition is that in L2 acquisition a speaker\nalready knows a language\n– Learners often transfer phonological, syntactic, and\nmorphological rules from their first language to their\nsecond language\n• French speakers learning English may substitute [z] for []\n• Spanish speakers learning English may insert a schwa to\nbreak up word-initial consonant clusters Second Language Acquisition\n• But, not everything transfers from the L1 to the\nL2, and many errors made by learners are not\nfound in their L1\n• Speakers with different L1s go through similar\nstages when learning their L2s\n– Which points to some possibly universal\ndevelopmental principles like those in L1 acquisition Heritage Language Learners\n• Heritage language learners constitute a\nunique type of adult language learner\n– Someone who was raised with a strong\ncultural connection to a language and who\nthen chooses to study that language more\nformally\n• May have no prior linguistic knowledge of the\nlanguage\n• May be bilingual Is There a Critical Period for L2\nAcquisition?\n• Most researchers would not claim that it is\nimpossible to acquire a new language after a\ncertain age\n– But it does get harder as one gets older\n– There may be “sensitive” (rather than critical) periods\nfor acquiring certain aspects of an L2\n• The sensitive period for phonology is the smallest—it is very\ndifficult to acquire an L2 without an accent after the childhood\nyears; other aspects of language have a larger window "}