{"text":"CHAPTER ONE: LANGUAGE AND LINGUISTICS\nOutline of Contents\n1.1. Definition of Language\n1.1.1. Origin of Language\n1.1.2. Characteristics of Language\n1.1.3. Role of Language\n1.1.4. Ethiopian Language Families\n1.1.4.1. Afro-Asiatic\n1.1.4.2. Nilo-Saharan\n1.2. Linguistics\n1.2.1. Language Use\n1.2.1.1. Language Variation\na. Dialect\nb. Accent\n1.2.1.2. Language change\na. Code Mixing\nb. Code Switching\nc. Code Shifting\n1.3. International Phonetic Alphabet\nIntroduction\nThis chapter provides a brief introduction to language and linguistics. The origin of language\nand universal characteristics that are found in all languages are discussed. The roles that\nlanguage plays in a society are also presented. Students will learn about how languages vary\nand change across peoples and regions, resulting in dialects and usage differences. The\nEthiopian language families are described. Finally, an introduction to the International Phonetic\nAlphabet allows students to understand how language sounds are represented internationally,\nacross all writing systems.\n6 Learning Outcomes\nAt the end of this chapter, student teachers will be able to:\n• Define language.\n• Discuss the origin of language.\n• Describe the various characteristics of language.\n• Discuss the role of language.\n• Identify the Ethiopian language families.\n• Define linguistics.\n• Explain the use of language in different social contexts.\n• Discuss how languages vary and change.\n• Explain how the International Phonetic Alphabet is used.\nTeaching and Learning Techniques\n• Interactive lecture\n• Independent study\n• Group discussion\nAssessment Techniques\n• Oral questions and answers\n• Individual, pair, and group work\n• Peer reflection and learning\n• Class work and homework\nInstructional Materials\n• The map of Ethiopia\n• IPA Chart\n•\n1.1 Definition of Language\nLanguage is more than just a set of sounds or a set of words with meaning. Language is the\nprimary way in which people communicate, and this communication typically takes place within\na social context. People use language to interact socially and emotionally, and to express\nfriendliness, love, anger, and pain. Language enables ideas to be communicated and tasks to be\n7 accomplished (tell a story, provide information, complain, or ask for help). Effective\ncommunication requires more than just an understanding of the words of the language being\nused. Effective communication requires an understanding of how the words of the language are\nbeing used by those speaking it.\nOral language develops naturally in children through their interaction with other people.\nChildren’s oral language development begins in the years prior to school, and usually without\ndirect instruction (Brown, 2008). This development continues throughout childhood. When\nchildren use language to learn to read and write, direct instruction is needed, including\ninstruction about how the language is organized.\nLanguage is the foundation of reading and literacy instruction, and it is therefore important for\nteachers to understand how language works. When teachers and students with different mother\ntongues come together for learning experiences, it is the teachers’ responsibility to foster\nlinguistic understanding and acceptance within the classroom. It is also important for the\nteacher to know how to instruct students with diverse language skills.\nActivity 1: Pair Work\nDiscuss the above definition of language with your partner and reflect your understanding to the\nclass.\n1.1.1 Origin of Language\nMany theories of language origin exist (Yule, 2006). Two of the more popular hypotheses (beliefs)\nconcerning the origin of language are the Divine Creation Hypothesis and the Natural Evolution\nHypothesis. The Divine Creation Hypothesis states that language is the gift of gods and humans were\ncreated with an innate capacity to use language. According to this hypothesis, language and society are\ninseparable. Wherever humans exist, language exists.\nThe second hypothesis is the Natural Evolution Hypothesis. This hypothesis states that humans evolved\nto have more intelligence, which made language invention and learning possible. The simple\nvocalizations and gestures gave way to a system of language, perhaps within one or two generation(s).\nAccording to the Natural Evolution Hypothesis, as soon as humans developed the capacity for creative\nlanguage, the next step would have been the development of a specific system of forms (words) with\nmeanings.\n8 Activity 2: Group Reflection\nAnswer the following questions based on the above explanations. Share your ideas within your group,\nand then reflect your group ideas to the class.\n1. What are the basic ideas behind the Divine Creation Hypothesis and the Natural\nEvolution Hypothesis on the origin of language?\n2. Compare and contrast the above hypotheses and reflect your position towards them.\nThen, explain why you support either of these hypotheses.\n1.1.2 Characteristics of Language\nUniversal properties of language are categories or rules which all human languages have in\ncommon. Language is a systematic, human trait, and everyone using the language must\nunderstand the rules associated with the language. All languages contain the elements of\nphonetics, phonology, morphology, and syntax. These elements address different components\nof the language, particularly sounds and sound patterns, word structure, and sentence structure.\nAll languages also use word categories such as noun and verb (Parker & Riley, 2010). Not only\ndo languages use word categories, but they also have phrases and clauses to help clarify meaning\n(these will be discussed throughout the subsequent chapters of this module).\nAll languages have the characteristic of productivity (are able to add new words as needed), and\nvariation (according to the situation or purpose of use; Fasold & Connor-Litton, 2006). Language\nproductivity refers to the speakers’ ability to create new words and add modifiers to phrases,\ncreating long sentences that express specific ideas. As time moves on, new words are introduced\nto describe new technology or ideas. Every language operates in a speech community in which\nlanguage variation is evident among the speakers. Dialects are part of language variation and\nallow communities to develop distinct cultures associated with their specific dialect. Since\nlanguage is used for communication, it does not develop automatically without a culture and use.\nThese are passed on to the younger generations.\nOther specific characteristics of language include:\na) Language is a discrete symbolic system. This means that language is a system of\nspoken or written symbols (sounds and words) which people, who belong to a social\ngroup and participate in a culture, communicate. Language makes use of clearly\ndistinguishable and identifiable symbols (sounds and words). One can clearly\n9 distinguish between \/s\/, \/I\/ and \/t\/ in the word ‘sit’. When a speaker wishes to\ncommunicate, he or she must use the language system that is understood by the\nlistener (Mukherjee, 2016).\nb) Language is human. Language is a purely human method of communicating ideas,\nemotions, and desires by means of a system of voluntarily produced symbols (Sapir,\n1921).\nc) Language is a form of social behavior. ‘Language is the institution whereby humans\ncommunicate and interact with each other by means of habitually used oral-auditory\narbitrary symbols’ (Hall, 1968). Language must be acquired and learned, it does not\npass from parent to a child genetically. Learning of language is made possible in\nsociety. A human child learns to speak the language of the community or group in\nwhich he or she is placed.\nd) Language is arbitrary. “Language is a system of arbitrary vocal symbols by means\nof which a social group cooperates” (Bloch and Trager, 1972, as cited in Mukherjee,\n2006). This means that there is no natural connection between sounds and symbols,\nor between symbols and their referents; for example, the animal known as ‘dog’ in\nEnglish is also known as ‘Woshicho’ in Sidaamu Afoo; ‘Kanaa’ in Wolaytta;\n‘Wusha’ in Amharic; ‘Saree’ in Afaan Oromoo; ‘Wishichcho’ in Hadiyyisa; ‘Kelbi’\nin Tigrigna; and ‘Ey’ in Af-Soomaali. Thus, the relation between a word and its\nmeaning is quite arbitrary; it is a matter of how we communicate the concept.\ne) Language is dynamic. Language keeps changing at all the levels-sounds, words,\nword-meanings, and sentences. Language is changing, growing every day, and new\nwords continue to be added to it in the course of time. Each generation modifies\nand changes its languages to adapt to changing needs and demands of the people\nwho use it. Language is thus open-ended, modifiable, and extendable (Mukherjee,\n2016).\nActivity 3: Group Work\nThe instructor will divide the class into groups of 4-6, with each group comprised of females and\nmales as much as possible. Each group will be assigned two of the characteristics of language\nlisted above. In each group:\n1. Summarize the characteristics of language assigned to your group using your own words.\n2. Discuss how these two characteristics apply specifically to your mother tongue.\n10 3. Share your findings with the class.\n1.1.3 The Role of Language\nLanguage has many functions within society. Language can be descriptive, evaluative,\nemotive, evocative, persuasive, interrogative, directive, performative, and recreational.\n• Descriptive: When language is used to describe factual information or provide\ndescriptive information about a situation or object (e.g., She usually wears a beautiful,\nhand woven, Ethiopian scarf; or, the girl drove the car down the road,).\n• Evaluative: When language is used to make a value judgment. This type of language\nexpresses opinions (e.g., Drinking alcohol seriously affects health; or, the coffee\nceremony was nice,).\n• Emotive: When language is used to express emotion (e.g., I am disappointed by her\nabsence today; or, I strongly agree with you,).\n• Evocative: When language is used to evoke an emotional response in an audience (e.g.,\nLet’s stand and work together to eradicate illiteracy from our country; or, this is\nimportant for our country’s future,).\n• Persuasive: When language is used to persuade someone to accept an idea, agree with\na perspective, or act in a certain way (e.g., We should keep forests very carefully,\nbecause they are homes for wild animals,).\n• Interrogative: When language is used to elicit information. This type of language\nrequests information without necessarily using questions. (e.g., They will tell us why\nthey refused to accompany us; or, I am waiting for your answer).\n• Directive: When language is used to tell someone to do something (e.g., Take these\npills twice a day,).\n• Performative: When language is used to constitute an action (e.g., I sentence you to\n10 years in prison,).\n• Recreational: When language is used for fun or enjoyment, such as in the telling of a\njoke.\nLanguage allows people to form a connection with one another and with their community. It\nalso allows individuals to establish their identity.\n1.1.4 Ethiopian Language Families\nIn Africa alone there are more than 2000 distinct languages, and Ethiopia has over 80 languages\nand 200 dialects (SIL, 2016)! The languages of the world are grouped into different super-\nfamilies. These groupings are based on their ancestral relation, linguistic features, word order,\n11 tone and stress, morphological structure, etc. From the four major language super-families in\nAfrica (Niger-Congo, Afro-Asiatic, Nilo-Saharan, and Khoisan), the languages in Ethiopia\nbelong to the Afro-Asiatic and the Nilo-Saharan super-families. These families are built on\nshared linguistic features such as morphology, syntax, and semantic features. The Cushitic,\nOmotic, and Semitic languages are subgroups of the greater Afro-Asiatic super-family. The\nNilo-Saharan super-family is genetically distinct from Afro-Asiatic. Nilo-Saharan languages\nare spoken in the western part of Ethiopia along the border with Sudan, mainly in Gambella\nand Benishangul Gumuz regions (Hudson, 2003; Abebayehu & Endashaw, 2009).\n1.1.4.1. Afro-Asiatic\nA) CUSHITIC\nThe Cushitic languages are mostly spoken in central, southern and eastern Ethiopia (mainly in\nAfar, Oromia, Soomali, and SNNP regions). Cushitic languages spoken in Ethiopia include:\nAfaan Oromoo, Afar, Af-Soomali, Alabissa, Arbore, Awngi, Burji, Dhasenech, Gawada,\nGedeuffa, Gidole, Hadiyyisa, Kambatisa, Kamir, Kemant, Konso, Libido, Mossiya, Qabena,\nSaho, Sidaamu Afoo, Tambarisa, and Tsamay, etc.\nB) OMOTIC\nThe Omotic languages are predominantly spoken between the Lakes of Southern Rift Valley\nand the Omo River. The Omotic languages are also spoken in Benishangul Gumuz region. The\nOmotic languages spoken in Ethiopia are: Ari, Basket, Bench, Chara, Dime, Dizi, Gamo,\nGanjule, Gofa, Hamer, Kachama, Kafinoon, Kontta, Korete, Male, Mao, Mello, Mer, Mocha,\nNao, Oyda, She, Sheko, Shinasha, Wolaytta, Yemsa, Zayse, and Zergula, etc.\nC) SEMITIC\nThe Semitic languages are spoken in northern, central and eastern Ethiopia, mainly in Tigray,\nAmhara, Harar, and the northern part of the SNNP regions. The Semitic languages spoken in\nEthiopia are: Amharic, Argobba, Gurage varieties, Harari, Siltigna, and Tigrinya, etc.\n1.1.4.2. NILO-SAHARAN\nLanguages categorized under the Nilo-Saharan super-family are largely spoken in the western\npart of Ethiopia along the border with Sudan, mainly in Gambella and Benshangul Gumuz\nregions. There are also some languages of this family spoken in SNNPR, particularly in South\nOmo Zone. The Nilo-Saharan languages spoken in Ethiopia include: Anywak, Berta, Bodi,\n12 Fadashi, Gamili, Gebato, Gumuz, Koman, Kunama, Kwama, Mabaan, Me'en, Mesengo,\nMurssi, Nyangatom, Shita, and Suri, etc.\nActivity 4: Pair Work\nWorking with a partner, discuss the 2 language families and 3 sub-families spoken in Ethiopia.\nIdentify the language family of your mother tongue and identify other languages in the same\nfamily.\n1. Are these languages in the Afro-Asiatic or Nilo-Saharan super-family?\n2. What is the role of language in society?\n1.2 Linguistics\nLinguistics is the scientific study of language. As an academic discipline, the development of\nthis subject has been relatively recent and rapid. Linguistics studies sounds, words, phrases,\nand meanings. It has the following subfields: phonetics, phonology, morphology, syntax, and\nsemantics. Phonetics refers to the production and perception of speech sounds. Phonology\nrefers to the organization, distribution, and function of speech sounds. Morphology refers to\nthe structure of words and smaller meaning units. Semantics refers to the meaning of words,\nsentences or utterances. Syntax refers to the structure of phrases, clauses, and sentences.\n1.2.1 Language Use\nLinguistics is concerned with the study of language in interaction with other disciplines. There\nare many branches of linguistics. Sociolinguistics is one branch of linguistics which addresses\naspects of the relationship between language and society. This branch is important for helping\nteachers understand language variation and change, and will help them support diverse\nstudents’ literacy skills. Language is one of the most powerful emblems of social behaviour.\nWe use language to send social messages about who we are, where we come from, and who\nwe associate with. In social situations, it is common for individuals to be judged based on their\nlanguage, dialect, or the words they choose to use. Given the social role of language, it makes\nsense that at least one part of language study should concentrate on the role of language in\nsociety (Wardhaugh, 2006).\nSociolinguists research how languages are used by the people, and how languages change over\ntime. Languages are constantly changing, so teachers must maintain a positive, open linguistic\nattitude, particularly when their students are multilingual. Sociolinguistics has become an\n13 increasingly important and popular field of study, as cultures around the world begin to form\nrelations with each other. The relationship between language and society affects a wide range\nof experiences - from international meetings to individual relationships. The study of language\nin its social context tells us about how we organize our social relationships within a particular\ncommunity (Romaine, 1994).\nAnother concern with language and society is the effect of specific social situations on\nlanguage structure. People begin to create special words and ways of speaking when speakers\nfrom different language groups need a common language for communication, such as for\ntrading. For example, people coming from two different languages need to communicate in\norder to trade; therefore, they use words from both languages and create new words in order to\nunderstand one another. This new language is called a pidgin. A pidgin becomes a creole\nlanguage when children learn the pidgin as their mother tongue.\n1.2.1.1. Language Variation\nActivity 5: Brainstorming\nWhat differences in language use have you noticed among the speakers of your mother tongue?\nExplain why those differences might happen.\nThe study of language variation is an important part of sociolinguistics because it addresses\nsocial factors. Languages vary from one place to another, from one social group to another,\nand from one situation to another. It is a universal feature of all human languages that they vary\nin different social groups. Language variation happens in many ways, and for many reasons.\nLanguages may vary consciously or unconsciously for the speaker. Some of the ways language\nvariation happens are: the meanings of words are changed, the pronunciations of words are\nchanged, new words are adopted, old words are no longer used, sayings change, and the\nstructure of phrases, clauses, and sentences are changed. Sometimes as children acquire the\nlanguage or languages of their parents, the use or pronunciation is slightly modified. We vary\nour language or languages through life, as we adjust to new social conditions. Language is an\nimportant part of personal identity, and individuals sometimes modify their language to signal\ngroup identity. Two specific types of language variation are dialect and accent.\na) Dialect\n14 Dialect is systematic differences in pronunciation, grammar, and vocabulary from other\nvarieties of the same language. Everyone speaks dialect; in fact, many dialects at different\nlevels of discourse. The people who speak a certain dialect are called a speech\ncommunity. Everyone has small differences between the way they talk and the way even\ntheir family and best friends talk, creating minimal dialect. Hence, the term dialect carries\nno negative connotations but it simply a neutral level to refer to any variety of language,\nincluding the standard variety (Behravan, 2012).\nb) Accent\nThe term accent is restricted to the description of aspects of pronunciation that identify\nwhere an individual speaker is from, regionally or socially. For example, when we\ncompare Bole Amharic with countryside Amharic, both speakers use the Amharic\nlanguage, but may pronounce words slightly differently. Note that accent refers only the\npronunciation of the language, whereas dialect includes the pronunciation, grammar, and\nvocabulary used by a speaker.\n1.2.1.2. Language Change\nOften language changes as a result of contact with speakers of other languages and their cultures.\nLanguage change can also happen through modernization and civilization. A language change\ncan occur at the word or a phrase levels. Another form of language change refers to changes to\nthe structure and use of the language itself. The way people use the language changes, and\nthese changes become permanent. In general, a language change can be in the form of\nphonological change, morphological change, syntactic change, or a semantic change.\nSociolinguists relate language change with code-mixing, code-switching, and code shifting.\nCode refers to the modality of a language component (the language: English, French, Amharic,\nAfaan Oromoo, etc.; or a dialect: American English, British English, Australian English, etc.).\na) Code Mixing\nCode-mixing is the use of two different codes (languages or dialects) in the same conversation\nor interaction. This typically happens as bilingual children are acquiring language. This\nbehavior may reflect the child’s lack of differentiation between the two separate languages.\nb) Code Switching\n15 Code switching, on the other hand, is the intentional use of two different languages in a\nconversation or interaction (Ayeomoni, 2006). Code switching is a skilled use of language by\nbilinguals for symbolic, strategic, or communicative purposes. Code switching is sometimes\ndone for the following reasons: to speak to a specific topic, to quote another person’s speech,\nto express strong emotion, to express group identity, to exclude or include other people in the\nconversation, or to provide words unavailable in the language being spoken (Blom, Gumperz,\n& Hymes, 1972). Code-switching is common practice in the speech patterns of bilingual\nindividuals who must converse in multiple languages, sometimes in a single social interaction.\nThis skill is extremely important in multilingual or multi-dialectal communities.\n“Sociolinguistics considers code mixing and code switching as the byproducts of bilingualism.\nIn code-mixing, a fluent bilingual changes the language by using words from other language\nwithout any change at all in situation, whereas in code switching, anyone who speaks more\nthan one language chooses between them according to circumstances and according to the\nlanguage comprehensive to the persons addressed, the purpose is to get the right effect of\ncommunication” (Hudson, 1996, P. 53).\nc) Code Shifting\nCode shifting is when an individual or community changes the primary language he or she uses\ninto another language. A code shift within a language can also happen when an individual\nbegins speaking a dialect different from his or her native dialect. For example, when a person\nmoves to a new region (or country) and begins to primarily speak the regional mother tongue\n(or dialect) instead of his or her own native mother tongue (or dialect). This shift is often\npermanent and may result in the loss of the native language or dialect. Specific to Ethiopia, the\nGafat people are currently transitioning from primarily using the Gafat language to primarily\nusing the Amharic language.\n<<< Note for adapters: Provide appropriate examples from your MT on how code mixing, code\nswitching, and code shifting occur. >>>\nActivity 6: Group Discussion and Presentation\nIn your groups, answer following questions and present to the class.\n1. What are the similarities and differences between languages and dialects?\n2. Why do languages change over time?\n16 3. When do code mixing, code switching, and code shifting happen?\n1.3 International Phonetic Alphabet\nEvery language includes a unique set of speech sounds. How does one show the speech sounds\nin written form? Many linguists have faced this challenge. In 1888 the members of the\nInternational Phonetic Association created a set of written symbols to mark the speech sounds\nof various languages (Fasold & Connor-Linton, 2006). The International Phonetic Alphabet\n(IPA) provides a universal alphabet to show all speech sounds in the world’s languages (the\nchart is available in the module appendix). Several features of the IPA are listed below. The\nIPA:\nIs used to show the speech sounds in written form.\no\nHas symbols that are based on the Roman alphabet and additional symbols from other\no\nsources.\nHas symbols that are consistent from language to language.\no\nHas a one-to-one relationship with language sounds. One IPA symbol represents one\no\nsound.\nIncludes symbols for consonants, vowels, diacritics, and suprasegmentals.\no\nHelps us compare speech sounds that are spoken in different languages.\no\nWe can view all of the IPA symbols in the complete IPA chart. The chart has several parts. The\nfirst part shows the symbols for consonant speech sounds. These are most of the consonants of\nthe world’s languages. They are produced with an airstream from the lungs. Where symbols\nappear in pairs in the same block, the symbol written to the right is voiced. Shaded blocks show\narticulations that are not possible.\nThe second section of the IPA chart shows the consonants that are produced without airstream\nfrom the lungs. These consonants include the “clicks” used in some languages within African\ncountries. The vowels section shows the vowel sounds are placed in different locations on a\nfigure with four sides. It shows the shape of a speaker’s tongue and helps us understand where\nthe tongue is located for each vowel sound.\nThe final section of the IPA chart shows the suprasegmental symbols to indicate the stress,\nintonation, and tempo of speech (Small, 2016). This section also includes Diacritic marks,\nwhich are used when there is an alternate way to produce a speech sound, but these are mostly\nused by advanced linguists. The section on tone and word accents indicates how words can be\npronounced using different tones (which indicates a different meaning in tonal languages).\n17 Chapter 1: Summary\nLanguage is a complex, specialized skill which develops without conscious effort\nor formal instruction, strictly on the basis of needing to communicate. Language\nserves many functions and varies across locations, social identities of its speakers,\nand social contexts. Universal properties of human languages include: the elements of\nphonemics, phonology, morphology, and syntax; use word categories and phrases; have\nproductivity (are able to add new words and can change the use of old words); contain\nvariation (dialects and accents); and they change with time, location, and speakers. From a\nsociolinguistic perspective, language change includes code-mixing (where children use two\ndialects or languages during the same conversation), code-switching (intentional use of a\ndifferent dialect or language during conversation), and code-shifting (when a speaker changes\nthe primary dialect or language he or she speaks). Ethiopian languages are categorized in two\nsuper-families of language (Afro-Asiatic and Nilo-Saharan) based on their ancestral relation\nand shared linguistic features. The Cushitic, Omotic and Semitic languages belong to the\nAfro-Asiatic super-family and are mainly spoken in the Northern, Central, Southern, and\nEastern parts of Ethiopia; whereas other Ethiopian languages categorized under the Nilo-\nSaharan super-family are largely spoken in the western part of Ethiopia along the border with\nSudan, mainly in Gambella and Benishangul Gumuz regions. The International Phonetic\nAlphabet (IPA) is a set of symbols used to assign graphemes to language sounds without using\nthe orthography of any specific language.\nChapter 1: Review Questions\nIndividually write the answers to the following questions.\n1. Write the definition of language in your own words.\n2. Mention at least three functions of language.\n3. What are language variations?\n4. What is language change?\n5. List the Ethiopian language families and the general areas in which they are spoken.\n6. What is the International Phonetic Alphabet (IPA), and how is it used?\n18 Chapter 1: Self-Assessment\nBelow are self-assessment statements. Copy them into your exercise book and put a\ncheckmark “√” mark on the spaces provided in the table if you agree or disagree\nwith the statements. Make sure that you read again those sections that you marked\nas “disagree.”\nStatement Agree Disagree\n1. I can define language.\n2. I can discuss the origin of language.\n3. I can describe the various characteristics of a language.\n4. I can discuss the role of language.\n5. I can identify the Ethiopian language families.\n6. I can define linguistics.\n7. I can explain the use of language in different social contexts.\n8. I can discuss how languages vary and change.\n9. I can explain how the International Phonetic Alphabet is used.\n19 Chapter 2: Phonetics\nOutline of Contents\n2.1 Definition of phonetics\n2.2 Articulatory Phonetics\n2.2.1 Speech Organs\n2.2.2 Speech Sounds\n2.2.2.1 Consonants\na) Place of articulation\nb) Manner of articulation\nc) Voicing\n2.2.2.2 Vowels\na) Tongue height\nb) Tongue advancement (front\/back)\nc) Lip position (rounded\/retracted)\n2.2.3 Phonetic Transcription\n2.2.4 Syllables\na) Syllable perception\nb) Syllable Structure\n2.2.5 Suprasegmental features\na) Stress\nb) Intonation and Tone\nc) Length\/ Gemination\nIntroduction\nIn this chapter you will learn about phonetics, a branch of linguistics which studies speech\nsounds. Speech sounds in any language can be classified based on the way the speakers\ncoordinate the speech organs. Speakers control the movement of their tongue, lips, and other\nspeech organs, the direction and force airflow, and the on\/off function of the vocal cords. An\nunderstanding of phonetics is important for multilingual education, and for teaching reading\nacross languages. Phonetics helps us understand the phonemic part of graphophonemic\nawareness. Graphophonemic awareness is important for reading development. To put a spoken\n20 language into writing, we use symbols (graphemes) to represent the sounds (phonemes).\nPhonetics has three different branches: Acoustic, Auditory and Articulatory phonetics. This\nchapter focuses on articulatory phonetics which contain speech organs, speech sounds, syllables,\nand suprasegmental features.\nLearning Outcomes\nAt the end of this chapter student teachers will be able to:\n• Define phonetics and its branches.\n• Identify speech organs.\n• Identify the place and manner of articulation of consonant sounds.\n• Organize consonant sounds according to their place and manner of articulation and\nvoice.\n• Organize vowel sounds according to tongue height and advancement, and lip position.\n• Describe speech sounds.\n• Apply knowledge of the IPA symbols to phonetically transcribe words in their MT.\n• Categorize syllable types of the mother tongue.\n• Describe the sound structure in syllables of different syllable types.\n• Explain suprasegmental features.\nTeaching and learning techniques\n• Interactive lecture\n• Independent study and project work\n• Cooperative learning and peer learning\n• Group discussion\nAssessment techniques\n• Individual work, pair and group work\n• Project work\n• Peer reflection and learning\n• Class work and homework\nInstructional materials\n• Diagram of speech organs\n• IPA Chart (mainstream and Braille, if needed)\n2.1 Definition of phonetics\nPhonetics is the study of production and perception of speech sounds that occur in all languages.\nIt is the science which studies the characteristics of human sound-making, especially those\nsounds used in speech, and provides methods for their description, classification and\n21 transcription. Transcription of speech sounds involves assigning a separate written symbol to\nrepresent each distinct speech sound. The symbols often come from the International Phonetic\nAlphabet (IPA). You will recall from chapter one that the IPA symbols can be used to represent\nsounds spoken in any language.\nThree branches of phonetics are generally recognized: articulatory, acoustic and auditory.\n(a) articulatory phonetics is the study of the way speech sounds are made (articulated) by the\nspeech organs;\n(b) acoustic phonetics studies the physical properties of speech sounds, as transmitted between\nmouth and ear;\n(c) auditory phonetics studies the perceptual response to speech sounds, as mediated by ear,\nauditory nerve and brain (Cristal, 2008).\nAccording to Westermann and Ward (2011), the study of Phonetics:\n• is important to understand how speech sounds are pronounced and perceived.\n• explains how learners perceive sounds based on their early experiences in learning the\nmother tongue.\n• describes how the learners must compare new sounds to known sounds when they are\nlearning in another language.\n• ensures accuracy across languages for how we describe and classify speech sounds.\n• explains the phonemic part of graphophonemic awareness necessary to learn reading\nand writing.\nActivity 1: Brainstorming\nThink about the sounds of your mother tongue. Answer the questions individually and\nshare to the whole class.\n1. What are the difference and similarities in the way you say these sounds:\n[b] and [m], [f] and [v]?\n2. How would you describe the sounds from question 1 to someone who had not heard them?\n2.2 Articulatory Phonetics\nAs mentioned earlier, phonetics has several branches such as articulatory phonetics, acoustic\nphonetics and auditory phonetics. In this course, our primary interest will be in articulatory\nphonetics, which is the study of how speech sounds are made or articulated (Cristol, 2008). In\narticulatory phonetics, we investigate how speech sounds are produced using speech organs.\n22 2.2.1 Speech Organs\nSpeech organs are the part of the mouth and throat used to articulate speech sounds. It is\nimportant for teachers to know the role of the speech organs in speaking. This section helps us\nto know the speech organs and how each works for speech. It is possible to divide the speech\norgans into two groups based on their ability to be moved: active articulators and passive\narticulators. The active articulators move towards the passive articulators in order to constrict\nand shape the air that is moving out from the lungs. Active articulators include lips, vocal cords\nwhich can be opened or closed, and the tongue, which moves up, down, forward, and backward.\nThe passive articulators include the alveolar ridge, hard palate, and soft palate or velum, and\nlie along the top of the vocal tract.\nOther speech organs include the structures that help articulate individual speech sounds, such as\nthe resonating cavities. The speech organs and resonating cavities are shown in the figure below,\nfollowed by a description of the major organs\nVoice is made by the vocal folds in the larynx. The larynx is an important speech organ located\non the front side of the neck. Also known as the “voice box”, the larynx is home to the vocal\nfolds which make voice happen. The vocal folds open and close rapidly as they vibrate to\nproduce voice (sound). Airflow escapes through the vocal folds each time they open. When we\nare trying to speak, the airflow moves upward through a series of cavities until it escapes, either\nthrough our nose or our mouth. When we open the vocal folds without vocal fold vibration, we\nare able to shape the airflow into a variety of speech sounds that are voiceless. Voiceless speech\nsounds are produced without vibration of the vocal folds. Voiced speech sounds require\nvibration of the vocal folds. All vowels are considered voiced speech sounds. Some consonants\n23 are voiced while others are voiceless. For example, in English, the consonant \/p\/ is voiceless;\nthe vocal folds do not vibrate to produce this speech sound. In contrast, a similar sound \/b\/ is\nvoiced; the vocal folds must vibrate to produce the \/b\/ sound. If the vocal folds do not vibrate\nfor \/b\/, the resulting sound is more like the voiceless\/p\/. A speaker can easily change voicing on\nand off between sounds in the same word. More information about the voicing feature in\nconsonants is provided in a later section.\nThe space between the vocal folds is called the glottis. Sometimes we produce sounds in this\nglottal space. For example, the English consonant sound [h] does not require the vocal folds to\nvibrate. In Amharic, a sharp puff of air through the glottis is used for some consonants, including\n[k’] (see ejective consonants in the later section of this chapter).\nActivity 2: Pair work\nAnswer the following questions in pairs.\nThink about how you said the sounds [b] and [m], [f] and [v].\n1. What speech organs did you use?\n2. How would you describe using your breath?\n3. Now contrast those with the sounds [k’], [g]. What is the difference?\nArticulators:\n• Lips\nSupported by the jaw\no\nMove in a rounded position or retracted (like a smile)\no\nConsider how your lips move when you say “who”, “see”, and “pear”.\no\n• Teeth\nUpper and lower teeth\no\nConsider how your teeth help you say: [f] in “fan” and [v] in “van”.\no\nConsider how your teeth help you say [ɵ] in “think”, and [ð] in “that”\no\n• Alveolar ridge\nA bony ridge located just behind your teeth.\no\nFront of tongue touches ridge to produce sounds like [d], [l], [s], and [t].\no\n• Hard palate\nThe bony, bowl-shaped part of the roof of your mouth\no\nSeparates the oral and nasal air spaces\no\nThe tongue and hard palate come together to make sounds [ʃ] in “ship” and [j] in “you”.\no\n• Soft palate, or velum\n24 Muscular structure behind the hard palate\no\nBack of tongue reaches the velum to make sounds like [k] and [g]\no\nThe velum moves up and down to direct the air coming from the lungs and\no\nlarynx.\n A raised velum makes contact with the wall at the back of the throat, known\nas the pharyngeal wall. When the velum rises, it seals the nasal cavity off\nfrom the oral cavity. This process is called velopharyngeal closure. It keeps\nair out of the nasal cavity. We use a raised velum to make all oral sounds.\n A lowered velum allows air to flow into the oral and nasal cavities. If the\nmouth is closed and the velum is lowered, then you can say nasal sounds\nsuch as [m], [n]. We use a lowered velum to make all nasal sounds.\n• Tongue\nThe tongue is an important articulator for\nspeech sounds. It is the main articulator\nfor vowel sounds.\nThe tongue is also used in combination\nwith other articulator structures to produce\nconsonant sounds.\nVarious parts of the tongue assist with\nspeech sound production: tip, front,\ncentral, back, and root.\nPassive articulators which work with parts\nof tongue:\n Tip: teeth\n Front: alveolar ridge\n Central: palate\n Back: velum\n Root: uvula.\n• Uvula\nFleshy structure at the back end of the velum.\no\nIf you look inside your mouth through a mirror, you can see the uvula hanging down.\no\nThe uvula connects with the root of the tongue to make uvular speech sounds.\no\nEnglish does not include uvular speech sounds. However, other languages do, including\no\nmany African languages.\nIn addition to the speech organs our speech system includes three major air spaces (pharyngeal,\noral, and nasal cavities). In these air spaces, the airflow from the vocal folds can resonate, or\n25 echo. Most speech sounds in English resonate in the oral cavity (the mouth). However, a few\nspeech sounds resonate in the nasal cavity (nose), including nasal consonant sounds [m], [n],\nand [ŋ].\n2.2.2 Speech Sounds\nSpeech sounds are sounds that are produced by speech organs of human beings; such as tongue,\nlips, vocal cords, alveolar ridge, palate, and velum. Sounds are the basic building blocks of\nwords. They are the smallest units that make one word different from another (Moats, 2010).\nFor example, the sound \/d\/ is what makes the word dot different from the word pot. The basic\nbuilding blocks of sounds are consonants and vowels. The terms consonant and vowel are used\nto refer to segments of speech, not the letters or fidels that represent them (Moats, 2010), and\ncan be written using symbols for each sound. This is called phonetic transcription, and requires\nthe use of the IPA.\n2.2.2.1 Consonants\nA consonant is defined as a speech sound that is made with some restriction of the air stream.\nConsonant speech sounds often involve a combination of two articulators. We can classify\nconsonants according to the following characteristics:\n(a) Where in the mouth the stoppage or constriction is made (its place of articulation);\n(b) Whether the sound is made with a fully stopped or merely constricted airstream (its manner\nof articulation);\n(c) Whether or not the vocal folds are vibrating or not (voicing). Sounds are either voiced or\nvoiceless;\nWe can compare and contrast the consonant speech sounds in any language based on the\nfollowing components, where changing just one feature will create a different speech sound. To\nconsider the similarities and differences between speech sounds in a language, we can focus on\nthe following:\nPlace of Articulation: Where a sound is formed\nManner of Articulation: How it is formed\nVoicing: Whether or not the vocal folds are vibrating\na) Place of articulation\nWhen a consonant sound is produced, there is a constriction somewhere along the vocal tract.\nThe location of that air constriction is called the place of articulation. To know this, we must\nknow which speech organs are passive to produce the consonant sound. Active articulators for\neach sound are described below. This tells us where in the vocal tract the speech sound is made.\nEach place of articulation is defined with examples below.\nBilabials: [b] [p] [m] [w]\n26 Lip closure and lip rounding (protrusion)\no\nLabiodentals: [f] [v]\nConstriction of lower lip and upper teeth\no\nInterdentals: [ɵ] [ð ]\nTongue tip\/apex protrudes between the front teeth\no\nAlveolars: [t] [d] [s] [z] [l] [n]\n\/d\/ \/t\/; Tongue contact with alveolar ridge\no\n\/s\/ \/z\/; Groove in the blade of the tongue right behind the alveolar ridge\no\n\/l\/; Tongue tip contact with alveolar ridge\no\n\/n\/; Tongue tip contact with alveolar ridge with sound resonance in nasal cavity\no\nRetroflex: [ɳ], [ɖ], [ʈ]\na tip of the tongue is curled back in the direction of the front part of the hard palate.\no\nJust behind the alveolar ridge.\no\nPalatals: [ʃ] [Ʒ ] [ʧ] [ʤ] [ɹ] [j]\nCentral part of tongue elevated toward the palate\no\nTongue tip can be turned back (retroflex) or tongue blade can be bunched\no\nTongue constriction in the palatal area moves to the position of the following vowel\no\nVelars: [k] [g] [ŋ] [ɰ] [k’]\nBack of the tongue contacts roof of mouth stopping airflow\no\nBack of the tongue contacts roof of mouth stopping airflow but velopharynx is open to allow\no\nairflow to nasal cavity\nRounding of lips and arching of tongue near the velum\no\nUvulars: [q] [G]\nBack of the tongue retracts to uvula.\no\nPharyngeals: [ʕ], [ħ]\na constriction between the pharyngeal walls and the tip of epiglottis which tilts backwards.\no\nTo a lesser degree, the lower part of the root of the tongue is also retracted.\no\nGlottals: [h]\nAirway constriction at the vocal folds\no\nBrief closure of the vocal folds; not a phoneme (most often occurs as an allophonic variation of\no\n[t] and [d], ladder, butter).\nb) Manner of articulation\nManner of articulation refers to the way the airstream changes because of the interaction of the\narticulators. There are names for classes of speech sounds based on their manner of articulation.\nIn General American English, the manners of articulation include: Stops, Fricatives, Affricates,\n27 Nasals, and Approximates. Approximates has further classes of Liquids, Glides, and Rhotics\nmanner of articulation. Because each language has a different number of “manner” categories,\nthe would-be teacher should be familiar with the manners of articulation for speech sounds in\nthe language(s) of the classroom.\nFor General American English, each manner of articulation is defined with examples below.\nStops:\nComplete closure of the vocal tract\no\nPressure builds up, when released = stop burst, stop plosive\no\nA stop variation = flap; quick tapping of articulator against a surface; allophones of\no\nstops; also referred to as a tap [ɾ].\nStops = [p] [b] [t] [d] [k] [g]\no\npill, bill, till, dill, kill, gill\no\nFricatives:\nAir is forced through a narrow constriction of the airway. The air escaping between the\no\narticulators causes air to escape with continuous noise.\n9 Fricatives = [f] [v] [ɵ] [ð] [s] [z] [ʃ] [Ʒ] [h]\no\nleaf, leave, teeth, teethe, bus, buzz, rush, rouge, he\no\nAffricates:\nCombination of stop and fricative; pressure builds up and is then released; only in the palatal\no\narea\naffricates = [ʧ] church [ʤ] judge\no\nNasals:\nComplete oral closure and open velopharynx\no\nNasals = [n] [m] [ŋ] ran, ram, rang\no\nLiquids:\nVowel-like consonant but the sound energy is somewhat more constricted than for vowels.\no\n2 liquids =Lateral liquid and Rhotic liquid\no\nLateral = midline closure of articulators and lateral opening for sound to escape;\no\n1 lateral = [l] Lou\nRhotic = tongue tip is curled back and tongue is bunched in palatal area, sound passes through\no\nopening between tongue and palate; one rhotic = [ ɹ] rue\nGlides (Semi-vowels):\nVowel-like consonants, but the sound is more constricted than for vowels.\no\nArticulators have a gliding motion\no\nIn English, a glide consonant is always followed by a vowel sound (even if it is written\no\nfollowed by a consonant).\n2 glides = [j] and [w]; you woo when\no\nImplosives: \/ɓ\/, \/ɗ \/, \/ɠ \/\n28 • Non-pulmonic consonants made by drawing air into the mouth instead of bringing air\nup from the lungs.\n• Similar to pulmonic consonants \/b\/, \/d\/, \/g\/, but require the opposite direction in\nairflow and result in a change in meaning at the word level.\nIn chapter 1 you were introduced to the International Phonetic Alphabet (IPA). Recall that the\nsecond box of symbols on the IPA chart includes phonetic symbols to represent the non-\npulmonic consonants. Non-pulmonic consonants do not require air from the lungs. These\ninclude sounds that require anterior click releases, implosive consonants, and ejectives. Some\nlanguages in Ethiopia may include one or more of these types of non-pulmonic consonants.\nImplosive consonants sound similar to the pulmonic stop\/plosive consonants \/b\/, \/d\/, and \/g\/,\nbut are used to show a change in meaning. The main difference is that the implosive\nconsonant is produced by sucking air into the mouth, instead of pulling air from the lungs.\nFor example, to make the implosive \/ɓ\/, you have to hold your breath briefly to increase the\npressure in the oral cavity, close your lips as you would for the consonant\/b\/, and then draw\nin a little bit of air through your mouth. When the air is drawn or sucked into your mouth\nthrough your lips, is makes an ingressive sound. The symbols for implosive consonants are\nwritten with a little hook on the bottom of the consonant symbol:\nAs an example, the following languages in Ethiopia include the implosive phoneme \/ɗ \/.\n• Omotic languages of Gamo, Gofa, Dawro, and Wolayttato, etc.\n• Cushitic languages Afan Oromo, Af Somali, Sidaamu Afoo, Rendille\n• Nilo-Saharan language of Berta\nWe can gather all of the English consonants that we have described into a single chart:\nPlace of articulation\nBilabial Labio- Inter- Alveolar Palatal Velar Glottal\ndental dental\nPlosive\/Stop p b t d k g Ɂ\nFricative f v ɵð s z ʃ Ʒ h\nAffricate ʧ ʤ\nNasal m n ŋ\nApproximant w l j w\n<<Adaptors: list affricates of your language in a separate chart>>\n29\nnoitalucitra\nfo\nrennaM Activity 3: Individual Work\nAnswer the questions according to the sections above.\n1. What does the term speech sounds mean?\n2. Compare and contrast the consonants of your MT in terms of place and manner of articulation.\nc) Voicing\nActivity 4: Brainstorming\nComplete the following exercise.\nMake the sound [fffff], and keep it going for a count of five seconds. Now make the sound\n[vvvvv], and keep it going for a count of five seconds. Now alternate these two: [fffff—\nvvvvv—fffff---vvvvv]. What is different?\nYou probably noticed that [vvvvv] had a “buzz” that [fffff] did not. That “buzz” is caused by\nthe vibrating of your vocal folds. You can check by putting your fingers on your throat as you\nalternate between [fffff] and [vvvvv] sounds. Now try the same exercises with the first sounds\nof the following words: thigh\/thy, sip\/zip.\nSounds produced with vibrating vocal folds are said to be voiced; those produced without vocal\nfold vibration are voiceless. Languages generally have voiced and voiceless sounds. Pairs of\nsounds that have the same place and manner of articulation but differ by voicing are called\ncognates or minimal pairs. The table below lists the cognate consonants (minimal pairs) of\nEnglish. The symbols in [ ] are the phonetic representations for the sounds. The remaining\nEnglish sounds are all voiced [m, n, ŋ, j, w, l], with the exception of [h] which is voiceless.\nPlace & Manner Voiceless (no vocal fold vibration) Voiced (vocal fold vibration)\nBilabial stops pay [p] bay [b]\nAlveolar stops toe [t] doe [d]\nVelar stops kill [k] gill [g]\nLabiodental fricatives fie [f] vie [v]\nInterdental fricatives thigh [ɵ] thy [ð]\nAlveolar fricatives sip [s] zip [z]\nPalatal fricatives rush [ʃ] rouge [Ʒ]\nPalatal affricates chump [ʧ] jump [ʤ]\n30 It is important to know the place of articulation, manner of articulation, and voicing for the\nsounds in their language of instruction. This is true regardless of whether the written form of\nthe language is based on letters (Latin script) or other symbols, fidels (Saba script). Using\nAmharic as an example of a language with sounds that are written within fidels, it is possible\nto create a chart to show the consonant sounds using the IPA.\nPlace of articulation – Amharic Consonants\nBilabi Labio- Alveolar Palatal Velar Glottal\nal dental\nvoiceless p T k Ɂ\nVoiced b d g\nPlosive\/\nejective p’ t’ k’\nStop\nvoiceless f S ʃ h\nFricative voiced v* z Ʒ\nvoiceless ʧ’\nvoiced ʤ\nAffricate\nejective s’ Č’\nNasal voiced m n ɲ\nLateral l\nFlap\/ trilled ɹ\nSemi- w J\nvowels\nAmharic consonant notes: Labialized consonants: [kw’, gw, fw, pw, bw, tw, mw, hw]. \/v*\/ occurs\nin Amharic for words borrowed from English; it does not occur in Amharic. [’] = sounds that\nalso can have ejective voicing. (IPA, 2005). These are sounds not described in the table and\nshould be learned.\nIt is a feature of Amharic to see instances where a consonant may be pronounced as if the\nglide consonant \/w\/ immediately follows it, without fully articulating the glide \/w\/. The\nlabialized consonants [kw’, gw, fw, pw, bw, tw, mw, hw ] in Amharic are produced as labial-velar\nsounds, requiring the lips and soft palate. The glided version of these consonants can be used\nto signify a slight change in meaning, and are known to be used in derivational morphology.\n31\nnoitalucitra\nfo\nrennaM Examples of Amharic words or concepts that include a labialized consonant in their\npronunciation are listed below (Ayalew, 2013).\nLabialized consonant Amharic pronunciation English meaning\nk’w k’w ät’t’ärä “count”\nk’w k’w ärrät’ä “cut”\nbw däb bw älä “grow round”\nbw t-d bw äläb bw älä “become round”\ngw gwaggw a “be eager”\nWith fidels, the chart below shows additional written examples of the lateralized consonants\nin Amharic:\nActivity 5: Pair Work\nDiscuss questions in pairs, then report to the class.\n1. Describe the movement of speech organs in the production of [f] and [s] sounds.\n2. What are the passive and active articulators of sounds [t], [s], [b] and [k]?\nThen, look at the table below. Think about the way you use the articulators to make sounds and\nwords. List the sound or sounds made using that articulator. The first six are done for you as\nexamples. In the word “nip”, we use three articulators to make the sounds in the word (lips for\n[p], alveolar ridge and tongue tip for [n], and the tongue for [I]).\nWord Lips Teeth Alveolar Hard Soft Tongue Glottis Uvula\nridge palate palate \/\nvelum\nNip [p] [n] [I]\nWhat [w] [t] [a]\nFeel [f] [l] [iː]\n32 Who [o] [h]\nShip [p] [ʃ] [I]\nCheese [z] [ʧ] [i]\nMove\nStop\nOpen\nBook\nLip\nJump\n2.2.2.2 Vowels\nA vowel is a speech sound that is formed without a significant constriction or blockage of air\nflow in the oral or pharyngeal cavity. In other words, the vocal tract is very much open when\nwe speak vowel sounds. All vowels are voiced; they are produced with vibrating vocal folds\n(except when whispered). Vowels are produced solely by changes in jaw, tongue and lip\npositioning. The sound source for vowels is always at the level of the vocal folds. Vowels change\nalong three dimensions depending on what the tongue and lips are doing: tongue height, tongue\nadvancement, and lip rounding.\na) Tongue height\nTongue height refers to how high or how low the tongue is in the oral cavity when producing\na vowel sound. We change the height of the tongue to produce different vowel sounds. Tongue\nheight in the mouth ranges from high to mid to low height. The highest level is when the tongue\nis close to the top, or roof, of the mouth. When the tongue is placed this high in the mouth, the\njaw is usually elevated or closed. With the tongue in the high tongue position in the mouth we\nare able to make the high vowels. The lowest level is when the tongue is in the bottom of the\nmouth and the jaw is usually down and open. When the tongue rests in the middle of the mouth,\nit is said to be in the mid height position.\nThe following words in English help show us the way the tongue height changes across vowel\nsounds. Say the following words (in bold) and notice how your tongue’s movement changes for\neach: meat, mitt, mate, met, mat. You might notice that the words meat and mat have the largest\n33 difference in tongue height for the vowels.\nmeat (high)\nmitt (mid-high)\nmate (mid)\nmet (mid-low)\nmat (low)\nb) Tongue advancement\nTongue advancement refers to how far forward or back the tongue is in the oral cavity when\nproducing a vowel sound. We can move the tongue back and forth within the mouth to make\ndifferent vowel sounds. Tongue advancement includes front, central, and back positions of the\ntongue in the mouth. When the tongue is near the teeth and lips it is at the front of the mouth.\nWhen the tongue is closer to our soft palate (velum) and uvula, the tongue is in the back of the\nmouth. In between these positions is the tongue’s central position. As the tongue moves forward\nin the mouth, we say the tongue is advancing (advancement). When the tongue is moving\nbackward in the mouth, we say the tongue is retracting (retraction).\nLook at the words in the list below. Say each set of words. Start with heat-hurt-hoot. Notice how\nyour tongue is moving from the front to the back of your mouth with each vowel sound. Also\ntry to read the words from back to front vowel position (hoot-hurt-heat).\nFront Central Back\n1. heat hurt hoot\n2. hat hut hot\n3. deed dud dude\n4. lick lurk look\n5. weigh were woe\nA helpful way to remember tongue height and advancement for vowel sounds is the figure\nbelow. In the example below, the English vowels are listed based on their tongue height (high,\nmid, low) and tongue advancement (front, central, back). A pronunciation key is located below\nthe vowel box.\nEnglish vowels:\n34 Phonetic Symbol Example word in spelling\ni Bead\nɪ Bid\nE Bayed\nƐ Bed\nᴂ Bad\nʌ , ə Bud\nɝ, ɚ Bird\nU Booed\nƱ Good\no Bode\nᴐ Pawed\nɑ Pod\n35 a\nIPA (2005). American English vowels [a] is a mid, central vowel used in American English in\nsome cases as a dialect variation of front vowel [ᴂ] or back vowel [ɑ].\n<<During adaptation, provide MT words in the chart above where possible>>\nIt is important for would-be teachers to know the tongue height and advancement of vowels\nsounds in their language of instruction. This is true regardless of whether the written form of\nthe language is based on letters (Latin script) or fidels (Saba script). Using Amharic as an\nexample of a language with sounds that are written within fidels, it is possible to create a chart\nto show the vowel sounds using the IPA. A pronunciation key is located below the vowel box.\nIn the Amharic vowel sounds box above, the symbols in parentheses ( ) are different ways that\nAmharic speakers say the central vowel sounds [ɨ] and [ə]. The table below includes vowels not\nfound in English but which occur in Amharic.\nPhonetic Example word in Example word in Example word\nSymbol phonetic symbols Amharic spelling translated in English\nspelling\ni kis ኪስ “pocket”\nɨ mɨn ምን “what?”\nɪ jih - jɨh ይህ “this”\n36 e k’es ቄስ “priest”\nƐ jƐmmil የሚል “he who says”\na bal ባል “husband”\nə kəbt ከብት “cattle”\nᴐ gwᴐrf ጎርፍ “flood”\no s’om ጾመ “fast”\nu bəkkul በኩል “direction”\nƱ kwƱlf ቁልፍ “lock”\nIPA (2005). Amharic vowels.\nc) Lip position (rounded\/retracted)\nVowel sounds can also be described by the shape the lips take. The shape of the lips for vowel\nproduction is either rounded or unrounded. By making the lips round we make the vocal tract\nlonger. In English, only back and central vowels are rounded. There are no front rounded vowels\nin English, but there are in French, German, and Swedish. For the rounded position, the lips are\nin the shape of a circle. For the unrounded, or retracted, position the lips are pulled tighter along\nthe sides, such as in a smile. You must change the shape of the lips to accurately pronounce the\nvowel sounds in the following words.\nSay cheese. The vowel in this word, [i], has a retracted, unrounded lip shape.\nSay chose. The vowel in this word, [o], has a rounded lip shape.\nVowel combinations\nSometimes a language can have other types of vowel sounds that are made from the\ncombination of two or more other vowel sounds together. Vowels that move or glide from one\nvowel sound to another are called diphthongs. An example of a diphthong in English is the\nvowel sound “oy”, as in boy, phonetically written as [ᴐІ] to show the combination of the back\nvowel [ᴐ] and front vowel [i]. Say the word boy. After the [b] consonant at the beginning of\nthe word, your mouth prepares to make the vowel sound “oy”. First your mouth starts with a\nback tongue position and rounded lips. Your mouth moves quickly to a front tongue position\nwith retracted, or smiley lips. This quick movement between vowel positions is called gliding\nbetween vowels. This gliding happens very quickly. Speakers and listeners often hear just one\nvowel sound, not two. Because diphthongs are two vowels in one, they have a longer duration\nthan the single vowels. Some languages also have three and four vowel combinations, which\nare even longer in duration. Other languages do not use diphthong vowel sounds (UCLA,\n2016).\n37 Note: You may see the term diphthong used to describe a grapheme or written symbol that\nrepresents a consonant and two vowel sounds together. Amharic is a language where this\nhappens. Amharic has diphthong fidels used in writing and spelling to indicate consonant and\ndiphthongs sounds together in a syllable. This is a different use of the term diphthong.\nExamples of English diphthongs are listed in the table below.\nDiphthong English\n[аi] As in my, buy, ice\n[аƱ] As in cow, couch\n[ᴐi] As in boy, moist\nActivity 6: Group Work\nWork in a small group to complete these activities. Then, reflect to the whole class.\n1. Pronounce the initial sounds of the following words and then determine the place of articulation\nof each.\nhand____________ foot ______________\nbelly ___________ chin ______________\ncalf ____________ knee _____________\n2. Identify the manner of articulation of the initial sounds in the following words.\nsilly ___________ crazy _____________\nmerry ___________ dizzy _____________\nloamy __________ funny _____________\n3. Which of the following words end with voiceless (-v) sounds and which end with voiced (+v)\nsounds?\ncrash ____________ smack ____________\nbang ____________ splant ____________\nwham ___________ fish _____________\n4. Describe the following consonant sounds in terms of voice and place\/manner of articulation:\n[v], [m], [k’], [g], [f], [s], [h] and [n]\n5. Describe the following vowel sounds according to their tongue height, tongue advancement,\nand lip position.\nItem Tongue height Tongue Lip position\nadvancement\n1. [a] low central retracted\n2. [e]\n3. [i]\n4. [o]\n5. [u]\n2.2.3 Phonetic Transcription\nStandard alphabetic writing is unsatisfactory to represent the speech sounds across languages.\nIt is not possible to write a transcription of speech sounds unless some standard, cnsistent\nmethod of representation is used (Paul, 2010). In 1888 the International Phonetic Association\n38 (based in Paris) tackled the problem of how to precisely describe any sound the members might\nencounter in their efforts to describe all the languages of the world. They published symbols for\na new alphabet, the International Phonetic Alphabet [IPA] (Fasold, 2006).\nA writing system is considered phonetic when one sound corresponds to one symbol. A phonetic\nalphabet represents all of the sounds in the world’s languages so that speech can be described\nwith a common symbol system (Paul, 2010). This writing system reflects only the sounds of the\nlanguage, not the orthography of the particular language. Therefore, the IPA can be used for\nlanguages written using Latin letters and those languages using fidels.\nFidel Phonetic transcription Notes\nተ \/ tƐ \/, \/ tə\/ There are two speech sounds in the\npronunciation of ተ. The first is a consonant\nsound \/t\/. The second is a vowel sound. Two\npossible vowel pronunciations are provided.\nቱ \/tu\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nቱ.\nቲ \/ti\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nቲ.\nታ \/ta\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nታ.\nቴ \/te\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nቴ.\nት \/tɨ\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nት.\nቶ \/to\/ There are two speech sounds (one consonant\nand one vowel sound) in the pronunciation of\nቶ\n<<Adaptors: Modify the following table to include a sample word for each sound of the mother\ntongue and use the proper IPA symbols in the phonetic transcription. Use only words from\nYOUR respective mother tongue. This will require much discussion amongst the group. Place\neach IPA symbol that occurs in the MT in one box and follow it with a mother tongue word.\nBold the letters\/fidels in the MT that represent the symbol. >>\np – pop b - ball t – ten d - do\nExamples of mother tongue phonetic transcription:\n<<Adaptors: ensure that words from English and all 7 MTs are represented below. We want to\nshow that the same symbols are used across all 7 languages when words are written using the\n39 IPA>>\nMT Orthography Phonetic Transcription English Orthography\nEnglish\n Cat [cᴂt]\n Beat [bit]\n Happy [hᴂpi]\nAmharic\n ከብት [kəḅt] cattle\n ፆም [s’wom] fasting\n ምን [mɨn] what\nAfan Oromo\n Sun [sun] that\n Nyaate [ɲa:te] ate\n Dhuunfaa [ɗu:nfa:] personal\nTigrigna\n ከብቲ [kəḅti] cattle\n ድሙ [dɨm:u] cat\n በል0 [bələʕə] ate\nSidaamu Afoo\n Anga [Ɂaŋga] hand\n Ille [Ɂille] eye\n Farashsho [faraʃ:o] horse\nHadiyissa\n Aayya [Ɂaajja] sister\n Anga [Ɂaŋga] hand\n Buchcha [buʧ:a] soil\nWolaytta\n Qofa [k’ofa] idea\n Xaafa [t’a:fa] write\n Lo’o [loɁo] good\nAf-Somali\n Bare [bare] teacher\n Arday [ardai] student\n Dugsi [duksi] school\nActivity 7: Pair Work\n40 Working in pairs or small groups, complete the following chart. Use phonetic transcription to\nwrite each word from your mother tongue using the IPA symbols. The first two have been\ndone as examples.\nNo. Mother tongue transcription Phonetic transcription\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8.\n9.\n10.\n<<adaptors: Choose 10 words in your mother tongue, ranging from simple to moderately\ncomplex, and enter then into the column under ‘Mother tongue transcription’. Complete the\nphonetic transcription in the right column for the first 2 words>>\n2.2.4 Syllables\nA syllable is a unit of sound that has a vowel at its core. Syllables are typically larger than a\nsingle sound and smaller than a word. However, a syllable can sometimes be a word. Words\ninclude one or more syllables. For example, the word book is only one syllable, but the word\nbookcase is two syllables (book\/case). Here we think of a syllable with the sounds we hear, not\nthe letters or symbols that are written. Each syllable must have one or more vowel sounds to be\ncomplete. The syllable may also have one or more consonant sounds in addition to the vowel\nsound (some syllables have only a vowel, like the first syllable in the word alone – a\/lone). The\nconstruction of a syllable is always organized around a vowel sound which is the syllable’s\ncenter, or nucleus. The consonant sound or sounds that come before the nucleus make up the\nsyllable onset. The sound or sounds following the vowel make up the coda, or syllable’s end\n(also called termination).\nThe table below shows some examples.\nOnset Nucleus Termination Examples\nnucleus only - X - [e] in “a”\n[аi] in “I”\nonset + nucleus X X - [bi] “bee”\n41 nucleus + termination - X X [ᴂt] in “at”\n[ɑf] in “off”\nonset + nucleus + termination X X X [bɛd] in “bed”\na) Syllable perception\nFrom the speaker’s view, syllable stress involves using less or more energy to pronounce the\nsyllable. From the listener’s view, the syllable stress involves hearing a shorter or longer\nsyllable, particularly the shorter or longer vowels (Harbers, 2013). Thus, vowels play a key\nrole in our ability to perceive individual syllables in words. Intonation is also important for\nperceiving syllables. The speaker’s changes in voice pitch, with rising and falling intonation,\nhelps the listener detect syllable and word boundaries.\nIn speech, we listen for the vowel patterns as each vowel marks a different syllable. In spoken\nwords we can count syllables based on the vowels produced. However, when we see the words\nwritten in print, there may be different rules for dividing syllables based on their spelling. For\nexample, when we hear the word happy, we hear four speech sounds: [h], [ᴂ], [p], [i]. When\nchildren spell the word happy, they see five letters and they are instructed to divide the syllables\nby drawing a line between the two “p” letters: hap\/py. This helps them see the letters associated\nwith the sounds in the word. However, it is important to show them the difference between\nsounds and letters, or fidels. It would be incorrect to teach them that the word happy has five\nsounds when it only has four sounds because we only say the [p] consonant sound one time,\nbut spell it with two letters “pp”.\nb) Syllable Structure\nIn each language there are a variety of syllable structures. One of the common ways to describe\nsyllable types is by syllables that are open or closed. When a syllable ends in a vowel sound (the\nsyllable nucleus), and has no coda, or nothing after the vowel sound, then we say it is an open\nsyllable. Syllables that do have a consonant sound at the end, and thus have a coda, are called\nclosed syllables.\nIn addition to open vs. closed syllables, we can also look at the syllables by how simple or\ncomplex they are. The simplest syllable has only a vowel sound, and nothing else. A very\ncomplex syllable has many consonant sounds occurring before and after the vowel sound.\nComplex syllables that have blends and clusters of consonant sounds are more difficult for\nchildren to read and spell than simple syllables. It is difficult for children to hear each consonant\nsound in the cluster of consonant sounds (Moats, 2000). Below is a list of the syllable types that\n42 occur in <<MT language>>, where C = consonant, V = vowel:\n<<During adaptation, note which syllable patterns appear in the Mother Tongue and adapt only\nthose>>\nSyllable structure Example word in English spelling\nV I\nCV me\nVC at\nVCC ask\nCVC cat\nCCV try\nCCVC skin\nCVCC cans\nCCVCC stops\nCCCVC scream\nCCCVCC squeaks\nCCVCCC starts\nCCCVCCC scrimped\nActivity 8: Pair Work\nComplete the following activities in pair and reflect to the class.\n1. Show the structural parts of the following syllables on the chart given below.\nSyllables: men, skin, on-set, in-to-na-tion <<change these after you adapt the cart below>>,\nSyllable phonetic Onset nucleus coda Open or\ntranscription Closed\nman mæn m æ n closed\nand\nskin\non\n43 set\nin\nto\nna ne n e -- open\n(first syllable in\nna\/tion)\ntion\n(second syllable in\nna\/tion)\n<<adaptors: in the table above, choose syllables from your mother tongue, then list them at the\ntop of the table in the instructions>>\n2.2.5 Suprasegmental features\nWe usually speak with more than one word. When we speak in strings of words together\n(connected speech), we control other characteristics to make speech sound natural. These other\ncharacteristics are called suprasegmental. The prefix supra- means above, or beyond. The\nsegment of speech can be the sound, syllable, word, or sentence. Suprasegmentals are features\nof speech that affect a whole sentence, including the stress, intonation, and timing aspects of\nspeech production. The suprasegmental features tie the sounds, syllables, words and sentences\ntogether to make speech efficient and rhythmic. Each of these features is described in the\nsections below.\na) Stress\n<<During adaptation use a MT example in the paragraph below (and replace the word\n‘elephant’)>>\nStress is when a syllable or word is pronounced longer, louder, higher-pitched, or more clearly\nthan other syllables or words. Every word spoken by itself has at least one stressed syllable. A\nstressed syllable is spoken with more articulatory force. A stressed syllable is louder, longer in\nduration, and higher pitched than an unstressed syllable (Small, 2015). Words with many\nsyllables will have at least one syllable that has more stress than the other syllables in the word.\nFor example, the English word elephant has three syllables. One of the syllables in elephant\nhas more articulatory force, or emphasis behind it. Can you tell which one? Many English\nspeakers pronounce this as ELephant, where the first syllable is stressed. Now change the stress\nto the second syllable: elEphant. What does it sound like to speak with stress on the third and\nlast syllable? elePHANT. As a general rule in English, prefixes and suffixes do not carry\nprimary word stress.\nActivity 9: Small Group Discussion\n44 Discuss the following questions in group and answer orally.\n1. Are there words that look the same when written, but have different meanings in your MT? If\nyes, do you know the reason why?\n2. Read the following sentences and tell meaning difference. Do you know why?\n “I am present.” (PRESent: capitalized syllable is stressed)\n “I will present the project today.” (preSENT: capitalized syllable is stressed)\nSometimes a change in word stress helps us tell the difference in meaning between two words\nthat are spelled the same way. In English, the word “present” could be pronounced as PRESent\nwith the stress on the first syllable: “I am PRESent.” (meaning, “I am here.”), or “Thank you\nfor the lovely PRESent.” (meaning “Thank you for the gift.”). Another option is that this word\ncould have the stress on the second syllable: preSENT, “I will preSENT the project today.” The\nword has a different meaning in the sentence based on which syllable is stressed. In the English\nlanguage, the noun form always receives stress on the first syllable, and the verb form receives\nstress on the second syllable.\nIn addition to word stress, we also use sentence stress to express different meanings in speech.\nSentence stress helps us emphasize the more important words in our message. Look at the\nsentence below. Say the sentence three different times, each time with more emphasis on the\ncapitalized word to see how this changes the sentence-level stress.\n1. Sam ate the CANDY from the store.\n2. SAM ate the candy from the store.\n3. Sam ate the candy from the STORE.\nA speaker can use sentence stress in this way to indicate their intent, or their meaning. In\nsentence 1, the speaker is expressing importance that Sam ate candy (rather than something\nelse) from the store; in sentence 2, the speaker is stressing the importance that Sam (rather than\nsomeone else) ate the candy from the store; and in sentence 3, the speaker is stressing the\nimportance that the candy which was eaten came from the store (rather than from somewhere\nelse). Sentence stress helps us tell the type of information that is being said, and notice the\ndifference between new and old information. Students who are learning another language, or\nwho have difficulty with their hearing, may have difficulty with understanding and speaking\nboth the word and sentence stress patterns.\nb) Intonation and Tone\nWord and sentence stress involve changes in the pitch (highness, lowness) of the voice. Tone\nrefers to the use of pitch to convey meaning as a word level; intonation refers to the use of pitch\nto convey meaning in a sentence or discourse level. We use different intonation patterns to ask\na question, answer a question, state a fact, or make an exclamation. Intonation may also reflect\na speaker’s mood. Intonation that has an upward pitch movement is called rising intonation.\nRising intonation is used when we ask questions that can be answered with a yes or no response:\n“Are you coming?”, “Is it time yet?” or to convey an incomplete thought: “His name is Bill,\nisn’t it?”\nIntonation with a downward pitch pattern is called falling intonation. Falling intonation is often\n45 used with complete statements and commands that express the final word (“It is time to go.”,\n“That is it.”) and questions that begin with Wh-words (Who, What, When, Where, Why,\nWhich). “Where are you going?”, “Who is coming?” It is possible to use both types of intonation\n(rising and falling) in one sentence. “He went to the store, didn’t he?” We use both types of\nintonation patterns throughout our speech every day.\nc) Length and Gemination\nLength\nOur speech can be described in its length, or duration. Tempo is a term used to describe the\ntiming of speech. The average English-speaking adult speaks at a rate of 5 to 5.5 syllables per\nsecond (Small, 2015). The length of speech, its overall duration, and tempo depends on how\nlong the individual sounds, syllables, words, and pauses between them might be. Long, tense\nvowels are spoken with greater tongue tension than short, lax vowels. In addition to the vowel\nsound’s length, the length of a spoken syllable is also affected by the consonant that comes after\nthe vowel. Voiced consonants are longer in length than voiceless consonants. For example, the\nlong vowel [i] (“ea”) in the word bead ([bid]) is longer in duration than the vowel [I] in the word\nbeat ([bit]) because the [d] in bead is a voiced consonant, and the [t] in beat is voiceless. The\nsame tense vowel [i] is represented in both words. However, the [i] in bead is longer because of\nthe effect of the voiced consonant following it ([d]).\nGemination\nSometimes it is necessary for a consonant sound to be pronounced with slightly longer\nduration than the standard consonant would be. Examples of this in English include syllable\nand word boundaries that end and begin with the same consonant sound. In the examples\nbelow, we only pronounce the lengthened consonant sound one time. For example, in the\nword “bookkeeper”, two words combine into one: “book”, “keeper”. But for the sake of fast\nand efficient speech, we usually pronounce only one of the \/k\/ consonant sounds in the\nmiddle of the word. It would take greater articulatory effort to say “book-keeper” with two\ndistinct \/k\/ sounds than to lengthen one \/k\/ sound.\nGemination can be different across languages. In English, gemination only occurs at\ngrammatical or word boundaries, and does not signify any differences in meaning (or lexical\nunits). However, in some languages, the lengthening of a spoken consonant sound may reflect\na changed meaning. This too happens when a consonant sound is articulated with greater\nlength (gemination) as compared to the consonant’s normal length.\nThe changes in pronunciation related to gemination may not always be represented in writing.\nIn other words, the change in length of the consonant pronunciation usually does not result in\nchanges to the way the sound or word are spelled. This is also true of lengthening vowel\nsounds in the world’s languages. As with any type of lengthening pattern that may alter the\nmeaning of a syllable or word, children who are learning to listen to, speak, read, and write a\nlanguage must learn the gemination patterns that exist in the language.\n46 A few examples of gemination in Amharic words are provided here with the Amharic\npronunciation. When a consonant sound is longer in its duration due to gemination, it is listed\nas a double consonant sound in the following examples. alä = “he said”, allä = “there\nis”; yǝmätall = “he hits”, yǝmmättall = “he is hit”. In Amharic, gemination helps contrast\nderivation and inflection patterns in the verb system (Ayalew, 2013).\nVowel and syllable duration are important factors in reading and writing. When children learn\nto read and spell words with many syllables, they are using their awareness of the sound changes\nin words. This is especially true when words are changed by adding additional morphemes\n(derivational morphology). Chapter 4 of this module provides additional information about\nderivational morphology. However, it is important here to know that these derivational changes\nsometimes cause phonetic changes related to vowel and syllable length and stress. The table\nbelow summarizes some of the phonetic changes that may occur in English words.\n<<<During adaptation, think about the MT and provide examples of how words change when\nmorphemes are affixed. This table should be only MT words and should discuss how two similar\nwords are different in regard to pronunciation.>>\nWords Changes Type of phonetic change\nDiffer – different Syllable regrouping\nSane – sanity Mid front tense vowel [e] in Vowel alternation\n“sane” becomes low front lax\nvowel [ᴂ] in “’sanity”.\nPrecise – precision Tense diphthong vowel [аІ] in Vowel alternation\n“precise” becomes lax high\nfront vowel [I] in a stressed\nsyllable in “pre’cision”.\nElectric – electricity The first and second letter Consonant alternation\n“c” in “electric” both\nrepresent the sound [k].\nWhen the word changes to\n“electricity”, the second\nletter “c” actually represents\nthe [s] sound.\nPerceive – perception The [v] in the second syllable Consonant alternation &\nof “perceive” becomes [p] in Vowel alternation\nthe second syllable of\n“perception”. There is also a\nvowel alternation in this\nword change: [i] to [ɛ].\n47 Present – presentation In the word “present”, the Stress alternation\nsecond syllable is stressed\n(“preSENT”) whereas the\nthird syllable in\n“presentation” is stressed\n(“presenTAtion”) because of\nthe new front tense vowel\n[e].\n*Modified from Moats, 2000.\nActivity 10: Individual Work\nWorking individually, write an explanation for the terms below in your own words and\nprovide an example for each.\n• Tone\/Intonation\n• Stress (word and sentence)\n• Length\n• Gemination\n48 Chapter 2: Summary\nIn this chapter you have learned about phonetics, the branch of linguistics that\nstudies speech sounds. Phonetics has three different main branches; auditory\nphonetics, acoustic phonetics and articulatory phonetics. This chapter focuses on\narticulatory phonetics; which deals with the articulation of speech sounds. Speech sounds are\ndivided into consonant and vowel sounds. Consonant sounds are differentiated by place of\narticulation, manner of articulation and voice. Vowels are differentiated by height and\nadvancement of the tongue and position of the lips.\nPhonetic transcription was introduced in the chapter. Standard alphabetic and fidel writing\nvaries by the language, and therefore cannot represent speech sounds across all languages. To\nsolve this problem, the International Phonetic Association created and published the\nInternational Phonetic Alphabet (IPA) to describe sounds of all languages in the world. A\nwriting system is considered phonetic when one sound corresponds to one symbol. The IPA is\nsuch a system. Words from any language in the world can be written using the symbols of the\nIPA.\nThe syllable is the unit of language that has at least a vowel or a vowel and consonant\/s\ncombination. The vowel sound is always the center or nucleus of the syllables.\nSuprasegmentals such as stress, tone, intonation and length\/gemination, are features beyond\nsegments. Superasegmental features affect syllables, words, and the whole sentence through\nchanges in the pitch, emphasis, and tone to represent changes in meaning. Tone refers to the use\nof pitch to convey meaning at the word level; intonation refers to the use of pitch to convey\nmeaning in a sentence or at the discourse level.\nAn understanding of phonetics is important for multilingual education, and for teaching reading\nacross languages. You can explain how the consonant and vowel sounds are made by\ncoordinating the speech organs. Speakers control the movement of their tongue, lips, and other\nspeech organs, as well as the direction and force of the speech airflow, and vibration of the vocal\ncords. Stress is using more articulatory force on syllables. Length and gemination refer how\nlong a given segment takes to be articulated.\n49 Chapter 2: Review Questions\nIndividually write the answers to the following questions.\n1. Determine what these groups of speech sounds have in common:\n(a). [t], [d], [n], [s], [z]\n(b). [m], [n], [ŋ]\n(c). [k], [g], [ŋ]\n(d). [t], [g], [d], [k], [p], [b]\n2. What is the difference between an open and a closed syllable?\n3. Describe the place, manner of articulation and voice for the first and last sounds of the following\nwords.\ncheese\nlaugh\ncollage\nwealth\n4. Fill in the blanks to describe the vowel symbols.\nvowels Tongue Tongue Lip Position\nHeight Advancement\nI high front Unrounded\nɪ\nƐ\nᴐ\nᴂ\nO\nU\n5. Fill in the blanks to describe the voice, manner, and place of articulation for each of these\nconsonant sounds.\nConsonants Place of Manner of Voicing Nasality\narticulation articulations\nm Bilabial stop Voiced nasal\ns\ng\nʃ\nn\n50 d\nf\nÐ\n6. Match the questions raised under “A” with the terms under “B” which one related with the\nquestions raised.\nA B\n1. Which active articulator should I use? a. stop, fricative, affricate\n2. What kind of constriction should I make? b. nasal\/ oral\n3. Where should I make the constriction? c. bilabial, labiodental, dental, alveolar,\npalatal, velar, uvular\n4. Should the velum be open or closed? d. lips, tongue tip, tongue body, tongue root,\nlarynx\n5. What should I do with larynx? e. voiced, voiceless\n7. Define phonetics.\n8. Define syllable.\n9. What is the difference between tone and intonation? Provide an example of each.\n10. Transcribe the following words using the IPA symbols to complete the chart.\nMother tongue transcription Phonetic transcription\n<<adaptors: choose 7 MT words and write them in the column on the left in the chart above>>\nProject work 1\nObserve primary text books; look how syllables are treated in grades 1-4 & 5-8 and write at least\none page report based on your observation and discuss how this will impact the way you teach.\n51 Chapter 2: Self-Assessment\nBelow are self-assessment statements. Copy them into your exercise book and put\na “√” checkmark on the spaces provided in the table if you agree or if you disagree\nwith the statements on the left. Make sure that you read again those sections that\nyou marked as “disagree.”\nStatements Agree Disagree\n1. I can define phonetics and its branches.\n2. I can identify speech organs.\n3. I can identify the place and manner of articulation of\nconsonant sounds.\n4. I can organize consonant sounds according to their\nplace and manner of articulation, and voice.\n5. I can organize vowels according to tongue height and\nadvancement, and lip position.\n6. I can describe speech sounds.\n7. I can apply my knowledge of the IPA symbols to\nphonetically transcribe words in my mother tongue.\n8. I can categorize syllable types of my mother tongue.\n9. I can describe the sound structure in syllables of\ndifferent syllable types.\n10. I can explain suprasegmental features.\n11. I can use my phonetic knowledge to help students who\nhave pronunciation problems in the MT or are learning\nthe MT as a second language\n52 Chapter 3: Phonology\nOutline of Contents\n3.1. Definition of phonology\n3.2. Phoneme, Phone and Allophone\n3.3. Phonotactics\n3.4. Phonological processes\nIntroduction\nThis chapter deals with phonology, which focuses on the sound system of a language. It also\ndiscusses the concepts of phoneme, phone, and allophone; and helps student teachers learn to\nclearly distinguish among these concepts. Additionally, the role of phonotactics and\nphonological processes that support children in learning to read are addressed.\nLearning Outcomes\nAt the end of this chapter, student teachers will be able to:\n• Define phonology.\n• Differentiate between phonemes, phones, and allophones.\n• Explain the role of phonotactics in learning to read and write.\n• Summarize phonological processes.\nTeaching and Learning Techniques\n• Interactive lecture\n• Independent study\n• Cooperative learning and peer learning\n• Group discussion\nAssessment Techniques\n53 • Oral questions and answers\n• Pair and group work\n• Reading assignment\n• Peer reflection and learning\nInstructional Materials\n• Pictures\n• Charts\n3.1 Definition of Phonology\nPhonology is a branch of linguistics that describes the rules, systems, and patterns of speech\nsounds (phonemes) that occur in syllables and words. Phonology is the study of how phonemes\nare organized and how they work together to create words. This chapter includes a description\nof the sounds a language uses (a phonemic inventory) and the rules for how these sounds are\norganized. “Phonology is concerned with which speech sounds a language uses and how they\nare arranged and function within that language.” (Bauman-Waengler, 2009, p. 7).\nIn phonology, we focus on the linguistic function of speech sounds. This is different than\nphonetics, which focuses on how the speech sounds are produced. For example, we are capable\nof producing many different sounds with our vocal tract. However, we only use a small number\nof all of the possible sounds to make the words in one language. Phonetics considers all of the\npossible speech sounds, across all languages. In contrast, phonology focuses on the way the\nspeakers of a specific language use some of the many possible speech sounds to express\nmeaning. Saba script languages follow a syllabic writing system, meaning one symbol\nrepresents one syllable. However, this chapter addresses the individual sounds within the fidels.\nFor example, the word ‘sint’ has three fidels, but has four sounds (\/s\/ \/ɨ\/ \/n\/ \/t\/).\nActivity 1 ː Pair Work\nIn pairs, discuss the following question: What is the difference between phonology and\nphonetics? Then, reflect your understandings to the class.\n3.2 Relation among Phoneme, Phone and Allophone\nIn chapter 2, you learned about phonetics, the study of speech sounds. Individual speech sounds\nare called phonemes. Phonemes are the smallest unit of sound that can signal a difference in\n54 meaning. A series of phonemes (vowel and consonant sounds) are strung together to make\nsyllables and words. You will recall from chapter 2 that each syllable must have at least one\nvowel phoneme.\nSome words have very different sound structures. The English words map and potato have very\ndifferent sound arrangements and number of syllables. Other words may differ only by one\nunit. The words bee and beet differ only by the last consonant phoneme \/t\/ in beet. The \/t\/ tells\nus that the words beet and bee are two different words with two different meanings.\nIf we look at a written word, the individual phonemes can be difficult to identify. A group of\nwords that use the same phoneme can be compared. But be careful, it can be tricky if you only\nlook at the letters.\nActivity 2: Pair Work\nWorking in pairs, look at each line of words in the table below. Say each word in a line out\nloud and listen to the individual phonemes in the word. Determine which phoneme all of the\nwords in the row have in common. Then, write the common phoneme in the first box. The first\ntwo lines have been completed as examples.\nPhoneme Word choices\n\/z\/ zinc tans Susan raise close zip\n\/s\/ box sounds pace sun mercy bicycle\ngrow pig begin again ghost legs\nwhose hang behind behave ahead hole\nrough funny phoneme off graph afar\nHow many phonemes does a language have? This depends on the language. For example,\nEnglish has about 43 unique speech sounds, including 14 vowels, 3 diphthongs, and 26\nconsonants. In English orthography, we use 26 letters and letter combinations to represent the\nspeech sounds in writing. Amharic has 27 consonant phonemes and 7 vowels. By comparison\n55 as a language with significantly fewer sounds, Spanish only has about 18 consonant phonemes,\n5 vowel phonemes, and a few diphthongs that vary with Spanish dialects.\nPhonemes are also abstract. Phones are the forms or physical representations of the phonemes.\nTogether, the multiple phones of a single phoneme are called allophones. Phonemes are put in\nslashes \/ \/, but phones are put in square brackets [ ]. In the example \/abəba\/ and [aβəβa], we\nsay that \/b\/ is a phoneme and [β] is a phone. The first one is abstract, and the second one is\nphysical.\nAs stated above, allophones are the multiple subtle variations in how phonemes are\npronounced, i.e., they are the different realizations of a phoneme. These changes in a phoneme\nare the result of the phonetic context of the word and can be influenced by other phonemes in\nthe word. Allophones are members of the same phoneme family (Small, 2015). For example,\nin English, the two \/p\/ consonant phonemes in the word pop are produced differently because\nof their position in the word. The first \/p\/ is aspirated by the speaker, who pronounces the first\n\/p\/ with a small puff of air. In contrast, the last \/p\/ is usually not spoken in this way with the\npuff of air. In both cases, it is still the \/p\/ consonant phoneme, but with a slight variation is how\nthe sound is produced. The meaning of the word has not changed. The two \/p\/ consonant\nphonemes in the word pop are allophones, variations of a single phoneme \/p\/. Another example\nis the \/l\/ sound in lake and ball. The position of the \/l\/ phoneme at the front of the word lake is\na light \/l\/ sound whereas the \/l\/ at the end of ball is a dark \/l\/ phoneme. These are both the same\nphoneme \/l\/, but with a slight variation based on the position of the phoneme in the word.\n<<When adapting, use a mother tongue example below>>\nAllophones are found across words representing almost identical sounds. Note that in Sidaamu\nAfoo phoneme \/n\/ has the [m], [ɱ], [ŋ], [ɲ] sound allophones. Let’s see this example of\nphoneme and its allophones in Sidaamu Afoo in the following diagram:\n56 Activity 3: Group work and Reflection\nIn groups, do the following:\nExplain the distinction between phoneme, phone and allophone. Then, provide an appropriate\nexample from your mother tongue for phone, phoneme and allophone like the diagram above.\n3.3 Phonotactics\nEach language has rules for allowable combinations of phonemes in syllables and words.\nPhonotactics is a branch of phonology that explains how sounds are organized in syllables and\nwords (Turnbull & Justice, 2012). Phonotactic rules refer to the ways the phonemes can and\ncannot be combined in the language. In English the phonotactic rules apply to syllable\nstructure, consonant clusters, and vowel sequences.\nListeners use phonotactic cues to analyze and make sense of the speech stream. The\nphonotactic cues help the learner become sensitive to the likelihood that certain phonemes will\noccur in general and specific places in syllables and words (Jusczyk, Luce, & Charles-Luce,\n1994; Turnbull & Justice, 2012). Some phoneme combinations do not occur in English words\nthat may occur in other languages. Phonotactic constraints occur where the use of a phoneme\nis restricted and cannot be used in all word positions (beginning, middle, end of a word).\nEarly in language development, children learn to recognize the allowable phoneme patterns in\ntheir native language. Their ability to detect these regular patterns of sound helps them segment\nwords from continuous speech. Most children are able to distinguish the difference between\nphoneme combinations that are permissible in their native language by the time they are 1 year\nold (Jusczyk, Luce, & Charles-Luce, 1994). When children are learning words in school, the\nregular patterns of phonotactics help children learn words with common phonotactic sequences\nmore quickly than they can learn words with rare phonotactic sequences (Storkel, 2003). A few\nexamples from the English language are provided in the table below.\n<<During adaptation, compose a chart of phonotactic rules for the MT>>\nPhonemes Phonotactic rule Phonotactic cue\nChild hears \/h\/ and knows this\nWords can begin with \/h\/, happy, but\n\/h\/ sound is at the beginning or middle\nwords cannot end in \/h\/.\nof a word.\n57 The sound combination \/gz\/ cannot begin\na syllable or word in English\nChild hears the \/gz\/ and knows this\n(phonological constraint). This\nsound combination probably\n\/gz\/ combination can occur at the end of a\nmarks the end of a syllable or\nsyllable or word: dogs and eggs have the\nword, not the beginning.\n\/gz\/ phoneme combination at the end of\nthe word.\nWords cannot begin with the \/ps\/ sound Child hears the \/ps\/ sound\n\/ps\/ combination, but words can end with \/ps\/, combination and knows it must be\nmaps. the end of a syllable or word.\nIn English the consonant clusters sk and\nChild hears the \/sk\/ and knows this\nks cannot occur in the same places.\nsound combination probably\nWords or syllables can start or end with\n\/sk\/ marks the beginning or the end of\nsk, such as skate, and risk, but ks can only\na syllable or word. Child hears \/ks\/\n\/ks\/ occur at the end of a syllable or word: and knows the sound combination\nkicks.\nis probably the end of a word, not\nthe beginning.\nChild will not hear words with the\nYou will not find any English words with phoneme combination \/ʃ\/ and \/v\/\n\/ʃ\/ and \/v\/ combined. However, this unless they are words from another\ncombination does exist in German language that allow this pattern of\nphonotactics: schwester \/ʃvɛstəʀ\/. phonemes.\n\/ʃ\/ + other\nconsonants English does include other \/ʃ\/ Child will hear words with \/ʃ\/ and\ncombinations, such as \/ʃ\/ + \/r\/ in shrink, other consonants combined. The\nand \/ʃ\/ + \/t\/ in wished. phoneme \/ʃ\/ is challenging for\nchildren learning to spell words in\nEnglish because there are many\nways to spell \/ʃ\/.\nWhen children learn to read English words, they will encounter some letter combinations that\nare allowable for the letters p and s to be together. For example, the word psychology begins\nwith the p and s letters. At first glance it might seem as though this spelling pattern violates the\nphonotactics of the language. However, the word psychology does not begin with the phonemes\n\/ps\/. Rather, the word psychology begins with the phoneme \/s\/ followed by a diphthong vowel\n\/aI\/. It is important to remember that phonotactics is about the phoneme patterns in the syllable\nor word, not the letters or fidels (spelling).\n58 <<adapters, provide an explanation of some of the phonotactic patterns children see when they\nbegin reading and writing>>\n3.4. Phonological Processes\nPhonological processes are changes to the way individual sounds are pronounced. There are\nseveral types of phonological processes, and they can be classified according to the type of\nchange they carry out. These processes are: assimilation, dissimilation, epenthesis, elision,\nmetathesis, and reduplication.\nAssimilations: where two different sounds become more alike. When we take voicing\nassimilation in English, the plural suffix agrees in voicing with a previous stop.\nLet’s say: ‘two cats [kæts]’. Note that the \/t\/ is voiceless, so the \/s\/ is also voiceless. For ‘two\ndogs [dagz]’, the \/g\/ is voiced, therefore the \/z\/ is voiced. In both cases, the first sound\ninfluences the second sound to be voiceless and voiced, respectively. In Sidaamu Afoo \/ʔanga\/\n‘hand’ [ʔaŋga].This implies that \/n\/ is the nasal. [ŋ] is also nasal. Therefore, \/n\/ is changed into\n[ŋ] to be assimilated with \/g\/, \/g\/ and [ŋ] are similar in manner and place of articulation. In\nTigirigna \/gɨnbar\/ ‘forehead’ [gɨmbar]. \/b\/ is bilabial and also [m] is bilabial. This becomes the\nsame place of articulation in the influence of the second sound \/b\/.\n<<adapters, include examples from your mother tongue>>\nDissimilation: when two sounds that are similar become different. A dissimilation is hearer-\noriented: it makes easier for a hearer to distinguish sounds. The sounds are dissimilating\nthemselves over long period of time. This change does not occur in some Ethiopian languages,\nand occurs very infrequently in a few languages. Below are some examples of dissimilation:\nThe English word pilgrim from Latin peregrinus, with first ‘r’ dissimilating to ‘l’. In ancient\nGreek, the word for school was [sxolio], with two adjacent voiceless affricatives. In Modern\nGreek, this has become [skolio], with a fricative-stop sequence instead. Dissimilation may also\nhelp hearers to realize two segments are present, not just one.\n<<adapters, include examples from your mother tongue>>\nEpentheses: are processes where additional segments are inserted into a domain. For example,\nin German: [p] Amt [ampt] Hemd [hempt]\n[t] Gans [gants] rennst [rɛntst]\n59 In English, when we want to add plural suffix [z] to a word that already ends in [s] or [z], we\ninsert a vowel [ɨ] to break up the two high-pitched fricativesː one dress [drɛss], two dresses\n[drɛsɨz]. For instance, in Sidaamu Afoo three consonant clusters are impermissible. Thus, in\nthe stem of \/abb-\/ ‘bring’ when the suffix \/-tu\/ ‘female causative’ added it becomes \/abbtu\/. In\norder to solve such kind of unwanted three consonant clusters \/i\/ sound is inserted between the\nlast sound \/b\/ and \/t\/ and it becomes abbitu.\n<<adapters, include examples from your mother tongue>>\nElisions: are the opposite of epentheses, because they delete segments. For example, the\nAustralian language deletes final vowel (s) from words of three or more syllables:\n[yalulu] ‘flame’ deletes the last vowel sound \/u\/ and becomes [yalul].\nIn Sidaamu Afoo, \/diʔageemmo\/ ‘I will not drink’ becomes [dageemmo] when people speak\nfast. In this case, the sound \/i\/deleted in the influence of the nearest oral vowel \/a\/.\n<<adapters, include examples from your mother tongue>>\nMetathesis: is a process that switching the order of sounds. For example:\n• In Amharic: [kibrit] becomes [kirbit].\n• In Afaan Oromooː [ʔafran] ‘four of them’ becomes [ʔarfan], and [dubra] ‘girl’\nbecomes [durba].\n• In Wolaytta [gawara] ‘cat’ becomes [garawa].\nReduplication: is the process of copying word stem. For example in SidaamuAfoo:\n\/gana\/ ‘hit’ \/gangana\/ ‘hitting again and again’ becomes \/gan-gan-\/. This is an example of full\nreduplication.\nIn Amharic, \/tɘlɘk’\/ ‘big’ becomes \/tɘlalɘk’\/ means ‘very big (plural)’.\nPartial reduplication processes also exist. It means that only some phonemes or syllables of the\nword are duplicated. An example of partial reduplication is crisscross (English).\n<<adapters, include examples from your mother tongue>>\nActivity 4: Group Discussion\nWorking in groups, complete the following actions.\n60 1. Consider the Phonotactic rule chart on page 58. Why is it important for students to\nunderstand the phonotactic rules of their language when learning to read and write?\n2. Summarize each of the above phonological processes. Then, identify those processes\nfound in your MT and provide appropriate examples for each.\nChapter 3: Summary\nPhonology is a branch of linguistics that focuses on the sound system of a\nlanguage. This helps teachers to better understand the ways children use the sound\nstructure of the language in order to learn new words they hear and read. A\nphoneme is an individual sound, and a phonemic inventory can reveal all the phonemes used in\na specific language. A phone is the phonetic realization of phoneme, and allophones are all the\nphones in the phoneme family. Phonotactics is the set of rules used for joining sounds to create\nwords within a language. Children master phonotactic rules by learning the phonotocatic cues\nthey hear as the language is spoken to them. Phonological processes can change the way\nindividual phonemes are pronounced. A strong understanding on phonology and phonotactics\ncan help teachers support diverse students in language and literacy development.\nChapter 3: Review Questions\nIndividually write the answers to the following questions.\n1. Write definition of phonology using your own words.\n2. How are the following terms related: phoneme, phone, and allophone? Provide an example.\n3. Describe phonotactic rules in relation to your mother tongue.\n4. Explain phonological processes briefly and identify the processes used in your mother\ntongue.\n61 Chapter 3: Self-Assessment\nBelow are self-assessment statements. Copy them into your exercise book and put\na “√” mark on the spaces provided in the table if you agree or disagree with the\nstatements. Make sure that you read again those sections that you marked as\n“disagree.”\nStatements Agree Disagree\n1. I can define phonology.\n2. I can differentiate between phonemes, phones, and\nallophones.\n3. I can explain the role of phonotactics in learning to read and\nwrite.\n4. I can summarize phonological processes.\n62 Chapter Four: Morphology\nOutline of Contents\n4.1 Definition of Morphology\n4.2 Morphemes and Words\n4.3 Types of Morphemes\n4.3.1 Free Morphemes\n4.3.1.1 Lexical Morphemes\n4.3.1.2 Functional Morphemes\n4.3.2 Bound Morphemes\n4.3.2.1 Inflectional Morphemes\n4.3.2.2 Derivational Morphemes\n4.4 Morph and Allomorph\n4.5 Word Formation Processes\n4.6 Parts of Speech\nIntroduction\nThis chapter introduces morphology, which is the study of the internal structure of\nwords. Students will learn how to tell the difference among morphs, allomorphs,\nmorphemes and words. Types of morphemes described are: free (lexical and\nfunctional) versus bound (inflectional and derivational) morphemes. Word formation processes\nand parts of speech (noun, verb, adjective, adverb, pronoun, preposition, conjunction, and\ninterjection) are also discussed in detail.\nLearning Outcomes\nAt the end of this chapter, student teachers will be able to:\n• Define morphology.\n• Compare and contrast morphemes and words.\n• Identify the types of morphemes (free\/bound, lexical\/functional, and\nderivational\/inflectional).\n63 • Produce words with different inflections using inflectional morphemes.\n• Produce words in different categories using derivational morphemes.\n• Differentiate between morphemes, morphs, allomorphs.\n• Explain the word formation processes.\n• Identify parts of speech in their MT.\n• Create a list of sample words for each part of speech.\nTeaching and Learning Techniques\n• Interactive lecture\n• Task based approach\n• Independent study\n• Cooperative learning and peer learning\n• Group production\nAssessment Techniques\n• Brainstorming questions\n• Individual work\n• Pair and group works\n• Peer reflection\n• Project work\nInstructional Materials\n• MT Grade 1-8 text books\n• MT teacher’s guide for Grades 1-8\nActivity 1: Brainstorming\nAnswer the following question in pairs:\n1. What are the differences between the following sets of words:\ncat\/cats, able\/unable, appoint\/disappoint, will\/unwillingly?\n4.1 Definition of Morphology\nMorphology is the branch of linguistics that is concerned with the relation between meaning\nand form, within words and between words. The term morphology originated from the Greek\nlanguage as a combination of morph (meaning form) and logy (meaning to study). Therefore,\n64 morphology is the study of the internal structure of words and their meaningful parts (Fasold,\n2006). Morphological processes serve two main purposes in language variation: to create new\nwords and to modify existing words. By changing word parts, speakers and\/or writers can\nmodify the meaning of a word to be more specific, more intense, or change its grammatical\nrole in the sentence. People who read, write, and spell well are able to use their knowledge of\nmorphology to help them determine the meanings of unfamiliar words and remember how\nwords are spelled. The ability to use words well depends on a person’s exposure to words and\ntheir sound structures, grammatical categories, meanings, and spellings.\n4.2 Morphemes and Words\nA morpheme is the smallest meaningful unit of grammatical form. The word morpheme is\nmade up of two Greek morphemes, morphos means “form or structure” and eme means “an\nelement or little piece of something” (Moats, 2010). Thus, it is the smallest unit of language\nthat has meaning, and can be a whole word, a part of a word, or even a single syllable or\nphoneme. A morpheme is the smallest unit of meaning because it cannot be further broken\ndown into smaller meaningful units. A single word may be composed of one or more\nmorphemes. For example, think about these two words: tea and teas. The two words are very\nclose in spelling and meaning, but they are two different words with different meanings.\nAlthough tea and teas are both words, the -s at the end of teas provides additional meaning and\nimplies that there is more than one tea (tea + s). On the other hand, the word freeze can be\ndivided in a similar way (free + ze), but this division does not produce two meaningful units\nbecause -ze does not mean anything on its own. Therefore, freeze is a single morpheme whereas\nteas is two morphemes.\nA word is the fundamental building block of language and represents a concept, action, or\nfeeling. It is the smallest independent unit of language, does not depend on other words for\nmeaning, and can change position in a sentence (which may change the meaning of the\nsentence, but not the meaning of the word itself). All languages have words, and those words\ncan carry a little or a lot of meaning.\nBased on the number and types of morpheme(s) that words have, there are three different word\ncategories: simple, complex, and compound words.\nA. Simple words: consist of a single free morpheme like tea, flower, elephant, or spirit.\nB. Complex words: consist of more than one bound morpheme like televise or exclude,\nor a bound morpheme and one or more free morphemes like lioness, telephone, eraser,\npyromania, earthquakes.\n65 C. Compound words: consist of two free morphemes. Compound words often imply\nconcepts that can be expressed by grammatical constructions:\n1. Subject + verb earthquake (when the earth quakes)\n2. Verb + object jumprope (a rope used to play jumping games)\n3. Verb + adverb downpour (when something pours down)\n4. Subject + adjective highchair (a chair that is high)\nEvery word consists of at least one morpheme. Sometimes a word only has one morpheme.\nEvery word in every language is composed of one or more morphemes.\n4.3 Types of Morphemes\nMorphemes are able to change the meaning or grammatical function of the root word when\nthey are attached. In English, the suffix -s is added to a stem to produce a plural form of the\nword (i.e., sock becomes socks; pea becomes peas). Two main types of morphemes are free\nand bound morphemes. Free morphemes can be lexical or functional.\n4.3.1 Free Morphemes\nThese are morphemes which can occur as separate words. We said that words are independent\nforms, and a simple word only consisting of one single morpheme is a free morpheme, it is a\nword by itself. There are two types of free morphemes: lexical and functional.\n4.3.1.1 Lexical Morpheme\nAs to Yule (2006), the lexical morphemes are nouns, verbs, adjectives, and adverbs. For\nexample, house, work, tall, slow, etc. These are used for the construction of new words in a\nlanguage. This type of morpheme is easy to add new lexical morphemes to the language. They\nare treated as an ‘open’ class of words.\n4.3.1.2 Functional Morpheme\nYule (2006) discusses, the functional morphemes are prepositions, conjunctions and\ninterjections used to fulfill the grammatical aspects. Some examples in English are to, and, and\nwow. Unlike lexical, the functional morphemes do not allow adding new morphemes to the\nword, they are described as a ‘closed’ class of words.\nActivity 2: Look at the following list of words in the table and tick () either lexical\nor functional.\n66 list of words Lexical Functional\nEthiopia\nUnder\nLong\nMan\nNever\nSchool\nBetween\nMoreover\nAttract\nAnd\nLearn\nPlay\nMere\n4.3.2 Bound Morphemes\nMorphemes that must be attached to another morpheme to convey meaning\nare bound morphemes. If we break the word teas into its morphemes tea + s, we get one free\nmorpheme (tea) and one bound morpheme (-s) because it requires a free morpheme (a root\nword, such as tea) to make a word. Bound morpheme can occur at the beginning and at the end\nof a word. They are called prefixes when they appear at the beginning of a word, for example\nunhappy, dishonest, pretest, and impossible, and they are called suffixes when they appear at\nthe end of the word, for example teas, working, tested, and slowly. Based on their function,\nbound morphemes fall into two categories: inflectional and derivational morphemes.\n4.3.2.1 Inflectional Morphemes\nInflectional morphemes inflect for person, gender, number, tense, and degree. Thus boy and\nboys, for example, are two different forms of the same word. In English, the basic form of a\nword (root) with no affix is the singular form, and an affix must be added to create the plural\nform. Some words in English are irregular and a new word is used for the plural. For example,\nchild\/children; goose\/geese; etc.\nInflectional morphemes usually:\n1. Do not change the word’s class. The words big, bigger, and biggest are all adjectives.\nThe words write, writes, and writing are all verbs.\n2. Indicate relations between different words in the sentence. In the sentence ‘Lee loves\nKim,’ -s is necessary because ‘Lee love Kim,’ is not the grammatically correct form of\nthe verb love when using a single subject.\n67 3. Occur outside any derivational morphemes. Thus in approv-al-s the final -s is\ninflectional, and appears at the very end of the word, outside the derivational morpheme\n-al.\nEnglish inflectional morphemes inflect for person, number, tense, comparison, etc. as\nshown in the table below:\nInflects for: Morphemes Examples\nNoun Person\/Number\/Tense -s She loves me.\nGirls\nPossessives - ’s Student’s book.\n-s’ Students’ books.\nTense -s He works.\n-ed He worked.\nVerb\n-ing He is working.\n-en He has taken money.\nAdjective Comparative -er She is younger than me.\nSuperlatives -est He is the youngest of all.\n4.3.2.2 Derivational Morphemes\nDerivational morphemes make new words from former words, which changes the words’\ngrammatical class (part of speech) and meaning. For example, the word creation is formed\nfrom the word create by adding a morpheme (-tion) the word create is a verb and the word\ncreation is a noun.\nDerivational morphemes usually:\n1. Change the part of speech or the basic meaning of a word. Thus -ment added to a verb\nforms a noun (judge\/ment).\n2. Are selective in the types of words they can combine with, and may also have varying\neffects on meaning. Thus the suffix -hood occurs with just a few nouns such as\nbrother(hood), neighbor(hood), and knight(hood), but not with most others. e.g.,\n68 *friendhood, *daughterhood, or *candlehood. Some derivational affixes are quite\nregular in form and meaning.\n3. Typically occur \"inside\" any inflectional affixes. Thus in governments, -ment, a\nderivational suffix, occurs before -s, an inflectional suffix.\nThe morphological process of modifying a word by adding either prefixes or suffixes to a root\nis called affixation (Parker and Riley 2010). Most of the world’s languages use affixing to\nindicate grammatical information about a word or its relation to other words (Fasold, 2006).\nThe most common affixes are prefixes and suffixes. In English, words can be formed by\nderivational processes, creating new words from bound and free morphemes that have prefixes,\nsuffixes, or both. Thus, mislead has a prefix, disrespectful has both a prefix and a suffix, and\nfoolishness has two suffixes. Prefixes are affixes added to the beginning of the word. For\nexample, un- (uncover, undo, unhappy), dis- (displeased, disconnect), pre- (predetermine,\nprejudge, preview), re- (rewrite, rearrange), mis- (misbehave, misleading),il- (illegal, illogical),\netc. The other affixes are suffixes, which are added to the end of the word. For example, -er\n(singer, performer), -ist (typist, pianist), -ly (mainly, friendly, quickly), -hood (neighborhood,\nchildhood), -ful (helpful, powerful), -less (careless, restless), -ish (childish, foolish), -ism\n(criticism, nationalism),-ness (alertness, maleness), -dom (kingdom, freedom), etc. An infix is\na third type of affix which is not normally used in English, but found in some other languages.\nAs the term suggests, it is an affix that is incorporated inside another word. A circumfix is a\nset of affixes that work together and are attached to a root word in the beginning and the end\nof a word to create a new word with a slightly different meaning (Yule, 2006). Some other\nexamples of derivational morphemes include:\nNoun Adjective Derivational Morphemes\nAtom Atomic -ic\nParasite Parasitic\nBoss Bossy -y\nGreed Greedy\nReligion Religious -ous\nPoison Poisonous\nNation National -al\nVirus Viral\nNoun Verb Morphemes\n69 Capital Capitalize -ize\nFinal Finalize\nVerb Noun Morphemes\nConfirm Confirmation -ation\nInform Information\nMove Movement -ment\nGovern Government\nAdjective Verb Morphemes\nLocal Localize -ize\nFormal Formalize\nDerivational Morphology and Reading\nIt is important for student teachers to understand how children use derivational morphemes as\nthey learn to read and write. Derivational morphology is the study of the structure of derived\nword forms. A child’s knowledge of derivational morphemes develops gradually through the\nschool years. They won’t learn all of the derivational morphemes of a language in one or two\nyears of school. Learning derivational morphemes is a complex process that takes time.\nAs children learn to read and write, they must learn to notice changes in words and word\nmeanings. Many changes are the result of derivational morphemes. You learned above that\nderivational morphemes can change the part of speech of a word as well as change the word’s\nmeaning. Derivational morphemes also may change the phonetic sound structure of the original\nroot word.\nAs children learn to spell, it helps them to be aware of any sound changes that happened. There\nare different amounts of sound change that can take place when we add morphemes to a word.\n• When the root word does not have any phonetic sound changes, and the root word\nmaintains its original pronunciation, then we say it had a neutral phonetic change.\nNeutral phonetic changes in derived words are easier to pronounce and understand. An\nexample of this would be taking the root word sharp, add the suffix –ly (a derivational\nmorpheme in English), creating a new word sharply. The sounds we hear in the original\nroot word sharp are all still there in the new word, sharply, with two new sounds in the\nfinal morpheme\n–ly at the end of the word.\n• When there is a phonetic sound change in the root word after adding new morphemes\nto it, we say the root word had a non-neutral phonetic change. Non-neutral phonetic\nchanges in words are more difficult for children to pronounce correctly and to\nunderstand. For example, the sounds we hear in the root word wide are different than\nthe sounds we hear in the word width. The vowel sound has changed, and the “th”\nreplaces the “d” consonant at the end of the word.\n70 Derivational morphology helps children learn and create new words and word relationships in\ntheir language. The types of knowledge children gain by using derivational morphology are\nsummarized below:\n• Relational knowledge: Awareness that certain words are semantically related (e.g.,\nfarm, farmer) where as other words are not (e.g., doll, dollar).\n• Syntactic knowledge: Knowledge of grammatical properties of derived forms (e.g., -\nize makes realize a verb, -tion makes realization a noun).\n• Distributional knowledge: Awareness of rules governing attachment of suffixes to roots\nto produce acceptable English words (e.g., we can attach –ness to adverse (adverseness)\nbut not to against (againstness is not a word).\nA summary of the development of derivational morphology is shown in the figure below.\nBegin\napproaching\nIncreasing\nawareness of adult-level\nIncreasing constraints comprehension\nawareness of (which suffixes of derived\nAwareness of suffix’s to attach to forms;\nroot word form influence in what types of\nproductive skills\nand root’s word meaning root forms)\ncontinue to\nmeaning within and syntax\ndevelop as\nthe derived\nadults\nform\nThe following points show the many ways derivational morphology is related to reading:\n A child’s ability to define morphologically complex words is related to their word\nstructure awareness (morphological awareness).\n By 3rd grade, morphological abilities relate to word-level reading ability.\n For students in the 5th grade and up, knowing the meaning of morphologically complex\nwords is associated with their ability to read those words, and their scores on\nmorphological tasks relate to their word and passage-level reading comprehension.\n Correct pronunciation of words depends on their awareness of morphemes and rules for\nthe morphological changes (e.g., suffixes, phonetic changes)\n Older students and adults better comprehend verb and adjective suffixes than noun\nsuffixes.\nThe following points show the many ways derivational morphology is related to spelling:\n Students in the 3rd & 4th grades use simple derived forms in their narrative writing.\n71  Accurately using derived morphemes significantly relates to spelling, reading\nvocabulary, and reading comprehension.\n In middle school and beyond, performance on morphological and spelling tasks\ncontinues to increase with age\/grade level.\n Students have better spelling on base than derived forms, and on neutral than non-\nneutral derived forms of words.\n(Larson & Nipold, 2007)\nActivity 3: Pair Work\nWorking together in pairs, discuss the following list of words in the table. For each word,\nconsider whether the word has an inflectional or derivational morpheme added. Then place an\n‘X’ mark under either inflectional or derivational. Then identify the individual morphemes in\neach word. The first one has been completed for you.\nlist of words Inflectional Derivational Morphemes\nLived X live\/ed\nDecentralize\nTeacher\nDislike\nForeshadow\nStudents\nSemicolon\nGoing\nTested\nwife’s\nBiggest\narrangement\n4.4 Relation among Morpheme, Morph and Allomorph\nYou have already learned about morphemes and how they can be classified. Morphs are\ndifferent ways that morphemes can be pronounced. For example, the sound of the -s is different\nin socks and peas. The -s morpheme can have the \/z\/ sound or the \/s\/ sound. These alternative\nmorphs are called allomorphs (Lardiere, 2014).\nAn allomorph is the variation in form or sound when attaching a morpheme to different words.\nThe chart below shows examples of the allomorphs of the -s suffix, in which the variants of –\ns (the plural marker) is shown (Lardiere, 2014).\n72 \/s\/ \/z\/ \/iz\/\npuffs peas peaches\ncharts charms charges\nmyths mills misses\ncakes caves cases\nflaps flags flashes\nplates plays phrases\nGenerally, what the above table shows is that the morpheme –s in words like puffs \/s\/, peas \/z\/,\nand peaches \/iz\/ is pronounced as different morphs, and the entire family of the morpheme –s\nis considered as allomorphs. See the diagram below.\n4.5 Word Formation Processes\nThere are different ways new words are added to a language. One can quickly understand a\nnew word in a language and accept the use of different forms of that new word. This ability\nmust come from the fact that there is a lot of regularity in the word-formation processes. Some\nof the basic ways new words can be created are discussed below.\nCoinage: one of the processes of word formation in English is the invention of totally new\nwords. The most typical sources are invented trade names for commercial products that become\ngeneral words (usually without capital letters) for any version of that product. Older examples\nare aspirin, nylon, vaseline and zipper; more recent examples are kleenex, teflon, tylenol and\nxerox. Some new words come from the sciences (e.g. te(tra)-fl(uor)-on) but, after their first\ncoinage, they tend to become everyday words in the language.\nBorrowing: this is using words from other languages. Throughout its history, the English\nlanguage has adopted a large number of words from other languages, including croissant\n(French), dope (Dutch), lilac (Persian), piano (Italian), pretzel (German), sofa (Arabic), tattoo\n(Tahitian), tycoon (Japanese), yogurt (Turkish) and zebra (Bantu) (Yule, 2010). If the word\n73 was not coined by the language, then it was borrowed. For example, the English word ‘nylon’\nwas coined in another language but entered the Ethiopian languages through borrowing.\nAcronyms: acronyms are new words formed from the initial letters of a set of other words.\nThese can be forms such as CD ‘compact disk’ or VCR ‘video cassette\nrecorder’ where the pronunciation consists of saying each separate letter. More\ntypically, acronyms are pronounced as new single words, as in NATO, NASA, USAID or\nUNESCO.\n<<Adapters: Provide examples from MT for each process>>\n4.6 The Parts of Speech\nThe technical terms used to describe each part of speech are illustrated and definitions for each\nterm are listed below. Shappeck and Welch (2012) as well as Yule (2006) describe the parts of\nspeech:\nNouns are words used to refer to people (boy), objects (backpack), animals (dog), places\n(school), qualities (roughness), phenomena (earthquake) and abstract ideas (love).\nVerbs show either action (transitive or intransitive) or state of being (linking verbs). For\nexample, action verbs like: go, talk and states of being involving people and things in events\n(Jessica is ill and has a sore throat so she can’t talk or go anywhere).\nAdjectives are words used typically used to describe or to modify nouns and pronouns by\nproviding more information. For example, in the phrases like ‘happy people’, ‘large objects’,\nand ‘a strange experience’ (the italicized words show adjectives).\nAdverbs are words used, typically to modify or qualify verbs, adjectives or other adverbs by\nproviding more information. Some adverbs (really, very) are used with adjectives to modify\ninformation about things (‘Really large objects move slowly.’ ‘I had a very strange experience\nyesterday’).\nPrepositions are words which relate a noun or pronoun to the rest of the clause in the sentence\nby providing information about time (at five o’clock, in the morning), place (on the table, near\nthe window) and other connections (with a knife, without a thought) involving actions and\nthings.\n74 Pronouns are words used in place of a noun, like she, herself, they, it, you, etc. Pronouns\ntypically refer to people and things already known or previously discussed in the sentence or\nparagraph. (She talks to herself. They said it belonged to you.).\nConjunctions are words like and, but, because, and when that are used to make connections\nand indicate relationships between events. For example, the italicized words are conjunctions:\n‘Her husband was so sweet and he helped her a lot because she couldn’t do much when she\nwas pregnant’.\nInterjections are words used to express emotions, feelings, etc. Some examples include: Boo!\nOops! Ouch! Wow! and Oh!\nActivity 4: Group work\nRead the following paragraph carefully and list up to 3 words for each part of speech\ndiscussed above. The first word has been added for you.\nOnce upon a time, a clever monkey lived in a tree that bore juicy, red rose apples. One day, a\ncrocodile swam up to that tree and told the monkey that he was in search of food as he was\nvery hungry. The monkey offered him a few rose apples. “Yum!” The crocodile enjoyed them\nvery much. The crocodile returned the next day. Soon the two became very good friends. The\ncrocodile told the monkey that he had a wife and that they lived on the other side of the river.\nSo the kind monkey offered him some extra rose apples to take home to his wife. The\ncrocodile’s wife loved the rose apples and said “Wow! How beautiful is this!” Then, she made\nher husband promise to get her some every day…\nNouns monkey\nVerbs\nAdjectives\nAdverbs\nPrepositions\nPronouns\nConjunctions\nInterjections\n75 Project Work 2: Analysis of Primary School MT Curriculum on\nMorphological Issues or Contents\nFind grade 5-8 MT materials. The instructor will assign one of the following topics to each\ngroup: (a) morphemes, (b) word formation processes, or (c) parts of speech. Each group will\nobserve how their topic is addressed in the curriculum, and then present two pages report to\nthe class. Notice: In the report, include the following points:\n• The objective that addresses the selected topic,\n• Examples and activities in which the topic is exercised, and\n• Lessons topic, day, week, and semester in which the topic is practiced.\nChapter 4: Summary\nMorphology is the study of the internal structure of words. It examines the way word parts are\ncombined to make words. All languages have words that are made of morphemes. Every word\nis made up of at least one morpheme, and can include several morphemes. Some morphemes\ncan be words by themselves - these are called free morphemes. Other morphemes cannot be\nwords by themselves, but are added to other morphemes to make words. These include prefixes,\nsuffixes, or infixes, and are called bound morphemes. Words can be simple, compound, or\ncomplex, based on how many morphemes are used to make the word, and the type of the\nmorphemes used to make the word. Free morphemes can be lexical or functional. Lexical\nmorphemes can have other morphemes attached to make compound or complex words,\nwhereas functional morphemes cannot have other morphemes added to them. Bound\nmorphemes can be inflectional or derivational. Inflectional morphemes inflect a word to change\nits tense, number, gender, comparability, etc. Derivational morphemes change a word’s part of\nspeech. For example, a noun can be turned into an adjective, an adjective can be turned into a\nnoun, etc. Morphs are the specific ways that morphemes are pronounced based on the other\nmorphemes and phonemes in the word. Allomorphs make up the family of different ways the\nsame morpheme is written and is pronounced when added to various words. Although they\nmay sound or appear slightly different, allomorphs carry the same meaning. Words can be\nadded to a language different ways, called word formation processes. Some of the basic word\nformation processes are: coinage, borrowing, and acronyms. English has eight parts of speech:\nnoun, verb, adjective, adverb, pronoun, preposition, conjunction, and interjection.\n76 Chapter 4: Review Questions\nIndividually write the answers to the following questions.\n1. What is morphology?\n2. Compare and contrast the terms: word and morpheme.\n3. Compare and contrast free\/bound, lexical\/functional, and derivational\/inflectional\nmorphemes.\n4. Describe how inflectional morphemes are used and provide 5 examples of words using\ninflectional morphemes.\n5. Describe how derivational morphemes are used and provide 5 examples of words using\nderivational morphemes.\n6. Discuss the ways in which new words in a language are created and added to the\nlanguage.\n7. List the parts of speech and give 3 examples for each.\nChapter 4: Self-Assessment\nBelow are self-assessment statements. Copy them into your exercise book and put a “√”\ncheckmark on the spaces provided in the table if you agree or if you disagree with the statements.\nMake sure that you read again those sections that you marked as “disagree.”\nStatement Agree Disagree\n1. I can define morphology.\n2. I can compare and contrast morphemes and words.\n3. I can identify types of morphemes (free\/bound,\nlexical\/functional, and derivational\/inflectional).\n77 4. I can produce words with different inflections using\ninflectional morphemes.\n5. I can produce words in different categories using derivational\nmorphemes.\n6. I can differentiate between morphemes, morphs, allomorphs.\n7. I can explain the word formation processes.\n8. I can identify parts of speech in my mother tongue.\n9. I can create a list of sample words for each part of speech.\n78 Chapter 5: Syntax\nOutline of Contents\n5.1. Definition of Syntax\n5.2. Sentences\n5.2.1. Word order in a sentence\n5.2.2. Structure of a sentence\n5.3. Phrases\n5.3.1. Noun phrase\n5.3.2. Verb phrase\n5.3.3. Adjective phrase\n5.3.4. Prepositional phrase\n5.3.5. Adverb phrase\n5.4. Clauses\n5.4.1. Independent Clauses\n5.4.2. Dependent Clauses\n5.5. Tense and Voice\n5.5.1. Tense\n5.5.2. Voice\nINTRODUCTION\nThis last chapter addresses syntax. Previous chapters have discussed linguistics at the sound\nand individual word levels. Syntax focuses on sentence structure and order of sentence parts.\nThese sentence parts include phrases (such as noun phrases, verb phrases, etc.) and clauses\n(such as independent and dependent clauses). Overall syntax patterns can be observed using\ntree diagrams. In considering discourse, a sentence’s tense provides more information about\nwhen actions take place (in the past, present, or future), and voice sets the emotional tone of\nthe conversation or written text.\n79 LEARNING OUTCOMES\nAt the end of this chapter, student teacher will be able to:\n• Define syntax.\n• Explain the word order of their MT for different sentence types.\n• Describe the types of phrases used in their MT.\n• Illustrate the structure of phrases in sentences using tree diagrams.\n• Describe the types of clauses used in their MT.\n• Explain the difference between dependent and independent clauses.\n• Construct sentences with different tenses.\n• Construct sentences in both active and passive voices.\nTEACHING AND LEARNING TECHNIQUES\n• Interactive lecture\n• Independent study\n• Group discussion\n• Cooperative and peer learning\nASSESSMENT TECHNIQUES\n• Question and answer\n• Individual work, pair and group work\n• Reflection\nInstructional Materials\n• Primary MT materials\n80 5.1. SYNTAX\nSyntax is the study of the structure of language, particularly the way in which words can be\nput together to create meaningful phrases, clauses, or sentences. Syntax is different from\nmorphology because it deals with how words are combined to make phrases and sentences.\nRemember that morphology deals with how word parts are combined to make words. Teachers\nneed to understand how words can be combined to create phrases and sentences that make\nsense to the person reading or listening. In order to do this, they must understand how words\nand phrases are classified into categories or parts of speech.\n5.2 SENTENCES\nA sentence is a group of words that communicate a complete idea. There are two basic and\nnecessary parts for a sentence to be complete: the subject and the predicate. The subject\nidentifies the topic of the sentence. The predicate provides information about the topic of the\nsentence. The subject must include a noun, a noun phrase (NP) or a clause that acts like a noun.\nThe predicate must include a verb.\n<<consider how to adapt this if a single word can include multiple parts of speech>>\nIn the example sentence, ‘The young boy happily eats some shiro with his family’, ‘The young\nboy’ is the subject and ‘happily eats some shiro with his family’ is the predicate.\nCompound Subjects\nSentences can have compound subjects. A compound subject is when there is more than one\nnoun in the subject. For example, the sentence below has a compound subject:\nNotice that the verb eats must be changed to eat for English subject-verb agreement and the\nword his must be changed to their in the predicate to reflect more than one person in the subject\n(boy and sister).\n81 Compound Predicates\nSentences can also have compound predicates. A compound predicate is when there is more\nthan one action taking place in the predicate. For example, the sentence below has a compound\npredicate:\nNotice that there are now two verbs in the predicate: makes and eats, reflecting more than one\naction taking place in the predicate. A sentence can also have both a compound subject and a\ncompound predicate.\nThe sentence can be sub-divided into different categories based on grammatical structure or\nfunction. Since the focus of this unit is syntax, we will focus on the structure and parts of\nsentences, particularly the simple sentence.\n5.2.1 WORD ORDER OF A SENTENCE\nWord order refers to how the words are organized and sequenced in a sentence. Basic word\norder of English is Subject + Verb + Object (S+V+O). The object is the item which receives\nthe action from the verb. In English, this look like: She kicks the ball (S – She, V – kicks -\nObject –ball. In Amharic, the basic word order is Subject + Object + Verb (S + O + V). For\nexample: Macchiato ifeligalhu (S – implied, O – macchiato, V – ifeligalhu). Beyond the basic\nstructure of the sentence, modifying words (adjectives and adverbs) usually follow a certain\norder.\n1. Order of adjectives\nIn a sentence we may have more than one adjective at a time. At this time they should follow\nthe following order.\nAdjective of quantity, quality, size, age, shape, color, proper adjectives, purpose.\nE.g., ‘Two (quantity) beautiful (quality) big (size) old (age) round-faced (shape) black (color)\nEthiopian (proper) women were training to drive a car.’\n2. Order of adverbs\n82 In a descriptive sentence, there may be more than one adverb, although we rarely see sentences\nwith more than two adverbs modifying a verb. At this time they should follow the following\norder;\nAdverb of manner, place, frequency, time, purpose.\nE.g., ‘He was working quickly (manner) all day (time).’ or ‘She quietly (manner) walked away\n(place) this morning (time).’\n5.2.2 STRUCTURE OF A SENTENCE\nThere are five basic sentence structures in English. These are:\nA. Subject + verb.\nE.g. She reads; She sings.\nB. Subject + verb + noun (object).\nE.g. She cooks a meal; She wrote a letter.\nIn the above sentences the nouns meal and letter are used as an object because the verbs are\ntransitive.\nC. Subject + verb + adjective.\nE.g. She is beautiful; They are tall.\nD. Subject + verb + adverb.\nE.g. They speak clearly; She writes quickly.\nE. Subject + verb + noun (compliment).\nE.g. They are teachers; He is a teacher.\nIn the above sentence the nouns teachers and teacher are used as a compliment since the verbs\nare not verbs of action.\nActivity 1: Group Work\n83 In small groups, read the following sentences. The words in each sentence, which have been\ntaken from primary MT text books, are not in the correct order. Rearrange the words in each\nsentence to reflect appropriate word order.\n1. Xx\n2. Xx\n3. Xx\n4. Xx\n5. Xx\n<<Adaptors: Choose 5 example sentences from your respective primary MT text books, grades\n5-8. Present the sentences with the words out of order.>>\n5.3 PHRASES\nIn the English language, the main parts of speech are: nouns, verbs, adjectives, adverbs, and\nprepositions. Understanding these main word categories help us to see the types of phrases\npossible in the language. A phrase is one or more words that substitute for a part of speech. For\nexample, noun phrases act as nouns, verb phrases act as verbs, and adjective phrases act as\nadjectives.\n5.3.1 Noun Phrase\nA noun phrase is a phrase made up of a noun or a noun plus other words, such as a determiner\n(a, this, those, etc) and an adjective or adjective phrase. Noun phrases can be the subject or the\nobject of a sentence. All noun phrases must include at least one noun.\nExamples of noun phrases are underlined in these sentences:\n1. She came at 8:00 p.m.\n2. The dog is mine.\n3. She went with the small boy.\nThe underlined parts of the above sentences are noun phrases. The structure of the noun phrases\ncan be shown in tree diagrams in the following ways.\n84 5.3.2 VERB PHRASE\nA verb phrase is a phrase which can be constructed using a verb or using a verb plus other\nwords or phrases. The entire predicate of a sentence is considered a full verb phrase.\nExamples of verb phrases are underlined in the sentences below:\n1. They ran.\n2. I saw the man with the telescope.\n3. The ball is on the table.\nThe underlined parts of the above sentences are verb phrases. The structure of the verb phrases\ncan be shown in a tree diagrams in the following ways.\n5.3.3 ADJECTIVE PHRASE\nAn adjective phrase is a phrase which is created using an adjective or using an adjective plus\nanother adjective or an adjective plus an adverb.\nExamples of adjective phrases are underlined in the sentences below:\n1. The big man hit me.\n2. The big brown fox was dead.\n3. The bag is extremely expensive.\nThe underlined parts of the above sentences are adjective phrases. The structure of the adjective\nphrase can be shown in tree diagrams in the following ways.\n85 5.3.4 PREPOSITIONAL PHRASE\nA prepositional phrase is a phrase which can be constructed using a preposition plus a noun\nphrase.\nExamples of prepositional phrases are underlined in the sentences below:\n1. I saw the man with the telescope.\n2. I found the ball under the table.\nThe underlined parts of the above sentences are prepositional phrases. The structure of the\nprepositional phrases can be shown in a tree diagrams in the following ways.\n5.3.5 ADVERB PHRASE\nAn adverb phrase is a phrase which can be constructed using an adverb or using an adverb plus\nother words such as another adverb or a noun phrase.\nExample:\n1. The large dog barked loudly and often.\n2. He came after the sunset.\nThe phrase “after the sunset” is taken as an adverbial clause because it explained when\nthe action took place.\n86 Tree diagram of a sentence\nAll sentences in English are required to have at least one noun phrase and one verb phrase. For\nexample, the sentence (S), ‘The boy eats,’ is made up of one noun phrase (NP) ‘The boy’ and\none verb phrase (VP) ‘eats’. The following diagrams illustrate how various phrases fit together\nto create sentences.\nIn the sentence ‘The boy eats,’ the verb phrase is made up of only one word - the verb eats. We\ncan add more information to the sentence by adding a noun phrase to say what the boy is eating,\nwhich becomes part of the verb phrase.\nNext, we can add more information to the sentence if we want to explain more about where or\nhow the eating is happening by adding a prepositional phrase (PP), which also becomes part of\nthe main verb phrase (VP).\n87 We can further expand the sentence to include an adverb phrase (AdvP) and an adjective phrase\n(AP).\nThese are tree diagrams of the phrase and sentence structure of the English language. These\ndiagrams (above) are of a simple sentence that has been expanded with phrases. Each type of\nphrase has a specific function in the sentence and is dependent upon other phrases to create a\nmeaningful sentence.\nActivity 2: Pair Work\nWork with a partner to identify the type of each phrase underlined in the following\nsentences. Then, use a tree diagram to show the structure of each sentence.\n1. The young lady terminated her contract.\n2. His mother bought a very expensive car.\n3. This bag is very heavy.\n4. The fox jumped over the lazy dogs.\n5. The house is extremely expensive.\n6. xx\n7. xx\n8. xx\n9. xx\n10. xx\n88 <<adaptors: add five more sentences relevant to your region.>>\n5.4 CLAUSES\nA clause is a group of words or phrases that contains both a subject and a predicate. Phrases\ncan contain nouns and verbs, but unlike clauses, phrases do not contain both a subject and a\npredicate. A sentence conveys a complete idea, but like phrases, clauses are smaller parts of a\nsentence.\n5.4.1 INDEPENDENT CLAUSES\nSome clauses express a complete idea and are complete sentences by themselves. These are\ncalled independent clauses. The sentence above, ‘The young boy happily eats some shiro with\nhis family,’ is an independent clause because it expresses a complete idea and can be a sentence\nby itself.\nOther examples of independent clauses include:\nlife happens\nI am happy to be a teacher\nyou’ll surely pass the exam\nI have no regrets in my life\n<<Add or change these to culturally appropriate examples if necessary>>\nAll of the clauses above are complete thoughts, and are therefore independent clauses and can\nbe written as sentences (with a capitalized first word and a punctuation mark).\n5.4.2 DEPENDENT CLAUSES\nAnother type of clause has a subject and a predicate, but it does not express a complete idea\nand cannot be a sentence by itself. This is called a dependent clause, and it begins with a\ncoordinating conjunction (see the list of conjunctions in section 5.3). The clause ‘because the\nboy happily eats some shiro with his family,’ is not a complete thought since the word because\nimplies that the boy happily eating shiro with his family is the effect of some other action.\nOther examples of dependent clauses include:\nwhen the teacher arrives\nbecause I can’t wait any longer\n89 if you can work on Sunday\nthat I sold yesterday\nif it is on sale\nwhere my family lives\n<<add or change these to culturally appropriate examples if necessary>>\nThe clauses above leave the reader without some information. These clauses do not express\ncomplete thoughts and cannot be sentences by themselves. This is why they are called\ndependent clauses – because they depend on another part of the sentence.\nActivity 3: Individual Work\nIdentify the type of the following clauses as dependent or independent. The first one has been\ncompleted for you.\n1. if you can reach on time ___dependent______________\n2. I am interested to be your friend _________________________\n3. since he started working nights _________________________\n4. he doesn't see much of his kids _________________________\n5. while Amare sat inside watching television_________________________\n6. when I was in Addis _________________________\n7. the team had fallen behind by ten points _________________________\n8. what I told you yesterday _________________________\n5.5 TENSE AND VOICE\nActivity 4: Brainstorming\nLook at the following sentences. What is the same across all sentences, and what is\ndifferent between them?\n1. She went to the market last Saturday.\n2. She will go to the market on Saturday.\n3. She goes to the market every Saturday.\n90 5.5.1 TENSE\nTense expresses the time at which an event take place (e.g., past, present, future). Klein (1994)\ndescribes tense as the relation between reference time (the time that is relevant in the\nconversation) and speech time (the time when the utterance takes place). Relative to the speech\ntime, the reference time may precede it (past tense: I worked), coincide with it (present tense:\nI am working), or follow it (future tense: I will work). Tense is determined by when the action\ntook place in relation to the speech time. The three main tenses are: the present, past and future.\nEach of the three main types of tenses can be further categorized in to four sub sections\ndepending on whether the action is in progress or completed.\nI. THE PRESENT TENSE\nWe use the present tense when the reference time coincides with the speech time. There are\nfour types of the present tense. These are\nA. The simple present tense: It is used to express things that are always true, things that we\ndo regularly and to talk about our likes and dislikes.\nExamples: [infinitive \/3rd person + verb s]\n1. I live in Addis Ababa.\n2. She loves her mother.\n3. He watches TV every day.\nB. Present continuous tense: is used to talk about things you are doing now.\nExamples: [is\/am\/are + present participle]\n1. I am writing.\n2. She is speaking.\n3. They are studying English.\nC. Present perfect tense: is used to talk about finished actions or past events which are\nconnected to the present time.\nExamples: [has\/have + past participle]\n1. I have gotten back from London.\n2. Sara has lost her ticket.\n3. We have eaten our lunch.\n91 D. Present perfect continuous tense: it is used to describe a state or action which began in\nthe past and is still continuing or is about to finish.\nExamples: form [have\/has + been + present participle]\n1. I have been travelling all night.\n2. He has been living in Bristol for two years.\nII. THE PAST TENSE\nThe past tense describes a past event or a state of being. We use the past tense when the\nreference time proceeds the speech time. The past tense is categorized further depending on\nwhether the action was in progress or has been completed. The four past tenses are:\nA. Simple past tense: it is used to describe a completed activity that started in the past and\nended in the past.\nExamples: [verb + -ed] or irregular verbs (I ate)\n1. He played with his friend yesterday.\n2. She watched a movie last night.\n3. They ate their lunch.\nB. Past continuous tense: it is used to describe an on-going activity in the past.\nExamples: [was\/ were + present participle]\n1. It was raining when she came home.\n2. He was painting the door when a bird struck the window.\n3. They were eating dinner when she arrived.\nC. Past perfect tense: it is used to emphasize that an action was completed before another took\nplace.\nExample: [had + past participle]\n1. Sara had taken the pill before we reached her.\n2. George had repaired many cars before he received his mechanic's license.\n3. We had done our home works before we slept.\nD. Past perfect continuous: it is used to show that an on-going action in the past has ended.\nExamples: [had been + present participle]\n92 1. She had been cleaning the room when we arrived home.\n2. He had been painting the door before the dog scratched it.\nIII. THE FUTURE TENSE\nThe future tense expresses a future event or a future state of being. We use the future tense\nwhen the reference time follows the speech time. The future tense is categorized further\ndepending on whether the action will be in progress or will be completed. The four future tenses\nare:\nA. Simple future tense: it is used to express an action that will occur in the future.\nExamples: [will + verb]\n1. I will go.\n2. We will celebrate our anniversary by visiting the lake.\nB. Future continuous tense: it is used to talk about an on-going action that will occur in the\nfuture.\nExamples: [will be + present participle]\n1. I will be visiting Axum for the next three weeks.\n2. The singers will be performing at the National theatre for the next four hours.\nC. Future perfect tense: it is used to describe an action that will have been completed at some\npoint in the future.\nExamples: [will have + past participle]\n1. We will have finished the meal by the time you arrive.\n2. They will have done it by the end of the month.\nD. Future perfect continuous: it is used for an on-going action that will be completed at some\nspecified time in the future.\nExample: [will have been + present participle]\n1. In July next year, you will have been studying for 3 years.\n2. I will have been playing for 2 hours by breakfast.\n93 Activity 5: Individual Work\nIdentify the tense of the following sentences:\n1. I went home with my son. _________________________\n2. I am eating my lunch. _________________________\n3. It was raining the whole night. _________________________\n4. We will have finished by tomorrow. _________________________\n5. My mother usually goes to church. _________________________\n5.5.2 VOICE\nActivity 6: Brainstorming\nLook at the following sentences. What is the difference between the following two\nsentences?\n1. Abebe killed a Lion.\n2. A lion was killed by Abebe.\nThere are two special forms for verbs called voice: These are the active voice and the passive\nvoice.\nI. THE ACTIVE VOICE\nThis is the voice that we use most of the time. You are probably already familiar with the active\nvoice. In the active voice, the object receives the action of the verb. We sometimes call it the\n“normal” voice.\nActive subject verb object\n1. Cats eat fish.\n2. Almaz bought a car.\n3. Amare wrote a letter.\n94 In the above table, the action of eating, buying and writing are laid on the objects fish, car and\nletter respectively.\nII. PASSIVE VOICE\nThe passive voice is less usual than the active voice. The active voice is the \"normal\" voice.\nBut sometimes we use the passive voice.\nUse of the Passive Voice\nWe use the passive voice when we want to make the object more important or when we do not\nknow the subject.\nLet’s elaborate these using the following examples\n1. Abebe killed a lion.(A)\n The lion was killed by Abebe.(P) the object (lion) is more important\n2. Someone has stolen my wallet.(A)\n My wallet has been stolen. (P) We do not know the subject\n3. Someone broke the window.(A)\n The window has been broken.(P) We do not know the subject\n4. They pay me in dollars. (A)\n I am paid in dollars.(P) the object (dollars) is more important\nThe structure of the passive voice is very simple: Subject + auxiliary verb (be) + main verb\n(past participle). The main verb is always in its past participle form. In the above examples the\nverbs killed, stolen, broken and paid are in their past participle forms. Here are some more\nexamples passive with most of the possible tenses:\nInfinitive to be washed\nsimple present It is washed.\nPast It was washed.\nfuture It will be washed.\ncontinuous present It is being washed.\n95 Past It was being washed.\nfuture It will be being washed.\nperfect simple present It has been washed.\nPast It had been washed.\nfuture It will have been washed.\nperfect continuous present It has been being washed.\nPast It had been being washed.\nfuture It will have been being washed.\nActivity 7: Pair Work\nWork together to identify the voice of the following sentences as active or passive. The\nfirst one has been done for you.\n1. We bought some clothes. ___active_________________\n2. The window was broken. _________________________\n3. It will have been eaten. _________________________\n4. He drinks some water. _________________________\n5. I will give him the documents. _________________________\n6. He is taken to jail. _________________________\nChapter 5: Summary\nThe term syntax refers to the way sentences are built from words, phrases, and clauses. Every\nsentence in the English language must have at least one noun phrase (NP) and one verb phrase\n(VP). They can also include adjective phrases (AP), adverb phrases (AdvP), and prepositional\n96 phrases (PP). Tree diagrams illustrate how the phrases fit together to form sentences. The\nstructure of a sentence contains at list two phrases that are NP and VP. And in English, sentence\nstructure typically follows the order S+ V+ O. A noun phrase and a verb phrase can be joined\nto create a clause. The two types of clauses are independent and dependent clauses. An\nindependent clause can stand alone to be a sentence because it expresses a complete idea,\nwhereas a dependent clause lacks some information, it does not express complete idea, and\ncannot stand by itself to be a sentences.\nTense expresses the time at which an event take place. Tense is determined by when the action\ntook place in relation to the speech time. The three main tenses are: the present, past and future.\nEach of the types of tenses can be further classified in to four sub categories based on whether\nthey are completed or in progress. Sentences can change their meanings based on the structural\nchange made on them. When the position of the subject of an active sentence takes the position\nof object (to stress on the action done rather than the doer of the action), the voice of the\nsentence changes from active to passive.\nChapter 5: Review Questions\nIndividually write the answers to the following questions.\n1. Define syntax in your own words.\n2. List the types of phrases and provide examples for each.\n3. Explain the difference between dependent and independent clauses and provide\nappropriate examples from your MT.\n4. Write a simple sentence in your mother tongue and indicate its subject and predicate\nseparately.\n5. Construct three sentences with adjective and adverb phrases. Then, diagram the\nsentences and separate the words into their parts of speech.\n6. Construct a noun phrase, verb phrase, adjectival phrase, adverb phrase, and\nprepositional phrase.\n7. Construct 3 sentences in active voice. Then, change those sentences to passive voice.\nDiscuss what makes the active and passive sentences different.\n8. Construct 3 sentences to demonstrate the present, past and future tenses.\n97 Chapter 5: Self-Assessment\nBelow are self-assessment statements. Copy them into your exercise book and put\na “√” checkmark on the spaces provided in the table if you agree or if you disagree\nwith the statements on the left. Make sure that you read again those sections that\nyou marked as “disagree.”\nStatements Agree Disagree\n1. I can define syntax.\n2. I can explain word order of my MT for different sentence\ntypes.\n3. I can describe the types of phrases used in my MT.\n4. I can illustrate the structure of phrases in sentences using\ntree diagrams.\n5. I can describe the types of clauses used in my MT.\n6. I can explain the difference between dependent and\nindependent of clauses.\n7. I can construct sentences with different tenses.\n8. I can construct sentences in both active and passive\nvoices.\n98 Module Summary\nThis module, Introduction to Language and Linguistics, is designed to strengthen teacher\neducators’ ability to teach reading skills in Ethiopian primary grade classrooms. Basically, this\nmodule helps both CTE instructors and student teachers to understand the theoretical\nbackground of language and linguistics. Having these concepts in mind, the teacher educators\ncan associate this knowledge to content from other courses related to literary skills.\nIn social contexts, language is used as a major tool serving many functions. Language varies\nacross locations and the social identities of its speakers, and language plays a great role in\nacademic institutions. Language families in Ethiopia fall under the Afro-Asiatic and Nilo-\nSaharan families. In academic situations, the elements of phonetics, phonology, morphology,\nand syntax are the main properties of human languages which help for teaching reading and\nwriting in primary school.\nPhonetics is the science of speech sounds, and it plays a major role in language learning.\nUnderstanding phonetics is important for multilingual learners and for teaching reading and\nwriting across languages and to diverse students. Speech sounds of languages can be classified\ninto consonants and vowels. These sounds are made by coordinating the active and passive\narticulatory organs.\nAnother science which deals with sounds is phonology. Understanding phonological properties\nin languages helps teachers to better understand how to use the sound structure of the language\nwhen helping students build literacy skills.\nMorphology is the study of the internal structure of words and examines the meaningful parts\nof words. An understanding of morphology will help teachers know how to instruct the new\nprimary MT material, such as analyzing word parts. Furthermore, morphology knowledge\nhelps the learner to understand distinct parts those can be found in a word. These parts are\nmorphemes: free (inflectional and derivational) and bound (prefix, suffix, infix, and circumfix).\nThe morphology concepts help the leaners to conceptualize word formation processes.\nSyntax refers to how sentences are structured from words, phrases, and clauses. The structure\nof a sentence contains at least one noun phrase and one verb phrase. English typically follows\na S+ V+O sentence structure. Sentences can be categorized depending on the number and types\nof clauses they contain. Independent clauses can stand alone to be sentences because they\n99 "}