{"text":"LANGUAGE AS A TOOL FOR COMMUNICATION AND\nCULTURAL REALITY DISCLOSER 1\nSitti Rabiah 2\nFaculty of Letter\nUniversitas Muslim Indonesia, Makassar\nAbstract\nLanguage is a communication tool used by everyone in their daily life as a means to convey information\nand arguments to others. In this case, the language cannot be separated from culture because language\nrepresent its nation and has close relation to the attitude or behavior of groups of speakers of the\nlanguages. The role of language as a tool to express culture reality can be seen from: 1) Language is part\nof culture, 2) Even the language and the culture is in different, but have a very close relationship, 3)\nLanguage is strongly influenced by culture, and 4) Language significantly influence culture and way of\nthinking of people living within. In the communication, language used by people is influence their culture\nor vice versa. If used parables, the culture and language like Siamese twins, the two things that cannot be\nseparated. Or as a coin; side one is the language and the other is culture.\nKeywords: Language, Communication, Cultural reality\nAbstrak\nBahasa merupakan alat komunikasi yang digunakan oleh setiap orang dalam kesehariannya sebagai\nsarana untuk menyampaikan informasi maupun argumen kepada orang lain. Dalam hal ini, Bahasa juga\ntidak terlepas dengan Budaya, dikarenakan Bahasa menunjukkan bangsa dan sangat erat kaitannya\ndengan sikap atau perilaku kelompok masyarakat penutur bahasa tersebut. Peran Bahasa sebagai\npengungkap realitas Budaya ditunjukkan dari: 1) Bahasa merupakan bagian dari kebudayaan, 2) Bahasa\ndan kebudayaan merupakan hal yang berbeda, namun mempunyai hubungan yang sangat erat, 3) Bahasa\nsangat dipengaruhi oleh kebudayaan, dan 4) Bahasa sangat mempengaruhi kebudayaan dan cara\nberpikir. Dalam berkomunikasi inilah, Bahasa yang digunakan seseorang dipengaruhi atau\nmempengaruhi budaya pengguna bahasa tersebut. Jika digunakan perumpamaan, Bahasa dengan\nkebudayaan bagaikan bayi kembar siam, yakni dua hal yang tidak bisa dipisahkan. Atau sebagai\nsekeping mata uang; sisi yang satu adalah bahasa dan sisi yang lain adalah kebudayaan.\nKata Kunci: Bahasa, Komunikasi, Realitas Budaya\nA. Introduction\nLanguage indicates each of its nation, a parable once say so. If its meaning\npondered deeper, may make us wiser in understanding and addressing all cases that\nlinked between language and attitude or behavior of groups of speakers of the\nlanguages. (Alwi, 2004:21). Wisdom is likely to strengthen believe about the role of\nlanguage in the development of the culture.\n1 Presented in 1st International Conference on Media, Communication and Culture “Rethinking\nMulticulturalism: Media in Multicultural Society” organized by Universitas Muhammadiyah\nYogyakarta and Universiti Sains Malaysia on November, 7th - 8th 2012 in Universitas\nMuhammadiyah Yogyakarta, Indonesia.\n2 https:\/\/orcid.org\/0000-0002-1690-0025. Corresponding author: sitti.rabiah@umi.ac.id \/\nsittirabiah25@gmail.com\n1 There are several theories on the relationship of language and culture. Some say\nthat even language is part of culture but they are different, but in terms of relation they\nare very close each other, so it cannot be separated. Some say that the language is\nstrongly influenced by culture, so that all things in the culture will be reflected in the\nlanguage. Conversely, there is also a saying that language influence culture, and the\nhuman or their speakers way of thinking. This paper intended to discuss the nature of\nlanguage, the nature of culture and how language can express the cultural reality of the\nlanguage users.\nB. The Nature of Language\nVarious definition of the language has been proposed by linguists. Language is a\nform, not the substance (in Chaer Lyons 1995:60). While Chaer (1995:14) mentions the\ncharacteristics that constitute the essence of language as a symbol of the sound system,\nare arbitrary, productive, dynamic, diverse, and humane.\nLanguage as a system, which means that formed by a number of components\nthat are fixed and can be patterned. As a system, in addition to the systematic language\nare also systemic. Systematic meaning, language arranged according to a certain pattern,\nnot arranged randomly or arbitrarily. While systematic means that language is a single\nsystem, but rather consists of several subsystems that differ from other languages.\nLanguage subsystem consists of phonology, morphology, syntax, and lexicon.\nTherefore the language also commonly considered unique but universal at the same\ntime. Unique means having the characteristics or properties not possessed by other\nlanguages, while universal means having the same traits that exist in all languages.\nWhen compared with animals that have a variety of forms of communication, so\npeople just use the language. Basically there are two types of animal communication\nsystems: first, communication systems found in the bees. The second all communication\nsystems exist in monkeys and birds. Human languages have something similar to this\ncommunication, but has a major difference compared to both (Gee, 1993: 2). Bees can\ncommunicate the presence of nectars to their group members, like the distance of the\nnectars, direction to the location, and the number of nectar found by using a particular\ndance. Gee called the bee dance to communicate the presence of the nectar as point-by-\npoint system. In addition to bees, monkeys and birds also have a way to communicate.\nVervet African apes are capable to produce 36 kinds of sound for various situations.\nAmong them was a different sound for the same situation, so vervet communication\nsystem able to deliver 22 kinds of messages. In addition, the birds also have a way to\ncommunicate even only consist of a very limited vocabulary to deliver messages.\nFurthermore, Chaer and Agustina (2004:26-29) suggests 16 kinds of distinctive\nhuman language, as follows:\n1) The language uses vowel auditory pathway. In this case, there are similarities\nbetween communication systems owned by many animals, including crickets,\nfrogs, and birds.\n2 2) Language can be spread in all directions; yet receptions are directed. Spoken\nlanguage sounds can be heard in all directions due to noise or sounds of\nlanguage that propagates through the air, but the receiver or listener can tell\nexactly from which direction the sounds of language came.\n3) The language symbol in the form of sound that can be disappear once\npronounced. This is in contrast with another symbol, such as the footprints of\nanimals and heroic statues that can last for long time. Because of the rapid loss,\npeople always trying to preserve this symbol of language sounds into written\nform and sound recordings.\n4) Participants in the communication with language can communicate to each\nother. This means that a speaker can be a symbol sender and as symbol recipient\nat the same time.\n5) The language symbol can be a complete feedback. The speaker as the sender can\nhear their own language symbols. Whereas, in some kinetic communication\n(movement) and visual (sight) as the bee dance, the sender information is not\nable to see the important parts of the dance.\n6) Communication languages has its own specialty. Humans can talk without\nhaving to do physical movements to support the communication process.\nWhereas communication in bees they physically forced to dance in order to\ndeliver messages they intended to.\n7) Sound symbols in communication language means and refers to certain things.\nFor example the word of horse refers to a type of quadrupeds that can be ridden.\nSentence “Chaedar kick the ball” mean someone named Chaedar doing actions\nthat hit the ball with his leg.\n8) The relationship between language symbol with its meaning is not determined\nby the presence of a bond between the two, but is determined by agreement or\nconvention between the speakers of the language.\n9) language as a tool of human communication can be separated into certain unit,\ni.e sentences, words, morphemes, and phonemes.\n10) Reference or something being discussed in the language not always be at the\npresent place and time. Human language can be used for something in the past,\nin the future, or are in distant places. Even that only in fantasy.\n11) Language is open. It means, symbols of speech can be made according to the\nhuman needs. While the language of animals is closed, unchanged from the first.\n12) Skill and finesse to master the rules and customs of human language derived\nfrom learning process, not through genes inborn. Animal language generally be\ncongenital.\n3 13) The language can be learned. Someone who was born and raised in a particular\nlanguage community will be able to learn other languages that not used in their\ncommunity.\n14) Language can be used to express the true and not true, or logically meaningless.\nHumans can use language to say the right things and that is not true. Only people\nwho can use language to lie or deceive others.\n15) Language has two subsystems namely the sound subsystem and meaning\nsubsystems that enable language to have economic function. The economics\ndiverse occurredby functional sound units that can be grouped and regrouped\ninto meaningful units, e.g. phonemes into words.\n16) The language can be used to talk about language itself.\nC. Language Functions\nTraditionally it is stated that language is a tool to interact or tools to\ncommunicate, in a sense, means to convey thoughts, ideas, concepts, or even a feeling.\nThe concept that language is a tool to convey the thought has had a long history.\nHowever, in the sociolinguistic thought considered to be too narrow because the\nlanguage activity is basically a \"who speak what language to Whom, when, and to what\nend.\" Therefore, from the view of sociolinguistics, language functions can be viewed\nfrom different angles, such as speakers, listeners, topics, codes, and conversation\npurpose (Chaer and Agustina, 2004: 15).\nFrom the point of speaker, language serves as a personal or private identity and\nJakobson called it as emotive function. It means, speakers expressed their stand point on\nwhat they speak out. The speakers not only express emotions through language, but also\nshowed emotion when delivering their speech. Therefore, the listener can understand\nwhether the speakers in an angry, sad, or happy.\nFrom the point of the listener and the speaker, the language has a function as a\ndirective, which regulate the behavior of the listener, and Halliday defines as\ninstrumental function, while Jakobson called rhetorical. From this angle, the language\nnot only makes the listener to do something, but the activities were consistent with what\nthe speaker wants. This can be done by the speakers through sentences that express a\ncommand, direction, demand, or seduction.\nFrom the contact angle of the speaker and listener, the language has a fatigue\nfunction, Finnocchiaro called it as interpersonal and Halliday called it as interactional.\nDespite Pranowo in Halliday (1996:63) also classify the function of language\nbased on the concept beyond the language function as other experts do. They classify\ninto seven functions as follows:\n1) instrumental function is the function of the language used to manipulate the\nenvironment that led to a particular situation.\n4 2) regulatory function is the use of language that serves to control an event, such as\napproval, rejection, etc.\n3) the representational function of language that serves to make a statement,\npresent the facts, etc.\n4) the use of interactional function of language serves to maintain the relationship\nin order to keep communications running smoothly, delivering jokes, master\njargon, idioms used by the particular conversational partner.\n5) heuristic function is the function of the language that is used to acquire\nknowledge in order to recognize the environment, such as a child wondering\nabout what is seen.\n6) personal function, namely the use of language that serves to express feelings,\nemotions, personality, etc.\n7) The function of the imaginative use of language that serve to create a system or\nbe imaginative ideas.\nWhile Guy Cook in Pranowo (1989:94) developed a classification of language\nfunctions into two, namely the macro and micro functions. Macro functions are\nclassified into seven as Halliday did, namely:\n1) Emotive function, for example: the expression \"mad\", \"great\", \"ouch\", etc.\n2) Directive function, for example: \"Help me please\", \"Shoot him!\".\n3) Phatic function is when speaker going to start a conversation such as: \"Can you\nhear me!\".\n4) Referential function of language is to convey information.\n5) Metalinguistic function is the usage of language that focuses on the code itself.\n6) Poetic function is the usage of language by selecting the form that contains the\nessence of the message, for example, one ad shows how powerful dairy\ncompanies exploiting the potential of the poetic function of language:\nChaedar : \"Chaedar also want to go to school, Mom!\"\nMother : \"Yeah, you will when you're growing, son!\"\nChaedar : \"What can make me grow quickly Mom?\"\nMother : \"Drinking the best milk, son!\"\n7) Contextual function is the usage of language to create different types of\ncommunication, for example, \"Good! Let's start this exercise !\". While micro\nfunction is communicative forms of each category of macro functions.\nD. Language as a Communication Device\nAfter discussing language related to its nature and function, the language either\nrealized or not it has an important meaning among their speakers. Language is a means\nof communication between members of the community in the form of symbols of sound\nproduced by the speech organ. Language is also a tool of self-expression and served as a\ntool to show their identity as well.\n5 Through language, we can show our perspective, our understanding of the\nmatter, the origin of the nation and our state, our education level, and even our\ncharacter. Language becomes a mirror of us, both as a nation and as a self. In order for\nthe communication goes well with both, the sender and receiver must have to master\ntheir own language.\nAccording Gorys Keraf (1997:1), language is a means of communication\nbetween members of the community in the form of a symbol of sound produced by the\nspeech organ. Perhaps there is an objection by saying that the language is not the only\ntool for communication. They argue that two persons or parties communicating by\nmeans of specific ways that have been agreed such as through paintings, smoke, sound\nof drum or casks and so on. But they should also recognize that when compared with\nthe language, all communication devices before contains many weak aspects.\nBasically, the language has certain functions that are used according to the needs\nof a person, i.e, as a tool for self-expression, as a means to communicate, as a tool to\norganize and adapt to social integration in the environment or circumstances, and as a\ntool for social control (Keraf , 1997:3).\nHere are presented the role of language as a communication tool:\n1) Language as a tool to interact with others. Condition for the communication\noccurred is need involvement of two or more persons conducting talk to each\nother. In this case interaction process is emphasized in order to allow\ninterchange feedback between the speaker to his interlocutor, and vice versa.\n2) Language reflects a person's level of education. An educated would be\nrecalled better than uneducated people. The higher a person's education, the\nhigher their speech wisdom. The emergence of this opinion because the\ninteraction is often done by people who are well educated, influenced by the\nenvironment of residence, as well as the school environment or the working\nenvironment. So that educated people tend to interact with the environment that\nsupports the use of language quality, than those who are less educated.\n3) Indicates authority. A leader would have to be able to speak well rewarded\nsubordinates. This is related to one's mastery of the language, if a leader can\nspeak well, then he can express his ideas in a clear and straightforward so that\nshows the authority of the leader.\n4) As the force of law. With language, a person can identify the language of self-\ndefense or rival. Someone who speaks, even to escape easily from the case\naddressed to him. This suggests that language can be implemented as an ability \/\nskill in communicating.\n5) Attract the customer. Language of good and interesting ads will make\nconsumers interested in trying your product. In communications, advertising\nlanguage is included in the scope of advertising. In an effort to convey the\nbenefits and efficacy of the product, the process of communication can not be\nreleased from the distribution of a product to consumers.\n6 6) Indicates a person's social standing. With the language, one can reflect on his\nposition in society. Diversity of languages mastered one will certainly differ\nfrom one to another, it is influenced by the language acquisition from the\nenvironment. So people who have a high diversity of languages, and be able to\ncommunicate well be seen as the privileged in society.\nE. The Relationship between the Communication, Language and Culture\nThe link between communication and culture, could be seen from our daily\npractice of communication or interaction between individuals and groups. The language\nwe use must have been influenced by where we live, as well as the ethnic\nneighborhoods around us.\nIn this case, culture in regard to human being way of life. Humans learn, think,\nfeel, believe, and seek what is appropriate according to the culture. Language,\nfriendship, custom, practice communication, social action, economic activity, politics,\nand technology, all these were based on cultural patterns. As for who speak\nMakassarese, Gorontalonese, Sundanese, Javanese, Malay, and English. This is all\nbecause they have been born or at least raised in a culture that contains these elements.\nWhat they do, how they act, a response to cultural functions. (Porter & Samovar in\nMulyana and Grace, 2006).\nThis means that communication and culture cannot be separated, because culture\nnot only determines who is talking whom, about what, and where the communication\ntakes place, but the culture also helped determine the encode messages, the meaning and\nthe message he had for the conditions to send, pay attention, interpret the message.\nActually, the whole repertoire of behavior we are very dependent on, the culture we\ngrew up, in line with previously disclosed at the beginning of the discussion.\nConsequently, culture is the foundation of communication. If cultural diversity, it is also\na variety of communication practices.\nF. The Essence of Culture\nThere are various definitions of culture are very different, and it could be true, or\nit could be considered incomplete. This difference occurs because the compilers usually\nsee the cultural definition in terms of different aspects.\nKoentjaraningrat (1974: 217) explains that culture only humans possess, and\ngrow along with the development of human society. For that Koentjaraningrat using\nsomething he calls \"cultural framework\", which has two aspects, namely the form of\nculture and cultural content. Referred to as a form of culture is either: (1) a form of\nideas (cultural system), which is abstract, (2) behavior (social systems), which are rather\nconcrete, and (3) a physical or objects, which are universal, meaning the seventh\nelement in every society there are people in the world. The seven elements are: (1)\nlanguage, (2) technology system, (3) livelihood systems, (4) social organization, (5)\nknowledge of the system, (6) religious system, (7) art.\n7 Kroeber and Kluckhorn in Pranowo (1952:86) has collected dozens of\ndefinitions of culture, and breaks it down into six categories according to the nature of\nthe definition, namely: (1) a descriptive definition, the definition that emphasizes the\nelements of culture, (2) historical definition, the definition emphasizes that culture\ninherited social, (3) the definition of normative definitions emphasize the nature of\nculture as a rule of life and conduct. On the usefulness of culture in conformity with the\nenvironment, solving problems, and learn to live, (5) structural definition, the definition\nthat emphasizes the nature of culture as a system patterned and orderly, (6) the genetic\ndefinition, the emphasis on the definition of culture as the work of man.\nBased on the grouping of the above it can be seen that culture pervades all aspects and\ndimensions of human life. It can be said that any human activity with all the results and\nthe result is included in the concept of culture.\nGrouping cultural definitions made Nababan (1984) also showed that culture\ncovers all aspects and elements of human life. Nababan cultural definition classifies into\nfour categories, namely (1) the definition of a view of culture as a regulator and tie the\ncommunity, (2) the definition of a view of culture as the things that man has acquired\nthrough learning or education (nurture), (3) the definition of a view the customs and\nculture of human behavior, and (4) the definition of a view of culture as a system of\ncommunication that people use to gain cooperation, unity, and survival of human\nsociety.\nBased on the above in other words it can be said that culture is everything that\nconcerns human life, including the rules or applicable law in society, the results of man-\nmade, custom and tradition are wont to do, and as well as the interaction or\ncommunication tool used, the language and tools of communication is non-verbal.\nG. Language as a Cultural Reality discloser\nThe existence of different theories about the relationship of language and culture. Some\nsay that language is part of culture, but others say that language and culture are different, but\nhave a very close relationship, so it cannot be separated. Some argue that the language is\nstrongly influenced by culture, so that all things in the culture will be reflected in the language.\nConversely, there is also a saying that the language and culture influence human thinking or\npublic speakers.\nOne question of interest to linguistic experts is whether there is a relationship of\nlanguage and thought the speakers with a different culture? With the variation of language is\noften associated with the presence of different cultures. In many ways the view was influenced\nby the work of anthropologists who tend to respond to the language as part of a culture that is\ndefined as a socially acquired knowledge (Cahyono 1995: 409). The opinion asserts that\nlanguage variation is closely related to the existence of different cultures.\nGee (1993: 7) states that human language is the result of a long evolution of man.\nHuman language is different because human cultures are different, but the language and culture\nhas a profound similarities because humans are basically the same. They have the same kind of\neyes, kind of the same brain, the same biological basis. Human evolution has formed humans\nacquire and use specific language.\n8 To determine the relationship between language and culture significantly, we have to\nignore the word level possessed a language. The question is whether culture affects language\nculturally significant than determining how much or what words will have a language?\nLanguage is bound by cultural context. Put differently, the language can be seen as an\nextension of the culture. According to the Sapir-Whorf hypothesis, often called Linguistic\nRelativity Theory, in fact every language shows a typical symbolic world that depicts the reality\nof mind, inner experience, and the need for users to think, look at the environment, and the\nuniverse around it in different ways, and therefore behave differently.\nThe hypothesis put forward by Benjamin Lee Whorf and popularize and confirms the\nview teacher Edward Sapir states that (1) the language affects perception, and (2) the language\naffects thought patterns. Thus, the language was mastered ways of thinking and acting human.\nAs an illustration, the fact that the Eskimos have about 20 words to describe snow, indicating\nthat they are more sensitive in perceiving the reality of snow, because snow is an important\nfactor in their lives. There are special words to describe snow was falling, wind-blown snow and\nform a line of soft snow on the ground, and so on. In this case, the categorization of the snow is\nso important to them because the snow could affect the lives and safety even for them. So also\nin classical Arabic, supposedly there is a word to describe 6000 camels, warnanta, body\nstructure, gender, age, movement, condition, and equipment.\nSahara natives also have 200 words to describe dates, a staple in their lives, and 20\ndifferent ways to describe the dunes (Condon and Fathi Yousep in Dedi Mulyana, 2007:277).\nThis signaled the importance of the objects in their culture. Meanwhile, in Zulu language, there\nare 39 words to express the color green. The number of names for the colors of the different\ngreen is showing concern for the Zulu people into nature and the places that they go through in\nthe journey across the prairie, especially before they recognize automotive transport and\nnational highways, (Lewis in Dedi Mulyana, 2007:277). Other than that, the word rice in\nEnglish can be translated into three words in Indonesian different meaning, namely: gabah,\nberas, and nasi. It shows that we are more concerned with the people of Indonesia this thing\nthan the English, so our main meals.\nThe use of tenses in English implies that the British people are very aware of the time\nand stressed the importance of time, as in the sentence:\na. They study English twice a week.\nb. She studied English last night.\nc. We are going to study English tomorrow.\nd. Have you studied English today?\ne. I have been studying English four years.\nLevels of language in the Java language (kromoversus ngoko) and in the minds of\nGorontalo show (read: social status) are different for those who use the language. For example:\nIn the language of Gorontalo there are a numbers of word to the first person, the Wau and\nwatiya, while for the second, is: Yio and tingoli. The word of “eating” can be translated into a\nnumber of words in Gorontalo language, such as:\n• Monga, for self\n• Miriziki and molamelo, for the people we respect\n• Yukul, for a familiar peers or subordinates \/ maid\n• Moluango, for animals\n• Maam, for small children\n9 When we use the local language, the nature of the local language are layered it forces us\nto realize it or not to see each other in front of us with a particular category.\nHowever, to some degree is the Sapir-Whorf hypothesis is true. Otherwise it is still\ntalked about is the opposite of the Sapir-Whorf hypothesis says that culture affecting language.\nThe fact also proves that the people whose activities are limited, as the tribes are isolated, have\nonly vocabulary too limited. While the open society, the community members have an activity\nthat is spacious, has a vocabulary very much. Compare, in Webster's English dictionary ™\nregistered more than 600,000 words, while in the Big Indonesian Dictionary of no more than\n60,000 words.\nThus, language is an important tool to unravel our social life. When the language used\nin the context of communication, it blends with its culture. It is believed that there is a natural\nconnection between the language spoken by someone from a social group and a social identity.\nWith his accent, vocabulary, or pattern-poka its discourse, a speaker identifies himself and is\nidentified as a member of the group. Furthermore, through this membership, they illustrate the\npower and pride (Kramsch, 1998:66). Then, the words refer to a person experiences. Because\nthey express facts, ideas, or knowledge of the world is going through. The words also reflect the\nbehavior or beliefs of speakers, ideas, or anything else. In this case, the language can be said to\nexpress the reality of the culture.\nHowever, members of social groups not only express the experience, they also create\nthrough language experience. They gave a name to that experience through tools they choose to\ncommunicate with others, for example; write a letter or send a message via e-mail, read the\nnewspaper or interpret graphs. The manner in which a person's well spoken, written, or visual\nmedia produce meanings that can be understood by those who have it, such as through tone\n(tone) voice, accent, speaking style, body language or facial expressions. Through all aspects of\nverbal and non-verbal, the language adds cultural reality.\nIndonesian people, and as some other eastern cultures have no direct in expressing what\nshe feels. The meaning of the phrase \"I love you\" is a phrase that should not be found and used\nby the Indonesian people express their love. How it feels weird and rude in Indonesian culture.\nIndonesian people tend to express their love by showing sincerity and attention being deep and\ncan be felt by the attention. If it turns teens Indonesia often and so easy to use the phrase \"I love\nyou\" means that they have been uprooted from their cultural roots.\nThus, because of the close relationship between the language of this culture, there are\nexperts who like their relationship as twins, the two things are inseparable. Or as a coin; side\none is the language and the other is cultural (Chaer, 2003:71)\nH. Conclusion\nLanguage is a system of symbols used by humans to communicate or express ideas and\nthoughts to others. The language used is influenced or affected the culture and vice versa.\nTherefore it can be said that the language and culture has a very close relationship. Through the\nlanguage of the person, his interlocutor can usually tell the background of the speaker. That's\nthere is parable says that language indicate the nation.\nReferences\n10 "}