{"text":"Languages, Dialects, and Varieties 25\n2 Languages, Dialects, and Varieties\nI stated in the introductory chapter that all languages exhibit internal variation,\nthat is, each language exists in a number of varieties and is in one sense the sum\nof those varieties. But what do we mean by variety? Hudson (1996, p. 22)\ndefines a variety of language as ‘a set of linguistic items with similar distribu-\ntion,’ a definition that allows us to say that all of the following are varieties:\nCanadian English, London English, the English of football commentaries, and\nso on. According to Hudson, this definition also allows us ‘to treat all the\nlanguages of some multilingual speaker, or community, as a single variety, since\nall the linguistic items concerned have a similar social distribution.’ A varietycan\ntherefore be something greater than a single language as well as something less,\nless even than something traditionally referred to as a dialect. Ferguson (1972,\np. 30) offers another definition of variety: ‘any body of human speech patterns\nwhich is sufficiently homogeneous to be analyzed by available techniques of\nsynchronic description and which has a sufficiently large repertory of elements\nand their arrangements or processes with broad enough semantic scope tofunction\nin all formal contexts of communication.’ Note the words ‘sufficiently homoge-\nneous’ in this last quotation. Complete homogeneity is not required; there is\nalways some variation whether we consider a language as a whole, a dialect of\nthat language, the speech of a group within that dialect, or, ultimately, each\nindividual in that group. Such variation is a basic fact of linguistic life.\nHudson and Ferguson agree in defining variety in terms of a specific set of\n‘linguistic items’ or ‘human speech patterns’ (presumably, sounds, words, gram-\nmatical features, etc.) which we can uniquely associate with some external\nfactor (presumably, a geographical area or a social group). Consequently, if we\ncan identify such a unique set of items or patterns for each group in question,\nit might be possible to say there are such varieties as Standard English, Cockney,\nlower-class New York City speech, Oxford English, legalese, cocktail party\ntalk, and so on. One important task, then, in sociolinguistics is to determine if\nsuch unique sets of items or patterns do exist. As we proceed we will encounter\ncertain difficulties, but it is unlikely that we will easily abandon the concept of\n‘variety,’ no matter how serious these difficulties prove to be.\nAITC02 25 5\/9\/05, 4:36 PM 26 Languages, Dialects, and Varieties\nDiscussion\n1. I have just suggested that, although a concept like ‘variety’ is difficult to\ndefine, it may still be useful in sociolinguistic work. Linguists have foundsuch\nconcepts as ‘sound,’ ‘syllable,’ ‘word,’ and ‘sentence’ equally difficult todefine\n(in contrast to lay usage, in which they are just assumed to be obvious and\nuncontroversial). In one sense, linguistics is all about trying to provide\nadequate definitions for words such as sound, syllable, word, sentence, and\nlanguage. What are some of the problems you are aware of concerning the\nlinguist’s difficulty with these words and the associated concepts? What\nparallels do you see, if any, between these problems and the sociolinguist’s\nproblem with variety (and the other terms to be used in the remainder of\nthis chapter)?\n2. Hymes (1974, p. 123) has observed that language boundaries between groups\nare drawn not on the basis of the use of linguistic items alone, because\nattitudes and social meanings attached to those items also count. He says:\nAny enduring social relationship or group may come to define itself by selec-\ntion and\/or creation of linguistic features, and a difference of accent may be\nas important at one boundary as a difference of grammar at another. Part of\nthe creativity of users of languages lies in the freedom to determine what and\nhow much linguistic difference matters.\nHow does this inter-relationship between linguistic items and the social\nevaluations of such items apply in how we regard each of the following\npronunciations?\na. butter, budder, bu’er\nb. fishing, fishin’\nc. farm, fahm\nd. width pronounced like wit, like with\ne. Cuba pronounced as Cuber\nf. ate pronounced like eight, like et\ng. been pronounced like bean, like bin\nh. mischievous pronounced with four syllables (i.e., as mischievious)\ni. aluminum, aluminium\nj. pólice, gúitar, Détroit (with the stress as indicated)\nAnd each of the following utterances?\na. He hurt hisself.\nb. He done it.\nc. He dove in.\nd. He run away last week.\ne. It looks like it’s going to rain.\nf. To whom did you give it?\ng. She’s taller than me now.\nAITC02 26 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 27\nh. Yesterday he laid down after lunch for an hour.\ni. Can I leave the room?\nj. He ain’t got no money left.\nk. Try and do it soon.\nl. Between you and me, I don’t like it.\nm. There’s twenty dollars for you to spend.\nn. She invited Sally and I to the party.\no. I wants it.\np. You done it, did you?\nq. Stand over by them boys.\nr. Is he the one what said it?\ns. They don’t learn you nothing there.\nLanguage and Dialect\nFor many people there can be no confusion at all about what language they\nspeak. For example, they are Chinese, Japanese, or Korean and they speak\nChinese, Japanese, and Korean respectively. It is as simple as that; language and\nethnicity are virtually synonymous (Coulmas, 1999). A Chinese may besurprised\nto find that another person who appears to be Chinese does not speak Chinese,\nand some Japanese have gone so far as to claim not to be able to understand\nCaucasians who speak fluent Japanese. Just as such a strong connection between\nlanguage and ethnicity may prove to be invaluable in nation-building, it can also\nbe fraught with problems when individuals and groups seek to realize someother\nidentity, e.g., to be both Chinese and American, or to be Canadian rather than\nKorean-Canadian. As we will see (p. 368), many Americans seem particularly\nreluctant to equate language with ethnicity in their own case: although they\nregard English as the ‘natural’ language of Americans, they do not consider\nAmerican to be an ethnic label. The results may be the same; only the reasons\ndiffer.\nMost speakers can give a name to whatever it is they speak. On occasion,some\nof these names may appear to be strange to those who take a scientific interest\nin languages, but we should remember that human naming practices often have\na large ‘unscientific’ component to them. Census-takers in India find themselves\nconfronted with a wide array of language names when they ask people what\nlanguage or languages they speak. Names are not only ascribed by region, which\nis what we might expect, but sometimes also by caste, religion, village, and so\non. Moreover, they can change from census to census as the political and social\nclimate of the country changes.\nWhile people do usually know what language they speak, they may notalways\nlay claim to be fully qualified speakers of that language. They may experience\ndifficulty in deciding whether what they speak should be called a languageproper\nor merely a dialect of some language. Such indecision is not surprising: exactly\nhow do you decide what is a language and what is a dialect of a language? What\nAITC02 27 5\/9\/05, 4:36 PM 28 Languages, Dialects, and Varieties\ncriteria can you possibly use to determine that, whereas variety X is a language,\nvariety Y is only a dialect of a language? What are the essential differences\nbetween a language and a dialect?\nHaugen (1966a) has pointed out that language and dialect are ambiguous\nterms. Ordinary people use these terms quite freely in speech; for them a dialect\nis almost certainly no more than a local non-prestigious (therefore powerless)\nvariety of a real language. In contrast, scholars often experience considerable\ndifficulty in deciding whether one term should be used rather than the other in\ncertain situations. As Haugen says, the terms ‘represent a simple dichotomy in\na situation that is almost infinitely complex.’ He points out that the confusion\ngoes back to the Ancient Greeks. The Greek language that we associate with\nAncient Greece was actually a group of distinct local varieties (Ionic, Doric, and\nAttic) descended by divergence from a common spoken source with each variety\nhaving its own literary traditions and uses, e.g., Ionic for history, Doric forchoral\nand lyric works, and Attic for tragedy. Later, Athenian Greek, the koiné – or\n‘common’ language – became the norm for the spoken language as the various\nspoken varieties converged on the dialect of the major cultural andadministrative\ncenter. Haugen points out (p. 923) that the Greek situation has provided the\nmodel for all later usages of the two terms with the resulting ambiguity. Lan-\nguage can be used to refer either to a single linguistic norm or to a group of\nrelated norms, and dialect to refer to one of the norms.\nThe situation is further confused by the distinction the French make between\nun dialecte and un patois. The former is a regional variety of a language that\nhas an associated literary tradition, whereas the latter is a regional variety that\nlacks such a literary tradition. Therefore patois tends to be used pejoratively; it\nis regarded as something less than a dialect because of its lack of an associated\nliterature. Even a language like Breton, a Celtic language still spoken in parts\nof Brittany, is called a patois because of its lack of a strong literary tradition and\nthe fact that it is not some country’s language. However, dialecte in French, like\nDialekt in German, cannot be used in connection with the standard language,\ni.e., no speaker of French considers Standard French to be a dialect of French.\nIn contrast, it is not uncommon to find references to Standard English being a\ndialect – admittedly a very important one – of English.\nHaugen points out that, while speakers of English have never seriously adopted\npatois as a term to be used in the description of language, they have tried to\nemploy both language and dialect in a number of conflicting senses. Dialect is\nused both for local varieties of English, e.g., Yorkshire dialect, and for various\ntypes of informal, lower-class, or rural speech. ‘In general usage it therefore\nremains quite undefined whether such dialects are part of the “language” or\nnot. In fact, the dialect is often thought of as standing outside the language....\nAs a social norm, then, a dialect is a language that is excluded from polite\nsociety’ (pp. 924–5). It is often equivalent to nonstandard or even substandard,\nwhen such terms are applied to language, and can connote various degrees of\ninferiority, with that connotation of inferiority carried over to those who speak\na dialect.\nWe can observe too that questions such as ‘Which language do you speak?’\nor ‘Which dialect do you speak?’ may be answered quite differently by people\nAITC02 28 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 29\nwho appear to speak in an identical manner. As Gumperz (1982a, p. 20) has\npointed out, many regions of the world provide plenty of evidence for what he\ncalls ‘a bewildering array of language and dialect divisions.’ He adds: ‘socio-\nhistorical factors play a crucial role in determining boundaries. Hindi and Urdu\nin India, Serbian and Croatian in Yugoslavia [of that date], Fanti and Twi in\nWest Africa, Bokmål and Nynorsk in Norway, Kechwa and Aimara in Peru, to\nname just a few, are recognized as discrete languages both popularly and in law,\nyet they are almost identical at the level of grammar. On the other hand, the\nliterary and colloquial forms of Arabic used in Iraq, Morocco, and Egypt, or the\nWelsh of North and South Wales, the local dialects of Rajasthan and Bihar in\nNorth India are grammatically quite separate, yet only one language is recog-\nnized in each case.’\nThe Hindi–Urdu situation that Gumperz mentions is an interesting one. Hindi\nand Urdu are the same language, but one in which certain differences are becom-\ning more and more magnified for political and religious reasons. Hindi is written\nleft to right in the Devanagari script, whereas Urdu is written right to left in the\nArabic–Persian script. Whereas Hindi draws on Sanskrit for its borrowings,Urdu\ndraws on Arabic and Persian sources. Large religious and political differences\nmake much of small linguistic differences. The written forms of the two vari-\neties, particularly those favored by the elites, also emphasize these differences.\nThey have become highly symbolic of the growing differences between India and\nPakistan. (We should note that the situation in India and Pakistan is in almost\ndirect contrast to that which exists in China, where mutually unintelligible\nChinese languages (called ‘dialects’ by the Chinese themselves) are united through\na common writing system and tradition.)\nGumperz (1971, pp. 56–7) points out that everyday living in parts of India,\nparticularly in the large cities and among educated segments of those commun-\nities, requires some complex choices involving the distinction between Hindi and\nUrdu:\nSince independence Hindi has become compulsory in schools, but Urdu continues\nto be used extensively in commerce, and the Ghazal, the best known form of Urdu\npoetry, is universally popular. If we look at the modern realist Hindi writers, we\nfind that they utilize both Sanskrit and Persian borrowings. The juxtaposition of\nthe two styles serves to express subtle shades of meaning and to lend reality to their\nwritings. Similarly on the conversational level the use of Hindi and Urdu forms is\nnot simply a matter of birth and education. But, just as it is customary forindividuals\nto alternate between dialect and standard depending on the social occasion, so\nwhen using the standard itself the speaker may select from a range of alternatives.\nHindi and Urdu therefore might best be characterized not in terms of actual speech,\nbut as norms or ideal behavior in the sociologist’s sense. The extent to which a\nspeaker’s performance in a particular communication situation approximates the\nnorm is a function of a combination of factors such as family background, regional\norigin, education and social attitude and the like.\nSo far as everyday use is concerned, therefore, it appears that the boundary\nbetween the spoken varieties of Hindi and Urdu is somewhat flexible and one\nthat changes with circumstances. This is exactly what we would expect: there\nAITC02 29 5\/9\/05, 4:36 PM 30 Languages, Dialects, and Varieties\nis considerable variety in everyday use but somewhere in the background there\nis an ideal that can be appealed to, proper Hindi or proper Urdu.\nIn the first of the two quotations from Gumperz there is a reference to\nYugoslavia, a country now brutally dismembered by the instruments ofethnicity,\nlanguage, and religion. Within the old Yugoslavia Serbs and Croats failed to\nagree on most things and after the death of President Tito the country, slowly\nat first and then ever more rapidly later, fell into a fatal divisiveness. Slovenians\nand Macedonians excised themselves most easily, but the Serbs and the Croats\nwere not so lucky. Linguistically, Serbo-Croatian is a single South Slav language\nbut one used by two groups of people, the Serbs and Croats, with somewhat\ndifferent historical, cultural, and religious backgrounds. There is a third group\nin Bosnia, a Muslim group, who also speak Serbo-Croatian, and their existence\nfurther compounded the problems and increased the eventual bloodshed.Finally,\nthere is a very small Montenegrin group. The Serbian and Croatian varieties of\nSerbo-Croatian are known as srpski and srpskohrvatski respectively. The actual\ndifferences between them involve different preferences in vocabulary rather\nthan differences in pronunciation or grammar. That is, Serbs and Croats often\nuse different words for the same concepts, e.g., Serbian varos and Croatian grad\nfor ‘train.’ The varieties are written in different scripts (Roman for Croatian and\nCyrillic for Serbian), which also reflect the different religious loyalties of Croats\nand Serbs (Catholic and Orthodox). As conflict grew, differences became more\nand more important and the country and the language split apart. Now inSerbia\npeople speak Serbian just as they speak Croatian in Croatia. Serbo-Croatian no\nlonger exists as a language of the Balkans. And now that there is a separate\nBosnia the Bosnians call their variety bosanski and Montenegrins call their\nvariety crnogorski (Carmichael, 2002, p. 236, and Greenberg, 2004).\nIn direct contrast to the above situation, we can observe that the loyalty of\na group of people need not necessarily be determined by the language they\nspeak. Although the majority of the people in Alsace are speakers of a variety\nof German insofar as the language of their home-life is concerned, their loyalty\nis unquestionably toward France. They look west not east for national leader-\nship and they use French, not German, as the language of mobility and higher\neducation. However, everyday use of Alsatian is a strong marker of localidentity;\nit is an important part of being Alsatian in France. We can contrast thissituation\nwith that in another area of France. In Brittany a separatist movement, that is,\na movement for local autonomy if not complete independence, is centered on\nBreton, a language which, unfortunately for those who speak it, is in serious\ndecline. Breton identity no longer has the support of widespread use of the\nlanguage.\nThe various relationships among languages and dialects discussed above can\nbe used to show how the concepts of ‘power’ and ‘solidarity’ help us understand\nwhat is happening. Power requires some kind of asymmetrical relationship\nbetween entities: one has more of something that is important, e.g. status,\nmoney, influence, etc., than the other or others. A language has more power\nthan any of its dialects. It is the powerful dialect but it has become so because\nof non-linguistic factors. Standard English and Parisian French are goodexamples.\nSolidarity, on the other hand, is a feeling of equality that people have with one\nAITC02 30 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 31\nanother. They have a common interest around which they will bond. A feeling\nof solidarity can lead people to preserve a local dialect or an endangeredlanguage\nto resist power, or to insist on independence. It accounts for the persistence of\nlocal dialects, the modernization of Hebrew, and the separation of Serbo-Croatian\ninto Serbian and Croatian.\nThe language–dialect situation along the border between the Netherlands and\nGermany is an interesting one. Historically, there was a continuum of dialectsof\none language, but the two that eventually became standardized as the languages\nof the Netherlands and Germany, Standard Dutch and Standard German, arenot\nmutually intelligible, that is, a speaker of one cannot understand a speaker of\nthe other. In the border area speakers of the local varieties of Dutch and German\nstill exist within that dialect continuum (see p. 45) and remain largely intelligible\nto one another, yet the people on one side of the border say they speak a variety\nof Dutch and those on the other side say they speak a variety of German. The\nresidents of the Netherlands look to Standard Dutch for their model; they read\nand write Dutch, are educated in Dutch, and watch television in Dutch. Con-\nsequently, they say they use a local variety, or dialect, of Dutch in their daily\nlives. On the other side of the border, German replaces Dutch in all equivalent\nsituations. The interesting linguistic fact, though, is that there are more similar-\nities between the local varieties spoken on each side of the border than between\nthe one dialect (of Dutch?) and Standard Dutch and the other dialect (ofGerman?)\nand Standard German, and more certainly than between that dialect and the\nsouth German, Swiss, and Austrian dialects of German. However, it is also\nof interest to note (Kremer, 1999) that younger speakers of Dutch in this area\nof the Netherlands are more conscious of the standard language border than\nolder speakers. Apparently, their Dutch identity triumphs over any linguistic\nconnections they have with speakers of the same dialect over the national\nborder.\nGumperz has suggested some of the confusions that result from popular uses\nof the terms language and dialect. To these we can add the situation inScandinavia\nas further evidence. Danish, Norwegian (actually two varieties), and Swedish are\nrecognized as different languages, yet if you speak any one of them you will\nexperience little difficulty in communicating while traveling in Scandinavia (ex-\ncluding, of course, Finland, or at least the non-Swedish-speaking parts of that\ncountry). Danish and Norwegian share much vocabulary but differ considerably\nin pronunciation. In contrast, there are considerable vocabulary differences\nbetween Swedish and Norwegian but they are similar in pronunciation. Both\nDanes and Swedes claim good understanding of Norwegian. However, Danes\nclaim to comprehend Norwegians much better than Norwegians claim to\ncomprehend Danes. The poorest mutual comprehension is between Danes and\nSwedes and the best is between Norwegians and Swedes. These differences in\nmutual intelligibility appear to reflect power relationships: Denmark long dom-\ninated Norway, and Sweden is today the most influential country in the region\nand Denmark the least powerful.\nA somewhat similar situation exists in the relationship of Thai and Lao. The\nLaos understand spoken Thai and hear Thai constantly on radio and television.\nEducated Laos can also read written Thai. However, Thais do not readily\nAITC02 31 5\/9\/05, 4:36 PM 32 Languages, Dialects, and Varieties\nunderstand spoken Lao nor do they read the written variety. Lao is a low-\nprestige language so far as Thais are concerned; in contrast, Thai has high\nprestige in Laos. Thais, therefore, are unwilling to expend effort to understand\nLao, whereas Laos are willing to make the extra effort to understand Thai.\nIf we turn our attention to China, we will find that speakers of Cantonese and\nMandarin will tell you that they use the same language. However, if one speaker\nknows only Cantonese and the other only Mandarin, they will not be able to\nconverse with each other: they actually speak different languages, certainly as\ndifferent as German and Dutch and even Portuguese and Italian. If the speakers\nare literate, however, they will be able to communicate with each other through\na shared writing system. They will almost certainly insist that they speak dif-\nferent dialects of Chinese, not different languages, for to the Chinese a shared\nwriting system and a strong tradition of political, social, and cultural unity form\nessential parts of their definition of language.\nThe situation can become even more confused. A speaker of Cockney, a\nhighly restricted London variety of English, may find it difficult to communicate\nwith natives of the Ozark Mountains in the United States. Do they therefore\nspeak separate languages? Is there one English language spoken in Britain and\nanother, American, spoken in the New World? The American writer Mencken\n(1919) had very definite views that the varieties spoken on the two sides of the\nAtlantic were sufficiently distinctive to warrant different appellations. It is also\nnot unusual to find French translations of American books described on their\ntitle pages as translations from ‘American’ rather than ‘English.’ Is there a bona\nfide separate Scottish variety of English? There was before the crowns and\nparliaments were united several centuries ago. However, today there is no clear\nanswer to that question as the power relationship between England andScotland\nfluctuates and the issue of language differences is but one of many that must be\ndealt with. Is the French of Quebec a dialect of Standard (continental) French,\nor should we regard it as a separate language, particularly after a political\nseparation of well over two centuries? Is Haitian Creole (see p. 84) a variety of\nFrench, or is it an entirely separate language, and if so in what ways is it\nseparate and different? How do the different varieties of English spoken in\nJamaica (see p. 81) relate to other varieties of English? Or is that question really\nanswerable? What, above all, is English? How can we define it as something\napart from what Speaker A uses, or Speaker B, or Speaker C? If it is something\nA, B, and C share, just what is it that they do share?\nWe undoubtedly agree that this book is written in English and that English\nis a language, but we may be less certain that various other things we see written\nor hear spoken in what is called English should properly be regarded as English\nrather than as dialects or varieties of English, perhaps variously described as\nIndian English, Australian English, New York English, West Country English,\nAfrican American Vernacular English, nonstandard English, BBC English, and\nso on. A language then would be some unitary system of linguistic commun-\nication which subsumes a number of mutually intelligible varieties. It would\ntherefore be bigger than a single dialect or a single variety. However, that cannot\nalways be the case, for some such systems used by very small numbers of\nspeakers may have very little internal variation. Yet each must be a language,\nAITC02 32 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 33\nfor it is quite unlike any other existing system. Actually, neither the requirement\nthat there be internal variation nor the ‘numbers game,’ i.e., that a language\nmust somehow be ‘bigger’ than a dialect, offers much help. Many languages\nhave only a handful of speakers; several have actually been known to have had\nonly a single remaining speaker at a particular point in time and the language\nhas ‘died’ with that speaker.\nStill another difficulty arises from the fact that the terms language and dialect\nare also used in an historical sense. It is possible to speak of languages such as\nEnglish, German, French, Russian, and Hindi as Indo-European dialects. In this\ncase the assumption is that there was once a single language, Indo-European,\nthat the speakers of that language (which may have had various dialects) spread\nto different parts of the world, and that the original language eventuallydiverged\ninto the various languages we subsume today under the Indo-European family\nof languages. However, we should also be aware that this process of divergence\nwas not as clean-cut as this classical neo-grammarian model of language differ-\nentiation suggests. (In such a model all breaks are clean, and once two varieties\ndiverge they lose contact with each other.) Processes of convergence must also\nhave occurred, even of convergence among entirely unrelated languages (that is,\nlanguages without any ‘family’ resemblance). For example, Indo-European and\nDravidian languages have influenced each other in southern India and Sri Lanka,\nand in the Balkans there is considerable evidence of the spread of common\nfeatures across languages such as Albanian, Greek, Turkish, and several Slavic\nlanguages. In such situations, language and dialect differences become further\nobscured, particularly when many speakers are also likely to be multilingual.\nPerhaps some of the difficulties we have with trying to define the termlanguage\narise from trying to subsume various different types of systems of communica-\ntion under that one label. An alternative approach might be to acknowledge that\nthere are different kinds of languages and attempt to discover how languagescan\ndiffer from one another yet still be entities that most of us would want to call\nlanguages rather than dialects. It might then be possible to define a dialect as\nsome sub-variety of one or more of these entities.\nOne such attempt (see Bell, 1976, pp. 147–57) has listed seven criteria that\nmay be useful in discussing different kinds of languages. According to Bell, these\ncriteria (standardization, vitality, historicity, autonomy, reduction, mixture, and\nde facto norms) may be used to distinguish certain languages from others. They\nalso make it possible to speak of some languages as being more ‘developed’ in\ncertain ways than others, thus addressing a key issue in the language–dialect\ndistinction, since speakers usually feel that languages are generally ‘better’ than\ndialects in some sense.\nStandardization refers to the process by which a language has been codified\nin some way. That process usually involves the development of such things as\ngrammars, spelling books, and dictionaries, and possibly a literature. We can\noften associate specific items or events with standardization, e.g., Wycliffe’s and\nLuther’s translations of the Bible into English and German, respectively, Caxton’s\nestablishment of printing in England, and Dr Johnson’s dictionary of English\npublished in 1755. Standardization also requires that a measure of agreement\nbe achieved about what is in the language and what is not. Once we have such\nAITC02 33 5\/9\/05, 4:36 PM 34 Languages, Dialects, and Varieties\na codification of the language we tend to see it as almost inevitable, the result\nof some process come to fruition, one that has also reached a fixed end point.\nChange, therefore, should be resisted since it can only undo what has been done\nso laboriously. Milroy (2001, p. 537) characterizes the resulting ideology as\nfollows: ‘The canonical form of the language is a precious inheritance that has\nbeen built up over the generations, not by the millions of native speakers, but\nby a select few who have lavished loving care upon it, polishing, refining, and\nenriching it until it has become a fine instrument of expression (often these are\nthought to be literary figures, such as Shakespeare). This is a view held by\npeople in many walks of life, including plumbers, politicians and professors of\nliterature. It is believed that if the canonical variety is not universally supported\nand protected, the language will inevitably decline and decay.’\nOnce a language is standardized it becomes possible to teach it in a deliberate\nmanner. It takes on ideological dimensions – social, cultural, and sometimes\npolitical – beyond the purely linguistic ones. In Fairclough’s words (2001, p. 47)\nit becomes ‘part of a much wider process of economic, political and cultural\nunification...of great...importance in the establishment of nationhood, andthe\nnation-state is the favoured form of capitalism.’ According to these criteria, both\nEnglish and French are quite obviously standardized, Italian somewhat less so,\nand the variety known as African American Vernacular English (see chapter 14)\nnot at all.\nHaugen (1966a) has indicated certain steps that must be followed if onevariety\nof a language is to become the standard for that language. In addition to what\nhe calls the ‘formal’ matters of codification and elaboration, the former referring\nto the development of such things as grammars and dictionaries and the latter\nreferring to the use of the standard in such areas as literature, the courts, edu-\ncation, administration, and commerce, Haugen says there are important matters\nto do with ‘function.’ For example, a norm must be selected and acceptedbecause\nneither codification nor elaboration is likely to proceed very far if thecommunity\ncannot agree on some kind of model to act as a norm. That norm is also likelyto\nbe – or to become – an idealized norm, one that users of the language are asked\nto aspire to rather than one that actually accords with their observed behavior.\nSelection of the norm may prove difficult because choosing one vernacular as\na norm means favoring those who speak that variety. It also diminishes all the\nother varieties and possible competing norms, and those who use those varieties.\nThe chosen norm inevitably becomes associated with power and the rejected\nalternatives with lack of power. Not surprisingly, it usually happens that a\nvariety associated with an elite is chosen. Attitudes are all-important, however.\nA group that feels intense solidarity may be willing to overcome great linguistic\ndifferences in establishing a norm, whereas one that does not have this feeling\nmay be unable to overcome relatively small differences and be unable to agree\non a single variety and norm. Serbs and Croats were never able to agree on a\nnorm, particularly as other differences reinforced linguistic ones. In contrast, we\ncan see how Indonesia and Malaysia are looking for ways to reduce thedifferences\nbetween their languages, with their common Islamic bond a strong incentive.\nThe standardization process itself performs a variety of functions (Mathiot\nand Garvin, 1975). It unifies individuals and groups within a larger community\nAITC02 34 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 35\nwhile at the same time separating the community that results from other com-\nmunities. Therefore, it can be employed to reflect and symbolize some kind of\nidentity: regional, social, ethnic, or religious. A standardized variety can also be\nused to give prestige to speakers, marking off those who employ it from those\nwho do not, i.e., those who continue to speak a nonstandard variety. It can\ntherefore serve as a kind of goal for those who have somewhat different norms;\nStandard English and Standard French are such goals for many whose norms are\ndialects of these languages. However, as we will see (particularly in chapters 6–\n8), these goals are not always pursued and may even be resisted.\nIt still may not be at all easy for us to define Standard English because of\na failure to agree about the norm or norms that should apply. For example,\nTrudgill (1995, pp. 5–6) defines Standard English as follows (note his use of\n‘usually’ and ‘normally’ in this definition):\nStandard English is that variety of English which is usually used in print, and\nwhich is normally taught in schools and to non-native speakers learning the lan-\nguage. It is also the variety which is normally spoken by educated people and used\nin news broadcasts and other similar situations. The difference between standard\nand nonstandard, it should be noted, has nothing in principle to do with differ-\nences between formal and colloquial language, or with concepts such as ‘bad\nlanguage.’ Standard English has colloquial as well as formal variants, and Standard\nEnglish speakers swear as much as others.\nHistorically, the standard variety of English is based on the dialect of English\nthat developed after the Norman Conquest resulted in the permanent removal\nof the Court from Winchester to London. This dialect became the one preferred\nby the educated, and it was developed and promoted as a model, or norm, for\nwider and wider segments of society. It was also the norm that was carried\noverseas, but not one unaffected by such export. Today, Standard English is\ncodified to the extent that the grammar and vocabulary of English are much the\nsame everywhere in the world: variation among local standards is really quite\nminor, being differences of ‘flavor’ rather than of ‘substance,’ so that theSingapore,\nSouth African, and Irish varieties are really very little different from one another\nso far as grammar and vocabulary are concerned. Indeed, Standard English is\nso powerful that it exerts a tremendous pressure on all local varieties, to the\nextent that many of the long-established dialects of England and the Lowlands\nEnglish of Scotland have lost much of their vigor. There is considerable pressure\non them to converge toward the standard. This latter situation is not unique to\nEnglish: it is also true in other countries in which processes of standardization\nare under way. It does, however, sometimes create problems for speakers who\ntry to strike some kind of compromise between local norms and national, even\nsupranational, ones.\nGovernments sometimes very deliberately involve themselves in the standard-\nization process by establishing official bodies of one kind or another to regulate\nlanguage matters or to encourage changes felt to be desirable. One of the most\nfamous examples of an official body established to promote the language of a\ncountry was Richelieu’s establishment of the Académie Française in 1635. Founded\nAITC02 35 5\/9\/05, 4:36 PM 36 Languages, Dialects, and Varieties\nat a time when a variety of languages existed in France, when literacy wasconfined\nto a very few, and when there was little national consciousness, the Académie\nFrançaise faced an unenviable task: the codification of French spelling,vocabulary,\nand grammar. Its goal was to fashion and reinforce French nationality, a most\nimportant task considering that, even two centuries later in the early nineteenth\ncentury, the French of Paris was virtually unknown in many parts of thecountry,\nparticularly in the south. Similar attempts to found academies in England and\nthe United States for the same purpose met with no success, individualdictionary-\nmakers and grammar-writers having performed much the same function for\nEnglish. Since both French and English are today highly standardized, one might\nquestion whether such academies serve a useful purpose, yet it is difficult to\nimagine France without the Académie Française: it undoubtedly has had a con-\nsiderable influence on the French people and perhaps on their language.\nStandardization is sometimes deliberately undertaken quite rapidly for polit-\nical reasons. In the nineteenth century Finns developed their spoken language to\nmake it serve a complete set of functions. They needed a standardized language\nto assert their independence from both Swedes and Russians. They succeeded in\ntheir task so that now the Finnish language has become a strong force in the\nnation’s political life and a strong marker of Finnish identity among Germanic\ntongues on the one side and Slavic tongues on the other. In the twentieth cen-\ntury the Turks under Atatürk were likewise successful in their attempt to both\nstandardize and ‘modernize’ Turkish. Today, we can see similar attempts atrapid\nstandardization in countries such as India (Hindi), Israel (Hebrew), Papua New\nGuinea (Tok Pisin), Indonesia (Bahasa Indonesia), and Tanzania (Swahili). In\neach case a language or a variety of a language had to be selected, developedin\nits resources and functions, and finally accepted by the larger society. As we\nhave seen, standardization is an ideological matter. Williams (1992, p. 146) calls\nit ‘a sociopolitical process involving the legitimisation and institutionalisation\nof a language variety as a feature of sanctioning of that variety as socially\npreferable.’ It creates a preferred variety of a language, which then becomes the\nwinner in a struggle for dominance. The dispreferred varieties are losers.\nThe standardization process occasionally results in some languages actually\nachieving more than one standardized variety. Norwegian is a good examplewith\nits two standards, Nynorsk and Bokmål. In this case there is a special problem,\nthat of trying to unify the two varieties in a way that pleases everyone. Some\nkind of unification or amalgamation is now official government policy (see\npp. 373–4). Countries with two or more competing languages that cannot\npossibly be unified may tear themselves apart, as we saw in Yugoslavia, or\nperiodically seem to come very close to doing that, as with Belgium and Canada\n(see chapter 15).\nStandardization is also an ongoing matter, for only ‘dead’ languages like Latin\nand Classical Greek are standardized for all time. Living languages change and\nthe standardization process is necessarily an ongoing one. It is also one that may\nbe described as more advanced in languages like French or German and less\nadvanced in languages like Bahasa Indonesia and Swahili.\nHindi is still in the process of being standardized in India. That process is\nhindered by widespread regional resistance to Hindi out of the fear that regional\nAITC02 36 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 37\nlanguages may be submerged or, if not submerged, quite diminished. So far as\nstandardization is concerned, there are problems with accepting local varieties,\nand with developing and teaching the existing standard as though it were a\nclassical language like Sanskrit and downplaying it as a living language. Hindi\nis still often taught much like Latin in schools in the West; it is in many places\nan underused second language at best; children are not encouraged ‘to play in\nHindi,’ and teachers rarely employ Hindi as a language of instruction. Likewise,\nthe kinds of literature available in Hindi are still very limited, there being short-\nages of everyday reading materials that might appeal to the young, e.g., comic\nbooks, mystery stories, and collections of folk tales. Consequently, the process\nof the standardization of a ‘living’ Hindi is proving to be a slow one.\nThe standardization process is also obviously one that attempts either toreduce\nor to eliminate diversity and variety. However, there may well be a sense inwhich\nsuch diversity and variety are ‘natural’ to all languages, assuring them of their\nvitality and enabling them to change (see chapter 8). To that extent, standard-\nization imposes a strain on languages or, if not on the languages themselves, on\nthose who take on the task of standardization. That may be one of the reasons\nwhy various national academies have had so many difficulties in their work:they\nare essentially in a no-win situation, always trying to ‘fix’ the consequences of\nchanges that they cannot prevent, and continually being compelled to issue new\npronouncements on linguistic matters. Unfortunately, those who think you can\nstandardize and ‘fix’ a language for all time are often quite influential. They\noften find ready access to the media, there to bewail the fact that English, for\nexample, is becoming ‘degenerate’ and ‘corrupt,’ and to advise us to return to\nwhat they regard as a more perfect past. They may also resist what they con-\nsider to be ‘dangerous’ innovations, e.g., the translation of a sacred book into\na modern idiom or the issue of a new dictionary. Since the existence of internal\nvariation is one aspect of language and the fact that all languages keep changing\nis another, we cannot be too sympathetic to such views.\nVitality, the second of Bell’s seven criteria, refers to the existence of a living\ncommunity of speakers. This criterion can be used to distinguish languages that\nare ‘alive’ from those that are ‘dead.’ Two Celtic languages of the United King-\ndom are now dead: Manx, the old language of the Isle of Man, and Cornish.\nManx died out after World War II, and Cornish disappeared at the end of the\neighteenth century, one date often cited being 1777, when the last known speaker,\nDorothy Pentreath of Mousehole, died. Many of the aboriginal languages of the\nAmericas are also dead. Latin is dead in this sense too for no one speaks it as\na native language; it exists only in a written form frozen in time, pronounced\nrather than spoken, and studied rather than used.\nOnce a language dies it is gone for all time and not even the so-called revival\nof Hebrew contradicts that assertion. Hebrew always existed in a spoken form\nas a liturgical language, as did Latin for centuries. Modern Hebrew is an out-\ngrowth of this liturgical variety. It is after all ‘Modern’ Hebrew and thenecessary\nsecularization of a liturgical language to make it serve the purposes of modern\nlife has not been an easy and uncontroversial matter. Many languages, while not\ndead yet, nevertheless are palpably dying: the number of people who speak them\ndiminishes drastically each year and the process seems irreversible, so that the\nAITC02 37 5\/9\/05, 4:36 PM 38 Languages, Dialects, and Varieties\nbest one can say of their vitality is that it is flagging. For example, the French\ndialects spoken in the Channel Islands of Jersey, Guernsey, and Sark are rapidly\non their way to extinction. Each year that passes brings a decrease in thenumber\nof languages spoken in the world (see pp. 378–9).\nWe should note that a language can remain a considerable force even after it\nis dead, that is, even after it is no longer spoken as anyone’s first language and\nexists almost exclusively in one or more written forms, knowledge of which is\nacquired only through formal education. Classical Greek and Latin still have\nconsiderable prestige in the Western world, and speakers of many modern lan-\nguages continue to draw on them in a variety of ways. Sanskrit is important in\nthe same way to speakers of Hindi; Classical Arabic provides a unifying force\nand set of resources in the Islamic world; and Classical Chinese has consider-\nably influenced not only modern Chinese but also Japanese and Korean. Such\ninfluences cannot be ignored, because the speakers of languages subject to\nsuch influences are generally quite aware of what is happening: we can even say\nthat such influence is part of their knowledge of the language. We can also\nperiodically observe deliberate attempts to throw off an influence perceived to\nbe alien: for example, Atatürk’s largely successful attempt to reduce the Arabic\ninfluence on Turkish, and periodic attempts to ‘purify’ languages such as French\nand German of borrowings from English. While in the case of Hebrew, alanguage\nused only in a very restricted way for religious observances was successfully\nexpanded for everyday use, we should note that a similar attempt to revitalize\nGaelic in Ireland has been almost a complete failure.\nHistoricity refers to the fact that a particular group of people finds a sense of\nidentity through using a particular language: it belongs to them. Social, political,\nreligious, or ethnic ties may also be important for the group, but the bond\nprovided by a common language may prove to be the strongest tie of all. In the\nnineteenth century a German nation was unified around the German language\njust as in the previous century Russians had unified around a revitalized Russian\nlanguage. Historicity can be long-standing: speakers of the different varieties of\ncolloquial Arabic make much of a common linguistic ancestry, as obviously do\nspeakers of Chinese. It can also, as with Hebrew, be appealed to as a unifying\nforce among a threatened people.\nAutonomy is an interesting concept because it is really one of feeling. Alanguage\nmust be felt by its speakers to be different from other languages. However, this\nis a very subjective criterion. Ukrainians say their language is quite different\nfrom Russian and deplored its Russification when they were part of the Soviet\nUnion. Some speakers of African American Vernacular English (see chapter 14)\nmaintain that their language is not a variety of English but is a separatelanguage\nin its own right and refer to it as Ebonics. In contrast, speakers of Cantoneseand\nMandarin deny that they speak different languages: they maintain thatCantonese\nand Mandarin are not autonomous languages but are just two dialects ofChinese.\nAs we will see (chapter 3), creole and pidgin languages cause us not a fewproblems\nwhen we try to apply this criterion: how autonomous are such languages?\nReduction refers to the fact that a particular variety may be regarded as a\nsub-variety rather than as an independent entity. Speakers of Cockney will\nalmost certainly say that they speak a variety of English, admit that they are not\nAITC02 38 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 39\nrepresentative speakers of English, and recognize the existence of other varieties\nwith equivalent subordinate status. Sometimes the reduction is in the kinds of\nopportunities afforded to users of the variety. For example, there may be areduc-\ntion of resources; that is, the variety may lack a writing system. Or there may\nbe considerable restrictions in use; e.g., pidgin languages are very much reduced\nin the functions they serve in society in contrast to standardized languages.\nMixture refers to feelings speakers have about the ‘purity’ of the variety they\nspeak. This criterion appears to be more important to speakers of somelanguages\nthan of others, e.g., more important to speakers of French and German than to\nspeakers of English. However, it partly explains why speakers of pidgins andcreoles\nhave difficulty in classifying what they speak as full languages: these varieties\nare, in certain respects, quite obviously ‘mixed,’ and the people who speak them\noften feel that the varieties are neither one thing nor another, but rather aredebased,\ndeficient, degenerate, or marginal varieties of some other standard language.\nFinally, having de facto norms refers to the feeling that many speakers have\nthat there are both ‘good’ speakers and ‘poor’ speakers and that the good\nspeakers represent the norms of proper usage. Sometimes this means focusing on\none particular sub-variety as representing the ‘best’ usage, e.g., Parisian French\nor the Florentine variety of Italian. Standards must not only be established (by\nthe first criterion above), they must also be observed. When all the speakers of\na language feel that it is badly spoken or badly written almost everywhere, that\nlanguage may have considerable difficulty in surviving; in fact, such a feeling is\noften associated with a language that is dying. Concern with the norms of\nlinguistic behavior, ‘linguistic purism’ (see Thomas, 1991), may become very\nimportant among specific segments of society. For example, so far as English is\nconcerned, there is a very profitable industry devoted to telling people how they\nshould behave linguistically, what it is ‘correct’ to say, what to avoid saying, and\nso on (see Baron, 1982, Cameron, 1995, and Wardhaugh, 1999). As we will see\n(chapters 7–8), people’s feelings about norms have important consequences for\nan understanding of both variation and change in language.\nIf we apply the above criteria to the different varieties of speech we observein\nthe world, we will see that not every variety we may want to call a languagehas\nthe same status as every other variety. English is a language, but so are Dogrib,\nHaitian Creole, Ukrainian, Latin, Tok Pisin, and Chinese. Each satisfies a differ-\nent sub-set of criteria from our list. Although there are important differences\namong them, we would be loath to deny that any one of them is a language.They\nare all equals as languages, but that does not necessarily mean that all languages\nare equal! The first is a linguistic judgment, the second a social one.\nAs we have just seen, trying to decide whether something is or is not alanguage\nor in what ways languages are alike and different can be quite troublesome.\nHowever, we usually experience fewer problems of the same kind with regard\nto dialects. There is usually little controversy over the fact that they are either\nregional or social varieties of something that is widely acknowledged to be a\nlanguage. That is true even of the relationship of Cantonese and Mandarin to\nChinese if the latter is given a ‘generous’ interpretation as a language.\nSome people are also aware that the standard variety of any language is\nactually only the preferred dialect of that language: Parisian French, Florentine\nAITC02 39 5\/9\/05, 4:36 PM 40 Languages, Dialects, and Varieties\nItalian, or the Zanzibar variety of Swahili in Tanzania. It is the variety that has\nbeen chosen for some reason, perhaps political, social, religious, or economic,\nor some combination of reasons, to serve as either the model or norm for other\nvarieties. It is the empowered variety. As a result, the standard is often not called\na dialect at all, but is regarded as the language itself. It takes on an ideological\ndimension and becomes the ‘right’ and ‘proper’ language of the group of people,\nthe very expression of their being. One consequence is that all other varieties\nbecome related to that standard and are regarded as dialects of that standard\nwith none of the power of that standard. Of course, this process usually involves\na complete restructuring of the historical facts. If language X1 differentiates in\nthree areas to become dialects XA, XB, and XC, and then XA is elevated to\nbecome a later standard X2, then XB, and XC are really historical variants of\nX1, not sub-varieties of X2. What happens in practice is that XB and XCundergo\npressure to change toward X2, and X2, the preferred variety or standard, exerts\nits influence over the other varieties.\nWe see a good instance of this process in Modern English. The new standard\nis based on the dialect of the area surrounding London, which was just one of\nseveral dialects of Old English, and not the most important for both the western\nand northern dialects were once at least equally as important. However, in the\nmodern period, having provided the base for Standard English, this dialect\nexerts a strong influence over all the other dialects of England so that it is not\njust first among equals but rather represents the modern language itself to the\nextent that the varieties spoken in the west and north are generally regarded as\nits local variants. Historically, these varieties arise from different sources, but\nnow they are viewed only in relation to the standardized variety.\nA final comment seems called for with regard to the terms language and\ndialect. A dialect is a subordinate variety of a language, so that we can say that\nTexas English and Swiss German are, respectively, dialects of English andGerman.\nThe language name (i.e., English or German) is the superordinate term. We can\nalso say of some languages that they contain more than one dialect; e.g.,English,\nFrench, and Italian are spoken in various dialects. If a language is spoken by so\nfew people, or so uniformly, that it has only one variety, we might be tempted\nto say that language and dialect become synonymous in such a case. However,\nanother view is that it is inappropriate to use dialect in such a situation because\nthe requirement of subordination is not met. Consequently, to say that we have\ndialect A of language X must imply also the existence of dialect B of language\nX, but to say we have language Y is to make no claim about the number of\ndialect varieties in which it exists: it may exist in only a single variety, or it may\nhave two (or more) subordinate dialects: dialects A, B, and so on.\nFinally, two other terms are important in connection with some of the issues\ndiscussed above: vernacular and koiné. Petyt (1980, p. 25) defines the former\nas ‘the speech of a particular country or region,’ or, more technically, ‘a form\nof speech transmitted from parent to child as a primary medium of commun-\nication.’ If that form of speech is Standard English, then Standard English is\nthe vernacular for that particular child; if it is a regional dialect, then that dia-\nlect is the child’s vernacular. A koiné is ‘a form of speech shared by people of\ndifferent vernaculars – though for some of them the koiné itself may be their\nAITC02 40 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 41\nvernacular.’ A koiné is a common language, but not necessarily a standard one.\nPetyt’s examples of koinés are Hindi for many people in India and Vulgar Latin\n(vulgar: ‘colloquial’ or ‘spoken’) in the Roman Empire. The original koiné was,\nof course, the Greek koiné of the Ancient World, a unified version of the Greek\ndialects, which after Alexander’s conquests (circa 330 bce) became the lingua\nfranca of the Western world, a position it held until it was eventually super-\nseded, not without a struggle, by Vulgar Latin.\nDiscussion\n1. A survey of the following kind might prove quite revealing. Ask a variety\nof people you know questions such as these, and then try to organize their\nresponses in a systematic way:\na. Which language(s) do you speak?\nb. Do you speak a dialect of X?\nc. Where is the best X spoken?\nd. What is your native language (or mother tongue)?\ne. Do you speak X with an accent? If so, what accent?\nTry also to get definitions from your informants for each of the terms that\nyou use.\n2. A question found on many national census forms concerns the language or\nlanguages spoken (or known). It may ask respondents either to check one\nor more language names or to volunteer a name or names. What problems\ndo you see in collecting data in such a way? Think of countries like China,\nthe United States, Canada, India, France, Spain, and Norway.\n3. Is Afrikaans a dialect of Dutch or a different language? To attempt ananswer\nto this question you will have to consider a variety of issues: What is the\norigin of Afrikaans? Are Afrikaans and Dutch mutually intelligible? How\ndifferent are the orthographies (i.e., systems of spelling), sounds,vocabularies,\nand grammars? How important is the factor of the national consciousness\nof those who speak Afrikaans? Is the initial question clearly answerable\nfrom the kinds of theories and data that are currently available to us?\n4. Speakers of Faroese are said to understand speakers of Icelandic but not\nvice versa. Danes seem to understand Norwegians better than Norwegians\nunderstand Danes. Monolingual speakers of Mandarin and Cantonese can-\nnot communicate with each other in speech. What do such facts have to\nsay about using the criterion of mutual intelligibility in deciding whether\nwe are dealing with a single language, with two dialects of one language,\nor with two separate languages? Consider the following pieces of evidence\nin arriving at your answer. Speakers of Isoko in Nigeria say they cannot\nunderstand those who speak other Urhobo languages\/dialects; but these\nothers apparently understand them. This situation seems to have devel-\noped concurrently with demands for greater political autonomy and ethnic\nself-sufficiency.\nAITC02 41 5\/9\/05, 4:36 PM 42 Languages, Dialects, and Varieties\n5. Standard languages are usually based on an existing dialect of thelanguage.\nFor example, the British variety of English is based, historically at least,\non the dialect of the area surrounding London, Continental French on the\ndialect of Paris, and Italian on the dialect of Florence or Tuscany (although\nRome and Milan became important influences in the late twentiethcentury).\nIn other countries the situation is not so clear-cut. What can you find out\nabout the difficulties of choosing a variety for standardization in Denmark,\nIndonesia, Greece, China, Haiti, and the Arab world?\n6. Old English, the language spoken a thousand years ago in England, was\na west-country variety of English, West Saxon. The court was located at\nWinchester and the literature and documents of the period were written in\nWest Saxon (or sometimes in Latin). By 1400 the English court was well\nestablished in London, which became the center of social, political, and\neconomic power. It also became the literary center of the country, particu-\nlarly after the development of printing. The variety of English spoken in\nand around London, including Oxford and Cambridge (which wereimport-\nant intellectual centers), became predominant. How would you use facts\nsuch as these to argue that no variety of a language is intrinsically better\nthan another and that what happens to a language is largely the result of\nthe chance interplay of external forces? Can you think of other examples\nwhich might support such a conclusion?\n7. Mencken wrote a series of books under the general title TheAmerican\nLanguage. Why did he choose this particular title? Why not The English\nLanguage in America? If the English of the United States is properlyregarded\nas a separate language, how about the varieties found in Canada,Australia,\nSouth Africa, and Singapore? You might read Lilles (2000) for a strongly\nexpressed dismissal of ‘Canadian English,’ as a ‘fiction [without] any value\nlinguistically, pragmatically, socially, or politically’ (p. 9). (See Clyne, 1992,\nfor a discussion of what he calls ‘pluricentric languages.’)\n8. One of the goals Dr Johnson set himself in compiling his Dictionary of\n1755 was to ‘fix,’ i.e., standardize, English. What does Johnson say in the\nPreface to that dictionary about his success in meeting that goal?\n9. The publication in 1961 of Webster’s Third New InternationalDictionary\ncaused a tremendous stir in North America, being regarded by many critics\nas an attack on prevailing language standards. What were the issues? (See\nSledd and Ebbitt, 1962, Finegan, 1980, and Wardhaugh, 1999.)\n10. Writing of the codification of Standard English, Leith (1997, pp. 56–7)\nsays that ‘by analyzing “correct” usage in terms that only a tiny minority\nof educated people could command, the codifiers ensured that correctness\nremained the preserve of an elite. The usage of most people was wrong,\nprecisely because it was the usage of the majority.’ There appear to be both\nadvantages and disadvantages to having a ‘standard language.’ Is it pos-\nsible to make an objective assessment of these? Or is any judgment inher-\nently ideological?\n11. If Scotland continues to devolve from England, what might this mean for\nthe variety of English spoken there? How might Scots becomeunequivocally\na distinctive variety of English?\nAITC02 42 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 43\n12. Arabs have a particular historical view of Arabic and Turks of Turkish.\nTry to find out something about these views. How do they help Arabs and\nTurks to maintain their languages? Hindi and Urdu are now viewed as\nrather different by those who speak these languages. How is each language\nbeing reshaped to conform to these views?\n13. How would you evaluate each of the following languages according to\nthe criteria stated above (standardization, vitality, historicity, autonomy,\nreduction, mixture, and de facto norms); that is, for each criterion, does\nthe language possess the stated characteristic or lack it: Haitian Creole,\nProvençal, Singapore English, Old English, Pitcairnese, African American\nVernacular English, Tok Pisin, Cockney, Ukrainian, and the language of\nShakespeare’s plays?\n14. Find out what you can about Basic English. In what ways is it a reduced\nform of Standard English? Do the kinds of reductions introduced intoBasic\nEnglish make it ‘simpler’ to learn and use? (You will have to define‘simpler.’)\n15. From time to time certain users of languages such as French and German\nhave objected to borrowings, in particular borrowings from English. What\nAnglicisms have been objected to? What kinds of native resources have\nbeen suggested as suitable alternative sources of exploitation in order to\ndevelop and\/or purify the language? What motivates the objections?\n16. Some Chinese scholars are concerned with developing the vocabulary of\nChinese to make it usable for every kind of scientific and technical endeavor.\nThey reject the idea that such vocabulary should be borrowed from other\nlanguages. What do you think they hope to gain by doing this? Do they\nlose anything if they are successful?\n17. ‘A language is a dialect with an army and a navy’ is a well-known observa-\ntion. (Today we would add an ‘airforce’!) True? And, if so, what are the\nconsequences?\n18. In the UNESCO Courier of April, 2000, a writer makes the following\nobservation: ‘Languages usually have a relatively short life span as well as\na very high death rate. Only a few, including Basque, Egyptian, Chinese,\nGreek, Hebrew, Latin, Persian, Sanskrit, and Tamil have lasted more than\n2000 years.’ How is this statement at best a half-truth?\n19. Are the Australian, New Zealand, Canadian, and other national varieties\nof English ‘new dialects’ of English, or autonomous languages, or possibly\neven both? (See Hickey, 2004, Gordon et al., 2004, and Trudgill, 2004.)\nRegional Dialects\nRegional variation in the way a language is spoken is likely to provide one of\nthe easiest ways of observing variety in language. As you travel throughout a\nwide geographical area in which a language is spoken, and particularly if that\nlanguage has been spoken in that area for many hundreds of years, you are\nalmost certain to notice differences in pronunciation, in the choices and forms\nAITC02 43 5\/9\/05, 4:36 PM 44 Languages, Dialects, and Varieties\nof words, and in syntax. There may even be very distinctive local colorings in\nthe language which you notice as you move from one location to another. Such\ndistinctive varieties are usually called regional dialects of the language. As we\nsaw earlier (p. 28), the term dialect is sometimes used only if there is a strong\ntradition of writing in the local variety. Old English and to a lesser extentMiddle\nEnglish had dialects in this sense. In the absence of such a tradition of writing\nthe term patois may be used to describe the variety. However, many linguists\nwriting in English tend to use dialect to describe both situations and rarely, if\nat all, use patois as a scientific term. You are likely to encounter it only as a kind\nof anachronism, as in its use by Jamaicans, who often refer to the variety of\nEnglish spoken on the island as a ‘patois.’\nThe dialect–patois distinction actually seems to make more sense in some\nsituations, e.g., France, than in others. In medieval France, a number oflanguages\nflourished and several were associated with strong literary traditions. However,\nas the language of Paris asserted itself from the fourteenth century on, these\ntraditions withered. Parisian French spread throughout France, and, even though\nthat spread is still not yet complete (as visits to such parts of France as Brittany,\nProvence, Corsica, and Alsace will confirm), it drastically reduced theimportance\nof the local varieties: they continue to exist largely in spoken forms only; they\nare disfavored socially and politically; they are merely patois to those who extol\nthe virtues of Standard French. However, even as these varieties have faded,\nthere have been countervailing moves to revive them as many younger residents\nof the areas in which they are spoken see them as strong indicators of identities\nthey wish to preserve.\nThere are some further interesting differences in the use of the terms dialect\nand patois (Petyt, 1980, pp. 24–5). Patois is usually used to describe only rural\nforms of speech; we may talk about an urban dialect, but to talk about an urban\npatois seems strange. Patois also seems to refer only to the speech of the lower\nstrata in society; again, we may talk about a middle-class dialect but not,\napparently, about a middle-class patois. Finally, a dialect usually has a wider\ngeographical distribution than a patois, so that, whereas regional dialect and\nvillage patois seem unobjectionable, the same cannot be said for regional patois\nand village dialect. However, as I indicated above, many Jamaicans refer to the\npopular spoken variety of Jamaican English as a patois rather than as a dialect.\nSo again the distinction is in no way an absolute one.\nThis use of the term dialect to differentiate among regional varieties of specific\nlanguages is perhaps more readily applicable to contemporary conditions in\nEurope and some other developed countries than it would have been in medieval\nor Renaissance Europe or today in certain other parts of the world, where it was\n(and still is) possible to travel long distances and, by making only small changes\nin speech from location to location, continue to communicate with theinhabitants.\n(You might have to travel somewhat slowly, however, because of the necessary\nlearning that would be involved!) It has been said that at one time a person\ncould travel from the south of Italy to the north of France in this manner. It is\nquite clear that such a person began the journey speaking one language and\nended it speaking something entirely different; however, there was no one point\nat which the changeover occurred, nor is there actually any way of determining\nAITC02 44 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 45\nhow many intermediate dialect areas that person passed through. For an intrigu-\ning empirical test of this idea, one using recent phonetic data from a continuum\nof Saxon and Franconian dialects in the Netherlands, see Heeringa and Nerbonne\n(2001). They conclude that the traveler ‘perceives phonological distanceindirectly’\n(p. 398) and that there are ‘unsharp borders between dialect areas’ (p. 399).\nSuch a situation is often referred to as a dialect continuum. What you have\nis a continuum of dialects sequentially arranged over space: A, B, C, D, and so\non. Over large distances the dialects at each end of the continuum may well\nbe mutually unintelligible, and also some of the intermediate dialects may be\nunintelligible with one or both ends, or even with certain other intermediate\nones. In such a distribution, which dialects can be classified together under one\nlanguage, and how many such languages are there? As I have suggested, such\nquestions are possibly a little easier to answer today in certain places than they\nonce were. The hardening of political boundaries in the modern world as a\nresult of the growth of states, particularly nation-states rather than multina-\ntional or multi-ethnic states, has led to the hardening of language boundaries.\nAlthough residents of territories on both sides of the Dutch–German border\n(within the West Germanic continuum) or the French–Italian border (within the\nWest Romance continuum) have many similarities in speech even today, they\nwill almost certainly tell you that they speak dialects of Dutch or German in the\none case and French or Italian in the other. Various pressures – political, social,\ncultural, and educational – serve to harden current state boundaries and to\nmake the linguistic differences among states more, not less, pronounced.Dialects\ncontinue therefore to disappear as national languages arise. They are subject to\ntwo kinds of pressure: one from within, to conform to a national standard, and\none from without, to become different from standards elsewhere.\nWhen a language is recognized as being spoken in different varieties, the issue\nbecomes one of deciding how many varieties and how to classify each variety.\nDialect geography is the term used to describe attempts made to map the distri-\nbutions of various linguistic features so as to show their geographical prov-\nenance. For example, in seeking to determine features of the dialects of English\nand to show their distributions, dialect geographers try to find answers to ques-\ntions such as the following. Is this an r-pronouncing area of English, as in words\nlike car and cart, or is it not? What past tense form of drink do speakers prefer?\nWhat names do people give to particular objects in the environment, e.g., elev-\nator or lift, petrol or gas, carousel or roundabout? Sometimes maps are drawn\nto show actual boundaries around such features, boundaries called isoglosses, so\nas to distinguish an area in which a certain feature is found from areas in which\nit is absent. When several such isoglosses coincide, the result is sometimes called\na dialect boundary. Then we may be tempted to say that speakers on one side\nof that boundary speak one dialect and speakers on the other side speak a\ndifferent dialect.\nAs we will see when we return once again to this topic in chapter 6, there are\nmany difficulties with this kind of work: finding the kinds of items that appear\nto distinguish one dialect from another; collecting data; drawing conclusions\nfrom the data we collect; presenting the findings; and so on. It is easy to see,\nhowever, how such a methodology could be used to distinguish British,American,\nAITC02 45 5\/9\/05, 4:36 PM 46 Languages, Dialects, and Varieties\nAustralian, and other varieties of English from one another as various dialects\nof one language. It could also be used to distinguish Cockney English fromTexas\nEnglish. But how could you use it to distinguish among the multifariousvarieties\nof English found in cities like New York and London? Or even among the\nvarieties we observe to exist in smaller, less complex cities and towns in which\nvarious people who have always resided there are acknowledged to speak dif-\nferently from one another?\nFinally, the term dialect, particularly when it is used in reference to regional\nvariation, should not be confused with the term accent. Standard English, for\nexample, is spoken in a variety of accents, often with clear regional and social\nassociations: there are accents associated with North America, Singapore, India,\nLiverpool (Scouse), Tyneside (Geordie), Boston, New York, and so on. However,\nmany people who live in such places show a remarkable uniformity to oneanother\nin their grammar and vocabulary because they speak Standard English and the\ndifferences are merely those of accent, i.e., how they pronounce what they say.\nOne English accent has achieved a certain eminence, the accent known as\nReceived Pronunciation (or RP), the accent of perhaps as few as 3 percent of\nthose who live in England. (The ‘received’ in Received Pronunciation is a little\nbit of old-fashioned snobbery: it means the accent allows one to be received into\nthe ‘better’ parts of society!) This accent is of fairly recent origin (see Mugglestone,\n1995), becoming established as prestigious only in the late nineteenth century\nand not even given its current label until the 1920s. In the United Kingdom at\nleast, it is ‘usually associated with a higher social or educational background,\nwith the BBC and the professions, and [is] most commonly taught to students\nlearning English as a foreign language’ (Wakelin, 1977, p. 5). For many such\nstudents it is the only accent they are prepared to learn, and a teacher who does\nnot use it may have difficulty in finding a position as a teacher of English in\ncertain non-English-speaking countries in which a British accent is preferred over\na North American one. In fact, those who use this accent are often regarded as\nspeaking ‘unaccented’ English because it lacks a regional association within\nEngland. Other names for this accent are the Queen’s English, Oxford English,\nand BBC English. However, there is no unanimous agreement that the Queen\ndoes in fact use RP, a wide variety of accents can be found among the staff and\nstudents at Oxford University, and regional accents are now widely used in the\nvarious BBC services. As Bauer (1994, pp. 115–21) also shows, RP continues to\nchange. One of its most recent manifestations has been labeled ‘Estuary English’\n(Rosewarne, 1994) – sometimes also called ‘Cockneyfied RP’ – a development\nof RP along the lower reaches of the Thames reflecting a power shift in London\ntoward the world of finance, banking, and commerce and away from that of\ninherited position, the Church, law, and traditional bureaucracies. Trudgill (1995,\np. 7) has pointed out what he considers to be the most interesting characteristics\nof RP: ‘the relatively very small numbers of speakers who use it do not identify\nthemselves as coming from any particular geographical region’; ‘RP is largely\nconfined to England’ and there it is a ‘non-localized accent’; and ‘it is...not\nnecessary to speak RP to speak Standard English’ because ‘Standard English can\nbe spoken with any regional accent, and in the vast majority of cases normally\nis.’ It is also interesting to observe that the 1997 English PronouncingDictionary\nAITC02 46 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 47\npublished by Cambridge University Press abandoned the label RP in favor of\nBBC English even though this latter term is not unproblematic as the BBC itself\nhas enlarged the accent pool from which it draws its newsreaders.\nThe development of Estuary English is one part of a general leveling ofaccents\nwithin the British Isles. The changes are well documented; see, for example,\nFoulkes and Docherty (1999), who review a variety of factors involved in the\nchanges that are occurring in cities. One feature of Estuary English, the use of\na glottal stop for t (Fabricus, 2002), is also not unique to that variety but is\nspreading widely, for example to Newcastle, Cardiff, and Glasgow, and even as\nfar north as rural Aberdeenshire in northeast Scotland (Marshall, 2003). Watt\n(2000, 2002) used the vowels in face and goat to show that Geordie, theNewcastle\naccent, levels toward a regional accent norm rather than toward a national one,\nalmost certainly revealing a preference for establishing a regional identity rather\nthan either a very limited local identity or a wider national one.\nThe most generalized accent in North America is sometimes referred to as\nGeneral American or, more recently, as network English, the accent associated\nwith announcers on the major television networks. Other languages often have\nno equivalent to RP: for example, German is spoken in a variety of accents,\nnone of which is deemed inherently any better than any other. Educated regional\nvarieties are preferred rather than some exclusive upper-class accent that has no\nclear relationship to personal achievement.\nAs a final observation I must reiterate that it is impossible to speak English\nwithout an accent. There is no such thing as an ‘unaccented English.’ RP is an\naccent, a social one rather than a regional one. However, we must note thatthere\nare different evaluations of the different accents, evaluations arising from social\nfactors not linguistic ones. Matsuda (1991, p. 1361) says it is really an issue of\npower: ‘When...parties are in a relationship of domination and subordination\nwe tend to say that the dominant is normal, and the subordinate is different\nfrom normal. And so it is with accent....People in power are perceived as\nspeaking normal, unaccented English. Any speech that is different from that\nconstructed norm is called an accent.’ In the pages that follow we will return\nconstantly to linguistic issues having to do with power.\nDiscussion\n1. What regional differences are you aware of in the pronunciation of each\nof the following words: butter, farm, bird, oil, bag, cot, caught, which,\nwitch, Cuba, spear, bath, with, happy, house, Mary, merry, marry?\n2. What past tense or past participle forms have you heard for each of the\nfollowing verbs: bring, drink, sink, sing, get, lie, lay, dive?\n3. What are some other variants you are aware of for each of the following\nsentences: ‘I haven’t any money,’ ‘I ain’t done it yet,’ ‘He be farmer,’ ‘Giveit\nme,’ ‘It was me what told her’? Who uses each variant? On whatoccasions?\n4. What other names are you aware of for objects sometimes referred to as\nseesaws, cobwebs, sidewalks, streetcars, thumbtacks, soft drinks, gym shoes,\nelevators? Again, who uses each variant?\nAITC02 47 5\/9\/05, 4:36 PM 48 Languages, Dialects, and Varieties\n5. What do you yourself call each of the following: cottage cheese, high-\nway, first grade, doughnuts, griddle cakes, peanuts, spring onions, baby\ncarriage, chest of drawers, faucet, frying pan, paper bag, porch, sittingroom,\nsofa, earthworm?\n6. Each of the following is found in some variety of English. Each is compre-\nhensible. Which do you yourself use? Which do you not use? Explain how\nthose utterances you do not use differ from those you do use.\na. I haven’t spoken to him.\nb. I’ve not spoken to him.\nc. Is John at home?\nd. Is John home?\ne. Give me it.\nf. Give it me.\ng. Give us it.\nh. I wish you would have said so.\ni. I wish you’d said so.\nj. Don’t be troubling yourself.\nk. Coming home tomorrow he is.\n7. How might you employ a selection of items from the above questions (or\nsimilar items) to compile a checklist that could be used to determine the\ngeographical (and possibly social) origins of a speaker of English?\n8. A local accent may be either positively or negatively valued. How do you\nvalue each of the following: a Yorkshire accent; a Texas accent; the accents\nof the Queen of England, the Prime Minister of the United Kingdom, and\nthe President of the United States? Think of some others. Why do youreact\nthe way you do? Is it a question of being able to identify with the speaker\nor not; of social class; of education; or stereotyping; or what? How appro-\npriate would each of the following be: RP in a Tyneside working-class pub;\nnetwork English at a Black Power rally in Harlem; and Parisian French at\na hockey game at the Montreal Forum?\n9. A. S. C. Ross, in Noblesse Oblige (Mitford, 1956), a book which discusses\nsomewhat lightheartedly, but not un-seriously, differences between ‘U’\n(upper-class) and ‘non-U’ (not upper-class) speech in the United Kingdom,\nobserves (pp. 75–6):\nMany (but not all) U-speakers make get rhyme with bit, just (adverb) with\nbest, catch with fetch....U-speakers do not sound the l in golf, Ralph\n(which rhymes with safe), solder; some old-fashioned U-speakers do not\nsound it in falcon, Malvern, either, but it is doubtful how far this last\nsurvives....\nReal, ideal have two, respectively, three syllables in U speech, one, respect-\nively, two in non-U speech (note, especially, non-U really, rhyming with\nmealie)....Some U-speakers pronounce tyre and tar identically (and so for\nmany other words, such as fire – even going to the length of making lion\nrhyme with barn).\nAITC02 48 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 49\nRoss makes numerous other observations about differences between the\ntwo varieties. Do you consider such differences to be useful, unnecessary,\nsnobbish, undemocratic, inevitable, or what?\n10. There may have been a recent fall-off in the high social prestige associated\nwith RP in England and elsewhere. How might you establish whether such\nis the case?\n11. Differences in the accent one uses to speak a standard variety of a lan-\nguage may be more important in some parts of the world than others. Are\ndifferences in accent as important within the United States, Canada, and\nAustralia as they appear to be in the British Isles? Do speakers of German\nfrom Hanover, Berlin, Vienna, and Zürich view differences in German\naccent in the same way as speakers of English? What factors appear to\naccount for the different evaluations of accents?\n12. The fact that Standard English can be spoken with a variety of accents\noften poses certain difficulties for the teaching of English in non-English-\nspeaking countries. What are some of the problems you might encounter\nand how might you try to solve them?\n13. Preston (1989) has demonstrated that speakers of English (in this case\nin the United States) have certain perceptions about regional varieties of\nEnglish other than their own, i.e., what they are like and how their own\nvariety differs. Try to describe what you believe to be the characteristics\nof another variety of English and then check out the facts. Try to account\nfor any differences you find between the two, between beliefs and facts.\n(See also Preston, 1999, 2002, and Long and Preston, 2003.)\nSocial Dialects\nThe term dialect can also be used to describe differences in speech associated\nwith various social groups or classes. There are social dialects as well as regional\nones. An immediate problem is that of defining social group (see chapter 5)\nor social class (see chapter 6), giving proper weight to the various factors that\ncan be used to determine social position, e.g., occupation, place of residence,\neducation, ‘new’ versus ‘old’ money, income, racial or ethnic origin, cultural\nbackground, caste, religion, and so on. Such factors as these do appear to be\nrelated fairly directly to how people speak. There is a British ‘public-school’\ndialect, and there is an ‘African American Vernacular English’ dialect found in\ncities such as New York, Detroit, and Buffalo. Many people also havestereotypical\nnotions of how other people speak, and, as we will see in chapter 7 in particular,\nthere is considerable evidence from work of investigators such as Labov and\nTrudgill that social dialects can indeed be described systematically.\nWhereas regional dialects are geographically based, social dialects originate\namong social groups and are related to a variety of factors, the principal ones\napparently being social class, religion, and ethnicity. In India, for example, caste,\none of the clearest of all social differentiators, quite often determines which\nAITC02 49 5\/9\/05, 4:36 PM 50 Languages, Dialects, and Varieties\nvariety of a language a speaker uses. In a city like Baghdad the Christian,\nJewish, and Muslim inhabitants speak different varieties of Arabic. In this case\nthe first two groups use their variety solely within the group but the Muslim\nvariety serves as a lingua franca, or common language, among the groups.\nConsequently, Christians and Jews who deal with Muslims must use twovarieties:\ntheir own at home and the Muslim variety for trade and in all inter-group\nrelationships. Ethnic variation can be seen in the United States, where onevariety\nof English has become so identified with an ethnic group that it is often referred\nto as African American Vernacular English (AAVE). Labov’s work in New York\nCity shows that there are other ethnic differences too: speakers of Jewish and\nItalian ethnicity differentiate themselves from speakers of either the standard\nvariety or AAVE. On occasion they actually show hypercorrective tendencies in\nthat they tend to overdo certain imitative behaviors: Italians are inclined to be\nin the vanguard of pronouncing words like bad and bag with a vowelresembling\nthat of beard and Jews in the vanguard of pronouncing words like dog with a\nvowel something like that of book. A possible motivation for such behavior is\na desire to move away from the Italian and Yiddish vowels that speakers could\nso easily use in these words but which would be clear ethnic markers; however,\nthe movement prompted by such avoidance behavior goes beyond the prevailing\nlocal norm and becomes an ethnic characteristic that serves as an indicator of\nidentity and solidarity.\nStudies in social dialectology, the term used to refer to this branch of linguistic\nstudy, confront many difficult issues, particularly when investigators venture\ninto cities. Cities are much more difficult to characterize linguistically than are\nrural hamlets; variation in language and patterns of change are much more\nobvious in cities, e.g., in family structures, employment, and opportunities for\nsocial advancement or decline. Migration, both in and out of cities, is alsousually\na potent linguistic factor. Cities also spread their influence far beyond their\nlimits and their importance should never be underestimated in considering such\nmatters as the standardization and diffusion of languages.\nIn later chapters (particularly chapters 6–8) we will look closely at the import-\nance of language variation in cities and see how important such variation is in\ntrying to understand how and why change occurs in languages. In this way we\nmay also come to appreciate why some sociolinguists regard such variation as\nbeing at the heart of work in sociolinguistics.\nDiscussion\n1. Gumperz (1968) maintains that separate languages maintain themselves most\nreadily in closed tribal systems in which kinship dominates all activities;\non the other hand, distinctive varieties arise in highly stratified societies.\nHe points out that, when social change causes the breakdown of traditional\nsocial structures and the formation of new ties, linguistic barriers between\nvarieties also break down. Can you think of any examples which either\nconfirm or disconfirm this claim?\nAITC02 50 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 51\n2. If some social dialects may properly be labeled nonstandard, Labov (1970,\np. 52) raises a very important issue in connection with finding speakers who\ncan supply reliable data concerning such varieties. He says:\nWe have not encountered any non-standard speakers who gained good control\nof a standard language, and still retained control of the non-standard verna-\ncular. Dialect differences depend upon low-level rules which appear as minor\nadjustments and extensions of contextual conditions, etc. It appears that such\nconditions inevitably interact, and, although the speaker may indeed appear\nto be speaking the vernacular, close examination of his speech shows that his\ngrammar has been heavily influenced by the standard. He may succeed in\nconvincing his listeners that he is speaking the vernacular, but this impression\nseems to depend upon a number of unsystematic and heavily marked signals.\nIf Labov’s observation is correct, what must we do to gain access to any\ninformation we seek about ‘the non-standard vernacular’? What difficulties\ndo you foresee?\n3. How are language norms established and perpetuated in rather isolated\nrural communities, e.g., a small village in the west of England, or in north-\nern Vermont, or in the interior of British Columbia? How different do you\nthink the situation is in London, New York, or Vancouver? Are there any\nsimilarities at all? How are language norms established overall in England,\nthe United States, and Canada?\nStyles, Registers, and Beliefs\nThe study of dialects is further complicated by the fact that speakers can adopt\ndifferent styles of speaking. You can speak very formally or very informally,\nyour choice being governed by circumstances. Ceremonial occasions almost\ninvariably require very formal speech, public lectures somewhat less formal,\ncasual conversation quite informal, and conversations between intimates on\nmatters of little importance may be extremely informal and casual. (See Joos,\n1962, for an entertaining discussion.) We may try to relate the level of formality\nchosen to a variety of factors: the kind of occasion; the various social, age, and\nother differences that exist between the participants; the particular task that is\ninvolved, e.g., writing or speaking; the emotional involvement of one or more\nof the participants; and so on. We appreciate that such distinctions exist when\nwe recognize the stylistic appropriateness of What do you intend to do, your\nmajesty? and the inappropriateness of Waddya intend doin’, Rex? While it may\nbe difficult to characterize discrete levels of formality, it is nevertheless possible\nto show that native speakers of all languages control a range of stylistic vari-\neties. It is also quite possible to predict with considerable confidence the stylistic\nfeatures that a native speaker will tend to employ on certain occasions. We will\nreturn to related issues in chapters 4, 7, and 11.\nAITC02 51 5\/9\/05, 4:36 PM 52 Languages, Dialects, and Varieties\nRegister is another complicating factor in any study of language varieties.\nRegisters are sets of language items associated with discrete occupational or\nsocial groups. Surgeons, airline pilots, bank managers, sales clerks, jazz fans,\nand pimps employ different registers. As Ferguson (1994, p. 20) says, ‘People\nparticipating in recurrent communication situations tend to develop similar\nvocabularies, similar features of intonation, and characteristic bits of syntax\nand phonology that they use in these situations.’ This kind of variety is aregister.\nFerguson adds that its ‘special terms for recurrent objects and events, and for-\nmulaic sequences or “routines,” seem to facilitate speedy communication; other\nfeatures apparently serve to mark the register, establish feelings of rapport,\nand serve other purposes similar to the accommodation that influences dialect\nformation. There is no mistaking the strong tendency for individuals and co-\ncommunicators to develop register variation along many dimensions.’ Of course,\none person may control a variety of registers: you can be a stockbroker and an\narcheologist, or a mountain climber and an economist. Each register helps you\nto express your identity at a specific time or place, i.e., how you seek to present\nyourself to others.\nDialect, style, and register differences are largely independent: you can talk\ncasually about mountain climbing in a local variety of a language, or you can\nwrite a formal technical study of wine making. You may also be judged to speak\n‘better’ or ‘worse’ than other speakers who have much the same background. It\nis quite usual to find some people who are acknowledged to speak a language\nor one of its varieties better or worse than others. In an article on the varieties\nof speech he found among the 1,700 or so speakers of Menomini, anAmerindian\nlanguage of Wisconsin, Bloomfield (1927) mentioned a variety of skills that\nwere displayed among some of the speakers he knew best: a woman in her\nsixties who spoke ‘a beautiful and highly idiomatic Menomini’; her husband,\nwho used ‘forms which are current among bad speakers’ on some occasions and\n‘elevated speech,’ incorporating forms best described as ‘spellingpronunciations,’\n‘ritualistic compound words and occasional archaisms’ on others; an old man\nwho ‘spoke with bad syntax and meagre, often inept vocabulary, yet with\noccasional archaisms’; a man of about forty with ‘atrocious’ Menomini, i.e.,\na small vocabulary, barbarous inflections, threadbare sentences; and two half-\nbreeds, one who spoke using a vast vocabulary and the other who employed\n‘racy idiom.’\nValue judgments of this kind sometimes emerge for reasons that are hard to\nexplain. For example, there appears to be a subtle bias built into the way people\ntend to judge dialects. Quite often, though not always, people seem to exhibit\na preference for rural dialects over urban ones. In England the speech of North-\numbria seems more highly valued than the speech of Tyneside and certainly\nthe speech of Liverpool seems less valued than that of northwest England as a\nwhole. In North America the speech of upstate New York does not have the\nnegative characteristics associated with much of the speech of New York City.\nWhy such different attitudes should exist is not easy to say. Is it a preference for\nthings that appear to be ‘older’ and ‘more conservative,’ a subconscious dislike\nof some of the characteristics of urbanization, including uncertainty about what\nstandards should prevail, or some other reason or reasons?\nAITC02 52 5\/9\/05, 4:36 PM Languages, Dialects, and Varieties 53\nSometimes these notions of ‘better’ and ‘worse’ solidify into those of ‘correct-\nness’ and ‘incorrectness.’ We may well heed Bloomfield’s words (1927, pp. 432–\n3) concerning the latter notions:\nThe popular explanation of ‘correct’ and ‘incorrect’ speech reduces the matter to\none of knowledge versus ignorance. There is such a thing as correct English. An\nignorant person does not know the correct forms; therefore he cannot help using\nincorrect ones. In the process of education one learns the correct forms and, by\npractice and an effort of will (‘careful speaking’), acquires the habit of using them.\nIf one associates with ignorant speakers, or relaxes the effort of will (‘careless\nspeaking’), one will lapse into the incorrect forms...there is one error in the\npopular view which is of special interest. The incorrect forms cannot be the\nresult of ignorance or carelessness, for they are by no means haphazard, but, on\nthe contrary, very stable. For instance, if a person is so ignorant as not to know\nhow to say I see it in past time, we might expect him to use all kinds of chance\nforms, and, especially, to resort to easily formed locutions, such as I did see it, or\nto the addition of the regular past-time suffix: I seed it. But instead, these ignorant\npeople quite consistently say I seen it. Now it is evident that one fixed and con-\nsistent form will be no more difficult than another: a person who has learned I seen\nas the past of I see has learned just as much as one who says I saw. He has simply\nlearned something different. Although most of the people who say I seen are\nignorant, their ignorance does not account for this form of speech.\nMany people hold strong beliefs on various issues having to do with language\nand are quite willing to offer their judgments on issues (see Bauer and Trudgill,\n1998, Niedzielski and Preston, 1999, and Wardhaugh, 1999). They believe such\nthings as certain languages lack grammar, that you can speak English without\nan accent, that French is more logical than English, that parents teach their\nchildren to speak, that primitive languages exist, that English is degenerating\nand language standards are slipping, that pronunciation should be based on\nspelling, and so on and so on. Much discussion of language matters in the media\nconcerns such ‘issues’ and there are periodic attempts to ‘clean up’ various bits\nand pieces, attempts that Cameron (1995) calls ‘verbal hygiene.’ Most linguists\nstudiously avoid getting involved in such issues having witnessed the failure of\nvarious attempts to influence received opinions on such matters. As I have\nwritten elsewhere (1999, p. viii), ‘Linguists...know that many popular beliefs\nabout language are false and that much we are taught about language is mis-\ndirected. They also know how difficult it is to effect change.’ Language beliefs\nare well entrenched as are language attitudes and language behaviors. Sociolin-\nguists should strive for an understanding of all three because all affect how\npeople behave toward others.\nAs we have seen, many varieties of language exist and each language exists\nin a number of guises. However, languages do not vary in every possible way.\nIt is still quite possible to listen to an individual speaker and infer very specific\nthings about that speaker after hearing relatively little of his or her speech. The\ninteresting problem is accounting for our ability to do that. What are the specific\nlinguistic features we rely on to classify a person as being from a particular\nplace, a member of a certain social class, a representative of a specificprofession,\nAITC02 53 5\/9\/05, 4:36 PM 54 Languages, Dialects, and Varieties\na social climber, a person pretending to be someone he or she is not, and so on?\nOne possible hypothesis is that we rely on relatively few cues, e.g., the presence\nor absence of certain linguistic features. We are also sensitive to the consistency\nor inconsistency in the use of these cues, so that on occasion it is not just that\na particular linguistic feature is always used but that it is used such and such\na percent of the time rather than exclusively or not at all (see chapter 7).\nHowever, we may actually perceive its use or non-use to be categorical, i.e.,\nthe feature to be totally present or totally absent. This last hypothesis is an\ninteresting one in that it raises very important questions about the linguistic\ncapabilities of human beings, particularly about how individuals acquire the\nability to use language in such ways. If you must learn to use both linguistic\nfeature X (e.g., -ing endings on verbs) and linguistic feature Y (e.g., -in’ endings\non verbs) and how to use them in different proportions in situations A, B, C,\nand so on, what does that tell us about innate human abilities and the human\ncapacity for learning?\nThe existence of different varieties is interesting in still another respect.\nWhile each of us may have productive control over only a very few varieties of\na language, we can usually comprehend many more varieties and relate all of\nthese to the concept of a ‘single language.’ That is, our receptive linguistic ability\nis much greater than our productive linguistic ability. An interesting problem for\nlinguists is knowing how best to characterize this ‘knowledge’ that we have\nwhich enables us to recognize something as being in the language but yet marked\nas ‘different’ in some way. Is it part of our competence or part of our perform-\nance in the Chomskyan sense? Or is that a false dichotomy? The first question\nis as yet unanswered but, as the second suggests, it could possibly be unanswer-\nable. I will have more to say on such matters as we look further into the various\nrelationships between language and society.\nDiscussion\n1. When might each of the following sentences be stylistically appropriate?\na. Attention!\nb. I do hereby bequeath...\nc. Our Father, which art in Heaven...\nd. Been to see your Dad recently?\ne. Get lost!\nf. Now if we consider the relationship between social class and income...\ng. Come off it!\nh. Take care!\ni. Haven’t we met somewhere before?\n2. What stylistic characteristics do you associate with each of the following\nactivities: talking to a young child; writing an essay for a professor; play-\ning a board game with a close friend; approaching a stranger on the street\nAITC02 54 5\/9\/05, 4:36 PM "}