{"text":"Neil Bowen, Swansea University (2011) 1\nWhat is dialect and why study it?\nIntroduction\nLanguages evolve, proliferate, and disappear, in a constantly varying, amorphous conglomeration of\ndistinct yet interconnected languages. This diversification extends down into each language creating\nsmaller enclaves of varieties, more commonly termed dialects. But what is dialect and why study it?\nThis paper shall attempt to address the first part of this question via a structural approach to\ndialectology1 in regards to the linguistic aspects of variation that make a dialect unique, namely -\ngrammar, lexis, and phonology. It will then address some of the issues surrounding dialect\nclassification before exploring some of the motivations behind its study.\nWhat is Dialect?\nIn its most basic designation a dialect is a sub-categorization of a language, linguistically\ndifferentiated via grammar, lexis, and in terms of speech - phonology. The OED defines dialect as\n‘Manner of speaking, language, speech; esp a manner of speech peculiar to, or characteristic of, a\n.\nparticular person or class’ (1989). Although this genericism broadly fulfils societies’ perception of\ndialect, it belies the covert connotation that a dialect is a ‘sub-standard’ rather than ‘non-standard’\nform (Penhallurick, 2003:7), hence linguists use the term ‘variety’ interchangeably. However, any\nform of dialect, including the standard one, can incite social prejudice, covert prestige, ridicule, and\neven humour. Consequently, dialect is used extensively to promote characterisation in literature2\nand modern media; for example, rural accents are often used ‘to indicate the wholesome nature of\nfood products’ in advertisements (Thomas, 1999:201).\nThese associations, and the stereotypes that arise from them, are linked to the classification\nof dialects as either regional - populations that share a common core of linguistic characteristics that\noriginate in a particular geographical locale, or social (sociolects) - groups of people of the same\ndemographic that share a common core, and stratified by means of ‘’upper’, ‘middle’, and ‘lower’, or Neil Bowen, Swansea University (2011) 2\nWhat is dialect and why study it?\n‘working class’’ (Jones, 1999:144). However, it should be noted that regional and social dialects are\ninextricably linked, as illustrated in Figures 1a\/1b (Trudgill, 1983:29-30).\nReceived Pronunciation (RP) -\nHighest social class\nStandard English\n(Higher social class)\nMost non-standard Low Prestige\nRegional Variation Regional Variation\nFigure 1a Social and regional variation Figure 1b Social and regional variation\nin dialects in accents\nIt can be in seen in figure 1a; the higher a dialect is on the social scale the less regional variation\noccurs. At the higher end is the core\/prestige dialect, a supra-regional one, labelled Standard English,\nwhich includes recommendations on grammar and lexis but not accent. Therefore, wherever\nmention is made of grammatical or lexical variation in the following sections it will be in relation to\nthis standard, whilst phonetic variation will be in relation to the highest prestige accent - Received\nPronunciation (figure 1b), (Following examples based on Hughes & Trudgill, 1979):\nGrammatical differences concern the underlying structure and rules of a language, namely\nsyntax (sentence\/phrase structure) and morphology (word structure). Examples include the use of\nmultiple negations - I didn’t have no dinner, lexical substitution - He went out without no shoes on\n(no for any), and a propensity in South Welsh English to use third person singular in all persons - I\nlikes it.\nLexical differences stem from the passing down of traditional terminology, adaptation of\nestablished words, or the introduction of new words. For example, in Welsh English the use of tidy to\nmean good or nice - that’s a tidy car, and certain words used non-discriminately, e.g. borrow and\nlend - can I lend some money?\nSocial\nVariation\nSocial\nVariation Neil Bowen, Swansea University (2011) 3\nWhat is dialect and why study it?\nPhonetic and phonological variations in speech can be categorized in line with Trubetzkoy\n(1931, cited in Petyt, 1980:117-119):\ni) Phonetic:\na) Incidence of Phoneme usage differs for historical or other reasons, e.g. Northern English uses\n\/u:\/ whereas RP uses \/ʊ\/, such as \/bu:k\/ instead of \/bʊk\/ (book).\nb) Pronunciation of phoneme varies slightly, such as the difference between [man] and [mæn]\n(man) in some dialects because of a slightly higher tongue position.\nii) Phonological:\na) Systemic (phonemic inventory) differences:\n• Loss of discrimination: for example, most Scottish dialects don’t distinguish \/æ\/ from\n\/a:\/, so words like \/sæm\/ (sam) and \/sa:m\/ (psalm) are not differentiated.\n• Loss of phoneme(s): for example, Northern varieties lack \/ʌ\/; consequently, words like\nput and putt are pronounced \/pʊt\/. Alternatively, this can be represented in terms of a\nSouthern\/Northern (partial) diasystem 3 for short vowels, in line with Weinreich\nʊ ʌ\n(1954:394): Southern, Northern \/\/ ɛˌ ɪ ɒ \/\/\nʊ\nS ~\n≈ æ ≈ N ≈\nb) Distributional (phonotactic) differences: for example, in RP the occurrence of \/r\/ is restricted\nto pre-vocalic positions (non-rhotic), such as in \/hʌr.i\/ (hurry) and \/rɒd\/ (rod). Some dialects,\nmainly South West England, pronounce \/r\/ in all positions (rhotic) e.g. \/ka:r\/ whereas RP\npronounces \/ka:\/ (car).\nEven though discriminating between linguistic variables appears relatively simple, the issue of\ndifferentiating dialects from languages is not. If every individual speaks a variety of a language,\ntermed an idiolect, and we define dialect as a group of idiolects with a common core of similarities,\nhow do we decide if someone is using the communal features of a dialect or a separate language?\n(Petyt, 1980:12) Neil Bowen, Swansea University (2011) 4\nWhat is dialect and why study it?\nOne criterion is purely linguistic – ‘mutual intelligibility’, i.e. if dialect ‘X’ understands dialect\n‘Y’ they speak the same language (Petyt, 1980:13). Unfortunately, there are problems with this\ngeneralisation - differences between dialects may accumulate to the point of mutual unintelligibility\nbecause of where they lie respectively along the ‘dialect continuum’, a succession of\ngeographically\/socially adjacent dialects where the differences between dialects are directly\nrelatable to their distance apart on a scale (Chambers & Trudgill, 1998:5).\nTherefore, a second, more culturally biased criterion is based on the idea of ‘heteronomy’\nand ‘autonomy’. In other words, if a standard exists in a language and the speakers understand and\nlook toward it as such, they are regarded as speaking a dialect of that language (Chambers & Trudgill,\n1998:9). They are dependent (heteronomous) on that language as a standard bearer. A good\nexample, albeit an oversimplification, occurs in Chinese. China has nine regional dialects, many of\nwhich are mutually unintelligible. However, not only do they share a standard written form, but also,\nmany speakers have sufficient knowledge of the official dialect (Mandarin) to use it as a lingua franca\n(Kane, 2006:94). Thus, China can be said to be a true diglossic4 society.\nHowever, there is also a third criterion; it involves a language’s political status. In other\nwords, as Shohomy argues, ‘language has become a tool […] a symbolic political instrument’\n(2006:22) used to establish national identity, sometimes without thought to the effects on culture.\nTherefore, differentiating language from dialect is somewhat a linguistic matter and somewhat a\nmatter of external influence, usually by those in power seeking widespread homogeneity via the\nconstruction of a ‘hegemonic “national” language’ (Shohomy, 2006:29).\nWhy study dialect?\nClearly, defining dialect is a problem peppered with interconnected yet at times seemingly arbitrary\nfactors. Consequently, it is not surprising the reasons behind studying dialect also circumscribe an\nimbricate but centralised agenda. Therefore, this paper shall approach this aspect via four\nfundamental motivations in line with Wakelin (1977:7): Neil Bowen, Swansea University (2011) 5\nWhat is dialect and why study it?\ni) The curious:\nOn a basic level, the curiosity that arises when people of different dialects meet not only\nraises awareness of language diversity, but can also be used to highlight the misconceptions,\nstereotypes and prejudices that surround speakers of both prestigious and low-level dialects.\nii) The Linguistic:\nLinguistically, dialect study provides ‘a central source for variation data’ (Chambers & Trudgill,\n1998:15), which, although utilised in many fields, is mainly confined to ‘Dialectology’ and\n‘Historical\/comparative linguistics’ (Chambers & Trudgill, 1998: 127).\nDialectologists collect data on regional dialects to construct dictionaries and linguistic atlases\nthat provide, not only an invaluable contribution to the history of a language by preserving now\nextinct forms, but also a detailed description of the linguistic characteristics of the majority of a\npopulation; a much neglected area due to the focus on Standard forms (Trudgill, 1974: 5). Atlases are\nalso used to study the migration patterns, distribution, and cultural history of linguistic forms over a\nlarge area (Trudgill, 1998:3). Furthermore, as well as delineating the boundaries of regional dialects\nthey highlight that the most popular form is inevitably the standard one (McMahon, 1994:231).\nWhilst the use of isoglosses5 provides support for regional diffusion models, such as Schmidt’s 1872\nwave model of linguistic change6, by providing a snapshot of the stages of linguistic transition\nthrough space and, when taken across successive studies, time (McMahon, 1994:230). Certain\ndiscontinuous isogloss patterns also reveal ‘relic features’, forms which were once widespread but\nnow remain in seemingly disparate localities or pockets (Chambers & Trudgill, 1998:94).\nIn comparative linguistics, the stress on diachronic dialect studies, which examine linguistic\nstates\/features over a successive period of time (Saussure, 1916: 193), focuses more often than not\non ‘apparent time’ 7, and links to such fundamental concerns as the regularity of change, diffusion of\nnew forms, and the spread of social influence (Chambers & Trudgill 1998:151). Dialect data is also\nused as evidence for the transmission of change in the debate between the regularisation of sound Neil Bowen, Swansea University (2011) 6\nWhat is dialect and why study it?\nchange proposed by the neogrammarians8, and the abruptness of sound change proposed by lexical\ndiffusionists9 (McMahon, 1994:57), as well as providing support for theories of intra-systemic\nlanguage change as related to language family trees (McMahon, 1994:231).\nGenerative linguists use dialect data to support theories of I-Language change10, take for\ninstance Yang’s (2000) paper on the loss of verb-second phenomenon in Old English, or Shores\n(1971) study of inflectional morpheme loss based on evidence from the continuations of the Anglo\nSaxon Chronicles11. These theories, and many others, offer invaluable insights into the convergence\nand divergence of language variation through time, space and contact.\niii) The Anthropological:\nSociolinguists study variation as it relates to interaction in society in order to explore the\nrelationship between language and social class\/beliefs. The data obtained from studying dialect can\nbe used to prove theories that, although may appear obvious, have nevertheless never been\naccurately and rigorously defined in terms of the actual degree of differentiation that exists (Trudgill,\n1974:4). Studies can be qualitative in nature, such as the work of Gumperz12 (1971, 1982), or\nquantitative, such as the studies by Trudgill (1974) in Norwich, or Labov in New York (1966)13.\niv) The Practical:\nSociety has always valued some dialects over others, particularly in respect to institutions,\ngovernment, etc. The coveting of standard or prestige dialects by individuals wishing to advance in\nposition or class by conforming to the beliefs and ‘norms’ of society (Thomas, 1999:188) poses a\nparticular problem in the education system. Dialectology cannot solve this problem, but it can\n‘ascertain the facts about dialects and make them available’ (Wakelin, 1977:10-11) - facilitating the\nteaching of standards to pupils who have some other variety of English (Trudgill, 1974:5). However,\nperhaps the most aberrant motivations lie with linguistic forensics; as Labov for one, freed an\ninnocent man by proving that ‘a man who made […] bomb threats plainly did not come from New\nYork […], but from the Boston area of New England’ (1997); Neil Bowen, Swansea University (2011) 7\nWhat is dialect and why study it?\nConclusion\nDialects then, are the products of linguistic change, and as such exist along a continuum of\nvariation upon which there are no clear-cut boundaries, only areas of diffusion. Consequently, they\npossess an ‘impressionistic, abstract identity’ (Penhallurick, 2003:8) - one dependent upon a\nconglomeration of influences. Along this continuum, varieties morph in to each other creating\nintermediate forms or ‘fudged dialects’ (Chambers & Trudgill, 1998:110). These intermediate forms\nexist through contact and because of the Saussurian paradox of language; a resistance to change\n(invariability), and a predilection to change (variability), that account for the ‘principle of continuity’\n(Saussure, 1916:109) - a continuity constrained and shaped by the wider forces of ‘intercourse’ and\n‘parochialism’14 (Saussure, 1916:281).\nWhilst dialects converge and diverge over time, so too do the motivations behind studying\nthem. Once conflicting fields now show considerable overlap in their methods, as they make\nincreased use of modern technology to store and process data, permitting linguistic variables to be\nquantified and evaluated in new and exploratory ways. Perhaps then, the future of studying dialect\nlies not with secular studies, but with an amalgamation of disciplines, along the lines of\nGeolinguistics, as it aims to combine the observation, description, interpretation, and prediction of\nlanguage variation in regards to its contextual and geographical significance (Williams, 1988). "}