{"text":"HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nHow Language Works\nMike Gasser\nIndiana University\n1 Introduction\nStudents studying linguistics and other language sciences for the first time\noften have misconceptions about what they are about and what they can\noffer them. They may think that linguists are authorities on what is correct\nand what is incorrect in a given language. But linguistics is the science of\nlanguage; it treats language and the ways people use it as phenomena to\nbe studied much as a geologist treats the earth. Linguists want to figure out\nhow language works. They are no more in the business of making value\njudgments about people's language than geologists are in the business of\nmaking value judgments about the behavior of the earth.\nBut language is a cultural phenomenon and we all have deep-seated,\ncultural ideas about what it is and how we ought to use it, so knowing\nwhere to begin in studying it scientifically is not a trivial matter at all. Issues\narise that would not if we were geologists figuring out how to study\nearthquakes or the structure of the earth's crust. For this reason, before we\ndive into the study of language, we will need to examine some of the\nbiases that we all have concerning language and to set some ground rules\nfor how we are going to proceed. Because there is more than one way to\nbegin, it will also be useful to establish a basic stance to guide us. Finally,\nbecause human language is an enormously complex subject, the book will\nfocus on a narrow range of topics and themes; there will be no pretense of\ncovering the field in anything like a complete fashion. This first chapter is\ndesigned to deal with these preliminary issues. But first, you will need to\nknow about the various conventions that I will be using in the book.\n1.1 The book: organization and conventions\nOrganization\nThe organization of this book is based on the idea that human language\nhas a small set of basic properties, each of which plays a role in the\nworkings of language as an instrument for communication and thought.\nEach chapter in the book (after this one) introduces a new property.\nChapter 2 discusses words and word meaning. Chapter 3 discusses\nphonological categories, the units that are combined to make word forms.\nChapter 4 discusses phonological processes, the ways in which the units of\nword form interact with one another. Chapter 5 discusses compositionality,\nthe principle that allows complex meanings to be expressed by\ncombinations of words. Chapter 6 discusses how words are organized into\nlarger units and how these allow us to refer to states and events in the\nworld. Chapter 7 discusses how the grammars of languages divide the\nworld into abstract conceptual categories. Chapter 8 discusses the\nproductivity and flexibility of language and how grammar makes this\npossible.\nLanguages\nMost linguistics texts draw their examples from an unconstrained set of\n1 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nlanguages. This has the disadvantage that students are left with little sense\nof how the different aspects of each language fit together. It also invites the\nkind of errors that may crop up when linguists rely on examples from a\nwide variety of other linguists. For these reasons, almost all of the\nexamples in this book are limited to a set of nine languages. You can see\nthe word for 'language' in each of these nine languages in the upper-left\ncorner of the Table of Contents page, and, together with words in eight\nother languages, at the top of each page. If you're interested in knowing\nmore about these languages, each is described briefly in this appendix.\nOther references\nThroughout the book I will include links to other references that are\navailable online. In particular I will often link to articles within the English\nedition of the collaborative encyclopedia, Wikipedia. Wikipedia includes\nsome articles that have not been written by knowledgeable people or have\nsuffered from disagreements among the editors, but for important topics on\nlanguage, the articles have been edited many times and have stabilized\ninto relatively useful and reliable overviews of these topics. Because I will\nlink to Wikipedia so often, I will use this special symbol with the Wikipedia\n\"W\" icon for these links: .\nConventions\nGeneral\nBecause this book is on the World-Wide Web and there is no paper version\nof it, you must have a Web browser to read it. Be sure to use an\nup-to-date version of the browser software; otherwise, the pages will not\ndisplay properly, and you may not be able to listen to the sound files. The\nbest-known browsers that are usable across different platforms (in\nparticular both computers running Windows and running Macintosh OS)\nare Netscape (use version 7 or later), Firefox (use version 1 or later), and\nOpera (use version 8 or later). For Windows users, another option is\nInternet Explorer. For Macintosh users, another option is Safari.\nThere are many links to sound files in the book. To see if your browser is\nset up properly for playing these files, click on this link: this is a recording.\nThere are also some links to movie files. If your browser is set up for these,\nyou should see a picture of a woman below and should be able to play the\nmovie by clicking on the controls below it. (The movie shows the sign in\nAmerican Sign Language meaning 'movie'. For this and other ASL movies\nin the book, I am indebted to the Communications Technology Laboratory\nfor their Sign Language Browser.)\nTerms usually appear highlighted like this. When important terms are\nintroduced for the first time, they appear like this. When such terms\nappear later in the book, there is often a link back to their first appearance.\nAll of these important terms are also listed in the glossary. Concepts are\nsometimes displayed LIKE THIS. Emphasized words appear this way.\nThe book is divided into chapters and sections, with one webpage for each\n2 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nsection. Sections are divided into subsections. Many subsections begin\nwith an example and one or more questions to get you started thinking\nabout the topic; these examples and questions appear in\nboxes like this.\nThis version of the book (3.0) includes some discussion of computational\nissues, that is, how it might be possible to program a computer to handle\nsome aspects of language. These parts assume basic knowledge of\ncomputation and computer programming . You can safely skip them if\nyou prefer. Computational parts appear in\nboxes like this.\nSome sections may also contain less important portions that can be skipped.\nThese appear in an indented chunk of text in a smaller font like this.\nMost sections also include some comments on the text that appear in the\nmargin on the left (or flush with the right in the printer-friendly version).\n(something in the margin)\nnext to the part of the text that they refer to.\nAt the end of each chapter is a section containing problems on the material\nin the chapter. There is a link to the problems covering a given section at\nthe bottom of that section page.\nLinguistic examples\nIn the book, linguistic examples from languages other than English usually\ninclude a representation of the pronunciation of the word(s) and the\nmeaning of the word(s). The meaning usually appears in the form of a\ngloss, that is, a word or brief phrase in English designed to give a general\nsense of what the expression means. Glosses appear between single\nquotes (' ').\nFor some linguistic examples the precise pronunciation is important; for\nothers it isn't. When the pronunciation matters, the example is shown using\nphonetic symbols. A list of all of the symbols used in the book appears in\nthis appendix. The symbols for sounds appear between slashes (\/\/) or\nbetween angle brackets ([]); the difference between these two notational\nconventions will become clear in Chapter 3.\nWhen precise pronunciation is not important, linguistic examples appear in\nitalics. For languages like English that use the Roman alphabet, the\nstandard orthography (spelling) is used. For languages that do not use the\nRoman alphabet (Chinese, Japanese, Amharic, and Inuktitut among our\nmain group of nine languages), the examples are transliterated into the\nRoman alphabet. When an example consists of a complex word, a phrase,\nor a sentence in a language other than English, it will often appear in a\nstandard three-line format. The first line is for the expression itself. In this\nline, words will sometimes be broken into constituent morphemes, that is,\nunits of meaning, separated by hyphens (-). The second line is for the\nmeanings of individuals words and morphemes. Here hyphens separate\nthe meanings of morphemes that are separated by hyphens on the first\nline. Meanings for grammatical morphemes appear in SMALL CAPITALS,\noften abbreviated. When more than one word is used to indicate the\nmeaning of a single morpheme, these words are joined by a colon (:). The\n3 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nthird line is for a gloss for the whole expression, enclosed, as elsewhere, in\nsingle quotes. Here is a Spanish example.\nJuan y Ana habla-ba-n con el piloto\nJuan and Ana talk-IMPF-3P:PL with the:MAS pilot\n'Juan and Ana were talking with the pilot.'\nIn this example the word hablaban has been broken into three separate\nmorphemes, and a meaning is given for each of these below the word in\nthe second line. There are two aspects to the meaning of the third\nmorpheme (-n), 3P (third person) and PL (plural), so these are joined by a\ncolon. Don't worry if you don't understand what these morphemes are\ndoing (or even what a morpheme is) at this point; all of this will be\nexplained later.\nEnglish usage\nThe English used in this book is meant to be a relatively informal variety of\nstandard written American English. As you will see in the section on what\nlinguists study and the section on what linguists do not study, there is\nsometimes disagreement about what counts as standard usage. One\nadvantage of writing a book on the Web is that I get to decide the\nconventions myself rather than being forced to conform to the standards\nimposed by an editor. Because this is a book about language and because\nparticular usages can sometimes lead to negative, kneejerk responses, it\nmay be worth mentioning two features of the English used in this book that\ndo not count as standard for everybody. First, I will often use they, them,\nand their to refer to an unspecified singular person , as has been common\nin English speech and writing since at least the time of Shakespeare . An\nexample is the sentence what language a child learns depends on what\nlanguage they are exposed to. Second, I will avoid the word whom\naltogether. This word is very infrequent in any modern English spoken\ndialect and is not used in a consistent fashion in formal writing either.\nReaders unfortunate enough to have been taught rigidly traditional English\nteachers will also notice split infinitives (to overwhelmingly reject this\nproposal), prepositions at the ends of clauses (as in the example with\n\"singular they\" above), and sentences beginning with and or but.\n1.2 What we study\nA science takes phenomena of one kind or another as its subject matter\nand attempts to describe and explain them objectively. Scientists gather\nparticular kinds of data, analyze them, and create theories that account\nfor the data. Here are some sciences and informal descriptions of the\nphenomena they are concerned with.\nScience Subject matter\nchemistry how substances combine\nto form other substances\npsychology how individuals behave\nsociology how people behave in groups\n4 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\ncultural anthropology how human cultures resemble\nand differ from each other\nlinguistics how language works\nHow would linguists and other language scientists go about objectively\ndescribing and explaining how language works? What kind of data would\nthey examine? How would they analyze the data? What would it mean to\n\"account for\" the data with a theory? We will look at these questions in this\nsection.\nSocial science and objectivity\nYou're a female American anthropologist specializing in the study of\nfamily structure and the roles that different family members play. You're\nstudying a remote ethnic group, and you discover that the people believe\nthat baby girls need to be brought up more harshly than boys to prepare\nthem for a harsh life and that fathers have no particular role to play in the\nbringing up of their children. How might it be difficult for you to be\nobjective in your study of these beliefs and behaviors?\nOf the sciences listed in the table above, all but chemistry are concerned\nwith human behavior. For all of these sciences, the work of the scientist is\ncomplicated by the attitudes that we have toward the behavior; that is, it\nmay be difficult to be objective in our study. It is probably cultural\nanthropologists who face this difficulty most often. The anthropologist\ndescribed in the box above, having grown up among highly educated\npeople in modern US society, almost certainly believes that boys and girls\nshould be treated equally and that fathers should play an important role in\nthe raising of their children. But she must somehow put these beliefs aside\nin her work. Instead of labeling the people's practices as \"wrong\", she must\nattempt to see how they fit in with the other practices in the society,\nwhether she notices consistent patterns in their behavior. If she is to make\nany value judgments about the behaviors, they should be based on\nwhether the behaviors contribute to the stability of the society, not on her\nown feelings about them. Her job is to describe and explain the society, not\nto judge it.\nAs another example, consider the case of another anthropologist\nspecializing in the scientific study of religious beliefs and practices. To do\nthis objectively, he has to put aside whatever beliefs he himself has on\nquestions such as the existence of God and life after death. There is no\nway he can pretend not to have such beliefs; he just has to try to keep\nthem from getting in the way. Note that this is not a problem for chemists;\nin their work they don't have to worry about their prior attitudes toward\nparticular chemical reactions.\nWhen we attempt to study human phenomena such as religion or family\nroles or language scientifically, we do not deny the inevitability or even the\nvalue of our attitudes toward the phenomena. It's just that evaluating the\nphenomena and trying to convince people to behave or believe in a\nparticular way is not the business of scientists (at least not the main\nbusiness); it's somebody else's. A priest or minister has a very different\npurpose from an anthropologist specializing in the study of religion\n(although the priest or minister can probably benefit from the insights of\nanthropologists who study religion). A family counselor who advises a\nhusband to allow his wife more freedom is not doing science (although the\n5 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\ncounselor can probably benefit from the insights of anthropologists who\nstudy the family).\nIt is important to come to grips with some of our preconceptions about\nlanguage before we begin to approach language as the object of scientific\nstudy. The next section is about some of those preconceptions and where\nthey come from.\nAttitudes toward the speech of others\nYou overhear the following conversation.\n1. A: Did you hear those two girls talking? \"He don't mean nothin'.\" \"I\nseen it.\" \"Me and him fought.\" Can't they learn to speak English?\nB: I know what you mean. They're just lazy, if you ask me.\nWhat do you think of comments like this? Do speakers from some\nregions or speakers belonging to some social or ethnic groups tend to be\nlazier than others in their speech?\nAs you certainly know, people are quite conscious of how they differ from\npeople from other regions, social groups, or ethnic groups. They notice\ndifferences in dress, in food, in patterns of social interaction, in which\nqualities are valued or attract attention. And it is natural to evaluate these\nfeatures of other groups, to think of their dress as fashionable or weird, to\nthink of their food as tasteless or gross, to think of their social behaviors as\nfriendly or offensive. The same is true for language. People hear speech\nthat differs from their own and they may find it sloppy, elegant, or\nmonotonous. These impressions may also be associated with the\nlanguages of particular groups rather than (or in addition to) the people\nthemselves: we may find a certain language more expressive, more logical,\neven more masculine. What's the source of these impressions? Are they\naccurate?\nDifferences between languages\nUndeniably communities of people do tend to differ. To take an obvious\nexample, food preparation is more important in some cultures than others;\nsome cultures are famous the world over for their cuisine. For language,\nthe differences are again obvious to anyone. It's not just that languages\nsound different. Some languages make distinctions — in sounds, in words,\nin grammar — that others don't; in fact most of this book is about just this\ntopic. And people learning a second language often have trouble making\nthe distinctions that aren't part of their first language. What we naturally\nnotice, as speakers of a particular language, is what is \"missing\" in other\nlanguages and what kinds of mistakes second-language learners make in\ntrying to speak our language. This may lead us, consciously or\nunconsciously, to think there is something deficient about the other\nlanguage or even about the speakers of the other language. It is very\ndifficult for us to see it from the other perspective, to see that we also fail to\nmake distinctions that matter in the other language and have trouble\nmaking them when we try to learn that language.\nFor example, as speakers of English, we may be surprised to find that\nJapanese has no words corresponding to English a and the, words that\nare so basic to English we may almost take them for granted. And we may\nbe struck by the errors that Japanese learners of English make in trying to\nmaster these words. Similarly, we are struck by the confusions Japanese\nlearners may have in pronouncing English words with the sounds that we\n6 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nwrite with l and r, a distinction not made in Japanese. But these same\nJapanese speakers may be surprised when they first learn that English has\nonly one word for 'you' (Japanese has at least six possibilities ) and struck\nby the tendency of English-speaking learners of Japanese to always use\nthe same word for 'you'. And they are similarly struck by the difficulty\nEnglish-speaking learners of Japanese have with distinctions in vowel\nlength and pitch change, distinctions that don't exist in English.\nIn fact there is no evidence that people in some cultures speak in sloppier\nor more elegant or more monotonous ways than people in other cultures.\nAnd while languages do differ in striking ways, these different features\nseem to balance each other out. As far as we know, all languages are\nequally expressive, equally logical. If you're not already convinced of this, I\nhope you will be after you have read this book.\nBut the example in the box above doesn't concern two different languages;\nit concerns a single language, English, and its speakers. The fact is that\nthere is also considerable variation within English (or any other major\nlanguage); that is, English has dialects. I'll have a lot more to say about\ndialects in the section on dialects and languages. For now, the main point\nto be made is that what linguists have learned about the essential equality\nof languages applies to dialects as well. Though it is often even harder for\npeople to accept this fact for dialects than for languages, as far as anyone\nknows, there is nothing inherently inferior or superior about any dialect of\nany language.\nLinguistic chauvinism and intolerance\nSo if impressions like those of the speakers in the box above have no basis\nin fact, where do they come from? There are three possibilities. First, these\npeople may have been told by an authority, for example, an English\nteacher, that certain usages are just plain wrong. Clearly, the reasoning\nwould go, anyone who knows this should not be using those forms. We'll\nreturn to this issue in the next section. The fact is that what is \"wrong\" is all\nrelative. The girls quoted in the conversation in the box would almost\ncertainly find it wrong to say it doesn't mean anything when speaking to\neach other. If they wrote it don't mean nothin' in a school essay, on the\nother hand, that would be another matter (though it would still not be\nreason to call them lazy; it would just be evidence that they had not learned\nthe rules of the variety of English that is appropriate in school). Second,\nthese people may have a stereotype concerning the group in question, and\nthey may be transferring that stereotype to the speech of that group. Third,\nwhat they hear differs from the English they speak, and people may be\nquite intolerant when it comes to speech. Especially if they belong (or\nbelieve they belong) to a political, economic, or intellectual elite, their view\nmay be something like the following: \"the way I speak the language is the\nright way; any other way is wrong\".\nWhatever the reason for the impressions of A and B in the box, a linguist\nwould respond to them by saying that the two girls were simply speaking a\ndifferent dialect of English, a dialect with its own grammar differing from the\ngrammar of the dialect of A and B.\nDescribing and explaining language\nYou're a linguist who wants to study the English spoken in the Caribbean\nisland nation of Grenada. How do you go about this? What sort of data\ndo you gather?\n7 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nData for research on language\nLinguists and other language scientists, unlike A and B in the box in the\nlast section, are interested in what people do, not what somebody thinks\nthey should do. The English of the girls overheard by A and B is just as\nlegitimate an object of study as the speech of any other group. To carry on\ntheir study, clearly researchers need to gather examples of language.\nThere are two sorts of ways to get these.\nBy collecting naturally occurring language, either written texts or\nspoken language.\nLinguists usually study spoken (or signed ) language because it is\nmore basic than written language. Most of the human languages that\nhave existed have not been written at all, and among those that are\nwritten, many people do not read or write them. In addition, though\nlanguage learning continues throughout life, most of the basic patterns of\na language are probably mastered by the time a child is six years old. So\nthe written form of the language has little or nothing to do with this\nfundamental early learning of language.\nBy eliciting language by asking people particular questions or by doing\nexperiments that call for language.\nLinguists use both kinds of data. For example, once you'd arrived in\nGrenada, you might get permission to record phone conversations, then\ntranscribe the conversations, perhaps using a special notation that shows\nthe speakers' pronunciation. Or you might recruit one or more willing\nspeakers to help you in your study by translating words or sentences from\nyour English into theirs or by telling you whether certain sentences are\npossible in their English.\nExperiments on language\nRather than using words and sentences produced by speakers (or writers),\nlinguists and (even more often) other language scientists sometimes gather\nother kinds of data. For example, they might record the acoustic properties\nof speech or the movements of the tongue, lips, and jaw during speech. Or\nthey might present people with words, sentences, pictures, or movies (the\nstimulus) and see how they respond or how long it takes them to respond\nto them. The responses in experiments like these could involve\nsaying something, for example, the first word that comes to mind or a\nsentence that describes a visual stimulus.\npressing a button, for example, to make a choice concerning the\nstimulus.\nGiven some data, a linguist or other language scientist has to do something\nwith it. Much of this book will be concerned with what they might do, so\nwhat follows will be just an introduction to this topic. For every kind of\nresearch on language, there are two things to be considered: what aspect\nof language is being studied and what the research is supposed to\naccomplish (and how it does this). We'll start with the first and look at the\nsecond in the next section.\nThe content of research on language\nLanguage, even a particular individual language, is far too complex a\nsubject to be studied in its entirety by any one researcher. As already\nmentioned in the overview of the book, there is a higher-level distinction we\ncan make concerning what research is supposed to be about, between the\n8 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nstudy of language as system and the study of language behavior. In either\nof these two cases, the language scientist is normally studying only some\naspect of the phenomenon, one or more of four sorts of things about a\nlanguage (or dialect): its sounds, its words, its grammar, and its use in\ncontext. A researcher interested in the sounds of the language (or dialect)\nmight try to figure out what the basic sounds of the language are, how they\ncombine to form words, or how speakers produce the sounds. Many\nresearchers in this area believe that it is possible to study the sounds of a\nlanguage more or less independently from the other aspects of the\nlanguage.\nA second area of research is the words of a language, usually thought of\nas organized in some sort of abstract dictionary, referred to as the\nlexicon. A researcher interested in words might study how speakers find\nwords when they are formulating sentences or how abstract meanings\nbuild on simpler meanings (how is over in get over a problem related to\nover in jump over the puddle?).\nAnother possible kind of research would try to characterize what counts as\na possible sentence in the language, that is, what's grammatical in the\nlanguage. It is not as easy as it might seem to define this concept. We\nmust be careful to avoid any bias on the speaker's part based on what they\nhave heard from teachers of their language in school because what we\ncare about is what people actually say, not what someone tells them they\nshould say.\nBut we also cannot just treat any sentence that occurs as grammatical\nbecause people make speech errors. By \"errors\", we do not mean that\nthey break rules that apply to dialects other than theirs (for example, by\nsaying ain't or he don't). Instead we mean slips of the tongue, false starts,\nand hesitations. For example, the following example includes several\nspeech errors.\n2. Well, I think you ... I mean, the ... the ... um, this isn't coming out right\nat all.\nPeople produce such \"sentences\" all the time, but they clearly also know\nthat there is something wrong with them. That is, linguists probably do not\nwant their descriptions of a language to include such sequences. So\ngrammatical sentences are possible sentences that do not contain speech\nerrors.\nThis is not to say that there is nothing interesting about speech errors. In fact,\nlike human errors more generally, they can give us lots of insights about the\nunderlying mechanisms. There is a whole community of researchers that take\nspeech errors of one kind or another as the data they try to explain.\nDegrees of grammaticality\nBut there is another complexity; grammaticality doesn't seem to be an\nall-or-none matter. That is, while some forms may be completely\nacceptable to all of the speakers of a given dialect all of the time and other\nforms may be completely unacceptable to all of the speakers all of the time,\nthere may also be intermediate cases that are not so clear. For example,\nsome English speakers use a chalk for a stick (or piece) of chalk; others\nwould be less comfortable with this (though they would not find it as\nunacceptable as, say, a clay for a lump of clay). There may even be\nvariation within a single speaker. For example, an English speaker may say\nfor my wife and me on some occasions and for my wife and I on others.\nReturning to the examples ridiculed by A and B in the box above, we see\n9 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nthat by the definition of grammaticality that linguists work with, such\nsentences as this one may be perfectly grammatical for the girl who said it.\n3. He don't mean nothin'.\nA complete description of the grammar of these girls (and the community of\nspeakers that they belong to) would have to specify just what counts as a\ngrammatical sentence (for example, sentence 3) and what doesn't (for\nexample, he don't nothin' mean or he don't meant nothin'), possibly singling\nout areas of grammar where there is disagreement and variation among\nthe speakers. This description would obviously have to say something\nabout word order and about which forms can go with which other forms\n(meant is a perfectly good word in their dialect, but not following don't).\nBut some linguists are not satisfied with just describing the grammatical\nsentences because this says nothing about what those sentences are for.\nInstead these linguists are concerned with describing how meanings and\nfunctions of language relate to words and grammatical sentences (for more\non this idea, see this section). So an account that includes sentence 3\nabove as a grammatical sentence (for some English speakers) doesn't help\nus understand how this sentence conveys information about some person\nfamiliar to the hearer (he) and about the speaker's belief about that\nperson's intentions. This book follows this second position on what we\nshould be describing, that is, that we should be saying how language\naccomplishes things for speakers and hearers.\nFinally, those same linguists who are interested in how sentences convey\nmeaning may also be interested in describing a fourth sort of aspect of the\nlanguage, a sort of \"correctness\" that is different from grammaticality. A\nsentence can be grammatical and meaningful — that is, the words and\ngrammatical patterns in the sentence can sound right and correctly\ndescribe some possible situation in the world — but the sentence can still\nbe inappropriate. Consider the following sentence.\n4. There is no life on the moon.\nThis sentence makes perfect sense and describes a true state of affairs.\nBut if you walked up to a stranger on the street and said it, they'd think you\nwere crazy. It would not be an appropriate way to begin (or end, for that\nmatter) a conversation with a stranger. Just as speakers of a language\nhave knowledge about what is grammatical in their language, they also\nhave knowledge about what is appropriate.\nLearners' errors\nOf course not everyone who uses a language or dialect (see this section\nfor the difference between dialects and languages) knows how to do so\ngrammatically and appropriately in all situations. In particular, language\nlearners have only imperfect knowledge of the language or dialect they are\nlearning, and they can be expected to make errors. Children learning\nEnglish as a first language may say \"doos\" for juice or me up when they\nwant to be picked up. Teenaged speakers of English as a first language\nmay still commit errors of appropriateness, using informal expressions such\nas bigtime in formal contexts. And adults learning English as a second\nlanguage may say \"diss\" or \"dees\" for this or I make the homework for I am\ndoing the homework. We consider these to be errors, but there are only\nerrors from the perspective of the system defined by the behavior of the\nadult native speakers of the language or dialect that is being learned. Such\nexamples can also be seen relative to the learner's own linguistic system,\nwhich has its own pronunciation, vocabulary, grammar, and patterns of\n10 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nusage. Researchers studying second-language learning often find it useful\nto treat the learner's knowledge of the second language as a sort of\nlanguage in its own right, what they call \"interlanguage\".\nThis section has looked at the kinds of topics that interest linguists and\nother language scientists and the kinds of data that might look for to help\nthem in their research. But we haven't thought much about what the\noutcome of the research is. What would it mean to describe or explain\nlanguage? We'll look at these aspects of research on language in the next\nsection.\nProblems\n1.3 How we study language\nAccounts, generalizations, and theories\nIn addition to content, we can look at research on language from the\nperspective of what it is trying to accomplish and how it does that. First, we\nneed to go back and consider again what science is all about. As we've\nseen, a scientist starts with a phenomenon of interest, gathers some data\non the phenomenon, and attempts to come up with a description or\nexplanation of it. This may take the form of a discussion in some language\n(such as English or Chinese), a set of equations, or an algorithm, that is, a\nprecise description of a set of processes to be carried (by a person or a\ncomputer). Whatever form it takes, this result of the scientist's research\nmay be referred to as an \"account\" or an \"analysis\" of the phenomenon. A\nscientific account is expected to include some sort of generalization about\nthe phenomenon, that is, to go beyond simply listing the data.\nA generalization can be relatively specific, applying only to a vary narrow\nrange of data. For example, an anthropologist studying kinship relations in\nsome ethnic group might conclude that the relation between a\nmother-in-law and daughter-in-law matters more than other in-law relations\nin the culture. However, most often, an anthropologist wants a particular\nculture to be seen only as an example of a more general phenomenon.\nThat is, the goal is not just to describe or explain one culture but to say\nsomething general about human culture. So the anthropologist might want\nto state a generalization about in-law relations across all ethnic groups\nbelonging to some type or to all ethnic groups. In the most general cases,\nthe generalization is usually stated in terms of a particular theory, which\nis a general set of principles for understanding phenomena of a particular\ntype. A theory is supposed to offer an explanation of the phenomena, not\njust a description. For example, kinship theories start with a set of basic\ncategories that are supposed to be sufficient both for describing and\nexplaining the role of the different possible kinship relations in all societies.\nA theory is like an \"account\" or an \"analysis\", only more general.\nHow scientists describe and explain: generalizations and theories\nTo take a linguistic example, a researcher might be interested in describing\nthe way present-tense verbs are negated in English dialects like the one\nreferred to by A and B in the box in the last section:\nI\/you\/he\/she\/it\/we\/they don't go\nThe linguist could make the low-level generalization that for all but a few\nverbs in these dialects, the present tense negative is formed by putting\ndon't before the base form of the verb (go, mean, eat, etc.). This\ngeneralization would apply only to the dialects being investigated.\n11 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nOr the researcher could note that there is a distinction in the affirmative in\nthese dialects that is not made in the negative, the same distinction that is\nmade in standard English dialects:\nI\/you\/we\/they go\nhe\/she\/it goes\nExplaining languages, explaining language\nGoing beyond these English dialects, the linguist might then discover that\nsomething similar happens in many languages, for example, among the\nlanguages that this book focuses on, in Japanese and Amharic, making the\ngeneralization that languages tend to make more distinctions in the\naffirmative than the negative. The researcher could then go even further\nand try to place negation within a set of other forms in terms of how likely\nthey are to favor distinctions; for example, the researcher might discover\nthat fewer distinctions are made in verbs in subordinate clauses (for\nexample, in the places they go) than in independent clauses (for\nexample, in they go many places) in many languages. (Don't worry if you\ndon't understand what \"subordinate\", \"independent\", or \"clause\" means.)\nEven more abstractly, the linguist could try to explain why there would be\nsuch tendencies across many languages. For example, they might propose\nthat it is more difficult to produce and understand negative forms than\naffirmative forms and that this puts pressure on the users of the language,\nand hence on the language itself, to compensate by making some other\naspect of the grammar simpler. This kind of proposal would be a theory\nthat is designed to describe and explain a set of grammatical phenomena\nacross many languages.\nTo summarize this section so far, we see that a scientist trying to\nunderstand language makes generalizations about data. These\ngeneralizations can apply only to one language, or they can apply to\nlanguage in general. A linguist or other language scientist often works\nwithin the context of a particular theory of language. I'll have more to say\nabout the role of theories in this section. But we've said nothing so far\nabout what the goal of a description or explanation is. There are two kinds\nof possibilities, related to the two fundamental ways of looking at language\nthat are mentioned in the overview of the book: focus on the product\n(sounds, words, sentences, etc.) and focus on the process (speaking,\nreading, understanding, etc.).\nProduct and process\nConsider this line from the English comedy show \"The Two Ronnies\":\n1. She left her husband for the garbageman.\nThe joke, in case you missed it, is based on the ambiguity, that is, the\nmultiple possible interpretations, of the verb left. The sentence could\nmean that the woman abandoned her husband in favor of the\ngarbageman, or it could mean that she put him outside for the\ngarbageman to carry away. It turns out that ambiguity is quite common in\nlanguage and is the basis of puns such as this one. What sort of a\nproblem does this present for a description or explanation of how\nlanguage works? What aspects of language would an explanation of\nambiguity need to refer to?\nAll instances of language are obviously the result of processes: speakers,\nwriters, and signers (in the case of sign language) produce something that\n12 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nwe call language and hearers, readers, and sign observers attempt to\nunderstand something that has been produced. Over a longer time scale,\nwhat a person knows about a language (that is, how to produce and\nunderstand it) changes; this is the process that we call learning,\ndevelopment, or acquisition . Over an even longer time scale, every\nlanguage also changes; the English of today is not the same as the English\nof 1900. This slower process is called language change. Finally, over the\nlongest time scale that is relevant for language, we know that at some point\nin the distant past, for example, 200,000 years ago, the ancestors of\nmodern humans did not have anything like what we call language; the\nprocess that resulted in the kind system we have now is called language\nevolution.\nMost linguists choose to ignore all of these processes and focus instead on\nthe products, the words, sentences, and entire discourses that are\nproduced and understood by people at a particular point in historical time.\nIn their research they attempt to describe and explain these products, to\ngeneralize about what must appear, what may appear, and what may not\nappear. Other language scientists, especially psycholinguists and\ncomputational linguists, focus instead on the processes themselves. In\ntheir research they attempt to describe and explain these processes, to\ngeneralize about what is going on during language behavior, language\nchange, or language evolution, for example, when a speaker pronounces a\nword, when a child learns how to combine words into sentences, when a\npopulation of agents \"invents\" grammar in the process of evolving a\ncommunication system. Their accounts and theories often take the form of\nalgorithms and are often implemented in the form of computer programs.\nThey may be called processing accounts or computational models.\nThere are at least two important differences between these two ways of\nlooking at language. First, the product-oriented perspective deals with\nstatic objects; even though it took time for the words or sentences to be\nproduced or understood, the things being studied have no real time in\nthem, except in that certain parts come before other parts. In the\nprocess-oriented perspective, on the other hand, time cannot be ignored.\nProcessing happens in real time, and the implementations of processing\naccounts as computer programs obviously run in real time. These accounts\ndiffer a lot in terms of how serious they are about the time course of human\nlanguage processing, but they are all in some sense dynamic.\nProduction and comprehension\nSecond, processing accounts are directional. At its most basic, language\nprocessing is either production or comprehension. Even processing\naccounts that are concerned with the slower processes of learning or\nevolution are based on some idea of how production or comprehension\ntakes place. I'll have more to say about production and comprehension\nlater in this chapter. For now the important idea is that these processes\noccur in opposite directions.\nIn production, a speaker, writer, or signer starts with something to be\ncommunicated (perhaps to themselves) and then goes through a process\nthat results finally in an instance of language (a spoken, written, or signed\nutterance of some kind). When I produce the sentence take the garbage\nout, I start with something that isn't language at all, something that doesn't\ninclude the words take and garbage but is more like my mental\nrepresentation of some situation in the world, either one I'm experiencing\n(seeing the garbage piling up in the house) or one I'm imagining (seeing\nthe hearer taking the garbage out). Then somehow I get from this thought\n13 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nto the utterance itself. In comprehension, a hearer, reader, or sign observer\nstarts with an instance of language and then goes through a process that\nresults in some sort of approximation to what the speaker, writer, or signer\nwanted to communicate. When I hear somebody say the sentence take the\ngarbage out, I start with some sounds and from these eventually figure out\nwhat the speaker wants and what I'm supposed to do, and of course what\nI'm supposed to do isn't language at all; it's an action. The product-oriented\nperspective ignores this directionality, treating it as irrelevant to what\nmakes language work.\nSo who is right? Does the product-oriented perspective or the\nprocess-oriented perspective give us more insight into how language\nworks? To some extent, the answer depends on what we're after. If we\nwant a way to describe languages in as efficient and understandable a way\nas possible, then it may be that we can confine ourselves to\nproduct-oriented research. The outcome of this research could be an\narchive of many languages in a form that would allow researchers from\ndifferent fields and people who want to teach or learn the languages to\nconsult the archive. Of course if our goal is to understand what people are\ndoing when they are actually using language or if we want to write\nprograms that allow computers to use language, then we will need to rely\non process-oriented research.\nBut what if we are interested in the more abstract and theoretical question\nof why language is the way it is? Which perspective is the right one, or do\nwe need both? There is a lot of controversy within the language sciences\non this point, with one camp, associated especially with the famous linguist\nNoam Chomsky , claiming that we can learn what makes language\nspecial by studying products alone. The idea is that processing is\nsomething separate, something to be understood in its terms, but not\nsomething we need to refer to to understand how language works. The\nopposing camp, associated with the theories in linguistics known as\ncognitive linguistics and functionalist linguistics and with many language\nresearchers in fields outside of linguistics proper, takes the view that the\nnature of language is intimately tied to the way it is used, that if we want to\nunderstand why language is the way it is, we need to refer to processing.\nAs I discuss more in this section, this book belongs more in the second\ncamp. I will assume that both product-oriented and process-oriented\nperspectives can help us understand how language works.\nLet's return to the issue of ambiguity, illustrated in the box above, to see\nhow thinking about process as well as product can help us figure out what\nis going on. For the sentence in question, a product-oriented approach\nmight simply include the information that left (or leave) has at least two\nmeanings, though of course it would have to be more precise about what is\nmeant by \"have two meanings\". A process-oriented approach would look at\nthe processing of the sentence from both directions. This would make clear\nthat ambiguity is a \"problem\", that is, a potential challenge for a person or a\ncomputer, in the comprehension direction but not necessarily in the\nproduction direction. It is such a problem in fact that a very large body of\nresearch from the processing perspective has looked at what is called\ndisambiguation. The problem is that when a word is ambiguous, a listener\n(reader, sign observer) has to figure out which meaning is intended (or, in\nthe case of a joke like the one in the box, to see that the sentence has a\npossible interpretation for each of the meanings). It is easy to imagine how\na person hearing a sentence like the one in the box would know that the\nword left has more than one meaning. What is hard to explain is how the\nperson knows which meaning is the right one, or, in this case knows that\nboth are right. Theories of disambiguation are designed to explain the\n14 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nprocess. We'll return to disambiguation later; the important point for now is\nthat it only becomes an issue when we look at language from a processing\nperspective.\nIn this section and the last, we've seen that the business of linguists and\nother language scientists (and the subject of this book) is trying to describe\nand possibly explain particular languages, language in general, and how\npeople use languages. But this is not the only way we might treat\nlanguage. Some people who are not scientists and may not be particularly\ninterested in the scientific study of language do talk about language as a\npart of their work. And one of their concerns may be deciding what people\nshould and should not say and trying to enforce these decisions. This kind\nof work, some of its consequences, and how linguists sometimes comment\non it are discussed in the next section.\n1.4 What we don't do:\nprescribing and evaluating language\nStandards\nYou're in a creative writing class discussing short story writing, and you\nsay\n1. You shouldn't introduce a new character unless they have an\nimportant part to play in the story.\nThe instructor of the course corrects you: \"'He or she has', not 'they\nhave'.\" How do you feel about being corrected in this way? Do you think\nthe instructor was justified?\nJust as it is normal to evaluate the religious beliefs and practices and the\nfamily behavior of particular individuals within our culture, it is also normal\nto evaluate the linguistic behavior of people. We may treat some speech\nand writing patterns as acceptable or unacceptable, superior or inferior,\nappropriate or inappropriate. Attitudes such as these must be based on a\nstandard, some idea of what counts as desirable behavior. People who are\nconcerned with defining and maintaining linguistic standards are\nprescribing (rather than describing) language. Usually they prescribe\naspects of grammar, and in this role they are referred to as prescriptive\ngrammarians. There are three kinds of questions we can ask of linguistic\nstandards and language prescription.\n1. What is the purpose of the standard? What use is it put to?\n2. Where does the standard come from?\n3. How is the standard enforced?\nWhy a standard\nOne reason for a linguistic standard is that people within a community (for\nexample, a nation) will be better able to understand one another if they\nagree on a set of words and a set of rules for pronunciation, spelling, and\ngrammar. The process of defining the rules (and sometimes the set of\nwords as well) is called standardization. Once a standard has been\nagreed on, it can be used in the media and taught in the schools.\nJapan provides a good example of this process of standardization and\npromulgation of the standard. Children all over Japan, speaking widely\ndivergent dialects of Japanese, are all taught to speak and write Standard\n15 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nJapanese in school, and radio and television announcers are all expected\nto be familiar with the standard vocabulary, pronunciation, and grammar. If\nthese announcers were to speak in the southern dialect of Kagoshima or\nthe northern dialect of Aomori, people in most of Japan would have\ndifficulty understanding them. Something like this happens in the United\nStates, though more informally. Children across the country are taught the\nsame written standard vocabulary and grammar, though they may not be\ntaught a single standard pronunciation, and radio and television\nannouncers tend to speak in a single standard.\nA related, though often unstated, goal of a standard may be to eliminate\ndiversity, which may be perceived as a threat to national unity. Sometimes\nthe diversity is reflected in different, though closely related, dialects, but\nsometimes it is reflected in completely different languages. It is one thing to\nteach a standard in the schools across a country. It is another to\ndiscourage people from speaking their local dialects or languages (for more\non dialects and languages, see the next section). Sometimes the native\nspeakers of the non-standard dialects or languages become willing\nparticipants in this process in their desire to be integrated into the society.\nIn Japan, for example, standardization sometimes had the effect of\neliminating diversity. In the case of the Ryukyu Islands, the southernmost\nregion of Japan, the dialects that are spoken there are so different from the\nstandard that they may be considered a separate language (or languages).\nToday, following the repressive policies of school administrators in the\nfirst half of the twentieth century as well as the economic and social\npressures for Ryukyuans to conform, this language is on the verge of\nextinction. This is a familiar phenomenon in many countries with minority\npopulations. In the US and Canada, immigrant and American Indian\nstudents have often been prevented from speaking their home languages\nin schools. These educational policies were most notorious in the case of\nAmerican Indian students, who were sometimes sent to schools which kept\nthem separated from their communities and were punished for speaking in\ntheir native languages. These policies were one of the major factors\nleading to the extinction and near extinction of the majority of North\nAmerican Indian languages. For more on the topic of language death\nand \"endangered languages\", that is, languages in danger of dying, see\nthe websites of Terralingua and the Foundation for Endangered\nLanguages, two organizations dedicated to linguistic diversity.\nFinally a (never stated and perhaps often unconscious) purpose of a\nstandard may be to exclude certain groups from power. If the standard is\nbased on the speech of one group, either from a particular region or a\nparticular class, then this gives people in that group an advantage when it\ncomes to jobs and ultimately power.\nStandard languages and politics\nClearly language standardization is a political issue, and as such it is not\nreally the business of linguists (though it is studied by sociologists\ninterested in the social and political aspects of language). However, as\nlinguists often become closely involved with the people whose languages\nthey study, they may become advocates for these groups when their\nlanguages or their well-being are threatened because of the language\npolicies of governments.\nOther reasons are often stated for prescribing language, though these may\nmask the ultimate political reasons. These reasons include the supposed\nillogical or ambiguous nature of some constructions used by people, and\nlinguists have also sometimes gotten involved in the debate in these cases\n16 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nbecause of their expertise. An example is the use of English they, them,\nand their to refer to a single person, usually of unknown or unspecified\ngender, as in the example in the box above. The idea is that since they is\nsupposed to be plural, it should not be allowed to refer to one person. In\ncases like this, prescriptive grammarians are trying to actually improve the\nlanguage or perhaps to preserve what they suppose to be an earlier, purer\nform of the language. The problem is that linguists and other language\nscientists, experts on the \"logic\" and the degree of ambiguity in language,\ncan find nothing inherently wrong with any of these constructions, at least\nnot with the usual examples of \"bad\" English constructions. In fact\nlanguages seem to have their own built-in \"prescriptive\" mechanism which\nweeds out whatever patterns don't work. It's a survival-of-the-fittest sort of\narrangement, and it implies that those common patterns such as \"singular\nthey\" (which has been around in the spoken and written language for at\nleast 500 years) are quite fit linguistically.\nWhere standards come from\nIf we are to define a set of standards for a community, they have to come\nfrom somewhere. One possibility for the source is from other languages,\nand, strange though this may seem, standardizers have sometimes\nresorted to it. Take the \"split infinitive\", which prescriptive English\ngrammarians sometimes argue against. An English infinitive is an\nexpression consisting of to followed by a verb stem (don't worry now if you\ndon't know what this is), for example, to go or to sing. So according to this\nrule, it is incorrect to say or write to boldly go or to not sing. The main\nargument seems to have been based on the fact that Latin and German\nand other familiar European languages cannot split their infinitives. But at\nleast nowadays it seems just silly to try to force one language into the\npatterns of another.\nOnly slightly less extreme is the attempt to impose patterns from earlier in\nthe history of the language onto present-day speakers. An example of this\nis the distinction between the first consonant in which and the first\nconsonant in witch. For most speakers of American English and the\nEnglish of England, there is no distinction, but there used to be (and there\nstill is in some dialects, for example in Irish English and Southern (US)\nEnglish). There are still school teachers in the United States who tell their\nstudents that it is \"wrong\" to pronounce which like witch (my daughter had\nsuch a teacher). As we will see at various points throughout this book,\nlanguage is always changing, and there is little we can do to stop this. In\nany case, if the loss of the distinction between these two consonants\ninterfered with comprehension, it wouldn't have happened.\nIt ain't about good and bad language; it's about class and education\nIf the standards come instead from among the speakers of the modern\nlanguage, the question is which speakers. Language usage varies both\nwith region and with social group, so if we want to standardize, we need to\nchoose a region or group. As noted above, there are sometimes political\nconsiderations involved. In many countries, standard usage comes from\nthe speech and writing of well-educated or upper-class people from a\nparticular region, though the regional origin of the standard is not so clear\nin the case of the United States. For example, the current English standard\nprefers you aren't to you ain't because the latter form, although common in\nregional dialects all over the English-speaking world, is associated with\nuneducated speakers.\nActually this argument only holds today. The history is more complicated. Ain't\nwas once used by upper-class speakers, but prescriptive grammarians who felt\n17 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nthat it was somehow \"lazy\" or \"illogical\" succeeded in mostly obliterating it from\nupper-class speech in the English-speaking world. See this short history of ain't\nfrom the American Heritage Dictionary of the English Language (2000).\nAnother example is the pronunciation of pairs of words like pin\/pen and\nsince\/sense as the same. This is a feature of the speech of a large region\nof the United States, including the South and some areas bordering on it,\nbut it would not be considered a feature of standard American English.\nHow standards are enforced\nGiven reasons for creating a standard and agreement on what constitutes\nthe standard, there is the question of how the standard patterns are to be\nspread through the population. The obvious venue for this is the schools,\nand in many countries considerable attention is devoted to making sure\nstudents are familiar with the standard language of their community. Much\nof this involves simply exposing students to examples of (mostly written)\ntexts in the standard, and this often has the desired effect, at least in the\nwriting of the students. Sometimes the teaching of the standard involves\nattempts to prevent or undo frequent non-standard patterns of usage. Here\nwe are sometimes dealing with standards that don't correspond well to the\nusage of any native speakers of the language, including educated adults.\nFor example, teachers may try to get their children to stop using \"singular\nthey\". Not surprisingly, efforts like this are mostly futile; children are likely to\nfind it impossible to change their grammar in a way that doesn't match what\nthey hear around them.\nTrying to teach grammar to native speakers\nAlthough their efforts rarely seem to have an effect on children's speaking, in a\nlimited way they may affect the children's written language. This is at least\npossible when the \"rule\" amounts to the prohibition of a particular form, for\nexample, ain't. When it is more complicated, the prescribing may backfire,\nleading to behavior that is not what the prescribers had in mind. An interesting\nexample is the use of \"subjective\" pronouns (I, he, we, etc.) vs. \"objective\"\npronouns (me, him, us, etc.) in English. In an attempt to prevent usages such\nas him and me are friends, teachers have created a situation in which many\nspeakers now say with he and I, instead of with him and me, not at all in\naccordance with the original intention of the teachers. This is an example of\nhypercorrection , which occurs when a prescriptive rule is applied in too many\ncases. For more on the issue of hypercorrection with English pronouns, see\nthis interview with English professor Jack Lynch, which explains the usage but\nalso takes a prescriptivist approach.\nIn summary, we've seen two sorts of usages that people try to enforce,\nusually attempting to prevent an \"incorrect\" form. In one situation, there is a\nform perceived as incorrect, such as ain't, that is characteristic of speakers\nof some dialects but not normally part of the speech or writing of speakers\nof the standard dialect. In another sort of situation, there is a form\nperceived as incorrect, such as \"singular they\", which is used by many or\nmost of the speakers of the standard dialect as well as by speakers of\nother dialects. In this second sort of situation, there is often disagreement\nabout what should count as the standard, and it is this kind of case where\nlinguists sometimes become involved because of their interest and\nexpertise in what people actually say or write. (My advice is not to get\ninvolved in one of these arguments. For some reason it often seems hard\nfor people, at least for English speakers, to be rational about what counts\nas \"correct\" or \"incorrect\".)\nI have focused on English. For a brief history of English \"usage\", that is, the\nconcern for what is right and what is wrong in standard English, see this\n18 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\npassage by E. Ward Gilman from the 1989 edition of Webster's Dictionary\nof English Usage. Not surprisingly, there are similar discussions and\ndebates concerning usage in some other languages, though this sort of\nconcern does not appear to be at all universal.\nOther evaluation of language\nSo far we have looked at attempts to enforce linguistic standards on\npeople. But people, especially composition and creative writing teachers,\nare also involved in evaluations of language based on other kinds of\ncriteria. One is appropriateness, discussed in the last section.\nAppropriateness is one aspect of language that we continue to learn as\nadolescents and adults, and it is often explicitly taught. For example, a\nstudent might be corrected for using a word or phrase perceived as too\ncasual in certain contexts, say, be into in the sense of 'be interested in' in\nan essay. Or an employee might be corrected by a colleague for calling his\nboss \"dude\".\nAnother important kind of evaluation concerns the effectiveness of\nlanguage. A usage may be grammatical and appropriate to the context but\nstill not accomplish the speaker's or writer's goal. For example, language\nmay be needlessly ambiguous, as in the following example.\n2. Clark broke open the coconut with the screwdriver and then put it\nback in his pocket.\nA composition teacher might criticize the student's use of it in this\nsentence; does it refer to the coconut or the screwdriver? Or a use of\nlanguage may fail to accomplish a higher-level goal of the speaker or\nwriter. Consider the following example at the beginning of an argument.\n3. Income tax should be abolished. For one thing, people could use the\nmoney they pay as taxes for food or housing.\nA teacher might find the writer's point trivial and obvious and suggest\nleaving it out.\nThese are all legitimate reasons for evaluating language of course. While\nlinguists and other language scientists are not in the business of evaluating\npeople's language, they can be of help by studying what appropriateness\nis, what makes an expression interpretable by a hearer or reader, and how\nthe parts of a text relate to one another.\nProblems\n1.5 Dialects and languages\nIdiolects and dialects\nTwo Americans are talking about a couple they have just met.\nShe sounded English to me, but he doesn't seem to have any\naccent at all.\nTwo English people are talking about the same couple.\nHe sounded American to me, but she doesn't seem to have any\naccent at all.\nWhat's going on here? Who has the accent?\nWhat I know about my language and how to use it is called my idiolect. It\n19 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nalmost certainly varies in minor ways from the idiolects of all other\nspeakers. But what is an idiolect? That is, what kinds of things do I know?\nIn one sense, this whole book is an answer to that question, but we need to\nhave a first cut at the answer here to help us get started.\nI know words. I have a vocabulary, a set of words which I know how to\npronounce and use appropriately. For example, I know how to say the\nword apple, I know that it refers to a particular type of fruit, I come up\nwith this word when I want to refer to a particular apple, and I\nunderstand it when I hear it.\nI know how to pronounce words and combinations of words more\ngenerally. That is, there are aspects of pronunciation that go beyond\nindividual words. For example, I know to pronounce the ending that\nwe spell -ed like \/t\/ in words like picked and watched but to pronounce\nit like \/d\/ in words like signed and burned.\nI know how to put words together into sentences in meaningful ways.\nFor example, I know that if I want to ask when a particular train leaves\nI can say when does the train leave?, but not when leaves the train?.\nI know how to use language appropriately to achieve my goals. I know\nthat if I want a friend to lend my $100, it is better to say I was\nwondering if you could lend me some money than to say give me\n$100.\nI'll be much more careful later on about how each of these types of\nknowledge is described, but for now I'll say (informally) that my idiolect\ninvolves knowledge about vocabulary, pronunciation, grammar, and usage.\nOf course no one is really interested in describing idiolects. Linguists and\nother language scientists study the speech of communities of people, not of\nindividuals. More specifically, they study the knowledge of vocabulary,\npronunciation, grammar, and usage that is shared by the members of a\nspeech community. Because the members of the community agree on this\nknowledge, because it differs (at least in some ways) from the knowledge\nshared by other communities, and because it is mostly arbitrary, I will refer\nto the knowledge as linguistic conventions.\nBut what is a speech community? I will use this term to refer to any group\nof people that shares a set of linguistic conventions differing in some\nnoticeable way from the conventions found elsewhere. You may know that\nin the United States people in some cities have some characteristic\nfeatures in their pronunciation, although they are easily understood by\npeople elsewhere in the United States. For example, people native to\nPittsburgh are known for using you uns (or yinz) to mean 'you plural'.\nHere's an example from the (partly tongue-in-cheek) \"Pittsburghese\"\nwebsite: if yinz wants served, raise your hands.. The number of\nconventions that distinguish Pittsburghers from other English speakers in\nthe northeastern United States is actually pretty small, but because there is\nsuch a set of conventions, we can consider these people to be a speech\ncommunity. The speech patterns, that is, conventions of vocabulary,\npronunciation, grammar, and usage, of a speech community are called a\ndialect, so we can speak of a \"Pittsburgh dialect\".\nNote that a dialect may not be defined entirely on the basis of its physical\nlocation. Cities often contain a variety of ethnic and social groups with\ndifferent speech patterns. For example, the African-American population of\nmany US cities (for example, Pittsburgh) often has a quite different dialect\nfrom the Euro-American population of the same cities.\nWhich dialect do you speak? There may be a number of possible answers.\n20 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nWhat about larger communities? Pittsburghers share some speech\nconventions with speakers in other cities of the northeast and north\nmidwest, for example, their pronunciation of the a in a word like hands, as\nin the example above (more on this pronunciation later on). And people in\nthat larger region share some conventions with people in an even larger\nregion encompassing speakers in most of the northern and western United\nStates, for example, their pronunciation of the long English vowels (bite,\nbeat, bait, boat, etc.). And people in that even larger region share many\nconventions with English speakers all over North America, including most\nof their grammar and usage conventions, as well as a number of\npronunciation conventions, for example, the tendency to pronounce the\nwords latter and ladder in roughly the same way.\nThis idea of larger and larger communities, each sharing fewer and fewer\nconventions, is an over-simplification in one sense. The fact is that the\nboundaries of the communities overlap in many ways. If we look at particular\nvocabulary, we may find a region with one boundary, whereas if we look at\nother vocabulary or at some pronunciation convention, we may find another\nboundary. For example, Pittsburghers tend to say pop (as opposed to soda or\nsome other word) for carbonated drinks, and they share this convention with\nmany speakers in the northern midwestern cities who also share their\npronunciation of the vowel in hands, but not with speakers to the east of them,\nin New York City, for example, who share the pronunciation but not the word.\n(New Yorkers tend to say soda rather than pop.) Thus where we draw the\nboundaries around a dialect depends on which convention or set of\nconventions we're looking at. For more about soda vs. pop, see this interesting\nwebsite.\nAnother way what I've said so far is an over-simplification is that there is great\nvariation within any of these regions. Some of this variation has to do with the\nconstant contact between dialects that is a fact of life in most communities.\nSome of the variation also has to do with the fact that people often know a\nrange of ways to say things and they may sometimes avoid their local dialect in\nfavor of a standard (see below) in certain situations.\nEach of these shared sets of conventions, whether at the level of a small\nvillage, a subculture within a city, or a larger region, is a dialect. And a\nlinguist can be interested in describing any level and any aspect of the\ndialect at any level (pronunciation, vocabulary, grammar, usage). The\npronunciation associated with a dialect is called an accent.\nLanguages\nWhat is a language? How would you tell someone (say, an alien with no\nknowledge of human culture) what English is, without using the word\nlanguage?\nWe can of course extend the boundaries in our example even further,\nbeyond North America to include England, Scotland, Wales, Ireland,\nAustralia, New Zealand, a number of Caribbean countries, and\ncommunities within many other countries. This large speech \"community\" is\nnot really a community in the usual sense of the word, but it does share\nmany conventions. For example, in all of these places, speakers make a\nquestion from a sentence like he ate potatoes by inserting the word did and\nchanging the form of the verb ate: did he eat potatoes?, and of course\nspeakers in all of these places share the word potato for referring a class of\ntuberous vegetables. The conventions of this large \"community\" are of\ncourse what we refer to as \"English\", which we consider a language.\nThus in one sense a language is a set of dialects. In another sense it is\n(like a dialect) a set of conventions shared by a speech community.\n21 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nTwo dialects of one language or two separate languages?\nBut how do we decide when a collection of dialects is a language and not\njust another, more general dialect? As we've already seen, a dialect can\nalso be a set of dialects (the North American English dialect consists of\nSouthern dialect, New England dialect, Canadian dialect, etc.). What\nmakes English a language and not just another very general dialect? What\nmakes Canadian English a dialect of English and not a language in its own\nright?\nThe answer to this question is complicated. In fact there is no clear answer\nbecause the words dialect and language are used in different ways for\ndifferent purposes. There are two completely different kinds of criteria\nrelated to the distinction between dialect and language, linguistic criteria\nand social or political criteria.\nLinguistic criteria\nGiven two overlapping sets of linguistic conventions associated with two\ndifferent speech communities, for example, Mexican Spanish and\nArgentine Spanish, how do we decide whether they should count as two\ndialects or two separate languages? One criterion is the degree of overlap:\nhow similar are the vocabulary, the pronunciation, the grammar, and the\nusage? Unfortunately there's no simple wat to measure this overlap, at\nleast no way that researchers would agree on. One way to have a sense of\nthe overlap, though, is mutual intelligibility, the extent to which speakers\nfrom the two or more speech communities can understand each other.\nMutual intelligibility is also not easy to measure, and it is often based on the\nimpressions of speakers and hearers, how much they understand when\nthey encounter members of the other group or how long it takes them to\nget accustomed to the speech of the other group. We also need to\nestablish some sort of intelligibility threshold; no two speakers can be\nexpected to understand each other all of the time. So none of this is\nprecise at all. The idea is simply that if two sets of linguistic conventions\nare similar enough so that their speakers can usually understand each\nother, then the two sets of conventions should count as dialects of the\nsame language rather than separate languages. On these grounds, we call\nMexican Spanish and Argentine Spanish dialects of the same language\n(Spanish ) because speakers of these dialects normally have little trouble\nunderstanding each other.\nTo find out what should count as a separate language on grounds of mutual\nintelligibility, a good resource is Ethnologue, an online database of all of the\nworld's known languages, 6,912 according to their current listing. The\nEthnologue compilers attempt to use mutual intelligibility to decide what should\ncount as a language. While English is listed as a single language, both\nGerman and Italian are listed as multiple languages. Each of these languages,\nfor example, the variety of Italian called Sicilian, is usually referred to as a\n\"dialect\", but, according to the Ethnologue compilers, these are distinct enough\nto be considered separate languages. Again, the criterion of mutual\nintelligibility is a rough one, and some of Ethnologue's claims are controversial.\nSocial and political criteria\nAnother sort of criterion for what counts as a dialect is the social or political\nunity of the group in question. In Bavaria, a state in southern Germany, and\nin parts of Austria most people speak a dialect called Bavarian or\nAustro-Bavarian, which on grounds of mutual intelligibility could be\nconsidered a language distinct from the speech of Germans and Austrians\n22 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nin other regions. Ethnologue calls Bavarian a language. But Bavarian is\nclearly closely related to those other dialects and not more closely related\nto dialects of some other language, and so for mainly political reasons, it is\nconvenient to consider it a dialect of the German \"language\", rather than a\nlanguage in its own right. Something similar can be said about the\nspeaking conventions of the older generation in the Ryukyu Islands in\nsouthern Japan (because these dialects are dying out, most young people\ndo not speak them). On the basis of mutual intelligibility, we could divide\nthe island dialects into several separate languages, each distinct from the\nJapanese language (as is done in Ethnologue and in the Wikipedia article\non these languages ). But the Ryukyu Islands are politically part of Japan,\nand these dialects are clearly related to Japanese and not related at all to\nany other known language (unless we consider each of them to be a\nlanguage). So for political reasons, it is convenient to consider them\ndialects of Japanese, just as the dialect of Osaka is considered a dialect of\nJapanese.\nMutually intelligible \"languages\"\nAt the other extreme are examples like the languages spoken in the\nnorthern European countries Sweden, Norway, Denmark, and Iceland.\nThese \"languages\" are all related to one another, and speakers from some\npairs of countries within these have little difficulty understanding one\nanother when they are speaking the standard dialects of their languages,\ndespite the obvious differences, especially in pronunciation. Thus on\ngrounds of mutual intelligibility, we might consider some of these\n\"languages\" to be dialects of a single language. But Icelandic, Swedish,\nDanish, and Norwegian are official \"languages\" of separate countries, and\nthere are separate spelling conventions for some of the sounds in the\nlanguages.\nActually the situation is even more complex than this because Norway has two\nofficial dialects, and a fifth related language, Faroese, is spoken in the\nFaroe Islands, which are administered by Denmark.\nSo for mainly political reasons, they are considered separate languages\nrather than dialects of a single language.\nTo summarize, the line between dialects of one language and separate\nlanguages is somewhat arbitrary. However, wherever we draw the line,\nthree points should be clear.\nEvery language has multiple dialects.\nEvery speaker of every language is also a speaker of at least one\ndialect of that language.\nSince the pronunciation conventions of a dialect constitute an accent,\nevery speaker of every language speaks with some accent. There is\nno such thing as \"speaking without an accent\".\nStandard dialects\nThe following appears on the website of a person who spent some time\nin Pittsburgh: \"probably relating to the rest of Pittsburgh's terrible dialect,\nwhich I, fortunately, did not pick up\". Why would some dialects be\nthought of as \"terrible\"?\nSome dialects within a language may be singled out for special status.\nWhen we're dealing with a political unit, such as a nation, in which related\ndialects are spoken by most people, one dialect is often treated as the\n23 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nstandard dialect. You know something about this already from the last\nsection of the book. The standard dialect is often the only dialect that is\nwritten, and it is the one that is taught in schools and (with some\nexceptions) used in the media. Thus in Germany, Austria, and the\nGerman-speaking part of Switzerland, it is Standard German that is\ntaught in the schools and used in broadcasting, even though most people\nin this region are not native speakers of the Standard German dialect. This\nmeans that most people in the German-speaking countries end up\nbidialectal. The same situation holds in Japan, where it is Standard\nJapanese, based on Tokyo dialect, that is taught in the schools and used in\nthe media. Note how this makes it possible to speak of a German or\nJapanese speech community, even when the native dialects of people in\nthese communities are very different from one another, because all\neducated speakers in these communities share the standard dialect, often\nas a second dialect.\nSo what do we mean when we say \"German\" or \"Japanese\"? There are\ntwo possibilities. \"German\" could mean Standard German, that is, one of\nthe set of dialects spoken in Germany and also the basis of written\nGerman. Or it could mean the collection of related dialects, some mutually\nunintelligible, which are spoken in Germany and other countries where\nStandard German is the official language (Austria) or one of the official\nlanguages (Switzerland). When linguists refer to \"German\" or \"Japanese\",\nwithout specifying the dialect, they normally mean the standard dialect.\nDialects of English in the US and England\nIn the United States, the situation is somewhat simpler than in Germany or\nJapan because the differences among most of the dialects are not nearly\nas great; native speakers of English in the United States have little trouble\nunderstanding each other. (An important exception is African-American\nVernacular English (AAVE), spoken mainly by many African-Americans.)\nAs in Germany and Japan, we have an (informal) standard dialect, for\nvocabulary, grammar, and usage, if not for pronunciation. Thus children in\nPittsburgh learn in school to write sentences like the school needs to be\nrenovated rather than the school needs renovated, which would be\ngrammatical in their local dialect. Americans tend to be relatively tolerant of\ndifferences in accent, however. Teachers in schools throughout the country\nteach the standard grammar but use their own local pronunciation. If we\nhave a standard accent, it is the one people associate with television\nannouncers, the accent characteristic of much of the Midwest and the\nWest. This accent is called General American; I will have more to say\nabout it later.\nThe situation in England is similar to that in the United States, and the\nstandard vocabulary, grammar, and usage that children learn to write in\nEnglish schools are very similar to the American standard. However, in\nEngland, there is a stronger idea of a standard accent than in the United\nStates and more pressure for children to learn this accent if it differs from\ntheir home accent. This accent is referred to as Received Pronunciation\n(RP); it is based on the speech of educated speakers in southern\nEngland. (Note that RP is standard English English pronunciation, not\nBritish English; in Scotland, there is a quite different standard accent. ) I'll\nhave more to say about RP and how it differs from General American and\nother English accents in this section.\n\"Just\" a \"dialect\" or a full-blown \"language\"\nThe existence of a single standard dialect among a set of non-standard\n24 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\ndialects has important social implications. The non-standard dialects have\nless prestige, and their use may be discouraged in formal situations, not\njust situations in which writing is called for. Sometimes, as in the Ryukyu\nIslands in Japan or in some regions of France and Spain, this leads to the\ndecline and possible death of the non-standard \"dialects\" (which would be\nconsidered languages by the mutual intelligibility criterion). In other\nsituations, speakers of non-standard dialects retain pride in their local\nspeech patterns, while recognizing that they are not appropriate in certain\nsituations. Finally, this pride, along with other cultural differences\nseparating the speakers of the non-standard dialect from the speakers of\nother dialects (non-standard or standard), may lead to pressure to have\nnon-standard dialects given official status, especially if they differ\nsignificantly from the standard. At this point the words dialect and language\nbecome politically charged terms because the supporters of official status\nfor the non-standard dialect may feel the need to argue that it is not \"just\" a\ndialect of the larger language but rather a language in its own right. This\nhas happened in the United States with AAVE (here is an essay on this\ntopic by the sociolinguist John Rickford) and in Europe with many\nlanguages that are normally considered \"dialects\" of other languages (this\nwebsite includes many of them as well as links to other sites concerned\nwith the \"minority language\" question in Europe and elsewhere).\nLanguage families\nWhy some languages resemble each other\nWe've seen how as we extend the boundaries of speech communities, we\nget fewer and fewer shared conventions. When we reach the level of a\nlanguage such as English, Spanish, or Mandarin Chinese, we have a\nspeech community which shares a set of conventions (in some cases a\nstandard dialect) which allows people in the community to communicate\nwith one another despite dialect differences. But we can go beyond a\nlanguage. So for English, we could extend the boundaries to include the\nNetherlands, Germany, Scandinavia, and some other regions in western\nEurope. We'd now find a much smaller set of shared conventions. All\nspeakers in this large \"community\", for example, share a word meaning 'all'\nwhich is similar in pronunciation to the English word all. But there would be\nno reason to call this set of conventions a \"language\" since the speakers\nobviously do not understand each other and do not belong to a single\npolitical unit with a single standard dialect. Instead we refer to this set of\nconventions, or set of languages, as a language family, in this case,\nthe Germanic languages. The members of a language family resemble\neach other because they are genetically related; that is, historically they\nderived from a common ancestor language. (Note that this use of the word\ngenetic differs somewhat from its use in biology; the speakers of Germanic\nlanguages are not necessarily genetically closer to one another than they\nare to the speakers of other languages.) The ancestor of the modern\nGermanic languages was not a written language, so we can only infer what\nit was like.\nIn most cases we can go even further back; the ancestor languages of two\nor more families themselves may have had a common ancestor language.\nThus the modern Romance languages, including Spanish, French,\nItalian, Portuguese, Catalan, and Romanian; the modern Germanic\nlanguages; and many other languages spoken today in Europe, the Middle\nEast, and South Asia, apparently descended from a much older (and also\nunwritten) language. This means we can group all of these languages into\na single family, in this case the one we call Indo-European. Sometimes,\nto distinguish the lower from the higher levels within a family tree of\n25 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nlanguages, we use \"language family\" only for the largest grouping (for\nexample, Indo-European) and \"branch\" to refer to groupings within this (for\nexample, Germanic and Romance). Note that there may be many\nintermediate levels in the family tree of languages. Within Germanic, for\nexample, there is North, including the Scandinavian languages, and West,\nincluding English, Dutch, and German.\nNote also that languages may resemble each other in one way or another\nfor reasons other than a genetic relationship. The main non-genetic source\nof similarity is language contact; when the speech communities for two\nlanguage are in close cultural contact, their languages often influence one\nanother. So modern Japanese vocabulary includes thousands of words\nborrowed from Chinese and uses the Chinese writing system (as well as\nwriting systems specific to Japanese). But, except in the sense that all\nhuman languages may be ultimately related to one another, there is no\nevidence that Japanese is genetically related to Chinese. A more\ncomplicated situation occurred in Western Asia with the complicated\ncultural influences among people speaking Arabic, Persian, and Turkish.\nThese three languages belong to separate language families (Afro-Asiatic,\nIndo-European, and Altaic, respectively), which are either unrelated to one\nanother or only very distantly related, but Turkish and Persian have\nborrowed many words from Arabic, Turkish has also borrowed many words\nfrom Persian, and Persian borrowed its writing system from Arabic.\n1.6 A stand and two themes\nA stand\nLinguistics is a relatively young science, and psycholinguistics and\ncomputational linguistics are even younger, so it's not surprising that these\nfields are still fraught with controversy. Though there is general agreement\non some core topics, some quite basic issues are still up in the air. It is not\nthe place of an introductory textbook to go into all of the controversies; I will\nonly try to do this for one topic, language learning, perhaps the most hotly\ndebated of all. But it is impossible to discuss any topic related to language\nwithout taking some sort of stand on the questions that divide language\nscientists. All linguistics textbooks take such a stand, though, sadly, few of\nthem tell you that they are doing this. The stand taken in this book is that\nlanguage and language behavior are not phenomena separate from the\nrest of human perceiving, acting, and reasoning; that we can only\nunderstand how language works by understanding how it fits into the rest\nof human behavior. Another way to think of this position is that we will be\ntreating the language sciences as cognitive sciences.\nThis position is related to two of the ways of looking at and studying\nlanguage that we've already discussed. As noted in the overview of the\nbook, we can study language as a system independent of the people who\nuse it, or we can study language behavior, focusing on use. As noted in the\nsection on how language is studied, we can be concerned with product or\nprocess. The stand that this book takes implies that it cannot be enough to\nstudy language as a system in its own right (though it might be useful some\nof the time to do this) or to study product rather than process (though again\nit may be useful some of the time). It also implies that the border between\nlanguage and non-language is not necessarily a clear one and not\nsomething we should spend much time worrying about. So for every topic\ncovered in this book, I will try to look at it both ways, to see how the\nsystem\/product perspective and behavior\/process perspective both\ncontribute to an understanding of how language works.\n26 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nI didn't invent this position of course. A number of other people have defended\none or another aspect of it. On the need to consider cognitive processes\noutside of language in order to understand language, cognitive linguists like\nRonald Langacker and George Lakoff have made this case in many of\ntheir writings, in which they invoke general psychological notions such as\nattention, categorization, and memory. On the need to treat language as\nprocess, an very convincing argument was made in 1983 by the computer\nscientist Terry Winograd in his important book Language as a Cognitive\nProcess (1983).\nIn the rest of this section, I discuss two themes that are consistent with this\nstand and that will guide the rest of the book.\nTwo themes\nMeaning, function, and form\nThe Main Theme of the book is that language associates meaning and\nfunction with form and that understanding how language works requires\nthat we focus on these associations. All three of these terms will become\nclearer later in this book. For now we will just try to get the gist of what's\nintended by them.\nLinguistic form concerns the way a linguistic expression sounds (for spoken\nlanguage) or looks (for written or signed language) or how a linguistic\nexpression is produced. There are two ways of looking at form. The usual\nway within linguistics is to think of form as a sequence of elements. For\nwritten language this is a natural way to treat form because written\nsentences are sequences of elements (characters). For spoken or signed\nlanguage, it is less so. Treating a stretch of spoken or signed language as\na sequence of elements means in effect focusing on the written\ntranscription of the language in terms of units of sound or primitive gestures\nof some sort. This approach tends to play down the role of time, to look at a\nstretch of language as a static object. An alternative and more radical way\nof looking at form (at least for spoken or signed language) is to treat a\nstretch of language as something inherently continuous and dynamic,\nsomething that cannot (or should not) be transcribed as a written sequence\nof elements. In this book, I will usually discuss linguistic form in the first\nway, mostly because this is the way it is usually done and because it\nseems to simplify the analysis. But I will also insert periodic warnings about\nthe biases that are built into this approach. One particular bias we should\nbe aware of is one based on literacy; that is, as skilled users of alphabets,\nwe may tend to think of spoken and signed language in this way (for an\nargument of this sort, see this paper by linguist Robert F. Port).\nI will use meaning to refer to what language is about, the concepts that\nwords and linguistic patterns refer to. By concept I will mean a unit of\ncognitive experience, a way people have of abstracting over their\nexperiences in the world. For example, in a baby's experience the same\nface keeps appearing over it, and the baby abstracts over these different\noccurrences of face-appearing the concept of DADDY. In this book labels for\nconcepts will often appear LIKE THIS. If the nature of form in the study of\nlanguage is controversial, the nature of meaning is even more so. Some\npeople deny that there is such a thing as meaning or that talking about\nmeaning is helpful or that there is a consistent way to define \"meaning\" or\n\"concept\" or \"about.\" I will try to take these positions seriously in this book,\nbut the fact is that I don't know how to even get started without looking at\nthe pole of language that is opposed to form.\nConcepts without words\n27 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nWhatever we mean by concepts, it is clear that not all of them are\nassociated with words. Words are linguistic; concepts need not be. We all\nhave concepts that we have no words or grammatical patterns for. For\nexample, one concept I have is the little depressed region bounded by two\nvertical ridges that is found between the nose and the middle of the upper\nlip. I have no idea what to call that place (though I'm pretty sure it has a\nname in at least some languages); that concept does not represent the\nmeaning of a word for me.\nAnother point to note here is that meanings do not need to be seen as\nthing that are \"out there\" in the world. Since the stand taken in this book is\nthat language is basically a cognitive phenomenon, this would be a strange\nway to think about meaning. Instead I will be treating meanings as things\nthat are \"in here\", cognitive entities realized in our brains, depending on our\ninterpretation of what's out there and including imagined entities that aren't\n\"out there\" at all (though they are inevitably based on things that are).\nI will use function in two senses, first, for the uses that people put language\nto and second, for the uses that particular words or patterns have within\nstretches of language. It is the former sense that concerns us here. People\nuse language to refer, to assert, to command, to convince, to get\ninformation, to entertain, to deceive, and much more, and these uses of\nlanguage obviously have something to do with the forms that they choose.\n(If you want somebody to lend you their computer, you don't say you will\nlend me your computer, you say something like could I borrow your\ncomputer?.)\nMany people who study language make a distinction between function in this\nsense (part of what they call \"pragmatics\" ) and meaning (what they may call\n\"semantics\" ). I would argue instead that the difference is a matter of degree,\nbut that there's not much point in worrying about where the line between\npragmatics and semantics is.\nConstraints\nA second theme of the book is that language is the way it is in part\nbecause of constraints coming from the nature of human biology and\nhuman cognition. A constraint is a kind of limitation on what is possible.\nConsider constraints that come from the nature of the human body itself.\nFor spoken language, the physical and physiological properties of the vocal\ntract constrain what can be produced, and the auditory system constrains\nwhat can be perceived. For sign language, the physical and physiological\nproperties of the hands, arms, upper body, and face constrain what can be\nproduced, and the visual system constrains what can be perceived.\nJust as important are cognitive constraints, constraints arising from the\nnature of the human mind. First, there are limitations on human memory.\nCognitive scientists divide human memory into short-term and long-term\nmemory. Short-term memory is used to temporarily store the information\nthat is needed as we interpret the world around us. When we are faced\nwith a complicated visual scene, we can't look at everything at once, and\nwe have to scan the scene in order to come up with some kind of\ninterpretation. But we need to temporarily store some sort of record of what\nwe've already seen in the scene as we do this. That information is kept in\nshort-term memory. Likewise, when we are listening to a sentence, we\nneed to remember the parts that we've already heard as we are trying\nfigure out the meaning of the whole. Short-term memory is used for this as\nwell. The same applies to reading and to the visual processing of sign\nlanguage. Cognitive science research has shown that our short-term\n28 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nmemory has a very restricted capacity, and this places strong constraints\non how sentences and discourses are organized.\nWe use our long-term memory to store information that we learn through\nexperience. Information may remain in long-term memory for a very long\ntime, even indefinitely, and human long-term memory is very large, larger\nthan the memory of any current computer. But long-term memory is still\nlimited. We obviously do not have an infinite memory capacity, and just\nbecause we have stored an item in memory doesn't mean we can retrieve\nit when we need it. We will see later how the finiteness of long-term\nmemory matters for how language works.\nSince languages have to be learned, limitations on human learning are\nobviously also relevant. This is perhaps the most complex and\ncontroversial topic of all. Everyone at least agrees that language must be\nlearnable because children obviously learn it. That is, it must be possible to\nfigure out the forms, the functions, the meanings, and the associations\nbetween them on the basis of the examples of language that are available\nto young children. It turns out that coming up with an explanation for how\nthis might happen has proven to be very challenging though.\nSpeaker orientation and Hearer orientation\nFinally there are constraints that are specific to the two ways in which\nlanguage is processed, language production, that is, speaking, writing, and\nsigning, and language comprehension, that is, listening, reading, and\ninterpreting linguistic signs. To simplify matters, I will be referring to a\nlanguage producer as the Speaker, even though writers and signers as\nwell as speakers proper are intended. And I will be referring to a language\ncomprehender as the Hearer, even though readers and sign interpreters\nas well as hearers proper are included. (To remind ourselves of these\ndistinctions, I will capitalize Speaker and Hearer when they are used in this\nway.)\nFor the Speaker, the main constraint is that the production of linguistic\nforms be easy. It is easier for the Speaker to make relatively few\ndistinctions because the Speaker has to remember what the distinctions\nare and to make the extra effort to keep things distinct. For example,\nmaintaining the agreement between subject and verb in the present tense\nin English (the girl sings, the girls sing) requires an effort on the part of the\nSpeaker. What is easy for the Speaker depends in turn on constraints from\nthe body. For example, large movements of the tongue tip are more difficult\nto execute than short movements, so short movements should be preferred\nfrom the Speaker's perspective.\nFor the Hearer, the main constraint is that linguistic forms that need to be\ndistinguished can be easily distinguished in comprehension. This constraint\nalso depends on the body, specifically the parts of the nervous system that\nare responsible for hearing (for spoken language) and vision (for written\nand signed language). For example, if a language contains a large number\nof homophones, that is, different words which sound the same (such as\ntwo, too, and to in English), this may put a burden on the Hearer.\nSpeaker-oriented constraints and Hearer-oriented constraints often oppose\neach other; what simplifies things for the Speaker (for example, not making\nmany distinctions) complicates things for the Hearer. We will see many\nexamples in the book of these opposing tendencies.\nThe opposition of Speaker orientation and Hearer orientation is particularly\nclear as languages change. Languages change for a variety of reasons —\n29 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\ncontact with other languages, imperfect learning by children, random\nfluctuation — but it appears that all languages are always changing. Most\nof the changes can be seen as either Speaker-oriented or Hearer-oriented.\nFor example, the grammar of a language may become simplified as some\nsuffixes are dropped, a change that seems to result in less work for the\nSpeaker. But the two kinds of trends always balance each other out in the\nend, and the simplification of the grammar in one way will probably be\ncompensated for by an increase in complexity (from the perspective of the\nSpeaker) somewhere else in the grammar of the language. Otherwise\nlanguage would fail as a communicative device. These built-in pressures in\nfavor of the Speaker and the Hearer apparently prevent the world's\nlanguages from moving in some general overall direction. That is, at least\nin recent history, it does not appear that languages have generally been\ngetting simpler or more complicated (in any sense of these words) as they\nevolve.\nProblems\n1.7 Why study language\nWhat good is the scientific study of language? Why does anyone do it?\nWhy should you care about it? These are the sorts of questions you have a\nright to ask about any university course. The answer to the last question\ndepends a lot, of course, on how you happened to end up in a course using\nthis book in the first place and on what your interests and long-term goals\nare. Language is a part of everyone's life, but it is more central to some\npeople than to others. But I happen to believe that a scientific look at\nlanguage should be a part of the basic curriculum, like mathematics and\nhistory are.\nSecond-language learning\nMany of you have already studied one or more languages other than your\nfirst, and more of you will later on. A few of you may teach a foreign\nlanguage. In either case, you are not likely to find the learning process an\neasy one. Some of the difficulties faced by second-language learners have\nto do with differences between their first and second languages,\ndifferences in pronunciation, vocabulary, grammar, and usage. You do not\nhave to know linguistics to learn a second language; after all, people all\nover the world who have never heard of linguistics do this successfully all\nthe time. However, knowing what pronunciation, vocabulary, grammar, and\nusage are; how they can differ between languages; and how people seem\nto learn them (as first- or second-language learners) can help you be\naware of and understand your problems and possibly correct some of\nthem. A second-language teacher needs to be able to focus on problem\nareas, for example, by giving lots of practice or by simplifying other aspects\nof the language being learned. It is difficult, if not impossible, both to\nunderstand the source of the problem and to come up with ways of\naddressing it without understanding the nature of the material being\nlearned, that is, what linguists and other language scientists study.\nFirst-language learning\nSome students, when beginning a linguistics course, believe it will help\nthem improve their knowledge of their first language. In fact this is not\nsomething you can expect from a linguistics course. You already know the\ngreat majority of the words, the grammatical patterns, and the usage\nconventions that you will need to survive. Of course you can improve; you\ncan learn new words and expressions, become more proficient with the\n30 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\ngrammatical patterns that are part of formal language, and get better at\nusing language to accomplish your goals. Most of the improvement should\ncome naturally as you are exposed to the complex language of academia\nand the workplace. But you will also face evaluations of your language by\nother people — teachers, colleagues, supervisors, even family and friends\n— throughout your life. You will be in a better position to make use of this\ncriticism and advice if you understand what sort of problem is involved (if\nthere really is a problem) and how it fits into the larger scheme of things.\nThis is where linguistics can help.\nAnother way in which most people encounter first-language learning is in\nraising children. Of course you don't have to know linguistics to know how\nto \"teach\" a baby a language; babies aren't really taught language anyway.\nBut knowing what it is that babies learn when they learn a language can\nmake the process more enjoyable. You'll be able to better appreciate what\nan amazing process learning a language is, why so many people are\nfascinated with how this process happens, how your baby does the same\nkinds of things that others do and, at the same time, how your baby's\nlearning steps are unique.\nYou may end up in a job that involves first-language learning more directly,\nas a teacher of your first language to native speakers. In this capacity, part\nof your job will probably be to make sure your students are competent in\nthe standard dialect of the language. As we saw in the section on what\nlinguists study and the section on prescription, sorting out what belongs to\nthe standard is not a trivial matter, and a knowledge of what linguistic\nconventions are seems essential. As I've already said, there is a lot of\nconfusion and controversy about what should be emphasized or even\ntaught at all. You will also need to teach your students what counts as\nappropriate and effective language. Again linguistics and other language\nsciences can help; some language scientists devote their efforts to figuring\nout what makes different expressions appropriate in different situations,\nwhile others are concerned with how words and expressions are\ninterpreted by hearers and readers.\nOr you might work as a speech therapist, dealing with people with speech\ndisabilities of one kind or another. Here the relevance of the scientific study\nof language is obvious; you first need to know what the norms of a\nlanguage are before you can hope to address the ways in which your\nclients or patients deviate from these norms.\nCognition\nLanguage is probably the best window we have on the workings of the\nhuman mind. Language gives us the extraordinary ability to describe the\ncontents of our thoughts, an ability that no other animal has. Of course\nthere are many unconscious aspects to cognition that we cannot talk about,\nbut these properties are apparently also reflected in what we say. The units\nof language — elements of form, words, grammatical patterns, conventions\nof usage — are in some sense also units of cognition. The implication is\nthat the study of what all languages share is also the study of what it is to\nbe human, something that is certainly an important topic for any educated\nperson.\nLinguistics and tolerance\nWhat we can learn about the human mind by studying how languages differ\nfrom one another is more controversial. Linguists and other cognitive\nscientists disagree on how deeply the nature of a person's first language\ninfluences how the person thinks and views the world around them. I'll\n31 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nhave more to say on this topic at various points throughout the book. But\nlanguage is such an important part of our lives that learning about the\nlanguages of other people, including how those languages differ from ours,\nis in a very real sense learning about those people. As with any other\naspect of culture, lack of knowledge can lead to intolerance. It is easy to\nbelieve that other languages are inferior in one way or another to ours, to\nthink that some languages, especially the languages of relatively small\nethnic groups in the Third World, are more primitive than others. So the\nrealization that a language like Tzeltal, Lingala, Amharic, or Inuktitut has a\nset of grammatical categories and communicative options not even found\nin English is an eye-opening experience. Looking more closely at\nlanguages, and in particular at languages that might seem exotic to us, can\nmake us more tolerant.\nFinally, language is what we use to influence the beliefs of one another.\nThis happens in everyday conversation, as we argue about who forgot to\nput the mayonnaise jar back in the refrigerator or what the results of the\nlatest election mean. It happens in advertising, as companies do their best\nto get us to buy their toothpaste, shoes, and cars. It happens in education,\nas educators provide us with what they say are truths and try to convince\nus that knowing how to speak Spanish or how to do a t-test will be useful to\nus later in life. It happens in politics, as politicians and political activists try\nto get us to vote for them or to support their program. None of this is new,\nbut the enormous quantity of information that is now available to most of us\nis new, and most of this information is designed to change our beliefs in\nsome way. Obviously an educated person needs to be able to navigate\ntheir way through all of this, to sort out the nonsense, to see how bias and\nideology are behind what is being claimed, to be a critical reader and\nlistener, to make informed decisions. I don't believe that any of this is\npossible without understanding the role that language plays in knowledge,\nbelief, and persuasion.\n1.8 Problems\n1.8.1 Describing and explaining, Prescribing and evaluating\n1.8.1.1\nNote: This problem set assumes some basic knowledge of English dialects,\nso if you are not a native speaker of English, you will probably want to\ncollaborate with somehow who is.\nEach of the following includes two ways to say (at least roughly) the same\nthing. For at least some people, the first way (A) could be seen as \"wrong\"\nin some sense. We saw in these two sections of the book that there are\nvarious ways in which a particular linguistic form can be thought of as\n\"wrong\" (though not necessarily by linguists).\na. The use is not grammatical or otherwise acceptable (in the case of the\npronunciation of a word) in any dialect of the language.\nb. The use is grammatical or acceptable in some non-standard dialects,\nbut not grammatical in the standard dialect.\nc. The use is grammatical or otherwise acceptable for most speakers of\nthe standard dialect, but some speakers may find it \"wrong\" for one\nreason or another.\nd. The use is grammatical or acceptable but not appropriate in the\ncontext.\ne. The use is grammatical and appropriate but not effective.\n32 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nFor each of the following, decide which type of \"mistake\" is involved in A\n(as compared to B), and explain your answer in a sentence or two. There\nmay not be a single right answer for some of the problems.\n1. A: nuclear pronounced noo-kyuh-lur\nB: nuclear pronounced noo-klee-ur\nThis pronunciation is used by many speakers of standard American\nEnglish (including President George W. Bush, though it could be\nargued that his accent is not standard), but some speakers feel that it\nis not standard, probably because it does not reflect the relationship\nbetween the word and the noun nucleus.\n2. A: yellow pronounced yell-uh\nB: yellow pronounced yell-oh\nThis pronunciation is acceptable in some non-standard accents but\nnot in standard American English.\n3. A: Mr. President, what you're saying sucks.\nB: Mr. President, I can't accept what you're saying.\nThis use of sucks is acceptable in informal American English, but, like\nslang more generally, it is inappropriate in a formal context like this.\n4. A: I come back last night.\nB: I came back last night.\nThis use of come as the past tense of come is grammatical in some\nnon-standard English dialects but not in standard English.\n5. A: Next shake the test tube that you dissolved the salt in.\nB: Next shake the test tube in which you dissolved the salt.\nThis use of a preposition like in at the end of a clause is perfectly\ngrammatical in standard English, but there are a small number of\ndiehards that prefer the use in B. B probably sounds very formal to\nmost speakers of standard English.\n6. A: Whoever it belongs to should claim it.\nB: Whomever it belongs to should claim it.\nBoth A and B are used by speakers of standard English, though A is\nprobably more common, and it follows the \"rule\" that is taught in\nschools for the use of who and whom because whoever is the subject\nof should claim. You sometimes see uses like in B in standard\nEnglish, though.\n7. A: He left glass water on table.\nB: He left a glass of water on the table.\nA is not grammatical in any dialect of English. It could have been\nproduced only by a learner of English, either a child learning English\nas a first language or someone learning English as a second\nlanguage.\n8. A: When I exited the bed this morning, my hair looked like rabbit ears.\n(an eight-year-old speaking to his mother; this is a real example)\nB: When I got out of bed this morning, my hair looked like rabbit ears.\nThis use of exit is grammatical but not appropriate in this relatively\ninformal context.\n9. A: John ordered his meal from the waiter, and he brought it to him\nright away.\nB: John ordered his meal from the waiter, and the waiter brought it to\nhim right away.\nIn A the word he could refer to either John or the waiter, though in the\ncontext most people would realize that it refers to the waiter. Some\n33 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\npeople might argue that he here is not as effective as the waiter, as in\nB.\n10. A: How did y'all like the party?\nB: How did you like the party?\nIn some non-standard dialects of American English, y'all means 'you\nplural'. It is perfectly grammatical in those dialects but not in the\nstandard dialect.\n11. A: I would be thankful if it could be let known to me whether taking a\nstudent under your fold and tutelage for a long and hopefully eventful\npartnership would be acceptable to you. (a real example from an\ne-mail to me)\nB: Please let me know if you can take on a new student.\nThe writer of A is using grammatical English, but the elaborate and\nindirect language is neither appropriate (in any context?) nor an\neffective way to convey what they want.\n1.8.1.2\nYou are a linguist studying the grammar of a particular dialect of English.\nYou have recorded a stretch of speech between two men who are\nspeakers of the dialect, and now you are taking examples from the\nrecording to use as data. Included in the recording is the following\nstatement by one of the speakers.\nYou don't even realizing it.\nYou are trying to decide whether your account of the grammar of this\ndialect should include this sentence. Unfortunately you no longer have\naccess to the two speakers, so you can't ask them questions. For each of\nthe following, say whether it would be a relevant thing for you to do in order\nto help make your decision. Explain each answer.\n1. You consult a book written by another linguist about the grammar of a\nclosely related dialect.\nSince you can expect the grammatical conventions of the two dialects\nto be similar and the description by the linguist of the grammar of the\nother dialect to be concerned with what people really say (as opposed\nto what somebody says they should say), the book is relevant to your\ndecision. In particular if you discover that a form like this is\ngrammatical in the other dialect, then there's a good chance it is in\nthis dialect too.\n2. You listen for similar sentences in the rest of your recording.\nThis is relevant to your decision because if you find similar sentences,\nfor example, I don't believing it, then the original sentence was\nprobably not a speech error.\n3. You ask more educated speakers from the same region as the two\nmen whether they could say something like this.\nThis is not relevant to your decision. Dialects often vary with\neducation, so if the form is ungrammatical for more educated\nspeakers (likely since it's ungrammatical in the standard dialects of\nEnglish that you're familiar with), this doesn't tell you whether it's\ngrammatical for your speakers.\n4. You listen to what immediately follows the example on the recording\nto see if the speaker corrected himself.\nThis is relevant to your decision because a correction would be clear\nevidence that the sentence was a speech error and hence not an\nexample of a grammatical convention that you need to account for in\n34 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nyour grammar.\n1.8.2 How we study language\nIn this section, we saw that ambiguity is an example of a phenomenon in\nlanguage that can best be appreciated from the perspective of\ncomprehension. Consider the English words that are written bank, meaning\nroughly 'side of a river,' 'kind of financial institution,' and 'tilt while making a\nturn' (there are other meanings as well). Because all of these are written\n(and pronounced) the same, a reader (or listener) has to disambiguate the\nform when it appears. But this can be done in different ways, using different\nkinds of information. For each of the following sentences, say what kind of\ninformation a reader could use to disambiguate the word bank, and rank\nthe three for how difficult they would probably be for a computer program.\nImagine that the person or program knows only the three meanings of bank\ngiven above.\n1. I don't have much my money in my account at the bank.\nIf our reader or program had a list of other words associated with each\nmeaning of bank, the list for the 'financial institution' would probably\ninclude money and account. So if we just look for the meaning that is\nmost likely given then other words in the sentence, we'd select the\nright one in this case. This sentence wouldn't require a very deep\nunderstanding to disambiguate bank.\n2. Before landing, the plane will have to bank to the right.\nYou may have noticed that two of the meanings are noun meanings\nand one (this one) a verb meaning. The phrase will have to must be\nfollowed by a verb, so only that meaning is compatible with the\ncontext. Since this appears to be an absolute constraint (neither of the\nother two meanings could conceivably fit here), the disambiguation in\nthis case could be seen as easier than in the first sentence.\n3. When I climbed out of the boat, all of my money fell onto the bank.\nLike the first sentence, this one uses of the noun meanings. If we try\nto disambiguate on the basis of co-occurrences, boat might lead to\none of the meanings (apparently the correct one), while money might\nlead to the other. So it seems that in this case, something more\nsophisticated is required, some deeper \"understanding\" about how\nmoney (that is, actual physical money: coins and bills) can only fall\nonto a physical surface like a river bank and not, for example, onto an\ninstitution. That is, this is the most difficult of the three sentences to\ndisambiguate.\n1.8.3 Two themes\nFor each of the following facts about human language, say whether it\nderives from Speaker (or Learner) orientation or Hearer orientation, that\nis, whether it makes things easier for the Speaker, the Hearer, or the\nLearner. Explain your answer in a sentence. There may be more than one\npossible answer.\n1. Fos is a more likely word in a human language than zkt is.\nThis is a Speaker-oriented fact. It is simply easier to pronounce the\nsequence fos than the sequence zkt because of the vocal organs\n(especially the tongue) work.\n2. Languages tend not to have many homophones, that is, words that\nsound the same but have completely different meanings such as bear\nmeaning the animal and bear meaning 'tolerate'.\n35 of 36 1\/5\/2007 7:39 PM HLW: Introduction (Printer-Friendly) http:\/\/www.indiana.edu\/~hlw\/Introduction\/pf.html\nHomophones are difficult to understand so the rarity is a\nHearer-oriented fact.\n3. Languages do not have specific names for every object; instead they\nhave names for categories of objects.\nSpecific names for every possible object would be far too many to\nremember; this is Learner-oriented. (It could also be Speaker- or\nHearer-oriented because even if all of the words could be learned, it\ncould be hard to retrieve them from memory during language\nproduction or understanding.)\n4. In sign languages, signs are normally not made with unrelated\nmovements of the two hands, for example, with one hand moving up\nand down while the other moves sideways.\nIt's very difficult to coordinate unrelated movements of the hands; this\nis Speaker-oriented.\n5. Apparently all human languages have a way of distinguishing\nstatements from questions.\nHearers need to be able to distinguish between statements and\nquestions to understand what Speakers intend; this is a\nHearer-oriented property of language.\n6. Some languages have only three vowels. If so, these vowels tend to\nbe pronounced quite differently from one another, usually similar to\nthe vowels in hot, heat, and hoot.\nHearers have to be able to distinguish the vowels in the language in\norder to distinguish the words, so the more different they are from\neach other, the easier it will be for the Hearer. This is a\nHearer-oriented property of language.\n| contact author | table of contents | printer-unfriendly version |\n© 2006. Indiana University and Michael Gasser.\nPermission is granted to copy, distribute and\/or modify this document under the\nterms of the GNU Free Documentation License, Version 1.2 or any later version\npublished by the Free Software Foundation.\nURL: www.indiana.edu\/~hlw\/Introduction\/pf.html\nEdition 3.0; 2006-08-25\n36 of 36 1\/5\/2007 7:39 PM "}