{"text":"Reading and Writing as Processes\nWhile reading and writing well may seem like magic, each is actually a step-\nby-step process that anyone can learn. This section will walk you through the\nsteps and give you some techniques for reading and writing in college that\nhave helped many students much like you.\nWriting Reading\nPlanning to Read\nPlanning to Write\nSurvey\nDrafting\nQuestion\nEditing and Revising\nRead\nProofreading\nRecite\nPublishing\nReview\nPlanning to Read or Write How do I get started reading or writing?\nWriting\nReading\nHow do I get started?\nThe first step in writing is actually not writing at all. Before you can write\nwell, you have to have something to say. So, the first step is to generate ideas\nthat you will incorporate into your writing.\nThere are several strategies that students and professors alike use to help\nthem come up with good ideas. These strategies work well for writing you\ndo as an out-of-class assignment or for in-class writing; you’ll simply spend\nmore time if you’re writing out of class. These strategies are brainstorming,\nfreewriting, and clustering (also known as mapping).\nFor more detailed information on planning your writing, visit the Wikibooks\n- Rhetoric and Composition chapter, \"Planning and Prewriting.\"\nAuthor: Jenny Crisp\nReading\nBefore you start to read, preview the material. Note the section headings and\nany bold or italicized words. Next, jot down some questions you might have\nabout the reading assignment. If you are reading about the American\nRevolutionary War, you might have the question, “What caused the way?”\nNow you are ready to read! Just be sure to be an active reader, someone who\nis truly paying attention to the ideas, not just someone who is looking at the\nwords but not really understanding them. To make sure that you are an active\nreader, picture what is being said. If the material is about a battle, picture the\nbattle and the fighting that occurs; don’t just “think” the words. That way, you\nshould find the answers to the questions you came up with before reading\nand remember what you have read. After you have read and answered the\nquestions you prepared, go back over the questions and recite the answers. Finally, review the material. You want to make sure that you not only read\nthe material, but that you also understood it!\nLoading ... SQR\nThe SQ3R method is a reading strategy that teaches the reader to: Survey,\nQuestion, Read, Recite, and Review.\nTo learn about this method, you may visit the websites below.\nSQ3R Handout\nhandout provided by the Borough of Manhattan Community College\nThe SQ3R Reading Method\nfrom the Study Guides and Strategies website Brainstorming\nBrainstorming is the planning method most often used for in-class, timed\nwriting, but many students also like it for out-of-class writing as well. When\nyou brainstorm, you look at your topic and start writing down ideas about\nthat topic as soon as they occur to you. You don’t worry about whether the\nideas are good or bad; the point is just to generate ideas to choose from. If\nyou’re writing out of class with no time limit, you might brainstorm for five\nor ten minutes. For timed writing, most students will spend as few as two\nand no more than five minutes.\nAuthor: Jenny Crisp Clustering\nClustering is particularly useful for writers who like having a visual\nrepresentation of their ideas. In this method, students write their topic in the\ncenter of a piece of paper and draw a circle around it. Then they put related,\nsupporting ideas in a “cluster” around that central topic, drawing circles\naround the ideas and connecting them to the main idea or even each other\nwith lines to show how they are related.\nA simple cluster map of the essay about apples might look something like\nthis:\nMap with running an apple farm center, subtopics Climate (at 12:00),\nTaxes (5:00), and Marketing (7:00)\nAuthor: Jenny Crisp Freewriting\nFreewriting is sometimes called the “wet ink” method of planning a piece of\nwriting. In this method, you pick a period of time, often five to ten minutes,\nand you write complete sentences about your topic without pausing – without\nletting the ink get dry on the page. You don’t go back and make changes or\ncorrections, you don’t worry about the quality of your ideas, and if you run\nout of ideas, you write “I can’t think what to write” until something comes to\nyou. Again, the point is to generate ideas, although sometimes student writers\nfind they can take whole sentences from their freewriting and put them\ndirectly into their papers.\nAuthor: Jenny Crisp\nDrafting Writing the paper\nOnce you’ve gotten into the habit of planning, you may well find that the\nactual writing of the essay is relatively easy. If you have the basic plan laid\nout, you can follow it as you explain your thoughts. You don’t have to follow\nit in exact order, though. If you find it easier to start with one of the body\nparagraphs even though the introduction will ultimately be the first thing a\nreader sees, feel free. You can put everything in order later.\nAuthor: Jenny Crisp Drafting guidelines\n1Overview of Drafting\n2Drafting: The Process\n3During the Drafting Process\n3.1Let It Flow\n3.2Dealing with Writer's Block\n3.3Experiment\n3.4Meeting the Minimum Word Count\n3.5Title of Your Essay\n4Final Thoughts on Drafting\nhttps:\/\/en.wikibooks.org\/wiki\/Rhetoric_and_Composition\/Drafting\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Writing outside of class\nWriting on a time limit while you're in class is a special situation, and it's\ndiscussed at length in the chapter on writing in class. If your essay is one that\nyou write as homework, though, your job as a writer is easier. As long as\nyou manage your time well, you don’t have to worry about time limits. You\nmay also be able to write on a computer, which of course makes rearranging\nand editing much easier.\nYou should follow the same steps in the writing process: planning,\ncomposing, revising, editing, and proofreading. One tip that will help you is\nto plan your steps to take place at different times. If you take a break between\nplanning and composing, new and useful ideas may occur to you. If you set\nyour essay aside once you’ve composed it and come back to revising in a\nday or two, you will do a much better job because you’ll be able to see the\nessay more as a reader does. Finally, if you can, set it aside for another day\nbefore proofreading and editing. You’ll find you catch many more mistakes\nthan you would if you tried to proofread right after finishing it.\nAuthor: Jenny Crisp\nEditing and Revising Editing and revising\nRevising, editing, and proofreading are the most important steps in college\nwriting, but they are steps many beginning college writers are tempted to\nskip. Don’t be one of those! Students who don’t revise, edit, or proofread\noften turn in great ideas, but in a form that is hard to understand or that just\nisn’t up to the standard of formal academic work. These steps don’t have to\nbe hard, but they can make a huge difference in what your work says about\nyou and how you are perceived. They can also make a huge difference in\nyour grades!\nAuthor: Jenny Crisp Revising\nRevising is the “big picture” work. Look at what you’ve written to see if it\nall makes sense. Check your logic; have you explained everything clearly\nand shown how it all ties together? Do you have enough details or examples\nto illustrate what you’re trying to say and to make the essay interesting? Does\neach body paragraph really belong in this essay? Is there another paragraph\nthat you really should write and include? Be sure to do these “big picture”\nchecks before you get into the details of editing and proofreading since any\nbig changes will mean you just have to edit and proofread again.\nAuthor: Jenny Crisp Editing\nEditing is a stage between revising and looking for typos. At this stage,\ncheck to be sure all your sentences are clear. Also, check the beginning of\neach paragraph and anywhere else that you introduce a new idea and make\nsure that passage flows smoothly from the passage that came before. If not,\nadd a transitional word, phrase, or even sentence to help bridge the gap.\nAuthor: Jenny Crisp More on editing and revising Contents\n1 Editing and Revising: One and the Same?\n2 Sentence Structure\n3 Editing Tips\n4 Perspectives on Style\n4.1Richard Lanham on Prose Styles\n5External Links\nFrom Rhetoric and Composition\/Editing\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply.\nProofreading Proofreading\nAt the proofreading stage, you are sure that you have all the sentences you\nwant and that they’re in the right place. At this point, you can start cleaning\nup any typos or grammatical errors. If you’re able to work at home or some\nother private place, try reading your work out loud; this helps many writers\nfind mistakes. If you’re working on a computer, print your essay out or\nchange the font so that it looks different; sometimes that helps in spotting\nerrors, too. Finally, try reading the essay “backward.” Read the last sentence\nfirst, then read the sentence before that, etc. This can help you really focus on\nwhat the sentences actually say. When you read over something you’ve\nwritten in order, sometimes you unconsciously “correct” it, seeing what you\nmeant to write instead of what is actually on the paper.\nAuthor: Jenny Crisp More on proofreading Contents\n1 Proofreading\n2 Proofreading Basics\n3 Proofreading Tips\n4 Proofreading & Copy Editing Symbols\n5 Ten Steps for Proofreading Your Work\nFrom Rhetoric and Composition\/Proofreading\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply.\nPublishing Publishing\n\"Publishing\" does not have to mean that your work will be printed and sold\nin bookstores. Getting your writing ready to submit is a form of publishing as\nwell, and there is always the opportunity to publish your own work on a blog\nor a similar outlet. Regardless of whether you are sending to a book printer,\nputting a post online for the world to read, or formatting and assembling a\npaper for a professor to evaluate, you want your work to present a good\nimpression of you and your ideas. Formatting styles - \"publishing\" a paper for a\nprofessor\nMLA Formatting and Style Guide (English classes)\nAPA Formatting and Style (classes in the social sciences)\nChicago\/Turabian style Writing for the Web Contents\n[hide]\n1 Writing for the Web\n2 Audience and Writing\n2.1 Corporate Writing\n3 Writing on Social Networking Platforms\n3.1 Your Words will follow You\n4 Visual Awareness\n5 Use of Video and Graphics\nFrom Rhetoric and Composition\/Writing for the Web\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. More on publishing Contents\n1 Overview\n2 Types of Publication\n2.1 Do-It-Yourself Print Publishing\n2.2 Academic Publishing\n2.3 Commercial Publishing\n2.4 Electronic Publication\n3 Your Rights\n4 External Links\nFrom Rhetoric and Composition\/Publishing\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply.\nUnstated Main Idea Unstated Main Idea\nFinding the unstated main idea is very similar to finding the main idea, or\ntopic sentence, of a paragraph. The difference is that the main idea is not a\nsentence that you find in the paragraph or reading selection; it is unstated or\nimplied. You might be asking why a reading selection would not contain a\nstated main idea, but the majority of college textbooks do not contain stated\nmain ideas. The material is presented with enough clues that you can figure\nout the main idea of the text.\nIn order to understand how to find an unstated main idea, let’s review some\nbasic steps. When you are finding a stated main idea or topic sentence, you\nlook for the topic. The topic is a few words (may be even one word) that\nmay be repeated throughout the passage. You find the topic by asking “who”\nor “what” the passage is about. Once you have determined the topic, you\nmove on to asking yourself what the author is saying about the topic. When\nthe main idea or topic sentence is stated, you are looking for a sentence that\ntells what point the author is making; however, when the main idea or topic\nsentence is unstated, you must come up with a sentence that states the\nauthor’s point. Let’s look at an example.\nCarefully I pulled my jacket more tightly around my body. Even the thick\nsweatshirt I was wearing didn’t help. The tip of my nose was cold, and my\nfingers felt too frozen to type. I looked longingly at my portable heater\nbut didn’t want to use it because I was afraid I’d leave it on by accident.\nSighing to myself, I began to type but stopped when I could almost see my\nbreath in the air. “Enough for today,” I said to myself. “I’m headed\nhome.”\nLet’s start with the first question: the topic. Who or what is the paragraph\nabout?\nLook at the word choice. The word “cold” is used once, but what picture is\nthe author painting? If you said that the topic was a cold office, you’d be\nright. There are several clues: warm clothing, cold nose, frozen fingers,\nbreath in the air. Now, let’s ask ourselves the key question: What is the author saying about\nthe cold office? It appears that the author is cold enough that he\/she chooses\nnot to stay long in the cold office, so put that idea into a sentence.\nThe office is too cold for anyone (or the author) to stay very long.\nRemember, main ideas must be expressed in a complete sentence, so a\nfragment will not work when you are constructing the main idea or topic\nsentence. In addition, you need to test your sentence. Is it general enough to\ninclude the points of the paragraph? Main ideas\/topic sentences are general\nsentences as opposed to specific ones. Is it well written? Again, it must be\na complete sentence. Our sentence appears to capture the point the author\nwas making, so we have successfully created a main idea from a paragraph\nwhose main idea was unstated.\nFinding the unstated main idea takes some practice. In your textbooks, you\nwill need to read slowly and carefully in order to fully grasp the author’s\npoint. When you write your essays, you will always state the main idea or\ntopic sentence in your essays, but you need to be aware that your college\ntextbooks will not always have the main idea or topic sentence stated for\nyou. If you don’t see a general sentence that sums up the points of the\nparagraph or reading selection, then you will need to visualize or even write\ndown the main idea because it is unstated.\nAuthor: Dr. Lydia Postell\nEssay Structure Structure overview\nYou can imagine the structure of an essay looking something like the diagram\nbelow.\nAt the top is your introductory paragraph, which starts broad and narrows\ndown over the course of a few sentences to your very specific thesis\nstatement, which is the last sentence in the paragraph.\nThen, the middle or body paragraphs are \"fat\" with lots of specific details in\neach to illustrate your points.\nFinally, the conclusion paragraph at the bottom starts narrowly, with a\nrestatement of your thesis (be sure to word it differently than in the\nintroduction - same idea, different words). Then the paragraph gets broader\nover the next few sentences, where you address the \"so what\" question. What\nis the broader significance of what you've been saying in the essay?\nAuthor: Jenny Crisp Preposition Video (20 minutes)\nThesis\/Topic\/Main Idea Main Idea\/ Thesis Statement Main idea\nAuthor: Lydia Postell\nThe main idea, as we call it in reading class, is the same as the topic\nsentence in English class. The main idea, like the topic sentence, simply\nstates what the reading passage is about in one sentence. There are several\nways to find the main idea that you can apply to topic sentences as well.\n1. Find the topic of the selection. In order to find the topic, ask yourself who\nor what the selection is about. When you answer either one of those\nquestions, you will have found the topic. Here are a couple more hints. The\ntopic will often be a word that is repeated throughout the selection. For\ninstance, if you were reading a paragraph about dinosaurs and how they\nbecame extinct, you would see the reason they became extinct repeated\nseveral times throughout the selection, many times using different words.\n2. Another important concept about the topic is that it is always written as a\nfew words or even as one word. Sometimes the title of the selection is the\ntopic.\n3. A third way to look for a main idea is to consider the wording. When you\nsee words that suggest you could find the information by creating a list, then\nyou have found the main idea sentence. Examples of these word groups are\nseveral kinds, three disadvantages of, several reasons for, three causes of,\nand others along these lines. These types of sentences announce the points\nthe reading will deal with.\nA couple of ideas to keep in mind: Main idea sentences take in everything in\nthe reading passage, so when you look for a main idea sentence, be sure to\nlook for the sentence that can take in all the points the paragraph or reading\nmakes. Another important idea to keep in mind is that the main idea, like the\ntopic sentence, may appear in other locations besides the beginning of an\nessay. While it may appear in the first two or three sentences, it may also\nappear in the middle or at the end of a reading selection. Don’t limit\nyourself by looking only at the beginning! Look for the most general\nsentence, and then ask yourself who or what the selection is about. If you are struggling at that point, you might wish to look at the wording of the\nsentences to see if one suggests that a list might be coming. If so, then that is\nyour main idea sentence. Thesis Statement\nAuthor: Jenny Crisp\nIn writing, a thesis statement is the most important sentence you will write in\nan essay. For this class, and likely for most of your college courses, it should\nbe the last sentence – or sometimes the last two sentences – in your\nintroduction paragraph.\nThe thesis statement will say something about your topic, but doesn't just\nstate your topic. For example, you would not want to write\n[Bad thesis]: This is an essay about how everyone should\nown a dog.\nInstead, your thesis statement should say something that is debatable – that\nis, it should have some attitude. If no one could possibly argue with your\nthesis statement, what would be the point of writing at all? So, let's work on\nthat thesis statement from before:\n[Bad thesis]: This is an essay about how everyone should\nown a dog.\nHow could any reader argue with that? It's your essay – you know what it's\ngoing to be about. No one reading your essay knows what it's about yet –\notherwise why read it? So, to give it some attitude, let's quit talking about the\nfact that it’s an essay:\n[Decent thesis]: Everyone should own a dog.\nOK. That's better – that thesis statement has an attitude. But, if I'm reading\nyour essay, I still don't really know where you're going with this, do I?\nThat's where the other part of the thesis statement comes in: the essay map.\nAn essay map gives your reader some idea of what's coming. What would you talk about in trying to convince your friends that everyone should own a\ndog? Those are the topics that you will explain in your body paragraphs, and\nthey are the things you should list in your thesis statement’s essay map.\nHere's an example:\nGood thesis: Everyone should own a dog because dogs\nprovide companionship, provide protection, and provide\ngreat entertainment.\nNow, there is a thesis statement! That one has attitude – it takes a side on the\ntopic. It also provides a map of where the essay is going. With a thesis\nstatement like this, readers know to expect a body paragraph about\ncompanionship, then one about protection, and then one about entertainment.\nSounds more interesting than just saying “this essay will be about dogs,”\nhuh? Main Idea - Practice Exercise1\nSelect the stated main idea in the following passages.\nPassage 1\nMany people claim that they do not have time to work exercise into their\ndaily schedules. However, exercise can be easily worked one's daily\nroutine. For instance, one can do stretches while taking a shower. While\nstanding in line at the grocery store, one can flex the abs or clench the rear.\nOne can even do calf raises while talking on the phone. More ideas: try\nwalking around the building during lunch breaks and always take the stairs.\nPassage 2\nMany parents tend to think of day-care centers as breeding grounds for\ncolds. But new research suggests that children in day-care centers appear to\ndevelop immunity to many of the viruses responsible for the common cold.\nAn article published in the Archives of Pediatrics and Adolescent Medicine\nfound that children ages 6 to 11 who had been enrolled at large day-care\ncenters as toddlers had about one-third as many colds as children who had\nstayed home as toddlers. Dr. Thomas Ball, one of the authors of the study,\nsays that when children have colds as toddlers, their immune systems are\nlearning from these experiences, and this learning will come back to protect\nchildren later in life. Such news should be reassuring to parents whose\npreschool children are in daycare.\nMain Idea - Practice 1 Answer Key Main Idea - Practice Exercise 2\nSelect the stated main idea in the following passages.\nPassage 1\nOne sign of pregnancy is nausea upon awakening. Other signs are increase\nin size and tenderness of the breasts. Still other signs include increase in the\nfrequency of urination and an increase in the size of the abdomen. Thus,\naside from pregnancy tests, a woman can sometimes recognize the early\nsigns and symptoms of pregnancy.\nPassage 2\nIs this year's holiday season making you tired? You can easily perk up by\nfollowing a few easy tips. First, get plenty of rest. Second, snack wisely.\nThird, keep fit. Exercise is very important during the holidays--and not just\nfor its weight benefits. Fourth, take a relaxing bath, and finally try sharing\nwith others.\nPassage 3\nAre you confused by your holiday leftovers? Well, don't save any food that\nhas been sitting around on your dining room table or counters for more than\ntwo hours after cooking. Do place the leftovers in the refrigerator while they\nare still warm. Don't waste those turkey scraps: add them to a salad or\nmake a delicious soup. There are many strategies that you should use when\ndealing with holiday leftovers. You can even pool your leftovers with\nfriends and neighbors by having an after-holiday potluck dinner.\nPassage 4\nYesterday's storm did considerable damage to our neighborhood. Many\nstately oaks were uprooted, and several large old pine trees crushed the\nroofs of at least five houses. The hail that accompanied the storm damaged\nall of the cars that were not under shelter, and my neighbor's home was\ncompletely demolished. And my own \"detached\" garage was certainly detached from its foundation. Clearly, yesterday's storm caused much\ndestruction.\nPassage 5\nSome folks think that pets are trustworthy and harmless creatures. However,\nit's surprising what little thieves these creatures can be. My daughter's ferret\nhas stolen my checkbook, my calculator, my wallet, and my change purse.\nMy officemate's dog stole a neighbor's T-bone steak right off the grill. My\nold dog Moonbear was known to steal freshly baked cherry pies and peanut\nbutter cookies, while the dog that lived below us stole his master's roast one\nday.\nPassage 6\nLara is quite different from her sister Lisa. Lara's hair is jet black and curly,\nwhile Lisa's is blond and straight. Lara stands 5 feet 10 inches in her\nstocking feet, while Lisa is a mere 5 feet 2 inches (in heels!). Furthermore,\nLara's complexion is olive, quite unlike Lisa's rosy hue.\nPassage 7\nMany people are not good listeners. They may not even realize that they lack\nthis skill. But almost anyone can become a better listener by being aware of\ncertain negative listening habits. One such habit is jumping to conclusions\nbefore hearing the entire message. Another bad habit is to nod off when\nsomeone is speaking in a monotone. Turning off to speakers who are not\nnecessarily experts is also a negative listening habit. Yet another bad habit to\navoid is the habit of reacting emotionally to certain words.\nMain Idea - Practice 2 Answer Key Thesis Statement Handout\nThesis Statement Handout\nhandout created by UNC Writing Center\nParagraphs Structuring your essay\nEssays in college may be very long or relatively short. Some will have five\nparagraphs, a structure you may have seen before. Others may have fewer\nparagraphs, and still others may have many more paragraphs.\nAll of your colllege essays, thoguh, will be divided into paragraphs: groups\nof related sentences that develop an idea that is in turn tied back to your main\ntopic. Each paragraph will be presented on your page separately; when you\nstart a new paragraph you will go to a new line, and usually, indent about\nhalf an inch. In some disciplines and some online work, you may skip a line\ninstead of indenting.\nRegardless of the number of paragraphs, all of your essays should have three\nkinds of paragraphs:\nAn introduction paragraph (or paragraphs in very long essays),\nBody paragraphs, and\nA conclusion paragraph\nAuthor: Jenny Crisp\nParagraph Handout\nhandout from OWL Writing Lab (Purdue University) Introduction\nIn an essay, you’ll first present a broad overview of your topic and the\nposition you take on that topic in an opening paragraph called the\nintroduction. Your thesis statement, usually the last sentence in the paragraph,\nwill state your position. Think of this as your “attitude” toward your topic.\nFor example, if you are writing an essay about apple farming for an\neconomics class, your topic will be apple farms. Your attitude could be\nmany things, depending on your assignment, but perhaps you’ve been asked\nto explain in which areas of the country apple farms are most successful.\nYour thesis statement could be, “Although apples can be grown in most of the\nUnited States, the most successful large-scale apple operations are in\nMichigan and Washington State.” In that case, your position, or attitude, is\nthat Michigan and Washington are where the most successful apple farms are\nlocated.\nAuthor: Jenny Crisp Transitions Body paragraphs\nOnce you have an introduction and a thesis, you will need to support that\nthesis with some examples or evidence. You will do that in the body\nparagraphs that follow the introduction. An essay may have two, three, four,\nor more body paragraphs, but the most common number is three.\nEach body paragraph will develop one point that supports your thesis, and\neach will contain several specific details, examples, or evidence of that\npoint. For example, in your apple essay, in one paragraph you could make the\npoint that the climates in Michigan and Washington State are perfect for\napples. Some of your details could be the average annual temperature in the\ntwo states. You could add that those average temperatures are 44 degrees\nFahrenheit for Michigan and 48 degrees Fahrenheit for Washington, perfect\nfor growing apples.\nYou would also want to add at least one or two more body paragraphs to\nyour essay, each with its own point to make in support of your thesis. In the\napple essay, perhaps one would be about low land taxes in the two states and\nthe other about the ease of getting apples to market there.\nAuthor: Jenny Crisp Conclusion\nThe final paragraph of your essay is the conclusion. In this paragraph, you’ll\nsum up your main points, and you may restate your thesis. However, you\nshould avoid using the exact same words you used earlier in the paper – you\nhave to reword, or find a different way to say, those points and that thesis.\nAfter summing up, you should consider what the broader implications of\nwhat you have written may be. Have you (or has your reader) learned\nanything from the essay? Clarified thoughts on a subject? Proven a point?\nDetermined what should be done about a problem? If so, you should indicate\nthis in a sentence or two – this is the real “conclusion” of your essay.\nAuthor: Jenny Crisp\nExamples\/Supporting Ideas Including Examples and Supporting Details in\nYour Paragraphs\nOne of the most important things you can do to bring your writing to life for\nyour readers is to make sure that you provide plenty of examples or\nsupporting details to explain the big ideas in each of your paragraphs. For\nexample, let's say you wanted to write a paragraph supporting that thesis\nstatement we discussed earlier about owning dogs. Remember, the thesis\nstatement read \"Everyone should own a dog because dogs provide\ncompanionship, provide protection, and provide great entertainment.\"\nLet's work on the first body paragraph, the one about companionship. You\nknow that you want to say that dogs are great companions. But what does that\nmean, exactly? You need to add details to make your point clear. So, take a\nminute and brainstorm some details or examples of ways in which dogs make\ngreat companions. Maybe your list would look like this:\nGreet you when you get home\nWag tails\nLie at your feet when you're sitting around the house\nGo for walks with you\nKeep you company when you're sick\nThat's a good list of some of the ways dogs provide companionship. Now,\nyour job is to pick two or, better, three of the best to write about in that\nparagraph. You want to explain a little bit about each of them.\nSay you think you can write something good about dogs greeting you when\nyou get home. You could add a couple of sub-details to that detail. You could\nsay that dogs wag their tails, jump up and down, and try to lick your hands or\nface when you get home. You could explain that no one other than a dog is\nthat excited to see you every single time you get back, even if you've only\nbeen gone for five minutes.\nPractice What could you add more detail about? Choose one of the other items from\nour list, and jot down a couple of things that you could say about that.\nAuthor: Jenny Crisp\nModes of Organization About the modes of organization\nThe first part of this book is about the stages of the writing process. Now it's\ntime to shift gears and start thinking about the kinds of assignments you're\nlikely to encounter in college. Each \"writing mode\" requires a different mode\nof thinking, and that's why teachers and professors often ask for different\nkinds of writing (they want you to think about a subject in a variety of ways).\nBut generally, assignments will require you to apply several modes,\nsimultaneously, to accomplish a well-rounded body of writing. Few\nprofessors beyond the first-year level of coursework require an assignment\nthat merely focuses on description or narration; other modes are required to\ngenerate a well-rounded piece of writing that entertains, informs, and\npersuades (i.e., narrative, explication, argument).\nMost of the time, you'll find yourself switching among all of these modes as\nyou write. You would have a hard time, for instance, reviewing a car without\nspending any time describing it, and the strength of an argument depends on\nhow well you've evaluated its evidence. What's important is that you\nrecognize the difference between them. Many students lose points each year\nwhen they offer their teacher a description instead of the evaluation or\nargument called for by the assignment. Below, we break down some common\nwriting modes, telling you their characteristics and what makes them unique,\nthen offer examples of informal and formal writing that show them in action.\nFrom Rhetoric and Composition\/Writing Applications\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Description Contents\n1 What is Description?\n2 Why Write a Descriptive Essay?\n3 Abstract Descriptions Versus Concrete Descriptions\n3.1 Abstract Descriptions\n3.2 Concrete Descriptions\n4 Similes and Metaphors\n5 How to Write Description\n5.1 Thesis\n6 Examples of Sensory Words\n6.1 Examples of Sound Imagery\n6.2 Examples of Smell Imagery\n6.3 Examples of Touch Imagery\n6.4 Example of Visual Imagery\n6.5 Examples of Taste Imagery\n7 Order of Presentation\n7.1 Audience\n7.2 Introduction\n7.3 Body\n7.4 Conclusion\n8 A Second Sample Descriptive Essay\n8.1 First Draft\n8.2 Second Draft\n9 External Links\nFrom Rhetoric and Composition\/Description\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Narration Contents\n1 What is Narration?\n2 What is Narrative?\n3 Elements\n4 Classical Arrangement\n5 Modern Practice\n6 Student Essay\n7 Revision Hints\n8 External Links\nRhetoric and Composition\/Narration\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Argumentation\nArgumentation does not mean getting into a fight! See below for an\nexplanation of argumentation (writing to persuade) in college:\n1 What is An Argument?\n2 Basic Argument Essay Structure\n2.1 Introduction\n3 Body\n3.1 Background Information\n3.2 Developing Your Argument\n3.2.1 Position Method\n3.2.2 Proposal Method\n3.3 Dealing With the Opposition\n4 Conclusion\n5 Strengthening Your Argument\n5.1 Phrasing\n5.2 Objective Language\n6 Sample Essay\n7 The Fallacies of Argument\n8A Side Note\n9 Further Reading\n10 External Links\nFrom Rhetoric and Composition\/Argument\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Exposition Contents\n1 What is Exposition Writing?\n1.1 Types of Exposition\n1.2 Where Do I Begin?\n1.2.1 Find a Topic and Research\n1.2.1.1 Thesis\n1.2.2 Create a Sketchy Outline\n1.2.3 Start Writing\n2 Structure\n2.1 Introduction\n2.2 Body\n2.3 Conclusion\n3 Sample Exposition Assignments\n4 Sample Exposition Essay\n4.1 Why Is This Good?\n5 External links\nFrom Rhetoric and Composition\/Exposition\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply.\nGrammar and Vocabulary Error Types and Grading Standards\nThe English Department of Dalton State College has developed a\nclassification of grammatical and mechanical errors according to the\nseriousness of each error: Type I errors are the most serious, Type II are of\nsecond rank, and Type III errors are the least serious.\nType I\nSentence fragments\nFused or run-on sentences\nSubject-Verb disagreement\nComma Splices\nType II\nPronoun case errors\nDisagreement of pronoun and antecedent\nVerb tense sequence errors\nShifts in mood, number, person, voice of verbs\nDangling or misplaced modifiers\nFaulty parallelism\nAmbiguous, broad, and\/or vague reference of\npronouns\nUse of second person in formal essay\nType III\nErrors in mechanics\nCapitalization\nItalics\nAbbreviations and numbers\nCommas\nSuperfluous commas\nSemicolon\nApostrophe Quotation marks\nPeriod, question mark, exclamation point,\ncolon, dash,\nparentheses, brackets\nErrors in spelling and hyphenation\nErrors in usage\nDiction\nExactness\nWordiness\nUnity and logical thinking\nSubordination\nSeparation of related sentence parts, split\ninfinitive\nSentence variety\nParagraphing\nPlanning and drafting\nRevising and editing Parts of Speech\nAdjectives & Adverbs Handout\nHandout from Utah Valley University Writing Center\nArticles\nHandout from the Utah Valley University Writing Center\nPractice with English Articles\nPreposition Practice\nSentence Formation (Type 1 Errors) About the Type 1 Errors\nWhole books have been written about English grammar, and a full discussion\nof grammar is beyond the scope of this book. But there are a few major\nerrors to watch out for, errors that indicate some difficulty in forming\nsentences. Here at Dalton State College, those are referred to as Type 1\nerrors, although other schools may have other names for them. This section is\na short introduction to those Type 1 errors; if you have questions, please visit\nthe Writing Lab in the Liberal Arts building (room 315).\nAuthor: Jenny Crisp\nType I\nSentence fragments\nFused or run-on sentences\nSubject-Verb disagreement\nComma Splices A Quick Guide to the Type 1 Errors\nFragments\nA fragment is a group of words that is trying to be a sentence, but that lacks a\nsubject, a verb, or a complete thought.\nBecause Johnny can’t read. (Incorrect. No complete thought –\n“Because” is the most common subordinating conjunction.)\nThe kids running through the field. (Incorrect. No verb – remember, -\ning verbs don’t count, and neither do infinitives like “to be” or “to\nrun”).\nAte ten Krystals all at once. (Incorrect. No subject – who ate those\nKrystals?)\nComma Splices\nThis is when there are two independent clauses (subject, verb, and complete\nthought) with only a comma between them.\nJohn ate ten Krystals, then he threw up. (Incorrect. Both have subject, verb,\nand complete thought, so you need at least a semicolon, not a comma,\nbetween them.)\nRun-on Sentences or Fused Sentences\nJust like a comma splice, except that there’s nothing at all in between the\nindependent clauses.\nDr. Jones must love grammar she writes run-on sentence examples at\nseven in the morning. (Incorrect. This is two clauses with subject,\nverb, and complete thought, just stuck together.) Subject-Verb Agreement Problems\nSubjects and verbs must agree in number. Verbs are “backwards”—that is,\nverbs have an ‘s’ on the end when they are singular (remember, nouns have\n‘s’ when they are plural).\nOne guy runs. (Correct)\nThree guys run. (Correct)\nThree guys runs. (Incorrect)\nThe trick with subject-verb agreement is to find the subject—what’s doing\nthe “verbing” in the sentence?\nOne guy, as well as his roommates, runs across the dorm parking lot.\n(Correct. The subject is “guy.” The stuff set off by commas and “as well\nas” doesn’t count.)\nOne guy and his roommates run across the parking lot. (Correct. With\n“and,” all of them are running, so all are the subject).\nThere are three apples. (“There” can be either singular or plural,\ndepending on what it is “pointing to.” In this case, that’s “three apples,”\na plural subject.)\nThere is one apple. (Correct. “There” can be either singular or plural,\ndepending on what it is “pointing to.” In this case, that’s “one apple,” a\nsingular subject.)\nWhere is my apple? (Correct. Like “there,” “where” can be either\nsingular or plural, depending on what it’s “pointing to.”)\nAuthor: Jenny Crisp Subjects, Verbs, and Independent Clauses - the\nkeys to the Type 1 errors\nSubject and Verb Handout\nThe print handout was revised and redesigned by Maggie Escalas for\nthe Write Place, St. Cloud State University, St. Cloud, Minnesota.\nIndependent Clauses Powerpoint\nQuiz on Identifying Independent Clauses Run-on or Fused Sentences Contents\n1 What is a run-on sentence?\n2 Examples of run-on sentences\n3 Fixing run-on sentences\n4 Examples of fixed run-on sentences\nFrom Rhetoric and Composition\/Run-on sentence\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Comma Splices Contents\n1 What is a comma splice?\n2 Examples of comma spliced sentences\n3 Fixing comma spliced sentences\n4 Examples of fixed comma spliced sentences\nFrom Rhetoric and Composition\/Comma Splice\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Fragments\nFragments\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike 2.0\nGeneric (CC BY-NC-SA 2.0) What is Subject-Verb Agreement\nSubjects and Verbs Should Agree in NUMBER\nSubject and Verb Agreement\nFinding Nouns, Verbs and Subjects Quiz\nSubject and Verb Agreement quiz\nMaking Subjects and Verbs Agree Subject-Verb Agreement\nDifferent Look at Subject-Verb Agreement\nSubject and Verb Handout\nThe print handout was revised and then redesigned for the Web by\nMaggie Escalas for the Write Place, St. Cloud State University, St.\nCloud, Minnesota.\nSubjects and Verbs Should Agree in NUMBER\nThere Is vs. There Are practice\nSubject-Verb Agreement powerpoint Lack of agreement between subject and verb\nbook chapter Contents\n1 Examples\n2 What is subject-verb agreement?\n3 Examples\n4 Other guidelines\nFrom Rhetoric and Composition\/Lack of agreement between subject\nand verb\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply.\nMechanics (Type 2 Errors) Type 2 Errors\nWhile the Type 2 errors don't have the \"do or die\" importance of the Type 1\nerrors, learning about them and avoiding them in your writing will make you\nsound more educated and will give what you have to say more weight. That\nmeans you'll be more convincing, and your readers will be more impressed\nwith you and with your message. Who doesn't want that?\nType II\nPronoun case errors\nDisagreement of pronoun and antecedent\nVerb tense sequence errors\nShifts in mood, number, person, voice of verbs\nDangling or misplaced modifiers\nFaulty parallelism\nAmbiguous, broad, and\/or vague reference of\npronouns\nUse of second person in formal essay Pronouns - case, agreement, etc.\nPronouns and Pronoun Agreement\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0)\nPronoun Agreement Avoiding Second Person Verbs, tense, and tense sequence\nVerbs and verb tense sequence\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Misplaced and Dangling Modifiers\nMisplaced and Dangling Modifiers\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Parallelism\nParallelism\nParallel Structures Quiz\nParallelism Group Work Quiz Parallelism Video\nProper Word Usage (Type 3 Errors) Type 3 Errors\nThe Type 3 grammatical errors are less serious than the Type 1 and Type 2\nerrors, but that doesn't mean they aren't important. Using your words and\npunctuation correctly means that your reader can focus on what you're trying\nto say instead of how you say it. This makes a good impression of you, and it\npresents your ideas in the best possible light.\nType III\nErrors in mechanics\nCapitalization\nItalics\nAbbreviations and numbers\nCommas\nSuperfluous commas\nSemicolon\nApostrophe\nQuotation marks\nPeriod, question mark, exclamation point,\ncolon, dash,\nparentheses, brackets\nErrors in spelling and hyphenation\nErrors in usage\nDiction\nExactness\nWordiness\nUnity and logical thinking\nSubordination\nSeparation of related sentence parts, split\ninfinitive\nSentence variety Paragraphing\nPlanning and drafting\nRevising and editing Commas\nCommas\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Which Word is Right?\nWorking with Words: Which Word Is Right?\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Working with sentences\nRefining Your Writing\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Punctuation\nPunctuation overview\n1 What Is Punctuation For?\n2 Is It Worth the Work?\n3 What's With All the Jargon?\n3.1 OK, which terms do I need to know?\n3.1.1 Independent clause\n3.1.2 Dependent clause\n3.1.3 Coordinating conjunctions\n3.1.4 Conjunctive adverbs\n3.2 Uses of \"That\" https:\/\/en.wikibooks.org\/wiki\/Rhetoric_and_Composition\/Punctuation\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Colons\nColons\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Punctuation practice and review\nHow to Use a Semicolon\nComma Review\nApostrophe Game\nProper Punctuation Spelling\nSpelling\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Split infinitives First Person\nVocabulary, Context Clues, and Acquiring a Word Vocabulary\nVocabulary\nOne of the most important parts of reading and writing is vocabulary. You\nmay not realize it, but the more words you know, the better your speaking and\nwriting skills will be. College freshmen typically know around 20,000\nwords (need citation). Your goal is to increase this number of words so that\nboth your speaking and reading vocabulary will grow, but what happens\nwhen you come across a word you don’t know?\nContext Clues\nMany times students struggle when they come across a word they have never\nseen. For a long time, students were told to “look it up” when they\nencountered a word they did not know. That is fine if you have access to a\ndictionary, but what if you don’t? What if you are taking a test and don’t\nrecognize the word in a passage?\nContext clues will help you. They are words that appear before, after, or\nclose to a word whose meaning you might not know. All you do is keep\nreading and see if there is a clue to the unknown word’s meaning either\nbefore, after, or close to the unknown word. Here is an example:\nThe gregarious student spent too much time socializing and not enough time\nstudying.\nLet’s say you don’t know the meaning of gregarious. Take a closer look at the\nsentence. What does the gregarious student do? He (or she) likes to socialize\nand talk to others. This type of student is definitely social, so another way to\ndescribe this student is outgoing; therefore, a gregarious student would be\nsomeone who is outgoing and who likes the company of others.\nContext clues typically fall into four categories: synonym, antonym, example,\nand general sense of the sentence. A synonym context clue means that there is a word in the sentence that\ncontains the same meaning as the word you may not know. Take a look at this\nsentence.\nThe math test was arduous; students spent the entire class working on the\ndifficult exam, and many needed extra time just to complete it.\nLooking at the sentence, you’ll notice there is a word that seems to describe\narduous. What word is it?\nIf you said difficult, then you are right. Think about it. If a test requires the\nentire class period and students still need extra time, then that is one difficult\ntest!\nAn antonym context clue means the opposite of what another word means.\nHere is an example:\nThe class completed the easy grammar test in thirty minutes, but the arduous\nmath test took the entire class period.\nHere’s our word arduous again. What word in the sentence means the exact\nopposite? If you said “easy,” then you would be right, but how do you know\nif the context clue is a synonym or an antonym? Look at the wording in the\nsentence. It contains the word but. This word, like however and yet, shows a\ncontrast, something that is the opposite in meaning. When you see these\nwords used in a sentence, what comes after them will not be the same in\nmeaning as what has come before.\nProbably one of the easiest types of context clues is the example. Sentences\nwith these types of context clues give illustrations of the difficult word. Take\na look at this sentence:\nOur pond is home to amphibious creatures such as frogs and turtles, who\nenjoy swimming in the clear water and then sunning themselves on the rocks.\nIf you don’t know the definition of amphibious, then you might consider what\nfrogs and turtles have in common: they swim in the water and then spend\ntime on the rocks. Therefore, they live on the water and on the land, so amphibious creatures are at home both in water and on land. Sentences with\nexample context clues contain words that let you know an illustration or\nexample is coming: such as and to illustrate are two common wording\npatterns that are used. When you see these, you know an example or\nillustration is in the sentence.\nUsing your general sense of the sentence is also a great help when decoding\nwords. You can look at what the sentence is saying and figure out the\nmeaning of an unknown word. Take a look at the sentence below.\nThe student received an expeditious answer to her email because her\ninstructor was online and answering student questions.\nYou would probably assume that since the instructor was online and\nanswering questions that the answer to the email came quickly. If so, you\nwould be correct.\nLearning to use context clues takes time. It isn’t a skill you will acquire\novernight; however, always stop and think when you come across a word\nyou don’t know. Reread the sentence, and then go back and read a few\nsentence that lead up to the sentence you are studying. If you don’t see a clue,\nkeep reading because the context clue may be after the sentence. Just don’t\ngive up. Study the sentence and the sentences around it until you find a clue\nthat might help you decode the word you don’t understand.\nAuthor: Dr. Lydia Postell\nPractice Games Verb Games\nGrammar Bytes (Subject-Verb Agreement)\nGrammar Gorilla\nFrog Verbs\nTo Bee or not To Bee\nTreasure Hunt\nVerb Power\nEnglish Monstruo\nEnglish Monstruo is a free app (iPad and Android versions available)\ncontaining eight games designed to help students learn verb conjugation. Type 1 Errors\nFragment Game\nRead through passages and use mouse to select part that is a fragment.\nGiraffe Kart Subject-Verb Agreement Race\nGiraffe Karts is a multiplayer language arts game that allows students\nfrom anywhere in the world to race against each other while practicing\nsubject verb agreement!\nSentence or Fragment\nChoose from multiple games to determine whether grouping of words is\na sentence or fragment. To play games disable or bypass popup blocker\nsoftware.\nSubject-Verb Agreement\nChoose the correct present tense verb for each sentence.\nVerb Subject Treasure Hunt\nBBC Skillwise game. Punctuation\nBeat the Clock Apostrophe Game\nPossessive Apostrophe Game\nSemicolon Wars\nStyle, Tone, and Inference Style and tone\nThe information on this side of the page will help in your writing - but it's the\nsame kinds of ideas as in reading!\nRefining Your Writing - A Chapter on Style and Tone\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Active-Passive Voice\nActive-Passive Voice handout\nGreat handout from Utah Valley University's Writing Center.\n1 Voice in English Writing\n2 Active and Passive Voice Sentences\n3 Use of the Passive Voice\n4 The Structural Difference\nFrom Rhetoric and Composition\/Active and Passive Voice\nText is available under the Creative Commons Attribution-ShareAlike\nLicense.; additional terms may apply. Inference\nThe information on this side of the page will help in your reading - but it's\nthe same kinds of ideas as in writing! Inference\nInference is sometimes a difficult concept. It means to make “an educated\nguess” or “reading between the lines” or “drawing a conclusion”. These\nphrases are used because the information you are seeking is not stated.\nWhen you were in the fourth or fifth grade, you probably answered such\nquestions as “What countries border Iraq?” or “What is the capital of\nVermont?” Those questions had answers that were stated in the text you had\njust read. Inference, however, requires you to find answers by drawing a\nconclusion from the material you have read. There are clues in the material\nto aid you in finding the answer, but the answer is not directly stated, as it is\nin a literal question. An inferential question in a reading class might be\n“What would be a good title for the passage you just read? Here are some\nhints for how you might answer that question.\n1. What is the topic of the passage? Remember, ask yourself who or what\nthe passage is about. You may also look for words that are used more\nthan once and\/or words that describe the same idea, person, or thing.\n2. What is the author saying about the topic? When you can answer what\nthe author is saying about the topic, you will have the implied main\nidea, which should permit you to answer a variety of inference\nquestions because you will know the author’s position on his\/her topic.\nUse these strategies when you are confronted with questions whose answers\nare not stated in the text. The questions may be more difficult to answer, but\nyou can answer them with a little extra thought.\nJust be aware that although most college textbooks use inference to\ncommunicate the main idea in the majority of paragraphs, you do not need to\nuse inference to communicate you main idea in English 0098!\nAuthor: Dr. Lydia Postell\nWriting in Class Writing in class\nIf you’re writing in class, on a time limit, the first thing you should do is\ndecide how much time you should spend on each step in the writing process.\nIf you have an hour, consider spending your time this way:\n5-10 minutes planning,\n30-40 minutes composing, and\n10-25 minutes revising, editing, and proofreading.\nIf you’re allowed to write your essay on loose-leaf paper, try putting each\nparagraph on a separate page. This gives you the option of rearranging the\norder of your paragraphs if you need to. If you must write in a theme book\nand you don’t want to write your introduction first, leave space for it at the\nbeginning.\nIf you can, skip lines as you write. This will allow you to make neat\ncorrections on your first draft. Some students prefer to write out a rough draft\nand then copy it over, and this can work very well. Since you have limited\ntime, however, it’s best to give yourself a “backup plan” in case you run out\nof time, and skipping lines can help with this.\nAuthor: Jenny Crisp Prewriting Preparing for an Essay Exam (part 1) Preparing for an Essay Exam (part 2)\nEnglish Language Learners Overview chapter\nHelp for English Language Learners\nExplanation from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Games\nEnglish Monstruo\nEnglish Monstruo is a free app (iPad and Android versions available)\ncontaining eight games designed to help students practice. It focuses on\nseveral common mistakes.\nVocabulary Games Online\nEnglish vocabulary games for kids and ESL students: Hangman,\nMemory matching games, Drag & Drop games, Hidden object games\nand more. Articles and prepositions\nArticles\nHandout from the Utah Valley University Writing Center\nPreposition Practice\nPractice with English Articles Websites\nCommon Errors in English Usage\nPurdue Writing Lab (ESL)\nUsing English: A handy reference guide to major parts of speech and their\nusage, with bonus material for ESL instructors.\nBBC Learning English: This resource from the British channel offers all\nkinds of lessons and tips for learning English, including pronunciation,\nvocab, and grammar lessons.\n20-Minute ESL Lessons: These audio lessons cover basic vocabulary for a\nvariety of everyday situations, including office life.\nESL Resource Center: This site was created for ESL teachers, so plenty of\nworksheets, tips, and lessons are available and work well even for those\nteaching themselves or trying to get ahead.\nBusiness English Lessons: There are dozens of key phrases on this site\ncomplete with audio clips to help ESL students practice clear pronunciation. Handouts\nArticles\nHandout from the Utah Valley University Writing Center\nPractice Exercises Practice makes perfect!\nThe practice exercises on the following pages will help you polish your\nskills.\nComma Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Comma Rules - Practice 1\nComma Rules Practice 1\n1. Use a comma before a coordinate conjunction (and, but, or, nor, so, for,\nyet) in a compound sentence.\nI am not complaining, but I am stating my opinion.\n2. Commas are usually used after introductory words, phrases, and\nclauses.\nWhen you leave today, remember your umbrella.\nFrom the roof, I could see for miles.\nFurthermore, I would like you to mow the lawn.\nYes, Santa Claus, there is no Virginia.\n3. Use commas to set off items in a series of three or more.\nOf the letters X, Y, and Z, I prefer Z.\nInsert commas as needed in the following sentences. Not all sentences\nneed commas.\n1. Laura was tired exhausted and frustrated after such a busy day.\n2. In addition she was running a temperature of 102.\n3. When I was younger I was afraid of the lawnmower man.\n4. My son was afraid of spiders when he was younger.\n5. Sandra worked during the day and she attended Dalton State on Monday\nnights.\n6. Laura worked nights and attended Dalton State during the day.\n7. I admire your problem but I don't have any solutions to offer you.\n8. If you don't mind it is my turn to have a crisis.\n9. Tom Lizzy and Geoffrey drove to Playalinda and surfed all afternoon.\n10. In need of water the desperate travelers searched for an oasis.\n11. I was going to do the dishes but I was distracted.\n12. During the bomb scare teachers held classes outside on the lawn. 13. Since it was snowing we did not enjoy having class outside.\n14. After sitting in the snow for 10 minutes I began to freeze.\n15. For example I enjoy reading walking and singing.\nComma Rules - Practice 1 Answer Key Comma Rules - Practice 3\nComma Rules Practice 3\n1. Use a comma before a coordinate conjunction (and, but, or, nor, so, for,\nyet) in a compound sentence.\nI am not complaining, but I am stating my rather unhappy opinion.\n2. Commas are usually used after introductory words, phrases, and\nclauses.\nWhen you leave today, remember your umbrella.\nFrom the roof, I could see for miles.\nFurthermore, I would like you to mow the lawn.\nYes, Santa Claus, there is no Virginia.\n3. Use commas to set off items in a series of three or more.\nOf the letters X, Y, and Z, I prefer Z.\n4. Use commas to set off coordinate adjectives not joined by and.\nThe tired, ambitious clerk usually worked through lunch and stayed late.\n5. Use commas around words, phrases, and clauses that interrupt the flow\nof a sentence (and are not essential to the meaning).\nI never was, by the way, a hippie.\nShe was, however, too tired to continue studying.\nMy sister, who lives in Tallahassee, is a talented artist.\nInsert commas as needed in the following sentences. Not all sentences\nneed commas. Write the rule number that justifies your use of the\ncomma.\n1. When I was in college I used to wear garlands of clover in my hair. 2. Some of these garlands would have extensions of flowers that hung to\nthe ground.\n3. My professors pretended not to notice but I suspected that they did.\n4. I was however an A student and I believed my As justified my flowery\nwhimsical appearance.\n5. My reasoning wild as it may seem convinced my parents that they need\nnot worry about me.\n6. I eventually quit wearing garlands of flowers married a manipulative\nself-centered musician and had a son.\n7. Though my son did not wear flowers in his hair he did experiment with\nhis hair color his hairstyles and his clothing.\n8. One afternoon before my night class he asked me to help him dye his\nblonde hair black.\n9. He assured me that we would be using nonpermanent hair coloring so I\nhelped him.\n10. As you might have guessed the color of course was permanent and I\nended up going to class that night with black hands and black fingernails\nComma Rules - Practice 3 Answer Key Comma Rules - Practice 2\nComma Rules Practice 2\n1. Use a comma before a coordinate conjunction (and, but, or, nor, so, for,\nyet) in a compound sentence.\nI am not complaining, but I am stating my rather unhappy opinion.\n2. Commas are usually used after introductory words, phrases, and\nclauses.\nWhen you leave today, remember your umbrella.\nFrom the roof, I could see for miles.\nFurthermore, I would like you to mow the lawn.\nYes, Santa Claus, there is no Virginia.\n3. Use commas to set off items in a series of three or more.\nOf the letters X, Y, and Z, I prefer Z.\n4. Use commas to set off coordinate adjectives not joined by and.\nThe tired, ambitious clerk usually worked through lunch and stayed late.\nInsert commas as needed in the following sentences. Not all sentences\nneed commas.\n1. In the mid-1970s I had a diabolical intelligent dog named Moonbear.\n2. Moonbear was a smart quick and hungry dog.\n3. He was also a very useful dog for he had the ability to scare off would-\nbe intruders.\n4. Of all his amazing tricks the one that amazed me the most was his\nspeed.\n5. When he was hungry he could move at incredible unimaginable speeds.\n6. For example I once removed a freshly baked cherry pie from the oven\nand I put it on the center of the dining room table to cool. 7. Before I knew what was happening Moonbear jumped onto the table\nand began eating the hot cherry pie.\n8. He had eaten half of the pie before I was able to stop him.\n9. After the cherry pie incident I was more careful where I put baked\ngoods to cool.\n10. However even the top of the refrigerator was not safe from Moonbear.\nComma Rules - Practice 2 Answer Key Comma Rules - Practice 4\nComma Rules Practice 4\n1. Use a comma before a coordinate conjunction (and, but, or, nor, so, for,\nyet) in a compound sentence.\nI am not complaining, but I am stating my rather unhappy opinion.\n2. Commas are usually used after introductory words, phrases, and\nclauses.\nWhen you leave today, remember your umbrella.\nFrom the roof, I could see for miles.\nFurthermore, I would like you to mow the lawn.\nYes, Santa Claus, there is no Virginia.\n3. Use commas to set off items in a series of three or more.\nOf the letters X, Y, and Z, I prefer Z.\n4. Use commas to set off coordinate adjectives not joined by and.\nThe tired, ambitious clerk usually worked through lunch and stayed late.\n5. Use commas around words, phrases, and clauses that interrupt the flow\nof a sentence (and are not essential to the meaning).\nI never was, by the way, a hippie.\nShe was, however, too tired to continue studying.\n6. Use commas to set off contrasted elements, geographical names, and\nmost items in dates.\nCats, but not dogs, own themselves.\nMaria was born in Rockledge, Florida, on August 16, 2002, at 10:20 p.m. Insert commas as needed in the following sentences. Not all sentences\nneed commas. Write the rule number that justifies your use of the\ncomma.\n1. My family lived in Florence Italy during my high school years.\n2. After hearing her excuse I still did not believe her.\n3. That's a bathing suit top not a piece of string.\n4. Amelia wore sensible durable clothing.\n5. Chris ran out the door jumped over the fence and raced down the road.\n6. The movie was boring meaningless and confusing.\n7. Maria opened her math book and then began doing problems 1 through\n10.\n8. When you write an essay state your thesis clearly.\n9. I will walk on the treadmill or I will walk in the park.\n10. Laura lived in Island Grove Florida before moving to Dalton Georgia.\n11. The explanation such as it was could not be believed by any rational\nperson.\n12. I removed the blackberry pie from the oven and put it on the window\nsill to cool.\n13. Although there are many different comma rules they can be learned.\n14. I will explain them to you if you wish.\n15. If you will stop nagging I will empty the trash wash the dishes and do\nthe laundry.\nComma Rules - Practice 4 Answer Key\nComma Splice Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Comma Splice Practice 1\nComma Splice: Practice 1\nCommas splice (CS): A comma splice occurs when two independent\nclauses are joined by only a comma.\nComma splice: IC, IC.\nExample: We hiked in the Blue Ridge Mountains for three weeks, we were\nvery tired.\nSome Easy Ways to Correct Comma Splices\n1. Change the comma to a period and capitalize the next word. (IC. IC.)\nCorrect: We hiked in the Blue Ridge Mountains for three weeks. We\nwere very tired.\n2. Change the comma to a semicolon. (IC; IC.)\nCorrect: We hiked in the Blue Ridge Mountains for three weeks; we\nwere very tired.\n3. Add a coordinating conjunction before the second independent clause.\nCoordinating conjunctions: and, or, but, nor, for, so, yet. (IC, CC IC)\nCorrect: We hiked in the Blue Ridge Mountains for three weeks, so\nwe were very tired.\nCaution: Don't simply delete the comma; this will create a run-on or\nfused sentence.\nDirections: For each sentence below, write CS if the sentence is a\ncomma splice or C if the sentence is correct.\n____ 1. My apartment is too small, I have no room for my treadmill and\nexercise bike. ____ 2. I'm exhausted, however, I will go to school anyway.\n____ 3. Tom opened his freezer, then he noticed that two cans of beer had\nexploded.\n____ 4. Although I understand the definition, comma splices still confuse me.\n____ 5. A comma splice occurs when two complete sentences are joined\nonly by a comma, I need to remember that rule.\n____ 6. It's means \"it is\" or \"it has,\" its' is always incorrect.\n____ 7. I hiked for five hours yesterday, consequently I am too tired to go\nhiking again today.\n____ 8. For example, I like to read suspense novels, email my friends, and\nplay cards with my daughter.\n____ 9. My son Geoffrey plays drums in band called Talent Scam, and he\nlikes to surf at Playalinda Beach.\n____10. Some people value money and material possessions, others value\nlove and family.\nAnswer Key - Comma Splice Practice 1 Comma Splice Practice 2\nComma Splice: Practice 2\nCommas splice (CS): A comma splice occurs when two independent\nclauses are joined by only a comma.\nComma splice: IC, IC.\nExample: We hiked for three weeks, we were very tired.\nSome Easy Ways to Correct Comma Splices\n1. Change the comma to a period and capitalize the next word. (IC. IC.)\nCorrect: We hiked for three weeks. We were very tired.\n2. Change the comma to a semicolon. (IC; IC.)\nCorrect: We hiked for three weeks; we were very tired.\n3. Add a coordinating conjunction before the second independent clause.\nCoordinating conjunctions: and, or, but, nor, for, so, yet. (IC, CC IC)\nCorrect: We hiked for three weeks, so we were very tired\nCaution: Don't simply delete the comma; this will create a run-on or\nfused sentence.\nDirections: For each sentence below, write CS if the sentence is a comma\nsplice or C if the sentence is correct.\n____ 1. Don't go in there, you will be horrified.\n____ 2. She was, however, tired and worn out.\n____ 3. First, I must go shopping, then I have to decide what to fix for dinner. ____ 4. Maria is running a temperature of 102, therefore, she should not go\nto school today.\n____ 5. Although she had a fever, Maria still wanted to go to school.\n____ 6. Mary Grace Thompson lives with her divorced father, for her mother\nran away with the local tax collector.\n____ 7. Every day Frank brings calm to other people's catastrophes,\nhowever, now catastrophe has struck his life.\n____ 8. I was sick last week, consequently I've fallen behind in my work.\n____ 9. Not only had her goals changed, she spent less time with her friends.\n____10. She knew that at home her endless horse talk was boring, yet she\nwouldn't stop long enough for her father to ask about her symptoms.\nAnswer Key - Comma Splice Practice 2 Comma Splice Practice 3\nComma Splice: Practice 3\nCommas splice (CS): A comma splice occurs when two independent\nclauses are joined by only a comma.\nComma splice: IC, IC.\nExample: We hiked for three weeks, we were very tired.\nSome Easy Ways to Correct Comma Splices\n1. Change the comma to a period and capitalize the next word. (IC. IC.)\nCorrect: We hiked for three weeks. We were very tired.\n2. Change the comma to a semicolon. (IC; IC.)\nCorrect: We hiked for three weeks; we were very tired.\n3. Add a coordinating conjunction before the second independent clause.\nCoordinating conjunctions: and, or, but, nor, for, so, yet. (IC, CC IC)\nCorrect: We hiked for three weeks, so we were very tired\nCaution: Don't simply delete the comma; this will create a run-on or\nfused sentence.\nDirections: For each sentence below, write CS if the sentence is a\ncomma splice or C if the sentence is correct. Correct any comma splices\nusing one of the methods described above.\n1. Every year I make New Year's resolutions, for example, I will try to drink\nmore water.\n2. Every year, however, I seem to fail at my resolutions. 3. I did not want to fail this year, consequently, I changed my resolution.\n4. I finally understood that goals needed to be specific, so I modified my\ngoal.\n5. This year I will drink four glasses of water every day, this goal is specific\nand measurable.\n6. While this is a measurable goal, however, four glasses of water a day is\nnot sufficient.\n7. I don't care, at least this year I will be successful.\n8. Today I found out my bad cholesterol is a little high, therefore, I will\nreduce my fat intake.\n9. I was reading the dictionary today, and I read that a \"chrisom child\" is a\nchild who dies in its first month, this struck me a very sad.\n10. Perhaps I should stop reading the dictionary, on the other hand, it is\nuseful for correcting my spelling.\nAnswer Key - Comma Splice Practice 3 Comma Splice Practice 4\nComma Splice: Practice 4\nCommas splice (CS): A comma splice occurs when two independent\nclauses are joined by only a comma.\nComma splice: IC, IC.\nExample: We hiked for three weeks, we were very tired.\nSome Easy Ways to Correct Comma Splices\n1. Change the comma to a period and capitalize the next word. (IC. IC.)\nCorrect: We hiked for three weeks. We were very tired.\n2. Change the comma to a semicolon. (IC; IC.)\nCorrect: We hiked for three weeks; we were very tired.\n3. Add a coordinating conjunction before the second independent clause.\nCoordinating conjunctions: and, or, but, nor, for, so, yet. (IC, CC IC)\nCorrect: We hiked for three weeks, so we were very tired.\nCaution: Don't simply delete the comma; this will create a run-on or\nfused sentence.\nDirections: For each sentence below, write CS if the sentence is a\ncomma splice or C if the sentence is correct. Correct any comma splices\nusing one of the methods described above.\n1. My son was a very healthy child, however, my daughter is often sick.\n2. My daughter, however, has never broken a bone. 3. Geoffrey broke his wrist by falling from a seesaw, he broke his arm by\nfalling from a ladder.\n4. The seesaw accident was not his fault, however, he should not have been\non the ladder.\n5. He was supposed to be watching his little sister, instead he was hanging\nlights for an end-of-year party.\n6. I let him invite his friends to the party, I did not know he had 200 friends.\n7. The party was a nightmare for me, furthermore, it bothered the neighbors.\n8. There were teenagers everywhere, for example, they filled the kitchen, the\nliving room, the deck, and even the loft in the garage.\n9. At 10:00 p.m. I asked these teens to go home, by midnight there were only\n12 \"friends\" left.\n10. All twelve asked to spend the night, and five of the 12 were girls.\nAnswer Key - Comma Splice Practice 4 Comma Splice Practice 5\nComma Splice Practice 5\nIdentify and correct any comma splices in the following email entitled\n\"Rules of Chocolate.\"\nChocolate is a vegetable. How so? Chocolate is derived from cacao beans,\nbeans are vegetables. In addition, sugar is derived from either sugar CANE\nor sugar Beets, both are plants, which places them in the vegetable category.\nThus, chocolate is a vegetable, you should have at least five servings of\nvegetables a day.\nTo go one step further, chocolate bars also contain milk. Milk is a healthy\ndairy product, therefore, chocolate bars are a health food.\nChocolate covered raisins, cherries, orange slices, and strawberries all\ncount as fruit, consequently, you can eat as many as you want.\nIf you've got melted chocolate all over your hands, you're eating it too\nslowly.\nConsider this problem. How do you get 2 pounds of chocolate home from\nthe store in a hot car? The solution is easy, eat it in the parking lot.\nIf you are trying to lose weight, here is a delicious diet tip. Eat a chocolate\nbar before each meal, it will take the edge off of your appetite, and you will\neat less. If calories are an issue for you, store your chocolate on top of the\nrefrigerator. Calories are known to be afraid of heights, they will jump out\nof the chocolate to protect themselves.\nIf I eat equal amounts of dark chocolate and white chocolate, is that a\nbalanced diet? Don't they actually counteract each other?\nAre you having trouble accomplishing your daily goals? Here's a suggestion\nfor you, put \"eat chocolate\" at the top of your list of things to do today. That\nway you will get at least one thing done! Answer Key - Comma Splice 5\nFact & Opinion Practice 1\nDetermine whether the following sentences are facts, opinions, or a\nmixture of fact and opinions. Then, check your answers against the key.\n1. Marijuana should be legalized to reduce the effects of the current\neconomic crisis.\n2. The death penalty should be abolished because it's just too expensive.\n3. A California lawmaker Monday introduced legislation that would legalize\n(and tax) pot there.\n4. Last year, in an effort to cut costs, probation and parole agencies in\nArizona, Kentucky, Mississippi, New Jersey, and Vermont sadly reduced or\ndropped prison time for thousands of offenders who foolishly violated\nconditions of their release.\n5. President Barack Obama said Tuesday night that the country must now act\n\"boldly and wisely\" to take charge of its future.\n6. Everyone is entitled to his or her own opinion.\n7. All opinions are equally relevant.\n8. Bruce Springsteen wrote \"Thunder Road,\" a classic song of escape.\n9. My car, which has only 10,000 miles on the odometer, will last another six\nyears.\n10. A city in beautiful north Florida, Tallahassee is the state's capital.\nFact & Opinion - Practice 1 Answer Key Practice 2\nDetermine whether the following sentences are facts, opinions, or a\nmixture of fact and opinions. Then, check your answers against the key.\n1. America's tax laws are very confusing.\na. Fact b. Opinion c. Mixed Fact and Opinion\n2. Using the IRS e-file makes doing your taxes easier and faster.\na. Fact b. Opinion c. Mixed Fact and Opinion\n3. When you itemize deductions on your tax return, you cannot deduct both\nstate income\ntaxes and general state sales taxes.\na. Fact b. Opinion c. Mixed Fact and Opinion\n4. In 2008, more than 92 million Americans filed their taxes electronically.\na. Fact b. Opinion c. Mixed Fact and Opinion\n5. It's unfair that the IRS limits educator expense deductions to those who\nteach in kindergarten through grade 12.\na. Fact b. Opinion c. Mixed Fact and Opinion\n6. It's not safe to file your tax return electronically.\na. Fact b. Opinion c. Mixed Fact and Opinion\n7. It makes no sense to allow only students in Midwestern disaster areas to\ndeduct the cost of their textbooks when they file their income tax.\na. Fact b. Opinion c. Mixed Fact and Opinion 8. According the U.S. tax laws, course-related books and supplies are not\nqualified Educational expenses except for students who live in Midwestern\ndisaster areas.\na. Fact b. Opinion c. Mixed Fact and Opinion\n9. The maximum Hope education credit has rightly been increased to $2,500\nfor most taxpayers.\na. Fact b. Opinion c. Mixed Fact and Opinion\n10. We should not have to pay taxes.\na. Fact b. Opinion c. Mixed Fact and Opinion\nFact & Opinion - Practice 2 Answer Key\nFragment Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Fragments- Practice 1\nFragment Practice 1\nIdentify any fragments in the following \"sentences.\" Keep in mind that a\nsentence must have a subject, have a verb, and express a complete\nthought.\nRemember that the \"ing\" form of a verb is not a true verb unless it is\npreceded by a helping verb.\nRemember that the \"to\" form of the verb (the infinitive) is not a verb.\n1. Martha Stewart not dining with us this Thanksgiving.\n2. I'm telling you in advance.\n3. So don't act surprised.\n4. Since Ms. Stewart won't be coming.\n5. I've made a few small changes.\n6. Our sidewalk will not be lined with homemade paper bag luminaries.\n7. After a trial run.\n8. It was decided that, no matter how cleverly done, rows of flaming lunch\nsacks do not have the desired welcoming effect.\n9. Once inside, our guests noting that the entry is not decorated with the\nswags of Indian corn and fall foliage that I had planned to make.\n10. Instead, I've gotten the kids involved in the decorating by having them\ntrack in colorful autumn leaves from the front yard.\n11. The mud was their idea. 12. The dining table not covered with expensive linens, fancy china, or\ncrystal goblets.\n13. However, since this is Thanksgiving.\n14. We will refrain from using the plastic Peter Rabit plate and the Santa\nnapkins from last Christmas.\nFragment - Practice 1 Answer Key Fragment - Practice 2\nFragment Practice 2\nIdentify any fragments in the following \"sentences.\" Keep in mind that a\nsentence must have a subject, have a verb, and express a complete thought.\nRemember that the \"ing\" form of a verb is not a true verb unless it is\npreceded by a helping verb.\nRemember that the \"to\" form of the verb (the infinitive) is not a verb.\nThe following selection was adapted from Terry Kay's To Dance with the\nWhite Dog.\n1. On the day after his father was buried.\n2. James drove to the cementery in the pink-blue glaze of dawn.\n3. The plot was still crowded with wreaths of flowers.\n4. Flowers with bright, colorful faces and ribbon sashes.\n5. And the white, mica-sand covering of the ground was pockmarked where\npeople had stood for the gravesite services.\n6. And where chairs had been placed for the family.\n7. James stood at the foot of the graves of his parents and his brother.\n8. A brother he had not known.\n9. A brother dead before his own birth.\n10. And stared at the shadowed sand mounds.\n11. Nothing was as permanent. 12. He turned and looked across the cementery.\n13. His father had said the white dog would be there.\n14. To look for the white dog at sunrise.\n15. His father had said the white dog was his mother.\n16. His father was wrong; there was no white dog at the cemetery.\n17. Suddenly, a chill struck his neck and raced across his shoulders.\n18. He could feel his heart racing.\n19. His eyes scanning the cemetery.\n20. James walked into the plot, between the grave mounds of his mother and\nfather, and he knelt.\n21. Then he saw them.\n22. Across the chest of sand on the grave of Robert Samuel Peek.\n23. He saw the paw prints.\n24. Prints so light that they could have been made by air.\nFragment - Practice 2 Answer Key Fragment - Practice 3\nFragment Practice 3\nIdentify any fragments in the following \"sentences.\" Keep in mind that a\nsentence must have a subject, have a verb, and express a complete thought.\nRemember that the \"ing\" form of a verb is not a true verb unless it is\npreceded by a helping verb.\nRemember that the \"to\" form of the verb (the infinitive) is not a verb.\n1. If you understand what a fragment is.\n2. Understanding, however, does not always come easily.\n3. Taking the time to practice.\n4. Studying long hours and seeking feedback from instructors and tutors.\n5. To understand fragments is my goal.\n6. Wanting to understand, but not able.\n7. Since this sentence begins with a subordinate conjunction.\n8. It might be a fragment.\n9. For example, blueberry muffins with plenty of hot butter.\n10. Driving down the road late one Sunday afternoon.\n11. Seeing the Northern Lights for the first time in my life.\n12. Second, the folks that drive while asleep.\n13. Third, the blind-blinkers. 14. Finally, the folks that never use their turn signals.\n15. All of these drivers annoy me.\nFragment - Practice 3 Answer Key Fragment - Practice 4\nFragment Practice 5\nIdentify any fragments in the following \"sentences.\" Keep in mind that a\nsentence must have a subject, have a verb, and express a complete\nthought.\nRemember that the \"ing\" form of a verb is not a true verb unless it is\npreceded by a helping verb.\nRemember that the \"to\" form of the verb (the infinitive) is not a verb.\n1. February, a great day in the history of Dalton State College.\n2. The announcement of the return of intercollegiate athletics.\n3. Because our students say athletics is important.\n4. Voting for an athletics fee to improve campus life for future students.\n5. Wanting to participate in the full college experience.\n6. Derek Waugh will be the college's new athletics director.\n7. Launching men's and women's teams at the same time.\n8. Although I enjoy college sports.\n9. Dalton State's mission is to provide broad access to quality higher\neducation for the population of Northwest Georgia.\n10. Dalton State's QEP title is \"Getting on the 'Write Path.'\"\nFragment - Practice 4 Answer Key\nFused Sentence Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Fuses Sentence Practice 1\nFused or Run-on Sentences: Practice 1\nA fused sentence (or run-on) occurs when two independent clauses are\njoined without punctuation or without a coordinating conjunction.\nFused sentence: Independent clause independent clause.\nAt first I wanted to be a doctor now I don't.\nSome easy ways to correct a fused sentence are as follows:\n1. Add a period after the first independent clause and capitalize the next\nword. (IC. IC)\nAt first I wanted to be a doctor. Now I don't.\n2. Add a semicolon after the first independent clause. (IC; IC)\nAt first I wanted to be a doctor; now I don't.\n3. Add a comma and a coordinating conjunction after the first independent\nclause. (IC, CC IC)\nAt first I wanted to be a doctor, but now I don't.\nDirections: For each sentence below, write FS if it is a fused sentence or\nC if it is correct.\n____ 1. Many young athletes want to play for professional leagues few\nactually succeed.\n____ 2. I lost my train of thought did you find it?\n____ 3. Laura was exhausted from hours of study however she made it to\nclass on time. ____ 4. Dolphins have killed sharks they never attack humans.\n____ 5. The shrimp was served with its head still on as a result, Mary lost\nher appetite.\n____ 6. Mary's sister, however, ate the shrimp anyway.\n____ 7. In later years, Mary developed a shrimp allergy, but her sister still\nenjoys shrimp.\n____ 8. The roads were covered with ice therefore school was cancelled.\n____ 9. The typewriter hummed loudly; consequently, I turned it off.\n____10. If you understand what a fused sentence is, you will be able to\nproofread for them in your papers then you will be less likely to make such a\nmistake.\nAnswer Key - Fused Sentence Practice 1 Fused Sentence Practice 2\nFused or Run-on Sentences: Practice 2\nA fused sentence (or run-on) occurs when two independent clauses are\njoined without punctuation or without a coordinating conjunction.\nFused sentence: Independent clause independent clause.\nAt first I wanted to be a doctor now I don't.\nSome easy ways to correct a fused sentence are as follows:\n1. Add a period after the first independent clause and capitalize the next\nword. (IC. IC)\nAt first I wanted to be a doctor. Now I don't.\n2. Add a semicolon after the first independent clause. (IC; IC)\nAt first I wanted to be a doctor; now I don't.\n3. Add a comma and a coordinating conjunction after the first independent\nclause. (IC, CC IC)\nAt first I wanted to be a doctor, but now I don't.\nDirections: For each sentence below, write FS if it is a fused sentence or\nC if it is correct.\n1. My Aunt Grattis lives in a mansion on the Delaware River in a small town\ncalled Andalusia.\n2. She is extremely fussy about her furniture for instance children under 12\ncannot sit on her antiques. 3. One of the problems college students face today is credit card debt credit-\ncard companies offer cards to students who don't have jobs.\n4. Credit card companies can be unscrupulous one even offered a pre-\napproved card to my eight-year-old daughter.\n5. I went to the walk-in clinic because I was feeling ill in fact, I had walking\npneumonia.\n6. Dr. Weeks's nurse called today she said that I need to exercise more often.\n7. Since I am too busy studying grammar rules, I have no time to exercise the\nnurse did not think that was a very good excuse.\n8. She is probably right I should exercise more.\n9. Do you think that typing at the computer counts as exercise?\n10. My fingers are certainly getting a good workout today I have been typing\nfor three hours.\nAnswer Key - Fused Sentences Practice 2 Fused Sentence Practice 3\nFused or Run-on Sentences: Practice 3\nA fused sentence (or run-on) occurs when two independent clauses are\njoined without punctuation or without a coordinating conjunction.\nFused sentence: Independent clause independent clause.\nAt first I wanted to be a doctor now I don't.\nSome easy ways to correct a fused sentence are as follows:\n1. Add a period after the first independent clause and capitalize the next\nword. (IC. IC)\nAt first I wanted to be a doctor. Now I don't.\n2. Add a semicolon after the first independent clause. (IC; IC)\nAt first I wanted to be a doctor; now I don't.\n3. Add a comma and a coordinating conjunction after the first independent\nclause. (IC, CC IC)\nAt first I wanted to be a doctor, but now I don't.\nDirections: For each sentence below, write FS if it is a fused sentence or\nC if it is correct.\n1. According to MSNBC, a New Jersey major wants forecasters held\nresponsible for dire predictions forecasters who predict blizzards should be\nheld accountable for their predictions.\n2. Major Richard Bowe wants to know if the forecasts of heavy snow and\nblizzard conditions were mistakes or a deliberate attempt to generate ratings. 3. He suggests errant forecasters ought to be held responsible for losses by\nbusinesses and others who lost money by listening to the forecasts.\n4. A spokesperson from the National Weather Service notes that forecasts\nare judgments based on available information they are not any kind of\nguarantee.\n5. The storm was originally forecast to wreak havoc on the entire\nnortheastern portion of the United States however, the storm left most major\ncities unscathed.\n6. Washington, Philadelphia, and New York took much less of a beating than\nfirst predicted the storm came nowhere near to living up to its hype.\n7. Snow accumulations from the storm, which began battering the region late\nMonday, ranged from 18 inches to 30 inches.\n8. Red-faced forecasters were scratching their heads over how they could be\nso wrong in their predictions.\n9. Forecasters had grappled with conflicting computer models before\npredicting that New England would be the hardest-hit area.\n10. Forecasters thought the storm would paralyze the entire coast they\npredicted it could be the worst blizzard in 35 years.\n11. Those fears were not realized the storm dissipated.\n12. Many areas got slush and rain instead of snow.\n13. \"Our models aren't perfect we'd be the first to admit that,\" said the\ndirector of the National Centers for Environmental Preditions.\n14. I am not sure why those folks are complaining would they have been\nhappier if there had been a disaster?\n15. Things could be worse forecasters warn another storm could come as\nearly as Friday. Answer Key - Fused Sentence Practice 3 Fused Sentence Practice 4\nFused or Run-on Sentences: Practice 4\nA fused sentence (or run-on) occurs when two independent clauses are\njoined without punctuation or without a coordinating conjunction.\nFused sentence: Independent clause independent clause.\nAt first I wanted to be a doctor now I don't.\nSome easy ways to correct a fused sentence are as follows:\n1. Add a period after the first independent clause and capitalize the next\nword. (IC. IC)\nAt first I wanted to be a doctor. Now I don't.\n2. Add a semicolon after the first independent clause. (IC; IC)\nAt first I wanted to be a doctor; now I don't.\n3. Add a comma and a coordinating conjunction after the first independent\nclause. (IC, CC IC)\nAt first I wanted to be a doctor, but now I don't.\nDetermine whether any of the following sentence are fused. Correct\nthose that are.\n1. One day in the late summer, Frog was not feeling well.\n2. Toad said, \"Frog, you are looking quite green.\"\n3. \"But I always look green,\" said Frog \"I am a frog.\"\n4. \"Today you look very green even for a frog go to bed and rest.\" 5. Toad made Frog a cup of hot tea Frog drank the tea.\n6. It's not easy to sit at the computer and make up examples of fused\nsentences.\n7. The sun is shining the world is all aglow.\n8. This is the last day of spring break, and I'm sitting here at this computer\ntrying to think of fused sentences.\n9. I must be out of my mind everyone else is at the beach.\n10. But it's too cold for the beach; furthermore, it's too far to drive.\n11. Adjectives modify nouns by adding to their meaning adverbs modify\nverbs and other adverbs.\n12. Nouns are words that name persons, places, things, or abstractions.\n13. The comma is the most widely used punctuation mark there is much\nvariation in its usage.\n14. I slipped on the wet floor as I ran across the kitchen.\n15. I cannot prepare for the seminar because I have misplaced my glasses.\nAnswer Key - Fused Sentence Practice 4 Fused Sentence Practice 5\nFused or Run-on Sentence Practice 5\nIdentify and correct any fused sentences.\n1. The severe weather warning did not deter some travelers traffic on I-75\nwas not as heavy as usual.\n2. The sky turned black the rain fell in torrents.\n3. Many drivers turned on their flashers because visibility was poor.\n4. Since I could no longer see the road, I pulled off at the first exit.\n5. There was no gas station at the exit I joined the many cars that were\npulled off on the side of the road.\n6. I was almost out of gas, so I turned off my engine.\n7. When the rain slackened, I got back on the interstate I drove to the next\nexit.\n8. I'm glad that I kept driving I later learned that a tornado touched down\nnear where I had been parked.\n9. It destroyed several homes fortunately no one was hurt.\n10. Now that you have completed questions one through nine, you should\ncheck your answers.\nAnswer Key - Fused Sentence Practice 5\nIdentifying Dependent and Independent Clauses Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Identifying Dependent and Independent\nClauses - Practice 1\nAn independent clause, also known as a simple sentence, includes a\nsubject and verb and expresses a complete thought.\nExample: Juliet, a border collie puppy, prefers to chase\napples and pears.\nSubject Verb\nA dependent clause has a subject and verb, is introduced by a\nsubordinate conjunction or a relative pronoun, but does not express a\ncomplete thought. A dependent clause is not a complete sentence.\nExample: Because the heavy rains flooded the entrance to\nthe subdivision.\nSub. Conj. Subject Verb\nExample: After Laura carefully read the assigned\nchapter.\nSub. Conj. Subject Verb\nDetermine whether the underlined word groups are dependent clauses,\nindependent clauses, or not a clause.\n1. Although it was raining, Maria went for a jog at Civitan Park.\n2. Brianna eats chocolate whenever she gets a poor grade in math.\n3. After the flood, the family moved into a temporary shelter.\n4. While walking at the park, John saw a raccoon eating potato chips.\n5. Students enrolled in bachelor's and associate's degree programs must pass\nthe Regents' Test as a graduation requirement. 6. Students who fail to show up for the Regents' test must enroll in the\nRegents' remediation courses.\n7. When you finish your homework, please take the dog for a walk.\n8. After Juan completed the assignment, he swam laps at the gym.\n9. Christa left home at 4:00 a.m. since she had to drive to Atlanta for a\nmeeting.\n10. Before completing the assignment, Evan decided to eat a quick lunch.\nIdentifying Dependent and Independent Clauses - Practice 1 Answer\nKey Identifying Dependent and Independent\nClauses - Practice 2\nDetermine whether the underlined word groups are dependent clauses,\nindependent clauses, or not a clause.\n1. Juan continued playing although he injured his knee.\n2. I thought that the offer was too good to be true.\n3. While I was scrubbing the floors, Juliet was watching television.\n4. Although tired and grumpy, Laura agreed to babysit for her sister-in-law.\n5. Inspired and energized, Sean solved the case of the missing energy drink.\n6. While driving home from spring break, Maria saw a tornado touch down.\n7. People who drink and drive should be arrested.\n8. Ever since my daughter purchased a ferret, I have noticed that authors\ndescribe their bad\nguys as ferret-like.\n9. Such descriptions are not fair to ferrets.\n10. Since I could not go to the Pancake Breakfast, I gave away my tickets.\nIdentifying Dependent and Independent Clauses - Practice 2 Answer\nKey\nInteractive Semicolon Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License.\nLogical Fallacy Logical Fallacy - Practice 1\n1. \"You are saying she was killed because she was immoral, and she was\nimmoral because she was killed!\" (from Anne Perry, The Cater Street\nHangman, pp. 71-72)\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. no error\n2. You will either complete all of your assigned readings for this class, or\nyou will fail this course.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\n3. You should never schedule your child's dentist appointments during\nschool hours. If you do, your child will miss more and more classes. Before\nyou know it, your child will be an elementary school drop out.\na. hasty generalization\nb. circular reasoning\nc. slippery slope\nd. false alternatives 4. New Yorkers are so rude! I went to New York City last summer, and two\ntaxi-cab drivers almost ran me down.\na. hasty generalization\nb. circular reasoning\nc. slippery slope\nd. false alternatives\ne. careless comparison\n5. I do not like writing because I do not like to write.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\n6. Students are just like customers: both groups are paying for a product, and\nboth are always right.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\ne. personal attack\n7. We must stop the University System from raising tuition. If we don't, the\nSystem will also begin raising technology fees; then the System will increase\nparking fees. Soon no one will be able to afford college. a. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. slippery slope\ne. personal attack\n8. You can't believe anything Professor Loca says concerning child\ndevelopment. After all, he has no children of his own.\na. hasty generalization\nb. circular reasoning\nc. personal attack\nd. careless comparison\ne. slippery slope\n9. Having leadership shows others that you can be a great leader. (student\nessay)\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\nLogical Fallacy - Practice 1 Answer Key Logical Fallacy - Practice 2\n1. You should reduce your fat intake because eating too many fats is bad for\nyou.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. no error\n2. “We will move forward together or not at all.” President Barack Obama\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\n3. We should not pass a bill that bans the sale of alcohol on Sunday. We\nsuch a bill were passed, then lawmakers would eventually pass a bill\nbanning the sale of alcohol after midnight. Soon we would be back to\nProhibition.\na. hasty generalization\nb. circular reasoning\nc. slippery slope\nd. false alternatives\n4. Florida Gator fans drink too much. When I was at the Florida-Georgia\ngame, I saw at least ten Gator fans who were intoxicated. a. hasty generalization\nb. circular reasoning\nc. slippery slope\nd. false alternatives\ne. careless comparison\n5. We must not pass any more gun control laws or we will all be blown up\nby terrorists.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\n6. Exercising is just like eating candy. Just as eating a little candy won’t hurt\nyou physically, exercising a little won’t hurt you. But too much exercise, like\ntoo much candy, will make you sick to your stomach.\na. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. careless comparison\ne. personal attack\n7. We must stop the University System from increasing the requirements to\nreceive the Hope Scholarship. If we don't, the System will make it more and\nmore difficult for students to afford college, and eventually, only the rich\nwill be able to attend the college of their choice. a. hasty generalization\nb. circular reasoning\nc. false alternatives\nd. slippery slope\ne. personal attack\n8. You can't possibly believe Mr. Smith’s testimony in the money laundering\ntrial. Mr. Smith once plagiarized an essay when he was in college.\na. circular reasoning\nb. personal attack\nc. careless comparison\nd. slippery slope\n9. Dieting is useless because everyone knows that diets don’t work.\na. slippery slope\nb. circular reasoning\nc. false alternatives\nd. careless comparison\n10. Either we start making teachers pay into their own pensions or the state\ngovernment will collapse.\na. hasty generalization\nb. circular reasoning\nc. false alternatives d. careless comparison\nLogical Fallacy - Practice 2 Answer Key\nParts of Speech Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License.\nPatterns Patterns - Practice 1\n1. Because the television was too loud, I was not able to concentrate on my\nstudies, and consequently, I did not do well on my algebra test.\na. comparison b. contrast c. simple listing d.\ncause & effect\n2. Semiconductors are sample devices that use materials that are halfway\nbetween the conductors' characteristic of few outermost shell electrons and\nthe table, inert materials with eight valence electrons.\na. comparison b. definition c. simple\nlisting d. classification\n3. My dog Moonbear was very different from my dog Frankie.\na. comparison b. contrast c. time order d. cause &\neffect\n4. There are several chores that I do every day: wash the dishes, make the\nbeds, and take out the trash.\na. comparison b. contrast c. simple listing d. time\norder\n5. To make a pasta face, cut a large circle 1 foot in diameter from cardboard.\nNext, cut 2 large holes 1.5 inches apart in the center of the circle. Then, Cut\n2 squares from the plastic packaging to fit over the eye holes and tape onto\nthe back of the mask. Next, paint the front of the mask white and leave to\ndry.\na. classification b. description c. time order d.\nsimple listing\n6. As we penetrated deeper into the heart of the old city, the narrow\nwinding streets took on the character of a maze, composed of dirty crumbling walls and shuttered windows. The latticed balconies jutting out from the\nupper stories of the tall old houses cut off the sunlight, so that we walked\nthrough a dusty shade. (Elizabeth Peters, Lion in the Valley)\na. comparison b. description c. simple listing\nd. cause and effect\n7. There are several varieties of movies that I enjoy: musicals, suspense\nthrillers, and comedies.\na. comparison b. contrast c. simple listing\nd. description\n8. His father and his brother had been involved in the illegal antiquities\ntrade; both had met terrible ends the previous year. (Elizabeth Peters, Lion in\nthe Valley)\na. comparison b. description c. contrast d. cause\nand effect\n9. The Harry Pottter and the Sorcerer's Stone DVD offered several special\nfeatures: never before seen footage, self-guided tour of Hogwarts, theatrical\ntrailers, and scene access.\na. simple listing b. description c. time order d.\ncause and effect\n10. Polarity denotes the relative electrical charge of one point in an\nelectrical circuit \"with reference to\" another point.\na. simple listing b. description c.definition d.\nclassification\nPatterns - Practice 1 Answer Key Patterns Practice 2\n1. \"The simplest and most obvious explanation,\" Emerson continued\nangrily, \"is that Ronald tried to kill his brother. An act of purely private\nvillainy, Peabody. Why Ronald should hate Donald I do not know, but there\nare several possibilities: an inheritance, or rivalry for the hand of the young\nlady, for instance. People do kill people for the most ridiculous reasons\".\n(Elizabeth Peters, Lion in the Valley)\na. comparison b. contrast c. cause and effect d. time\norder\n2. The grand palette of the heavens was streaked with colors no early\npainter could achieve, savage-glowing bronze and gleaming crimson, indigo\nand rose and soft blue-gray. (Elizabeth Peters, Lion in the Valley)\na. comparison b. contrast c. definition d. description\n3. Three types of shoppers are certainly annoying: the aisle blockers, the\ncoupon commandos, and the bargain hunters.\na. comparison b. contrast c. classification d. simple\nlisting\n4. For those who are forgetful, the following tips can make the holiday\nseason just a little easier. One month before the Christmas or Jewish\nholidays, buy and mail holiday cards. Three weeks before, mail gifts to\nanyone you won't be seeing in person. Two weeks before, tip service\nproviders that you use regularly. One week before, start planning the menu.\na. simple listing b. time order c. cause and effect d.\ndefinition\n5. A growing body of scientific research reveals that alcohol use by\npregnant women can result in birth defects in unborn children.\na. comparison b. contrast c. time order d. cause and effect 6. The fight-or-flight response is the body's reaction to a stressor by\nconfrontation or avoidance.\na. comparison b. contrast c. time order d. definition\n7. Alcohol abuse is similar to drug abuse in several ways.\na. comparison b. contrast c. definition d. cause and effect\n8. Dr. T. Berry Brazelton has identified 14 key parenting points for families\nwith young children.\na. comparison b. contrast c. classification d. simple listing\ne. cause & effect\n9. There are four types of therapeutic approaches to mental disorders:\ninsight-oriented therapy, behavior therapy, group therapy, and biological\ntherapy.\na. comparison b. contrast c. classification d. simple listing\ne. cause & effect\n10. The orange, red, and golden leaves glistened in the bright morning sun\nand shimmered in the soft breeze.\na. time order b. comparison c. description d.\ndefinition\nPatterns - Practice 2 Answer Key\nProofreading Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Proofreading Practice 1\nProofreading : Practice 1\nRead the following paragraph and determine whether each sentence is\ncorrect, is a fragment, has a subject\/verb agreement error, includes a comma\nsplice, or is a fused sentence. No sentence includes more than one error.\n1. When I was younger, I had a number of \"accidents\" with my cars. 2.\nNot accidents in the traditional sense. 3. For example, as I was driving\nhome from work one day, I smelled smoke. 4. I pulled over to the side of the\nroad then I looked under the hood. 5. Seeing nothing alarming, I got back\ninto my car and continued driving, however, the scent of smoke became even\nstronger. 6. So strong that I pulled over to the side of the road again. 7. Still\nseeing nothing unusual, I got back into my car this time it filled up with\nsmoke. 8. A passing motorist stopped to offer his help. 9. He pulled back\nthe carpet from under the accelerator, the carpet burst into flames. 10.\nNoticing a jug on my front seat, he asked what were in it. 11. When I told\nhim it was iced tea, he poured the tea onto the fire. 12. Putting out the fire\nbefore it could do more damage. 13. another incident happened several\nyears later. 14. My sister and I was driving to the beach. 15. Smoke started\ncoming from the cassette player, quickly the smoke filled the car. 16.\nForcing us out of the car. 17. It seems my husband had wired the cassette\nplayer incorrectly. 18. A fact that is not particularly surprising. 19. I no\nlonger have either car, I no longer have that husband.\nAnswer Key - Proofreading Practice 1 Proofreading Practice 2\nProofreading : Practice 2\nRead the following paragraph and determine whether each sentence is\ncorrect, is a fragment, has a subject\/verb agreement error, includes a comma\nsplice, or is a fused sentence. No sentence includes more than one error.\n1. The Internet can be a great source of information for students who are\ndoing research, however, the information on the Internet is not regulated. 2.\nAnyone can post information that is intentionally or unintentionally\ninaccurate or misleading anyone can create his or her own Web page. 3.\nThere is information on aging, information on cancer, information on health,\nand information on weight loss. 4. The Alcoholics Anonymous Web site and\nthe National Institute on Alcohol Abuse and Alcoholism site provides\ninformation related to alcohol abuse. 5. Looking for information on\npregnancy and childbirth? 6. Not hard to find on the Internet. 7. Labor and\nBirth Resources (a good Web site) provide information on the different types\nof pain medications available to mothers. 8. Interested in weight loss? 9.\nTry Overeaters Anonymous. 10. Another good site that include assessment\ntools is Cyberdiet.\nAnswer Key - Proofreading Practice 2 Proofreading Practice 3\nProofreading : Practice 3\nRead the following paragraph and determine whether each sentence is\ncorrect, is a fragment, has a subject\/verb agreement error, includes a comma\nsplice, or is a fused sentence. No sentence includes more than one error.\n1. There is a number of risk factors associated with cardiovascular\ndisease. 2. Some of these factors cannot be changed. 3. Increasing age,\nmale gender, and heredity is a few. 4. According to health sources, six risk\nfactors are related to our own choices in lifestyle, these include smoking,\nactivity level, cholesterol level, blood pressure, weight, and diabetes. 5.\nMany smokers believe that if you have smoked for years, there is no benefit\nin quitting the damage has been done. 6. This belief, however, is incorrect.\n7. According to the American Heart Association, one's risk of heart disease\ndeclines rapidly after one quits smoking. 8. Another changeable factor\nrelated to heart disease is lack of regular exercise. 9. Physical activity,\nincluding walking, swimming, or jogging, help lower cholesterol levels and\nencourages weight loss. 10. Another risk factor for heart disease is stress.\n11. Especially unresolved stress over an extended period of time. 12.\nThose who cannot cope with stress are more likely to develop harmful\nlifestyles that contribute to heart disease, they may smoke, become inactive,\nor eat fatty foods. 13. Take control of your heart. 14. Before it is too late.\nAnswer Key - Proofreading Practice 3 Proofreading Practice 4\nProofreading : Practice 4\nRead the following paragraph and determine whether each sentence is\ncorrect, is a fragment, has a subject\/verb agreement error, includes a comma\nsplice, or is a fused sentence. No sentence includes more than one error.\n1. Some people eat the strangest food items for breakfast. 2. Like roast\nbeef, mashed potatoes, and candied yams. 3. My uncle, who has traveled to\nChina, South America, and Africa, like to eat elephant ears (the plant!) in a\ncoconut cream sauce. 4. My brother Bill likes hot fudge sauce on his grits,\nmy sister likes catsup on her eggs. 5. My father on rare occasions eat cold\npepperoni pizza. 6. My former neighbors back in Island Grove, Florida,\nlikes to eat swamp cabbage and heart of palm. 7. Other people serve the\nstrangest foods at parties. 8. For instance, chocolate covered turkey! 9. At\nmy brother Peter's caroling party, he and his wife served an odd variety of\nfinger foods. 10. There was octopus in a lemon butter sauce, squid in a\nmarinara sauce, and oysters in an apricot sauce. 11. A former boyfriend\nseasoned pancakes in the oddest ways he liked to throw in pinches of cloves,\ncumin, and nutmeg. 12. Thinking he was a creative genius. 13. No one ate\nhis pancakes. 14. Not even his dog.\nAnswer Key - Proofreading Practice 4 Proofreading Practice 5\nProofreading : Practice 5\nRead the following sentences and determine whether each sentence is\ncorrect, is a fragment, has a subject\/verb agreement error, includes a comma\nsplice, or is a fused sentence. No sentence includes more than one error.\n1. The story of the first two years, two months, and two days in the life of\na modern Southern marriage.\n2. This book is dangerous, it is one of those rare books that causes fits of\nuncontrollable laughter.\n3. In the book The Heart of a Distant Forest, Andrew Lachlan meets a\nwoman he had loved, they soon begin seeing each other.\n4. At one point in the novel, Lachlan writes, \"It is hard for me to write my\nhands shake so.\"\n5. A novel written with insight, poetry, beauty, and passion.\n6. A book meant to be read again and again.\n7. The night became cold, Laura was glad that she packed an extra blanket.\n8. Laura would not sleep well that night she would ache from the damp\nand freezing air.\n9. Sometimes my life seems like a novel, I am a character lost in a series\nof confusing subplots.\n10. Living out my life in third person singular.\n11. Reading and walking was all she loved.\nAnswer Key - Proofreading Practice 5\nPronoun Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Pronoun Case - Practice 1\nPronoun Case: Practice 1\nNominative Objective\n(Subject) Case Case\nSingular Plural Singular Plural\n1st Person I we me us\n2nd Person you you you you\nhe, she, it, they him, her, it\n3rd Person them\nwho who whom\nThe nominative case is used when the pronoun is the subject of a verb.\nAlso, use a subject pronoun after any form of the verb \"to be.\"\nThe objective case is used when the pronoun is the direct object of a verb or\nthe object of a preposition.\nChoose the correct case for each pronoun in the sentences below.\n1. Maria and (her, she) laughed and talked well into the night.\n2. (Him, He) and I just don't seem to get along very well these days.\n3. It was (her, she) who tied up the computer for three hours.\n4. Cora handed Tom and (I, me) the employment applications.\n5. Between you and (I, me), pronoun case can be very confusing.\n6. Among the applicants were Tom and (me, I).\n7. It was (he, him) and Colleen who solved the problem with my scanner.\n8. The vice president will select (you or I, you or me) to serve as acting\nchair.\n9. Between Joseph and (him, he), there really isn't much of a choice. 10. As for my cousin and (I, me), we will not be attending the dinner.\n11. That certainly is not (he, him) sitting in the first row of the theater.\n12. I gave the note to Laura, (who, whom) gave it to Phil.\n13. I gave the left over fudge to Tom and (she, her).\n14. Leonardo wrongly believed that (she and Tom, her and Tom) would take\nthe blame\nfor him.\n15. (Whom, Who) did you say would be attending in my place?\nPronoun Case - Practice 1 Answer Key Pronoun Case - Practice 2\nNominative Objective\n(Subject) Case Case\nSingular Plural Singular Plural\n1st Person I we me us\n2nd Person you you you you\nhe, she, it, they him, her, it\n3rd Person them\nwho who whom\nThe nominative case is used when the pronoun is the subject of a verb.\nAlso, use a subject pronoun after any form of the verb \"to be.\"\nThe objective case is used when the pronoun is the direct object of a verb or\nthe object of a preposition.\nChoose the correct case for each pronoun in the sentences below.\n1. My sister is taller than (I, me).\n2. After hearing his sister explain the fight she had had with husband, Jim\nexclaimed,\n\"the person who should apologize is (him, he)!\"\n3. The winner of last night's raffle was (her, she).\n4. My long-time friend went to dinner with my husband and (I, me).\n5. (Her, She) and her friends went to see Hamlet on Landis Green.\n6. The teacher gave (we, us) students extra credit for an optional term paper.\n7. Between you and (I, me), that outfit looks ridiculous on her.\n8. He was not as angry as (them, they). 9. Please give the leftovers to Paul and (she, her).\n10. My sister Lisa and (me, I) take a trip to Panama City every spring.\n11. Lisa enjoys shopping more than (me, I).\n12. The child Laura was most concerned about was (her, she).\n13. When will you start listening to your mother and (I, me)?\n14. I think that (you and him, you and he) are more similar than you think.\n15. She selected Troy (who, whom) she thought could do the job right the\nfirst time.\nPronoun Case - Practice 2 Answer Key\nPronoun\/Antecedent Agreement Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Pronoun\/Antecedent Agreement - Practice 1\nPronoun\/Antecedent Agreement Practice 1\nRemember:\n1. Neither, either, and each are singular.\n2. Words ending in \"one,\" \"body,\" and \"thing\" are also singular.\n3. A collective noun is singular if the group acts as one unit, plural if the\nmembers of the group act as individuals.\nDirections: Choose the correct pronoun in the following sentences.\n1. Each of the daughters followed (her, their) mother's footsteps.\n2. Neither of the actors could remember (his, their) lines correctly.\n3. Everyone complained that (his\/her, their) food was cold.\n4. Neither of my sisters remembered to purchase (her, their) tickets.\n5. Late in the evening, the jury finally reached (its, their) verdict.\n6. The captains of both teams forgot the words of wisdom that (his,\nhis or her, their) coaches had given the night before the championship.\n7. Every student should proof (his or her, their) essay for Type I errors.\n8. All of my brothers earned (his, their) degrees from Florida State\nUniversity.\n9. Almost everyone was surprised when (he or she, they) heard the news.\n10. Everybody on the voyage complained that (he or she, they) were\nsuffering from food poisoning.\nPronoun\/Antecedent Agreement - Practice 1-Answer Key Pronoun\/Antecedent Agreement - Practice 2\nPronoun\/Antecedent Agreement Practice 2\nRemember:\n1. Neither, either, and each are singular.\n2. Words ending in \"one,\" \"body,\" and \"thing\" are also singular.\n3. A collective noun is singular if the group acts as one unit, plural if the\nmembers of the group act as individuals.\nDirections: Choose the correct pronoun in the following sentences.\n1. Neither Clarissa nor Aleah wore (her, their) own dresses to the prom.\n2. Someone in your ENGL 1101 class called and left (his, their) phone\nnumber.\n3. McDonnell-Douglas recently published (its, their) report on the newly\nimproved\nTomahawk missile.\n4. One of the cashiers thinks that (her, their) boss has been transferred to a\ndifferent\nlocation.\n5. Many of the students at Dalton State College find that school pressures\naffect\n(his or her, their) relationships at home.\n6. Each of the candidates gave (his or her, their) speech at the Civic Center.\n7. Having an obsessive-compulsive personality, Laura likes to have\neverything\nin (its, their) place before she goes to sleep at night. 8. Either of the women who parked illegally will soon find that (her, their)\ncar has\nbeen towed.\n9. Either my brothers or my uncle will fail to purchase (his, their) tickets in\ntime\nto receive a discount.\n10. Either my brother or my uncles will fail to purchase (his, their) tickets in\ntime\nto receive a discount.\nPronoun\/Antecedent - Practice 2 Answer Key\nSubject Identification Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Subject Identification - Practice 1\nSubject Identification Practice 1\nFinding the Subject\nThe subject of the sentence usually answers the following question:\nWho or what is this sentence about?\nThe subject is typically a noun (person, place, animal, or thing) or a\npronoun (e.g., I, he, she, we, you, they).\nThe subject may be a gerund (ing form a a verb: running, swimming,\nstudying).\nThe subject may be an infinitive (to form of a verb: to run, to swim, to\nstudy).\nA sentence may have two or more subjects (compound subjects).\nThere and here are never the subjects of sentences.\nUnderline the subjects in the following sentences.\n1. Today's weather forecast is for partly cloudy skies with temperatures in\nthe upper 80s.\n2. A stray thunderstorm is possible through the early evening.\n3. There has not been any rain in weeks.\n4. The sound of rain would be like music to my ears.\n5. Tropical depression Barry brought five inches of rain to Melbourne,\nFlorida.\n6. According to the WeatherChannel.com, the United States has the largest\nnumber of tornadoes worldwide.\n7. The tornado warning for Leon County was cancelled just moments ago.\n8. We will not need to go to the basement after all. 9. Cleaning the basement and emptying the garbage are my youngest\nbrother's chores.\n10. Here are Tom and Rita.\n11. Surfing is dangerous during a tropical depression.\n12. To see a tornado form was the tornado hunter's strongest desire.\n13. I do not share that desire.\n14. Feeling exhausted, Laura lay down on the floor under the ceiling fan.\n15. To lose weight requires tremendous effort and willpower.\nSubject Identification - Practice 1 Answer Key Subject Identification - Practice 2\nFinding the Subject\nThe subject of the sentence usually answers the following question:\nWho or what is this sentence about?\nThe subject is typically a noun (person, place, animal, or thing) or a\npronoun (e.g., I, he, she, we, you, they).\nThe subject may be a gerund (ing form a a verb: running, swimming,\nstudying).\nThe subject may be an infinitive (to form of a verb: to run, to swim, to\nstudy).\nA sentence may have two or more subjects (compound subjects).\nThere and here are never the subjects of sentences.\nUnderline the subjects in the following sentences.\n1. For five homeless teenagers, surfing became a way to enjoy life, at least\nfor a week, at Playalinda Beach.\n2. However, next week, an upcoming launch of the space shuttle will close\nthe beach.\n3. Reading enables children to experience places beyond their reach.\n4. All too frequently, your cover letter and resume can keep you from\ngetting a job.\n5. According to Kate Lorenz, there are ten ways to ruin a resume.\n6. Writing in first person and using passive language are particularly\ntroublesome.\n7. Failing to proofread can also be fatal.\n8. You should avoid flashy formatting and tiny font sizes. 9. To teach eighth graders requires enormous energy.\n10. Quitting work early, Laura stopped at Kroger to buy something to cook\nfor dinner.\n11. The Writing Lab is a great place to prepare for final exams.\n12. To succeed in college, you should attend every class session and read\nall assigned material.\n13. Laughter is the best medicine.\n14. To err is human.\n15. To forgive is beyond her abilities or desires.\nSubject Identification - Practice 2 Answer Key\nSubject-Verb Agreement Attribution\nThe practice exercises on this page were developed by Dr. Mary Nielsen,\nDean of the Dalton State College School of Liberal Arts.\nCreative Commons License\nThis work is licensed under a Creative Commons Attribution-\nNonCommercial-ShareAlike 4.0 International License. Subject Verb Agreement Practice 1\nSubject\/Verb Agreement Practice 1\nChoose the correct verb in the following sentences. Click on the answer key\nat the end of the practice.\n1. There (is, are) an empty cup and a paper bag on the floor.\n2. My sister as well as two of my brothers (lives, live) in Florida.\n3. The professor, together with twenty-five students, (is, are) happy that the\nterm was almost over.\n4. My grandmother and grandfather (look, looks) alike.\n5. Either my brothers or my younger sister (is, are) owed my thanks.\n6. One of her six children (run, runs) five miles every day.\n7. Each of the students (spend, spends) six hours studying for classes every\nday of the week.\n8. Neither of the boys (is, are) willing to study during the weekends.\n9. As a result of the conflict, there (is, are) bloodshed and chaos.\n10. Do you think that the manager and our supervisor (understands,\nunderstand) the problem?\n11. Neither my sister nor my brothers (is, are) planning to drive down from\nNew York for my seventh marriage.\n12. One of my shoes (is, are) missing.\n13. Christopher or Laura (email, emails) me almost every day. 14. Maria's regular salary together with tips (are, is) just enough for her to\nsurvive.\n15. Under my son's bed (was, were) three Rollingstone magazines.\nAnswer Key - Subject\/Verb Agreement Practice 1 Subject\/Verb Agreement Practice 2\nSubject\/Verb Agreement: Practice 2\nReminders: Each, everyone, everybody, and one are singular pronouns.\nWatch for prepositional phrases that separate the subject from the verb (of\nthe ____, with the ____). The verb should agree with the subject of the\nsentence, not the object of the preposition.\nDirections: In each of the following sentences, select the appropriate\nform of the verb.\n1. One of my old fillings (need, needs) to be replaced.\n2. The young widow with her five small children (want, wants) to get on the\nbus.\n3. In the back of the closet (is, are) some old paperback novels you might\nlike to have.\n4. The Chevy with the blue tinted windows (need, needs) washing.\n5. Geoffrey (doesn't, don't) have time to finish his work.\n6. Along the river's edge (is, are) found many different kinds of wild\nflowers.\n7. Every one of the employees (seem, seems) ready for a vacation.\n8. Each of the Academy Award winners (was, were) well-paid.\n9. Some of the sweaters that are supposed to be new (have, has) torn seams.\n10. One of the clerks (do, does) much better work than the other one.\n11. The serving platter with the flowers and vines on it (is, are) pretty. 12. Neither my brothers nor my sister (is, are) going to the beach with me\nthis weekend.\n13. Laura, together with Sally and Jon, (is, are) going to Port St. John this\nweekend.\n14. The plumber with his young helper (was, were) at the door only 10\nminutes after Maria called.\n15. Neither the scouts nor the scoutmaster (was, were) found until the second\nday of the search.\nAnswer Key for Subject\/Verb Agreement Practice 2 Subject\/Verb Agreement Practice 3\nSubject\/Verb Agreement: Practice 3\nReminders: Each, everyone, everybody, and one are singular pronouns.\nWatch for prepositional phrases that separate the subject from the verb (of\nthe ____, with the ____). The verb should agree with the subject of the\nsentence, not the object of the preposition.\nDirections: In each of the following sentences, select the appropriate\nform of the verb.\n1. A seer, so my friends tell me, (predict, predicts) events or developments.\n2. The seer, together with three other psychics, (plans, plan) to make a\nnumber of startling predictions.\n3. These predictions, including one about how well you will do on this\npractice, (is, are) not to be believed.\n4. My sister, along with her husband and my parents, (is, are) driving to a\nwedding this weekend.\n5. Inside my refrigerator (is, are) a can of Diet Pepsi and an old English\nmuffin.\n6. One of my brothers (was, were) in Atlanta last weekend.\n7. The teacher as well as her students (believe, believes) that practice makes\nperfect.\n8. However, I believe that perfect practice, including long drills, (is, are) the\nkey to success.\n9. Neither of the two politicians (expect, expects) to lose the race.\n10. Neither Senator Smith nor her administrative assistants (return, returns)\nphone calls. 11. Neither her administrative assistants nor Senator Smith (return, returns)\nphone calls.\n12. Each of the twins (has, have) some unusual habits.\n13. The first type of driver that I find annoying (is, are) the speeders.\n14. She is one of the students who always (answer, answers) correctly.\n15. Sara is the only one of the students who always (answer, answers)\ncorrectly.\nAnswer Key for Subject-Verb Agreement Practice 3 Subject\/Verb Agreement Practice 4\nSubject\/Verb Agreement: Practice 4\nReminders: Each, everyone, everybody, and one are singular pronouns.\nWatch for prepositional phrases that separate the subject from the verb (of\nthe ____, with the ____). The verb should agree with the subject of the\nsentence, not the object of the preposition.\nDirections: In each of the following sentences, select the appropriate\nform of the verb.\n1. There (is, are) a pebble and some sand in my shoe.\n2. A list of Dalton State College course offerings (is, are) posted on the\ncollege webpage.\n3. Details of the accident (was, were) not released.\n4. The stereo, together with the phone and the CD layer, (go, goes) dead\nduring electrical storms.\n5. Maria and Stephanie (play, plays) Dream Phone on Saturday mornings.\n6. Here (is, are) Tom and Jerry.\n7. Directions for the recipe (is, are) on the back of the box.\n8. In the safety-deposit box at the bank (is, are) is an extra key to my house\nand some important papers.\n9. All of the cookies (taste, tastes) stale.\n10. In the locker room (is, are) a few old weights.\n11. Neither that Internet site nor the article from Time magazine (was, were)\nhelpful to my research. 12. All of the snow (has, have) melted.\n13. Larissa or her cousins (is, are) coming to Dalton to visit.\n14. Either the articles on the Internet or the one in library (seem, seems) to\nhave relevant information.\n15. The article, together with the web pages, (is, are) too much for me to\nread today.\nAnswer Key for Subject-Verb Agreement Practice 4\nSupporting Details Supporting Details - Practice 1\nDetermine the number of major details in the paragraphs below. It is\nuseful to identify the topic sentence and to look for transition words that\nsuggest addition ( such as first, second, third, moreover, also, in addition,\nfurthermore).\n1. According to WebMd, there are a number of symptoms associated with\nhypothyroidism. One common symptom is the inability to tolerate cold.\nPeople with hypothyroidism feel cold more intensely and often wear\nlight sweaters, even during the summer. Another symptom is feeling\ntired throughout the day. In addition, individuals with this disease often\nexperience hair loss. (Some women find that they never have to shave\ntheir legs again.) Yet another symptom is dry skin. Perhaps most\nproblematic is modest weight gain. People with undiagnosed\nhypothyroid disease often gain weight even when they do not overeat.\n2. Mystery fiction comes in many varieties, each appealing to different\ngroups of readers. First, there is the \"classic\" mystery. Classic\nmysteries include works by Agatha Christie, Edgar Allan Poe, and Sir\nArthur Conan Doyle and allow the reader an equal opportunity to solve\nthe crime. Another category is the hard-boiled variety. Often\nconsidered distinctly American, this variety includes tough, solitary\ndetectives who live in a world gone wrong. Then there are police\nprocedurals. These stories offer a step-by-step look at the personnel\nand methods used in the investigation of a crime and typically include\npolice officers as protagonists. Finally, there is the contemporary cozy,\nwhich is similar to the classical style.\n3. For a novel to be classified as a \"contemporary classic mystery,\" it\nmust include many of the following characteristics. For one thing, there must be a puzzle to be solved by both the reader and the protagonist. In\naddition, the detective, usually a reluctant amateur, is the hero. Next,\nthe investigation of the crime must be the central action or plot of the\nstory. Furthermore, the victim of the crime should be someone who\nwill not be terribly missed. Contemporary classic writers must also\nfollow the rules of fair play. That is, all clues should be accessible to\nthe reader and no new evidence should be included when the villain is\nunmasked.\n4. The 1970s saw a number of changes in the mystery fiction publishing\nworld. One change was the importance of regionalism. Novels need\nnot be set in an English country village or on the mean streets of some\nhuge city. Another change was inclusion. Females were no longer\nexcluded in the world of the private eye. Novels of this time period\nalso saw changes in ethnic and racial representation. For instance,\nJames Patterson introduced the African-American detective Alex Cross,\nand Rabbi David Small and Father Dowling both had crimes to solve.\nIn addition, novels of the 1970s showed increased specialization.\nSeries might focus on horse racing, sports agents, cats, and even antique\nprints.\n5. The writer S. S. Van Dine forbade certain tricks in the writing of\nmystery and detective fiction. First of all, a writer could not use a\nseance to trick the guilty party into confessing. The detective also could\nnot use a word association test to determine guilt. Another forbidden\ntrick was the use of phony fingerprints. Nor could writers have a\ncharacter use a dummy to establish an alibi. Van Dine viewed such\ntricks as violating the rules of fair play.\n6. Father Ronald Knox also offered his own rules for detective fiction. No\nmore than one secret room or secret passageway was allowed. The\ncriminal had to be introduced fairly early in the story. Supernatural forces were also not permitted. Knox also believed that the detective\ncould not be the villain. Perhaps his strangest rule was that no\nChinamen could be featured in a story.\n7. The Dalton State Portal has many useful features. It includes access to\nBANNER. Here students can check their grades or register for\ncourses. The Portal also includes campus announcements. These may\ninform students of new courses or events offered through the Fine Arts\nseries. The Portal's \"bookmark\" feature is particularly useful. With a\nfew simple steps, the user can have access to the Weather Channel, the\nHummingbird Migration Web site, or even the Daily Citizen online.\nMoreover, the Portal offers \"tabs\". These tabs can take interested\nstudents to the Roberts Library Web site or to their DSConnect course\npage. Finally, the Portal offers access to campus email.\n8. According to Research Methods in the Social Sciences (Frankfort-\nNachmias and Nachmias), using personal interviews is often more\nadvantageous than using questionnaires sent through the mail. Personal\ninterviews offer greater flexibility. For instance, during an interview,\nthe interviewer can clarify questions that might be misunderstood. In\naddition, personal interviews typically yield a better response rate.\nResearchers cannot control how many questionnaires are thrown away\nas junk mail, but they can control the numbers of people they eventually\ninterview. Personal interviews also provide fuller information. The\ninterviewer can observe facial expressions and spontaneous reactions\nthat a mailed survey cannot provide.\n9. However, using personal interviews to conduct research is not without\ndisadvantages. The text Research Methods in the Social Sciences\n(Frankfort-Nachmias and Nachmias) notes that personal interviews are\nmore expensive than mailed questionnaires. For example, travel costs\nto interview a single subject for a study may be far more expensive than the cost of a postage stamp. In addition, personal interviews are\nsubject to interviewer bias. During a face-to-face interview, the\ninterviewer may inadvertently send nonverbal signals to the\ninterviewee that might affect his or her responses. A final drawback of\npersonal interviews is the lack of anonymity. If the subject matter is\nsensitive or controversial, the interviewee could feel too uncomfortable\nto answer truthfully.\n10. American workers change jobs for a variety of reasons. Promotion is\none typically positive reason for changing jobs. Relocating is also a\ncommon reason for a job change. Sometimes workers relocate to help\nout an aging parent; others relocate for health reasons. Layoffs are also\nresponsible for many job changes. Employees who find themselves\nlaid off will often take any job available. And of course, some\nindividuals are forced into a new line of work when they are fired.\nSupporting Details - Practice 1 Answer Key\nReadings Reading Comprehension Test 1\n\"The End of Relationships and Reality\" by Hudson Owens\nReading Comprehension 1\nShort Answer and Multiple Choice\n1. What is the central idea\/main idea of this passage?\n1. The more people invest, the worse off our society becomes.\n2. Social media and technology have changed the way human\nthink, the way they reason.\n3. Whether it is posting a trendy picture or retweeting the latest\nfunny post, social media has woven its way into everyday life.\n4. None of the above\n2. In body paragraph one, list one major supporting detail.\n3. In body paragraph one, list one minor supporting detail.\n4. List one specific example from body paragraph two. Your example\nshould be a minor detail. 5. As stated in the passage, “44% of people believe the news they\nread on Facebook.” Fact or opinion?\n6. Which sentence is the main idea in body paragraph 4?\n7. What best describes the pattern(s) of organization used in the\npassage?\n1. Comparison and contrast\/argument\n2. Definition and example\/comparison and contrast\n3. Cause and effect\/argument\n4. Listing\/cause and effect\n8. In body paragraph three, the sentence “The couple texts about\nwhat they are doing at their job, what problems they run into, and\neven what they are thinking while at that job” is an example of\nwhat kind of detail?\n1. Major\n2. Minor\n9. “Social networking also creates a separation between people.”\nThis sentence is an example of what kind of detail?\n1. Major\n2. Minor 10. “Social media has absolutely destroyed reality.”\n1. Fact\n2. Opinion Readings in each mode of essay\nReadings: Examples of Essays\nChapter from the book Writing for Success\n• Publisher: Saylor Academy\n• Year Published: 2012\nCreative Commons License Attribution-NonCommercial-ShareAlike\n2.0 Generic (CC BY-NC-SA 2.0) Reading Comprehension Test 2\n\"The Rise and Fall of Children's Programming\" by Chassidy Levell\nPlease answer the following questions using short answers or multiple\nchoice.\n1. The central idea of the passage is the\n1. Second sentence in the introductory paragraph.\n2. Third sentence in the introductory paragraph.\n3. Fourth sentence in the introductory paragraph.\n4. Fifth sentence in the introductory paragraph.\n2. “A child’s brain is just like a house that has just been built” is an\nexample of a\n1. Simile\n2. Metaphor\n3. The television show Uncle Grandpa (body paragraph 2) is a\n__________ detail.\n1. Major\n2. Minor 4. From body paragraph 3, the sentence “Things like nudity, sex jokes,\nand even swearing have crept into every kid’s channel, exposing\nchildren at an even earlier age to these factors.” This sentence is\nan example of a ________ detail.\n1. Major\n2. Minor\n5. “Mister Roger’s Neighborhood, a popular children’s show that aired\non PBS in 1968, ran for a total of thirty-six years and aired over\n900 episodes.”\nThis sentence is\n1. Fact\n2. Opinion\n6. In the concluding paragraph, the use of the word “but” shows a\n1. Comparison\n2. Contrast\n3. Cause\n4. Effect\n7. Paragraph 5 is which pattern of organization?\n1. Cause and effect\n2. Simply listing\n3. Comparison and contrast\n4. None of the above 8. In the first body paragraph, the author argues that\n1. Cartoons are still popular and have a long run time.\n2. Cartoons do not teach children and do not assist in their brain\ndevelopment.\n3. Cartoons need to be taken off the air.\n4. Cartoons are necessary to a child’s brain development.\n9. According to the author, children understand the adult jokes in\ncartoons.\n1. True\n2. False\n10. Comparing a child’s brain to a house is a __________.\n1. Simile\n2. Metaphor Kirkman Reader\nKirkman Reader\nFree readings and videos for students enrolled in freshman composition. The\nessays and videos are organized by pattern, point of view, and theme. Reading Comprehension Test 3\n\"Evolving Education\" by Andrea Torres\nPlease answer the following questions using short answers or multiple\nchoice.\n1. The central idea expressed in the introductory paragraph is in\nwhich sentence?\n1. 4\n2. 5\n3. 6\n4. 7\n2. In body paragraph 3, the author uses “wolfy bucks” as a\n1. Major detail\n2. Minor detail\n3. Main idea\n4. Conclusion\n3. List two transitions in the following sentences.\nBefore computers, students and teachers had to research through\nencyclopedias and almanacs. In contrast, today, if anyone wants to\nfigure something out, they have the power to do so at their fingertips, on\ntheir phones.\nTransition 1 __________________ Transition 2 ___________________\n4. One pattern of organization used throughout each body paragraph\nis\n1. Comparison and contrast\n2. Cause and effect\n3. Definition and example\n4. None of the above\n5. Two of the supporting details in body paragraph 4 are\n1. Art and band\n2. Creative classes and music\n3. Drama and music\n4. None of the above\n6. “Teachers always had guidelines to follow, but they went from\nteaching as they thought appropriate to only teaching what they are\ntold” is an example of a(n)\n1. Fact\n2. Opinion\n7. In body paragraph 1, Where the Red Fern Grows is an example of a\n1. Major detail\n2. Minor detail\n8. The main idea of body paragraph 3 is in which sentence?\n1. Sentence 1\n2. Sentence 2\n3. Sentence 3\n4. None of the above 9. List two minor supporting details from body paragraph 2.\nDetail 1 ______________________________________\nDetail 2 _______________________________________\n10. The author’s conclusion about punishment in today’s schools is that\n1. Students are being motivated by positive reinforcement.\n2. Students are being punished with detention.\n3. Students are being motivated by fear of punishment by the\nprincipal.\n4. None of the above.\nLast Updated: Aug 12, 2019 12:27 PM\nURL: https:\/\/libguides.daltonstate.edu\/ENGL0098\nPrint Page\nLogin to LibApps\nDalton State College\n650 College Dr.\nDalton, GA 30720\n(706) 272-4436\nDalton State College is dedicated to providing broad access to\nquality higher education for the population of Northwest\nGeorgia, thereby enhancing the region’s economic vitality and\nquality of life.\nStay Connected Facebook\nTwitter\nYouTube\nInstagram\nGoogle+\nLinkedIn\nDalton State is accredited by the Commission on Colleges of the Southern\nAssociation of Colleges and Schools\n(1866 Southern Lane, Decatur, GA 30033-4097: Telephone number 404-\n679-4501) to award the associate’s and bachelor’s degrees.\n© 2016 Dalton State College • Site Map • Text-only Version • Website\nDesign By: Third Wave Digital "}