{"text":"Introduc)on To Linguis)cs\nAdam Szczegielniak\nWhat is\nLanguage? Learning Goals\n• What do we know when we know a language\n• Crea)vity in language\n• Competence\/Performance\n• What is Grammar\n• Language Universals\n• Language Development\n• Language and Thought What is Language?\n• The ability to use language, perhaps more\nthan any other attribute, distinguishes\nhumans from other animals\n• But what does it mean to know a\nlanguage? Linguistic Knowledge\n• When you know a language, you can speak (or\nsign) and be understood by others who know\nthat language\n• Five-year-olds already know their first\nlanguage(s)\n• The ability to use a language requires profound\nknowledge that most speakers don’t know that\nthey know Cant help but use language\n• Try to not understand what I am saying\n• Just as impossible as trying not to be fooled by op)cal\nillusions\n• You cannot stop blinking or having peripheral vision\n• For example: Rota)ng Snakes – the circular snakes\nappear to rotate spontaneously in your peripheral\nvision as a result of the peripheral driM illusion. No)ce\nhow the movement stops when you look directly at a\ncollec)on of concentric circles. The illusion is probably\ncaused by unconscious rapid eye movements and\nblinking    Knowledge of the Sound System\n• When we know a language, we know what\nsounds (or signs) are used in the language and\nwhich sounds (or signs) are not\n• This also includes knowing how the sounds of\nthe language can be combined\n– Which sounds may start a word\n– Which sounds may end a word\n– Which sounds may follow each other within a word Knowledge of sound system\n• Knowing the sounds of your language also\ninvolves knowing how your face looks ahwen\nyou produce them\n• Mcgurk effect hear da da, but what is\npronounced is ba ba, but lips move to ga ga McGurk effect Knowledge of Words\n• Knowing a language also means identifying\ncertain strings of sounds as meaningful words\n• Most words in all languages are arbitrary\nconnections of sound to meaning\nhand main nsa ruka\n(English) (French) (Twi) (Russian) History of words\n• Knowing a language does not mean we know\nits history or the etymology of words.\n• Many words of English have a common\nancestor with similar words in other languages\n• Languages changes so there will always be\nproto-­‐languages\n• The structure of protolanguages ‘dies’ with its\nspeakers. Ancestral Protolanguages\n• One way we can tell if languages are genetically related\nis if they have a large number of sound correspondences\n– Where an English word begins with an f, the corresponding word\nin French and Spanish begins with a p:\nEnglish \/f\/ French \/p\/ Spanish \/p\/\nfather père padre\nfish poisson pescado\n– From these correspondences, we can hypothesize that Indo-\nEuropean had a \/p\/ since more related languages have the \/p\/\nform, and that at some point the \/p\/ became \/f\/ in the Germanic\ngroup\n– This does not mean that a modern speaker of English has this\nknowledge as part of her gramamar Knowledge of Words\n• The conventional\nand arbitrary\nrelationship\nbetween form and\nmeaning is also\ntrue in sign languages\n:erugiF\nniarB\neht\ntuoba\nlaeveR\nsdnaH\neht\ntahW\n.igulleB\nalusrU\ndna\n,amilK\ndrawdE\n,drawoH\n,renzioP\nmorF\n\"LSC\n&\nLSA\nni 'tcepsus'\ndna\n'rehtaf'\nrof\nsngis\neht\nfo\nsgninaem\ndna\nserutseg\nneewteb\nnoitaler\nyrartibrA\"\nsserP\nTIM\neht\nfo\nnoissimrep\nyb\n,ygolonhceT\nfo\netutitsnI\nsttesuhcassaM\n7891\n©\nthgirypoC Knowledge of Words\n• Sound symbolism: there are some words\nwhose pronunciation seems to reflect the\nmeaning\n– Onomatopoeia:\n• English cock-a-doodle-doo and Finnish kukkokiekuu\n• English gobble gobble and Turkish glu-glu\n– English gl and the concept of sight:\n• glare, glint, gleam, glitter, glossy, glance, glimpse\nbut there is also\n• gladiator, glucose, glory, glutton, globe, etc. Creativity of Linguistic Knowledge\n• Every language has an infinite number of\npossible sentences\n• Knowing a language enables you to:\n– Create a sentence that has never been uttered before\n– Understand a sentence that has never been uttered\nbefore\n• Most sentences we use are new; very few\nsentences are stored in our brains Knowledge of Sentences and\nNonsentences\n• Language is more than a set of words because\nwords must be ordered in certain ways to create\nsentences\n• Our knowledge of language allows us to\nseparate possible sentences from nonsentences\n– What he did was climb a tree\n– *What he thought was want a sports car Linguistic Knowledge and Performance\n• Knowledge: what we know about a language (linguistic\ncompetence)\n– Mostly unconscious knowledge about sounds, structures,\nmeanings, words, and rules for combining linguistic elements\n• Performance: how we use this knowledge in actual\nspeech production and comprehension\n– We can theoretically create an infinitely long sentence, but\nphysical constraints make this impossible\n– In speech we stammer, pause, and produce slips of the tongue What Is Grammar?\n• Grammar = the knowledge speakers have about\nthe units and rules of their language\n– Rules for combining sounds into words, word\nformation, making sentences, assigning meaning\n– When a sentence is ungrammatical in a linguistic\nsense, it means that it breaks the rules of the shared\nmental grammar of the language Descriptive Grammar\n• Descriptive grammar: a true model of the\nmental grammar of language speakers\n– In other words, a descriptive grammar\ndescribes the linguistic rules that people use\nwhen they speak their language\n– The point of view of a descriptive grammarian\nis that grammars from every language and\ndialect are equal Prescriptive Grammar\n• Prescriptive Grammar: attempts to prescribe what rules\nof language people should use to speak “properly”\n– The view of a prescriptive grammarian is that some grammars\nare better than others\n• During the Renaissance, a middle class of English\nspeakers wished to talk like the upper class, so they\nstarted buying handbooks that told them how to speak\n“properly”\n– Bishop Robert Lowth’s A Short Introduction to English Grammar\nwith Critical Notes (1762) Prescriptive Grammar\n• Lowth decided that “two negatives makes a\npositive,” therefore people should not use\ndouble negatives\n– Despite the fact that everybody was already using\ndouble negatives in English (and communication was\njust fine)\n– Despite the fact that many languages of the world\nrequire the use of double negatives Dialects\n• Prescrip)ve Grammars usually argue for a\nstandardized dialect.\n• Regional forms or forms restricted to group\nclass are frowned upon\n• Dialects have grammars\n• Rules are systema)c “ ”\nThe Standard\n• Standard American English (SAE) is the dominant (or prestige)\ndialect in America\n– Nobody actually speaks SAE (it’s an idealization), and it is not defined\nprecisely\n• When a standard is the dialect of the wealthy and powerful, people\nmay be required to speak that dialect in order to get ahead\n• Ross (1954) noticed differences in the speech of British upper class\n(U) and non-upper class (non-U) speakers\n– Non-U speakers wanted to sound U, and U speakers wanted to avoid\nnon-U speech\n– Non-U speakers often hypercorrected, or deviated from the norm\nthought to be “proper English” “ ”\nThe Standard\n• Every dialect is equally expressive, logical, complex, and\nsystematic\n– All dialects represent a set of rules or lexical items in the minds\nof speakers, and any value judgments on dialects are social\njudgments\n• British received pronunciation (RP) omits r in certain\nenvironments and is considered the standard\npronunciation\n• In the American northeast, dialects that omit the r are\nconsidered to be “substandard” and the prestige dialect\nmaintains the r\n– What is considered a prestige dialect has a social basis, not a\nlinguistic one Dialect - Lexical Differences\n• Regional dialects may also differ lexically\n– British: lift American: elevator\n– British: pants American: underpants\n– Boston: tonic Los Angeles: soda\n– Los Angeles: freeway\n– New York: thruway\n– New Jersey: parkway\n– England: motorway Dialect- Phonological\nDifferences\n• There are systematic pronunciation differences\nbetween American and British English\n– For example, Americans put stress on the first syllable\nof a polysyllabic word, and British speakers put the\nstress on the second syllable in words like cigarette,\napplicable, formidable, laboratory\n– Americans may pronounce the first vowel in data as\n[e] or [ei] but vast majority of British speakers would\nonly use [e] Dialect - Syntactic Differences\n• Appalachian English has several syntactic\ndifferences from Standard English\n– Double modals\n• You might should go home.\n• He might could do it.\n– Double objects\n• I caught me a fish.\n– Progressives\n• He came a-runnin’. Teaching Grammar\n• A teaching grammar explicitly states the\nrules of a language and is used to learn\nanother language or dialect.\n– Teaching grammars assume the student\nalready knows one language and then\ncompares the grammar of the new language\nto the one they already know Language Universals\n• Universal Grammar (UG) refers to the universal\nproperties that all languages share\n– Part of a biologically endowed human language\nfaculty\n– The basic blueprint that all languages follow\n• It is a major goal of linguistic theory to discover\nthe nature of UG The Development of Grammar\n• All normal children acquire language relatively quickly\nand easily and without instruction\n• Children learn the world’s languages in the same way\nand pass through the same stages of acquisition\n• If children are born with UG, then they can acquire\nlanguage so quickly and easily because they already\nknow the universal properties of language and only need\nto learn the specific rules of the language(s) they are\nacquiring Sign Languages: Evidence for\nlanguage universals\n• Deaf children exposed to sign languages go\nthrough the same stages of language acquisition\nas hearing babies\n– Deaf children babble with their hands\n– Signed languages are organized in the brain just like\nspoken languages are What Is Not (Human) Language\n• Some features of human language:\n– Discreteness: the ability to combine linguistic units to\nmake larger units of meaning\n– Creativity: the ability to create and understand never-\nbefore-uttered sentences\n– Displacement: the ability to talk about things that are\nnot physically present\n• Allows for discussion of past events, abstract ideas, lying,\netc. What Is Not (Human) Language\n• Parrots can mimic words, but their utterances\ncarry no meaning\n• They cannot dissect words into discrete units\n– Polly and Molly don’t rhyme for a parrot\n• They cannot deduce rules and patterns to create\nnew utterances\n– If the parrot learns “Polly wants a cracker” and “Polly\nwants a doughnut” and learns the word “bagel,” the\nparrot will not say “Polly wants a bagel” What Is Not (Human) Language\n• Birdcalls convey messages associated with the\nimmediate environment\n• Bird songs are used to stake out territory and attract\nmates\n– There is no evidence of internal structure in these songs,\nalthough they may vary to express varying degrees of intensity\n• Birdcalls and songs are similar to human languages in\nthat they contain regional dialects, are passed down\nfrom parents to offspring, and can only be acquired\nbefore a certain age What Is Not (Human) Language\n• Honeybees have a communication system that relies on\ndance to convey information about the location and\nquality of food sources to the rest of the hive\n– Round dance: food source is within 20 feet from the hive\n– Sickle dance: food source is 20 to 60 feet from the hive\n– Tail-wagging dance: food source is more than 60 feet from the\nhive\n• The number of repetitions of the basic pattern in the tail-wagging\ndance indicates the precise distance, with a slower repetition rate\nindicating a longer distance What Is Not (Human) Language\n• The bee dances are theoretically able to\ncreate an infinite number of messages\n– But, the messages are confined to the subject\nof food sources\n– If there are any special circumstances\nregarding the food source, the bee cannot\nconvey that information Can Animals Learn Human\nLanguage?\n• Nonhuman primates have communication\nsystems in the wild to convey information about\nthe immediate environment and emotional state\n(stimulus-response)\n• Humans have attempted to teach human\nlanguage to other primates\n– These nonhuman primates were taught sign\nlanguages because their vocal tracts cannot produce\nthe sounds of human language Can Animals Learn Human\nLanguage?\n• Washoe\n• Koko\n• Nim Chimpsky\n• Sarah, Lana, Sherman, Austin\n• Kanzi\n– Researchers concluded that while nonhuman\nprimates can string two signs together and\nshow flashes of creativity, their use of\nlanguage is nowhere near human linguistic\nability Language and Thought\n• Sapir-Whorf Hypothesis: the theory that the structure of\na language influences how its speakers perceive the\nworld around them\n• Linguistic determinism: the strongest form of the Sapir-\nWhorf hypothesis which claims that the language we\nspeak determines how we perceive the world\n– Whorf claimed that the Hopi people do not perceive time in the\nsame way as speakers of European languages because the\nHopi language does make grammatical distinctions in tense Language and Thought\n• Linguistic relativism: a weaker form of the\nhypothesis which claims that different languages\nencode different categories which can influence\na speaker’s perceptions of the world\n– Navaho: green and blue expressed as one word\n– Russian: siniy (“dark blue”) and goluboy (“light blue”)\n– Zuni: yellow and orange are expressed as one word Language and Thought\n• The strong form of the Sapir-Whorf hypothesis is\nclearly false\n– We can translate between languages\n– We can learn additional languages\n– If we don’t have a particular word for a concept, we\ncan express the concept with a string of words Language and Thought\n• Hopi does have a system for expressing time.\nHopi uses words for days of the week, parts of\nthe day, etc. to express tense rather than using\nword endings like English\n• Although languages differ in their color terms,\nspeakers can perceive differences even if their\nlanguage does not have a word to express the\ndifference Language and Thought\n• Some psychologists have suggested that speakers of\ngender-marking languages think about objects as being\ngendered\n– In Spanish the word “bridge” is masculine (el puente), and\nSpanish speakers described a bridge with masculine adjectives\nsuch as big, dangerous, long, strong, and sturdy\n– In German, the word “bridge” is feminine (die Brücke) and\nGerman speakers described a bridge with feminine adjectives\nsuch as beautiful, elegant, fragile, pretty, and slender\n• This evidence seems to support a weak version of\nlinguistic relativism "}