{"text":"The Science of Reading\nWhat is the Science of Reading?\nThe science of reading refers to a body of research from the fields of education,\ncognitive psychology, developmental psychology, and neuroscience, that explains how\nindividuals learn how to read and best practices for reading instruction1, 2. Recent\nadvances in technology and a greater understanding of neurobiology have allowed\nresearchers and practitioners who work with typical and struggling readers to\nunderstand how reading develops in the brain and the skills that contribute to proficient\nreading. It is important for educators to understand this body of research because it\ndirectly affects how reading is taught and using methods that are not aligned with\nresearch can have a negative impact on students’ reading achievement. As such, the\npurpose of this section of the toolkit is to provide a brief overview of this body of\nresearch and provide additional resources for educators and other practitioners to\nexplore.\nAreas of the Brain Involved in Reading\nA common misconception about reading is that all humans “learn to read in a different\nway.” Although reading is a relatively recent cultural invention, the human brain is not\nprewired to learn to read naturally3. Neurobiological research has demonstrated that\nreading is a complex process that occurs in three different but connected areas of the\nbrain1,4. These three areas work together to help individuals read words:\n• Frontal Lobe – the inferior frontal gyrus in the frontal lobe is responsible for\ngrammatical and speech processing, in addition to information about the sounds\nin words\n• Temporoparietal Area – responsible for processing and storing speech sounds;\nwhere phonemes (sounds) are connected to graphemes (letters); also involved in\nword and sentence meanings\n• Occipitotemporal Area – processes visual information (e.g., letters, words)\nImaging studies, such as fMRI studies, show that these different areas of the brain are\nactivated during reading4. There are two main pathways of the brain that are activated\nduring reading:\n1. Dorsal Pathway – activated during decoding\/sounding out\n2. Ventral Pathway – activated when words are read by sight (i.e., automatically\nwithout sounding out)\nStruggling readers, including students with dyslexia, activate different pathways and\nareas of their brain than proficient readers do, which causes these students to use\nUpd at ed 2\/ 21 other, less efficient, areas of their brain to read words4. Despite this, high-quality\nevidence-based instruction and intervention can actually “rewire” the brains of students\nwith dyslexia so that they can use more efficient areas and pathways to read5.\nThe Simple View of Reading and Scarborough’s Reading Rope\nIn the Simple View of Reading (SVR), reading comprehension is conceptualized as the\nproduct of two component skills: decoding and linguistic comprehension6,7. Decoding, a\nword-level skill, involves rapidly and efficiently retrieving words from memory, and\nlinguistic comprehension consists of the literal and inferential construction and\ninterpretation of the meaning of those words7,8. If an individual is able to decode words,\nbut does not understand what those words mean, then they will not be able to\ncomprehend a text. Conversely, if an individual is able to understand what words mean,\nbut not decode them, they will also not be able to comprehend text. Because many\nstudents with dyslexia have difficulties with decoding, they are likely to have difficulty\ncomprehending text. This does NOT mean that reading is a simple process, only that\ntwo main components (decoding and linguistic comprehension) contribute the most to\noverall reading comprehension. Click here to view an infographic about the Simple View\nof Reading.\nScarborough (2001)9 created a graphic called the “Reading Rope” that depicts the\ncomponents of the SVR. To become a skilled reader, a student must develop increasing\nspeed and accuracy in decoding and linguistic comprehension skills9. Specifically,\nautomatic decoding frees up an individual’s attentional resources so that they can\ncomprehend text. To reach this level of automaticity, students require proper instruction\nthat focuses on mastering decoding skills. Due to copyright reasons, we cannot reprint\nthe graphic in this toolkit; however, click here to view the reading rope and the\nInternational Dyslexia Association’s accompanying explanation.\nWord-Reading and Spelling Development\nIn order for students to be able to accurately and automatically decode words, they\nneed to learn that that writing is a symbolic system used to represent spoken language\nand the smallest units of language (phonemes) are represented by print (also known as\nthe alphabetic principle)10,11. While acquiring the alphabetic principle, individuals\nprogress through several stages of alphabetic decoding, in which they learn to map\nphonemes to graphemes10,12,13. Ehri’s (1998)12 stage model of reading development\ndescribes these progressive stages as follows:\n● Pre-Alphabetic – pre-reading stage where individuals do not make letter-to-sound\nconnections; “reading” is based on visual cues\n● Partial Alphabetic – individuals begin to connect some phonemes to graphemes,\nbut these representations are not complete\nUpd at ed 2\/ 21 ● Full Alphabetic – individuals develop more complete representations of words\nand their phoneme-grapheme relationships\n● Consolidated Alphabetic – individuals have acquired a large bank of words they\ncan read by sight (i.e., automatically and accurately) and now recognize larger\nunits of language in words such as syllables and morphemes\nIndividuals progress through similar stages for spelling11,14; however, spelling is often\nmore difficult for individuals to acquire than word-reading14,15,16,17. Spelling requires\nindividuals to learn to visually identify letters by their shape and to physically produce\nthose shapes11. Proficient spelling also requires individuals to acquire in-depth\nknowledge about the structure of the English language system14. Spelling proficiency is\nacquired by learning about different patterns in words:\n● Phonological (Sound) Patterns – understanding of the sounds in words\n● Graphotactic (Written) Patterns – how words are written or represented in print\n● Morphological (Structure) Patterns – understanding the meanings of words or\nparts of words\nWord-reading is also acquired and enhanced through an individual’s spelling\ndevelopment. As an individual repeatedly associates phonemes to graphemes and\nlarger units of language (i.e., orthographic mapping), these association become\nengrained in the memory and easier to retrieve with automaticity12,13.\nAccurate and Automatic Word-Reading\nAlthough individuals initially learn to read by activating the dorsal pathway in the brain to\ndecode words, the dorsal pathway is slower and less automatic than the ventral\npathway where words are read by sight. There are two key processes necessary for\naccurate and automatic sight-word reading (i.e., proficient word-reading):\n1. connecting a word’s pronunciation to its meaning and spelling; and\n2. connecting a word’s meaning to its spelling, so that it can be read without going\nthrough the phonological system which slows down the process10,13,18.\nProficient word-reading occurs when a word’s pronunciation is associated with its\nmeaning and its written spelling13,14,18. With practice, individuals begin to automatically\nconnect words’ pronunciations, meanings, and spellings and this allows an individual’s\nspeed and accuracy to improve19,20. This also helps individuals bypass the slower and\nless efficient dorsal\/decoding pathway. This allows the cognitive resources (i.e., working\nmemory) to be allocated to reading comprehension21,22,23. If individuals do not become\naccurate and automatic word-readers, then they must constantly rely on the slower\ndorsal pathway to decode words, which can cause difficulties with spelling, word-\nreading, and text comprehension10,20.\nUpd at ed 2\/ 21 Linguistic\/Language Comprehension\nAccurate and automatic word-reading alone is not sufficient for individuals to be able to\ncomprehend text. Proficient reading comprehension also requires the reader to be able\nto comprehend language6. Language comprehension requires in-depth knowledge of\nmorphology, semantics, syntax, background knowledge, verbal reasoning, and literacy\nknowledge3,9. Morphology is the study of the smallest units of language that have\nmeaning (i.e., prefixes, suffixes, roots, base words). Semantics (vocabulary) involves\nthe meaning of words, phrases, and sentences. Syntax includes grammatical structure\nand parts of speech.\nThe Five Components of Reading\nHow does all of this information relate to the five “components” of reading, as identified\nby the National Reading Panel’s (NRP’s) report on reading instruction24? Although the\nNRP identified five “components” of reading instruction from research (phonemic\nawareness, phonics, fluency, vocabulary, and reading comprehension), it is important to\nnote that each of these “components” are highly connected and should not be taught as\ndistinct skills25. For example, phonological awareness, phonics, and word-reading\nfluency are a part of decoding or word-recognition in the SVR, whereas vocabulary is a\npart of linguistic comprehension. These components are typically taught together in a\ncomprehensive literacy program. The five “components” are described below3,24:\n● Phonemic Awareness – the ability to identify, think about, and manipulate the\nsmallest sounds (phonemes) in language\n● Phonics – a method for teaching phoneme-grapheme correspondences for\nreading and spelling\n● Fluency – the ability to read a text accurately, automatically, and with expression\n● Vocabulary – understanding and using words in oral and written language\n● Comprehension – the ultimate goal of reading; understanding what is read\nAdditional Resources about The Science of Reading\nAdditional resources (e.g., books, articles, websites, learning modules) about the\nScience of Reading are available in the Science of Reading Resources section of this\ntoolkit. These resources are not endorsed by the Indiana Department of Education or\nIndiana University.\nUpd at ed 2\/ 21 "}