{"text":"01:615:201\nIntroduction to Linguistic\nTheory\nAdam Szczegielniak\nSyntax: The Sentence\nPatterns of\nLanguage\nCopyright in part: Cengage learning Learning Goals\n• Hierarchical sentence structure\n• Word categories\n• X-­‐bar\n• Ambiguity\n• Recursion\n• Transforma=ons Syntax\n• Any speaker of any human language can produce\nand understand an infinite number of possible\nsentences\n• Thus, we can’t possibly have a mental dictionary\nof all the possible sentences\n• Rather, we have the rules for forming sentences\nstored in our brains\n– Syntax is the part of grammar that pertains to a\nspeaker’s knowledge of sentences and their structures What the Syntax Rules Do\n• The rules of syntax combine words into phrases\nand phrases into sentences\n• They specify the correct word order for a language\n– For example, English is a Subject-Verb-Object (SVO)\nlanguage\n• The President nominated a new Supreme Court justice\n• *President the new Supreme justice Court a nominated\n• They also describe the relationship between the\nmeaning of a group of words and the arrangement\nof the words\n– I mean what I say vs. I say what I mean What the Syntax Rules Do\n• The rules of syntax also specify the grammatical relations of\na sentence, such as the subject and the direct object\n– Your dog chased my cat vs. My cat chased your dog\n• Syntax rules specify constraints on sentences based on the\nverb of the sentence\n*The boy found *Disa slept the baby\n*The boy found in the house Disa slept\nThe boy found the ball Disa slept\nsoundly\nZack believes Robert to be a gentleman\n*Zack believes to be a gentleman\nZack tries to be a gentleman\n*Zack tries Robert to be a gentleman What the Syntax Rules Do\n• Syntax rules also tell us how words form groups and are\nhierarchically ordered in a sentence\n“The captain ordered the old men and women off the ship”\n• This sentence has two possible meanings:\n– 1. The captain ordered the old men and the old women off the ship\n– 2. The captain ordered the old men and the women of any age off the\nship\n• The meanings depend on how the words in the sentence are\ngrouped (specifically, to which words is the adjective ‘old’\napplied?)\n– 1. The captain ordered the [old [men and women]] off the ship\n– 2. The captain ordered the [old men] and [women] off the ship What the Syntax Rules Do\n• These groupings can be shown hierarchically in a tree\n• These trees reveal the structural ambiguity in the phrase “old men\nand women”\n– Each structure corresponds to a different meaning\n• Structurally ambiguous sentences can often be humorous:\n– Catcher: “Watch out for this guy, he’s a great fastball hitter.”\n– Pitcher: “No problem. There’s no way I’ve got a great fastball.” What Grammaticality\nIs Not Based On\n• Grammaticality is not based on prior\nexposure to a sentence\n• Grammaticality is not based on\nmeaningfulness\n• Grammaticality is not based on\ntruthfulness Sentence Structure\n• We could say that the sentence “The child\nfound the puppy” is based on the\ntemplate:\nDet—N—V—Det—N\n– But this would imply that sentences are just\nstrings of words without internal structure\n– This sentence can actually be separated into\nseveral groups:\n• [the child] [found a puppy]\n• [the child] [found [a puppy]]\n• [[the] [child]] [[found] [[a] [puppy]] Sentence Structure\n• A tree diagram can be used to show\nthe hierarchy of the sentence:\nThe child found a puppy Constituents and\nConstituency Tests\n• Constituents are the natural groupings in a\nsentence\n• Tests for constituency include:\n– 1. “stand alone test”: if a group of words can\nstand alone, they form a constituent\n• A: “What did you find?”\n• B: “A puppy.”\n– 2. “replacement by a pronoun”: pronouns can\nreplace constituents\n• A: “Where did you find a puppy?”\n• B: “I found him in the park.” Constituents and\nConstituency Tests\n– 3. “move as a unit” test: If a group of\nwords can be moved together, they are a\nconstituent\n• A: “The child found a puppy.” ! “A puppy\nwas found by the child.” Constituents and\nConstituency Tests\n• Experimental evidence shows that people\nperceive sentences in groupings\ncorresponding to constituents\n• Every sentence has at least one constituent\nstructure\n– If a sentence has more than one constituent\nstructure, then it is ambiguous and each\nconstituent structure corresponds to a different\nmeaning Syntactic Categories\n• A syntactic category is a family of expressions that can substitute\nfor one another without loss of grammaticality\nThe child found a puppy. The child found a puppy.\nA police officer found a puppy. The child ate the cake.\nYour neighbor found a puppy. The child slept.\n• All the underlined groups constitute a syntactic category known as a\nnoun phrase (NP)\n– NPs may be a subject or an object of a sentence, may contain a\ndeterminer, proper name, pronoun, or may be a noun alone\n• All the bolded groups constitute a syntactic category known as a\nverb phrase (VP)\n– VPs must always contain a verb but may also contain other constituents\nsuch as a noun phrase or a prepositional phrase (PP) Syntactic Categories\n• Phrasal categories: NP, VP, PP, AdjP, AdvP\n• Lexical categories:\n– Noun: puppy, girl, soup, happiness, pillow\n– Verb: find, run, sleep, realize, see, want\n– Preposition: up, down, across, into, from, with\n– Adjective: red, big, candid, lucky, large\n– Adverb: again, carefully, luckily, very, fairly\n• Functional categories:\n– Auxiliary: verbs such as have, and be, and modals such as may,\ncan, will, shall, must\n– Determiners: the, a, this, that, those, each, every Phrase Structure Trees\n• The core of every phrase is its head\n– In the VP walk the pugs, the verb walk is the head\n• The phrasal category that may occur next to a head\nand elaborates on the meaning of the head is a\ncomplement\n– In the PP over the river, the NP the river is the\ncomplement\n• Elements preceding the head are specifiers\n– In the NP the fish, the determiner the is the specifier Phrase Structure Trees\n• The internal structure of phrasal\ncategories can be captured using the\nX-bar schema: examples\nThe subject will later in\nSpec-T\nThis should be A Phrase Structure Trees\nPhrase structure (PS) trees show the\ninternal structure of a sentence along with\nsyntactic category information: Phrase Structure Trees\n• In a PS tree, every higher node dominates all the categories beneath it\n– S dominates everything\n• A node immediately dominates\nthe categories directly below it\n• Sisters are categories that are immediately dominated by the same node\n– The V and the NP are sisters Phrase Structure Trees:\nSelection\n• Some heads require a certain type of complement\nand some don’t\n– The verb find requires an NP: Alex found the ball.\n– The verb put requires both an NP and a PP: Alex put the\nball in the toy box.\n– The verb sleep cannot take a complement: Alex slept.\n– The noun belief optionally selects a PP: the belief in\nfreedom of speech.\n– The adjective proud optionally selects a PP: proud of\nherself\n• C-selection or subcategorization refers to the\ninformation about what types of complements a\nhead can or must take Phrase Structure Trees:\nSelection\n• Verbs also select subjects and complements based\non semantic properties (S-selection)\n– The verb murder requires a human subject and object\n!The beer murdered the lamp.\n– The verb drink requires its subject to be animate and its optional\ncomplement object to be liquid\n!The beer drank the lamp.\n• For a sentence to be well-formed, it must conform\nto the structural constraints of PS rules and must\nalso obey the syntactic (C-selection) and semantic\n(S-selection) requirements of the head of each\nphrase Building Phrase Structure Trees\n• Phrase structure rules specify the\nwell-formed structures of a sentence\n– A tree must match the phrase structure\nrules to be grammatical Building Phrase Structure Trees\nThe majority of the senate became afraid of the vice\npresident.\nN\n(9)\nCorrections to the\ntextbook typos are in\nred. Building Phrase Structure Trees\nThe majority of the senate became afraid of the vice\npresident. The Infinity of Language:\nRecursive Rules\n• Recursive rules are rules in which a phrasal category can contain\nitself\n• Recursive rules allow a grammar to generate an infinite number of\nsentences\n– the kindhearted, intelligent,\nhandsome, … boy What Heads the Sentence\n• All sentences contain information about tense—\nwhen a certain event or state of affairs occurred, so\nwe can say that Tense is the head of a sentence\n– So sentences are TPs, with T representing tense markers\nand modals What Heads the Sentence\nThe girl may cry. The child ate. Structural Ambiguities\n• The following sentence has two meanings:\nThe boy saw the man with the telescope.\n• The meanings are:\n– 1. The boy used the telescope to see the man\n– 2. The boy saw the man who had a telescope\n• Each of these meanings can be represented by a different\nphrase structure tree\n– The two interpretations are possible because the PS rules allow\nmore than one structure for the same string of words Structural Ambiguities\n• The boy saw the man\n• The boy used a who had a telescope\ntelescope to see the\nman More Structures\n• Adverbs are modifiers that can specify how (quickly, slowly)\nand when (yesterday, oNen) an event happens\n17. V ! AdvP V 16. V ! V AdvP Transformational Analysis\n• Recognizing that some sentences are related to each other is\nanother part of our syntactic competence\nThe boy is sleeping. Is the boy sleeping?\n• The first sentence is a declarative sentence, meaning that it\nasserts that a particular situation exists\n• The second sentence is a yes-no question, meaning that\nasks for confirmation of a situation\n• The difference in meaning is indicated by different word\norders, which means that certain structural differences\ncorrespond to certain meaning differences\n– For these sentences, the difference lies in where the auxiliary\noccurs in the sentence Transformational Rules\n• Yes-no questions are generated in\ntwo steps:\n– 1. The PS rules generate a declarative\nsentence which represents the basic\nstructure, or deep structure (d-\nstructure) of the sentence\n– 2. A transformational rule then moves\nthe auxiliary before the subject to create\nthe surface structure (s-structure) Transformational Rules\n• Other sentence pairs that involve\ntransformational rules are:\n– Active to passive\n• The cat chased the mouse. ! The mouse was chased\nby the cat.\n– there sentences\n• There was a man on the roof. ! A man was on the\nroof.\n– PP preposing\n• The astronomer saw the quasar with the telescope. !\nWith the telescope, the astronomer saw the quasar. The Structural Dependency of Rules\n• Transformations are structure-dependent, which\nmeans they act on phrase structures without caring\nwhat words are in the structures\n– The Move rule can be applied to any PP as long as it is an\nadjunct to V.\n– Subject-verb agreement stretches across all structures\nbetween the subject and the verb: Yes\/No\n• The forma=on of yes-­‐no ques=ons comes from\nthe transforma=on Move reloca=ng the T from\nthe corresponding declara=ve sentence:\n• The boy will sleep will the boy ___ sleep C takes TP\n• C takes TP as its complement, C can\nhave Q feature, but not always Embedded CP’s\n• CP’s are needed not just for ques=ons:\n– belief that iron floats (NP complement)\n– wonders if iron floats (VP complement)\n– happy that iron floats (AP complement)\n– about whether iron will sink (PP complement) Examples of embedded CP Yes\/No ques=ons T-­‐>C Wh Questions\nExample: What will Max chase?\n• This Wh ques=on is formed in three steps:\n– 1. The PS rules generate a basic declara=ve word order:\nMax will chase what?\n– 2. Move shiNs the word what to the beginning of the\nsentence: What Max will chase?\n– 3. Move shiNs the modal will to occur before the subject\nNP: What will Max chase? Wh-­‐deriva=on Wh-­‐movement Do-­‐inser=on\n• Which toys does Pete like Modals\/ Auxiliaries\n1. Spot has chased a squirrel.\n2. Nellie is snoring.\n• Like the modals, the auxiliaries have and be move to the posi=on\npreceding the subject in both yes-­‐no ques=ons and wh ques=ons.\n3. Has Spot ____ chased a squirrel?\n4. Is Nellie ____ snoring?\n5. What has Spot ____ chased ____?\n• The ques=on is: where do have and be originate in the d-­‐structure?\n• Note that have and be can occur in the same sentence with a modal:\n– Nellie may be snoring.\n– Spot must have found a squirrel. recursive v\n• Our analysis leads us to conclude that have\/\nbe originate under V in a recursive Vd\nstructure,as follows. Tense\/Modal\n• When there is no modal, T is occupied by a\ntense feature, which is realized on have\/be, as\nwould be the case for other verbs like snore: Movement from V-­‐>T-­‐>C\n• What has Spot chased?\n• Here is the d-­‐structure (from the X-­‐bar derived phrase\nstructure rules): V-­‐>T T-­‐>C Wh-­‐move\n• We see that V-­‐>T feeds T-­‐>C, which allows wh\nmove. PS rules – Warning, these are textbook PS rules.\nFor ones recommended by me see my\naddi=onal text\n• 1. S → NP VP\n• 11. AP → Ad\n• 2. NP → Det Nd\n• 12. Ad → A\n• 3. Nd → N\n• 13. Ad → A PP\n• 4. VP → Vd\n• 14. Nd → A Nd\n• 5. Vd → V NP\n• 15. Ad → Int Ad\n• 6. Vd→ V PP\n• 16. Vd → Vd PP\n• 7. Vd → V AP\n• 17. Nd → Nd PP\n• 8. Nd → N PP\n• 18. Vd → AdvP Vd\n• 9. PP → Pd\n• 19. Vd → Vd Adv\n• 10. Pd → P NP\n• P20. Vd → V VP UG Principles and Parameters\n• Universal Grammar (UG) provides the basic\ndesign for all languages, and each language\nhas its own parameters, or variations on\nthe basic plan\n– All languages have structures that conform to X-\nbar schema\n– All phrases consist of specifiers, heads, and\ncomplements\n– All sentences are headed by T\n– All languages seem to have movement rules\n– However, languages have different word orders\nwithin phrases and sentences, so heads and\ncomplements may be present in different orders\nacross languages Sign Language Syntax\n• The syntax of sign languages also follow\nthe principles of UG and has:\n– Auxiliaries\n– Transformations such as topicalization, which\nmoves the direct object to the beginning of a\nsentence for emphasis, and wh movement\n– Constraints on transformations\n• That UG is present in signed languages and\nspoken languages shows that the human\nbrain is designed to learn language, not just\nspeech. "}