{"text":"CHAPTER\n1\nTHE RIGHT WAY\nTO WRITE\nSometimes, the words we use when we speak aren’t\neffective when we use them in writing. This chapter\ndiscusses the difference between spoken and written\nEnglish, informal language, wordiness, and precise\nlanguage.\nGrammar concepts to know:\n• colloquial [ka LOW kwee ‘l], colloquialism [ka\nLOW kwee ‘l izm]—an informal word or phrase\nused in conversation, but not appropriate for busi-\nness communication or other formal writing\n• active voice—a sentence in which the subject\n(underlined) is performing the action of the verb\n(John read the letter.)\n• passive voice—a sentence in which the subject\n(underlined) receives the action of the verb (The\nletter was read by John.)\nWritten language makes a permanent impres-\nsion,one that can’t be changed by rephrasing the words the way you can\nin a conversation.That’s why it’s important to think carefully before you write.Take\na look at the note on the following page.What kind ofan impression will it make?\n1 GRAMMAR ESSENTIALS\nManny,\nGot your note today.Thought I’d get right back to you.Keep you from\ngetting in a tizzy about this whole moving thing.It’s still kinda early to\npack stuff for the move cause the new building isn’t even done yet.\nMight as well wait til it is.\nSeems like Jack has been chosen by the top dogs to head up the\nentire moving process with all its various aspects.Due to the fact that\nhe hasn’t started doing a thing yet,there’s no sense in the rest ofus\ngetting panicky about it.Don’t freak out;it’ll get done.\nJ.C.\nSPOKEN ENGLISH VERSUS WRITTEN ENGLISH\nMany of the speaking patterns we use are not suitable in business writing.For\nexample,ifyou listen to a conversation,you might hear incomplete sentences,sud-\nden subject changes, or abbreviated versions of words and phrases.Although\nthese expressions are common in casual conversation,they are confusing and inap-\npropriate when you are writing to a customer,supervisor,or employer.Avoid these\nthings in written communication.\nIncomplete Sentences\nQuite often,we use fragments when we speak.We count on our tone ofvoice and\nour expression or the reaction ofthe listener to fill in the spaces.In writing,this\nisn’t possible,so it’s important to write complete sentences that express complete\nthoughts.See Chapter 3 to learn how to avoid sentence fragments.\nSudden Subject Changes\nIn everyday conversation,we switch subjects easily.Two speakers can exchange far\nmore information in two minutes than a reader can absorb in the same time\nperiod.That’s why it’s important to use the reader’s time efficiently.Switching sub-\njects requires time and mental energy.Write everything you have to say about one\nsubject before moving on to the next.Link subjects together to make it easier for\na reader to go from one idea to another.See Chapter 15 on making subjects agree\nwith verbs.\n2 THE RIGHT WAY TO WRITE\nAbbreviated Words\nMany words we use in conversation are not used when we write.Following is a list\nofwords frequently used in speech;however,the written versions are different.\nSpoken Version Written Version\ncause,cuz because\ncoulda could have\ngonna going to\nhafta have to\nkinda kind of\nshoulda should have\nsorta sort of\ntil until\nwanna want to\nwoulda would have\nSymbols instead of Words\nDon’t use symbols in place of words,even if it seems simpler or more efficient.\nWrite out the complete word in any written communication if you want to be\ntaken seriously.\nfour (not 4)\nto,too,two (not 2)\nand (not &)\nextra (not x-tra)\nCOLLOQUIALISMS [ka LOW kwee ‘I izmz]\n• • • •\nColloquialisms are informal words and phrases such asin a bind,pulled it off,real\ngood, etc. These words and phrases are widely used in conversations between\nfriends,but in business writing,they portray an attitude offamiliarity that may\ncause your message to be taken less seriously than you intended or even insult your\nreader.A friendly,colloquial tone is fine in a personal letter;however,a more for-\nmal tone is better for business communication. Compare the following para-\ngraphs.Ifyou received these two memos from your employees,which would you\ntake more seriously?\nWe’re really in a bind on our end. Seems like every time we turn\naround something else comes up.Today was one ofthose days.A few\n3 GRAMMAR ESSENTIALS\nofthe guys who decided to live it up last night couldn’t get over it this\nmorning.Since we were shorthanded,we didn’t come close to our\ndaily quota.This is really ticking me off.\nWe’re having trouble meeting our quota as new problems keep arising.\nToday was a difficult day because several employees who stayed out late\nlast night were unable to make it to work on time. Because we were\nshorthanded,we missed our quota.This is extremely upsetting.\nThe following sets ofsentences illustrate the difference between colloquial\nand standard diction.The colloquial sentences in the first column are rewritten\nin the second column using more standard language.\nColloquial Standard\nThe car works real good. The car works well.\nBen got sick ofwaiting. Bentiredofwaiting.\nI’m awful thirsty. I’m very (or quite or extremely)\nthirsty.\nIt looks like they’ll be late. It looks as if (or as though) they’ll\nbe late.\nThe cake was real good. The cake was very(or quite) good.\nWe’re in a bind. We’re in trouble.\nDrew put it offtill tomorrow. Drew postponedit until tomorrow.\nI don’t have that much ofa chance. I don’t have a very goodchance.\nRosa got there in time. Rosa arrivedin time.\nJill got the order. Jill receivedthe order.\nI like to pal around with her. I like to spend timewith her.\nKip got the wrong idea across. Kip conveyedthe wrong idea.\nI just don’t get it. I just don’t understand.\nHow come you’re leaving? Whyare you leaving?\nWhat for? Why?\nI see where you’re coming from. I understand your point.\nLeah had one ofthose days. Leah had a difficultday.\nRodney can’t make up his mind. Rodney can’t decide.\nRobin will keep an eye on things. Robin will watchthings.\nThey’re going to live it up tonight. They’re going to celebrate tonight.\nThe Knicks pulled it off. The Knicks succeeded.\n4 THE RIGHT WAY TO WRITE\nWORDINESS\nNot only do extra words waste space and time,but they may also distort the mes-\nsage or make it difficult to understand.Get in the habit ofstreamlining your writ-\ning,making your sentences as concise as possible.Ifyou use five words where three\nwould do,delete the extra words or structure your sentences to avoid them.Read\nthe following examples.\nWordy:It was a twenty-minute period oftime after the accident had\noccurred when the emergency vehicles arrived to lend assistance.\n[21 words]\nRevised:The emergency vehicles arrived twenty minutes after the\naccident.[9 words]\nWordy:It was decided that the club would organize a committee\nfor the purpose of conducting a search for a new chairperson.\n[21 words]\nRevised:The club organized a committee to search for a new chair-\nperson.[11 words]\nThe additional words add no information.All they do is take up space.\nBuzzwords and Fluff\nBuzzwords are words that sound important but don’t add much meaning to\nwriting.They include words such asaspect,element,factor,scope,situation,type,\nkind,and forms.Fluffwords such asabsolutely,definitely,really,very,important,sig-\nnificant,current,major,quite,etc.,also may add length to a sentence,but like buzz-\nwords,they seldom add meaning.\nWordy:The nature of the scheduling system is a very important\nmatter that can definitely have a really significant impact on the\nmorale aspect of an employee’s attitude. Aspects of our current\nscheduling policy make it absolutely necessary that we undergo a sig-\nnificant change.\nRevised:The scheduling system can affect employee morale.Our\npolicy needs to be changed.\n5 GRAMMAR ESSENTIALS\nWordy Phrases\nThe following table lists several phrases that can be reduced to one or two words.\nWordy Concise\npuzzling in nature puzzling\nofa peculiar kind peculiar\nat this point in time now,today\nat that point in time then\nregardless ofthe fact that although\ndue to the fact that because\nin order to to\nby means of by\nofan indefinite nature indefinite\nexhibits a tendency to tends to\nconcerning the matter of about\nin connection with with\nin the event that if\nin relation to with\nSome wordiness is created by using the passive voice.In theactive voice,the\nsubject ofa sentence is the source ofthe action in the sentence.In the passive voice,\nthe subject receives the action.\nPassive:Jeffand Dara were rejected by the board because they did\nnot meet all ofthe requirements outlined in the guidelines.\nActive:The board rejected Jeffand Dara because they did not meet\nall ofthe requirements outlined in the guidelines.\nPassive:The non-profit agency was not given funds by the founda-\ntion this year due to a lack ofprivate donations.\nActive:Due to a lack of private donations,the foundation did not\ngive the non-profit agency any funds this year.\n6 THE RIGHT WAY TO WRITE\nWriters sometimes stretch their sentences by using unnecessary words.The\nfollowing table illustrates stretched sentences rewritten to be more concise.\nStretched Sentence Concise Sentence\nAlex seems to be impatient. Alex seems impatient.\nWe must know what it is that we We must know what we’re doing.\nare doing.\nThese requests will be considered by us We’ll consider these requests\non an individual basis. individually.\nThe musicians, who were distressed, The distressed musicians left the hall.\nleft the hall.\nThere are new problems arising daily. New problems arise daily.\nDue to the fact that we were early,we We came early and found great seats.\nfound great seats.\nThe consideration given in the latest My last evaluation was not fair.\nevaluation is an example ofhow I was\ntreated unfairly.\nPRECISE LANGUAGE\nWork to make your writing as precise as possible.In doing so,you will commu-\nnicate your meaning more effectively while using fewer words.In other words,you\nwill make your writing more concise. Choose words to help you transmit an\nexact meaning.\n7 GRAMMAR ESSENTIALS\nImprecise Precise\nHomer managed the project. Homer organized the staffand moni-\ntored their progress.\nMelody doesn’t handle people well. Melody yells at and insults coworkers.\nRichard can relate to Patty. Richard understands Patty’s position.\nThis is a good proposal. This proposal explains the problem\nand suggests a solution.\nThese bad instructions confused me. These disorganized,vague instructions\nleft me with no idea how to fix the stool.\nWe had a nice time with you. We enjoyed eating, chatting, and\nswimming at your house.\nI always have trouble with this I can never get this truck started.\nmachine.\nI like to have fun at the company I like to eat,mingle,and play games\npicnic. at the company picnic.\nWe need to clean up before we go. We need to put away the supplies and\nshower before we go.\nREVIEW\nRemember the memo at the beginning ofthis chapter? Go back and read\nit again.Try to rewrite it by revising colloquial and informal language,\neliminating wordiness, and using precise language.You can do this in\nmany ways.Then turn back to this page and read the memo below as an\nexample ofone way ofrewriting it.\nDear Manny,\nI’m replying to your note about packing to move to the new building.\nJack is in charge of organizing the entire process.However,since the\nbuilding is not yet finished,he hasn’t started the process yet.I’m sure that\nif we’re patient,everything will turn out fine.Don’t worry.I’ll let you\nknow as soon as Jack begins work on the move.\nJ.C.\n8  CHAPTER 2 GRAMMAR IQ QUIZ\nTell whether the following sentences are compound or complex.Answers\nand explanations follow the quiz.\n1. After I peeled the potatoes,Marcus cut them into small pieces for the\nstew.\n2. I ordered the cheesecake,and Toya ordered the ice cream sundae.\n3. Erika designed the house,and Paul furnished it.\n4. Every time I hear that song,I think ofmy birthday party.\n5. I wanted to go swimming,but Alec preferred to play tennis.\nAnswers\n1. complex—the sentence contains a dependent clause (After I peeled the\npotatoes) and an independent clause (Marcus cut them into small\npieces for the stew).\n2. compound—the sentence contains two independent clauses\n(I ordered the cheesecake.Toya ordered the ice cream sundae.).\n3. compound—the sentence contains two independent clauses (Erika\ndesigned the house.Paul furnished it.).\n4. complex—the sentence contains a dependent clause (Every time I\nhear that song) and an independent clause (I think of my birthday\nparty).\n5. compound—the sentence contains two independent clauses\n(I wanted to go swimming.Alec preferred to play tennis.). CHAPTER\n2\nWHAT IS A\nSENTENCE,\nANYWAY?\nThis chapter teaches you about the basic unit of\ncommunication in the English language: the sen-\ntence. Mastering this chapter will give you the key to\nmastering everything else in this book—and in your\nwriting!\nGrammar concepts to know:\n• subject—the part of a sentence that names the\nperson, thing, or idea\n• predicate—the part of a sentence that contains\n“the verb that tells”\n• clause—a groups of words with a subject and a\npredicate\n• independent clause—a clause that can stand\nalone and express a complete thought\n• dependent clause—a clause that needs an inde-\npendent clause to complete its meaning\n• complex sentence—a sentence containing an\nindependent clause and a dependent clause\n• compound sentence—a sentence containing\ntwo or more independent clauses\nA sentence is the basic unit of thought in the\nEnglish language.This chapter will help you learn to write a complete,\ncoherent sentence.\n11 GRAMMAR ESSENTIALS\nTHE PARTS OF A SENTENCE\nA sentence has both a subject and a predicate and expresses a complete thought.\nFor example,read the following.\nThe snow is falling.\nThis is a sentence because it names a thing (snow) and tells us something about\nit (that it is falling).It also expresses a complete thought.\nThe Subject\nThe part of the sentence that names the person,thing,or idea is called thesub-\nject.The subject can be one word or several words.The complete subjectconsists\nofthe person,thing,or idea and all ofits modifiers,such as adjectives and adverbs.\nThe complete subjects are highlighted in each ofthe following sentences.\nA loud argumentbroke out at the game.\nThe young,worried pilot read the storm warning.\nThe newspaper articlementioned our newest menu item.\nEvery complete subject contains a simple subject.The simple subject,which\nis a noun or pronoun,is the most important word in the complete subject.It is\nthe word that names the person,thing,or idea the sentence is about.Look at the\ncomplete subjects highlighted in the previous sentences.Which word is the most\nimportant in each complete subject? The simple subjects are highlighted below.\nA loud argument\nThe worried,young pilot\nThe newspaper article\nPractice\nRead the following sentences.In each one,underline the complete subject.Then\ncircle the simple subject,or the person,thing,or idea the sentence is about.At the\nend ofthe chapter,you will find the complete subjects,with the simple subjects\nin bold.\n1.My severe stomachache seemed better at the doctor’s office.\n2.Our new mail carrier slipped on the ice this morning.\n3.The longest,dreariest road lies between the Nebraska borders.\n12 WHAT IS A SENTENCE, ANYWAY?\nThe Predicate\nThe part ofthe sentence that contains the verb that explains something about the\nsubject is called the predicate.The predicate can be one word or several words.\nThe complete predicate consists ofthe verb and all ofits modifiers.The complete\npredicates are highlighted in each ofthe following sentences.\nA loud argument broke out at the game.\nThe young,worried pilot read the storm warning.\nThe newspaper article mentioned our newest menu item.\nMrs.Dawson is our most difficult customer.\nMy neighbor rarely complains about snow.\nEvery complete predicate also contains a simple predicate,or verb.The sim-\nple predicate is the word that shows action or helps to make a statement about the\nsubject. Look at the complete predicates highlighted in the sentences above.\nWhich word shows action or helps to make the statement about the subject? The\nsimple predicates are highlighted below.\nbrokeout at the game\nreadthe storm warning\nmentionedour newest menu item\nisour most difficult customer\nrarely complainsabout snow\nPractice\nRead the following sentences. In each one, underline the complete predicate.\nThen circle the simple predicate,or the word that shows action or helps to make\na statement about the subject.At the end ofthe chapter,you will find the complete\npredicates,with the simple predicates in bold.\n4.The purple curtain ripped at the seams.\n5.Our president always buys some ofour competitor’s products.\n6.Dotted print backgrounds are difficult to read.\nCOMPOUND SUBJECTS AND PREDICATES\nA sentence can have more than one subject joined by and,or,or nor that shares\nthe same verb.This is called a compound subject.The compound subjects are\nhighlighted in the following examples.\n13 GRAMMAR ESSENTIALS\nHoraceandBethboth asked for a promotion.\nHannahand Terriare the shift supervisors in this department.\nA sentence can also have a compound predicate: more than one simple\npredicate that shares the same subject.The predicates may be joined by and,or,\nor nor.\nDimitri wrotea letter and sentit to the personnel department.\nHorace called his supervisor and asked for a meeting.\nCLAUSES\nLike sentences,clausesare groups of words thathave a subject and a predicate.\nClauses are either independentor dependent.\nIndependent Clauses\nIndependent clauses are groups of words in a sentence that can stand alone,\nbecause they express a complete thought.The simple sentence consists of one\nindependent clause:\nThe snow is falling.\nSometimes,more than one independent clause is included in the same sentence,\nwhich is known as a compound sentence.When this happens,the clauses are sep-\narated by a comma and a conjunction,or joining word (and,but,or,for,nor,so,\nyet).The independent clauses are underlined in the following sentences.\nI gave her good advice,and she took it.\nMy dentist pulled my wisdom teeth, but it didn't hurt as badly as I\nthought it would.\nI don't like brussels sprouts,and my sister doesn't either.\nDependent Clauses\nDependent clauses,also known as subordinate clauses,are groups ofwords in a\nsentence that have a subject and predicate but can’t stand alone because they don’t\nexpress a complete thought.They are dependent on independent clauses.\nWhen I saw the snow was falling\n14 WHAT IS A SENTENCE, ANYWAY?\nAn independent clause can complete the thought:\nWhen I saw the snow falling,I went to get my snow shovel.\nSometimes,sentences are made up of one independent clause and one or more\ndependent clauses.These are known as complex sentences.In the following sen-\ntence,the independent clause is in bold and the dependent clause is underlined.\nI put on my heavy coatwhen I saw the snow was falling.\nPractice\nUnderline the independent clauses in the following sentences.Check your work\nwith the answers that follow.\n7.Believing that the pages were in the right order,I mailed the manuscript.\n8.Even though I couldn’t afford the house anymore,Iwanted to renew my lease\non it.\n9.Whenever the weather forecasters predict rain,the sun shines.\n10.In the box sitting underneath the desk,I found my hat.\n11.I called Tom again,and the new programs finally arrived.\n12.I went for a walk today,and I mailed your letter.\nAnswers\n1.My severe stomachache\n2.Our new mail carrier\n3.The longest,dreariest road\n4.ripped at the seams\n5.always buys some ofour competitor’s products\n6.are difficult to read\n7.Believing that the pages were in the right order,I mailed the manuscript.\n8.Even though I couldn’t afford the house anymore,Iwanted to renew my lease\non it.\n9.Whenever the weather forecasters predict rain,the sun shines.\n10.In the box sitting underneath the desk,I found my hat.\n11.I called Tom again,and the new programs finally arrived.\n12.I went for a walk today,and I mailed your letter.\n15 CHAPTER 3 GRAMMAR IQ QUIZ\nDetermine whether the following groups ofwords are sentences or fragments.Answers and\nexplanations follow the quiz.\n1. Across the street.\n2. Stringing her new tennis racquet.\n3. A small studio with a view ofthe park.\n4. Ori received the highest grade on the math final.\n5. Although it had already started to rain.\nAnswers\n1. fragment—the group ofwords contains neither a subject nor a verb.\n2. fragment—the group ofwords contains no subject.\n3. fragment—the group ofwords contains no verb.\n4. sentence—the group ofwords contains a subject (Ori) and a verb (received).\n5. fragment—although the group of words contains a subject (it) and a verb (had\nstarted),the word Althoughmakes it a dependent clause that does not express a com-\nplete thought. CHAPTER\n3\nFILLING OUT\nSENTENCE\nFRAGMENTS\nDon’t stop. Before the sentence is done. Sentence\nfragments—incomplete sentences—are popular tools\nfor advertisers, but they have no place in your writ-\ning for work or school. By the time you finish this\nchapter, you’ll be able to recognize and correct\nincomplete sentences in your writing.\nGrammar concepts to know:\n• fragment—a group of words, punctuated as a\nsentence, that does not express a complete\nthought\n• subordinating conjunction—a joining word that\ncreates a dependent clause\nIn the English language, we write in complete\nsentences because they accurately communicate our ideas. A well-\nwritten sentence leaves little room for confusion.The memo on the following page\nis nearly impossible to understand because the writer uses incomplete sentences,\nor sentence fragments,rather than complete sentences.Bob has no idea what Bart\nneeds.\n17 GRAMMAR ESSENTIALS\nBob,\nCan’t get this to work.Think it’s got something wrong with the alter-\nnator.Been a problem already.You remember.Can you fix this? Need\nit before the convention next week.\nBart\nREVIEW\nIn the last chapter,you learned that independent clauses can stand alone,while\ndependent clauses can’t stand alone because they do not express a complete\nthought.Sometimes,dependent clauses are mistakenly used in the place ofcom-\nplete sentences.When this happens,they are considered sentence fragments.Any\ngroup ofwords that is punctuated as a sentence but does not express a complete\nthought is called a sentence fragment.\nDEPENDENT CLAUSES AS SENTENCE FRAGMENTS\nA dependent,or subordinate,clause cannot stand by itselfas a sentence;it needs\nan independent clause to support it.Read the following groups of words.Even\nthough they contain a subject and a verb,their meaning is incomplete.The sub-\nject in each dependent clause is in bold,and the verb is underlined.\nBefore wewenton to the next project\nWhenever this companychangesits policies\nIfthe roadistoo icy for traffic\nRead the following examples carefully.They illustrate the difference between\nan independent clause and a dependent clause.The subjects are highlighted and\nthe verbs are underlined in each example.\nIleftan hour later than normal.(Independent clause:sentence)\nIfIleftan hour later than normal (Dependent clause:fragment)\nWhen our groupfinishedits report (Dependent clause:fragment)\nOur groupfinishedits report.(Independent clause:sentence)\nWhenever Ritatriedto explain herself(Dependent clause:fragment)\nRitatriedto explain herself.(Independent clause:sentence)\n18 FILLING OUT SENTENCE FRAGMENTS\nSubordinating Conjunctions\nAgain,read the previous examples carefully.Notice that each dependent clause is\nlonger than the independent clause.The groups of words are the same,but the\ndependent clauses have an extra word at the beginning.These words are called\nsubordinating conjunctions,because they modify a dependent,or subordinate,\nclause in some way;and join it with a dependent clause.\nIf a group of words that would normally be a complete sentence is pre-\nceded by a subordinating conjunction,something more is needed to complete\nthe thought. In the sentences that follow, each of those fragments has been\nrewritten to express a complete thought.Notice that each sentence now has both\nan independent and a dependent clause.The dependent clauses are in bold and\nthe independent clauses are underlined in each sentence.\nIfI left an hour later than normal,I missed my favorite talk show.\nWhen our group finished its report,we left for lunch.\nWhenever Rita tried to explain herself,she confused her words.\nHere is a list of some of the words that can be used as subordinating\nconjunctions:\nafter if though where\nalthough once unless wherever\nas since until while\nbecause than when\nbefore that whenever\nSometimes,a subordinating conjunction is a phrase rather than a single word:\nas ifshe could read my mind\nas thoughhe had been playing for years\nas long ashe can figure this out\nas soon asthey get here\neven though it is getting dark\nin order tolearn another language\nso thatyou can spend a semester abroad\nMake complete sentences out ofthe following fragments by adding an inde-\npendent clause to each subordinate clause:\nWhen the mayor runs for re-election,\n19 GRAMMAR ESSENTIALS\nAlthough it seems complicated,\nWhile I was doing my homework,\nPHRASES AS SENTENCE FRAGMENTS\nDependent clauses are only one type of sentence fragment.Read the following\nword groups.In each pair choose the group of words that expresses a complete\nthought.The other group ofwords in each pair is a fragment.See ifyou notice any\nsimilarities among the groups ofwords that are fragments.\nThe class was ready for the next step.\nAccording to the teacher.\nWatching the sky.\nThe picnickers saw the air show.\nVisiting for the first time in years.\nI greeted my grandmother.\nEmily sat on the sofa.\nWondering what to do next.\nThese fragments are made up ofphrases:groups ofwords that do not con-\ntain a subject or a predicate and do not complete a thought.Combining the two\nsets ofwords in each pair will make one complete sentence.With some ofthe word\npairs,only a comma is needed.With others,a few extra words must be added to\nincorporate the phrase into the rest of the sentence. The following examples\ndemonstrate how this is done.\nAccording to the teacher,the class was ready for the next step.\nWatching the sky,the picnickers saw the air show.\nSince she was visiting for the first time in years, I greeted my\ngrandmother.\nEmily sat on the sofa,wondering what to do next.\nPractice\nCombine the following word pairs into a complete sentence.Check your work with\nthe corrected sentences at the end of the chapter.Often,there is more than one\nway to combine the word groups.\n20 FILLING OUT SENTENCE FRAGMENTS\n1.The next train will be arriving.Five minutes from now.\n2.Not liking it one bit.Jane ate the casserole.\n3.They used a fog machine to create the effect ofsmoke.One from an Army\nsurplus store.\n4.Send your news on letterhead stationery.To represent your company.\n5.Not long before the last witness had testified.The judge ran out ofpatience.\nSeparated Fragments\nSometimes,a fragment is part ofa complete sentence,but it is written as a sepa-\nrate sentence.Read each ofthe following word groups.In each pair,one is a com-\nplete sentence;the other is a fragment.See if you can decide which word group\nexpresses a complete thought.\nThe fans drove all over the downtown area.\nAnd looked for a parking spot.\nAnd noticed an old classmate in the crowd scene.\nWe saw the movie.\nFaulty equipment and poor workmanship.\nThey refused to pay the bill in full.\nIn the pond outside our building.\nCanadian geese have built a nest.\nThe following set ofwords in bold represent a complete sentence.Combin-\ning the two sets ofwords in each pair makes both sets part ofa complete sentence.\nTry combining the examples yourself.\nThe fans drove all over the downtown area.\nAnd looked for a parking spot.\nAnd noticed an old classmate in the crowd scene.\nWe saw the movie.\nFaulty equipment and poor workmanship.\nThey refused to pay the bill in full.\nIn the pond outside our building.\nCanadian geese have built a nest.\n21 GRAMMAR ESSENTIALS\nCombined Sentences\nThere’s more than one way to combine sentences,but here’s one.\nThe fans drove all over the downtown area and looked for a parking spot.\nWe saw the movie and noticed an old classmate in the crowd scene.\nThey refused to pay the bill in full because offaulty equipment and poor\nworkmanship.\nIn the pond outside our building,Canadian geese have built a nest.\nREVIEW\nRead each ofthe following word groups.Ifthe word group is a sentence,identify\nthe subject(s) and the verb(s).Ifthe word group is a fragment,think ofa way to\nmake it into a complete sentence.Check your work with the answers at the end\nofthe chapter.\n6.Wishing he were almost anywhere else.\n7.In the end,it made no difference at all.\n8.That camping outside would be fun.\n9.Before the part stops working completely.\n10.The unidentified man looked like a reporter.\nGo back to Bart’s memo at the beginning ofthe chapter.Here are the facts\nconcerning Bart’s situation.\n• Bart is part ofthe grounds crew for a convention center.\n• Bart regularly uses a riding lawn mower.\n• The mower broke down three weeks ago.\n• Bob sent the mower to be fixed.\n• The alternator was replaced with a rebuilt one.\n• The biggest event ofthe year is scheduled to begin in eight days.\n• The grounds need to look “perfect.”\n• Bart needs a working mower to do his job.\n• The mower will not start.\n• When the mower is jump-started,the battery does not charge.\n22 FILLING OUT SENTENCE FRAGMENTS\nTry rewriting Bart’s memo.Compare your version to this one.\nBob,\nThe riding lawn mower we put a rebuilt alternator into three weeks ago\nisn’t starting.When we jump-start it,the battery doesn’t charge.I think\nthe alternator is broken again.We need this fixed right away if we’re\ngoing to be ready for the convention next week.Would you please see\nthat the mower gets fixed? Thank you.\nBart\nAnswers\nKeep in mind that there are many ways to correct a fragment.In some answers,\nonly one is printed.In the answers to sentences 7 and 10,the subjects have been\nbolded and the verbs underlined.\n1.The next train will be arriving five minutes from now.\nFive minutes from now,the next train will be arriving.\n2.Not liking it one bit,Jane ate the casserole.\nJane ate the casserole,not liking it one bit.\n3.They used a fog machine from an Army surplus store to create the effect of\nsmoke.\n4.Send your news on letterhead stationery to represent your company.\n5.The judge ran out ofpatience not long before the last witness had testified.\nNot long before the last witness had testified,the judge ran out ofpatience.\n6.Wishing he were almost anywhere else,Steve moaned and hung his head.\n7.Sentence.In the end,itmadeno difference at all.\n8.The Kern family thought that camping outside would be fun.\n9.Before the part stops working completely,we should order a replacement.\n10.Sentence.The unidentified manlookedlike a reporter.\n23 CHAPTER 4 GRAMMAR IQ QUIZ\nAdd punctuation marks wherever needed in the following sentences.You may also need to\ncapitalize a word in some ofthe sentences.Answers follow the quiz.\n1.Mavis delivered the package it arrived a day ahead ofschedule.\n2.Scott was running late the traffic was unusually heavy.\n3.The electricians finished on time however they overspent their budget.\n4.You’ll need to reorganize these files otherwise we’ll never be able to find anything.\n5.Beverly needed some advice she was at the end ofher rope.\nAnswers\n1.Mavis delivered the package.It arrived a day ahead ofschedule.\nor\nMavis delivered the package;it arrived a day ahead ofschedule.\n2.Scott was running late.The traffic was unusually heavy.\nor\nScott was running late;the traffic was unusually heavy.\n3.The electricians finished on time;however,they overspent their budget.\nor\nThe electricians finished on time.However,they overspent their budget.\n4.You’ll need to reorganize these files;otherwise,we’ll never be able to find anything.\nor\nYou’ll need to reorganize these files.Otherwise,we’ll never be able to find anything.\n5.Beverly needed some advice.She was at the end ofher rope.\nor\nBeverly needed some advice;she was at the end ofher rope. CHAPTER\n4\nPUTTING A STOP\nTO GOING ON\nAND ON\nThis chapter explains how to spot two problems that\ncan keep people from understanding what you write:\nrun-on sentences and comma splices. This chapter\nshows you how to correct and avoid both of these\nproblems.\nGrammar concepts to know:\n• run-on sentence—independent clauses that run\ntogether without punctuation\n• comma splice—only a comma separates two\nindependent clauses (a semicolon or a comma fol-\nlowed by a conjunction are required)\n• conjunctive adverb—an adverb, such as\nhoweveror therefore, that expresses a relationship\nbetween clauses\nHave you heard any of the radio or TVadver-\ntisements that use speed speakers,those people who can utter four or five\nsentences in five seconds? What they say is difficult for a listener to understand\nbecause there is no pause in the sound.The same thing can happen in writing.\nRead the memo on the following page.Although you can probably understand\nwhat it says,doing so will not be easy.In fact,you may need to read the memo sev-\neral times to figure out its meaning.\n25 GRAMMAR ESSENTIALS\nTo:Arlis Schaffer\nFrom:Gerald Lentz\nRe:New floor buffer\nDate:March 5,2006\nThe buffer we got last week from Holton Supply has a few problems it\ndoesn’t always start when you flip the switch and it seems a little hesi-\ntant like it loses power every once in a while when I’m running it also\nthe pads that came with it don’t fit exactly right they are about an inch\ntoo small when the machine runs the outside part of it is not covered\nand often scratches the floor that’s not good because it takes me forever\nto work out the scratches that the machine is supposed to avoid mak-\ning instead ofsaving me time this machine is costing me more time.We\nneed someone to look at the switch and we need to order the right size\npads and it wouldn’t hurt to see ifthey can find anything else wrong with\nthis machine I just don’t trust it.\nThis memo is hard to understand because some ofthe sentences “run on”with-\nout a break.We call these run-on sentences.This chapter shows you how to avoid\nand correct run-on sentences when you write.\nRUN-ON SENTENCES\nAs you know,an independent clause is a group ofwords that could be a complete\nsentence on its own.In a run-on sentence,independent clauses are run together\nas one sentence without being separated by any punctuation (a period,semicolon,\nor comma).\nThe best way to avoid run-on sentences is to practice writing simple sentences,\neach explaining one thought.When you finish explaining one thought,end the sen-\ntence.Your sentences will be very short,but they will also be easy to understand.\nSanjay packed the suitcase.\nOded loaded the car.\nSandra drove through the storm.\nJake unloaded the luggage.\n26 PUTTING A STOP TO GOING ON AND ON\nQuite often,more than one idea must be presented in a sentence.As dis-\ncussed in Chapter 2,this kind ofsentence,which is called a compound sentence,\nis made up of two or more independent clauses. When written correctly, the\nclauses are separated by conjunctions and\/or punctuation.The sentences that fol-\nlow contain more than one independent clause,but the clauses have been run\ntogether without words or punctuation.This makes them run-on sentences.\nLissie moved to the suburbs she still kept in touch with her friends in the\ncity.\nMy paycheck this week is more than I thought it would be now I can buy\nthe computer I've been wanting.\nI started a new exercise regime a month ago I've lost three and a half\npounds already.\nAll three ofthese examples can be corrected quite easily in one offour ways:\n1. By adding a period and a capital letter,making two simple sentences.\nLissie moved to the suburbs.She still kept in touch with her friends in\nthe city.\nMy paycheck this week is more than I thought it would be.Now I can buy\nthe computer I've been wanting.\nI started a new exercise regime a month ago.I've lost three and a half\npounds already.\n2. By adding a comma and a conjunction (and,but,or,for,nor,yet,so).\nLissie moved to the suburbs,but she still kept in touch with her friends\nin the city.\nMy paycheck this week is more than I thought it would be,so now I can\nbuy the computer I've been wanting.\nI started a new exercise regime a month ago,and I've lost three and a half\npounds already.\n3. By adding a semicolon.\nLissie moved to the suburbs;she still kept in touch with her friends in the\ncity.\nMy paycheck this week is more than I thought it would be;now I can buy\nthe computer I've been wanting.\nI started a new exercise regime a month ago; I've lost three and a half\npounds already.\n27 GRAMMAR ESSENTIALS\n4. By turning one ofthe two independent clauses into a dependent clause.To do\nthis,you need to add a subordinating conjunction where it best fits in the sen-\ntence and reword the sentence,ifnecessary.Refer to the list ofsubordinating\nconjunctions from the last chapter to refresh your memory.\nAlthoughshe moved to the suburbs,Lissie still kept in touch with her\nfriends in the city.\nLissie still kept in touch with her friends in the city althoughshe moved\nto the suburbs.\nSincemy paycheck this week is more than I thought it would be,now I\ncan buy the computer I've been wanting.\nNow I can buy the computer I've been wanting sincemy paycheck this\nweek is more than I thought it would be.\nBecauseI started a new exercise regime a month ago,I've lost three and\na halfpounds already.\nI've lost three and a halfpounds already becauseI started a new exercise\nregime a month ago.\nIn these examples,all three sentences have been rewritten in two ways:by\nputting the dependent clause at the beginning of the sentence and by putting it\nat the end.Notice how ifthe dependent clause comes first,it is set offby a comma.\nNo comma is needed ifthe dependent clause follows the independent clause.\nPractice\nLook at each ofthe following run-on sentences.Correct them so they are no longer\nrun-on.Check your work with the answers at the end ofthe chapter.\n1.The personnel director gave us bonus checks the president shook our hands.\n2.Evelyn signed the work order she gave it to the secretary.\n3.Sam listens to music when he works it relaxes him.\n4.Barry took the short cut he ended up lost.\n5.My sweatshirt was ruined I spilled grape juice on it.\n28 PUTTING A STOP TO GOING ON AND ON\nCOMMA SPLICES\nAnother kind ofproblem sentence,called a commasplice,is unclear for the reader\nbecause only a comma is used to separate two independent clauses.\nMr.Klein is bald,his wife has long frizzy hair.\nJacob did the raking,Matthew did the mowing.\nWeldon bought the groceries,Nancy cooked dinner.\nComma splices can be fixed in the same ways that run-on sentences can.\n1. Separate independent clauses with a comma and a conjunction (and,but,\nso,or,for,nor,yet).\nMr.Klein is bald,but his wife has long frizzy hair.\nJacob did the raking,and Matthew did the mowing.\nWeldon bought the groceries,so Nancy cooked dinner.\n2. Separate independent clauses with a semicolon.\nMr.Klein is bald;his wife has long frizzy hair.\nJacob did the raking;Matthew did the mowing.\nWeldon bought the groceries;Nancy cooked dinner.\n3. Separate the two clauses into two sentences by replacing the comma with\na period and by adding a capital letter.\nMr.Klein is bald.His wife has long frizzy hair.\nJacob did the raking.Matthew did the mowing.\nWeldon bought the groceries.Nancy cooked dinner.\n4. Turn one ofthe clauses into a dependent clause by adding a subordinating\nconjunction,ifit makes sense to do so.\nWhile Mr.Klein is bald,his wife has long frizzy hair.\nBecause Jacob did the raking,Matthew did the mowing.\nAfter Weldon bought the groceries,Nancy cooked dinner.\n29 GRAMMAR ESSENTIALS\nPractice\nRead the sentences with comma splices that follow.Correct them so that each\nis a correctly written sentence.Check your work with the answers at the end of\nthe chapter.\n6.Henry lives across the street,he has been there for twenty-five years.\n7.Mary heads the search committee,John is the recorder.\n8.Sid gave demonstrations all summer long,he returned in the fall.\n9.Mary posted the work schedule,Peter requested a change.\n10.Kent brought the problem to our attention,we fixed it immediately.\nCONJUNCTIVE ADVERBS\nSome run-on sentences and commas splices are created by using words such as\nhowever,therefore,and then as though they were conjunctions.\nI wanted a new sports car however my bank account wouldn’t support\none.\nMy sister Dorothy thought she was cheated, therefore, she wanted\nher money back.\nWe stopped for lunch then we got back to work.\nUnlike conjunctions,which simply join words together,words such as how-\never,therefore,andthenare a special kind ofadverbthat expresses a relationship\nbetween clauses.This kind ofadverb,called a conjunctive adverb,cannot join two\nindependent clauses the way a conjunction does.\nTo correct this kind ofcomma splice or run-on,make two sentences,or put\na semicolon between the two main clauses and set the adverb offfrom the rest of\nthe clause with a comma.Note that you can move the adverb around within its\nclause without changing the meaning—which is how you can tell the difference\nbetween a conjunctive adverb and a subordinate conjunction. You can move\nhowever around in its clause,but you can’t move because around in its clause.\nI wanted a new sports car.However,my bank account wouldn’t support\none.\nI wanted a new sports car;however,my bank account wouldn’t support\none.\nI wanted a new sports car;my bank account,however,wouldn’t support\none.\n30 PUTTING A STOP TO GOING ON AND ON\nMy sister Dorothy thought she was cheated. She therefore wanted\nher money back.\nMy sister Dorothy thought she was cheated; therefore, she wanted\nher money back.\nMy sister Dorothy thought she was cheated; she therefore wanted\nher money back\nWe stopped for lunch.Then we got back to work.\nWe stopped for lunch;then we got back to work.\nWe stopped for lunch.We then got back to work.\nPractice\nUse what you have learned about commas and semicolons to correct the follow-\ning sentences.Check your work with the answers at the end ofthe chapter.\n11.These microscope cases are falling apart the lenses ofthese microscopes how-\never are very durable.\n12.Maribeth’s coat was in the cloakroom however she had left an hour ago.\n13.A drug test is not required for this job the central office will need your\nfingerprints however.\nRemember the memo from the beginning ofthe chapter? Go back to it and cor-\nrect the run-on sentences.Compare your version with the one printed here.\nTo:Arlis Schaffer\nFrom:Gerald Lentz\nRe:New floor buffer\nDate:March 5,1997\nThe buffer we got last week from Holton Supply has a few problems.It\ndoesn’t always start up when you flip the switch,and it seems a little hes-\nitant.It loses power every once in a while when I’m running it.Also,the\npads that came with it don’t fit exactly right.They are about an inch too\nsmall.When the machine runs,the outside part ofit is not covered,so\nit often scratches the floor.That’s not good because it takes me forever\nto work out the scratches that the machine is supposed to avoid mak-\ning.Instead ofsaving me time,this machine is costing me more time.\nWe need someone to look at the switch,and we need to order the right\nsize pads.It wouldn’t hurt to see if they can find anything else wrong\nwith this machine.I just don’t trust it.\n31 GRAMMAR ESSENTIALS\nREVIEW\nHere is an opportunity to practice what you have learned about complete sen-\ntences,sentence fragments,run-ons,and comma splices.In each ofthe following\nnumbered items,decide whether the group ofwords is a correctly written sentence\nor sentences. Ifit is not,rewrite it to make it correct.Check your version with the\nones given at the end ofthe chapter.\n14.Mr.France introduced me to the speaker.A neighbor ofhis.\n15.Last night my supervisor called.To ask me ifI could stay an extra three hours\ntoday.\n16.I like the new batch of chemicals,they keep mildew from forming on wet\nsurfaces.\n17.I looked in my mailbox.Hoping to find my paycheck.\n18.I saw it.The key I had lost.\n19.After I had read the entire manual.\n20.Jeremy filled the order,it arrived at the warehouse around noon.\n21.Ilya locked the doors we left the building.\n22.Our surveillance system has cut down on shoplifting.\n23.Lying on the floor next to the coffee table.\nAnswers\n1.The personnel director gave us bonus checks. The president shook our\nhands.\nThe personnel director gave us bonus checks,and the president shook our\nhands.\nThe personnel director gave us bonus checks while the president shook our\nhands.\n2.Evelyn signed the work order.She gave it to the secretary.\nEvelyn signed the work order,and she gave it to the secretary.\nEvelyn signed the work order before she gave it to the secretary.\n3.Sam listens to music when he works.It relaxes him.\nSam listens to music when he works,and it relaxes him.\nSam listens to music when he works because it relaxes him.\n4.Barry took the short cut.He ended up lost.\nBarry took the short cut,and he ended up lost.\nBecause Barry took the short cut,he ended up lost.\n5.My sweatshirt was ruined.I spilled grape juice on it.\nI spilled grape juice on my sweatshirt,and it was ruined.\nMy sweatshirt was ruined because I spilled grape juice on it.\n32 PUTTING A STOP TO GOING ON AND ON\n6.Henry lives across the street;he has been there for twenty-five years.\nHenry lives across the street,and he has been there for twenty-five years.\nHenry lives across the street.He has been there for twenty-five years.\n(This is an example of a situation where adding a subordinating conjunc-\ntion would not make sense.)\n7.Mary heads the search committee;John is the recorder.\nMary heads the search committee,and John is the recorder.\nMary heads the search committee.John is the recorder.\nWhile Mary heads the search committee,John is the recorder.\n8.Sid gave demonstrations all summer long;he returned in the fall.\nSid gave demonstrations all summer long,and he returned in the fall.\nSid gave demonstrations all summer long.He returned in the summer.\nAfter Sid gave demonstrations all summer long,he returned in the summer.\n9.Mary posted the work schedule;Peter requested a change.\nMary posted the work schedule,and Peter requested a change.\nMary posted the work schedule.Peter requested a change.\nAfter Mary posted the work schedule,Peter requested a change.\n10.Kent brought the problem to our attention;we fixed it immediately.\nKent brought the problem to our attention,and we fixed it immediately.\nKent brought the problem to our attention.We fixed it immediately.\nWhen Kent brought the problem to our attention,we fixed it immediately.\n11.These microscope cases are falling apart;the lenses of these microscopes,\nhowever,are very durable.\n12.Maribeth’s coat was in the cloakroom;however,she had left an hour ago.\n13.A drug test is not required for this job; the central office will need your\nfingerprints,however.\n14.Mr.France introduced me to the speaker,a neighbor ofhis.\n15.Last night my supervisor called to ask me if I could stay an extra three\nhours today.\n16. I like the new batch of chemicals; they keep mildew from forming on\nwet surfaces.\nI like the new batch of chemicals because they keep mildew from forming\non wet surfaces.\n17.I looked in my mailbox,hoping to find my paycheck.\n18.I saw it,the key I had lost.\n19.After I had read the entire manual, I understood how to operate the\nequipment.\n20.Jeremy filled the order.It arrived at the warehouse around noon.\nJeremy filled the order when it arrived at the warehouse around noon.\n33 GRAMMAR ESSENTIALS\n21.Ilya locked the doors.We left the building.\nIlya locked the doors,and we left the building.\nIlya locked the doors after we left the building.\n22.Sentence\n23.We found the lost catalog lying on the floor next to the coffee table.\n34  CHAPTER 5 GRAMMAR IQ QUIZ\nPlace an end mark (period,question mark,exclamation point) after each ofthe following\nsentences.Add capital letters wherever they are needed.Answers follow the quiz.\n1.henry drives a jeep cherokee and works at nelson manufacturing\n2.when did president bush climb aboard air force one and fly to washington,dc\n3.next year the math course i will be taking is called industrial math applications\n4.did you know that my uncle harry sold his car to aunt edna\n5.how nice ofmr.bosselman to accommodate our wishes to move to 345 ingersoll avenue\nAnswers\n1.Henry drives a Jeep Cherokee and works at Nelson Manufacturing.\n2.When did President Bush climb aboard Air Force One and fly to Washington,D.C.?\n3.Next year,the math course I will be taking is called Industrial Math Applications.\n4.Did you know that my uncle Harry sold his car to Aunt Edna?\n5.How nice of Mr. Bosselman to accommodate our wishes to move to 345 Ingersoll\nAvenue! CHAPTER\n5\nGOOD\nBEGINNINGS,\nG0OD ENDINGS\nNow that you know what a sentence is, it’s a good\nidea to review how to begin and end one. This chap-\nter shows you how to use capital letters—and not only\nthose at the beginnings of sentences—as well as\nperiods, question marks, and exclamation points.\nGrammar concepts to know:\n• proper noun—the name of a particular person,\nplace, or thing\n• proper adjective—an adjective (a word that\ndescribes) derived from a proper noun\nCapital letters are necessary beginnings—not\nonly for sentences,but also for all kinds ofwords.Periods are sometimes\nnecessary endings,not only for most sentences,but also for abbreviations and\nother uses.Question marks and exclamation points,too,are necessary in some sen-\ntences,and can provide a little spice to your writing.This chapter helps you mas-\nter capitalization and punctuation.\n37 GRAMMAR ESSENTIALS\nRead this memo from Mike:\nI need a New router and a Band saw.Wards has them on sale this week.\nA skil saw would be nice sometimes one isn’t enough since there are\nthree ofus who use it.Black and decker is also okay? Ifyou want,I can\npick them up at the store for you.\nMike\nWhat exactly does Mike want? The first sentence makes it clear that he\nwants a router and a saw.The rest of the memo leads to nothing but questions:\nDoes he want a band saw made by Skil,or a circular saw (sometimes called a skill\nsaw) by Band? This confusion comes up because Mike hasn’t punctuated his\nmemo properly or put capital letters where they belong.\nCAPITAL LETTERS\nGeneral Capitalization Rules\nHere are some rules for capitalization.\n• Capitalize the first word ofa sentence.Ifthe first word is a number,write\nit as a word.\nThis is my favorite dish.\nFour people showed up to volunteer.\n• Capitalize the pronoun Ior any contraction made using I(I’m,I’d,I’ve,I’ll).\nThe professor told me that Ineeded to take a prerequisite before taking\nhis class.\nShe thought that I'ddecide to move to California.\nIknow I'llbe ready for this exam.\n• Capitalize proper nouns,but not common nouns.\nA proper noun refers to a specific person,place,or thing.A common\nnoun refers to a general class of people,places,or things.For example,\nmicrowaveis a common noun.It is the general name for a kitchen appli-\nance.However,Sharp is a proper noun because it names a specific brand\nofmicrowave.Proper nouns are capitalized;common nouns are not.\n38 GOOD BEGINNINGS, GOOD ENDINGS\nProper Nouns Common Nouns\nTom uncle\nGeorgia state\nCharleston Memorial hospital\nLabradorRetriever dog\nDell computer\n• Capitalize the first word ofa quotation.\n“When will you be finished?”\nMy new neighbor said “Good morning,”as I approached the door.\n“Good morning!”I answered,somewhat surprised.“You must be Sylvia.”\n• Do not capitalize the first word ofa partial quotation.\nHe called her “the best problem solver alive.”\n“The new edition,”Ari explained,“will be available in two months.”\nPractice\nCheck your knowledge ofthese rules with the following sentences.Circle the let-\nters that should be capitalized in each sentence.Make a diagonal mark through\nthe letters that are capitalized,but should not be.Check your work with the cor-\nrect versions ofsentences at the end ofthe chapter.The changes are bolded for you.\n1.the instructions were clear.after a careful reading,i could understand them\ncompletely.\n2.“what do you think you’re doing?”my Uncle jack asked.\n3.“i’m putting together this gas grill,”i answered.\n4.the newspaper said our new owner was “An industrial visionary.”\n5.my new Car is a ford mustang.\nProper Nouns\nAll proper nouns—words that name a specific person,place,or thing—must\nbe capitalized.Remembering which nouns are proper can be difficult.The table\nthat follows includes the most common categories of proper nouns.\n39 GRAMMAR ESSENTIALS\nCategory of Proper Nouns Example\ndays ofthe week Sunday,Tuesday\nmonths March,April\nholidays Easter,Passover\nhistorical events,periods,documents Revolutionary War (event)\nMiddle Ages (period)\nU.S.Constitution (document)\nspecial events,calendar events Chili Cook-Off\nMother’s Day\nMemorial Day\nnames ofpeople and places Steven Jones,Kennedy Center,Empire\nState Building\nnames ofstructures,buildings Lincoln Memorial,Travelers Building\nnames of trains,ships,aircraft,other Queen Elizabeth,Discovery,Northern\nmodes oftransportation Pacific,Vanguard Airlines\nnames ofproducts Dial soap,Jeep Cherokee\nnames ofofficials Senator Kennedy,President Bush\nworks ofart and literature Tobacco Road (book)\n“Harlem”(poem)\nethnic groups,races,languages, Italian American, Asian, German,\nnationalities Spanish\ncities,states,and governmental units Sioux City, Iowa; Anchorage,Alaska;\nRepublic ofChina\nstreets,highways,and roads Locust Avenue,Interstate 80,Havelin\nBoulevard\nlandmarks and geographical locations Rocky Mountains,International Date\nLine\npublic areas and bodies ofwater Chippewa Forest,Raccoon River\ninstitutions,organizations,and Luther College,Rotary Club,\nbusinesses Bellwether Ford\nPractice\nUsing these rules,circle the letters that should be capitalized in each of the fol-\nlowing sentences.Make a diagonal mark through any letters that are capitalized,\nbut should not be.Check your work with the corrected versions ofthe sentences\nat the end ofthe chapter.The changes are in bold for you in the answers.\n40 GOOD BEGINNINGS, GOOD ENDINGS\n6.shakespeare was the most prolific author ofthe renaissance.\n7.the nelsons spent thanksgiving Day with Relatives.\n8.andy began work on thursday,april 3.\n9.my Friend jon has two Nephews who fought in iraq\n10. Additional Security guards will be hired for the white stripes concert.\n11.The convention group caught the amtrak in omaha.\n12.Ling applied for admission to the university ofIowa.\n13.In canada,some citizens speak french,and others speak english.\n14.We followed the colorado river to the border ofarizona.\n15.Ammar works for apex construction company.\nProper Adjectives\nAn adjective is a word that describes or tells us more about a person,place,or\nthing.A proper adjective is derived from a proper noun.Many proper adjectives\nrefer to a nationality.Most proper adjectives should be capitalized,such as Eng-\nlish muffin,Polish sausage,andFrench customs.\nPractice\nCircle the letters that should be capitalized in the following sentences.Check your\nwork with the corrected versions ofthe sentences at the end ofthe chapter.The\nchanges are bolded for you.\n16. Amasu prefers italian dressing on her salad.\n17.When I win the lottery,I intend to buy a polynesian island.\n18.We were delayed at the canadian border.\nWhen Not to Capitalize\n• Avoid unnecessarily capitalizing compass directions.However,direction\nwords that refer to a specific area of the country should be capitalized.\nDirection words are not capitalized unless they specifically refer to a part\nofthe country.\nWe headed east to avoid the storm.\nThe computer industry flourished in the West.\n• Avoid unnecessarily capitalizing words that refer to family members.Cap-\nitalize them only ifthey are used as names.\nAlthough Aunt Matilda has arrived,my other aunts are late.\nAfter my mother lectured me,Father grounded me.\n41 GRAMMAR ESSENTIALS\nLook closely at the second example.If a word such as my,our,your,\nhis,her,or theircomes before the word that refers to a family member,it is\nnot capitalized.The wordmother is not capitalized because the word my\ncomes before it. However, no such word comes before Father. In fact,\nFatheris used in place ofthe man’s name,making it a proper name.That\nis why it is capitalized.\n• Avoid unnecessarily capitalizing the seasons ofthe year or parts ofthe aca-\ndemic year.\nThe university offers Basic Computing 405 in the spring semester.\nMarge plants her perennials in the early fall.\n• Avoid unnecessarily capitalizing school subjects.They should be capitalized\nonly ifthey are part ofthe name ofa specific course.\nI try to avoid science courses because I’m squeamish.\nNyrupama is taking Biology II next semester.\n• Avoid unnecessarily capitalizing words modified by proper adjectives.\nPolish sausage,not Polish Sausage\nItalian restaurant,not Italian Restaurant\nPractice\nUsing these rules,circle the letters that should be capitalized in each of the fol-\nlowing sentences.Make a diagonal mark through any letters that are capitalized\nbut should not be.Check your work with the corrected versions ofthe sentences\nat the end ofthe chapter.The changes are bolded for you.\n19.The great plains are located in the midwest.\n20.Cynthia turned West at the stop sign.\n21.Ifmy Cousin Kathy comes to the picnic,I know aunt Jan won’t.\n22.Jacob is an outstanding History student.\n23.We went to a sri lankan Restaurant in minneapolis.\n42 GOOD BEGINNINGS, GOOD ENDINGS\nEND PUNCTUATION\nWhen to Use Question Marks\nUse a question mark after a word or a group ofwords that asks a question.\nWhy?\nReally?\nWhere did you get your hair cut?\nWhat time does he get home?\nSentences that begin with these words are usually questions:\nwho where\nwhat why\nwhen how\nWhen to Use Periods\n• Use a period at the end ofa sentence that makes a statement.\nMany jobs require a working knowledge ofcomputers.\nThomas Jefferson is the most famous American slave owner.\nThe tour bus leaves right after breakfast in the morning.\n• Use a period at the end ofsentence that makes a request,gives an instruc-\ntion,or states a command.\nTake this to the mailbox before you leave.\nOpen the cover,remove item B,and close the box.\nCheck the message board before you go home.\n• Use a period—not a question mark—at the end ofa sentence that asks an\nindirect question.\nMy boss asked ifI had seen her coat.(indirect question)\nHave you seen my coat? (direct question)\nHayden wanted to know how we knew what to do.(indirect question)\nHow did you know what to do? (direct question)\n43 GRAMMAR ESSENTIALS\nRachel asked ifI would help her.(indirect question)\nWill you help me? (direct question)\nPractice\nPlace a period or a question mark at the end ofeach ofthese sentences.Check your\nwork with the corrected versions ofthe sentences at the end ofthe chapter.The\nchanges are bolded for you.\n24. Cyril asked me to find the new order that arrived today\n25. Do you think we’ll be finished by the end ofthe day\n26.Today is colder than yesterday\n27.When do you plan to order the supplies we need\n28.Leave the packages on the counter by the window\nOther Uses for Periods\n• Use a period (also called a decimalpoint) before a decimal.\nA gallon equals 3.875 liters.\nOnly 5.6% ofour employees chose vision care.\n• Use a period between dollars and cents.\nThe new paneling costs $45.95 a sheet.\nDo you have $4.50 that I can borrow?\n• Use a period after an initial in a personal name.\nThe patient in room 202 is Ron P.Martel.\nThe book was written by J.R.R.Tolkien.\nA.J.Foyt races cars.\n• Use a period after an abbreviation.\nThe plane leaves at 3:17 on Jan.1.\nSmith Bros.is hiring subcontractors for this job.\nThe apt. complex at the corner of Woodland Ave. and 1st St. belongs\nto me.\nWhen Not to Use Periods\n• If an abbreviation comes at the end of a sentence, only one period is\nneeded.\n44 GOOD BEGINNINGS, GOOD ENDINGS\nWe delivered the desk to Koch & Co.\nThis trailer was machined at Dee Zee Inc.\nThe box is 3 in.by 5 in.\n• Ifan abbreviation has become a commonly used name for something,no\nperiod is needed.\ngym (gymnasium)\nexam (examination)\nauto (automobile)\n• If an abbreviation has become an acronym,or a name widely recognized\nby its initials (TV,WHO,FBI,NATO,NASA),no period is needed.\nVelma is scheduled for an MRI at 3:00 this afternoon.\nThe Smiths mailed their tax forms to the IRS.\nMy niece works for the CIA.\nPractice\nUse what you know about periods to correct these sentences.Check your sen-\ntences with the corrected sentences at the end of the chapter. The changes are\nbolded for you.\n29. The plane left Omaha,Neb,and arrived at Tampa Bay,Fl,at 2:23\n30.Mr Drish and Dr P M Staplin left for the convention this morning\n31.The patients’rooms measured 14 ft by 17 ft\n32.I sold my used CD for $3 99\n33.Go ahead Explain what you mean\nWhen to Use Exclamation Points\n• Use an exclamation point after an outcry or sentence that expresses strong\nfeeling.\nYou're kidding!\nOh,no!\nThat's unbelievable!\nBe careful!\nWarning! Exclamation points are a little bit like salt on food.Be careful not to\noverdo them.\n45 GRAMMAR ESSENTIALS\n• Use an exclamation point after an exclamation that begins with a question\nword (who,what,when,where,why,how) but doesn’t ask a question.\nHow forgetful I am!\nWhat a lot oftrouble for such a small result!\nPractice\nUse what you know about questions marks,periods,and exclamation points to\ncorrect these sentences.Check your work with the corrected versions ofthe sen-\ntences at the end ofthe chapter.The changes are bolded for you.\n34.Help! I can’t breathe?\n35.I got my income tax forms in the mail today!\n36.Will you check this order for me.\n37.Those plumbers? Do you know what they did!\n38.I’m amazed at how quickly she moved?\nREVIEW\nRemember the memo from Mike at the beginning ofthe chapter? He rewrote it\nusing proper capitalization and endmarks. Now his supervisor knows exactly\nwhat he wants.\nI need a new router and a band saw.Sometimes,one saw isn’t enough\nsince there are three of us who use it.A Skil saw would be nice.Black\nand Decker is also okay.Wards has them on sale this week.Ifyou want,\nI can pick them up at the store for you.\nMike\nAnswers\n1.The instructions were clear. After a careful reading, I could understand\nthem completely.\n2.“What do you think you’re doing?”my uncle Jack asked.\n3.“I’m putting together this gas grill,”Ianswered.\n4.The newspaper said our new owner was “an industrial visionary.”\n46 GOOD BEGINNINGS, GOOD ENDINGS\n5.My new car is a Ford Mustang.\n6.Shakespeare was the most prolific author ofthe Renaissance.\n7.The Nelsons spent Thanksgiving Day with relatives.\n8.Andy began work on Thursday,April 3.\n9.My friend Jon has two nephews who fought in Iraq.\n10.Additional security guards will be hired for the White Stripes concert.\n11.The convention group caught the Amtrak in Omaha.\n12.Ling applied for admission to the University ofIowa.\n13.In Canada,some citizens speak French,and others speak English.\n14.We followed the Colorado River to the border ofArizona.\n15.Ammar works for Apex Construction Company.\n16.Amasu prefers Italian dressing on her salad.\n17.When I win the lottery,I intend to buy a Polynesian island.\n18.We were delayed at the Canadian border.\n19.The Great Plains are located in the Midwest.\n20.Cynthia turned west at the stop sign.\n21.Ifmy cousin Kathy comes to the picnic,I know Aunt Jan won’t.\n22.Jacob is an outstanding history student.\n23.We went to a Sri Lankan restaurant in Minneapolis.\n24.Cyril asked me to find the new order that arrived today.\n25.Do you think we’ll be finished by the end ofthe day?\n26.Today is colder than yesterday.\n27.When do you plan to order the supplies we need?\n28.Leave the packages on the counter by the window.\n29.The plane left Omaha,Neb.,and arrived at Tampa Bay,Fl.,at 2:23.\n30.Mr.Drish and Dr.P.M.Staplin left for the convention this morning.\n31.The patients’rooms measured 14 ft.by 17 ft.\n32.I sold my used CD for $3.99.\n33.Go ahead.Explain what you mean.\n34.Help! I can’t breathe!\n35.I got my income tax forms in the mail today.\n36.Will you check this order for me?\n37.Those plumbers! Do you know what they did?\n38.I’m amazed at how quickly she moved!\n47 CHAPTER 6 GRAMMAR IQ QUIZ\nAdd commas where they are needed in the following sentences.Answers and explanations\nfollow the quiz.\n1.Discouraged Sari decided to wait until next year to retake the exam.\n2.Enjoying himselfJulio decided to stay at the party.\n3.As long as she is president ofthe committee your job is safe.\n4.My dessert crème Brule was not as good as when I make it at home.\n5.The dog that is blind in one eye is the one I want to adopt.\n6.Ahmed who studied international relations in college wants to go into politics.\nAnswers\n1.Discouraged, Sari decided to wait until next year to retake the exam. (sets off an\nintroductory word)\n2.Enjoying himself,Julio decided to stay at the party.(sets offan introductory phrase)\n3.As long as she is president ofthe committee,your job is safe.(sets offan introductory\nclause)\n4.My dessert, crème Brule, was not as good as when I make it at home. (sets off a\nnonessential explaining phrase)\n5.The dog that is blind in one eye is the one I want to adopt.(No comma needed—the\nclause is essential to the meaning ofthe sentence.)\n6.Ahmed,who studied international relations in college,wants to go into politics.(sets\noffa nonessential clause) CHAPTER\n6\nCOMMA SENSE\nCommas are like road signs. They give us direction,\ntell us where to pause, and make information clear to\nus. This chapter explains some of the ways to use\ncommas in sentences.\nGrammar concepts to know:\n• essential clause—a dependent clause necessary\nto the basic meaning of a sentence; removing the\nclause would alter the meaning of the sentence\n• nonessential clause—a dependent clause that is\nnot necessary to the basic meaning of a sentence;\nremoving it would not cause the meaning of the\nsentence to change\nThis chapter shows how to use commas to\nseparate different parts of sentences. (As you go through this chapter,\nremember what you have already learned about sentences,fragments,run-ons,and\ncomma splices.) You will learn how to use commas to set offintroductory sentence\nparts,explaining phrases,and nonessential clauses.\n49 GRAMMAR ESSENTIALS\nSETTING OFF INTRODUCTORY SENTENCE PARTS\nUse a comma to set offintroductory words,phrases,and clauses from the main part\nofa sentence.A comma keeps the reader from accidentally attaching the introductory\nportion to the main part of the sentence,then having to go back and reread the\nsentence.In other words,commas following introductory elements will save the\nreader time and reduce the chances of misinterpreting what is written.Read the\nexamples that follow to see how introductory words,phrases,and clauses are set off\nwith commas.\n• Words\nRelieved,I gathered my things and left for the day.\nSurprised,I backed into a table.\nAmazed,the doctor revised his patient’s medication.\n• Phrases\nHoping for the best,we checked our findings.\nBadly injured in the accident,Steve was hospitalized for three months.\nFooled by the pitch,the batter missed the ball.\n• Clauses\nWhen he called me,I was in the middle ofcooking dinner.\nAlthough it was hot outside,I still cooked a barbecue.\nSince we arrived late,we decided to skip dinner.\nIntroductory clauses are dependent clauses because they cannot stand alone.\nIn the clause examples above, the dependent clause is followed by a comma\nbecause it is introducing the rest ofthe sentence.Ifthe two parts ofeach ofthese\nsentences were reversed, the sentence would still make sense. However, if you\nreverse the sentence parts,placing the dependent clause at the end,you do not need\na comma.\nI was in the middle ofcooking dinner when he called me.\nI still cooked a barbecue although it was hot outside.\nWe decided to skip dinner since we arrived late.\n50 COMMA SENSE\nPractice\nUse what you know about commas to correct these sentences.Check your work\nwith the corrected versions at the end ofthe chapter.The changes are bolded for you.\n1.Concerned about his future Brad went back to school.\n2.Soaking in the stainless-steel sink his shirt looked doomed.\n3.I gathered all the supplies,before I started work this morning.\n4.By repairing the equipment ourselves we saved several days.\n5.Ecstatic the coach hugged the referee.\n6.I will remember how to assemble this vacuum,as long as I have the directions.\n7.As far as I know the guests in that room checked out an hour ago.\n8.Outside the yard was covered with flowers.\n9.After running the horses returned to the barn.\n10.During the night time drags on and on.\n11.As he watched the clock slowly ticked away the seconds.\nSETTING OFF EXPLAINING PHRASES\nAn explaining phraseis a word or group ofwords that immediately follows a noun\nor pronoun.The phrase makes the noun or pronoun clearer or more definite by\nexplaining or identifying it.(An explaining phrase is also called an appositive.) If\nthe explaining phrase is not essential to the meaning ofthe sentence,it is set off\nby commas,as in the following examples.Look at these examples.The explain-\ning phrases have been bolded.\nMindy Wilcox ordered dinner,a thick filet with steamed vegetables.\nMelanie Hicklin,our company nurse,will give flu shots tomorrow.\nThe keynote speaker is Mary Swenson,director ofthe Animal Rescue\nLeague.\nSometimes, an identifying proper noun will precede or follow a common\nnoun.Ifthe proper noun is necessary to identify the person,place,or thing,it is not\nset offby commas.However,ifthe person can be identified without the proper noun,\nthen the proper noun is surrounded by commas.\nMy brother,David,farms and ranches in South Dakota.\nThe shock rocker Marilyn Mansonperformed at the Civic Center.\nThe vice-president,Dick Cheney,visited the flood site.\n51 GRAMMAR ESSENTIALS\nWhenever information not essential to the meaning ofa sentence is added,\nthat information is set offby commas.Look closely at the first example.The pres-\nence of commas tells us that the writer has only one brother.Davidis set off by\ncommas because brotheris enough information to identify the subject.The name\nDavid simply adds additional information.However,in the second example,we\nknow that more than one shock rocker exists since the name Marilyn Manson is\nnot set offby commas.\nPractice\nUse what you have learned to add commas to the following sentences.Check your\nwork with the answers at the end ofthe chapter.The changes are bolded for you.\n12.Air quality a major urban problem has steadily improved over the last few\nyears.\n13.Walter the featured artist delivered a stunning presentation.\n14.Sharon spends Friday evenings at the movies an event she looks forward to\nall week.\n15.Ms.Mason the route manager always leaves the papers at the corner.\n16.The two sisters Kim and Jessica looked nothing alike.\nESSENTIAL CLAUSES\nAt the beginning of this chapter, you learned that an introductory dependent\nclause is followed by a comma,but when the same clause is moved to the end of\nthe sentence,no comma is needed.In some sentences,a dependent clause cannot\nbe omitted without changing the basic meaning of the sentence. Omitting it\nalters the meaning ofthe sentence or makes it untrue.Such a clause is an essen-\ntial clause (also known as a restrictive clause) and it is also not set offby commas.\nYou can see how this works in the following sentences.\nAll drivers who have had a drunk driving convictionshould have their\nlicenses revoked.\nAll drivers should have their licenses revoked.\nThe bolded clause is essential because the meaning ofthe sentence is changed if\nthe clause is removed from the sentence.The lack ofcommas shows that the clause\nis essential.\n52 COMMA SENSE\nNONESSENTIAL CLAUSES\nA nonessentialclause adds information that is not essential to the basic mean-\ning ofthe sentence.Ifa nonessential clause is removed,the basic meaning ofthe\nsentence is not changed.Just like nonessential phrases,nonessential clauses (also\nknown as nonrestrictiveclauses) are set offby commas.See how this works in the\nfollowing examples.\nMatt’s mother,who has trouble with directions,had to ask for help.\nMatt’s mother had to ask for help.\nThe bolded clause is nonessential because ifit is removed from the sentence,the\nbasic meaning ofthe sentence does not change.To show that it is nonessential,it\nis set offby commas.Nonessential clauses usually begin with one ofthese words:\nwho,whom,whose,which,or that.\nPractice\nEach ofthe following sentences contains a dependent clause,which is bolded for\nyou.Ifthe clause is essential,do not add commas.Ifit is nonessential,set it offwith\ncommas.Check your work with the answers at the end ofthe chapter.\n17. Mr.Lindgren is not a man who likes to be fooled.\n18.Nicole lives on Briarwood Drive which is south ofthe freeway.\n19.The cattle that were vaccinatedare immune to mad cow disease.\n20.Children who are born on February 29start school before they are two.\n21.The mall restaurant offers free beverages to anyone who orders a dinner.\n22.Josh who is very outgoinghas become one ofmy best friends.\nREVIEW\nIt’s time for a real challenge.This next exercise contains no commas,endmarks,\nor capital letters.Use what you have learned so far to add capital letters,endmarks,\nand commas to make sense ofthe paragraph.Check your work with the corrected\nversion at the end ofthe chapter.\nbecause mary and velma were morning people they met for breakfast\nevery day before work they met at village inn on the corner of uni-\nversity ave and swanson blvd usually they had a light breakfast of\nbagels with cream cheese and coffee whenever one ofthem had some-\nthing to celebrate they would order english muffins and omelettes\nsomething neither ofthem liked to make themselves how they enjoyed\nthose mornings\n53 GRAMMAR ESSENTIALS\nthey had a host ofspecial rules regarding these special omelettes\nwhat were those rules if one of them was celebrating a birthday they\nordered omelettes with something red such as tomatoes or red peppers\nmary’s birthday was feb 22 velma’s was oct 12 if one of them had\nreceived a raise they ordered omelettes with green peppers or green\nonions only once when velma won the lottery did they order omelettes\nwith cheese and bacon\nAnswers\n1.Concerned about his future,Brad went back to school.\n2.Soaking in the stainless-steel sink,his shirt looked doomed.\n3.I gathered all the supplies before I started work this morning.\n4.By repairing the equipment ourselves,we saved several days.\n5.Ecstatic,the coach hugged the referee.\n6.I will remember how to assemble this vacuum as long as I have directions.\n7.As far as I know,the guests in that room checked out an hour ago.\n8.Outside,the yard was covered with flowers.\n9.After running,the horses returned to the barn.\n10.During the night,time drags on and on.\n11.As he watched,the clock slowly ticked away the seconds.\n12.Air quality,a major urban problem,has steadily improved over the last few\nyears.\n13.Walter,the featured artist,delivered a stunning presentation.\n14.Sharon spends Friday evenings at the movies,an event she looks forward to\nall week.\n15.Ms.Mason,the route manager,always leaves the papers at the corner.\n16. The two sisters,Kim and Jessica,looked nothing alike.\n17.Essential clause.No commas needed.\n18.Nicole lives on Briarwood Drive,which is south ofthe freeway.\n19.Essential clause.No commas needed.\n20.Essential clause.No commas needed.\n21.Essential clause.No commas needed.\n22.Josh,who is very outgoing,has become one ofmy best friends.\n54 COMMA SENSE\nREVIEW\nBecause Mary and Velma were morning people,they met for breakfast\nevery day before work.They met at Village Inn on the corner of Uni-\nversity Ave.and Swanson Blvd.Usually,they had a light breakfast of\nbagels with cream cheese and coffee.Whenever one ofthem had some-\nthing to celebrate, they would order English muffins and omelettes,\nsomething neither ofthem liked to make themselves.How they enjoyed\nthose mornings!\nThey had a host ofspecial rules regarding these special omelettes.\nWhat were those rules? Ifone ofthem was celebrating a birthday,they\nordered omelettes with something red,such as tomatoes or red peppers.\nMary’s birthday was Feb.22;Velma’s was Oct.12.If one of them had\nreceived a raise,they ordered omelettes with green peppers or green\nonions.Only once,when Velma won the lottery,did they order omelettes\nwith cheese and bacon.\n55 CHAPTER 7 GRAMMAR IQ QUIZ\nAdd commas where they are needed in the following sentences.Answers and explanations\nfollow the quiz.\n1.Janeece wanted to spend the summer abroad but she had to get at least a 3.5 grade point\naverage for her parents to allow it.\n2.Nick invited his brother his best friend and his girlfriend to the game.\n3.My new apartment is located at 66 Baltic Street Brooklyn New York and will be avail-\nable on November 1 2005.\n4.Jeremy has long lean runner's legs.\n5.I practiced a lot for the tournament but didn't make it past the second round.\nAnswers\n1.Janeece wanted to spend the summer abroad,but she had to get at least a 3.5 grade\npoint average for her parents to allow it.(separates two independent clauses separated\nby a conjunction)\n2.Nick invited his brother,his best friend,and his girlfriend to the game.(separates items\nin a series)\n3.My new apartment is located at 66 Baltic Street,Brooklyn,New York,and will be avail-\nable on November 1,2005.(separates items in an address and a date)\n4.Jeremy has long,lean runner's legs.(separates two equally important adjectives)\n5.I practiced a lot for the tournament,but didn't make it past the second round.\n(separates two contrasting ideas) CHAPTER\n7\nMORE JOBS\nFOR COMMAS\nBesides being road signs for sentences, commas\nalso have many other jobs. This chapter explains\nother uses for commas and reviews what you learned\nabout them in Chapter 6.\nGrammar concepts to know:\n• items in a series—a list of three or more similar\nwords, phrases, or clauses\n• contrasting sentence elements—two opposing\nideas presented next to each other in a sentence\nA s you know, commas are used to separate\nsentence parts to make the meaning ofthe sentence clear.In this chap-\nter,you’ll learn how to use commas to separate independent clauses,items in a\nseries,items in a date or address,adjectives,contrasting elements,and words that\ninterrupt the flow ofthought in a sentence.You’ll also learn how to use commas\nin a friendly letter.\n57 GRAMMAR ESSENTIALS\nSEPARATING INDEPENDENT CLAUSES\nYou already know that an independent clause is a group ofwords that could stand\nalone as a complete sentence.A conjunction is a joining word.Here is a complete\nlist ofconjunctions that can be used to join two independent clauses:\nand for so\nbut nor yet\nor\nWhen two or more independent clauses are joined with a conjunction to make\na compound sentence,a comma should follow the first clause.The commas and\nconjunctions are bolded in the following examples.\nI knew I would win,butI didn't want to appear too eager.\nAisha studied Spanish in college,soshe decided to spend a year in Spain\nafter she graduated.\nEta wanted to order Italian food,andJenna wanted Japanese.\nIfindependent clauses are joined withouta conjunction,they are separated\nby a semicolon instead ofa comma.\nI asked my boss ifI could take my vacation in September;he said that he\npreferred I take it in October.\nJosh is defending his thesis in the spring; I plan on going to see him\ndo it.\nMihal is not sure what she wants to do after she graduates from college;\nshe is thinking ofbecoming a marine biologist.\nPractice\nUse commas and semicolons to correctly punctuate the following sentences.\nCheck your work with the answers at the end ofthe chapter.The changes are bold-\nfaced for you.\n1.Isaac started mowing the yard but his father finished it.\n2.Ifyou know ofa good landscaper please give me the name ofthe company.\n3.The furniture was covered with sheets yet it still became dusty and dirty.\n4.Wayne likes Mike Oldfield he’s an old New Age musician who’s recorded\na CD.\n58 MORE JOBS FOR COMMAS\n5.Edward knows what you want he just doesn’t know where to find it.\n6.Great things happen when we put our heads together.\n7.The pilot was overcome with grief after the accident and he refused to fly\nagain.\n8.As you grow older your body absorbs fewer nutrients so many people take\nvitamin and mineral supplements.\nSEPARATING ITEMS IN A SERIES\nSeparating a list of three or more similar words,phrases,or clauses makes the\nmaterial easier for the reader to understand.Usually,the last item in a series is pre-\nceded by a conjunction.A comma is not required before the conjunction.How-\never,some writers prefer to use one.\nCory,Sue,John,and Craig went to the conference.\nThe horse snorted,pawed the dirt,reared up,and ran offtoward the hills.\nSean taught me how to inventory the equipment,stock the shelves,and\ncomplete a quality-control check.\nIfeach item in the series is separated by a conjunction,no commas are needed.\nKara and Farrah and Andrea left their books behind.\nSEPARATING ITEMS IN DATES AND ADDRESSES\nWhen a year is specified in a date including the month and year,surround it with\ncommas.Ifonly the month or the season is listed,commas are not needed.\nJody came to Fargo on June 1, 1997, right after she graduated from\nhigh school.\nJody came to Fargo in June 1997 after graduating from high school.\nWhen the name of a state is included to further identify a city, set it off with\ncommas.\nGail has lived in Peoria since last year.\nGail has lived in Peoria,Illinois,since last year.\n59 GRAMMAR ESSENTIALS\nPractice\nAdd commas and endmarks where they are needed in the following sentences.\nRemember what you learned in the last chapter about commas.Check your work\nwith the answers at the end ofthe chapter.The changes are boldfaced for you.\n9.Sally bought a kitchen table Hal bought an iron a toaster a blender and gas\ngrill\n10.Seeing no answer to the problem Jeffquit for the day and went home\n11.Bernice was born November 3 1928 and Eugene was born January 17 1929\n12.The gentleman living at 547 35th Street St.Louis Missouri collects oak bar-\nrels pickling crocks and colored glass jars\n13. After running into a police car with his truck Adam used his cellular phone\nto call the police his doctor his lawyer and his insurance agent\nSEPARATING EQUALLY IMPORTANT ADJECTIVES\nAn adjectiveis a word that modifies,or describes,a noun or pronoun.Adjectives\nanswer the questionsWhich one?What kind?andHow many? The bolded words\nin the following sentences are adjectives.\nKathy liked the friendly, talkative, pleasant boy sitting next to her\nat work.(The bolded words describe boy.They answer the question\nWhat kind?)\nThe workmen repaired the floor with that dark, aged oak flooring.\n(The bolded words describe flooring. They answer the questions\nWhich one? andWhat kind?)\nThe reporter spoke with severalintense,talentedhighschoolathletes.\n(The bolded words describe athletes.They answer the questions How\nmany?and What kind?)\nWhen adjectives are equally important in describing a word,they are sepa-\nrated by a comma.However,not all adjectives are equally important.Some adjec-\ntives must be right next to the word they modify,or they will not make sense.For\ninstance,in the second example sentence above,the word oak must be placed next\nto the word flooring.\n60 MORE JOBS FOR COMMAS\nPay close attention to the last example sentence above.The wordsseveral,\nhigh,andschool are all adjectives modifying athletes,but they are not separated by\ncommas.These adjectives need to stay where they are in the sentence for the words\nto make sense,and they should not be separated by a comma from the word they\nmodify.Only adjectives ofequal importance are set offby a comma.\nHow can you tell ifadjectives should be separated with a comma? Apply one\nor both ofthese tests:\n1. Change the order ofthe adjectives.Ifthe sentence reads just as clearly,\nseparate the adjectives with a comma. If the sentence becomes unclear or\nsounds awkward,do not use a comma.The first example sentence on the pre-\nvious page makes sense even ifthe position ofthe adjectives is changed.\nIn the last example sentence,the sentence would make no sense if the\nadjectives came in this order:intense,several,high,talented,school.Intenseand\ntalentedare the only adjectives in the sentence that can be reversed;therefore,\nthey are the only adjectives separated by a comma.\nAlex liked the pleasant,friendly,talkativeboy sitting next to him at work.\nThe carpenter repaired the floor with thataged,dark oakflooring.\nThe reporter spoke with several talented,intensehigh school athletes.\n2. A second,equally effective test is to place the word andbetween the adjectives.\nIfthe sentence still reads well,use commas between the adjectives.Ifthe sen-\ntence sounds unclear or awkward,do not use commas.Again,this works with\nthe first two example sentences,but in the last sentence,anandmakes sense\nonly betweenintenseand talented.\nAlex liked the friendly and talkative and pleasantboy sitting next to him\nat work.\nThe carpenter repaired the floor with that dark and aged oak flooring.\nThe reporter spoke with several intense and talentedhigh school athletes.\nPractice\nTry these two tests with the following sentences.Where do the commas belong?\n14. Marshall cut his short wavy light blond hair.\n15. In my wallet are five crisp new twenty dollar bills.\n61 GRAMMAR ESSENTIALS\nSEPARATING SENTENCE ELEMENTS\n• Use commas to separate contrasting elements in a sentence.The following\nexamples illustrate contrasting elements in a sentence.The comma tells the\nreader that what follows is an opposite idea.It makes the idea easier for the\nreader to grasp.The contrasting ideas are bolded.\nI interviewed well,but did poorly on the written test.\nThis company needs problem solvers, not complainers, to tackle our\nchallenges.\nThe liquid poured slowly at first,quickly toward the end.\nThe tour group expected to meet the actors,not a press agent.\n• Use commas to separate words or phrases that interrupt the flow ofthought\nin a sentence.In the following examples,words and phrases that interrupt\nthe flow ofthought have been bolded.\nThe task,it seemed to us,was overwhelming.\nThe dog remembered,however,the harsh words and cruel actions of\nhis owner.\nMorning,we discovered,was the best time to water the lawn.\n• Whenever the name ofthe person being addressed is included in a sentence,\nit should be set offby commas.Jessi is the person being addressed in each\nofthe following examples.Notice how commas are used to set offher name,\ndepending on where it is placed in the sentence.\nJessi,Pat needs you to sign for a package in the office before you leave.\nPat needs you to sign for a package in the office,Jessi,before you leave.\nPat needs you to sign for a package in the office before you leave,Jessi.\n• Mild exclamations included in a sentence are also set offwith commas.The\nexclamations have been bolded for you in each ofthe following examples.\nGosh,I never expected you’d make such a fuss.\nNo,we won’t be needing you any longer.\nHeck,we could have done that hours ago.\n62 MORE JOBS FOR COMMAS\nUSING COMMAS IN A FRIENDLY LETTER\n• Use a comma after the greeting ofa friendly letter.\nDear Aunt Hilda,\nDear Juanita,\nDear Val,\n• Use a comma after the closing ofa friendly letter.\nSincerely yours,\nYours truly,\nPractice\nUsing what you have learned so far about commas and semicolons,correct these\nsentences.Check your work with the corrected versions ofthe sentences at the end\nofthe chapter.\n16.Exhausted from sitting rather than from physical exertion Ling sank into the\nsoft green easy chair.\n17.The Founders Day sale runs December 26 2005 through January 8 2006.\n18.Suddenly the rope tore and the tire swing plummeted to the ground.\n19.We’re sorry Tom that you were inconvenienced and we’d like to make it up\nto you.\n20.The new address if I’m remembering correctly is 1140 Westown Cole\nIllinois.\n21.When I travel I pack my toothbrush a hairbrush a shoe brush and a clothes\nbrush.\n22.Yes the sales department met their monthly goal over $200,000 in receipts\nthey’re celebrating right now!\nAnswers\n1.Isaac started mowing the yard,but his father finished it.\n2.Ifyou know ofa good landscaper,please give me the name ofthe company.\n3.The furniture was covered with sheets,yet it still became dusty and dirty.\n4.Wayne likes Mike Oldfield;he’s an old New Age musician who’s recorded\na CD.\n5.Edward knows what you want;he just doesn’t know where to find it.\n63 GRAMMAR ESSENTIALS\n6.No change.\n7.The pilot was overcome with grief after the accident, and he refused to\nfly again.\n8.As you grow older,your body absorbs fewer nutrients,so many people take\nvitamin and mineral supplements.\n9.Sally bought a kitchen table,Hal bought an iron,a toaster,a blender,and gas\ngrill.\n10.Seeing no answer to the problem,Jeffquit for the day and went home.\n11.Bernice was born November 3,1928,and Eugene was born January 17,1929.\n12.The gentleman living at 547 35th Street,St.Louis,Missouri,collects oak bar-\nrels,pickling crocks,and colored glass jars.\n13.After running into a police car with his truck,Adam used his cellular phone\nto call the police,his doctor,his lawyer,and his insurance agent.\n14. Marshall cut his short,wavy light blond hair.\n15. In my wallet are five crisp,new twenty dollar bills.\n16.Exhausted from sitting,rather than the phsyical exertion,Ling sank into th\nsoft,gren easy chair.\n17. The Founders Day sale runs December 26,2005,through January 8,2006.\n18.Suddenly,the rope tore,and the tire swing plummeted to the ground.\n19.We’re sorry,Tom,that you were inconvenienced,and we’d like to make it up\nto you.\n20.The new address, if I’m remembering correctly, is 1140 Westown, Cole,\nIllinois.\n21.When I travel, I pack my toothbrush, a hairbrush, a shoe brush, and a\nclothes brush.\n22.Yes,the sales department met their monthly goal,over $200,000 in receipts;\nthey’re celebrating right now!\n64  CHAPTER 8 GRAMMAR IQ QUIZ\nAdd commas,semicolons,and colons wherever they are needed in the following sentences.\nAnswers and explanations follow the quiz.\n1.Your budget is gone you need to stop spending money.\n2.The results ofthe tests were inconclusive therefore the group decided to gather more\ninformation.\n3.The charter trip includes stops in Denver Colorado Salt Lake City Utah Reno Nevada\nand Portland Oregon.\n4.These items are essential for fishing a tackle box a life jacket and a good fishing pole.\n5.At 12 23 p.m.the book Standing on the Edge A Closer Look at Mountain Climbinggoes\non sale.\nAnswers\n1.Your budget is gone;you need to stop spending money.(Semicolon separates two inde-\npendent clauses joined without a conjunction.)\n2.The results ofthe tests were inconclusive;therefore,the group decided to gather more\ninformation.(Semicolon precedes a conjunctive adverb;a comma follows it.)\n3.The charter trip includes stops in Denver, Colorado; Salt Lake City, Utah; Reno,\nNevada;and Portland,Oregon.\n4.These items are essential for fishing:a tackle box,a life jacket,and a good fishing pole.\n5.At 12:23 p.m.,the book Standing on the Edge: A Closer Look at Mountain Climbinggoes\non sale. CHAPTER\n8\nGETTING\nFANCY WITH\nSEMICOLONS\nAND COLONS\nSemicolons (;) and colons (:) confuse many writers.\nThis chapter sorts it all out for you. By the time you\nfinish, you’ll know exactly how to use both.\nGrammar concepts to know:\n• subordinating conjunction—a word such as\nbecause, although, if, when, etc., that introduces\na dependent clause\n• conjunctive adverb—a word such as\nconsequently, however, therefore, etc., that\nseparates two related independent clauses\nIn this chapter, you will review what you have\nlearned about punctuation so far,especially the use of semicolons to separate\nindependent clauses.You will also learn how to use semicolons with certain joining\nwords,and when to separate items in a series with semicolons.Finally,you will learn\nsome ofthe uses ofcolons.\n67 GRAMMAR ESSENTIALS\nSEMICOLONS\nSeparating Independent Clauses\n• Use a semicolon to separate independent clauses joined without a\nconjunction.This rule may seem familiar because it was also included in\nChapters 4 and 7.Refresh your memory with these example sentences.\nI chose Ben as my partner;we are an undefeatable team.\nKara cooked dinner;I bought the groceries.\nYou worked hard for this;your reward is well deserved.\n• Use a semicolon to separate independent clauses that contain commas,even\nifthe clauses are joined by a conjunction.\nDanny likes doing bench presses,arm curls,leg extensions,and other\nweight-training exercises;but Jen prefers cardiovascular training.\nIn this sentence, the semicolon helps the reader see where the break in\nthought occurs.The semicolon makes the sentence easier to understand.\n• Use a semicolon to separate independent clauses connected with a con-\njunctive adverb that expresses a relationship between clauses (see Chapter\n4).When these words (such as however,therefore,then,and thus) connect\ntwo independent clauses, the first independent clause is followed by a\nsemicolon,and the conjunctive adverb is followed by a comma.Look at the\nfollowing examples to see how this is done.\nI lost my job;therefore,I had to cancel my trip to Europe.\nNoah wanted to spend four months living abroad;however,he couldn't\nget a visa that let him stay more than three months.\nI decided against going to Greece;instead,I chose to visit Costa Rica.\nCarla began studying Japanese to prepare for her trip;furthermore,she\nsigned up for an Asian history course.\nHere is a list ofthese conjuctive adverbs:\naccordingly however then\nbesides instead therefore\nconsequently moreover thus\nfurthermore nevertheless\nhence otherwise\n68 GETTING FANCY WITH SEMICOLONS AND COLONS\nIt’s easy to confuse these conjunctive adverbs with subordinating conjunc-\ntions such as because,although,since,until,and while.Subordinating conjunctions\nintroduce dependent clauses that cannot stand alone as a sentence.The conjunc-\ntive adverbs,however,introduce independent clauses that can stand alone,with\nor without the adverb.\nHere’s an easy test to see ifthe word beginning a clause is a subordinating con-\njunction,for which you need only a comma,or a conjunctive adverbthat needs a\nsemicolon: If you can move the word around in the clause, it’s a conjunctive\nadverb,the joining word that takes a semicolon.Ifnot,it’s probably a subordinat-\ning conjunction.Let’s try the test with these two independent clauses:\nMy paycheck was late.I couldn’t pay my rent on time.\nHere are two different ways ofcombining these two independent clauses.\nMy paycheck was late;therefore,I couldn’t pay my rent on time.\nI couldn’t pay my rent on time because my paycheck was late.\nIn the first sentence,you could move thereforeto a different place in the clause\nif you wanted to.You could say,“I couldn’t,therefore,pay my rent on time.”So,\nthereforeis a conjunctive adverb.\nIn the second sentence,the word becausemakes no sense anywhere else in\nthe clause.You wouldn’t say,“My paycheck because was late.”Therefore,because\nis a subordinate conjunction.\nSeparating Items in a Series\nUse a semicolon to separate items in a series that contain commas.This helps the\nreader see which sets of items go together.Unlike items in a series separated by\ncommas,a semicolon is used even when there isa conjunction.\nThe possible dates for the potluck are Thursday,June 5;Saturday,June 7;\nSunday,June 8;or Monday,June 9.\nOn our team you’ll find the hustlers,Jake and Marilynn; the slackers,\nHenrietta,Chuck,and Kerald;and the easy-going people,Judy,Rob,\nand Kirsten.\nThe packing plant will relocate to either Fort Madison,Iowa;Omaha,\nNebraska;or Sioux Falls,South Dakota.\n69 GRAMMAR ESSENTIALS\nPractice\nUse what you have learned to add commas and semicolons to the following sen-\ntences.Check your work with the answers at the end ofthe chapter.The changes\nare boldfaced for you.\n1.Helen left her desk unlocked at work consequently she worried about it all\nnight.\n2.The menu included broiled salmon steamed broccoli grilled potatoes spinach\nand bread but for some reason they served no dessert.\n3.Tim hurried through his work however he still wasn’t finished by 8:30.\n4.The bus traveled through Chicago Illinois Dayton Ohio and Pittsburgh\nPennsylvania.\n5.I’ve been at this for two days I need to get away for a while.\nCOLONS\nColons That Introduce\n• Use a colon to introduce a list ofitems.\nThese people were transferred:Audrey,Brett,Bradley,and Lindsay.\nWe ordered the following supplies: paper, staplers, scissors, markers,\nand tape.\nDo not use a colon ifthe list ofitems completes the meaning begun by the\nverb,in other words,ifit fits right into the flow ofthe sentence.Here are\nthe previous example sentences,rewritten in such a way that a colon is not\nnecessary.\nThe people transferred were Audrey,Brett,Bradley,and Lindsay.\nWe ordered paper,staplers,scissors,markers,and tape.\n• Use a colon to introduce a formal quotation.\nNietzsche offered this sound advice:“Smash not the happy delusions\nof men.”\n• Use a colon to introduce a word, phrase, or clause that adds particular\nemphasis to the main body ofa sentence.\nYour busy work schedule is the result ofone thing:poor planning.\nJerry needed one peice ofessential information:the price.\n70 GETTING FANCY WITH SEMICOLONS AND COLONS\nColons That Show Relationship\nUse a colon to show a relationship in the following cases:\n• Between two independent clauses when the second explains the first.\nJudy shouted and turned cartwheels:She had just finished the last page\nofthe report.\nBrian framed the paycheck:It was the first check he had ever earned.\nSylvia ignored the doorbell: She knew it was a salesman she had no\ntime for.\n• Between the title and the subtitle ofa book.\nMeasurement: Translating into Metric\nNext Step: A Futuristic View ofTechnology\nFear: Tales from the Dark Side\n• Between volumes and page numbers.\nContemporary Authors V:128\nEducation Digest 10:23\nMarvel Comics 21:24\n• Between chapters and verses.\nJames 3:10\nExodus 1:1\nProverbs 2:2\n• Between hours and minutes.\n12:53 a.m.\n2:10 p.m.\nUSING COLONS IN BUSINESS LETTERS\nYou learned in Chapter 7 that a comma follows the greeting (or salutation) in a\npersonal, or friendly, letter. In business communications, a colon signals the\nreader that what follows is a business matter,something to be taken seriously.This\nis particularly true ifyou include the position,but not the name ofthe person to\nwhom the letter is addressed.However,even in a business letter,the closing is fol-\nlowed by a comma.\n71 GRAMMAR ESSENTIALS\nDear Ms.Essian:\nSincerely yours,\nDear Editor:\nCordially yours,\nPractice\nPractice what you have learned about commas,semicolons,and colons by\nadding them to the following sentences. Check your work with the\nanswers.The changes that follow are boldfacd for you.\n6.Hammond located the procedure in the policy manual Volume 6 89.\n7.The hail destroyed all ofthe wheat however the corn was untouched by the\nviolent storm.\n8.Before I bought a new car I did some research in the library checked out the\nlocal car dealerships asked a few friends for advice and consulted my\nmechanic.\n9.Dear Customer\nYour order should arrive on or before January 5 2006.\nSincerely yours\n10.Each day a new shift begins at 8 30a.m.4 30 p.m.and 12 30 a.m.\n11.Megan likes to play soccer a physically challenging sport bridge a game of\nlogic and strategy Street Fighter a mindless PS2 game and the harmonica an\ninvigorating instrument.\n12.The police learned the following information from the interrogation the sus-\npect’s name his home address his phone number and his current employer.\nAnswers\n1.Helen left her desk unlocked at work;consequently,she worried about it all\nnight.\n2.The menu included broiled salmon, steamed broccoli, grilled potatoes,\nspinach,and bread;but for some reason,they served no dessert.\n3.Tim hurried through his work;however,he still wasn’t finished by 8:00.\n4.The bus traveled through Chicago,Illinois;Dayton,Ohio;and Pittsburgh,\nPennsylvania.\n5.I’ve been at this for two days;I need to get away for a while.\n6.Hammond located the procedure in the policy manual Volume 6:89.\n7.The hail destroyed all ofthe wheat;however,the corn was untouched by the\nviolent storm.\n72 GETTING FANCY WITH SEMICOLONS AND COLONS\n8.Before I bought a new car,I did some research in the library,checked out\nthe local car dealerships,asked a few friends for advice,and consulted my\nmechanic.\n9.Dear Customer:\nYour order should arrive on or before January 5,2006.\nSincerely yours,\n10.Each day,a new shift begins at 8:30 a.m.,4:30 p.m.,and 12:30 a.m.\n11.Megan likes to play soccer,a physically challenging sport;bridge,a game of\nlogic and strategy;Street Fighter,a mindless PS2 game;and the harmonica,\nan invigorating instrument.\n12. The police learned the following information from the interrogation:the sus-\npect’s name,his home address,his phone number,and his current employer.\n73 CHAPTER 9 GRAMMAR IQ QUIZ\nAdd quotation marks wherever they are needed in the following sentences.Answers and\nexplanations follow the quiz.\n1.The teacher called him a poor excuse for a student.\n2.Ifyou shovel the drive,Mom said,I’ll make hot chocolate.\n3.The short story was entitled The Tell-Tale Heart.\n4.The hinges are defective,said Josh.Let’s remove them.\n5.We saw Fear Factor last night.\nAnswers\n1.The teacher called him a “poor excuse for a student.” (surrounds directly quoted\nwords)\n2.“Ifyou shovel the drive,”Mom said,“I’ll make hot chocolate.”(encloses exact words\nin a conversation)\n3.The short story was entitled “The Tell-Tale Heart.”(surrounds the title ofa short story)\n4.“The hinges are defective,”said Josh.“Let’s remove them.”(encloses exact words in a\nconversation)\n5.We saw “Fear Factor”last night.(surrounds the title ofa TV show) CHAPTER\n9\nCONTROLLING\nQUOTATION\nMARKS\nThis chapter explains the knotty problems of quota-\ntion marks, both double and single. By the time you\nfinish, you’ll be in control of quotation marks in your\nwriting.\nGrammar concepts to know:\n• direct quotation—someone’s exact written, spo-\nken, or inscribed words\n• paraphrase—a restatement of a direct quotation\n• slang—highly informal language used only in infor-\nmal conversation\nQ uotation marks pose a problem for many\nwriters,but a few simple rules can make them easy to use.Although these\nmarks are most often found in dialogue,other writing situations require them\nas well.\nUSING QUOTATION MARKS IN DIRECT QUOTATIONS\n• Use double quotation marks to set offa direct quotation or thought within\na sentence or paragraph.This includes quotations that are signed,etched,\ninscribed,carved,and so on.\nThe managers called our new pricing policy “the innovation of the\ndecade.”\n75 GRAMMAR ESSENTIALS\nWe thought he said,“Turn right at the corner.”\nThe sign read,“No Smoking.”\n“Eccentric and Erratic,”the headstone read.\n• Do not use quotation marks for a paraphrase, or the restatement of a\ndirect quotation or thought in other words.The following examples illus-\ntrate the difference.\nThe teacher said,“Turn your papers in at the end ofclass.”\n(direct quotation)\nThe teacher said to turn our papers in at the end ofclass.(paraphrase)\n“Why can't I shake this flu?”I wondered.(direct thought)\nI wondered why I couldn't shake this flu.(paraphrase ofa thought)\nThe sign clearly read,“No parking.”(signed words)\nThe sign said not to park.(paraphrase)\n• Use single quotation marks to set offa quotation within a quotation.\n“Beth couldn't make it,so she told me,'I'll catch up with you later,'”said\nGrace.\nThe sales manager said,“The attitude ofmy most successful salesman is:\n'No job is too big or small.'”\nMy doctor always says,“Take my wife’s advice:‘Ifit tastes good,it has to\nbe fattening!’”\nUSING QUOTATION MARKS IN DIALOGUE\nCorrectly punctuating dialogue means understanding how to use quotation marks,\ncommas,and endmarks.Take a close look at the sentences in the following dialogue\nsample:They include the basic dialogue structures.The words quoted are called quo-\ntations,and the words explaining who said the quotations are calledtags.In these\nexamples,the tags are in bold.\n“I’m really hungry.I want something to eat,”said Harry.\nNina answered,“I’m hungry, but I don’t have any cash. Do you have\nsome?”\n“What is this?”Harry asked.“You’re the one with the manager’s job.”\n“Yes,”Nina said,“but credit cards are all I ever carry.”\n76 CONTROLLING QUOTATION MARKS\nQuoted words are always surrounded by quotation marks.Place quotation\nmarks before a group ofquoted words and again at the end.Tags are punctuated dif-\nferently depending on where they are in the sentence.\n• Ifthe tag follows a quotation,and the quotation is a sentence normally end-\ning with a period,use a comma instead.The period comes at the end ofthe\ntag.(See the first example sentence,on the previous page.)\nHowever,ifthe quotation is a sentence normally ending with a ques-\ntion mark or an exclamation point,insert the question mark or exclama-\ntion point. Place a period after the tag, but do not use a comma. The\nexamples that follow illustrate these rules.\n“I'm really tired ofdriving.Let's find a hotel,”said Aaron.\n“I'm really tired ofdriving.Do you want to find a hotel?”asked Aaron.\n“I'm really tired ofdriving.Wait—there's a Holiday Inn!”exclaimed Aaron.\n• When the tag comes before the quotation,place a comma after the tag.Put\nquotation marks around the quoted words,capitalize the first word ofthe\nquotation,and punctuate the sentence as you would normally.See how this\nis shown in these sentences.\nAaron said,“I'm really tired ofdriving.Let's find a hotel.”\nAaron said,“I'm really tired ofdriving.Do you want to find a hotel?”\nAaron said,“I'm really tired ofdriving.Wait—there's a Holiday Inn!”\n• Sometimes,the tag interrupts the quotation.If both the first and second\nparts ofthe quotation are complete sentences,the first part ofthe quota-\ntion is punctuated in the same way as a quotation with the tag at the end.\nIn other words,the period follows the tag.The rest ofthe quotation is punc-\ntuated in the same way as a quotation preceded by a tag.See the following\nexample sentences.\n“I'm really tired ofdriving,”said Aaron.“Let's find a hotel.”\n“I'm really tired ofdriving,”said Aaron.“Do you want to find a hotel?”\n“I'm really tired ofdriving,said Aaron.“Wait—a Holiday Inn!”\n• When the tag interrupts a sentence,the words preceding the tag begin the\nthought,and the words following the tag complete the thought.Place quo-\ntation marks around the quoted words and follow the first part of the\nquotation with a comma.Place a comma after the tag—not a period since\n77 GRAMMAR ESSENTIALS\nthe sentence is not completed.Place quotation marks around the last part\nofthe quotation,but do not capitalize the first letter ofthe quotation as it\nis not the beginning ofa new sentence.Punctuate the rest ofthe sentence\nas you would normally.See the example sentences below.\n“The Carters just don’t understand,”observed Solomon,“why they upset\nyou so.”\n“This lawn care service,”explained Alvin,“provides fertilizer,seed,and\nweed control.”\n“What I can’t see,”mused Mel,“is what you see in him.”\nNote: All of the punctuation is inside the quotation marks except for the\npunctuation marks following the tags.\nDialogue at a Glance\n• Tags following a quotation:\n“___________________,”said Rose.\n“___________________?”asked Rose.\n“___________________!”exclaimed Rose.\n• Tags preceding a quotation:\nIris said,“___________________.”\nIris asked,“___________________?”\nIris exclaimed,“___________________!”\n• Tags between two sentences ofa quotation:\n“_____________,”said Lily.“_____________.”\n“_____________?”asked Lily.“_____________?”\n“_____________!”exclaimed Lily.“_____________!”\n• Tags interrupting a one-sentence quotation:\n“_____________,”said Daisy,“_____________.”\n“_____________,”asked Daisy,“_____________?”\n“_____________,”exclaimed Daisy,“_____________!”\n78 CONTROLLING QUOTATION MARKS\nOTHER USES FOR QUOTATION MARKS\n• Use quotation marks to set offnicknames and words used as slang.\nKristy was dubbed “speed demon”by her teammates.\nAll the kids said the new CD was really “bad.”\n• Use quotation marks to indicate irony or raised eyebrows.Avoid overusing\nquotation marks in this way.It doesn’t work ifyou do it all the time.\nMy yearly “evaluation” involved a three-minute conversation with\nthe boss.\nThat “consultant”offered no advice or counsel.\nTheir idea ofa “good time”is doing laundry.\n• Use quotation marks to set offtitles ofcertain items.Other titles should be\nitalicized.The following table shows these differences.\nEnclose in Quotation Marks Italicize\nname of a short story or chapter of a title ofa novel\nbook\nname ofa TV program name ofa movie\ntitle ofa poem title ofa collection ofpoetry or an epic\npoem\nheadline ofan article or title ofa report name ofa magazine or newspaper\ntitle ofa song title ofa musical or long musical\ncomposition\nname ofa ship,plane,train,etc.\nItalics instead of Quotation Marks\nItalics are used instead ofquotation marks for titles ofthe items in the second col-\numn ofthe table above.They are also used when referring to words as words,and\nfor emphasis:\nWords as words:\nThe word food always brought a smile to his face.\nEmphasis:\nI have never seen anyone so fond ofmusic.\n79 GRAMMAR ESSENTIALS\nQuotation Marks with Other Punctuation Marks\nHere are the rules for combining quotation marks with other punctuation marks:\n• Question marks,exclamation points,and dashes go inside quotation marks\nifthey are part ofa quotation.Ifthey are not,place them outside the quo-\ntation marks.\nThe dentist asked,“Can you feel sensitivity in this area?”(part of the\nquotation)\nDid you watch last week’s “Lost”? (not part ofthe quotation)\n“I wish I’d never heard of—”Calvin stopped suddenly as Kelly entered\nthe room.(part ofthe quotation)\nMy favorite song will always be “The Rose”! (not part ofthe quotation)\n• Periods and commas go inside closing quotation marks.\n“Wait for halfan hour,”suggested Dalia,“before you go swimming.”\n• Colons and semicolons go outsideclosing quotation marks.\nHere’s how I felt about last week’s “Friends”:I loved it.\nThe interviewer dismissed the remark as a “slip ofthe tongue”;the guest\nwas insulted.\nPractice\nUse what you have learned about quotation marks to correct the following sentences.\nCheck your work with the answers that follow.\n1. Do you ever watch CSI on CBS? asked Steven.\n2. Which one of you called me a cowardly excuse for a soldier? barked the\nsergeant.\n3. After reading To Kill a Mockingbird,I rented the movie.\n4. An extra five minutes at lunch was our prize.\n5. All the teenagers at the party were duded out.\n6. Ifyou want to know why I’m so bitter,read my article Rosy Glasses in the\nlatest copy ofour newsletter,The Tower.\n7. I wish that old fussbudget—Melanie stopped abruptly as Mr.Harris walked\ninto the room.\n80 CONTROLLING QUOTATION MARKS\n8. Do you call everyone by the name Bubba asked Katie.\n9. The investigator asked us where we had spent the evening.\n10. Don’t make outrageous excuses my attorney advised that will only make\nmatters worse.\n11. Ebenezer said I told you the representative said No way before I ever had a\nchance to explain.\n12. Why are you still here my supervisor asked everyone else went home an\nhour ago.\n13. We were shocked by our Christmas bonus a bag with a cookie and an\norange.\n14. Looking at her tardy record,I see why you’ve named her Punctual Paula.\n15. Get out ofthe way yelled the captain.\nAnswers\n1. “Do you ever watch ‘CSI’on CBS?”asked Steven.\n2. “Which one ofyou called me a ‘cowardly excuse for a soldier’?”barked the\nsergeant.\n3. After readingTo Kill a Mockingbird,I rented the movie.\n4. An extra five minutes at lunch was our “prize.”\n5. All the teenagers at the party were “duded out.”\n6. Ifyou want to know why I’m so bitter,read my article “Rosy Glasses”in the\nlatest copy ofour newsletter,The Tower.\n7. “I wish that old fussbudget—”Melanie stopped abruptly as Mr. Harris\nwalked into the room.\n8. “Do you call everyone by the name ‘Bubba’?”asked Katie.\n9. No change.\n10. “Don’t make outrageous excuses,”my attorney advised.“That will only\nmake matters worse.”\n11. Ebenezer said,“I told you the representative said,‘No way!’before I ever had\na chance to explain.”\n12. “Why are you still here?”my supervisor asked.“Everyone else went home\nan hour ago.”\n13. We were shocked by our Christmas “bonus”:a bag with a cookie and an\norange.\n14. Looking at her tardy record,I see why you’ve named her “Punctual Paula.”\n15. “Get out ofthe way!”yelled the captain.\n81 CHAPTER 10 GRAMMAR IQ QUIZ\nAdd apostrophes and dashes wherever they are needed in the following sentences.Answers\nand explanations follow the quiz.\n1. The manager evaluated the sales associates performance.\n2. The fine equaled two weeks pay.\n3. Owen isnt scheduled to work today.\n4. Marianna is disappointed we are too that the performance was canceled.\n5. Preparation and hard work these are the keys to successfully implementing a plan.\nAnswers\n1. The manager evaluated the sales associate’s performance.(apostrophe shows pos-\nsession)\n2. The fine equaled two weeks’pay.(shows possession)\n3. Owen isn’t scheduled to work today.(apostrophe denotes a contraction)\n4. Marianna is disappointed—we are too—that the performance was canceled.\n(marks a sudden break in thought)\n5. Preparation and hard work—these are the keys to successfully implementing a\nplan.(connects a beginning phrase to the rest ofthe sentence) CHAPTER\n10\nTHE MYSTERIES\nOF APOSTROPHES\nAND DASHES\nThis chapter puts you in command of apostrophes\nand dashes, the most commonly misused punctua-\ntion marks.\nGrammar concept to know:\n• contraction—two words condensed into one\nword with an apostrophe (will not = won’t; did not\n= didn’t)\nA postrophes communicate important informa-\ntion in written language.Dashes,when used sparingly,add emphasis.\nThe first part ofthis chapter covers the rules regarding apostrophes.The last part\ncovers dashes.\nAPOSTROPHES\nUsing Apostrophes to Show Possession\nApostrophes are used to show that one or more things belong to one or more\npeople or things. Apostrophes are often used because they shorten sentences,\nmeaning fewer words for the reader.The following sets ofexamples illustrate this.\nThese books belong to the girl.\nThese are the girl'sbooks.\n83 GRAMMAR ESSENTIALS\nWe must update the computer system ofthe hospital.\nWe must update the hospital’scomputer system.\nI need to switch the veterinarian ofmy dog.\nI need to switch my dog’sveterinarian.\nChanging the location ofan apostrophe can change the meaning ofa sen-\ntence.Look at each ofthe following sentences.The words in parentheses explain\nwhat the apostrophe means.\nThese are the girl’sbooks.(The books belong to one girl.)\nThese are the girls’books.(The books belong to more than one girl.)\nWe must update the hospital’scomputer system.(This is referring to the\ncomputer system ofone hospital.)\nWe must update the hospitals’computer system.(This is referring to the\ncomputer system ofmore than one hospital.)\nI need to switch my dog’sveterinarian.(This is referring to the veteri-\nnarian ofone dog.)\nI need to switch my dogs’veterinarian.(This is referring to the veteri-\nnarian ofmore than one dog.)\nThe position ofthe apostrophe tells the reader whether one person or thing\npossesses something,or ifit’s more than one person or thing doing the possess-\ning.That is,it tells whether the word that possesses is singular (referring to one)\nor plural (referring to more than one).\n• Add ’s to singular words not ending in s.\ncat’stoy\nqueen’sthrone\nphysician’sassistant\nbook’scover\n• Add ’sto singular words ending in s.\nGarth Brooks’slatest recording\nAmerican Express’sadvertising campaign\nLois’sbirth certificate\n84 THE MYSTERIES OF APOSTROPHES AND DASHES\n• Add s’to plural words ending in s.\ngirls’bicycles\nkids’books\nladies’garments\nemployees’agreement\n• Add ’s to plural words not ending in s.\nwomen’splans\nchildren’sbedrooms\nmen’sshoes\npeople’selection\nWhen a common or proper noun is more than one word, special rules\napply.Usually,you add the ’sto the last word in the noun\n• Add ’sto the last word ofa compound noun.\nmother-in-law’svisit\npresident-elect’sdecision\nmanager-in-training’sduties\n• Add ’sto the last word ofthe name ofa business or institution.\nProctor and Gamble’sproducts\nFirst State Bank’snew hours\nBanton and Barton Co.’spresident\n• Add ’sto the last name mentioned if a single item belongs to more than\none person.\nWayne and Judy’slog home\nthe receptionist and secretary’sprinter\nMr.and Mrs.Mitchell’scar\n85 GRAMMAR ESSENTIALS\n• Add an apostrophe to words showing periods of time if they show\npossession.\none day’sschedule\none year’ssalary\nthree days’wait\n• Add an apostrophe to words showing amounts of money if they show\npossession.\ntwo cents’worth\nadollar’sserial number\na penny’svalue\nUsing Apostrophes to Show Omission\nUse an apostrophe to show that letters or numbers have been omitted.\nBecky doesn’t(does not) work today.\nThe doctor couldn’t(could not) give me a prescription.\nWho’s(who is) on first?\nI can’t(cannot) get together tomorrow afternoon.\nMy first car was a’67(1967) Chevy.\nUncle Louis tells lies about life in the ’50s(1950s).\nWhen Not to Use Apostrophes\n• Do not use an apostrophe to form a plural,but only to show possession for\neither singular or plural words.\nWrong:Get the tomatoe’s from the garden.\nCorrect:Trim the tomatoes’lower limbs.\nWrong:Read the nutrition label on this bag ofchip’s.\nCorrect:Read the bag ofchips’nutrition label.\n• Do not use an apostrophe with words that already show possession\n(my,mine,our,ours,your,yours,his,her,hers,their,theirs).Note that these\nwords do not have apostrophes in the following examples.\nThis is their boat.The boat is theirs.(no apostrophe)\nWe brought our grill.The grill is ours.(no apostrophe)\nThis experiment must be yours.(no apostrophe)\n86 THE MYSTERIES OF APOSTROPHES AND DASHES\nPractice\nPractice what you have learned about apostrophes and other punctuation marks\nto correct the following sentences.Check your work with the answers at the end\nofthe chapter.\n1. Mr.Jones grocery store has better produce than Mrs.Smiths.\n2. Comp USAs top-selling product is Microns latest MMX computer.\n3. Janices and Jays horse was named the Grand Champion Stud.\n4. After six weeks steady work we earn a permanent position and a days paid\nvacation.\n5. The picnic basket is their’s.\n6. Our firms territory has doubled in the last six months and the new respon-\nsibility is your’s.\n7. Every Saturday afternoon the Womens Issues Group meets for lunch.\n8. Bonnie works as a dentists assistant.\n9. Employees motivations differ from an owners.\n10. A managers reward is different from an employees.\nDASHES\nA dash is a specialized punctuation mark reserved for only a few types of situa-\ntions.However,many writers use it incorrectly.Dashes call attention to themselves.\nBecause ofthis,a careful writer uses them sparingly.They are very effective ifused\ncorrectly,but they lose their impact ifthey are overused.\n• Use a dash to mark a sudden break in thought or to insert a comment.\nTake these files and this—Look out for that truck!\nI remember the day—what teenager doesn’t—that the space shuttle\nexploded.\nAbby is delighted—as we are—about your new job.\n• Use a dash to emphasize explanatory material.You don’t have to use a dash,\nbut you may.\nRealizing your limitations—time,money,and energy—makes planning\nmore realistic.\nHe lit a cigarette inside the building—an unconscious habit.\n87 GRAMMAR ESSENTIALS\n• Use a dash to indicate omitted letters.\n“Oh,d—,I lost the code for the copier!”\nHe had received a letter from Mrs.N—.\n• Use a dash to connect a beginning phrase to the rest ofthe sentence.\nDiversity and challenge—these are the advantages ofour new programming.\nAlbany,New York,and Trenton,New Jersey—that’s where our current\nstaffwill be relocating.\nPractice\nUse what you know about dashes to correctly punctuate the following sentences.\nCheck your work with the answers at the end ofthe chapter.\n11. To run or to hide those were her only choices.\n12. Our idea just in case you’re interested is to remove the plastic coating.\n13. Mr.O’Dea is the most unreasonable I should keep my opinions to myself.\n14. I can never find his d pocket organizer when he Oh,now I’ve got it.\n15. Intelligence,perseverance,and luck that’s what you’ll need for this job.\nREVIEW\nPractice what you have learned about punctuation so far by adding capitalization,\nendmarks,commas,semicolons,colons,apostrophes,and dashes to the following\nsentences.Check your work on these complicated sentences with the corrected ver-\nsions on the next page.\n16. though it is hard to understand my partners purpose in interviewing dr e\ns sanders jr was to eliminate him as a suspect in the crime\n17. before the ambulance reached the corner ofwoodland and vine ms ander-\nson saw a dark hooded figure crawl through the window reach back grab\na small parcel and run north on vine\n18. as the detective interrogated each ofthe boys and their fathers they deter-\nmined that the mens stories did not match up with the boys versions\n19. please bring these items when you drive up here tomorrow barbaras sleep-\ning bag another can of avon insect repellent the girls queen-sized air mat-\ntress they want to use it to sunbathe on the water and my swimming trunks\n20. karl malone and john stockton these two made an exciting combination a\nmixture ofmalones aggressiveness and stocktons finesse\n88 THE MYSTERIES OF APOSTROPHES AND DASHES\nAnswers\n1. Mr.Jones’s grocery store has better produce than Mrs.Smith’s.\n2. Comp USA’s top-selling product is Micron’s latest MMX computer.\n3. Janice and Jay’s horse was named the Grand Champion Stud.\n4. After six weeks’steady work, we earn a permanent position and a day’s\npaid vacation.\n5. The picnic basket is theirs.\n6. Our firm’s territory has doubled in the last six months,and the new respon-\nsibility is yours.\n7. Every Saturday afternoon,the Women’s Issues Group meets for lunch.\n8. Bonnie works as a dentist’s assistant.\n9. Employees’motivations differ from an owner’s.\n10. A manager’s reward is different from an employee’s.\n11. To run or to hide—those were her only choices.\n12. Our idea—just in case you’re interested—is to remove the plastic coating.\n13. Mr.O’Dea is the most unreasonable—I should keep my opinions to myself.\n14. I can never find his d— pocket organizer when he—Oh,now I’ve got it.\n15. Intelligence,perseverance,and luck—that’s what you’ll need for this job.\n16. Though it is hard to understand, my partner’s purpose in interviewing\nDr.E.S.Sanders,Jr.,was to eliminate him as a suspect in the crime.\n17. Before the ambulance reached the corner of Woodland and Vine, Ms.\nAnderson saw a dark, hooded figure crawl through the window, reach\nback,grab a small parcel,and run north on Vine.\n18. As the detectives interrogated each ofthe boys and their fathers,they deter-\nmined that the men’s stories did not match up with the boys’versions.\n19. Please bring these items when you drive up here tomorrow: Barbara’s\nsleeping bag,another can ofAvon insect repellent,the girls’queen-sized\nair mattress—they want to use it to sunbathe on the water—and my\nswimming trunks.\n20. Karl Malone and John Stockton—these two made an exciting combination,\na mixture ofMalone’s aggressiveness and Stockton’s finesse.\n89 CHAPTER 11 GRAMMAR IQ QUIZ\nUse parentheses,hyphens,slashes,and numbers correctly in the following sentences.\nAnswers and explanations follow the quiz.\n1. The secretary treasurer read the minutes from last month’s meeting.\n2. Madison Avenue the street one block east ofour house is being resurfaced.\n3. The parents ofthe sick child Otto and Rachel requested a second opinion.\n4. Vegetables and or fruits are essential to healthy eating.\n5. We ordered (12,twelve) jelly doughnuts.\nAnswers\n1. The secretary-treasurer read the minutes from last month’s meeting.(joins two\nwords working as one)\n2. Madison Avenue (the street one block east ofour house) is being resurfaced.\n(encloses an explanation that interrupts the flow ofa sentence)\n3. The parents ofthe sick child (Otto and Rachel) requested a second opinion.\n(encloses information when accuracy is important)\n4. Vegetables and\/or fruits are essential to healthy eating.(shows that the sentence\nrefers to one or both words)\n5. We ordered twelve jelly doughnuts.(Write out a number that can be written as one\nor two words.) CHAPTER\n11\nTHE FINER\nPOINTS OF\nPUNCTUATION\nMost people misuse hyphens once in a while. Paren-\ntheses and diagonal slashes also cause problems, lit-\ntering your written work like blemishes on an\notherwise smooth surface. This chapter explains\nwhen to use the less-often-used (and more often\nmisused) punctuation marks and explains how to\nwrite numbers.\nGrammar concepts to know:\n• hyphenated word—two or more words joined by\na hyphen to create a single word (well-known)\n• compound word—two words joined together to\nform one (cowboy, storeroom)\nThe punctuation marks covered in this lesson—\nhyphens,parentheses,and diagonal marks—serve very specific purposes.\nKnowing and understanding their functions gives a writer an advantage in com-\nmunicating ideas.This chapter explains how to use these marks.The last part of\nthe chapter discusses using numbers in writing.\n91 GRAMMAR ESSENTIALS\nHYPHENS\nThe main purpose ofa hyphen is to join words to create a compound word,which\nis a combination of words used as one word.Compound words may be written\nin three ways:as a single word,as two words,or as a hyphenated word.Whenever\nyou are in doubt,consult a recent dictionary.\nSince language changes constantly,a word written as two words often evolves\ninto a hyphenated word,then eventually becomes a single word.For example,the\nword semicolon began as two separate words (semi colon).In the late fifties,dic-\ntionaries began listing it as a hyphenated word (semi-colon).A recent dictionary will\nlist it as a single word (semicolon).\nTwo-Word Compound Nouns\ncouch potato\nhat rack\nwindow box\nguitar pick\nHyphenated Compound Nouns\nfather-in-law\nmayor-elect\ncook-off\nco-payment\nlight-year\nball-and-socket joint\nSingle-Word Compound Nouns\ndriveway\nraindrop\ncandlelight\nspeedboat\nsunscreen\nwatermelon\n• Use a hyphen to join two words working together as one.\nMark is a singer-dancer.\nPete Rose was a player-coachfor the Cincinnati Reds.\nGeorge Clooney has joined the ranks ofwell-known actor-directors.\n92 THE FINER POINTS OF PUNCTUATION\n• Use a hyphen to join more than two words into a single word.\nknow-it-all\ngood-for-nothing\nfive-year-old\n• Use a hyphen to join two or more words that function as a single modify-\ning word.Ifthe modifying words follow the word they modify,the modi-\nfying words are not hyphenated. Pay special attention to how these\nhyphenated adjectives are used when they follow the nouns they modify.\nAn ill-trainedevaluator causes more problems than no evaluator at all.\nThe evaluator was ill trained.\nManagement and the union finally agreed after months ofhard-nosed\nnegotiations.\nThe negotiations were hard nosed.\nNote: Some hyphenated adjectives,such as old-fashioned and ladder-back,and\nthe words in the following section,keep their hyphens no matter where they are\nin a sentence.Check a recent dictionary when in doubt.\n• Use a hyphen to join prefixes such asself,half,ex,all,great,post,pro,for-\nmer,andviceor the suffix electto words.\nThe President unveiled the all-powerful orbiting space station.\nLee Iacocca is a self-mademan.\nYou need to keep your half-baked plans a secret.\nBobby saw his ex-wifeleaving the drug store.\nMax’s great-grandfatherpassed away on Wednesday.\nSenior citizens remember the post-waryears with great fondness.\nThe treasurer-electpicked up all the records from the presiding treasurer.\n• Use a hyphen to avoid confusing or awkward spellings.\nThe committee’s job was to re-pair [not repair]the tournament\nparticipants.\nMy mother decided to re-cover [not recover] her old rocking chair.\nThe doorway had a bell-like [not belllike] shape.\nThe accountant re-examined [not reexamined] the final totals.\n93 GRAMMAR ESSENTIALS\n• Use a hyphen to join a capital letter to a word.\nAfter that you’ll see a T-intersection.\nTurn right at the first road after the S-curve.\nThe carpenter used a T-square.\n• Use a hyphen to write two-word numbers between 21 and 99 as words.\nseventy-two\nthirty-four\nninety-nine\n• Use a hyphen to join fractions written as words.\none-half\nthree-fourths\n• Use a hyphen to join numbers to words used as a single adjective.\nfour-year loan\nsix-foot window\nseven-year lease\ntwo-year-old girl\nNote: When a series of similar number-word adjectives is written in a sen-\ntence,use a hyphen\/comma combination with all but the last item in the\nseries.\nPlywood comes in two-,four-,and six-foot sheets.\nJoe scored three touchdowns on twelve-,sixteen-,and five-yardcarries.\n• Use an en dash to join numbers indicating a life span,a score,or the dura-\ntion ofan event.\nWilliam Shakespeare (1564–1616) is the most widely read English writer.\nThe Cyclones won the game 78–67.\nThe speech should last 5–7 minutes.\n94 THE FINER POINTS OF PUNCTUATION\n• Use a hyphen to separate a word between syllables at the end ofa line.Here\nare a few guidelines for dividing words:\nNever leave a single-letter syllable on a line.\nDivide hyphenated words at the hyphen.\nNever divide a one-syllable word.\nAvoid dividing words that have fewer than six letters.\nAvoid dividing the last word ofa paragraph.\nAvoid dividing a number.\nWhen in doubt,always check a dictionary.\nPractice\nAdd hyphens where they are needed in the following sentences.Check your work\nwith the answers at the end ofthe chapter.\n1. After examining your brain X rays,I see little justification for you to act like\na know it all.\n2. Linda May,now an ex corporate lawyer,reevaluated her career goals and\nbecame a selfhelp author.\n3. Eileen’s well researched presentation impressed the audience oftwenty five.\n4. Allison’s time in the one hundred meter dash beat mine by three tenths of\na second.\n5. After a day long business venture involving a water stand,the seven year old\ntwins had made a ten cent profit.\nPARENTHESES\n• Use parentheses to enclose explanations that interrupt the normal flow of\nthe sentence and are only marginally related to the text.Note:Parentheses\nare often interchangeable with dashes in this kind ofsentence (see Chap-\nter 10).\nCenter Street (a party neighborhood ifthere ever was one) is a great place\nto live.\nThe neighbors had a picnic on Fourth of July. (Fortunately, we were\ninvited.)\nUnfortunately,another set of neighbors (they were not invited) called\nthe police to complain about the noise (probably that ofthe illegal\nfireworks).\nWe party-goers (how were we to know?) were completely surprised by\nthe officers.\n95 GRAMMAR ESSENTIALS\nNotice the last three sentences.Each set ofparentheses contains a complete\nsentence.If the parenthetical construction comes at the end of a sentence,it is\npunctuated as its own sentence within the parentheses.On the other hand,if it\ncomes within another sentence,no capital letters or periods are necessary.How-\never,ifthe parenthetical construction in the middle ofanother sentence is a sen-\ntence that would normally require a question mark or exclamation point,include\nthat punctuation.\n• Use parentheses to enclose information when accuracy is essential.\nThe twin children of the deceased couple (Alma and Otto Priggi)\nrequested an autopsy.\nThe client agrees to pay the sum of two hundred twenty-five dollars\n($225) per hour.\nDIAGONAL MARK\nMuch like the hyphen,a diagonalmark(also called a solidusor a slantmark) is\nused to join words or numbers.The most frequent use ofthe diagonal is with the\nwordsand\/or,which shows that the sentence refers to one or both of the words\nbeing joined.\nThe cast will consent to interviews on radio and\/or TV.\nApplesauce and\/or blended fruits can replace oil in most cake recipes.\n• Use a diagonal mark to separate numbers in a fraction.\nIt takes us 4½hours to do the inventory at the end ofthe week.\nHe’ll want a 1⅝-inch wrench for this nut.\nNUMBERS\nIn newspaper writing,figures,or numerals,are used instead ofwords because they\nare easier to identify and read.However,a number at the beginning ofa sentence\nis always written as a word.In more formal writing,follow these rules.\n• Ifa number can be written as one or two words,write it as a word.Other-\nwise,write the numeral.\nWe saw fifteen safety movies last year.\n96 THE FINER POINTS OF PUNCTUATION\nWe saw 115 safety movies last year.\nThe student wrote “I will not talk in class”three hundred times.\nThe student wrote “I will not talk in class”350 times.\n• Use Arabic numerals (1,2,25) rather than Roman numerals (I,II,XXV).\n• Always write a number at the beginning ofsentence as a word even ifit is\nmore than two words.\nOne hundred twenty-five employees received year-end bonuses.\nPractice\nUse what you have learned about punctuation and capitalization to correct the fol-\nlowing sentences.Check your work with the answers at the end ofthe chapter.\n6. our new four wheel drive vehicle I have never liked Jeeps is in the shop again\n7. sugar ray leonard what kind ofname is sugar fought his way out ofretire-\nment several times\n8. on delivery the recipient will pay the agreed on fee $435.67\n9. employees bonuses will be time and or money for two fifths ofour staff\n10. 4 ofthe workers who received pink slips will be re evaluated\nAnswers\n1. After examining your brain X-rays,I see little justification for you to act like\na know-it-all.\n2. Linda May,now an ex-corporate lawyer,re-evaluated her career goals and\nbecame a self-help author.\n3. Eileen’s well-researched presentation impressed the audience oftwenty-five.\n4. Allison’s time in the one-hundred-meter dash beat mine by three-tenths of\na second.\n5. After a day-long business venture involving a water stand,the seven-year-\nold twins had made a ten-cent profit.\n6. Our new four-wheel-drive vehicle (I have never liked Jeeps) is in the shop\nagain.\n7. Sugar Ray Leonard (what kind ofname is “Sugar”?) fought his way out of\nretirement several times.\n8. On delivery,the recipient will pay the agreed-on fee ($435.67).\n9. Employees’bonuses will be time and\/or money for two-fifths ofour staff.\n10. Four ofthe workers who received pink slips will be re-evaluated.\n97 CHAPTER 12 GRAMMAR IQ QUIZ\nComplete each sentence with the correct past-tense form of the verb listed.Answers and\nexplanations follow the quiz.\n1.cook When we arrived,he was _________dinner for us.\n2.watch I ________ my niece while my sister went shopping.\n3.open She _________ her own business in 2004,and it is thriving.\n4.bake My mother ________ my favorite dish for my birthday last year.\n5.show She ________ a different side to her personality during the meeting.\n6.use My parents ________ to drink a lot ofcoffee.\n7.Karen should (of,have) told me sooner.\nAnswers\n1.cooking (present participle)\n2.watched (past)\n3.opened (past)\n4.baked (past)\n5.showed (past)\n6.used (past)\n7.Karen should havetold me sooner CHAPTER\n12\nVERBS THAT\nFOLLOW THE\nRULES\nVerbs—words that show action or a state of being—\ndrive written language and give it life. Because verbs\nare so important, mistakes involving verbs can be\nglaring. This chapter explains how to use verbs cor-\nrectly in sentences.\nGrammar concepts to know:\n• principal parts of verbs—four basic forms of a verb\n• present—principal part of a verb that describes\naction happening now—or routine action\n• present participle—principal part of a verb that\ndescribes ongoing action and ends in -ing\n• past—principal part of a verb that describes action\nthat happened in the past\n• past participle—principal part of a verb that\ndescribes action that happened in the past and is\nused with a helping verb, such as has, have, or had\nWriters use words to communicate.Few things\nare more confusing to the reader than misusing words—especially\nverbs. Incorrect verb forms call special attention to themselves. This lesson\nexplains how to use regular verbs correctly and highlights a few ofthe most com-\nmon mistakes writers make.\nRead the paragraph on the following page.This letter contains several errors\nin verb tense.Can you spot them? By the end of this chapter,you’ll probably be\nable to correct them all.\n99 GRAMMAR ESSENTIALS\nBen had an accident today.He and I were haul a load offurniture from\nthe warehouse.As we drove,the end gate snap open and a box was fall\nout.Ben yell and I stoped.He putted it back in and slam the end gate\nshut.He snag his thumb in the latch.I looked at it and rubed it.I ask if\nhe was hurt and would oftaken him to the clinic.He seem okay,but later\nwe learn his thumb was broken.\nTHE PRINCIPAL PARTS OF VERBS\nVerbs have four principal parts,or fundamental forms that are used to create a\ntense:present,present participle,past,and past participle.\n• Present:This refers to something that is existing or happening now,or to\nan action that happens routinely.\nI walkmy dog every day.\nThomas ishere already.\nAs soon as my mom wakesup,she goesstraight into the kitchen to make\na pot ofcoffee.\n• Present participle:This is formed by adding -ingto the end ofregular verbs.\nIt is used with forms ofthe verb to be,such as am,is,are,was,or were.The\npresent participle form ofa verb expresses an ongoing action.(The help-\ning verbs are used with the present participle determine tense,which is cov-\nered in Chapter 14.)\nI amlookingfor the notebook I lost in yesterday's class.\nI waseatingdinner when she called.\nThey weretryingto decide where to go on vacation when I arrived.\n• Past:This form ofa verb is used to indicate that something has already been\ncompleted.\nI hiredmy assistant because his resume was impeccable.\nHe learnedJapanese during his semester abroad in Tokyo.\nThey placedtheir trust in the new counselor.\n• Past participle:This is formed by adding -d or -ed to the end of regular\nverbs. It is used with the helping verb have (has, have, or had). I have\nlearneda thing or two in my life.\nShe hasnoticedhis weight gain.\nThey already hadelecteda new chairwoman when she arrived.\n100 VERBS THAT FOLLOW THE RULES\nREGULAR VERBS\nRegular verbs follow a standard set ofrules for forming their present participle and\npast forms.The present participle is formed by adding-ing.Ifthe verb ends with\nthe lettere,drop thee before adding-ing.The past is formed by adding-ed.Ifthe\nverb ends with the lettere,just addd.\nlink: present form\nlinking: forms the present participle by adding-ing\nlinked: forms the past and past participle by adding-ed\nprepare: present form\npreparing: forms the present participle by dropping theeand adding-ing.\nprepared:forms the past and past participle by adding d.\nHere is a list oftwenty regular verbs and all oftheir principal parts.\nPresent Past\nPresent Participle Past Participle\nconnect connecting connected connected\nelect electing elected elected\nexercise exercising exercised exercised\nfollow following followed followed\nguarantee guaranteeing guaranteed guaranteed\nhire hiring hired hired\nimagine imagining imagined imagined\nknock knocked knocking knocked\nlearn learning learned learned\nmatch matching matched matched\nnotice noticing noticed noticed\nprogress progressing progressed progressed\nrate rating rated rated\nsalt salting salted salted\nsolve solving solved solved\ntarget targeting targeted targeted\ntime timing timed timed\nview viewing viewed viewed\nwash washing washed washed\nyell yelling yelled yelled\n101 GRAMMAR ESSENTIALS\nPractice\nFill in the correct form ofthe verb in each ofthe following sentences.The present\nform ofthe verb comes at the beginning ofeach sentence.Check your work with\nthe answers at the end ofthe chapter.\n1.define Paul __________ the word impetusfor us.\n2.leak Water is __________ through the roof.\n3.melt The snow __________ early this year.\n4.organize Kay and Sandy are __________ the retirement dinner this year.\n5.place The custodian __________ an air freshener in the lounge.\nREGULAR VERBS ENDING WITH A VOWEL AND CONSONANT\nThe English language has two kinds ofletters:vowels and consonants.The vow-\nels are a,e,i,o,u.All other letters are consonants.The lettery,however,sometimes\nworks as a vowel and sometimes as a consonant.\nWhen a verb ends with a vowel followed by a consonant (blot,flip,occur),the\nlast consonant is doubled before adding-ing or-ed.The next table shows ten words\nthat end this way.Look carefully at how the present participle and past forms are made.\nnet:present form\nnetting:forms the present participle by doubling the tbefore adding -ing\nnetted:forms the past and past participle by doubling the tand adding -ed\ntrip:present form\ntripping:forms the present participle by doubling the pbefore adding -ing\ntripped:forms the past and past participle by doubling the pand adding\n-ed\nPresent\nPresent Participle Past Past Participle\ncap capping capped capped\ndab dabbing dabbed dabbed\ngrab grabbing grabbed grabbed\nemit emitting emitted emitted\noccur occurring occurred occurred\npin pinning pinned pinned\nscar scarring scarred scarred\nship shipping shipped shipped\nstep stepping stepped stepped\ntrap trapping trapped trapped\n102 VERBS THAT FOLLOW THE RULES\nThis rule has one exception.Ifthe final consonant is a w,it is not doubled\nbefore adding -ingor -ed.Look at the following examples.\nshow: present form\nshowing: present participle\nshowed: past and past participle\nsew: present form\nsewing: present participle\nsewed: past and past participle\nPractice\nFill in the correct form ofthe verb in each ofthe following sentences.The present\nform ofthe verb comes at the beginning ofeach sentence.Check your work with\nthe answers at the end ofthe chapter.\n6.fit My new shoes __________ my feet just fine.\n7.map The survey crew is __________ the plot this afternoon.\n8.slow Lyle _________ down as he approached the stop sign.\n9.refer I think he is __________ to the article in this morning’s paper.\n10. transfer Marcia and Peg have __________ to the new location.\nREGULAR VERBS ENDING WITH A CONSONANT\nFOLLOWED BY Y\nWhen a verb ends with a consonant followed byy(cry,empty,hurry),the present\nparticiple is formed by adding-ing.To create the past form,drop they,replace it\nwithi,and add-ed.The examples show how this is done.The table that follows\ncontains ten words that end in this way.Look carefully at how the past and past\nparticiples are formed.\nfry: present form\nfrying: present participle\nfried: forms the past and past participle by changing theytoi and adding\n-ed\nstudy: present form\nstudying: present participle\nstudied: forms the past and past participle by changing the y to i and\nadding-ed\n103 GRAMMAR ESSENTIALS\nPresent\nPresent Participle Past Past Participle\nfalsify falsifying falsified falsified\nmagnify magnifyin magnified magnified\nmarry marrying married married\nmultiply multiplying multiplied multiplied\noccupy occupying occupied occupied\npity pitying pitied pitied\npry prying pried pried\nqualify qualifying qualified qualified\nunify unifying unified unified\nverify verifying verified verified\nPractice\nFill in the correct form ofthe verb in each ofthe following sentences.The present\nform ofthe verb comes at the beginning ofeach sentence.Check your work with\nthe answers at the end ofthe chapter.\n11. try The wolf__________ desperately to escape from the trap.\n12. nullify The new contract __________ the old one.\n13. tally The election committee is __________ the votes right now.\n14. pity The children __________ the caged puppy.\n15. qualify Marge’s time in the race __________ her for the national meet.\nONE-PART REGULAR VERBS\nSome verbs in the English language have the same present,past,and past partici-\nple form.The only time these verbs change is when-ingis added to form the pre-\nsent participle.Here is a partial list ofthose verbs,followed by several examples.\nbet hit set\nbid hurt shut\nburst put spread\ncost quit upset\ncut read\n104 VERBS THAT FOLLOW THE RULES\nThe first baseman hita home run.(present)\nIn yesterday’s game,the first baseman hita home run.(past)\nThe first baseman has hittwenty home runs so far this year.\n(past participle)\nThe first baseman is hittingyet another home run.(present participle—\nthe only one that changes)\nDon’t Forget the -ed\nSome words are written incorrectly because we don’t always use or hear the-ed\ninspoken English.Remember to add-edto the past and past participle forms of\nthese words.The ones most commonly misused are shown in the next table.\nPresent\nPresent Participle Past Past Participle\nask asking asked asked\nrisk risking risked risked\nsuppose supposing supposed supposed\nuse using used used\nWe asked [not ask] to see the record book.\nThe rescuers risked [not risk] their lives to save the stranded mountain\nclimbers.\nWe are supposed [not suppose] to finish this for tomorrow.\nThis group is used [not use] to working together.\nDon’t Use of in Place of have\nAnother problem resulting from pronunciation is using ofinstead ofhave in par-\nticipial phrases.Could’ve sounds just like could of—but could have is correct and\ncould ofis wrong.\nWrong:Hansel could ofseen the danger ifhe had looked more carefully.\nCorrect: Hansel could have seen the danger if he had looked more\ncarefully.\nWrong:The farmer should ofwarned us about the dog.\nCorrect:The farmer should havewarned us about the dog.\nWrong:I wish the contractor would oftaken care ofthis for us.\nCorrect:I wish the contractor would havetaken care ofthis for us.\n105 GRAMMAR ESSENTIALS\nPractice\nUse what you have learned about verbs to correct the following sentences.Check\nyour work with the corrected sentences that follow.\n16. Sally wish her husband would ofremembered to pack her lunch.\n17. That’s not the way we use to do it.\n18. Juwon risk serious injury by wipe the acid spill.\n19. You could ofimproved your chances by preparing ahead oftime.\n20. Ryan ask the question that the rest ofus were afraid to ask.\nREVIEW\nRemember the paragraph at the beginning of the chapter? Take another look at\nit and correct all ofthe errors you find.Compare your version to the corrected ver-\nsion below.The changes have been bolded for you.\nBen had an accident today.He and I were haulinga load of furniture\nfrom the warehouse.As we drove,the end gate snapped open and a box\nfellout.Ben yelledand I stopped.He putit back in and slammed the\nend gate shut.He snagged his thumb in the latch.I looked at it and\nrubbed it.I asked ifhe was hurt and would havetaken him to the clinic.\nHe seemedokay,but later,we learnedhis thumb was broken.\nAnswers\n1. defined\n2. leaking\n3. melted\n4. organizing\n5. placed\n6. fit\n7. mapping\n8. slowed\n9. referring\n10. transferred\n11. tried\n12. nullified (or nullifies)\n13. tallying\n14. pitied\n106 VERBS THAT FOLLOW THE RULES\n15. qualified\n16. Sally wished her husband would have remembered to pack her lunch.\n17. That’s not the way we used to do it.\n18. Juwon risked serious injury by wiping the acid spill.\n19. You could have improved your chances by preparing ahead oftime.\n20. Ryan asked the question that the rest ofus were afraid to ask.\n107 CHAPTER 13 GRAMMAR IQ QUIZ\nChoose the correct form of the verb in each of the following sentences.Answers follow\nthequiz.\n1.The teacher (ask,asked) the student a question.\n2.Life (dealed,dealt) me a good hand.\n3.The plumbers (do,did,done) a good job ofstopping the leak.\n4.The lake will (freeze,froze,frozen) over by morning.\n5.My new diet has not yet (begin,began,begun) to work.\nAnswers\n1.asked\n2.dealt\n3.did\n4.freeze\n5.begun CHAPTER\n13\nREBELLIOUS\nVERBS\nThe last chapter explained how and when to use reg-\nular verbs. This chapter explains how to use irregular\nverbs—the ones that don’t follow the rules.\nGrammar concept to know:\n• irregular verb—a verb that forms its past and\npast participle forms in a unique way\nMost verbs in the English language are regular,\nbut approximately 150 verbs are not.Most ofthe irregularities involve\nthe ways in which the past and past participle are formed.This chapter covers many\nofthese verbs and provides practice in using them.Read the following note,writ-\nten by an employee to a supervisor.How many errors in using irregular verbs can\nyou spot?\nI done what you ask this morning.I digged through the recycling bin\nto look for your records.I seen a few things that seemed like what we\nwas looking for,but I think last night’s trash must have went to the\ndumpster,and I ain’t digging in there.\n109 GRAMMAR ESSENTIALS\nIRREGULAR VERBS WITH SIMILAR PAST AND PAST\nPARTICIPLE FORMS\nThis table includes some ofthe most commonly used irregular verbs.All ofthem\nhave the same past and past participle,except for the last three.The last three words\nform their principal parts in the same way and have a past participle form that is\nsimilar,though not identical,to the past form.Following the table are some exer-\ncises in using these verbs.\nPast Participle (used\nPresent Past with have, has, had)\nbite bit bit\ndig dug dug\nbleed bled bled\nhear heard heard\nhold held held\nlight lit lit\nmeet met met\npay paid paid\nsay said said\nsell sold sold\ntell told told\nshine shone shone\nshoot shot shot\nsit sat sat\nspin spun spun\nspit spat spat\nwin won won\nswear swore sworn\ntear tore torn\nwear wore worn\nPractice\nChoose the correct form ofthe verb in each ofthe sentences that follow.Remem-\nber to use present tense for things happening now,and past tense for things that\nhave already happened. Check your work with the answers at the end of the\nchapter.\n1. The dentist (ask,asked) me to (bite,bit) down hard on the X-ray tabs.\n2. Dark-colored garments (bleed,bled) freely in hot water.\n110 REBELLIOUS VERBS\n3. I (hear,heard) yesterday that you plan to move before summer.\n4. Will (pay,paid) his bills with a credit card.\n5. It’s cold enough to (light,lit) the furnace.\n6. Breanna never (tell,told) us what you meant.\n7. The moon (shine,shone) through the trees,making eerie shadows on the\nground.\n8. The tires did nothing but (spin,spun) on the glare ice.\n9. Ifwe (win,won) this game,we advance to the playoffs.\n10. Collin (tear,tore) his jeans climbing over the barbed wire fence.\nMORE IRREGULAR VERBS WITH TWO IDENTICAL PARTS\nHere’s another table of irregular verbs whose past and past participle are the\nsame.Study them,and then complete the exercises that follow.\nPast Participle (used\nPresent Past with have, has, had)\ncreep crept crept\ndeal dealt dealt\nkeep kept kept\nkneel knelt knelt\nleave left left\nmean meant meant\nsend sent sent\nsleep slept slept\nspend spent spent\nsweep swept swept\nbring brought brought\nbuy bought bought\ncatch caught caught\nfight fought fought\nteach taught taught\nthink thought thought\nfeed fed fed\nflee fled fled\nfind found found\ngrind ground ground\n111 GRAMMAR ESSENTIALS\nPractice\nChoose the correct form ofthe verb in each ofthe following sentences.Remem-\nber to use present tense for things happening now,and past tense for things that\nhave already happened. Check your work with the answers at the end of the\nchapter.\n11. The gambler folded the hand he was (deal,dealt).\n12. The detectives (keep,kept) the suspect under surveillance all last night.\n13. The would-be knight (kneel,knelt) before the king.\n14. Do you (mean,meant) that we’ll be without electricity all evening?\n15. The twins (spend,spent) last evening with their grandparents.\n16. We always (bring,brought) deviled eggs to every family picnic.\n17. The centerfielder (catch,caught) the ball and threw it to home plate.\n18. Hal (think,thought) the fruit would have been delivered by now.\n19. We (find,found) water in our basement every spring.\n20. The deer (flee,fled) after they saw our headlights.\nIRREGULAR VERBS WITH THREE DISTINCT FORMS\nThe irregular verbs in this table are grouped with other verbs that form their prin-\ncipal parts in similar ways.See if you can detect any patterns or groups in these\nirregular verbs.\nPast Participle (used\nPresent Past with have, has, had)\nbegin began begun\nring rang rung\nsing sang sung\nspring sprang sprung\ndo did done\ngo went gone\nam was been\nis was been\ndrink drank drunk\nshrink shrank shrunk\nsink sank sunk\nstink stank stunk\nblow blew blown\ndraw drew drawn\ngrow grew grown\n112 REBELLIOUS VERBS\nPast Participle (used\nPresent Past with have, has, had)\nknow knew known\nthrow threw thrown\nfly flew flown\ndrive drove driven\nstrive strove striven\nPractice\nChoose the correct form ofthe verb in each ofthe following sentences.Remem-\nber to use present tense for things happening now,past tense for things that have\nalready happened,and past participle with have,has,or had.Check your work with\nthe answers at the end ofthe chapter.\n21. It has (begin,began,begun) to rain.\n22. The congregation (sing,sang,sung) the first two verses ofthe hymn.\n23. The builder (do,did,done) all the planning for us.\n24. The neighbors have (go,went,gone) on vacation.\n25. Jack (is,was,has been) putting in overtime for that last three weeks.\n26. The sweatshirt (shrink,shrank,shrunk) when I washed it.\n27. The ship must have (sink,sank,sunk) about 125 years ago.\n28. All oftheir children have (grow,grew,grown) up and moved away.\n29. The proprietor (know,knew,known) his supplies were running short.\n30. The teenage boy (drive,drove,driven) his way to high insurance rates.\nMORE THREE-PART IRREGULAR VERBS\nThe next table also includes verbs grouped with others that form their principal parts\nin similar ways.See ifyou can detect the patterns.\nPast Participle (used\nPresent Past with have, has, had)\nchoose chose chosen\nrise rose risen\nbreak broke broken\nspeak spoke spoken\nfall fell fallen\nshake shook shaken\ntake took taken\nforget forgot forgotten\n113 GRAMMAR ESSENTIALS\nPast Participle (used\nPresent Past with have, has, had)\nget got gotten\ngive gave given\nforgive forgave forgiven\nforsake forsook forsaken\nhide hid hidden\nride rode ridden\nwrite wrote written\ncome came come\novercome overcame overcome\nrun ran run\nfreeze froze frozen\nsteal stole stolen\nPractice\nChoose the correct form ofthe verb in each ofthe sentences that follow.Remem-\nber to use present tense for things happening now,past tense for things that have\nalready happened,and past participle withhave,has,or had.Check your work with\nthe answers at the end ofthe chapter.\n31. The gambler must have (choose,chose,chosen) the lucky dice.\n32. The band on this watch (break,broke,broken).\n33. Hoards ofwalnuts (fall,fell,fallen) from the tree that fall.\n34. The audience grew deathly quiet when they realized the star had (forget,for-\ngot,forgotten) his lines.\n35. Becky’s parents (give,gave,given) her clothes for Christmas.\n36. The dog must have (hide,hid,hidden) your slippers.\n37. Have you (write,wrote,written) to your mother lately?\n38. The newlyweds (come,came) home to a completely empty house.\n39. Water will (freeze,froze,frozen) at 32 degrees Fahrenheit.\n40. More time has been (steal,stole,stolen) by procrastination than any other\nthief.\n114 REBELLIOUS VERBS\nAin’t\nAin’tis a substandard English word that should never be used in business language.\nIt belongs in the same category as wannaand gonna.You may hear these words\nwhen people speak,but they are not used in formal writing.Instead ofain’t,use\nis notor isn’t,am not,and are not or aren’t.\nIncorrect:I ain’t interested in your product.\nCorrect:I am not interested in your product.\nIncorrect:He ain’t the problem here.\nCorrect:He isn’t the problem here.\nIncorrect:We ain’t supposed to know about the party.\nCorrect:We aren’t supposed to know about the party.\nREVIEW\nRemember the paragraph at the beginning of the chapter? Take another look at\nit and correct all ofthe verb errors you find.Compare your version ofthe para-\ngraph to the corrected one that follows.The changes have been bolded for you.\nI didwhat you asked this morning.I dugthrough the recycling bin to\nlook for your records.I sawa few things that seemed like what we were\nlooking for,but I think last night’s trash must have goneto the dump-\nster,and I’m notdigging in there.\nPractice\nChoose the correct form ofthe verb in each ofthe following sentences.Check your\nwork with the answers at the end ofthe chapter.\n41. Your department certainly (do,did,done) a good job on this project.\n42. The manager just (throw, threw, thrown) away a chance to increase the\nstore’s sales.\n43. The president (speak,spoke,spoken) at the cabinet meeting.\n44. The phone has (ring,rang,rung) continuously all day long.\n45. The minister (come,came) to the point very early in the sermon.\n115 GRAMMAR ESSENTIALS\n46. Harriet (see,saw,seen) the advertisement for the new product in a catalog.\n47. The new tree has not yet (begin,began,begun) to produce fruit.\n48. Has the admitting staff(go,went,gone) nuts?\n49. Heather lost a filling when she (bite,bit,bitten) into the piece ofhard candy.\n50. The attendant couldn’t believe that someone had actually (steal, stole,\nstolen) a car from the ramp.\nAnswers\n1. asked,bite 18. thought 35. gave\n2. bleed 19. find 36. hidden\n3. heard 20. fled 37. written\n4. paid 21. begun 38. came\n5. light 22. sang 39. freeze\n6. told 23. did 40. stolen\n7. shone 24. gone 41. did\n8. spin 25. has been 42. threw\n9. win 26. shrank 43. spoke\n10. tore 27. sunk 44. rung\n11. dealt 28. grown 45. came\n12. kept 29. knew 46. saw\n13. knelt 30. drove 47. begun\n14. mean 31. chosen 48. gone\n15. spent 32. broke 49. bit\n16. bring 33. fell 50. stolen\n17. caught 34. forgotten\n116  CHAPTER 14 GRAMMAR IQ QUIZ\nChoose the correct verb form in each ofthe following sentences.Answers follow the quiz.\n1. Hilary (realize,realized,had realized) that she (leave,left,had left) her purse inside\nthe house.\n2. The representative (think,thought,had thought) the merchandise (ship,shipped,had\nbeen shipped) the day before.\n3. Miguel (knocks,knocked,had knocked) and (rings,rang,had rung) the doorbell.\n4. Since the supplies (arrive,arrived,had arrived),we (begin,began,had begun) to work.\n5. The new superintendent (is,was,been) very friendly.[Assume that the superinten-\ndent is living.]\nAnswers\n1. realized,had left\n2. thought,had been shipped\n3. knocked,rang or knocks,rings or had knocked,had rung\n4. had arrived,began\n5. is CHAPTER\n14\nDON’T BE TENSE\nABOUT VERBS\nYesterday, today, and tomorrow: This chapter covers\nthe fine points of verb tenses, the verb forms that\nexpress the time an action occurs. By the end of this\nchapter you’ll have a better understanding of how to\nuse past-, present-, and future-tense verbs.\nGrammar concepts to know:\n• verb tense—form of a verb that indicates when\nthe action occurs\n• subjunctive mood—form of a verb used to indi-\ncate a condition contrary to fact\nVerb tense tells readers the time an action takes\nplace, so writers need to know how to use it accurately. This chapter\nexplains how to keep verb tense consistent and when to switch tense.\nKEEPING VERB TENSE CONSISTENT\nThe tense ofa verb tells when an action occurs,occurred,or will occur.Verbs have\nthree basic tenses:present,past,and future.A passage that begins in present tense\nshould continue in present tense.Ifit begins in past tense,it should stay in past\ntense.Do not mix tenses as you write.\n119 GRAMMAR ESSENTIALS\nWrong:The officer unlockedthe trunk and searchesfor contraband.\nCorrect:The officer unlockedthe trunk and searchedfor contraband.\nCorrect:The officer unlocksthe trunk and searchesfor contraband.\nWrong:When we increaseadvertising expenses,we reducedprofits.\nCorrect:When we increaseadvertising expenses,we reduceprofits.\nCorrect:When we increasedadvertising expenses,we reducedprofits.\nUSING TENSE TO CONVEY MEANING\nUsing verb tense carefully helps writers avoid confusing the reader.The following\nexamples illustrate how tense can completely change the meaning ofa sentence.\nRichard discovered that Patty had left home and gone to work.(Patty had\ngone to work.)\nRichard discovered that Patty had left home and went to work.(Richard\nwent to work.)\nLinda already had bought groceries and cooked dinner when Hal arrived.\n(When Hal arrived,Linda had already completed two actions before\nhis arrival—she had bought groceries and cooked dinner.)\nLinda already had bought groceries and was cooking dinner when Hal\narrived.(When Hal arrived,Linda had completed one action—she\nhad bought groceries—and was in the middle of another action-\ncooking dinner.)\nTHE FINE POINTS OF VERB TENSE\nSometimes,a writer must show that an action occurred at another time,regard-\nless ofthe tense in which the passage begins.To allow this,each ofthe three basic\ntenses has three subdivisions:progressive,perfect,and progressive perfect.\nPresent tense shows action that happens now or action that happens rou-\ntinely.The present progressivetense shows an action that is happening now.A\nhelping,or auxiliary,verb (am,is,or are) always precedes the-ing form (progressive\nform) ofthe verb to create the present progressive tense.The present perfecttense\nshows an action that was completed in the indefinite past.A helping verb (have\norhas) precedes the past form of the verb to create this tense.The present per-\nfect progressive tense shows action that began in the past and is continuing in the\npresent to create this tense,helping verbs (have been orhas been) precede the verb\nwritten in its-ing form (progressive form).\n120 DON’T BE TENSE ABOUT VERBS\nPresent Present Present Perfect Present Perfect\nProgressive Progressive\n(shows action (-ingform preceded (shows action that (shows action that\nhappening now or by am,is,are) began in the past; began in the past and\nroutinely) uses has,have) continues now;uses\nhasor have been)\nOptimists hope for Optimists are hoping Optimists have Optimists have been\nthe best. for the best. hoped for the best. hoping for the best.\nSmoking causes Smoking is causing Smoking has caused Smoking has been\ncancer in millions of cancer in millions of cancer in millions of causing cancer in\npeople. people. people. millions ofpeople.\nAll present-tense forms can be used without shifting verb tense.Read the\nparagraph below to see how this is done.The verbs are italicized,and the words\nin parentheses identify the tense.\nThe city planners are hoping(present progressive) to revamp the old sta-\ndium,which the Redbirds use(present).For years fans have complained\n(present perfect) about parking,and officials pay(present) little atten-\ntion. Season ticket holders have been boycotting (present perfect pro-\ngressive) games for the last month,but their absence has gone(present\nperfect) unnoticed.They demand(present) adequate parking.\nPast tenseshows action that was completed in the past.It uses the past form\nof the verb.The past progressivetense shows an ongoing action in the past.To\nform this tense,a helping verb (wasor were) precedes the progressive form ofthe\nverb.The past perfecttense shows an action completed in the past before some\nother past action.The helping verb hadprecedes the past participle form ofthe\nverb to form the past perfect.The past perfect progressivetense shows continu-\ning action that began in the past before another action in the past.The helping\nverbs had been precede the progressive form ofthe verb to form this tense.\n121 GRAMMAR ESSENTIALS\nPast Past Past Perfect Past Perfect\nProgressive Progressive\n(action completed in (-ingform,continu- (action completed (continuing action\nthe past) ing action in the prior to another in the past before\npast;uses was,were) action;uses had) another action in the\npast;uses had been)\nParents spoke to the Parents were speak- Parents had already Parents had been\nteachers. ing to the teachers. spoken to the speaking to the\nteachers. teachers for halfan\nhour by the time I\narrived.\nThe principal held The principal was The principal had The principal had\nthe meetings. holding the already held the been holding the\nmeetings. meetings. meetings before the\nmath teacher took\nover.\nAll past-tense forms can be used in one writing passage,as they do not con-\nstitute a shift in tense.The paragraph that follows illustrates how this is done.The\nverbs are italicized,and the words in parentheses identify the tense.\nLast fall, school officials warned (past) students about bringing cell\nphones to school. Most students complied (past) with the request;\nhowever,someignored(past) the rules andcontinued(past) to carry\nthe cells they had been bringing (past perfect progressive) to school.\nThey had carried (past perfect) them the previous year and planned\n(past) to continue.Around mid-year,several studentswere suspended\n(past).A Times reporter, who had been following (past perfect pro-\ngressive) the story,challenged(past) the legality ofthe school’s rule.A\nsuithas been filed(past perfect) on behalfofthe suspended students,\nbut ithasnotcome(past perfect) before the court.\nFuture tenseshows action that has yet to happen.The helping verbs will,would,\nor shallprecede the present form ofthe verb to form the future tense.The future\nprogressive tense shows ongoing actions in the future.To form this tense,the help-\ning-verb phraseswill be,shall be,orwould beprecede the progressive form ofthe verb.\nThe future perfect tense shows actions that will be completed.The helping-verb\nphraseswill have,would have,orwill have beenprecede the past participle form of\n122 DON’T BE TENSE ABOUT VERBS\nthe verb to form the future perfect.The future perfect progressive tense shows con-\ntinuing actions that will be completed before another future action or time.The verb\nphraseswill have been,would have been,orshall have beenprecede the progressive\nform ofthe verb to form this tense.\nFuture Future Future Perfect Future Perfect\nProgressive Progressive\n(action that will (continuing action (action that will be (continuing action\nhappen;uses will, that will happen) completed before that will be\nwould,shall) another future completedbefore\naction or time) anotherfuture action\nor time)\nWe will begin a Everyone will be By summer,we will By then,legislaters\nletter-writing writing letters. have written reams will have been\ncampaign. ofletters. receiving letters\nthroughout the year.\nNewspapers will Newspapers will be By summer,every By summer,newspa-\ncover this case. covering this case. newspaper will pers will have been\nhave written about covering the case for\nthis case. three months.\nAll future-tense forms can be used in one writing passage,as they do not con-\nstitute a shift in tense.The next paragraph illustrates how this is done.The verbs\nare italicized and the words in parentheses identify the tense.\nBecause so many people are moving to the area,K & M Real Estate\nwilldevelop(future) the land just east ofthe river.This willassure\n(future) that the property value of the surrounding neighborhood\nwillincrease(future).K & Mwill be building(future progressive)\nmodern condominiums,which will add a nice aesthetic to the neigh-\nborhood.By next spring,the park next to the condos willhavebeen\ncompleted(future perfect),and people will have been living(future\nperfect progressive) in the condos since February.\nIMPROPER USE OF PAST TENSE\nDon’t use past tense to make a statement about a present condition.\nZelda met the new director.He wasvery tall.[Isn’t he still tall?]\nZelda met the new director.He isvery tall.\n123 GRAMMAR ESSENTIALS\nI visited a bed and breakfast inn near the edge oftown.The building was\nVictorian.[Isn’t it still Victorian?]\nI visited a bed and breakfast inn near the edge of town.The building\nis Victorian.\nPRESENT TENSE FOR STATEMENTS\nOF GENERAL TRUTH OR FACT\nEven ifa passage is written in past tense,a general statement oftruth or fact is writ-\nten in present tense.\nDuring Galileo’s time,few people believed(past) that the earth revolves\n(present) around the sun.\nThe engineer explained (past) to the city council that the streets run\n(present) parallel to the freeway.\nSUBJUNCTIVE MOOD FOR CONDITIONS CONTRARY TO FACT\nWhen Tevya inFiddler on the Roofsings,“IfI were a rich man ...”he uses the verb\nwereto signal that he is only imagining what he would do as a rich man.The sub-\njunctive mood ofverbs is used to express something that is wished for or that is con-\ntrary to fact.The subjunctive ofwas is were.\nIfyou werea cat,you would be entirely dependent on human beings.[You\nare not a cat.]\nIf Anthony were more responsible, he could be trusted with this job.\n[Anthony is not responsible.]\nPractice\nUse what you have learned about verb tense to choose the correct option in\neach of the following sentences.Check your work with the answers on the fol-\nlowing page.\n1. After Ethel knocked on the door,she (ring,rang,had rung) the doorbell.\n2. By the time I get on the plane,she will (read,have read) my love letter.\n3. My teacher explained why Mars (is,was) red.\n4. I would finish the job ifI (was,were) you.\n5. The office morale has already (begin,began,begun) to suffer.\n124 DON’T BE TENSE ABOUT VERBS\n6. Yesterday,the nurse (takes,took) my pulse and (measures,measured) my\nblood pressure.\n7. Most ofus wish we would (of,have) taken stock options rather than year-\nend bonuses.\n8. Charles wishes he had ordered a large burger because his (is,was) too small.\n9. Dr.Carnes announced that the department chair (is,was) responsible for\nwork schedules.\n10. The packing plant could cut transportation costs ifit (was,were) closer to\na livestock confinement.\n11. After I rented the movie,I realized that I already (saw,had seen,have seen)it.\n12. IfI (was,were) president ofthe United States,I’d abolish income taxes.\n13. Alvin opened the door and (look,looks,looked) inside.\n14. When we increase maintenance service,we (reduce,reduced) repair costs.\n15. The company had dumped waste into the river for years and it (plans,\nplanned,had planned) to continue doing so until new laws were passed.\n16. I met the new technician.He (is,was) very personable.\n17. Because Peter loved his job,he (takes,took) it very seriously.\n18. I ate at a new restaurant last night,and the decor (is,was) wonderful.\n19. I like knowing that my work (is,was) done well.\n20. Hesari has been desperate to (take,took,have taken) time offwork.\nAnswers\n1.rang 11.had seen\n2.have read 12.were\n3.is 13.looked\n4.were 14.reduce\n5.begun 15.planned\n6.took\/measured 16.is\n7.have 17.took\n8.is 18.is\n9.is 19.is\n10.were 20.take\n125 CHAPTER 15 GRAMMAR IQ QUIZ\nChoose the verb that matches the subject in each of the following sentences. Answers\nfollow the quiz.\n1.The child (doesn’t,don’t) want to go to bed just yet.\n2.One ofthe assignments (is,are) missing.\n3.Aerobics (is,are) good for general health and weight management.\n4.Either ofthese faucets (is,are) fine for the bathroom sink.\n5.Either Eugene or Bernice (want,wants) to go on a week-long cruise.\n6.There (isn’t,aren’t) many files left to read.\n7.Neither the coach nor the players (knows,know) the score.\n8.Neither the players nor the coach (knows,know) the score.\n9.The manager,as well as the associates,(is,are) scheduled to work the late shift.\n10.The package (wasn’t,weren’t) where we had left it.\nAnswers\n1.doesn’t (child doesn’t…)\n2.is (one assignment is…)\n3.is (Aerobics is one type ofactivity.)\n4.is (either faucet is…)\n5.wants (Eugene wants,Bernice wants)\n6.aren’t (files aren’t…)\n7.know (players know...)\n8.knows (coach knows...)\n9.is (manager is...)\n10. wasn’t (package wasn’t…) CHAPTER\n15\nMAKING\nSUBJECTS AND\nVERBS AGREE\nHe don’t or he doesn’t? Most native English speak-\ners automatically choose the second version. Subject-\nverb agreement is so important in speaking and\nwriting that errors in this area really stand out. This\nchapter highlights some of the situations that cause\nagreement problems even for native speakers and\nexplains how to handle them correctly in writing.\nGrammar concepts to know:\n• subject-verb agreement—when a subject in a\nsentence matches the verb in number\n• compound subject—two or more subjects that\nshare the same verb and that are joined by a\nconjunction\nW hen the subject of a clause—the person or\nthing doing the action—matches the verb in number (both singular or\nboth plural),we say the subject and verb are in agreement.Most English speakers\nhave little trouble matching subjects with the correct verbs,but a few grammati-\ncal constructions do pose some problems.This chapter explains the concept of\nsubject-verb agreement and provides practice in problem areas.\nThe memo on the following page contains several subject-verb agreement\nerrors.See how many you can spot.By the end ofthis chapter,you should be able\nto recognize them all.\n127 GRAMMAR ESSENTIALS\nTo:Jessica Amerson\nFrom:Tyson Hall\nRe:Aides\/floor nurse dispute\nDate:July 21,1997\nThe nurse’s aides was having trouble with the floor nurse yesterday.\nHe don’t think he should help with unloading supplies.Every one\nofthe aides are just as busy as he is.The aides think he should do\nhis part too.They wasn’t very happy with him when he refused.\nMelinda and Connie is thinking about filing a complaint.Neither\nthe aides nor the floor nurse need this fuss.Maybe you can see if\neither the floor nurse or the aides is willing to find a better solution.\nMAKING SUBJECTS AGREE WITH THEIR VERBS IN NUMBER\nA subject should agree with its verb in number.In other words,ifa subject is sin-\ngular,the verb must be singular;ifthe subject is plural,the verb must be plural.\nIfyou are unsure whether a verb is singular or plural,apply this simple test.Fill\nin the blanks in the two sentences that follow with the matching form ofthe verb.\nThe verb form that best completes the first sentence is singular.The verb form that\nbest completes the second sentence is plural.\nHe _____.[singular]\nThey _____.[plural]\nLook at these examples using the verbslook,do,andwas.Try it yourselfwith\nany verb that confuses you.Unlike nouns,most verbs ending insare singular.\nHe looks. He does. He was. [singular]\nThey look. They do. They were. [plural]\nNote,however,that the subject I,even though it is a single person,usually takes\nthe plural form.\nI look. I do. I am.\nProblem Verb Forms and Constructions\nThe verb form to be—be,am,is,are,was,were—can pose special problems because\nthe principal parts are formed in such unusual ways.The following list shows how\nto use the verb form to be.\n128 MAKING SUBJECTS AND VERBS AGREE\nSubject Present Past Past Participle\nI I am I was I have been\nyou you are you were you have been\nhe,she,it he is she was it has been\nwe we are we were we have been\nthey they are they were they have been\nNever use thebe form after a subject.\nIncorrect:I be going.\nCorrect:I am going.\nIncorrect:They be on their way.\nCorrect:They are on their way.\nTwo other constructions often cause problems for people:doesn’t\/don’t (mean-\ning does not,do not) and wasn’t\/weren’t(meaning was not,were not).Doesn’tand\nwasn’tare singular;don’tandweren’tare plural.(But remember thatI takes the\nplural form.)\nI don’t want to move until next year.\nShe doesn’t want to move until next year.\nThey don’t want to move until next year.\nI wasn’t sure.\nYou weren’t sure.\nWe weren’t sure.\nPhrases Following Subjects Don’t Affect Verbs\nPay careful attention to the subject in a sentence.Do not allow a phrase follow-\ning it to mislead you into using a verb that does not agree with the subject.The\nsubjects and verbs are in bold in the following examples.\nOneofthe chairsisdamaged.\nThe window designsby Rick Baker arecomplex and colorful.\nA manualwith thorough instructions comeswith this printer.\nThe principal,along with her three associates,returnsfrom the work-\nshop today.\n129 GRAMMAR ESSENTIALS\nSpecial Singular Subjects\nSome nouns are singular even though they end ins.Despite that they sound plural,\nthey require a singular verb because we think ofthem as a single unit.Most ofthe\nnouns in the following list are singular.Some can be either singular or plural,\ndepending on their use in the sentence.These are just a few examples:measles,\nmumps,news,checkers ormarbles (games),physics,economics,mathematics,civics,\nathletics,sports,politics,statistics.\nThe newsisover at 9:30.\nDartsismy favorite game.\nSportsisa healthy stress reliever.Low-impact aerobicsisbest for older\nadults.\nWords that express an amount may be singular or plural.Amounts are sin-\ngular when the amount is thought of as a unit,and plural when the amount is\nthought ofas many parts.\nSix dollars isthe price ofa hamburger at the Corner Bistro.[Six dollars\nis thought ofas one unit.]\nSix dollars arelying on the table.[The dollars are thought ofseparately.]\nThree hours wasa long time to wait for the bus.[one unit oftime]\nThree hours ofeach day werededicated to studying.[separate times]\nA fraction is singular when it refers to a singular word and plural when it\nrefers to a plural word.\nOne-fourth ofmy time isspent at the gym.[The fraction refers to the sin-\ngular noun time.]\nOne-fourth of the people arehere for the cooking class.[The fraction\nrefers to the plural noun people.]\nPractice\nCircle the correct verb in each ofthe following sentences.Answers are found at the\nend ofthe chapter.\n1. When the boss (jokes,joke),we (laughs,laugh).\n2. A single tree now (grows,grow) where the forest used to (grows,grow).\n3. Constella (speaks,speak) English,but her parents (speaks,speak) Spanish.\n4. The clerk (rings,ring) up the sales while the customers (waits,wait) in line.\n5. The carolers (hums,hum) while the soloist (sings,sing).\n130 MAKING SUBJECTS AND VERBS AGREE\n6. The bright walls (doesn’t,don’t) seem very relaxing.\n7. The shipment (wasn’t,weren’t) here when we arrived this morning.\n8. The bank (doesn’t,don’t) open until 9:30 on Saturday mornings.\n9. Mabel couldn’t drive to work because her car (wasn’t,weren’t) starting.\n10. Paula (doesn’t,don’t) think the files (is,are) in storage.\n11. One of the secretaries (is, are) finishing the newsletter that (was, were)\nscheduled to go out last week.\n12. The petty cash box,along with the receipts,(is,are) turned in at the end of\nthe day.\n13. These statistics (is,are) the result ofcareful research.\n14. Statistics (was,were) my most difficult math course in high school.\n15. Halfofthe sandwich (was,were) eaten.\n16. Halfofthe sandwiches (was,were) tuna salad.\nMAKING PRONOUN SUBJECTS MATCH THEIR VERBS IN\nNUMBER\nA pronounis a word that takes the place ofa noun.For example,in this sentence,\n“All ofthe cookies were decorated,”the wordallstands for or refers to cookies,and\nacts as the subject.\nPronouns used as subjects present a problem for even the most sophisticated\nspeakers ofEnglish.Some pronouns are always plural.Other pronouns are always\nsingular.Some ofthese are also called indefinitepronounsbecause they refer to\nno specific person of thing. A handful of pronouns can be either singular or\nplural.\nSingular Pronouns\nThese pronouns are always singular.They require singular verbs.\neach anyone nobody\neither everybody one\nneither everyone somebody\nanybody no one someone\nSee how these pronouns take singular verbs in the following examples:\nSomeonealways forgetsto sign in.\nNeitherchild wantsto miss the fireworks.\nEachofthe members feelsthat an increase in dues is justified.\nEverybodyhere thinksthe car should be fixed instead oftraded in for a\nnew model.\n131 GRAMMAR ESSENTIALS\nEach,either,andneitherare the pronouns most commonly misused.You can\navoid making mistakes when using these pronouns by mentally replacing the other\nwords between the pronoun and the verb with the wordone.Look at the follow-\ning examples to see how this is done.\nEach ofthe boys wants his own car.\nEach onewantshis own car.\nEither ofthe associates knows where the records are kept.\nEitheroneknowswhere the records are kept.\nThese sentences may sound awkward.So many speakers misuse these pronouns\nthat you may have become accustomed to hearing them used incorrectly.Despite\nthat,the substitution trick (onefor the words following the pronoun) will help you\navoid this mistake.\nFor questions beginning with has or have, remember that has is singular\nwhile have is plural.Pay special attention to the verb-subject combination in a\nquestion.In fact,the correct verb is easier to identify ifyou turn the question into\na statement.\n(Is,Are) some ofthe advertisers noticing the difference?\nSome ofthe advertisers arenoticing the difference.\n(Has,Have) either ofthe inspectors filed a report?\nEither onehasfiled a report.\n(Does,Do) each ofthe trucks have a hoist?\nEach onedoeshave a hoist.\nPlural Pronouns\nThese pronouns are always plural and require a plural verb:\nboth many\nfew several\nSingular\/Plural Pronouns\nThe following pronouns can be either singular or plural:\nall none\nany some\nmost\n132 MAKING SUBJECTS AND VERBS AGREE\nThe words that these pronouns refer to determine whether the verbs are sin-\ngular or plural.Ifthe pronoun refers to a plural noun or pronoun,the verb must be\nplural.Ifthe pronoun refers to a singular noun or pronoun,the verb must be sin-\ngular.See how this is done in the following sentences.The key words are in bold.\nSingular Plural\nAll ofthe workisplanned. Allofthe jobsareplanned.\nIsanyofthe pieremaining? Areanyofthe piecesofpie remaining?\nMostofthe milk wassour. Mostofthe glassesofmilk were empty.\nNoneofthe timewasspent Noneofthe hourswere spent very well.\nvery well.\nSomeofthe fruitwasshipped. Someofthe appleswere shipped.\nPractice\nPractice matching pronoun subjects with verbs by circling the correct verb in each\nofthe following sentences.Answers are found at the end ofthe chapter.\n17. None ofthese keys (unlocks,unlock) the back door.\n18. Each ofthe project components (takes,take) several hours to complete.\n19. All ofthe box lunches (has,have) been given away.\n20. Some ofthe animals (was,were) moved for the winter.\n21. Either ofthese paintings (is,are) perfect for my house.\n22. (Was,Were) any ofthe cables long enough?\n23. (Do,Does) each ofthe keyboards have a built-in wrist support?\n24. (Has,Have) either ofthe tenants paid the rent?\n25. Neither ofour fleet vehicles (needs,need) to be serviced.\n26. Both ofthe trainees (seems,seem) motivated.\n27. A friend at one ofmy jobs also (works,work) for the city.\n28. None ofour problems (goes,go) unnoticed by the regular customers.\n29. An exercise program (helps,help) your frame ofmind.\n30. Each ofthese decongestants (causes,cause) drowsiness.\nCOMPOUND SUBJECTS\nA compound subject is made up oftwo or more subjects that are joined by a con-\njunction (usually and,or,or nor) and that share the same verb.\n133 GRAMMAR ESSENTIALS\nSingular Subjects Joined by and\nIftwo singular nouns or pronouns are joined byand,they require a plural verb.\nHe and she [both] wantto take a vacation.\nJack and Jill [both] insiston finding a flat prairie on which to walk.\nSingular Subjects Joined by or or nor\nIftwo singular nouns or pronouns are joined byor ornor,they require a singu-\nlar verb.Think ofthem as two separate sentences and you’ll never make a mistake\nin agreement.\nArt or Elaine wantsto get a new car.\nArt wantsto get a new car.\nElaine wantsto get a new car.\nSingular and Plural Subjects Joined by or or nor\nSingular and plural subjects joined byor ornorrequire a verb that agrees with the\nsubject closest to the verb.\nNeither the coach nor the players likethe lineup.\nNeither the players nor the coach likesthe lineup.\nVERBS AGREE WITH SUBJECTS, NOT THE WORD\nFOLLOWING THE VERB\nTake care not to let the words following the verb confuse you about the real sub-\nject ofthe sentence.\nTaxeswerethe biggest issue in the campaign.\nThe biggest issuein the campaign wastaxes.\nA serious problemfor corn growers isweeds.\nWeeds area serious problem for corn growers.\nWHEN THE SUBJECT FOLLOWS THE VERB\nWhen a sentence asks a question or begins with the wordthereorhere,the sub-\nject follows the verb.Locate the subject ofthe sentence and make certain the verb\nmatches it.In the following example sentences,the subjects and verbs are bolded\nin the correct sentences.\n134 MAKING SUBJECTS AND VERBS AGREE\nWrong Correct\nWhat is the terms ofthe agreement? What arethe termsofthe agreement?\nWhy is his words garbled? Why arehis wordsgarbled?\nHere’s the statistics they compiled. Here arethe statisticsthey compiled.\nThere is six students asking for help. There aresix studentsasking for help.\nInverted sentences also contain a subject that follows,rather than precedes,\na verb. Locate the subject in an inverted sentence and make certain the verb\nagrees with it.In the example sentences that follow,the subjects and verbs in the\ncorrected sentences are bolded.\nWrong Correct\nInside your drawer is the documents Inside your drawer are the docu-\nI finished. ments I finished.\nOut ofnowhere comes three new Out ofnowhere come three new\naccounts. accounts.\nUp in the stands go the fan who Up in the stands goes the fan who\nspilled my drink. spilled my drink.\nPractice\nPractice what you have learned about matching verbs and subjects by choosing the\ncorrect verb in each ofthe following sentences.Check your work with the answers\non the following page.\n31. Every other day,either Oscar or Lorraine (takes,take) the car to town.\n32. Neither the sound nor the rhythm (matches,match) the other stanzas in\nthe poem.\n33. Either the employees or the manager (orders,order) the inventory reduction.\n34. Either the manager or the employees (orders,order) the inventory reduction.\n35. (Is,Are) the children’s department on this floor?\n36. My daughter’s passion (is,are) crafts.\n37. (Was,Were) there any two-piece suits left on the rack?\n38. There (isn’t,aren’t) many weeks left before summer.\n39. Here (is,are) the data we needed.\n40. Offinto the sunset (runs,run) the herd ofmustangs.\n135 GRAMMAR ESSENTIALS\nREVIEW\nRemember the memo at the beginning of the chapter? Go back and try to cor-\nrect it,then compare your version to the corrected one below.The changes are\nhighlighted.\nTo:Jessica Amerson\nFrom:Tyson Hall\nRe:Aides\/floor nurse dispute\nDate:July 21,2005\nThe nurse’s aides were having trouble with the floor nurse yes-\nterday.He doesn’tthink he should help with unloading supplies.\nEvery one ofthe aides isjust as busy as he is.The aides think he\nshould do his part too.They weren’tvery happy with him when\nhe refused.Melinda and Connie arethinking about filing a com-\nplaint.Neither the aides nor the floor nurse needsthis fuss.Maybe\nyou can see ifeither the floor nurse or the aides arewilling to find\na better solution.\nAnswers\n1.jokes,laugh 15.was 29.helps\n2.grows,grow 16.were 30.causes\n3.speaks,speak 17.unlock 31.takes\n4.rings,wait 18.takes 32.matches\n5.hum,sings 19.have 33.orders\n6.don’t 20.were 34.order\n7.wasn’t 21.is 35.Is\n8.doesn’t 22.Were 36.is\n9.wasn’t 23.Does 37.Were\n10.doesn’t,are 24.Has 38.aren’t\n11.is,was 25.needs 39.is\n12.is 26.seem 40.runs\n13.are 27.works\n14.was 28.go\n136  CHAPTER 16 GRAMMAR IQ QUIZ\nChoose the correct pronoun(s) in each ofthe following sentences.Answers and explanations\nfollow the quiz.\n1.Chad and Roberta graded the papers from (his or her,their) classes.\n2.The cat or the dog has finished (its,their) food.\n3.Any woman who has cleaned out (her,their) purse knows what kind oftreasures hide\nat the bottom.\n4.Rodriquez and (he,him) went to the meeting with Janet and (I,me).\n5.The supervisor is more organized than (I,me).\nAnswers\n1.their (plural subject)\n2.its (singular subject)\n3.her (singular subject)\n4.he,me (He went to the meeting with me.)\n5.I (am) CHAPTER\n16\nBEATING THE\nPRONOUN ODDS\nUsing the right pronouns in sentences can be tricky.\nPronouns are misused so often in speech that few\npeople really know how to avoid pronoun errors\nin writing. This chapter shows you a few tricks for get-\nting the pronouns right every time.\nGrammar concepts to know:\n• antecedent—the noun that a pronoun replaces\n• indefinite pronouns—pronouns that do not refer\nto any specific person, place, or thing\n• ambiguous reference—words that can easily be\ninterpreted to mean more than one thing\n• reflexive pronoun—a pronoun that contains self\nor selves\nLike verbs,pronouns that are misused in writing\ncan confuse the reader.This chapter explains the basic principles ofpro-\nnoun use and highlights the most common pronoun problems: agreement,\nincomplete constructions,reflexive pronouns,and ambiguous pronoun references.\n139 GRAMMAR ESSENTIALS\nPRONOUNS AND ANTECEDENTS\nA pronoun is a word that takes the place ofa noun or another pronoun.The noun\nrepresented by a pronoun is called its antecedent.The wordantemeans “before,”\nandcede means “come.”So the literal meaning ofantecedentis “comes before.”Usu-\nally,the antecedent comes before the pronoun in a sentence.In the following exam-\nple sentences, the pronouns are italicized and the antecedents (the nouns they\nrepresent) are underlined.\nThe state employeesreceivedtheirbenefits.\nEricathoughtshesaw the stolen vanand reporteditto the authorities.\nThe floor managerhates these overstocksbecauseheknowsthey reduce\nprofits.\nIndefinite Pronoun Antecedents\nA pronoun must agree in number with its antecedent. In other words, if the\nantecedent is singular,the pronoun must be singular;ifthe antecedent is plural,\nthe pronoun must be plural.\nPeople usually have little trouble matching a pronoun with a noun\nantecedent.However,sometimes a pronoun represents another pronoun.In the\nlast chapter,you learned about singular indefinite pronouns.Remember,they are\nknown as indefinite pronouns because they don’t refer to one specific person or\nthing. The antecedents of singular indefinite pronouns require singular pro-\nnouns.Here is the list for your review.\neach anyone nobody\neither everybody one\nneither everyone somebody\nanybody no one someone\nA pronoun with one ofthe words from this list as its antecedent must be sin-\ngular.When the antecedent can be referring to a male or female,use the phrase\nhisor her.In the following example sentences,the antecedent is underlined and\nthe pronouns are italicized.\nEach[singular] ofthe women woreher[singular] favorite outfit to the ball.\nAnyone[singular] who takes up steer wrestling should pay uphis or her\n[singular] life insurance.\nSomeonelefthermakeup in the rest room.\nNeitherofthe tenants could findhisor hercopy ofthe lease.\n140 BEATING THE PRONOUN ODDS\n• Iftwo or more singular nouns or pronouns are joined byand,use a plural\npronoun.\nBill Gates and Sam Walton[plural] builttheir[plural] empires from scratch.\nIfhe and she[plural] need this information,they[plural] should ask me.\nWhen Grandma and Grandpa[plural] come to visit,they [plural] always\nbring food.\n• Iftwo or more singular nouns or pronouns are joined by or,use a singular\npronoun.\nTrent or Jared will loan youhiscar for this errand.\nThe lion or the tigerwill completeitsact.\nRemember to give Jane or Ritaherappointment card.\n• Ifa singular and a plural noun or pronoun are joined byor,the pronoun\nagrees with the closest noun or pronoun it represents.\nNeither the students nor the teacher [singular] brought his [singular]\nbook to class.\nNeither the teacher nor the students[plural] brought their [plural] books\nto class.\nPractice\nChoose the correct pronoun in each ofthe following sentences.Check your work\nwith the answers at the end ofthe chapter.\n1. No one in (her,their) right mind would follow your advice.\n2. Neither the soldiers nor the sergeant was sure of(his,their) location.\n3. Anyone who is interested in the pilot project should sign (his or her,their)\nname on this contract.\n4. Ask someone in maintenance to fix this desk,and (he,she,they) probably\nwill take care ofit right away.\n5. Neither Gary nor Willie wants (his,their)hair cut.\n6. Ifyou shear a pin on this motor,(it,they) is hard to repair.\n7. Ray knows someone who might give you (her,their) old dorm refrigerator.\n8. Almost anybody can improve (his or her,their) writing by usingGrammar\nEssentials.\n9. Ifyou’re interested in pleasing customers,don’t make (her,them) wait.\n10. Arnold or Jacques will bring (his,their) recorder to tape the interview.\n141 GRAMMAR ESSENTIALS\nPRONOUNS AS SUBJECTS AND OBJECTS\nA single pronoun in a sentence is easy to use correctly. In fact, most English\nspeakers would readily identify the mistakes in the following sentences.\nMeworked on the project with he.\nDiane gave shea lift home.\nMost people know thatMe in the first sentence should beI and that heshould\nbe him.They would also know thatshe in the second sentence should beher.Such\nerrors are easy to spot when the pronouns are used alone in a sentence. The\nproblem occurs when a pronoun is used with a noun or another pronoun.See if\nyou can spot the error in this sentence.\nThe new machinist worked with Kirsten and I.\nIn the previous sentence,the wordI should beme.Ifyou turn the sentence\ninto two separate sentences,the error becomes very obvious.\nThe new machinist worked with Kirsten.\nThe new machinist worked with me (not I).\nTry to spot the errors in these three sentences.\nThe teacher reprimanded my friend and I.\nJess and me are going camping this weekend.\nThe new boss assigned he and I a different campaign.\n• In the first sentence,I should beme.Separate the sentences to spot the error.\nThe teacher reprimanded my friend.\nThe teacher reprimanded me (not I).\n• In the second sentence,meshould beI.You must change the plural verbare\ntoisandam when you think ofthe sentences separately.\nJess is going camping this weekend.\nI (not me) am going camping this weekend.\n• In the third sentence,heandIshould behimandme.\nThe new boss assigned him (not he) a different campaign.\nThe new boss assigned me (not I) a different campaign.\n142 BEATING THE PRONOUN ODDS\nSplitting a sentence in two does not work as well with the preposition\nbetween.Ifyou substitute withfor between,then the error is easier to spot.\nThe disagreement is between (she,her) and (I,me).\nThe disagreement is with her.(not she)\nThe disagreement is with me.(notI)\nPractice\nChoose the correct pronoun in the following sentences.Check your work with the\nanswers at the end ofthe chapter.\n11. Bonnie and (he,him) saw the show with Bernard and (I,me).\n12. Neither my children nor my husband knows what (he,they) will get me for\nChristmas.\n13. Christine and (I,me) always clean up the lounge.\n14. The conductor let (he,him) and (I,me) into the club car.\n15. Did you hear the latest news about (she,her) and (they,them)?\n16. Melissa and (I,me) both witnessed the accident.\nNOUN-PRONOUN PAIRS\nSometimes,a noun in a sentence is immediately preceded by a pronoun.To make\nsure that you use the correct pronoun,delete the noun from the pair.Look at the\nfollowing examples to see how this is done.\nThey hired (we,us) temporary workers.\nThey hired us.\n(We,Us) managersthrew the retirees a small party.\nWethrew the retirees a small party.\nINCOMPLETE CONSTRUCTIONS\nSometimes,a pronoun comes at the end of a sentence following a comparative\nword such asthan or as.\nMaria spent more money than (they,them).\nHis young son is now taller than (I,me).\nBradley can wax floors better than (I,me).\nThe long walk tired us more than (they,them).\n143 GRAMMAR ESSENTIALS\nThese sentences are called incomplete constructions because the complete\nmeaning is only implied,not written out in its entirety.To figure out which pro-\nnoun is correct,complete the sentence in your mind and use the pronoun that\nmakes more sense.\nMaria spent more money than they did.\nHis young son is now taller than I am.\nSome sentences can be completed both ways.When this is true,choose the pro-\nnoun that makes more sense.\nBradley can play guitar better thanI can.\nBradley can play guitar better thanme.\nThe first sentence makes more sense,soIis the correct pronoun.\nThe long walk tired us more thanthey did.\nThe long walk tired us more thanit did them.\nThe second sentence makes more sense,so themis the correct choice.\nPronoun choice is especially important if the sentence makes sense either\nway. The following sentence can be completed using both pronouns, either of\nwhich makes sense.The pronoun choice controls the meaning.Choose the pro-\nnoun that conveys the intended meaning.\nI work with Assad more than (she,her).\nI work with Assad more than she does.\nI work with Assad more than I work with her.\nAMBIGUOUS PRONOUN REFERENCES\nSometimes,a sentence is written in such a way that a pronoun can refer to more\nthan one antecedent.When this happens,we say the meaning is ambiguous;that\nis, it can be understood in more than one way. In the following examples, the\nambiguous pronouns are italicized,and the possible antecedents are underlined.\nAs Claudespoke to the his girlfriend’s father,hewas very nervous.\nTake the doorfrom the frameand paintit.\nTheresatold Juliasheshould get ready to go.\n144 BEATING THE PRONOUN ODDS\nSee how these sentences are rewritten to clarify the ambiguous references.\nClaude was very nervous when he spoke to his girlfriend’s father.\nPaint the door after taking it offthe frame.\nTheresa told Julia to get ready to go.\nREFLEXIVE PRONOUNS\nReflexive pronouns refer to another word that is the same individual(s) or the\nsame thing(s).They are called reflexivebecause they reflect like a mirror.Reflex-\nive pronouns include the wordselforselves: myself,yourself,himself,herself,itself,\nourselves, themselves. The following sentences show how these pronouns are\nused in writing.\nMonica envisioned herselfplaying the lead role.\nI drove myselfto the train station.\nTake care ofyourself.\nMy next-door neighbors built their house themselves.\nUsing Reflexive Pronouns Correctly\n• The possessive pronounshisandtheircannot be made reflexive.\nWrong:The Garrets decided to supervise the building theirselves.\nCorrect:The Garrets decided to supervise the building themselves.\nWrong:Mitchell asked to do the work hisself.\nCorrect:Mitchell asked to do the work himself.\n• Avoid using a reflexive pronoun when a personal pronoun works in the\nsentence.\nWrong: A group ofvolunteers and myselfrepaired the roof.\nCorrect:A group ofvolunteers and I repaired the roof.\nWrong: The results ofthe election were known only to myself.\nCorrect:The results ofthe election were known only to me.\nWrong: The responsibility is split between Jamison and yourself.\nCorrect:The responsibility is split between Jamison and you.\n145 GRAMMAR ESSENTIALS\nPractice\nChoose the correct pronoun in each ofthe following sentences.Check your work\nwith the answers that follow.\n17. (We,Us) patients are pleased with our care.\n18. The risk ofthis operation scared the doctor more than (we,us).\n19. Penny and (I,me,myself) are planning a summer trip.\n20. My brother drives much faster than (I,me).\nAnswers\n1. her 11. he,me\n2. his 12. he\n3. his or her 13. I\n4. he or she 14. him,me\n5. his 15. her,them\n6. it 16. I\n7. her 17. We\n8. his or her 18. (it scared) us\n9. them 19. I\n10. his 20. I (do)\n146  CHAPTER 17 GRAMMAR IQ QUIZ\nChoose the correct word from the choices in parentheses.Answers and explanations follow\nthe quiz.\n1.A deer is (laying,lying) in the tall grass.\n2.The new van is (setting,sitting) in the driveway.\n3.The decibel level (raises,rises) steadily throughout the concert.\n4.The snake will eventually shed (its,it’s) skin.\n5.Tell me when (you’re,your) ready to go.\n6.Call the technician (that,who,which) fixed the problem last time.\n7.Where is the instruction manual (that,who,which) I loaned you?\n8.(Who’s,Whose) coat is this?\n9.Put (their,there,they’re) merchandise over (their,there,they’re) on the table.\n10. (Their,There,They’re) about to begin the session.\nAnswers\n1.lying (resting)\n2.sitting (resting)\n3.rises (goes up)\n4.its (belonging to it)\n5.you’re (you are)\n6.who (use who for people)\n7.that (use that for things)\n8.Whose (belonging to whom)\n9.their (belonging to them),there (place)\n10.They’re (They are) CHAPTER\n17\nPROBLEM VERBS\nAND PRONOUNS\nDoyou’reandyour confuse you? How aboutlie andlay,\nor sit and set? Knowing how to use problem words\nsuch as these correctly makes you a better writer.\nGrammar concept to know:\n• possessive pronoun—a pronoun that shows\nownership (my, your, our, their, his, hers, mine)\nThis chapter covers problem verbs such as\nlie\/lay, sit\/set, rise\/raise, and their various forms.It also covers problem\npronouns such as its\/it’s, your\/you’re, whose\/who’s, who\/that\/which, and\nthere\/they’re\/their. You can distinguish yourself as a competent writer if you\nknow how to use these properly.\nPROBLEM VERBS\nLie\/Lay\nFew people uselieandlaycorrectly,perhaps because few people know the differ-\nence in meaning between the two.The verbliemeans “to rest or recline.”The verb\nlaymeans “to put or place.”Lie is something you do yourself(or some person does\nhimselfor herself,or some object does itself);lay is something you do to an object.\n149 GRAMMAR ESSENTIALS\nThe table that follows shows the principal parts ofeach ofthese verbs.Their mean-\nings,written in the correct form,appear in parentheses.\nProgressive Past Participle\n(used with am, (used with have,\nPresent is, are) Past has, or had)\nlie,lies lying lay lain\n(rest,rests) (resting) (rested) (rested)\nlay,lays laying laid laid\n(place,places) (placing) (placed) (placed)\nTo choose the correct form oflie or lay,simply look at the meanings in paren-\ntheses.Choose the word in parentheses that makes the most sense and use the cor-\nresponding form oflie or lay.Sometimes,none ofthe words seem right.In that\ncase,choose the option that makes more sense than any ofthe others.Ifa sentence\ncontains the word down,mentally delete the word from the sentence to make the\nappropriate verb more obvious.These sample sentences show how this is done.\nThe frisbee is _____ in the middle ofthe lawn.(requires progressive)\nRestingmakes better sense thanplacing.\nChooselying.\nDella asked Lisa to _____ the newspaper on the kitchen table.(requires\npresent)\nPlacemakes better sense thanrest.\nChooselay.\nYesterday,the snake _____ all day in the sun next to our house.(requires\npast)\nRestedmakes better sense thanplaced.\nChooselay.\nYesterday afternoon,I _____ down for a nap.(requires past)\nRemove the word down.\nRestedmakes better sense than placed.\nChoose lay.\nSonja remembered that she had _____ the books on her desk.(requires\npast participle)\nPlacedmakes better sense than rested.\nChoose laid.\n150 PROBLEM VERBS AND PRONOUNS\nPractice\nWrite the correct form oflieorlayin each ofthe blanks.Check your work with\nthe answers at the end ofthe chapter.\n1. Huey __________ in bed for another hour after the alarm went off.\n2. __________ the papers next to the copy machine.\n3. The mail __________ on the dining room table.\n4. The student _________ his assignment on the teacher’s desk.\n5. Who knew how long the confidential documents had __________ in the\nopen or who had __________ them there in the first place?\nSit\/Set\nThese two verbs are very similar tolieandlay.Sit means “to rest.”Setmeans “to\nput or place.”The table below shows the principal parts of each of these verbs.\nTheir meanings,written in the correct form,appear in parentheses.\nProgressive Past Participle\n(used with am, (used with have,\nPresent is, are) Past has, or had)\nsit,sits sitting sat sat\n(rest,rests) (resting) (rested) (rested)\nset,sets setting set set\n(put,place;puts, (putting, (put,placed) (placed)\nplaces) placing)\nChoose the correct form of sitor setby using the meanings (the words in\nparentheses) in the sentence first.Decide which meaning makes the most sense,\nthen choose the corresponding form ofsitor set.See how this is done in the fol-\nlowing example sentences.\nThe actor __________ the props offin the wings.\nPutorplacedmakes more sense thanrested.\nChooseset.\nThe judge __________ in the chair next to the bailiff.\nRestedmakes more sense thanputor placed.\nChoosesat.\n151 GRAMMAR ESSENTIALS\nPractice\nWrite the correct form ofsitorsetin each ofthe blanks.Check your work with\nthe answers at the end of the chapter.\n6.Our family __________ aside money for vacation.\n7.Carol’s car is the one __________ closest to the entrance.\n8.Adam remembered where he __________ the packages down.\n9.Scott __________ down behind to me and __________ his briefcase on the\nfloor.\n10.The parents had __________ in the waiting room for most ofthe morning.\nRise\/Raise\nThe verbrisemeans “to go up.”The verbraisemeans “to move something up.”Raise\nrequires an object.In other words,something must receive the action ofthe verb raise\n(raise your hand,raise the flag,raise the objection,raise children).The table that fol-\nlows shows the principal parts ofboth verbs.\nProgressive Past Participle\n(used with am, (used with have,\nPresent is, are) Past has,or had)\nrises,rise (moves up,move rising rose\n(goes up,go up) up) (going up) (went up)\n(comes up,come (coming up) (came up)\nup) raising raised\nraises,raise (moving up) (moved up)\nChoose the correct form of riseor raiseby using the meanings (the words\nin parentheses) in the sentence first. Decide which meaning makes the most\nsense,then choose the corresponding form of riseor raise.See how this is done\nin the example sentences that follow.Sometimes,none of the words seem espe-\ncially appropriate.In that case,choose the option that makes more sense than any\nofthe others.\nThe moon __________ a little bit later each evening.\nComes upmakes the most sense.\nChooserises.\n152 PROBLEM VERBS AND PRONOUNS\nThe crowd began to __________ their voices.\nMove upmakes the most sense.\nChooseraise.\nThe water level __________ over a foot in the last day.\nWent up makes the most sense.\nChoose rose.\nPractice\nWrite the correct form of rise or raise in each of the blanks below.Check your\nanswers at the end ofthe chapter.\n11. The custodian __________ the flag every morning before the sun\n__________.\n12. The farmer __________ corn and soybeans.\n13. The fog had __________ enough for us to see beyond the next hill.\n14. The church members __________ from the pews to recite a prayer.\nPROBLEM PRONOUNS\nIts\/It’s\nIts is a possessive pronoun that means “belonging to it.”It’sis a contraction forit\nis orit has.Useit’sonly when you can also substitute the words it isor it has.Take\ntime to make this substitution,and you will never confuse these two words.\nThe thermometer in the roast will measure its(belonging to the roast)\ntemperature.\nIt’s(it is) time for us to say goodbye and head home.\nIt’s (it has) been three years now since I’ve seen Tom.\nPractice\nChoose the correct word in each set ofparentheses that follow.Check your work\nwith the answers at the end ofthe chapter.\n15. I wonder if(its,it’s) a good idea for us to be here.\n16. The wind will eventually stop (its,it’s) howling.\n17. Tell me when (its,it’s) time for a break.\n18. (Its,It’s) been fun to watch the dog chase (its,it’s) tail.\n153 GRAMMAR ESSENTIALS\nYour\/You’re\nYour is a possessive pronoun that means “belonging to you.”You’re is a contraction\nfor the wordsyou are.Useyou’re only when you can also substitute the wordsyou are.\nTake time to make this substitution,and you will never confuse these two words.\nIs thisyour(belonging to you) new assignment?\nWhenyou’re(you are) done,I want to talk to you.\nYour (belonging to you) mother called this morning.\nYou’re(you are) the recipient ofthis year’s award.\nPractice\nChoose the correct word in each set ofparentheses that follow.Check your work\nwith the answers at the end ofthe chapter.\n19. (Its,It’s) (your,you’re) turn to do the dishes.\n20. Bring (your,you’re) fishing pole along if(your,you’re) coming.\n21. (Your,You’re) scheduled to work late this evening.\n22. (Your,You’re) plan seems to have worked.\nWho\/That\/Which\nWhorefers to people.Thatrefers to things.Whichis generally used to introduce\nnonessential clauses that describe things.(See Chapter 6 to review nonessential\nclauses.) Read the following sentences to see how each ofthese words is used.\n• Whorefers to people.\nThere is the womanwhodesigned this building.\nThe manwhofixes my car has retired.\n• Thatrefers to things.\nThis is the neighborhoodthatI told you about.\nThe printthatI wanted has been sold.\n• Which introduces nonessential clauses—unless they refer to people, in\nwhich case you use who.\nVickie picked up a copy ofPeople,whichis her favorite magazine.\nThe Mississippi River,whichoriginates in Minnesota,empties into the\nGulfofMexico.\nDouglas,whoplays in a local band,lives upstairs.\nMy son,who loves to play video games,turns sixteen tomorrow.\n154 PROBLEM VERBS AND PRONOUNS\nPractice\nChoose the correct word in each set ofparentheses below.Check your work with\nthe answers at the end ofthe chapter.\n23.Uncle Tim is the one (who,which,that) arranged this meeting.\n24.This is the coat (who,which,that) I bought last year.\n25.Rod Stewart, (who, which, that) is my favorite singer, has never won a\nGrammy award.\n26.Interstate 235,(who,which,that) runs through town,is being repaired this\nsummer.\n27.There’s the young man (who,which,that) wishes to speak with you.\nWhose\/Who’s\nWhoseis a possessive pronoun that means “belonging to whom.”Who’sis a con-\ntraction for the wordswho is orwho has.Take time to make this substitution,and\nyou will never confuse these two words.\nWho’s(Who is) handling the funeral arrangements?\nWhose(belonging to whom) bright idea was that?\nThis is the officerwho’s(who is) on duty tonight.\nThat is the girlwhose(belonging to whom) picture was in the paper.\nThere\/Their\/They’re\nThereis an adverb telling where an action or item is located.Theiris a possessive\npronoun that shows ownership.They’reis a contraction for the wordsthey are.Of\nall the confused word groups,this one is misused most often.Here is an easy way\nto distinguish among these words.\n• Take a close look at this version ofthe wordtHERE.You can see that it\ncontains the wordhere.Wherever you use the wordthere,\nyou should be able to substitute the wordhere,and the sentence should\nstill make sense.\nThere(here) goes my future.\nThe supplies are in there(here).\n• Their means “belonging to them.”If you can insert this phrase aftertheir\nin a sentence and the meaning remains the same,their is correct.\nTheir(belonging to them) time is limited.\nThis istheir(belonging to them) problem,not mine.\n155 GRAMMAR ESSENTIALS\n• Finally,imagine that the apostrophe inthey’re is actually a very small let-\ntera.Ifyou changethey’re tothey are in a sentence,you’ll never misuse the\nword.Look over the following example sentences.\nThey’re(they are) hoping to leave in the morning.\nDo you know howthey’re(they are) going to arrange the schedule?\nPractice\nChoose the correct word in each set ofparentheses below.Check your work with\nthe answers that follow.\n28.(Your,You’re) likely to lose your mind in (there,their,they’re).\n29.(There,Their,They’re) rearranging the shelves in the closet.\n30.(Its,It’s) been a year since (there,their,they’re) last anniversary.\n31.The landscaper (who, which, that) did the work lives over (there, their,\nthey’re).\n32.(Who’s,Whose) been calling you all evening?\n33.(Who’s,Whose) idea was it take this shortcut?\n34.Martha asked for the one (who’s,whose) in charge ofaccounting.\n35.(Who’s,Whose) retirement are we celebrating?\nAnswers\n1.lay 12.raised or raises 24.that\n2.Lay 13.risen 25.who\n3.is lying 14.rose 26.which\n4.laid 15.it’s 27.who\n5.lain,laid 16.its 28.You’re,there\n6.set 17.it’s 29.They’re\n7.sitting 18.It’s,its 30.It’s,their\n8.set 19.It’s,your 31.who,there\n9.sat,set 20.your,you’re 32.Who’s\n10.sat 21.You’re 33.Whose\n11.raised,rose,orraises, 22.Your 34.who’s\nrises 23.who 35.Whose\n156  CHAPTER 18 GRAMMAR IQ QUIZ\nChoose the correct word from the parentheses in each ofthe following sentences.Answers\nfollow the quiz.\n1. The music sounded (strange,strangely).\n2. There is a smaller (amount,number) ofsupporters present at this meeting.\n3. Elbert tells (fewer,less) bad jokes than he used to.\n4. Hugh stole the ball (clean,cleanly) from the opposing guard.\n5. Anjalee danced as (good,well) as she had ever danced.\n6. Caroline felt (bad,badly) after the announcement.\n7. Which ofthese two roads is the (best,better) one to take?\n8. Split the time (among,between) the twins,but share the food (among,between) all\nofthe five children.\n9. Betty is the (liveliest,most liveliest) teacher I’ve seen.\n10. The staff(doesn’t,don’t) need (any,no) more stress.\nAnswers\n1. strange\n2. number\n3. fewer\n4. cleanly\n5. well\n6. bad\n7. better\n8. between,among\n9. liveliest\n10. doesn’t,any CHAPTER\n18\nMODIFIER\nETIQUETTE\nAdjectives and adverbs can brighten writing and\nmake it more specific and interesting—so that it com-\nmunicates your ideas more fully. This chapter explains\nhow to use modifiers correctly.\nGrammar concepts to know:\n• modifier—a word that describes another word\n• adjective—a modifier that describes a noun or\npronoun\n• adverb—a modifier that describes a verb, adjec-\ntive, or another adverb\n• comparative—the form of a modifier used when\ncomparing two things\n• superlative—the form of a modifier used when\ncomparing more than two things\nWords that describe other words are called\nmodifiers. Adjectives modify, or describe, nouns and pronouns.\nAdverbsmodify,or describe,verbs,adjectives,and other adverbs.Sometimes,a\ngroup ofwords functions as a modifier.Modifiers play a vital part in communi-\ncation.Using them correctly is an important skill.\n159 GRAMMAR ESSENTIALS\nADJECTIVES\nAdjectives describe a noun or pronoun in a sentence.Here is an easy way to tell\nifa word is an adjective.Adjectives answer one ofthree questions about another\nword in the sentence:Which one? What kind? andHow many? The following table\nillustrates this.The adjectives are italicized to make them easy to identify.\nWhich One? What Kind? How Many?\ntheblue cabinet willowtree many hints\nduct tape orange vest five entrances\nhisfirst steps greedy partner several reasons\nAdjectives That Follow Verbs\nPay special attention to adjectives that follow verbs.Sometimes,the adjective\nfollows a verb,but it describes a noun or pronoun that comes before the verb.\nThe following sentences illustrate this. The italicized adjectives describe the\nunderlined nouns.\nThese strawberriestastesour.(sour strawberries)\nRhonda’s changeofheart seemedstrange.(strange change)\nThe picklesaresalty.(salty pickles)\nFewer\/Less, Number\/Amount\nUse the adjectivefewerto modify plural nouns,or things that can be counted.Use\nlessfor singular nouns that represent a quantity or a degree—things that can’t be\ncounted.Most nouns to which anscan be added require the adjectivefewer.\nOur new neighborhood hasfewerchildren (plural noun) than our old\none had.\nDenise haslesstime (singular non-count noun) to spare than you do.\nThe same principle applies to the nounsnumber andamount.Use the noun\nnumberwhen referring to plural nouns,or things that can be counted.Use the\nnoun amount when referring to nouns that are singular and can’t be counted\nindividually.\nThenumberofhours (plural noun) we estimated for this job was incorrect.\nTheamountoftime (singular noun) for our work was underestimated.\n160 MODIFIER ETIQUETTE\nPractice\nChoose the correct word in parentheses in each ofthe following sentences.Check\nyour work with the answers at the end ofthe chapter.\n1. The lawn has (fewer,less) weeds than it had last summer.\n2. This side trip increased the (amount,number) ofmiles significantly.\n3. This cutlery set costs (fewer,less) money than that one.\n4. The (amount, number) of work involved does not justify the (amount,\nnumber) ofpeople assigned to the job.\n5. Phoebe remembers (fewer,less) about the old days than Grandpa does,but\nGrandpa tells (fewer,less) stories than Phoebe.\nADVERBS\nUse adverbs to describe verbs,adjectives,and other adverbs.Here is an easy way\nto tell ifa word is an adverb.Adverbs answer one ofthese questions about another\nword in the sentence:Where? When? How?andTo what extent? The adverbs are\nitalicized in the table that follows.\nWhere? When? How? To What Extent?\nThe car drove Marvin leftearlier. She yelledloudly. Royce could hardly\nforward. wait.\nPut your baggage Hank calledlater. Turtles moveslowly. Deannarrowly\nbelow. missed an accident.\nLookhere. We’ll gotomorrow. The loon called Marshastill doesn’t\nmournfully. understand.\nThe next table shows examples ofadverbs modifying verbs,adjectives,and\nother adverbs.The adverbs are italicized.\nAdverbs Modifying Adverbs Modifying Other\nAdverbs Modifying Verbs Adjectives Adverbs\nPackages are mailed anextremely annoying sound most clearly explained\nregularly.\nChildren play happily. astrangely quiet room quite reasonably stated\nRescuers came an unusuallyclean improverather slowly\nimmediately. uniform\n161 GRAMMAR ESSENTIALS\nADJECTIVE OR ADVERB?\nSometimes,writers mistakenly use adjectives in place ofadverbs.This is illustrated in\nthe following sentences.The italicized words are adjectives incorrectly used in place\nofadverbs.The correct adverb form is in parenthesis at the end ofthe sentence.\nLouise reads verythorough.(thoroughly)\nPack these dishes verycareful.(carefully)\nVern sang asloudas he was able.(loudly)\nTake special care to choose the correct word when using verbs that deal with\nthe senses:touch,taste,look,smell,sound.Ifthe word following the verb describes\na noun or pronoun that comes before the verb,use an adjective.Ifthe word fol-\nlowing the verb describes the verb,use an adverb.\nIn each ofthe sets ofexamples that follow,the same verb is used.In one sen-\ntence,however,the word following the verb is an adjective.In the other sentence,\nthe word following is an adverb.The parentheses explain how the word is used.\nRead the examples and take note ofthe differences.\nThe trainer felt gently around the player’s ankle. (Gently is an adverb\ndescribing felt.)\nThe entire group felt sick after lunch. (Sick is an adjective describing\ngroup.)\nThe judge looked skeptical after the witness testified. (Skeptical is an\nadjective describing judge.)\nThe judge looked skeptically at the attorney. (Skeptically is an adverb\ndescribing looked.)\nThe milk smelled sour to us.(Souris an adjective describingmilk.)\nThe doe smelled the feed hesitantly. (Hesitantly is used as an adverb\ndescribing smelled.)\nPractice\nChoose the correct word in parentheses in each ofthe following sentences.Check\nyour work with the answers at the end ofthe chapter.\n6. Anita sang the melody line (correct,correctly).\n7. Patricia looked (tired,tiredly) after the long day.\n8. This door doesn’t shut as (easy,easily) as it used to.\n9. These new boots feel more (comfortable,comfortably) than my old ones.\n162 MODIFIER ETIQUETTE\n10. Ask (polite,politely) ifyou need help with your work.\n11. The doctor walked (slow,slowly) out ofthe operating room.\n12. Jay seems (unhappy,unhappily) about the test results.\n13. The woman looked (angry,angrily) as she left the hair salon.\n14. The burglar felt (careful,carefully) for the alarm switch.\n15. The steam treatment cleaned our carpets (thorough,thoroughly).\nGood and Well, Bad and Badly\nGoodand bad are adjectives.Welland badly are adverbs.Sometimes,goodand bad\nare mistakenly used to describe a verb.Usewelland badly to describe an action.\nElizabeth performedwell(or badly) at her recital.(Wellor badly describes\nperformed,a verb.)\nCarolyn felt good (or bad) after her treatment.(Good or bad describes\nCarolyn,a noun.)\nThe condominiums were well(orbadly) built.(Wellorbadly describes\nbuilt,a verb.)\nThe coffee smelled good(or bad) when I walked into the house.(Good\norbad describes coffee,a noun.)\nPractice\nChoose the correct word in parentheses in each ofthe following sentences.Check\nyour work with the answers at the end ofthe chapter.\n16. Pasta does not taste as (good,well) ifit is overcooked.\n17. Paulina felt (bad,badly) after the workout.\n18. Janelle did (good,well) on her annual performance review.\n19. This new arrangement works very (good,well).\n20. The touring choir sang quite (bad,badly).\nCOMPARISONS\nAdjectives and adverbs change form when they are used in comparisons.When\nyou compare two things,use the comparative form ofthe modifier.Ifyou are com-\nparing more than two things,use the superlative form ofthe modifier.\nCreating the Comparative Form\nTo compare two things,you can either:\n• add erto the modifier,or\n• place the word moreor less before the modifier\n163 GRAMMAR ESSENTIALS\nAdd -er to most short modifiers (one or two syllables).Use more and less with\nmodifiers that have more than two syllables.\nCreating the Superlative Form\nTo compare more than two things,you can either:\n• add-estto the modifier,or\n• place the wordmostorleast before the modifier\nAdd -estto most short modifiers (one or two syllables).Use moreor mostwith\nmodifiers that are more than two syllables.\nBetween\/Among\nWhen comparing items in a prepositional phrase, use between for two items,\namongfor three or more.\nLook at the samples in the following table.Some modifiers change form com-\npletely.The first six lines ofthe table illustrate these special modifiers.\nComparative Superlative\nModifier (for two items) (more than two items)\ngood better best\nwell better best\nmany more most\nmuch more most\nbad worse worst\nlittle less or lesser least\nneat neater neatest\nlovely lovelier loveliest\nfunny funnier funniest\nextreme more [or less]extreme most [or least] extreme\nintelligent more [or less] intelligent most [or least] intelligent\nprecisely more [or less] precisely most [or least] precisely\nbetween among\nSee how the comparative and superlative forms are used in the following sentences.\nI like pumpkin pie betterthan key lime pie.(compares two pies)\nIfyou think Jane is a bad tennis player,just wait until you see her sister Jess\nplay—she is even worse.(compares two tennis players—Jane and Jess)\n164 MODIFIER ETIQUETTE\nMany people love Venice,but I found Rome to be a more beautiful city.\n(compares two cities with a modifier that has more than two syllables)\nMatthew is the neatestofthe three siblings.(compares more than two siblings)\nPractice\nChoose the correct word in parentheses in each ofthe following sentences.Check\nyour work with the answers at the end ofthe chapter.\n21. The Ford Taurus is the (large,larger,largest) selling mid-size car.\n22. Heavy cover is the (more,most) promising habitat for pheasants.\n23. Charlotte is the (younger,youngest) of the twins and the (shorter,short-\nest) one in the entire family.\n24. Divide my land (among, between) my two sons, but split the money\n(among,between) all ofmy children.\n25. The decorator chose the (more,most) unusual color scheme I’ve ever seen.\nAvoiding Illogical or Unclear Comparisons\n“Cassidy is braver than any Western hero,”is an illogical statement.It implies that\nCassidy,who is a Western hero,is braver than himself.Always include the words\notherorelseto keep your comparisons from being illogical.\nCassidy is braver than any otherWestern hero.\nSid can track better than anyone elsein the group.\nAvoiding Double Comparisons\nA double comparison occurs when a writer uses both-eror-estandmore\/lessor\nmost\/least.\nWrong Correct\nHorace is the most rudest man I know. Horace is the rudest man I know.\nThese instructions are more clearer. These instructions are clearer.\nEthel is more pickier about her kitchen Ethel is pickier about her kitchen than\nthan I am. I am.\n165 GRAMMAR ESSENTIALS\nAVOIDING DOUBLE NEGATIVES\nWhen a negative word such asnotornois added to a statement that is already neg-\native,a double negative results.Avoid double negatives in your writing.The words\nhardlyandbarelyare also negative words.In the following example sentences,the neg-\native words are highlighted.Pay close attention to how the incorrect sentences are\nrewritten to avoid the double negative.\nWrong Correct\nThe store doesn’t have no nails that The store doesn’t have any nails that\nsize. size.\nThe store has nonails that size.\nWe don’twant nodessert. We don’twant any dessert.\nWe want nodessert.\nI don’tbarelyhave money for a soda. I don’thave money for a soda.\nI barelyhave money for a soda.\nI can’thardlyhear you. I can hardlyhear you.\nI can’thear you.\nMISPLACED MODIFIERS\nPlace words,phrases,or clauses that describe nouns and pronouns as closely as\npossible to the words they describe.Failure to do this often results in amisplaced\nmodifier and a sentence that means something other than what was intended.\nPlacement of Words That Modify\nThe wordsonly,almost,and just should be placed as close as possible to the word\ndescribed.The best place is right before the words they describe.The placement\nofthe word,phrase,or clause affects the meaning ofthe sentence.\nThe woman onlylooked at two chairs.\nThe woman looked at only two chairs.\nThe first sentence implies that the woman “only looked”at the chairs,but noth-\ning else;she didn’t sit in them or touch them.The second sentence explains that she\nlooked at “only two”samples,not three or four.The placement of the word only\nchanges the meaning ofthe sentence.\n166 MODIFIER ETIQUETTE\nLook at another pair ofsentences:\nJosh nearlyscored four touchdowns.\nJosh scored nearlyfour touchdowns.\nIn the first sentence,Josh “nearly scored,”or came very close to the goal line\nfour times without actually crossing.In the second sentence,Josh scored “nearly\nfour”touchdowns—maybe threeand a half.How many points are awarded for that?\nHere’s an example using just:\nThe delivery company justrents its vans.\nThe delivery company rents justits vans.\nIn the first sentence of the previous example,the company “just rents”its\nvans,rather than buying them.The second sentence suggests that the company\nrents “just its vans,”not any ofits other vehicles,perhaps cars or trucks.\nPlacement of Phrases and Clauses That Modify\nPhrases and clauses that describe nouns or pronouns must also be placed as\nclosely as possible to the words they describe.The sentences in the next table con-\ntain misplaced modifiers.Pay close attention to how they are rewritten to clarify\nthe meaning.\nSentences with Misplaced\nModifiers Corrected Versions\nMy uncle told me about feeding In the kitchen,my uncle told me\ncattle in the kitchen.(What are cattle about feeding cattle.My uncle told\ndoing in the kitchen?) me about feeding cattle while we\nwere in the kitchen.\nA huge python followed the man that A huge python that was slithering\nwas slithering slowly through the slowly through the grass followed the\ngrass.(Why was the man slithering man.\nthrough the grass?) Slithering slowly through the grass,a\nhuge python followed the man.\n167 GRAMMAR ESSENTIALS\nDANGLING MODIFIERS\nWords,phrases,or clauses that begin a sentence and are set offby commas some-\ntimes don’t clearly modify any word or group of words in a sentence.These are\ncalled dangling modifiers.The sentences in the following table contain dangling\nmodifiers.Pay close attention to how they are rewritten to avoid the problem.\nSentences with Dangling\nModifiers Corrected Versions\nWhile talking on the telephone,the While I was talking on the telephone,\npotatoes boiled over.(Why were the the potatoes boiled over.\npotatoes talking on the telephone?) The potatoes boiled over while I\ntalked on the phone.\nNailed to a utility pole,Jason saw the Jason saw the sign nailed to a utility\nsign.(Why was Jason nailed to a pole.\nutility pole?) Nailed to the utility pole,the sign was\nvisible to Jason.\nBroken and beyond repair,Grandma Grandma threw away the broken\nthrew the serving dish away.(Why serving dish that was beyond repair.\nwas Grandma broken?) Broken and beyond repair,the serving\ndish was thrown away by Grandma.\nPractice\nChoose the correctly written sentence from each ofthe following sets.Check your\nanswers on the next page.\n26. a.Sylvan likes eggs fried in butter.\nb.Fried in butter,Sylvan likes eggs.\n27. a.Janette likes fresh fish better than any meat.\nb.Janette likes fresh fish better than any other meat.\n28. a.At the age ofthree,Grandpa took me fishing.\nb.When I was three,Grandpa took me fishing.\n29. a.Dennis is quicker than anybody on the team.(Dennis is a team member.)\nb.Dennis is quicker than anybody else on the team.\n168 MODIFIER ETIQUETTE\n30. a.I can’t hardly understand why we’re still waiting.\nb.I can’t understand why we’re still waiting.\n31. a.Growling softly,a big dog approached the boy.\nb.A big dog approached the boy that was growling softly.\n32. a. This floor doesn’t need no more wax.\nb.This floor doesn’t need any more wax.\n33. a. The speaker would only answer two questions.\nb.The speaker would answer only two questions.\n34. a.While barbecuing our steaks, a hungry salesman walked into the\nbackyard.\nb.A hungry salesman walked into the backyard while we were barbecuing\nour steaks.\n35. a.Swinging from branch to branch,I saw the spider monkey.\nb.I saw the spider monkey swinging from branch to branch.\nAnswers\n1.fewer 19.well\n2.number 20.badly\n3.less 21.largest\n4.amount,number 22.most\n5.less,fewer 23.younger,shortest\n6.correctly 24.between,among\n7.tired 25.most\n8.easily 26.a.\n9.comfortable 27.b.\n10.politely 28.b.\n11.slowly 29.b.\n12.unhappy 30.b.\n13.angry 31.a.\n14.carefully 32.b.\n15.thoroughly 33.b.\n16.good 34.b.\n17.bad 35.b.\n18.well\n169 CHAPTER 19 GRAMMAR IQ QUIZ\nChoose the correct word in parentheses in each ofthe following sentences.Answers follow\nthe quiz.\n1.Make sure to use your right foot to step on the (break,brake).\n2.It's right in front ofyour eyes,in (plane,plain) sight.\n3.It took me a (weak,week) to strip the desk ofall five layers ofpaint.\n4.Craig (knew,new) about the surprise party.\n5.Can you (here,hear) what the speaker is saying?\n6.How do you think the news will (affect,effect) her?\n7.He (choose,chose) another line ofquestioning.\n8.Ifyou don't start moving better,we will surely (loss,lose,loose) this match.\n9.Brian is arriving at work later (then,than) he (use,used) to.\n10.This package is (supposed,suppose) to contain the receipt.\nAnswers\n1.brake\n2.plain\n3.week\n4.knew\n5.hear\n6.affect\n7.chose\n8.lose\n9.than,used\n10.supposed CHAPTER\n19\nTRICKY WORDS\nBrake or break? Than or then? Accept or except?\nThis chapter explains the meanings of easily con-\nfused words. If you keep track of the meanings, you\ncan avoid misusing these words in your writing. This\nchapter makes it easy to do just that.\nGrammar concepts to know:\n• verb—a word that shows action or otherwise\nhelps to complete the meaning of a sentence\n• noun—the name of a person, place, thing, or idea\n• preposition—a word that shows a relationship\nbetween a noun or pronoun and another word in\nthe sentence\nT his chapter explains some of the most com-\nmonly confused word pairs. If you learn to distinguish between these\nwords,you can avoid errors in your writing.The words are divided into five sep-\narate sections,with practice exercises at the end ofeach section.\n171 GRAMMAR ESSENTIALS\nPART ONE\nBrake\/Break\n• Brakeas a verb means tosloworstop.As a noun it means“a device that slows\nor stops action.”\n• Break as a verb means toseparate,shatter,adjourn.As a noun,it meansa(n)\nseparation,crack,pause,oropportunity.\nDuring ourbreak(pause) we asked the sergeant ifwe could break (sep-\narate) rank.\nBrake(slow) gently ifyou’re on packed snow by applying slight pressure\nto thebrake (device).\nDustin Hoffman’s bigbreak (opportunity) came when he took a role in\nMidnight Cowboy.\nPassed\/Past\n• Passed is a verb,the past tense ofpass,meaning transferred,went ahead,or\nby,elapsed,orfinished.\n• Past as a noun meanshistory.As an adjective it meansformer.\nIt’s best not to dig up thepast(history) in this family.\nAn hourpassed(elapsed) before the X-rays returned from the lab.\nMaepassed(finished) the test she took yesterday.\nKen Griffeypassed(transferred) his baseball talent to his son.\nI know I lived near water in apast(former) life.\nThe race carspassed(went by) the stands at over 200 miles per hour.\nPeace\/Piece\n• Peace is a noun meaningtranquility.\n• Piece as a noun meansdivision,bit,orcreation.As a verb,it meansto patch,\norrepair.\nWe could have somepeace(tranquility) around here if you would just\npiece(patch) together the few remainingpieces (bits) ofyour mind.\n172 TRICKY WORDS\nPlain\/Plane\n• Plain as an adjective meansordinary,clear,orsimple.As a noun,it means\nflat country.\n• Plane is a noun meaningairship,flat surface,orlevel.\nNomadic tribes roamed theplain(flat country).\nHelen prefersplain(ordinary) vegetables.\nThe answer isplain(clear) to me.\nThe commune adopted a veryplain(simple) lifestyle.\nThe pilot flew theplane(airship) on aplane(level).\nScene\/Seen\n• Scene is a noun meaningview,site,orcommotion.\n• Seenis a verb,the past participle ofsee,meaningobserved ornoticed.\nThe crowd caused ascene(commotion) at thescene(site) ofthe fight,the\nmost confused sight the rookie officer had everseen(observed).\nPractice\nChoose the correct word in each ofthe following sentences.Check your work with\nthe answers at the end ofthe chapter.\n1. Cedric hit the (brake,break) as he noticed the truck ahead (brake,break)\nto avoid a (brake,break) in the road.\n2. The rookie second baseman (passed,past) the record set in the (passed,\npast) year.\n3. We hope this (peace, piece) of information will give you (peace, piece)\nofmind.\n4. The (plain,plane) gasoline won’t work to fuel this (plain,plane).\n5. Scottie’s parents hadn’t (scene, seen) the most violent (scene, seen) in\nthe show.\n173 GRAMMAR ESSENTIALS\nPART TWO\nBy\/Buy\n• Byis a preposition used to introduce a phrase: by the book,by the time,or\nby the way.\n• Buyas a verb meansto purchase.As a noun,it meansa bargain ordeal.\nCarter stoppedby(preposition) the store tobuy(purchase) some albums\nhe thought were a greatbuy(deal).\nDear\/Deer\n• Dearis an adjective meaningvalued orloved.\n• Deeris a noun referring to a four-legged animal that lives in the woods and\nlooks like Bambi.\nThedear(loved) car was totaled when it struck adeer (animal).\nDie\/Dye\n• Dieis a verb meaningpass away orfade.\n• Dyeas a verb meansto color ortint.As a noun,it meanscoloring orpigment.\nThe speaker waited for the noise to die (fade).\nWe plan todye(color) the shirts orange.\nWeak\/Week\n• Weak is an adjective meaningflimsy,frail,orpowerless.\n• Week is a noun meaningseven days.\nThe signal from the lost plane was soweak (frail) that rescuers took a\nweek(seven days) to locate the survivors.\nWhich\/Witch\n• Which is a pronoun.Usewhichin a sentence dealing with a choice:Which\none do you want? Also,usewhichto introduce a nonessential clause.\nThis car,whichI have never driven,is the one I’m thinking about buying.\n• Witchis a noun meaningsorceress orenchantress.\nCan you tell mewhich(choice word)witch(enchantress) to believe?\n174 TRICKY WORDS\nPractice\nChoose the correct word in each ofthe following sentences.Check your work with\nthe answers at the end ofthe chapter.\n6.Ifthe fax machine isn’t repaired (by,buy) morning,we’ll have to (by,buy)\nanother one.\n7.We waited to (die,dye) the sheets,hoping the wind would (die,dye) down.\n8.This animal is too (weak,week) to survive for more than a (weak,week).\n9.My (dear,deer) child,you’ll never see a (dear,deer) ifyou watch the sky.\n10.The (which,witch) couldn’t decide (which,witch) cat to take on Halloween.\nPART THREE\nHear\/Here\n• Hearis a verb meaninglisten to.\n• Here meansin this place orto this place.\nComehere (to this place) so you canhear(listen to) this recording.\nHole\/Whole\n• Holeis a noun meaningopening,gap,ordent.\n• Wholeas an adjective meansentire orintact.As a noun,it meansentirepart\noramount.\nThewhole(entire) pie was eaten.\nThe attendant repaired thehole(opening) in the tire.\nKnew\/New\n• Knew(the past tense ofknow,) is a verb,meaningunderstood orrecognized.\n• Newis an adjective meaningfresh,different,orcurrent.\nIknew(understood) he was looking for anew(different) approach.\nKnow\/No\n• Knowis a verb meaningto understand orrecognize.\n• Nomeansnot so,not any,ornot at all.As an adjective,it meansnone or\nnot one.\nI know (understand) that we have no (not any) more money in this\naccount.\n175 GRAMMAR ESSENTIALS\nMeat\/Meet\n• Meat is a noun meaningfood,flesh,ormain part.\n• Meetas a verb meansassemble,greet,orfulfill.As a noun,it meansassembly.\nThe chefs willmeet(assemble) to select themeat(flesh) for the dinner.\nPractice\nChoose the correct word in each ofthe following sentences.Check your work with\nthe answers at the end ofthe chapter.\n11. You’ll (hear,here) better ifyou stand (hear,here).\n12. This (hole,whole) means this (hole,whole) balloon is worthless.\n13. Hans was the only one who (knew,new) how to operate the (knew,new)\npress.\n14. I (know,no) we expect (know,no) further trouble from you.\n15. The hunters will (meat,meet) at the locker plant to split up the (meat,meet)\nfrom the deer.\nPART FOUR\nAdvice\/Advise\n• Advice,a noun meaningsuggestionorsuggestions.\n• Adviseis a verb meaningsuggest to orwarn.\nWeadvise(warn) you to heed theadvice(suggestions) ofyour attorney.\nAffect\/Effect\n• Affectas a verb meansalter,inspire,move emotionally,or imitate.As an adjec-\ntive,it meansimitated orpretended.\n• Effectas a noun meansconsequence orresult.As a verb,it meanscause.\nKing’s moving “I Have a Dream”speech willaffect(inspire) listeners for\nmany generations.\nHow will thisaffect(alter) the outcome?\nMerle’saffected(pretended) accent annoyed his friends.\nWhateffect(consequence) does cold weather have on tropical plants?\nWill iteffect(cause) a change?\n176 TRICKY WORDS\nOne\/Won\n• One is an adjective meaning single. It can also be used as pronoun to\nreplace a person,place,or thing.\n• Won is verb meaningprevailed,achieved,oracquired.\nLynette is theone(referring to Lynette) whowon(acquired) overone(sin-\ngle) million dollars in the lottery.\nSeam\/Seem\n• Seamis a noun meaningjoint orjoining point.\n• Seemis a verb meaningappear.\nItseems(appears) to me that thisseam(joining point) is coming apart.\nWeather\/Whether\n• Weatheris a noun referring to the condition outside.\n• Whethermeansifand is used when referring to a possibility or choice.\nWe won’t knowwhether(if) we’ll come until we know what the weather\n(condition outside) is going to do.\nPractice\nChoose the correct word in each ofthe following sentences.Check your work with\nthe answers at the end ofthe chapter.\n16. The psychic will (advice,advise) you to seek (advice,advise) often.\n17. We won’t know the (affect,effect) of this change on production until we\nknow how it will (affect,effect) worker morale.\n18. IfI (one,won) the match,I would be the only (one,won) to have (one,won)\nmore than (one,won) championship ring.\n19. Does this (seam,seem) (seam,seem) loose to you?\n20. Do you know (weather,whether) this awful (weather,whether) will con-\ntinue into tomorrow?\n177 GRAMMAR ESSENTIALS\nPART FIVE\nChoose\/Chose\n• Chooseis a verb meaningto select.It rhymes withbruise.\n• Choseis also a verb,the past tense ofchoose,meaningselected.\nThe neighborschose(selected) not to participate in the neighborhood\nparty.\nNext time,they shouldchoose(select) more wisely.\nLoose\/Lose\/Loss\n• Loose is an adjective meaning free, unrestrained, or not tight. It rhymes\nwithgoose.\n• Loseis a verb meaning tomisplace,tobe defeated,or fail to keep.It rhymes\nwithshoes.\n• Lossis a noun meaning theopposite ofvictory or gain,defeat,or downturn.\nIt rhymes withtoss.\nThe cattle ranloose(free) in the pasture.\nThe knot in this shoelaces isloose(not tight).\nIfyoulose(misplace) your place in line,it means a seriousloss\n(opposite ofgain) oftime.\nThan\/Then\n• Than is a conjunctive word used to make a comparison.\n• Then meansnextor tells when.\nFirst,we’ll eat;then(next) we’ll discuss ways to make this season more\nsuccessfulthan(comparison) our last one.\nSuppose\/Supposed\n• Suppose is a verb meaningassume orimagine.\n• Supposed(the past tense ofsuppose,) is a verb,meaningassumed orimag-\nined.As an adjective,it meansexpected or obligated.\nIsuppose(assume) we can finish this load.\nThe bricklayerssupposed(assumed) the foundation would be ready.\nThe concrete wassupposed(expected) to have cured by morning.\n178 TRICKY WORDS\nUse\/Used\n• Use as a verb meansutilize ordeplete.As a noun,it meanspurpose.\n• Used (the past tense ofuse,) is a verb meaningutilized ordepleted.As an\nadjective,it meanssecondhand.\n• Used to meansaccustomedtoorformerly.\nYou canuse(utilize) the same process youused(utilized) yesterday.\nWhat is theuse(purpose) ofbuyingused(secondhand) equipment ifit\ndoesn’t work?\nWe used to (formerly) talk regularly before we became used to (accus-\ntomed to) long periods ofsilence.\nPractice\nChoose the correct word in each ofthe following sentences.Check your work with\nthe answers on the next page.\n21. (Choose,Chose) your words carefully.\n22. Nigel (choose,chose) not to participate in the games.\n23. A (loose, lose, loss) today means we’ll (loose, lose, loss) our first place\nspot.\n24. The turkeys ran (loose,lose,loss) in the yard.\n25. The joint should remain (loose,lose,loss) so you won’t (loose,lose,loss)\nflexibility.\n26. Don’t (loose,lose,loss) your gloves.\n27. Luann was (suppose, supposed) to come earlier today (than, then)\nyesterday.\n28. We (use,used) to look at (use,used) cars,but now we’ve become (use,used)\nto driving new vehicles.\n29. (Choose,Chose) your racket;(then,than) go change your clothes.\n30. Spending a quiet evening at home is more appealing (than,then) it (use,\nused) to be.\n179 GRAMMAR ESSENTIALS\nAnswers\n1. brake,brake,break 13. knew,new 25. loose,lose\n2. passed,past 14. know,no 26. lose\n3. piece,peace 15. meet,meat 27. supposed,than\n4. plain,plane 16. advise,advice 28. used,used,used\n5. seen,scene 17. effect,affect 29. Choose,then\n6. by,buy 18. won,one,won,one 30. than,used\n7. dye,die 19. seam,seem\n8. weak,week 20. whether,weather\n9. dear,deer 21. Choose\n10. witch,which 22. chose\n11. hear,here 23. loss,lose\n12. hole,whole 24. loose\n180  CHAPTER 20 GRAMMAR IQ QUIZ\nChoose the correct word in parentheses in each ofthe following sentences.Answers follow\nthe quiz.\n1. Jonelle was (to,too,two) short (to,too,two) ride (to,too,two) ofthe rides at the park.\n2. (Their, They're, There) going to sit over (their, they're, there), by (their, they're,\nthere) luggage.\n3. (Wear,Where,Were) did you buy your sofa?\n4. It was (quit,quiet,quite) an accomplishment to get the group of four-year-olds to\n(quit,quiet,quite) playing and be totally (quit,quiet,quite) for story time.\n5. My parents (expect,accept,except) me to (expect,accept,except) the terms of my\nproject (expect,accept,except) for the due date,which is too soon.\n6. Ben acts as (though,threw,through) Jen (though,threw,through) the ball (though,\nthrew,through) the window on purpose.\n7. Claire was (all ready,already) with an answer to my rebuttal.\n8. You spent (all together, altogether) too much money trying to get the family (all\ntogether,altogether) for Thanksgiving.\n9. (Every day, Everyday) when I get home, I change into my (every day, everyday)\nclothes to walk my Chihuahua.\n10. Ifwe book our tickets now,(maybe,may be) we can get a better rate.\nAnswers\n1. too,to,to,two\n2. They’re,their,there\n3. Where\n4. quite,quit,quiet\n5. expect,accept,except\n6. though,threw,through\n7. all ready\n8. altogether,all together\n9. Every day,everyday\n10. maybe CHAPTER\n20\nMORE TRICKY\nWORDS\nThis chapter covers more confusing words: those\nthat have three easily confused meanings and those\nthat are sometimes written as one word and some-\ntimes as two. By the end of this chapter, you’ll know\nwhich ones to use and why.\nHere are some more of the most commonly\nconfused words that you are likely to use in your writing.If you learn\nto distinguish these words, you can avoid errors. The words are divided into\nthree separate sections,with practice exercises at the end of each section.\nTHREE-WAY CONFUSION\nTo\/Too\/Two\n• Tois a preposition or part ofan infinitive (used with a verb).\nPreposition: Use to for introducing a prepositional phrase that tells\nwhere: to the store,to the top,to my home,to our garden,to his labora-\ntory,to his castle,to our advantage,to an open door,to a song,to the sci-\nence room,etc.\n183 GRAMMAR ESSENTIALS\nPart ofan infinitive:Useto as part ofan infinitive (to followed by a verb,\nsometimes separated by an adverb):to run,to jump,to want badly,to\nseek,to propose,to write,to explode,to sorely need,to badly botch,to\ncarefully examine,and so on.\n• Too is an adverb meaning alsoor very.Wherever you use the word too,you\nshould be able to substitute the word also or very.\n• Two is an adjective,the name ofa number,as in one,two.\nThe couple went to(introduces a prepositional phrase) the deli to(intro-\nduces an infinitive phrase) pick up two (one, two) plate dinners\nbecause both ofthem were too(very) tired to(introduces an infini-\ntive phrase) cook dinner.\nThere\/Their\/They’re\n• Thereis an adverb that refers to a the location ofsomething or someone.\nWhenever you use the wordthere,you should also be able to substitute the\nwordhere.\n• Theirmeans “belonging to them.”Use it as an adjective to show possession.\n• They’reis a short form,or contraction,ofthe words they are.Usethey’reonly\nwhen you could also use the wordsthey are.\nThey’re (they are) going there (a location) to see their (belonging to\nthem) doctor.\nIftheir(belonging to them) children are inthere(a location),they’re(they\nare) in trouble.\nLead\/Led\/Lead\n• Leadas a verb means toguideordirect.As a noun,it meansfront position.\nIt rhymes withseed.\n• Ledis a verb,the past tense oflead,meaningguidedordirected.It rhymes\nwithred.\n• Leadis also a noun,the name ofa metal.It,too,rhymes withred.\nThe Pied Piper took thelead(front position) andled(guided) the chil-\ndren out ofHamlin.\nThe presence oflead(a metal) in the paintled(directed) us to think the\nhouse was old.\n184 MORE TRICKY WORDS\nQuite\/Quit\/Quiet\n• Quiteis an adverb meaningcompletely,very,orentirely.It rhymes with bite.\n• Quitis a verb meaningstop,ceaseorstopped,ceased.It rhymes withsit.\n• Quiet as an adjective means calm, silent, noiseless. As a verb,it means to\nsootheorcalm.As a noun,it meanstranquillity orpeacefulness.It rhymes\nwithriot.\nMother wasquite(very) shocked when the childrenquit (stopped) play-\ning and spent somequiet(calm) time in their rooms.\nWhere\/Wear\/Were\n• Whereis an adverb referring to a place or location.\n• Wearas a verb means toput on,tire,ordeteriorate.As a noun,it meansdete-\nrioration.\n• Wereis a verb,the plural past tense ofbe.\nWhere(a place) are the parts that showed excessivewear(deteriortion)?\nYou will wear (deteriorate) out this coat if you wear (put on) it all\nthe time.\nWhere(location) are the clothes youwere(helping verb) planning to\nwear (put on)tomorrow?\nPractice\nChoose the correct form of the word in parentheses.Check your work with the\nanswers at the end ofthe chapter.\n1. Along with the lettuce,please get (to,too,two) avocados (to,too,two) when\nyou go (to,too,two) the store.\n2. They should put (there,their,they’re) luggage in (there,their,they’re).\n3. If(there,their,they’re) interested in improving (there,their,they’re) health,\nI’ll help them get (there,their,they’re).\n4. Two hours is (quiet,quit,quite)a long time for children to be (quiet,quit,\nquite).\n5. The furnace (quiet,quit,quite) during the night,and it’s (quiet,quit,quite)\ncold in the house.\n6. Do you know (wear,were,where)I could (wear,were,where) something\nlike this?\n7. The horses (wear,were,where) restless today.\n185 GRAMMAR ESSENTIALS\n8. Ronald couldn’t remember (wear, were, where) the cards (wear, were,\nwhere).\n9. The foreman (led,lead)the workers out ofthe (led,lead) mine.\n10. Kevin mounted the (led,lead) horse and (led,lead) the wagons into the\nmountains.\nMORE THREE-WAY CONFUSION\nAccept\/Except\/Expect\n• Accept is a verb meaningto receive orbear.\n• Exceptis a preposition meaningbut,orexcluding.\n• Expect is a verb meaninganticipate,demand,orassume.\nCustomers expect (demand) nothing except (but) a fair deal, I expect\n(assume).\nWe expect(anticipate) they willaccept(receive) our apology.\nLorraine will accept (bear) the responsibility for making housing\narrangements.\nRight\/Write\/Rite\n• Rightis an adjective meaningcorrect,proper,or theopposite ofleft.\n• Writeis a verb meaningrecordorinscribe.\n• Riteis a noun meaningceremonyorritual.\nThe court reporter willwrite(record) the exact words ofthe testimony.\nThe shaman will be able to perform the rite (ceremony) in the right\n(proper) way.\nIt seemsright(proper) that we record theright(correct) answer on the\nright(opposite ofleft) side.\nThough\/Through\/Threw\n• Thoughas a conjunction meanseven if.As an adverb,it meanshowever.\n• Throughmeansfrom one side to the other.\n• Threwis the past tense ofthe verbthrow.It meanstossed.\nThough(even if) you may think it’s a waste,you shouldthrow (toss) away\noutdated medication.\nBibekthrew(tossed) the ballthrough(from one side to the other) the\nwindow.\n186 MORE TRICKY WORDS\nSent\/Cent\/Scent\n• Sent(the past tense ofsend,) is a verb meaningdispatchedortransmitted.\n• Centis a noun meaningone penny,a coin worth one-hundredth ofa dollar.\n• Scentis a noun meaningodororsmell.\nYou can buy thisscent(odor) capsule for just acent(one penny).\nThe guidesent(dispatched) a message as soon as the dogs picked up the\nscent (odor).\nSight\/Site\/Cite\n• Sightas a noun means theability to see.As a verb,it meanssee orspot.\n• Siteis a noun meaninglocationorposition.\n• Citeis a verb meaningquoteormake reference to.\nAt ninety,the old man’ssight(ability to see) was sharp enough tosight\n(spot) even the smallest flaw.\nThis is the proposedsite(location) for our school.\nCite(make reference to) the source ofthe information in your paper.\nPractice\nChoose the correct form of the word in parentheses.Check your work with the\nanswers at the end ofthe chapter.\n11. Our letter can be (sent,cent,scent) ifwe add another (sent,cent,scent) of\npostage.\n12. Bernice smelled the (sent,cent,scent) of cabbage when she walked into\nthe kitchen.\n13. The customers were (right,write,rite) in assuming the company would\n(right,write,rite) them a letter explaining the policy change.\n14. The senior prom is a (right,write,rite) ofpassage.\n15. The manufacturers (accept, except, expect) that we will (accept, except,\nexpect) a partial delivery or our order.\n16. The doctor walked (though, through, threw) the waiting room even\n(though,through,threw) the receptionist (though,through,threw) a fit\nevery time she did so.\n17. The quarterback (though,through,threw) the ball right (though,through,\nthrew) the hands ofthe receiver.\n18. Beyond the next hill you should be able to (sight,site,cite) the (sight,site,\ncite) for the new city park.\n187 GRAMMAR ESSENTIALS\n19. Researchers hope that their statistics will be (sighted,sited,cited) accurately.\n20. Everyone (accept,except,expect) John Henry will (accept,except,expect)\nour proposal.\nONE WORD OR TWO?\nThe words in this next section are very much alike but have different meanings,\ndepending on whether they are one word or two words.\nAlready\/All Ready\n• Alreadymeansas early as this,previously,or by this time.\n• All readymeanscompletely ready ortotally ready.\nThe dockhands had unloaded the warehousealready(as early as this).\nThe harvesters havealready(previously,by this time) finished that field.\nIs this print orderall ready(completely ready) to go?\nAltogether\/All Together\n• Altogethermeansentirely orcompletely.\n• All togethermeanssimultaneously.\nHis testimony was altogether(entirely) true.\nThe fans moaned all together(simultaneously).\nEveryday\/Every Day\n• Everyday meansordinary orusual.\n• Every daymeanseach day.\nI wore myeveryday(ordinary) clothes.\nInspectors examine the machineryevery day(each day).\nMaybe\/May Be\n• Maybe meansperhaps.\n• May bemeansmight be.\nMaybe(perhaps) we will finish a day earlier than we had planned.\nOn the other hand,wemay be (might be) later than we thought.\n188 MORE TRICKY WORDS\nALWAYS TWO WORDS\nThe words in this section are often incorrectly written as one word.\nAll Right\nAlrightis substandard usage.Avoid using this form in formal writing.\n• All rightmeanscompletely fine orentirely good.\nYour work seemsall right (completely fine) to me.\nA Lot\/Allot\nAlotis substandard usage.Avoid using this form in formal writing.\n• A lotmeansmuch.\n• Allotis a verb meaning toportion out.\nThe committee should allot (portion out) a lot of (much) time for\nquestions.\nPractice\nChoose the correct form of the word in parentheses.Check your work with the\nanswers on the next page.\n21. You (where,wear,were) your (everyday,every day) shoes almost (everyday,\nevery day).\n22. (Maybe,may be) ifwe change our approach,it (maybe,may be) the thing\nthat will help us get back on track.\n23. If the whole section had been (already,all ready) we could have (already,\nall ready) started.\n24. They should be (alright,all right) ifthey read the directions.\n25. Ifwe get the whole family (altogether,all together),we should have (altogether,\nall together) enough people power to finish moving.\n26. Chester thought it was (all right,alright) to (a lot,allot) a few tickets for\nfamily members.\n27. Patrick has (a lot,allot) ofspare change.\n28. Keith has (all ready,already) picked up our mail,but (may be,maybe) we\ncan catch him before he leaves.\n29. Guy (may be,maybe) able to deliver this speech ifhe can get his notes (all\ntogether,altogether).\n30. Margaret leaves at 3:30 (every day,everyday).\n189 GRAMMAR ESSENTIALS\nAnswers\n1.two,too,to 13.right,write 23.all ready,already\n2.their,there 14.rite 24.all right\n3.they’re,their,there 15.expect,accept 25.all together,\n4.quite,quiet 16.through,though, altogether\n5.quit,quite threw 26.all right,allot\n6.where,wear 17.threw,through 27.a lot\n7.were 18.sight,site 28.already,maybe\n8.where,were 19.cited 29.may be,all\n9.led,lead 20.except,accept together\n10.lead,led 21.wear,everyday, 30.every day\n11.sent,cent every day\n12.scent 22.Maybe,may be\n190 CONCLUSION\nYou’ve done it! You’ve made it through these\nlessons.Now you can take the Grammar IQ Final Exam that follows,with\nconfidence! Check your answers at the end ofthe exam.In addition,ifyou have\ntrouble with verbs in English,you should refer to Appendix A,“Two-Word Verbs,”\nwhich tells you how to use certain idiomatic verb forms.Ifyou had fun or want\nto learn even more about writing,look at Appendix B,“Additional Resources.”\nNow it’s time to reap a return on the money you invested in this book.Here’s\nhow:Write a memo asking for a raise.Ifyou can do that,you know the time you’ve\nspent with this book has been worth your while.Go ahead,do it.The worst thing\nthat can happen is that your request will be denied.Even ifthis happens,your writ-\ning will have made an impression.Ifyou presented a few good arguments,your\nsupervisor will remember them.Your next raise will probably come sooner as a\nresult.The best thing that can happen,ofcourse,is that you will get a raise.How\ncan you lose? Even ifyou don’t send the memo,write it.It will build your confi-\n191 GRAMMAR ESSENTIALS\ndence,and maybe you’ll send it at a more opportune time.In the meantime,you\ncan think about what you want to say in the memo,revise it,and add to it.\nWhenever you have an idea that you want to be taken seriously,write a memo.\nIt won’t be long before people begin to notice that you can communicate well with\nwritten words.The ability to write well is a skill that will help you not only in busi-\nness,but in many other areas ofyour life.\n192 "}