{"text":"LESSON ONE: THE DEMANDS OF READING\nObjectives:\nNote to Teacher\nIf this is the first day\nLearners will be able to:\nwith a group of new\nlearners, you may\n(cid:57) Understand when during their daily lives they need or want\nwant to devote a\nto read. whole session or two\nto welcoming\nlearners, having\n(cid:57) Identify what strategies they use to deal with reading\nlearners introduce\ndemands, and which strategies are most successful. themselves, building\ncommunity, and\nreviewing class\nMaterials: expectations and\nguidelines. If you have\nAuthentic, everyday reading materials: already covered these\nareas, you can move\n• cereal box\ninto the lessons.\n• checklist\n• price tag\n• form (application form, voter registration form, etc.)\n• photo of a street sign Note to Teacher\n• toothpaste tubes (adult and children’s toothpastes) The materials listed at\nthe left are intended\n• children’s book as possible samples\nof literacy demands\n• newspaper\nadults encounter\n• permission slip for child’s school during a normal day.\nFeel free to modify\n• sample of child’s school homework\nthis list and the\n• restaurant menu following activity using\nmaterials you find\n• paperback novel easily available (TV\nGuide, etc.).\n• cookbook\nOther materials:\n• newsprint, pens, tape\nVocabulary:\n• strategy\n• text\nTime: 30 – 40 minutes\nUnderstanding What Reading Is All About 9 NCSALL Teaching Materials\nSteps:\n1. Introduce the lessons\n• Explain to learners that you will be focusing in several\nlessons on reading and the reading process. They will learn\nmore about the skills used by good readers, will think about\nwhat they want to read, and will develop a plan to help\nthem meet their reading goals.\n• Tell learners how you propose to use these lessons – your\nschedule and how the lessons will fit in with other class\nwork. If you plan to give your learners a folder, you may\nwant to do this now so they can begin their reading\nvocabulary list.\n2. Look at daily demands of reading\nNote to Teacher • As the teacher, talk about your previous day and illustrate\nYou may want to hang all the times you interacted with text. (Explain that you will\nup a blank sheet of be using the word “text” to refer to many kinds of printed\nnewsprint at the\nmaterial, not just textbooks.) For example, you may have\nbeginning of each\nclass so you can jot chosen the adult rather than the child toothpaste (show both\ndown new vocabulary\ntubes), picked a cereal (show a box), read the paper (show\nwords throughout the\nlesson. Save the any newspaper), checked your kids’ homework (display\nsheet and use it to\nsample), signed a permission slip for a child’s field trip\nreview new words at\n(display sample), read a story to your child, and so on. Go\nthe beginning of the\nnext lesson. Suggest through a typical day from morning through bedtime\nlearners add words to\nexamining your reading demands.\ntheir own vocabulary\nlists.\n• Ask learners as a group to think through their previous day,\nin detail. At what point in the day did they come across text\nthey needed to read? Did anyone:\n⇒ Pick a cereal? (Display sample box) How? (By color of\nbox, picture, and name?)\n⇒ Check a list? (Display) How?\n⇒ Sign for something at a child’s school? (Display)\n⇒ Have to fill out a form at work?\n10 Understanding What Reading Is All About Teaching Materials NCSALL\n⇒ Look at a street sign? (Display photo)\n⇒ Look at a price tag? (Display) How?\n⇒ Scan a menu? (Display) How?\n⇒ Read to a child? (Display children’s book)\n⇒ Anything else?\n• Explain the following, using this sample language as a\nguide:\nEach of us interacts with text many times each day. Some of it we\ndon’t have to “read” because we already know what it says by\nother cues. Stop signs are an example of how we know what\nsomething says by the cues of color, shape, and position at the end\nof a road. Fast food drive-up windows have pictures of “combos”\nthat can be ordered by number.\nUsing these cues is one form of “strategy” we use when we take\nmeaning from text without actually “reading” it.\nWhat are other strategies you use during the day when you need to\nread or write?\n• Write what they say on the board, saying each word as you\nwrite it.\nIf necessary, prompt your learners by offering some\nexamples, like: “reading” the subway schedule by looking\nat colored lines, etc.\n• Explain the following:\nThese are good strategies, ones that everyone uses, and it’s good to\nhave developed them. (For example, if I can’t understand a manual\nthat explains how to do something on my computer, I get a co-\nworker to read it through with me, step-by-step, as I try to follow\nit. I may have to read the steps out loud as I work on the\ncomputer. I have to use the pictures or diagrams to help me\nunderstand.) But what happens when you need to read something\nand these strategies don’t work well enough? Then what do you\nUnderstanding What Reading Is All About 11 NCSALL Teaching Materials\ndo? (Prompt a few answers if they are stuck by offering\nexamples like: use a cheat sheet, etc.)\nYou are studying here because you want to improve your reading\nskills, which will expand the range of strategies you can use to\nmeet reading demands.\nNote to Teacher\nHomework:\nTo prepare learners\nfor the homework,\n• Have learners bring in text items from their daily lives\nremind them of the\nreading items you (home, school, work) that they need to read or want to read.\nbrought in (toothpaste Ask them to bring in about three items each. Remind them\ntube, permission slip,\nof the things you have used as examples from your own life.\netc.). Then ask for a\ncouple of volunteers\nto give an example of • Ask learners to think about what strategies they use to\nwhat they think they\nunderstand what something says when they can’t\nmight bring in.\ncompletely read it.\n3. Wrap up:\n• Review any new vocabulary words you have jotted down\nNote to Teacher\non the newsprint.\nIf you have more\nadvanced learners\n• Have learners copy the new words into their notebooks.\nwho are comfortable\nwith writing, you can\nsuggest a writing • Give learners about five minutes to reflect on the lesson. Do\nactivity instead of a this by grouping learners into pairs and having them ask\npaired oral activity for\neach other:\nwrap-up. Have\nlearners write the\nanswers to the ⇒ Did you learn at least two new things from today’s class?\nquestions at left in\ntheir notebook. ⇒ What were they?\nCollect the notebook,\nreview their\n⇒ Is there anything you still have questions about or aren’t clear\nresponses and\nquestions, and give about? If so, what?\nthem your responses\nin writing as well, right • Have one person from each pair summarize comments or\nin the notebook. This\nquestions back to the class. It is not necessary to identify\nkind of “dialogue\njournal” provides who made the comments or asked the questions.\nanother opportunity\nfor reading. • Answer any questions.\n12 Understanding What Reading Is All About LESSON TWO: GOALS FOR READING, PART 1\nObjectives:\nLearners will be able to:\n(cid:57) Identify what kinds of text they need or want to read\nregularly.\n(cid:57) Explore what reading means to experienced readers in order\nto build their ideas of what reading means in their own lives.\nMaterials:\n• homework learners bring in from Lesson One\n• “Possible Interview Questions” handout (on page 16)\nTime: 30 – 40 minutes\nSteps:\nNote to Teacher\n1. Follow up from Lesson One and homework\nExplain that all\nlearners are “in the\n• Have the learners display the text items they brought in.\nsame boat” because\nThey can arrange their items right on their desks, or you can they are all trying to\nimprove reading skills.\nset up a table for people to place their items on so everyone\nBy talking about\ncan see them. strategies as a group,\nstudents can learn\n• Go around the room and ask each learner to explain which from one another.\nIf you don’t have time\nitems of text they have strategies for understanding and\nto go through all the\nwhich ones they find harder to read. This will give you a\nlearners, ask for a few\ngood sense of what their reading needs are. volunteers.\nHigher level learners\ncan explain their\n2. Look at what experienced readers do strategies or lack of\nstrategies in their\n• Explain the following: notebook in a short\nwriting activity of\nabout 10 minutes.\nLet’s talk about what experienced readers do when they read and\nwhy they read. For example, I love to read. I read (add examples\nUnderstanding What Reading Is All About 13 NCSALL Teaching Materials\nhere of what you like to read: novels, poetry, magazines...).\nOne of my favorite books is (add your own example here)\nbecause (add your own explanation). Reading is a form of\nrelaxation and escape for me. It's also a way I learn things, and\nit’s a way to get new ideas.\nWhen I read different things, I read them in very different ways.\nNote to Teacher\nFor example, I read poetry very closely, every word. But when I\nThe activity at the\nright has learners read the newspaper, I skim through it to see what catches my eye.\ncome up with\nSometimes I go right to the sports page or food section or “Dear\nquestions on their\nown. If you are short Abby.” I should also add that there are things I hate to read, like\non time, you can have\ncomputer manuals or technical manuals for how to operate VCRs\nlearners use the\nand things like that! I have to read them over and over and\nreading interview\nquestion sheet sometimes they still don’t make sense to me. I’m kind of afraid of\n(“Possible Interview\nthem!\nQuestions”) that\nfollows this lesson as\na starting point and For our next lesson, you're going to interview people who love to\nadd any other read so you can learn about why they like to read, what reading\nquestions they want to\ndoes for them, and what kinds of things they like to read and how\nask. Remember: The\nmain goal of this they approach different kinds of reading.\nactivity is to generate\nquestions that show\nThen you'll share this information in class so we can get a picture\nhow experienced\nof the habits of many readers. By understanding what experienced\nreaders read different\nthings in different readers do, we can get some ideas of how we can approach reading\nways for different\nin our own lives.\npurposes.\n• Ask: Is there anyone in your life you look up to who reads a lot?\nWhat do you think they read? (If learners have trouble with\nthis question, suggest someone they know from the program\nwho reads a lot.)\nEach learner should come up with at least one person he or\nshe respects who reads regularly.\n• Ask: Let’s think about what kinds of questions we could ask\nthese people about how reading fits into their lives. What\nquestions could you ask him or her about what they read,\nhow they read, and why they read? What would you really\nlike to know about? Write their suggestions on the board.\n(If learners get stuck, prompt them with some examples,\n14 Understanding What Reading Is All About Teaching Materials NCSALL\nsuch as: How often do you read? Is reading ever difficult for\nyou? What is your favorite kind of reading? What is your favorite\nbook?)\nHomework:\n• Have learners take their questions home and interview Note to Teacher\nsomeone about his or her reading habits. Ask learners to It is important to\nprepare learners\nbring back the questions with their answers to the next class.\ncarefully for their\nExplain that they will be sharing their answers in the next homework. Here are\na few ideas:\nclass by talking about them. The spelling and grammar of\n1. Go over all the\ntheir answers don’t matter.\nquestions in class\nso learners can\nread them fluently.\n2. Have learners\npractice asking and\nanswering the\nquestions in pairs\nwith each other.\nThis will give\nlearners a chance\nto practice jotting\ndown the answers.\nReassure them that\ntheir answers can\nbe short phrases or\na few words and\nspelling doesn’t\nmatter. For\nlearners who have\nparticular difficulty\nwith taking notes,\nyou may want to\nsuggest that they\nuse a tape recorder\nfor the interview.\n3. Before learners\nleave class, make\nsure each one\ngives the name of a\nperson they can\ninterview. If\nanyone cannot\nthink of a person,\nvolunteer yourself.\nA small group may\nwant to interview\nyou at the same\ntime.\nUnderstanding What Reading Is All About 15 NCSALL Teaching Materials\nHandout: Possible Interview Questions\nName: __________________________________________________________\nDate: __________________________________________________________\n1. Why do you read?\n2. What have you read this week and why?\n3. What is the best thing you have ever read?\n4. If you read the newspaper, what is your favorite section?\n5. Do you read everything the same way?\n6. How often do you read? Why did you like to read?\n7. How do you decide what to read about?\n8. How do you feel about the reading you do?\n9. Do you ever struggle with reading? When? What do you do to understand\nsomething when it’s difficult?\n10. How did you learn to read?\n11. Add anything else you would like to say about reading.\n16 Understanding What Reading Is All About LESSON THREE: GOALS FOR READING,\nPART 2\nObjectives:\nLearners will be able to:\n(cid:57) Identify what, how, and why experienced readers read and\napply this knowledge to their own reading process.\n(cid:57) Set reading goals in their roles as family members, workers,\nindividuals, and community members.\nMaterials:\n• interviews with readers from previous night’s homework\nNote to Teacher\n• “Reading Goals” sheets (on pages 21 and 22)\nThe goal of this\nactivity is to demystify\n• blank newsprint, markers the reading process\nand help learners\nbecome aware that\nVocabulary: experienced readers\nread different things in\n• proficiently different ways for\ndifferent purposes.\nIf learners are having\nTime: 40 – 60 minutes a difficult time\nanalyzing the answers\nfrom the interviews,\nSteps: you may want to\nprompt them by\nasking:\n1. Follow up on interviews\nWhat kinds of things\ndid the people you\n• Ask 4-5 students to share aloud what they learned from their\ninterviewed read?\ninterviews with experienced readers. Have one student Were they all the\nsame kinds of text?\nreport back on questions 1-3, another on 4-6, and so on. Ask\nDid any of them still\nif there is anything else any other students would like to add\nhave difficulty with\nabout their interviews. any kinds of reading?\nWhat is their feeling\n• Write the information down on newsprint as learners give it. about reading?\nUnderstanding What Reading Is All About 17 NCSALL Teaching Materials\n• Then ask: Let’s look at these responses. Have you learned\nanything new about the way experienced readers read? Does this\nmake you think any differently about your own reading; for\nexample, the kinds of things you’d like to read or read better?\n2. Set goals for reading\n• Explain to learners: We’ve talked about how experienced readers\nread and how this might make you feel differently about your own\nreading. Now let’s move toward setting goals for reading.\nImagine yourself reading proficiently (that is, easily). What\nwould you be reading? Think about the reading day you described\nin our first lesson. You play many roles: family member, worker,\ncommunity member, individual. What kind of reading do you do\nin each role? What kind of reading would you like to be able to do\nNote to Teacher\nor improve? Once you know what you want to be able to read, or\nTwo Reading Goal\nsheets are produced to read better, you will be able to make progress more easily\non the next page and because you have specific goals to work toward.\nfull-size masters\nsuitable for photo-\ncopying can be found • Pass out the sample reading goals sheet (full-size\non pages 21 and 22. photocopyable masters can be found at the end of this\nUse the version that\nlesson, on pages 21 and 22). Review it with learners. Give a\nbest suits the reading\nlevel of your learners. few examples: Some of you now read menus well, but you\nstruggle with novels. Or: You want to read children’s books so\nyou can read with your kids.\n18 Understanding What Reading Is All About Teaching Materials NCSALL\nReading Goals\nName: _______________________________________________\nDate: _______________________________________________\nAs a family member, I now read: I would like to be able to read:\nAs a community member, I now read: I would like to be able to read:\nAt work I read: I would like to be able to read:\nFor myself, I read: I would like to be able to read:\nReading Goals\nName: _______________________________________________\nDate: _______________________________________________\nI want to read\nSo I can __________________________________________\n__________________________________________\nI want to read\nSo I can __________________________________________\n__________________________________________\n(full-size photocopyable masters can be found on pp. 21 & 22)\n• Give learners about 10 minutes to fill in their sheets.\n• Have learners keep their sheets in their notebooks so they\ncan refer back to their goals individually and in conferences\nwith you.\nUnderstanding What Reading Is All About 19 NCSALL Teaching Materials\n3. Wrap up\nNote to Teacher\nAn excellent tool for\n• Review any new vocabulary words; have learners copy\nsetting reading goals\nis provided by Marilyn them into their notebooks.\nGillespie (1990) in\nMany Literacies: • Explain to learners that they will be revisiting their Reading\nModules for Training\nGoals sheets from time to time so they can revise them and\nAdult Beginning\nReaders and Tutors. see their progress.\nAmherst, MA: Center\nfor International\nEducation. The useful\ntool is the Goals List\non page 89, reprinted\nwith permission at the\nend of this guide (see\nAppendix A).\n20 Understanding What Reading Is All About Teaching Materials NCSALL\nHandout: Reading Goals\nName: _________________________________________\nDate: _________________________________________\nAs a family member, I now read: I would like to be able to read:\nAs a community member, I now I would like to be able to read:\nread:\nAt work I read: I would like to be able to read:\nFor myself, I read: I would like to be able to read:\nUnderstanding What Reading Is All About 21 NCSALL Teaching Materials\nHandout: Reading Goals\nName ____________________________________________\nDate ____________________________________________\nI want to read _____________________________________\nSo I can _________________________________________\nI want to read _____________________________________\nSo I can _________________________________________\nI want to read _____________________________________\nSo I can _________________________________________\n22 Understanding What Reading Is All About LESSON FOUR: THE COMPONENTS OF\nREADING\nObjectives:\nLearners will be able to:\n(cid:57) Identify reading as a developmental process, with several\nNote to Teacher\ncomponents. When dealing with\nbeginning-level\n(cid:57) Use the following reading-related vocabulary words: readers, you should\nalways read aloud\nautomatic, decode, blend, fluency, analyze, vocabulary,\nwhat you write on the\ncomprehension, and components. board to the class.\n(cid:57) Develop an awareness of their own reading development.\n(cid:57) Identify some skills they need in order to move ahead in\ntheir reading development.\nMaterials:\n• blackboard or newsprint (one newsprint with the made-up\n“word” on page 25)\n• “The Components (Parts) of Reading” handout (on page 31)\n• “Using the Components of Reading” handout (on page 32)\n• learner notebooks\nVocabulary:\n• analyze\n• automatic\n• blend\n• components\n• comprehension\n• decode\n• fluency\n• vocabulary\nUnderstanding What Reading Is All About 23 NCSALL Teaching Materials\nTime: About 2 hours\nSteps:\nNote to Teacher\nThis lesson, using the\nanalogy between 1. Go over first steps in learning to drive\nlearning to drive and\nlearning to read,\n• Explain to learners: Learning to read involves learning things\nintroduces students to\nthe concept that step by step just like learning anything else. For example, let’s\nreading involves a think of how you learned to drive.\nseries of steps.\n• Ask: How many people in the class drive? How many would like\nto know how to drive?\n• Ask:\n⇒ When you started learning how to drive, what did you have to\nNote to Teacher learn first? (Use learners’ responses to these questions.\nIf learners are unable Possible answers appear below.)\nto answer easily, you\ncan guide them to\n⇒ What did you have to learn next?\nsome of the possible\nanswers like those\nlisted at right. Other ⇒ How did you become comfortable before you started driving on\nideas that reinforce a crowded street? What did you have to do before driving\nthe comparison\nalone on the highway?\nbetween reading and\ndriving may come\nfrom the learners. Possible answers:\n⇒ First, learn parts of the car.\n⇒ Next, learn to drive in a safe place with an instructor.\n⇒ Then practice a lot.\n• Ask: How do you feel when you drive now? Do you have to think\nabout which pedal to step on for the gas or which one for the brake?\n• Summarize: So, learning to read is like learning to drive. In the\nbeginning, you have to think about everything that you’re doing.\nEventually, it comes easily and automatically and you don’t really\nhave to think about it. But first you have to get good at the skills\nthat make it up, through instruction and practice.\n24 Understanding What Reading Is All About Teaching Materials NCSALL\n2. Go over first steps in learning how to read\n(Go over the following activity as a preliminary to walking learners\nthrough the stages of reading:)\n• Explain: Learning to read requires learning things step-by-step\nor in stages just like learning to drive. Let’s find out how we learn\nto read.\n• Post a newsprint with the “word” #^^%** on it. Ask learners\nwhy they can’t read it.\n#^^%**\nAnswer: They have not seen the word before and do not\nknow what all the symbols mean or understand how they go\ntogether to make a word.\n• Ask learners what they would need to know in order to\nunderstand the “word.” If they have trouble responding,\nguide them to realize that they first need to recognize the\nletters of the “alphabet” and to produce the sounds that\ncorrespond to the letters before they can read the “word.”\n• Ask: So, what is the first thing you need to be able to do in order\nto read real words? In the steps below, you will guide learners\nto realize that they must sound out (decode) the individual\nletters in a word and then pull (blend) them back together\nby modeling the process for them.\n• Write the word “yit” on the board.\nUnderstanding What Reading Is All About 25 NCSALL Teaching Materials\n• Slowly sound out each letter \/y\/-\/i\/-\/t\/ and ask the learners\nNote to Teacher\nto describe what you are doing. You explain that this process\nIt is important to\nof sounding out the letters is called sounding out or\nspend some time\ndefining the word decoding. Then you model how to put the sounds back\n“analyze.” You can\ntogether to form “yit,” and again ask the learners to describe\nask: “Has anyone\nheard of the word what you have done. You explain to learners that putting\n“analyze?” What the sounds back together is called blending.\ndoes it mean?\nAnalyze means to\n• Explain: We call decoding and blending words back\ntake something apart\nin order to look at it together “analyzing words.”\nmore closely. For\nexample, when • Explain: When we read the word “yit,” we have to look at each\nsomeone is angry with\nletter and sound it out. Then we have to blend the sounds back\nyou, you might try to\nanalyze the situation together. When we “decode” or “blend” sounds back together, we\nby thinking of all the\nare analyzing words because we are looking very closely at parts of\nthings you might have\ndone to make your individual words.\nfriend angry.\nEncourage learners to\n3. Explain parts of reading\nthink of other times in\ntheir lives when they\nanalyze something. • Explain to learners that you are going to introduce the\nvarious parts, or components, involved in the reading\nprocess and that you will return to each of these components\nin more detail in later lessons. Post these definitions on\nnewsprint.\nNote to Teacher Automatic Feeling comfortable with something:\ndoing it without having to think\nSome students learn\nwords by sight before Decode The process of sounding out\nthey learn how to individual letters\ndecode. Sight word\nBlend Putting individual letters back\nreading, however,\ntogether again\nbecomes a less\neffective strategy as Fluency Reading with ease, reading with\nhigher level texts speed\nbegin to include a\nAnalyze Decoding and blending words back\nlarger number of\ntogether\nunfamiliar words.\nVocabulary Words and their meanings\nComprehension Understanding what you read\nComponents Parts\n26 Understanding What Reading Is All About Teaching Materials NCSALL\n• Pass out the pie chart titled “The Components (Parts) of\nReading” to each learner (a reduced version is shown below;\nthe photocopyable full-size master can be found on page 31).\nPoint out that “components” means “parts.” Ask learners to\nsave the pie charts in their notebooks because you will be\nreferring to it frequently in future lessons. You can also\nenlarge the pie chart on newsprint or make an overhead.\n• You can point to the various sections of the pie to explain\neach part. Refer to the pie chart to explain the following:\n⇒ “Decoding” is the process of sounding out or analyzing\nindividual letters and words.\nExplain that sometimes it is not possible to sound out or\ndecode a word because the word does not follow the\nrules. For example it is difficult to decode the word\n“because.” It is easier to memorize the word or “learn it\nby sight.”\nThe Components (Parts) of Reading\nDECODING\nFLUENCY\nAnalyzing words and Reading with\nknowing words by speed and ease\nsight\nLearning meaning of Understanding what\nwords you read\nVOCABULARY COMPREHENSION\n(full-size photocopyable master can be found on p. 31)\nGo back to the driving analogy. Explain to students that\nafter they learn to analyze words, they need to practice\ntheir reading skills in order to read fluently or smoothly,\nUnderstanding What Reading Is All About 27 NCSALL Teaching Materials\nthe same way they had to practice driving in order to\ndrive smoothly.\n⇒ “Fluency” is reading with ease.\nExplain that we need to read with speed and accuracy to\neasily understand what we read. Practice builds fluency.\n⇒ “Vocabulary” refers to words and their meanings.\nExplain that knowing what a word means is often as\nimportant as knowing how to say it.\n⇒ “Comprehension” means understanding what you read.\nExplain to learners that we need to be able to understand\nwhat we read so we can get information, be entertained,\ncommunicate, etc.\n4. Ask learners to reflect\nNote to Teacher • Ask learners to think about which components of reading\nYou might want to they feel better at and which ones need more work. Have\nplace learners in pairs\nlearners explain the reasons for their choices. Ask learners\nas they examine their\nown reading process. what skill(s) they need to focus on.\nUsing a \"think aloud\nprotocol\" where • Explain that skilled readers use all the components of\nlearners talk about\nreading simultaneously. For example, a proficient reader\ntheir reading may help\nthem articulate their decodes words and understands their meanings at the same\nstrengths and\ntime while she reads.\nweaknesses.\n• Pass out the “Using the Components of Reading” handout\nand review the suggestions for each component (a reduced\nversion is reproduced on the following page; the full-size\nphotocopyable version can be found on page 32):\n28 Understanding What Reading Is All About Teaching Materials NCSALL\nUsing the Components of Reading\nDECODING FLUENCY\nAnalyzing words and knowing\nReading with speed\nwords by sight\nand ease\n• Learn the n ames of letters\n• Read smoothly\n• Learn the sounds of letters\n• Read often\n• Learn to break (decode) words\ninto sounds\n• Learn to blend the sounds\nback together\n• Learn words by sight\nLearning meaning of Understanding what you read\nwords • Understand what you read\n• Learn the meanings of • Use reading to learn new\nindividual words information\n• Use reading to communicate\nwith other people\n• Read for pleasure\nVOCABULARY COMPREHENSION\n(full-size photocopyable master can be found on p. 32)\nAnalyzing words and knowing words by sight\n• Learn the names of the letters\n• Learn the sounds of the letters\n• Learn to break (decode) words into sounds\n• Learn to blend the sounds back together\n• Learn words by sight\nReading fluently\n• Read smoothly\n• Read often\nLearning new vocabulary\n• Learn the meanings of individual words\nUnderstanding What Reading Is All About 29 NCSALL Teaching Materials\nUnderstanding what you read\n• Understand what you read\n• Use reading to learn new information\n• Use reading to communicate with other people\n• Read for pleasure\n5. Wrap up & reflect\nThere are a number of ways you can help students reflect on what\nthey learned during the session. Use the question prompts below\n(you should post these on newsprint) and have students choose\nfrom the following ways of reflecting:\n⇒ Write in a journal\n⇒ Discuss the questions with a partner\n⇒ Make brief notes to himself or herself\nTell learners that spelling, grammar, and correctness do not matter\nfor this kind of writing – here, writing is a tool to help them reflect\non what they are learning.\nQuestion Prompts:\n• What did you learn today?\n• Did you learn anything that surprised you?\n• Why do you think I am teaching you about how we\nlearn to read?\n• How might this help you?\n30 Understanding What Reading Is All About Teaching Materials NCSALL\nHandout: The Components (Parts) of Reading\nDECODING FLUENCY\nReading with\nAnalyzing\nspeed and\nwords and\nease\nknowing words\nby sight\nLearning\nUnderstanding\nmeaning of\nwhat you read\nwords\nVOCABULARY COMPREHENSION\nUnderstanding What Reading Is All About 31 NCSALL Teaching Materials\nHandout: Using the Components of Reading\nDECODING FLUENCY\nAnalyzing words and knowing\nwords by sight Reading with speed\nand ease\n• Learn the names of letters\n• Learn the sounds of letters • Read smoothly\n• Learn to break (decode) words • Read often\ninto sounds\n• Learn to blend the sounds\nback together\n• Learn words by sight\nUnderstanding what you read\nLearning meaning of\nwords • Understand what you read\n• Use reading to learn new\n• Learn the meanings of information\nindividual words • Use reading to communicate\nwith other people\n• Read for pleasure\nVOCABULARY COMPREHENSION\n32 Understanding What Reading Is All About LESSON FIVE: ANALYZING WORDS\nObjectives:\nLearners will be able to:\n(cid:57) Use (and practice) the following word analysis strategies:\nNote to Teacher\n• Wilson Reading System “sound tapping” strategy to In addition to\nencouraging learners\ndivide words into individual sounds\nto analyze words, the\n• “word family” strategy for decoding strategies mentioned\nat left promote\n• base word and suffix identification reading accuracy.\n(cid:57) Think about which strategies they find most useful.\nMaterials:\n• blackboard or overhead projector\n• “Word Analysis Strategies” handout (on page 41)\n• “Strategies for Improving Reading Skills” handout\n(on page 42)\nVocabulary:\n• base word\n• suffix\nTime: 40-60 minutes (can be broken up into mini-lessons and\nshould be for lower-level learners)\nSteps:\n1. Define “strategy”\n• Review the components or parts of reading introduced in\nthe last lesson (decoding, fluency, vocabulary, and\ncomprehension). Tell them this lesson will focus on\nanalyzing words.\nUnderstanding What Reading Is All About 33 NCSALL Teaching Materials\n• Explain: Strategies are what we use to help us accomplish a task.\nA strategy is like a plan of action. Runners, for example, must\nhave a strategy to win a race. They must decide how fast to start\nout, when to pass someone, and how to pace themselves so they\nhave some energy left for the last stretch of the race.\nHere's another example. When we decide we are interested in\nsomeone, we devise a strategy to attract that person’s attention and\nwin their affection. What kinds of strategies might someone use to\nattract another person’s attention? (Possible answers include,\nmake ourselves look attractive, try to impress the person, try\nto be helpful, considerate, polite, etc.) Can you think of other\nsituations that require a strategy?\nSkilled reading also requires strategies. We use strategies to figure\nout words we do not know. In this lesson we are going to learn\nabout some strategies for reading (decoding) words we do not\nrecognize by sight.\n2. Demonstrate “sound tapping” strategy\nNote to Teacher • Show how to use the Wilson Reading System “sound\nThe “sound tapping” tapping” strategy to decode unfamiliar words.\nstrategy is only\nappropriate for\n• Explain: We are going to learn how to tap out the sounds in\nphonetically regular\nwords. Many words in words using our fingers. This helps us hear each of the sounds in a\nthe English language\nword. It also helps us blend or put the sounds back together in the\nare not phonetically\nregular. Beginning right order. Please use the hand you write with. Each finger will\nreaders may not be stand for one sound. We will tap out the first sound with our\nable to distinguish the\nindex finger (hold up your index finger), the second sound with\ndistinct sounds and\nthis activity may not our middle finger and thumb (demonstrate), the third sound with\nbe appropriate for\nour ring finger and thumb (demonstrate) and the fourth sound\nthese learners.\nwith our pinkie and thumb. If we run out of fingers, we just go\nback to the index finger again (demonstrate how to return to\nthe index finger on the same hand).\nLet’s practice by tapping out the word “cat.” “C-a-t” has three\nsounds so it gets three taps.\nLet’s try “spit.” “ S-p-i-t” has four sounds so it gets four taps.\n34 Understanding What Reading Is All About Teaching Materials NCSALL\n• Write the following words on the board:\nSplat made this\n• Observe while learners tap out the following words, Note to Teacher\nintervening when necessary. The words to the left\nwill be difficult for\n“splat” (five sounds = five taps) many learners. You\nmay want to substitute\nwords with 1:1 sound\n“made” (three sounds = three taps because the e is\nletter correspondence.\n“silent”)\n“this” (three sounds because “th” makes one sound =\nthree taps)\n• Provide enough examples to ensure that learners are able to\nuse the Wilson “sound tapping” strategy. Examples of\nnonsense words appropriate for Wilson “sound tapping” are\nshown below in order of difficulty.\nvit zam wox Note to Teacher\nUsing “nonsense\nyep sux et\nwords” requires\nlearners to use their\ndecoding skills to read\nslig trum bont unfamiliar words.\nWhen using real\ncust smim frix\nwords, you will never\nbe sure whether a\nlearner is decoding or\nstrint thrimp squelt relying on her\nprevious sight\nblesk splust memory of the word.\n• Ask learners to reflect on the Wilson “sound tapping”\nstrategy using the following questions as prompts:\n⇒ Did you find it easy to use?\n⇒ How would you use it when you are reading?\nUnderstanding What Reading Is All About 35 NCSALL Teaching Materials\n3. Demonstrate “word family” strategy\n• Explain: Another approach we can use to read words we don’t\nNote to Teacher\nrecognize by sight is the “word family” strategy. “Word families”\nThe “word family”\nare groups of letters that have the same sound and often go\nalways starts with the\nvowel and includes together in words. For example, “ing” is a word family because\nthe letters that follow\nmany words have “ing” in them (sing, ring, wing, thing).\nit.\nWrite these words on the board, underlining the “ing” in\neach word, and encourage learners to add to the list.\nsing ring wing thing\n• Write the following nonsense words on the board and ask\nlearners to decode them by identifying and reading the\n“word family” first. Do this as a whole class activity, asking\nlearners to volunteer to read the “family” in the first column,\nNote to Teacher\nThe “word family” second column, and so on.\nstrategy is best for\nwords that end in “ng”\nor “nk” because those sprank glick brunk kish\nsounds are so difficult\ntrank zick lunk tish\nto separate.\npank krick krunk gish\n• Encourage learners to generate lists of words for other\ncommon “word families” (“and,” “ent,” “ath,” etc.). Write\nthese on the blackboard\n• Divide learners into pairs.\n• Hand out the “Word Analysis Strategies” handout that\nappears on the next page (full-size photocopyable master\ncan be found on page 41).\n36 Understanding What Reading Is All About Teaching Materials NCSALL\n• Have learners practice using the “sound tapping” and\n“word family” strategies to read the words on the sheet.\nWord Analysis Strategies\n“sound tapping” strategy “word family” strategy\nash, cash, lash, splash ash, cash, lash, splash\nluck, truck, pluck luck, truck, pluck\ntank, sank, thank, spank tank, sank, thank, spank\n(full-size photocopyable master can be found on p. 41)\n• Ask: Which of these strategies did you find more useful? Why?\n4. Explain base words and suffixes\nNote to Teacher\nExplain to learners\n• Explain: Now we are going to learn another strategy for decoding\nthat they will be\nwords using base words and suffixes. focusing on base\nwords and suffixes\nhere and they will\nA base word is the part of a word that can stand by itself and the\nexamine prefixes in\nsuffix is the part that is added to the base word at the end.\nmore detail in a future\nclass.\n• Write the word “cats” on the board.\nIn the word “cats,” the “base word” is cat and the suffix is “s.”\n• Write the word “crying” on board and then write again with\nbase word and suffix separated in boxes as below.\nNote to Teacher\nFor example:\nTo avoid confusion,\nyou should select\nCRYING\nwords in which the\nfinal consonant is not\nCRY ING doubled as it is in\nrunning or stopped.\nIn the word “crying”, the base word is “cry” and the suffix is\n“ing.”\nUnderstanding What Reading Is All About 37 NCSALL Teaching Materials\n• Underline the base word “cat” and circle the suffix “s.”\nPoint out that suffixes change the meaning of the base word.\n• Write a list of words on the board and ask learners to\nvolunteer to come up and identify the base word and the\nsuffix in each word by underling the base word and circling\nthe suffix.\nspit s jump ing smash ed\nwild est kiss ing lump y\nfrank ly fast er long est\nhate ful kind ness\nNote to Teacher 5. Wrap up & reflect\nIt is sometimes helpful\nto have the learner • Review the three strategies for reading unfamiliar words\nwrite each strategy on\n(“sound tapping,” “word family,” and finding the base word\nan index card.\nand suffix).\n• Tap words out\n• Find the word\n• Pass out the “Strategies for Improving Reading Skills”\nfamily\n• Underline the handout that appears on the next page (full-size version can\nbase word and be found on page 42).\ncircle the suffix\nBefore reading,\n• Explain that this chart is a place to keep track of strategies\nlearners can lay out\nthat they have found useful. Ask learners to think about\ntheir cards to remind\nthem to use various which of the word analysis strategies was most useful and\nstrategies.\nidentify them by circling the strategy on their pie chart.\n• Explain that in future lessons, you will demonstrate the\nstrategies listed under fluency, vocabulary, and\ncomprehension.\n38 Understanding What Reading Is All About Teaching Materials NCSALL\nStrategies for Improving Reading Skills\nDECODING FLUENCY\nAnalyzing words and Reading with speed\nknowing b y sight and ease\n• Sound tapping • Repeated oral reading\n• Word families • Scooping\n• Using prefixes and suffixes __________________\n• Sight words\n______________________\nUnderstanding what you\nLearning meaning of words read\n• Use clues in the sentence • Previewing\n• Use words you already • Reflecting while you read\nknow • Post-reading questioning\n• Prefixes and suffixes • Imaging\n____________________ ______________________\nVOCABULARY COMPREHENSION\n(full-size photocopyable master can be found on p. 42)\nUnderstanding What Reading Is All About 39  Teaching Materials NCSALL\nHandout: Word Analysis Strategies\n“sound tapping” “word family”\nstrategy strategy\nash, cash, lash, splash ash, cash, lash, splash\nluck, truck, pluck luck, truck, pluck\ntank, sank, thank, spank tank, sank, thank, spank\nUnderstanding What Reading Is All About 41 NCSALL Teaching Materials\nHandout: Strategies for Improving Reading Skills\nDECODING FLUENCY\nAnalyzing words and\nknowing by sight Reading with speed and\nease\n• Sound tapping\n• Word families • Repeated oral reading\n• Using prefixes and • Scooping\nsuffixes\n_____________________\n• Sight words\n_____________________\n_____________________\n_____________________\n_____________________\n_____________________\nLearning meaning of Understanding what you\nwords read\n• Use clues in the • Previewing\nsentence • Reflecting while you\n• Use words you already read\nknow • Post-reading questioning\n• Prefixes and suffixes • Imaging\n_____________________ _____________________\n_____________________ _____________________\n_____________________ _____________________\nVOCABULARY COMPREHENSION\n42 Understanding What Reading Is All About LESSON SIX: READING WORDS BY SIGHT\nObjectives:\nLearners will be able to:\n(cid:57) Use a “sky writing” strategy for reading phonetically\nirregular words that can’t be sounded out.\nMaterials:\n• blackboard\n• scrap paper\nTime: 30 minutes\nSteps:\n1. Review decoding strategies Note to Teacher\nThis is a very short\n• Remind students of the three strategies they learned for lesson and you may\nwant to combine it\nanalyzing or decoding words.\nwith Lesson 5. If you\ndo, be sure to\n• Explain how to use “sky writing” for reading phonetically emphasize that this\nstrategy is for\nirregular words: Now I am going to teach you a strategy for\nremembering words\nremembering words you can’t sound out. (Give a few examples, that are difficult to\nsound out. Sky writing\nlike ”there,” “should.”) Many people who have studied reading\nis not a decoding\nhave done research on how people learn best. They have discovered\nstrategy.\nthat people learn best when they use all their senses. Senses are\nour ability to see, hear, touch, smell, and taste. By engaging three\nof the five senses – seeing, hearing, and touching – the “sky\nwriting” strategy helps us to remember how words “look.” We are\ngoing to use our ability to see, hear, and touch, and use our entire\nbody to help us remember these words that need to be memorized\nby sight.\nUnderstanding What Reading Is All About 43 NCSALL Teaching Materials\n2. Demonstrate “sky writing”\n• Review the following steps and model each step using a\nphonetically irregular word such as “they” or “sight.”\n⇒ Write a phonetically irregular word in large letters on the\nboard (e.g., right, two).\n⇒ Have learners trace the letters of the word in the air\nusing their entire arm. (Check to make sure learners keep\ntheir elbows straight.)\n⇒ Point out that they are using their whole body to\nremember the order of the letters in the word.\n⇒ Have learners say the name of each letter as they trace\neach letter in the air.\n⇒ Erase the word and have learners trace the word in the\nair again from memory, saying the name of each letter as\nthey trace it.\n⇒ Have learners “write” the word on the table with their\nfinger three times, repeating the name of each letter as\nthey write it.\n⇒ Have learners write the word three times on a piece of\nscrap paper, covering the word each time they write it\nand repeating the letter names as they write them.\nNote to Teacher 3. Wrap up & reflect\nYou may want to\nintroduce Fry’s 300 • Ask learners if they thought “sky writing” would help them\nInstant Sight Words\nremember words they cannot sound out. Why do they think\nlist at this point. Give\nit will help?\nlearners a copy and\nsuggest they use sky\nwriting for words on • If learners found this strategy helpful, they should circle it\nthe list that they do\non their strategies pie chart.\nnot recognize. This\nlist can be\ndownloaded from:\nwww.usu.edu\/teachall\n\/text\/reading\/frylist.pdf\n44 Understanding What Reading Is All About LESSON SEVEN: READING WITH FLUENCY\nObjectives:\nNote to Teacher\nLearners will be able to: Listening to a learner\nread out loud is a way\n(cid:57) Understand the role reading fluency plays in proficient that you can keep\ntrack of a learner’s\nreading.\nability to recognize\nwords with ease.\n(cid:57) Understand the importance of reading often as a way to\npromote fluency.\n(cid:57) Use the Wilson “scooping” strategy to increase reading\nfluency.\nMaterials:\n• blackboard or newsprint\n• selections of texts that the teacher can read aloud to model\nfluency\n• “Reading Fluency Practice” handouts (two versions on\npages 51 and 52)\nVocabulary:\n• accurately\n• automatic\n• fluently\nTime: 40 minutes\nSteps:\n1. Define “fluency”\n• Explain concept of “reading fluency”:\nEffortless reading depends on two things; first we must be able to\nread the words correctly or “accurately.” Otherwise we won’t be\nUnderstanding What Reading Is All About 45 NCSALL Teaching Materials\nable to understand what we are reading. Practicing analyzing\nwords, including decoding and blending, and learning words by\nsight helps improve one’s ability to read words accurately.\nWe must also be able to read smoothly or “fluently.” Otherwise\nwe’ll find it hard to understand what we are reading.\n• Encourage learners to think about the importance of reading\noften. Think back to when we were talking about learning to drive\nand how important it was to practice. Only by reading often will\nreading become effortless or “automatic.”\n• Explain that if learners are having trouble reading the words\non the page, they won’t have enough energy to think about\nwhat they are reading. Model this by reading (without\nshowing them) a passage aloud in a halting manner and\nasking learners to provide a summary of what you read.\nRead the following passage in a halting manner:\n“We know that … some … events cause other …\nevents to … happen. For example, sunlight …\ncauses plants to … grow. This is what we … call a\n… cause- … and-effect … relationship.”\nNote to Teacher\nTo be a good reader,\nit is important to get [Note: Presented below is the same passage, without\nmeaning from the text. ellipses to indicate pauses:]\nTell learners that you\n“We know that some events cause other events to happen.\nwill discuss\nFor example, sunlight causes plants to grow. This is what we\ncomprehension, or\ncall a cause-and-effect relationship.”\nmaking sense of what\nis read, and\nvocabulary, or\nunderstanding word • Ask learners: Was it difficult to understand what I was reading?\nmeanings, in future\nLet’s see how much easier it is to understand when I read the\nclasses. Help\nlearners to passage accurately and fluently.\nunderstand that even\nthough they can read • Reread the same passage modeling accurate, fluent reading.\nall the words, they\nThen ask learners to summarize what you read. Compare\ncannot understand the\nfull meaning of the the difference.\nsentence without\nknowing the meaning • Ask: Why is it important for reading to be automatic? Think\nof words. That is why\nback to what it was like when you were learning to drive and you\nit is important to learn\nnew vocabulary. still had to think about where all the parts of the car were located\n46 Understanding What Reading Is All About Teaching Materials NCSALL\nand how they worked. Did you have enough energy left to watch\nthe road, think about the best way to get to your destination, or\ntalk to your friend in the passenger seat?\n2. Demonstrate “repeated oral reading” strategy\n• Have learners use a strategy for increasing fluency called\n“repeated oral reading.”\n⇒ Put learners into pairs.\n⇒ Give each pair the appropriate short selection of text\ncontained in the “Reading Fluency Practice” handout\n(see below for samples; full-size masters of each version\ncan be found on pages 51 and 52).\n⇒ Learners take turns reading aloud to each other.\n⇒ Each learner reads the same selection twice, noting how\nmuch more fluently he or she reads the second time\naround.\nReading Fluency Practice\nTo the learner: Please read the following passage out loud to your partner.\nThen read it out loud over again. Notice how much more fluent you are the\nsecond time you read it.\nVersion A My daughter often asks me: “Mom, what is your favorite\nseason?” I find it hard to choose from spring, summer, and\nfall. I am always amazed at the changes spring brings and the\nhope I feel when I find first signs of life forcing their way\nthrough the snow. Though I love summer’s freedom, trips to\nthe ocean, and life’s slower pace during July and August, I am\nalways most grateful for the brisk and energetic days in\nOctober.\nVersion B\nLower Level My child often asks me: “Mom, what is your best time of the\nyear?” I like spring, summer, and fall the best. It is hard to\nchoose. I love spring when the flowers begin to grow. I like\nthe warm days of summer when I can go to the sea. I also\nlove fall, when the days are cool.\n(full-size photocopyable masters of each version can be found on pp. 51 & 52)\nUnderstanding What Reading Is All About 47 NCSALL Teaching Materials\n3. Demonstrate the “scooping” strategy\n• Introduce the Wilson “scooping” strategy for increasing\nreading fluency. Explain: Today we are going to learn a\nstrategy that will help you read more smoothly or “fluently.” We\nare going to learn how to “scoop” sentences into smaller chunks or\nphrases so that when we read, it sounds as smooth and natural as\nwhen we talk.\nLet’s think about what “scooping” means. What kinds of things do\nwe scoop? (Answer: ice cream, sugar, etc.) Scooping means\ngathering smaller pieces together. Let’s try it.\n• Write the following sentence on the board and ask a learner\nNote to Teacher\nto read the sentence aloud. Select a learner who will\nFeel free to make up\nappropriate sentences experience some difficulty reading this sentence fluently the\nfor your particular\nfirst time around.\nclass.\nThe man with the red hat is hot.\n• Model how to scoop the sentence into phrases, reading each\nphrase aloud as you scoop it.\nExplain: Start by putting your pencil under the first letter of the\nNote to Teacher first word. You drag your pencil under the first few words in the\nYou can also use the\nsentence making a semi circle under the phrase.\nsentence at right to\nexplore how words\ncan change meaning The man with the red hat is hot.\ndepending on context.\nFor example, how\nwould the word “hot”\n• Ask learners to read the sentence again the way it has been\ndiffer in meaning if\nfollowed by these “scooped” and note the difference in their fluency.\nsentences below?\nThe man with the • Show how the sentence can be “scooped” another way. You\nred hat is hot. He is\nshould read this sentence aloud first and have the learners\nsweating.\nread it after you.\nThe man with the\nread hat is hot. I’d\nThe man with the red hat is hot.\nlove to go out with\nhim.\n• Write the following sentences on the board and then scoop\nthem into phrases. Have learners volunteer to read each\n48 Understanding What Reading Is All About Teaching Materials NCSALL\nsentence aloud the way it has been “scooped.” As learners\ngain confidence, they can try “scooping” the sentences\nthemselves. It is fun to experiment with finding as many\nways as possible to “scoop” the same sentence.\n1) Sid and Meg met Ben at the shop.\n2) That tax on gas is not bad.\n3) The Red Sox had to win!\n4) Max got six fish with his rod.\n5) Did Ms. Lin get the bus at 10 am?\n4. Wrap up & reflect\n• Ask learners if they found the “scooping” strategy useful.\nLearners who felt it was helpful can circle it on their\nstrategies pie chart.\nUnderstanding What Reading Is All About 49  Teaching Materials NCSALL\nHandout: Reading Fluency Practice (Version A)\nTo the learner: Please read the following passage out loud to\nyour partner. Then read it over again. Notice how much more\nfluent you are the second time you read it.\nMy daughter often asks me: “Mom, what is your favorite\nseason?” I find it hard to choose from spring, summer,\nand fall. I am always amazed at the changes spring\nbrings and the hope I feel when I find the first signs of life\nforcing their way through the snow. Though I love\nsummer’s freedom, trips to the ocean, and life’s slower\npace during July and August, I am always most grateful\nfor the brisk and energetic days in October.\nUnderstanding What Reading Is All About 51 NCSALL Teaching Materials\nHandout: Reading Fluency Practice (Version B)\nTo the learner: Please read the following passage out loud\nto your partner. Then read it out loud over again. Notice\nhow much more fluent you are the second time you read it.\nMy child often asks me: “Mom, what is your best\ntime of the year?” I like spring, summer, and fall\nthe best. It is hard to choose. I love spring when\nthe flowers begin to grow. I like the warm days\nof summer when I can go to the sea. I also love\nfall, when the days are cool.\n52 Understanding What Reading Is All About LESSON EIGHT: DEVELOPING READING\nVOCABULARY\nObjectives:\nLearners will be able to:\n(cid:57) Understand the important role vocabulary plays in reading.\n(cid:57) Use the following strategies for learning new vocabulary.\n• Context clues to “guess” the meaning of an unfamiliar\nword.\n• Knowledge of known words.\n• Knowledge of prefixes.\nMaterials:\n• blackboard or newsprint\nVocabulary:\n• context clue\n• prefix\nTime: 1 hour and 15 minutes\nSteps:\n1. Introduce vocabulary as a reading skill Note to Teacher\nResearch shows that\n• Explain: There are still a few more reading skills we need to know 90% of new words are\nlearned in the context\nabout. Once we are able to read words and longer passages well\nof reading. That is\n(fluently), what do we have to be able to do in order to understand another reason why it\nwhat we read? (Know what the words mean.) This is called is so important for\nlearners to read\nvocabulary.\nfrequently and to read\nabout varied subject\nmatter.\nUnderstanding What Reading Is All About 53 NCSALL Teaching Materials\n⇒ Write the following sentence on the board (and read it\naloud):\nMy dad loves to slomp every day.\n⇒ Ask a learner to read the sentence aloud. Then ask: Does\nanyone know what the word slomp means?\n⇒ Help learners to understand that even though they can\n“read” (sound out) all the words, they cannot understand\nthe full meaning of the sentence without knowing the\nmeaning of the word slomp. That is why it is important\nto learn new vocabulary.\n2. Demonstrate “context clues” and “known words”\nstrategies to learn vocabulary\n• Ask: If you read a word and you don’t know what it means, how\ncan you figure out what the word means? Learners will\nprobably mention using the dictionary and\/or asking\nsomeone. Write these responses on the board and ask: What\nif we do not have a dictionary and no one is around to ask? Let’s\nexplore that.\n• Write the following sentence on the board and read it aloud.\nIt was hot and sticky. I was hungry and tired. I felt\nsmucky.\n• Ask: What do you think the word “smucky” means? What can\nhelp you to figure out the meaning of this word that you have\nnever seen before?\n• Use the following guided questioning to help learners\ndiscover the value of using context clues and thinking\nabout words they already know as strategies for\nunderstanding new words.\n⇒ Ask: What words in the sentence provide clues to the meaning\nof the word smucky? Are hot, sticky, tired, and hungry used\nto describe positive or negative feelings?\n54 Understanding What Reading Is All About Teaching Materials NCSALL\n⇒ Ask: What word do you know that sound like smucky?\n(Possible answer “yucky,” “mucky.”) Are these words\nused to describe positive or negative feelings?\n⇒ Explain: So, even though you don’t exactly know what\nsmucky means, you can make a guess by looking at the other\nwords in the sentence and by seeing how the new word is used.\nWhen we take an educated guess about what a new word\nmeans because of how it is used in the sentence, we are using\nthe “context clues” strategy. When we guess a new word’s\nmeaning by the way it is used with words we already know, we\nare using the “known words” strategy.\nNote to Teacher\n3. Explain prefixes\nThe following words\ncan be used with\n• Explain: There is another important strategy that can help you to more advanced\nlearners:\nfigure out the meaning of words. This strategy involves looking at\nletters that are added to the beginning of words. These word parts • prenuptial\n• premeditated\nare called “prefixes” and they change the meaning of the word.\nRemind learners how we used base words and suffixes to\nNote to Teacher\nfigure out how to say a word and how suffixes changed the\nExplain to learners\nmeaning of words. Now we will look at how prefixes help\nthat even though the\nus determine what a word means. meaning they guess\nmay not be exact, it\nwill probably be\n• Write the following list of words on the board and read\naccurate enough to\nthem aloud. Ask volunteers to come up and underline the help them move on\nwith their reading and\nbase word and circle the prefix in each word. Have learners\nnot get stuck on a\ndiscuss the meaning of the base word and reflect on how the\nnew word. If learners\nprefix “un” changes the meaning of the base word (“un” are not comfortable\nwith guessing using\nmeans “not”).\nthe strategies above,\nthey can use the \"list it\nun happy un do un kind and skip it\" strategy.\nLearners write an\nun well un wise unfamiliar word down\non a bookmark made\nfor this purpose. They\n• Write the following words on the board and read them\nstill try to predict the\naloud. meaning of the word,\nbut they can also list it\nreuse remake review on the bookmark and\nlook it up in a\nredo rewrite dictionary later. This\nallows learners to\nkeep reading.\nUnderstanding What Reading Is All About 55 NCSALL Teaching Materials\n• Ask: What do these words have in common? Any idea what the\nprefix “re” might mean?\nExplain that “re” means “again.” Have learners discuss the\nmeaning of each base word and consider how the meaning is\nchanged once the prefix is added. Use the following examples to\nexplore what the prefix “pre” means.\npreview pretest\nprepay\n4. Put it all together: Practice new strategies\n• Have learners practice the above mentioned vocabulary\nstrategies to figure out the possible meanings of the\nnonsense words in the following sentences written on the\nboard:\n⇒ Sam and Beth jaggled the ball to each other.\n⇒ We went to the shop to pick up some milk, eggs, and\nsups.\n⇒ Tam rode her zoop to the store.\n⇒ He was unzum about the job.\n5. Wrap up & reflect\n• Have learners refer to their strategies chart and review the\nNote to Teacher\nthree strategies for learning new vocabulary. They can do\nWhen learners are\ninvolved in a particular this by working in pairs and discussing the strategies or by\nclassroom activity, writing in a journal.\nyou can ask: What\nare we working on\n• Use clues in the sentence.\n(e.g., vocabulary,\nword analysis)? How\nis ______ helpful for • Think about other words in the sentence you already\nreading? This mini-\nknow.\nreflection exercise can\nhelp promote learners'\nawareness of reading • Find the prefix and the base word.\nstrategies.\n56 Understanding What Reading Is All About LESSON NINE: DEVELOPING READING\nCOMPREHENSION\nObjectives:\nLearners will be able to:\n(cid:57) Understand the important role comprehension plays in\nreading.\n(cid:57) Use the following strategies for understanding what they\nread:\n• “previewing” to understand the context for new\ninformation\n• “reflecting while reading”\n• “post-reading questioning” process to take in new\ninformation\n• making images to promote understanding\nMaterials:\n• “Previewing Strategy” handout (on page 65)\n• “Post-Reading Questioning Strategy” handout (on page 66)\n• text selection – Before this lesson, choose a short text with\npictures and captions or subtitles. The text should be at\nthe learners’ current reading level or slightly above,\npreferably on a topic that you know they are interested in.\n(If your learners have a great deal of variation in reading\nability, you may want to choose more than one selection.)\nMake copies for every learner.\nVocabulary:\n• imaging\nUnderstanding What Reading Is All About 57 NCSALL Teaching Materials\nTime: 60 minutes\nSteps:\n1. Review goals for reading\n• Ask: What is the purpose of reading the words on a page? Let’s\nNote to Teacher\nthink about why you want to read.\nIf you have not done\nthe Step 2 activity in\nLesson 3, this is a\nI like\/want to read So I can\ngood time to introduce\nit. If you have already\ndone this activity in\nLesson 3, you can\nreview it with learners.\nUse what they have\nalready filled out as a\nway to check their\nprogress and to plan\neven further. They\nmay want to modify • Encourage learners to jot down some things they read or\ntheir purposes for\nwould like to read better. Then ask them for the reasons\nreading as they go\nfrom lesson to lesson. they read these things. The discussion should show that\npeople read for different purposes: to get information, to\nrelax, to get directions for something, etc.\n• Ask if learners read things the same way. For example, do\nthey read the newspaper the same way they read a computer\nmanual?\n• Encourage learners to share their reading goals so they can\nsee that the goal goes beyond being able to read the words\non the page; the ultimate goal is to get information, be\nentertained, etc. (mention some of their own goals).\n2. Illustrate what comprehension is\n• Have learners participate in the following activity to\nillustrate “comprehension.” (Make sure that the passage\nbelow is written on the blackboard or newsprint.)\nThe zut went to the spud to get the nid for Gim\nand Dim. When he got back, Gim and Jim were\nzigging and did not want the nid from the zut.\n58 Understanding What Reading Is All About Teaching Materials NCSALL\nAsk learners to:\nNote to Teacher\n1. Read aloud the passage on the blackboard. It is essential that\nlearners be able to\nread 100% of the\n2. Provide an oral summary. (Learners should find that\nwords in this passage.\nbecause they do not understand the words, they cannot\nYou should feel free\nprovide a summary. This illustrates the need for to substitute\nnonsense words that\ncomprehension.)\nare familiar to your\nlearners or to write\nExplain that in the rest of this lesson they will learn and\nyour own paragraph.\npractice strategies that help with comprehension. Also, you can take the\nopportunity to have\nlearners speculate\n3. Demonstrate “previewing” strategy before reading about what they think\nthe nonsense words\n• Explain that it is important to look through a text before might mean in a\npassage like this.\nbeginning to read. “Previewing” or looking over the\nSome clues (for\npassage is helpful for two reasons: example, the “ing” in\n“zigging”) suggests\n⇒ It gives the reader an idea of what the passage will be that this is a verb.\nabout.\n⇒ It gives the reader a chance to think about what he\/she\nalready knows about the topic.\nNote to Teacher\n• Pass out the “Previewing Strategy” handout and the short Use the process at left\nto explain the\ntext selection described in the Materials list for this lesson.\n“previewing” strategy.\nExplain that these are things learners can do before they read Pass out the\n“Previewing Strategy”\nto help them understand what they read. Important note:\nhandout (full-size\nThe text selection must include a title and pictures with\nversion on page 65) to\ncaptions and subtitles. learners so they can\npractice with the piece\nof text. Very\nPreviewing Strategy beginning-level\nlearners may not be\nStep 1: Turn the title into questions.\ncomfortable writing\n•\nWhat their answers, so they\n• Why can use the handout\nas a way to talk out\n•\nWho\ntheir answers with\nStep 2: Look at the pictures or graphics. Summarize what you see. another learner, or\ntake it home to use\nStep 3: Read the captions. What do they tell you?\nwith another reader.\nStep 4: Think about what you already know about this topic. Write a little\nabout what you already know.\nStep 5: Think about what you would like to know about this topic.\n(full-size photocopyable master can be found on p. 65)\nUnderstanding What Reading Is All About 59 NCSALL Teaching Materials\n• Explain the “previewing” strategy.\nUse the passage you chose for the learners and go through\nthe steps of the “previewing” strategy together.\n1. Write the following words on the board or a sheet of\nnewsprint:\n• What\n• Why\n• Who\n2. Read: 1: Turn the title into questions.\nHave learners practice turning the title into a question using\nthe “signal words” that are written on the board. (Go\nthrough these questions with your learners.)\n• What…?\n• Why…?\n• Who…?\n3. Read: 2: Look at the pictures or graphics.\nEncourage learners to look at the pictures, to describe what\nthey see, and to predict what will be discussed in the\npassage.\n4. Read: 3: Read the captions.\nLearners briefly discuss what the captions tell them about\nwhat the text is about.\n5. Read: 4: Think about what you already know about this\ntopic. Learners discuss what they know about the\ntopic, while you record what they say on the left side\nof the blackboard. If there is disagreement, put a\nquestion mark by the statement. (You should write\neverything the learners say on the board, even if the\ninformation is incorrect. Faulty information will be\ncorrected later.)\n6. Read: 5: Think about what you would like to know about\nthis topic.\n60 Understanding What Reading Is All About Teaching Materials NCSALL\nLearners generate a list of questions while you record these\nquestions on the right-hand side of the blackboard. You\nmay want to add a couple of questions that you know will\nbe answered in the passage.\n4. Demonstrate “reflecting while reading” strategy Note to Teacher\nIt is helpful if you read\n• Post on newsprint the following strategies and review with the passage aloud\nbefore asking a\nthe learners:\nlearner to provide an\noral summary. This\nReflecting While Reading ensures that the\nlearner isn’t\nexpending all his or\nHighlight anything that surprises you while\nher energy on\nyou read.\ndecoding and can\nfocus on listening\nRespond to what you are reading by making comprehension.\nnotations in the margins such as: ?, !\nThink about the what, why, who questions.\nNote to Teacher\nResearch shows that\nreading comprehen-\nsion increases\nsignificantly when\n• Have learners read the passage either silently to themselves\nlearners are asked to\nor following along as you read aloud. Ask them to use these reflect on what they\nstrategies to mark their text as they read. are reading while they\nare reading.*\n• Learners can take turns providing oral summaries of each\n* Pressley, M. &\nparagraph.\nMcCormick, C. (1995).\nStrategies and\nMetacognitive Regulation of\nStrategies: Basic Theory\nand Research. In\nEducational Psychology for\nEducators, Researchers,\nand Policymakers. New\nYork: Harper Collins\nCollege Publishers.\nUnderstanding What Reading Is All About 61 NCSALL Teaching Materials\n5. Demonstrate “post-reading questioning” strategy\n• Pass out the “Post-Reading Questioning Strategy” handout.\nPost-Reading Questioning Strategy\nStep 1: Look at your previewing questions (who? why? what?) to see if\nyou can now answer them.\nStep 2: Look at what you said you already knew about the topic. What\nwould you now correct?\nStep 3: Answer the following:\n• What did you learn about ______?\n• What about the passage surprised you? Why?\n• What did you find most interesting about what we read?\n(full-size photocopyable master can be found on p. 66)\n1. Read: 1: Look at your previewing questions (who? why?\nwhat?) to see if you can now answer them.\n2. Read: 2: Look at what you said you already knew about\nthe topic. What would you now correct?\n3. Ask learners to discuss the following questions\n(responses can be in an oral discussion or in a writing\nassignment):\nRead: 3: Answer the following:\n• What did you learn about _______?\n• What about the passage surprised you? Why?\n• What did you find most interesting about what\nwe read?\n6. Demonstrate “imaging” strategy\n• Explain that “imaging” is like replaying an event in your\nmind to remember the details. Imaging while you read can\nhelp you understand and remember what you’ve read.\n• Model a process for creating images to promote reading\ncomprehension.\n62 Understanding What Reading Is All About Teaching Materials NCSALL\n(cid:131) Read the following short passage aloud. Explain\nthe meaning of any unfamiliar words and ask\nlearners to provide an oral summary of the\npassage. Write whatever the learners say\nverbatim on the board.\nIn the Puerto Rican rainforest, some frogs\ncommunicate with each other by thumping\ntheir feet. The vibrations from the thumping\ncan be heard five miles away!\n(cid:131) Explain that creating a picture of what one is\nreading makes it easier to understand what the\npassage is about.\n(cid:131) Reread the passage one sentence at a time and\nencourage learners to visualize what they hear by\nthinking about the following kinds of questions or\nstatements after each sentence:\n◦\nWhat does the forest look like? Would there be\npine trees in this forest? Why not?\n◦\nDescribe what you think the frogs look like.\nShow me how big the frogs are with your\nhands.\n◦\nWhat do you see that tells you that the\nvibrations are traveling five miles?\n(cid:131) Ask learners to provide another oral summary of\nthe passage and write exactly what the learners\nsay on the board.\n◦\nReread the two summaries and ask the learners\nto determine if the second summary is better\nthan the first.\n◦\nHave learners reflect on the usefulness of\nvisualization by responding to the following\nquestions:\nUnderstanding What Reading Is All About 63 NCSALL Teaching Materials\n⇒ Did you find it helpful to make pictures in your\nhead while I read the passage aloud? Why or\nwhy not?\n7. Wrap up & reflect\n• Review the different comprehension strategies.\nAsk learners to recall the different strategies and prompt them if\nthey don’t remember. Write on the board:\n⇒ Use the “previewing” strategy.\n⇒ Use the “post-reading questioning” strategy.\n⇒ Think about what you’re reading while you’re reading\nby asking what, why, who.\n⇒ Make pictures in your head while you read.\nAsk learners to reflect on which strategies they found most helpful.\nLearners circle these strategies on their pie chart.\n64 Understanding What Reading Is All About Teaching Materials NCSALL\nHandout: Previewing Strategy\nStep 1: Turn the title into questions.\n• What\n• Why\n• Who\nStep 2: Look at the pictures or graphics. Summarize\nwhat you see.\nStep 3: Read the captions. What do they tell you?\nStep 4: Think about what you already know about this\ntopic. Write a little about what you already know.\nStep 5: Think about what you would like to know about\nthis topic.\nUnderstanding What Reading Is All About 65 NCSALL Teaching Materials\nHandout: Post-Reading Questioning Strategy\nStep 1: Look at your previewing questions (who? why?\nwhat?) to see if you can now answer them.\nStep 2: Look at what you said you already knew about\nthe topic. What would you now correct?\nStep 3: Answer the following:\nWhat did you learn about ______?\n•\nWhat about the passage surprised you? Why?\n•\nWhat did you find most interesting about what we\n•\nread?\n66 Understanding What Reading Is All About LESSON TEN: DEVELOPING AN INDIVIDUAL\nREADING PROFILE\nObjectives:\nLearners will be able to:\n(cid:57) Analyze their strengths and needs in each component of\nreading.\n(cid:57) Become more aware of the specific skills they need to work\non to become proficient readers.\nMaterials:\n• new copy of “The Components (Parts) of Reading” pie chart\nfor each learner (full-size photocopyable master on page 31)\nTime: 60 minutes\nSteps:\n1. Reflect on reading skills\n• Guide learners to reflect on which of the four components\nare strengths and which skills are more difficult for them.\n• Encourage learners to help each other think of what they are\ngood at and to provide specific examples of strengths. It is\nextremely helpful if you model this process by pointing out\nthe specific strengths of a particular learner and providing\nspecific examples. For example, “I know ‘learning new\nvocabulary’ is a strength for you because you use colorful words\nwhen you write” or “I can tell that you are good at ‘understanding\nwhat you read’ because you are able to tell me about the story you\nare reading.”\nUnderstanding What Reading Is All About 67 NCSALL Teaching Materials\n• Divide the class in pairs and ask learners to take turns\nasking each other the following questions. (Write these\nquestions on the blackboard or a sheet of newsprint.)\n• Which of the four reading components – decoding,\nfluency, vocabulary, comprehension – are you\npretty good at?\n• How do you know that you are good at these?\n• Which are more difficult?\n• How do you know these are more difficult?\n• Give each learner a new blank copy of the handout “The\nNote to Teacher\nComponents (Parts) of Reading. Ask learners to mark the\nIt may be helpful for\nlearners to divide their skills in each quadrant of the “pie chart” handout with the\nnotebook into four\nfollowing symbols.\nsections that\ncorrespond to the four\ncomponents of\n+\nreading: Analyzing sign equals “Good”\nWords & Knowing\nWords by Sight,\nReading with Speed -\nsign equals “Needs Work” or “Is More\nand Ease, Learning\nMeaning of Words, Difficult”\nand Understanding\nWhat You Read.\n+\/-\nWhen you hand sign equals “OK”\nsomething out in\nclass, learners should\n• Encourage learners to share their responses with the full\nbe encouraged to\nfigure out under which group.\ncategory the paper\nshould be filed. In\n⇒ What surprised you?\naddition to making\nthem more aware of\n⇒ Did you discover that you have some strengths in reading?\nthe underlying skills\nthey are learning, they\nare also learning how ⇒ Was your partner able to help you recognize your strengths?\nto categorize.\n2. Wrap up & reflect\n• Ask: Why might it be helpful to think of reading as being made\nup of different skills? (Possible answers include: helps to\nknow all the different things I have to learn in order to\n68 Understanding What Reading Is All About Teaching Materials NCSALL\nimprove my reading, helps me understand why we do\nspecific things in class, etc.)\n• Ask: What did you learn about your own reading? (Did they\nlearn that they had some strengths that they hadn’t thought\nabout before?) Does learning to read feel less or more\noverwhelming now? Why?\nUnderstanding What Reading Is All About 69  LESSON ELEVEN: REVIEWING THE\nINDIVIDUAL READING PROFILE\nObjectives:\nLearners will be able to:\n(cid:57) Develop and refine their understanding of their reading\nstrengths and needs.\n(cid:57) Generate, in consultation with the teacher, a plan for\nreaching their reading goals.\nMaterials:\n• a new, blank copy of “The Components (Parts) of Reading”\npie chart handout identical to the one learners used in the\nprevious activity (full-size photocopyable master on\npage 31)\n• learner’s copy of “Strategies for Improving Reading Skills”\npie chart\n• pie chart completed by learner in previous lesson\nTime: 20-30 minutes for each learner\nSteps:\n1. Review reading strengths and needs\n• Convene an individual conference with each learner to\nreview his or her reading profile.\n• Review the pie chart\/reading profile the learner filled out\n(learner and teacher together). Ask the following questions:\n⇒ What do you think are your strengths in reading?\n⇒ How do you know these areas are strengths?\n⇒ What things do you feel that you need to work on?\nUnderstanding What Reading Is All About 71 NCSALL Teaching Materials\n⇒ How do you know that these are areas of need?\n2. Reflect and plan\n• Ask the learner the following questions:\n⇒ What kinds of things can we do in class that will help you\nimprove in these particular areas?\n⇒ Do you feel that you have a better understanding of your\nstrengths and needs in reading after doing this activity?\n⇒ Do you have any questions for me?\n• Review with the learner the strategies the learner feels are\nparticularly effective, especially in the areas of reading that\nhave been identified as being areas of need.\n• Using the blank chart to record ideas, plan with the learner\nadditional learning activities to build reading skills.\n72 Understanding What Reading Is All About Teaching Materials NCSALL\nLESSON TWELVE: UNDERSTANDING\nLEARNING DISABILITIES\nObjectives:\nStudents will be able to:\n(cid:57) Understand what it means to have a learning disability.\n(cid:57) Recognize that learning disabilities have no bearing on\nintelligence.\n(cid:57) Understand how they can get tested for a learning disability.\n(cid:57) Learn some strategies for successfully dealing with a\nlearning disability.\nMaterials:\n• blackboard\n• “What Is a Learning Disability?” quiz (on page 81)\n• “Tips for Success” handout (on page 82)\nNote to Teacher\nVocabulary\nFor people with\n• accommodations learning disabilities,\nsome tasks (reading,\n• learning disabilities writing, understand-\ning or doing math, for\nexample) are really\nTime: 60 minutes difficult. It is\nespecially frustrating\nfor people with\nSteps: learning difficulties\nbecause it seems to\nthem as if they are the\n1. Experience difficulty with a literacy task\nonly ones who are\nhaving trouble. Other\n• Give learners the experience of struggling with a task. people seem able to\neasily do what they\n(cid:57) Ask learners to hold their pencil in the hand they don’t find difficult. This\nmakes them feel less\nusually write with.\nintelligent.\nUnderstanding What Reading Is All About 73 NCSALL Teaching Materials\n(cid:57) Ask learners to write their name backwards (more\nadvanced learner can be required to write their names\nbackwards and upside down).\n(cid:57) Ask learners to hold up their work for the rest of their\nclassmates to see. How do they feel about their work?\nHow does that make them feel about themselves?\n(cid:57) Ask what you could have done to make this activity\neasier for them.\n2. Gauge what you know about learning disabilities\n• Find out how much the students already know or think\nabout learning disabilities. Ask: What do you already know\nabout “Learning Disabilities”?\n• Write what learners say verbatim on the board and refer\nback to their comments during the lesson, correcting\nmisconceptions as you go.\n• Give students the “What Is a Learning Disability?” quiz (see\nnext page; full-size master can be found on page 81). Tell\nlearners that the “quiz” is just for fun and will help you find\nout how much they already know about learning disabilities.\nRead each statement aloud. Have learners respond to each\nstatement by circling “yes” or “no” on their sheet. After\nthey fill it out, go over the answers with them.\n74 Understanding What Reading Is All About Teaching Materials NCSALL\nWhat Is a Learning Disability?\n1. A learning disability is the same as mental retardation.\nYes? No?\n2. A learning disability is something you are born with.\nYes? No?\n3. A learning disability is something that can be cured by taking medicine.\nYes? No?\n4. People with learning disabilities cannot get well-paid jobs.\nYes? No?\n5. Learning disabilities are inherited (passed down from one family member to\nanother).\nYes? No?\n6. The brains of people with learning disabilities work differently.\nYes? No?\n7. People with learning disabilities are protected against discrimination by the\nlaw.\nYes? No?\n(full-size photocopyable master can be found on p. 81)\nAnswers to “What Is a Learning Disability?” quiz\n1. A learning disability is the same as mental retardation.\nNote to Teacher\nNo. Learning disabilities are not the same as mental\nIn a recent survey,\nretardation. 80% of Americans\nthought that learning\nLearning disabilities have nothing to do with intelligence. Most disabilities and mental\nretardation were the\npeople with learning disabilities are of average or above\nsame thing! Discuss\naverage intelligence. Many famous, brilliant people had (or still\ncommon mispercep-\nhave) learning disabilities. (Einstein, the physicist who is tions about learning\ndisabilities with\nbelieved to be one of the smartest people who ever lived, was a\nstudents.\nvery poor reader and dropped out of school.) It is possible for\nIf, after they are\nsomeone with mental retardation also to have a learning diagnosed with LD,\ndisability, but usually people with learning disabilities have they choose to\ndisclose the presence\naverage or above average intelligence.\nof their disability to\nsomeone else, they\n2. A learning disability is something you are born with. will need to be\nprepared for how\nYes. Most people who have learning disabilities are born people might respond\nwith them. based on their own\nignorance.\nSome people, however, acquire a learning disability as the result\nof an accident. For example, someone can recover from a coma\nand no longer be able to read and\/or write.\nUnderstanding What Reading Is All About 75 NCSALL Teaching Materials\n3. A learning disability is something that can be cured by taking\nmedicine.\nNo. Taking medicine cannot cure a learning disability.\nUnfortunately, learning disabilities do not go away even with\nappropriate instruction. A person with a disability can,\nhowever, learn to work around their disability. The following\nanalogy is often helpful: Think of someone who has poor vision\nand needs to wear glasses. When they wear their glasses they\ncan see as well as anyone else. Their limited vision is not a\nproblem. The poor vision, however, has not gone away. As\nsoon as they take off the glasses, vision becomes problem.\n4. People with learning disabilities cannot get well-paid jobs.\nNo. People with learning disabilities can be as successful as\nanyone else.\nMany people with learning disabilities have very high-paying\njobs. (Add some examples here.) The key is learning how to\nwork around your disability. This is called “compensating.”\n5. Learning disabilities are inherited (passed down from one family\nmember to another).\nYes, usually. Learning disabilities often run in families.\nLearning disabilities are usually inherited just like eye color or\nheight.\n6. The brains of people with learning disabilities work differently.\nYes.\nWe are now able to take pictures of the brain while a person is\ndoing an activity like reading. These pictures show us that, in\nfact, the brains of people with learning disabilities do work\ndifferently. This means that sometimes it may take a little\nlonger for someone with a disability to do a particular task like\nread a word, remember someone’s name, or understand\ndirections given by a supervisor.\nRemember, however, that learning disabilities have nothing to\ndo with intelligence!\n76 Understanding What Reading Is All About Teaching Materials NCSALL\n7. People with learning disabilities are protected against discrimination\nby the law.\nYes. The Americans with Disabilities Act makes it illegal to\ntreat someone with a physical or a learning disability unfairly.\nAn employer cannot refuse to hire someone because he or she\nhas a learning disability, as long as he or she can perform the\n“essential function” of the job. And schools cannot refuse to\nprovide services to someone solely on the basis of a learning\ndisability.\nThe federal definition of learning disability (which applies to\nchildren and adults) says that, to be eligible for services and\naccommodations, a person must have a significant difference\nbetween what an intelligence test indicates he or she can do and\ntheir actual academic performance.\nA person with a learning disability is allowed to have certain\n“accommodations” (adjustments) in school and on the job.\nAccommodations include:\nNote to Teacher\nIn order to get these\n• extra time for tests or to complete job assignments\naccommodations,\nhowever, persons with\n• a private room for taking tests disabilities must have\na report (evaluation)\nfrom a doctor that\n• the use of a tape recorder\nsays that they have a\nlearning disability and\n• large print materials or note takers request specific\naccommodations.\n• job coaches (someone that helps them on the job)\n3. Define “learning disabilities”\n• Discuss the definition of “learning disability.” A “learning\ndisability” usually means that a person is experiencing\nsignificant difficulty with one or more learning skills. For\nexample, a learning disability may affect one’s ability to\nread, write, spell, understand what one reads, do math, pay\nattention, or establish relationships with other people.\n• Explain: Each of us is good at some things and struggles with\nother things. We all have strengths and weaknesses. (Present an\nexample from your own life.) Just because something is\nUnderstanding What Reading Is All About 77 NCSALL Teaching Materials\ndifficult for you, however, doesn’t mean you have a learning\ndisability. A difficulty becomes a ‘learning disability’ only when it\nmakes it extremely difficult for you to accomplish your goals or\nrealize your potential. If you are unable to accomplish your goals\n(e.g., get a better job, help your children with their homework, pass\nthe citizenship test or the GED) AND you have been to school, you\nmay have a learning disability.\n• Refer back to the statements on the quiz and elaborate on\neach point. Learners should be encouraged to ask questions\nat any time. If you do not know the answer, it is perfectly all\nright to say: I don’t know but I will try to find out. One good\nsource of information is the LINCS Literacy and Learning\nDisabilities Special Collection found at:\nhttp:\/\/ldlink.coe.utk.edu\n4. Explain testing for learning disabilities\n• Describe the process for being tested for a learning\ndisability.\nAsk: How do you know if you have a learning disability? Can\nyou take a test?\n• Explain: You can get tested for a learning disability by taking\ncertain tests. These tests measure your general intelligence level\nand measure your ability to do certain things like read, write, solve\nmathematical problems, or understand (comprehend) what you\nread. The doctor will also ask you questions about your past\nexperiences in school, about your health, and about your family.\nIn order for the doctor to decide that you have a learning disability,\nthere must be a gap between what you could do (your potential),\nwhich is measured by the intelligence tests, and how you are\ncurrently doing (what you have already achieved), which is\nmeasured by tests in reading, spelling, math, and other academic\nskill areas.\nIf you are diagnosed with a learning disability, you would be able\nto get the accommodations we talked about earlier.\nGetting tested for a learning disability can be very expensive\n(ranging from $300 to $1,500!). It is expensive because a doctor\n78 Understanding What Reading Is All About Teaching Materials NCSALL\nmust have special training to give the intelligence tests. It is a\ngood idea to see if your health insurance will cover the costs of the Note to Teacher\ntesting. Medicaid, which is the federal program that provides free You may want to list\nthe phone number of\nmedical care to people with low incomes, may cover the costs of LD\nsome testing\ntesting. (Note: In many states, Medicaid is known by a different specialists within your\nlearners’ community\nname. Ask your local social services agency or public hospital for\nas a way to help them\nmore information.)\ntake the first step.\nIf you want to get tested for a learning disability, call your local\nhospital and ask where you can go. They may ask for a referral\nfrom your regular doctor before they are willing to give you an\nappointment.\n5. Discuss strategies for success\n• Pass out “Tips for Success,” which appears below (full-size\nphotocopyable master can be found on page 82).\n• Explain each of the tips for success for students with\nlearning disabilities.\nTips for Success\n1. Learn as much as possible about your particular learning disabilities and your\nstrengths.\n2. Learn strategies to compensate (work around) your disability.\n3. Get formal documentation from a doctor that includes a diagnosis of a\nlearning disability and recommendations for accommodations.\n4. Ask your doctor to review the report with you and answer your questions.\n5. Talk to your teacher and\/or your employer about your disability and what kind\nof accommodations you will need. Remember that you are only entitled to\naccommodations if you have documentation of your learning disability.\n6. Focus on the things you are good at so that you are working from your areas\nof strength and don’t become discouraged.\n7. Be persistent. Don’t give up!!\nTake a look at http:\/\/www.schwablearning.org\/articles.asp?r=742. This is a link\nto one of several articles taken from Marshall Raskin’s longitudinal research on\n“Success Attributes” of adults with learning disabilities.\nThe materials found at http:\/\/ldlink.coe.utk.edu\/living_with_ld.htm\nare another good source on living with learning disabilities.\n(full-size photocopyable master can be found on p. 82)\nUnderstanding What Reading Is All About 79  Teaching Materials NCSALL\nHandout: What Is a Learning Disability?\n1. A learning disability is the same as mental retardation.\nYes? No?\n2. A learning disability is something you are born with.\nYes? No?\n3. A learning disability is something that can be cured by taking\nmedicine.\nYes? No?\n4. People with learning disabilities cannot get well-paid jobs.\nYes? No?\n5. Learning disabilities are inherited (passed down from one family\nmember to another).\nYes? No?\n6. The brains of people with learning disabilities work differently.\nYes? No?\n7. People with learning disabilities are protected against discrimination\nby the law.\nYes? No?\nUnderstanding What Reading Is All About 81 NCSALL Teaching Materials\nHandout: Tips for Success\n1. Learn as much as possible about your particular learning\ndisabilities and your strengths.\n2. Learn strategies to compensate (work around) your disability.\n3. Get formal documentation from a doctor that includes a diagnosis\nof a learning disability and recommendations for accommodations.\n4. Ask your doctor to review the report with you and answer your\nquestions.\n5. Talk to your teacher and\/or your employer about your disability and\nwhat kind of accommodations you will need. Remember that you\nare only entitled to accommodations if you have documentation of\nyour learning disability.\n6. Focus on the things you are good at so that you are working from\nyour areas of strength and don’t become discouraged.\n7. Be persistent. Don’t give up!!\nTake a look at http:\/\/www.schwablearning.org\/articles.asp?r=742. This\nis a link to one of several articles taken from Marshall Raskin’s\nlongitudinal research on “Success Attributes” of adults with learning\ndisabilities.\nThe materials found at http:\/\/ldlink.coe.utk.edu\/living_with_ld.htm\nare another good source on living with learning disabilities.\n82 Understanding What Reading Is All About LESSON THIRTEEN: IMPROVING YOUR\nSPELLING\n(OPTIONAL)\nObjectives:\nLearners will be able to:\n(cid:57) Understand the role spelling plays in reading.\n(cid:57) Discover strategies for spelling phonetically regular and\nphonetically irregular words.\nMaterials:\n• poker chips (two different colors)\n• blackboard or overhead projector\n• scrap paper\nTime: 60 minutes\nSteps\nNote to Teacher\nWhile spelling is not\n1. Discuss importance of spelling exactly a “reading skill,”\nit is an effective way to\n• Introduce spelling as a skill related to reading. reinforce both word\nanalysis and word\nExplain: Now let’s think about what we need to be able to do to recognition. Research\nconsistently indicates\nwrite words correctly. What do you need to be able to do if you\nthat fluent, skilled\nwant to write a letter to a friend or to a family member? (Answer:\nreaders (both children\nSpell) and adults) use their\nknowledge of spelling\npatterns when they read\n• Explain how different strategies are used to spell different\nand, conversely,\nkinds of words. Today we are going to learn some strategies for reading itself promotes\na memory of how words\nspelling. The first strategy that I am going to show you is a good\nare spelled.\none to use when spelling words that you can sound out. This\nstrategy will help you hear all the sounds in a word. Then I will\nshow you a strategy for memorizing the spellings for words that\nyou cannot sound out.\nUnderstanding What Reading Is All About 83 NCSALL Teaching Materials\n2. Demonstrate “poker chip” strategy\n• Explain that the “poker chip” strategy is for spelling\nphonetically regular words. Hand out five same-colored\npoker chips to each learner. These poker chips will\nrepresent the consonant sounds. Each learner also receives\none poker chip of a different color. This poker chip will\nrepresent the vowels. Learners should have a clear work\nspace to lay out their chips.\n• Explain: I am going to say a word and I want you to pull down\none (mention the color of the same-colored chips) chip for each\nsound you hear. The word is “zup.” How many sounds do you\nhear? There are three sounds so you should pull down three chips.\nNow I want you to find the vowel sound and replace the chip with\ndifferent-colored chip that will represent the vowel sound. (Make\nsure that learners replace the “consonant” chip with the\n“vowel” chip.) The total number of sounds (and chips) remains\nthe same. Now you are ready to spell the word. Write the letter\nthat corresponds to each chip and let me know when you are ready\nfor me to check your work.\n• Give learners an opportunity to practice using the “poker\nchip” strategy for spelling phonetically regular words.\nDictate the following words:\nstart slip smelt fond trust\n• Have learners use the chips to identify the sounds before\nthey assign letters to the sounds. The teacher should check\nthat learners identify the correct number of sounds with the\nchips before they are allowed to assign letters to the sounds.\n3. Demonstrate “sky writing” strategy\n• Introduce strategy for spelling phonetically irregular words.\nExplain: Now I am going to teach you a strategy for spelling the\n“sight words” that you can’t sound out. Research shows that\npeople learn best when they use more than one sense. Senses mean\nour ability to see, hear, touch, smell, and taste. By engaging three\n84 Understanding What Reading Is All About Teaching Materials NCSALL\nout of our five senses (seeing, hearing, and touching), the “sky\nwriting” strategy helps us to remember how words we cannot\nsound out “look.” In addition to our ability to see, hear, and\ntouch, we will use our entire body to help us remember the word.\n• Review the following steps and model each step using a\nphonetically irregular word such as “they.”\n⇒ Write the word in large letters on the blackboard.\n⇒ Have learners trace the letters of the word in the air\nusing their entire arm. (Check to make sure learners\nkeep their elbows straight.) Point out that they are using\ntheir whole body to remember the order of the letters in\nthe word.\n⇒ Have learners say the name of each letter as they trace\neach letter in the air.\n⇒ Erase the word and have learners trace the word in the\nair again from memory, calling out the name of each\nletter as they trace it.\n⇒ Have learners “write” the word on the table with their\nfinger three times, repeating the name of each letter as\nthey write it.\n⇒ Have learners write the word three times on a piece of\nscrap paper, covering the word each time they write it\nand repeating the letter names as they write them.\nUnderstanding What Reading Is All About 85 "}