{"text":"LANGUAGE VARIATION\nBy : Pooria Barzan & Behnam Heydari\nLanguage:\nLanguage is a way of communication. It is a tool for uniting people or dividing people. Language\nallows people to share. Language changes, dies and it is not passive.\nVarieties of language:\nThe term linguistic variation (or simply variation) refers to regional, social, or contextual\ndifferences in the ways that a particular language is used. Variation between languages,\ndialects, and speakers is known as interspeaker variation. Variation within the language of\na single speaker is called intraspeaker variation. All aspects of language (including\nphonemes, morphemes, syntactic structures, and meanings) are subject to variation.\nVariation in language use among speakers or groups of speakers is a notable criterion or\nchange that may occur in pronunciation (accent), word choice (lexicon), or even\npreferences for particular grammatical patterns. Variation is a principal concern in\nsociolinguistics. It has been discovered that variation is typically the vehicle of language\nchange.\"\n(R.L. Trask, Key Concepts in Language and Linguistics. Routledge, 1999\/2005)\nIn sociolinguistics a variety, also called a lect. It is a specific form of a language or language\ncluster. This may include languages, dialects, accents, registers, styles or other sociolinguistic\nvariation, as well as the standard variety itself.\nTypes of Variation\n\"Regional variation is only one of many possible types of differences among speakers of\nthe same language. For example, there are occupational dialects (the word bugs means\nsomething quite different to a computer programmer and an exterminator), sexual dialects\n(women are far more likely than men to call a new house adorable), and educational dialects\n(the more education people have, the less likely they are to use double negatives). There\nare dialects of age (teenagers have their own slang, and even the phonology of older\nspeakers is likely to differ from that of young speakers in the same geographical region)\nand dialects of social context (we do not talk the same way to our intimate friends as we\ndo to new acquaintances, to the paperboy, or to our employer). . . . regional dialects are\nonly one of many types of linguistic variation.\"\n(C. M. Millward and Mary Hayes, A Biography of the English Language, 3rd ed. Wadsworth, 2012) In the variation of language we study the following topics of language:\no Standard language\no National language\no Dialect\no Register\no Pidgin\no Creole\no Classical language\no Lingua Franca\no Diglossia\no Style\nThese can be explained as:\nStandard language:\nStandard language is a variety of language that is used by government, in the media, in schools\nand for international communications. There are different varieties of English in the world such as\nNorth American English, Australian English and Indian English. Although these varieties differ in\nterms of their pronunciation, there are few differences in grammar between them. In contrast there\nare non-standard forms of language that are used for example in different regional dialects and in\nthese non-standard varieties of language are different from each other. The only difference\nbetween standard and non-standard language is that we consider that language standard which is\nright according to our own value judgments.\n• Language creates a harmony among people, it diverse from person to person , area to area and\nfrom country to country.\n• Language changes after every ten miles.\n• Language is banner; it can combine or divide people.\n• Language and ideology are interrelated.\n• Standard language makes a country strong.\n• To make a standard language planning and policies are made.\n• These policies are made by elite class.\n• Language planning and language policies depend upon ideology.\n• Standardization is a historical process which is always in progress.\n• Standards are abstract norms to which actual usage more\/less conforms. • Standardization occurs in spelling, pronunciation, word-meaning, word-forms, sentence\nstructure conventions.\n• The ideology of standardization blinds us to fact that a 'standard language' is not really very\nwell-defined.\nNational language\/Official language:\nNational or official language: The official language of a country, recognized and adopted by its\ngovernment and spoken and written by majority of people in a country. National language may for\ninstance represent national identity of a nation or country. It brings people of a nation together and\ncreates a sense of brotherhood and patriotism\n• National language of Iran is Persian.\n• All the official work of the country is done in official language.\n• National language makes communication easy with in the country.\n• National language of a country is its identity.\n• The official language of a country, recognized and adopted by its government and spoken and\nwritten by majority of people in a country.\n• National language may for instance represent national identity of a nation or country.\n• It brings people of a nation together and creates a sense of brotherhood and patriotism.\nDialect:\n\"A dialect is variation in grammar and vocabulary in addition to sound variations. For\nexample, if one person utters the sentence 'John is a farmer' and another says the same thing\nexcept pronounces the word farmer as 'fahmuh,' then the difference is one of accent. But if\none person says something like 'You should not do that' and another says 'Ya hadn't oughta do\nthat,' then this is a dialect difference because the variation is greater. The extent of dialect\ndifferences is a continuum. Some dialects are extremely different and others less so.\"\n(Donald G. Ellis, From Language to Communication. Routledge, 1999)\nDialect is a complex concept, for linguists a dialect is the collection of attributes (phonetics,\nphonological, syntactic, morphological and semantic) that make one group of speakers noticeably\ndifferent from another group of speakers of the same language. So dialect is a variety related to\nuser. It involves differences in pronunciation, vocabulary and grammar. Dialect varies at four levels:\na. Regional level\nb.Minority level\nc. Social level\nd. Individual level\nRegional dialect: A regional dialect is not a distinct language but a variety of a language spoken\nin a particular area of a country. Some regional dialects have been given traditional names which\nmark them out as being significantly different from standard varieties spoken in the same place.\nThe regional dialects of English are British English, American English, Canadian English,\nAustralian English...etc.\nMinority dialect: Sometimes members of a particular minority ethnic group have their own\nvariety which they use as a marker of identity, usually alongside a standard variety. This is called\na minority dialect. Examples are African American Vernacular English in the USA, London\nJamaican in Britain, and Aboriginal English in Australia.\nSocial dialect: Sociolect or social dialect is associated with a particular class. A social dialect is\nspecifically used by a particular group of people living in a society.\nIndividual dialect: It is also known as idiolect. Idiolect is used by all individuals living in a\nsociety. All people of a country use this dialect in their speech. Every person has a different tone ,\naccent , pronunciations it is called `idiolect`.\nHutson (1994) says:\n“You are what you speak, how you speak it “\nRegisters:\n• Every native speaker is normally in command of several different language styles, called\nregister, which are varied according to the formality of the occasion and the medium used\n(speech, writing or sign).\n• Halliday, the father of register, defines it as:\n\"The relationship between language (and other semiotic forms) and the feature of the\ncontext.\" • Register is also used to indicate degrees of formality in language use.\n• This kind of variety is based on specialty of language use.\n• Registers are sets of vocabulary items associated with discrete occupational and social\ngroups e.g. surgeons, airline pilots, bank manager, lawyers etc. use different vocabularies.\n• A person's register can tell us about his profession.\n• A person may control a number of registers.\n• Registers are usually characterized solely by vocabulary differences; neither by the use of\nparticular words, or by the use of words in a particular sense.\nPidgin:\n• David crystal defines pidgin as:\n“A language with a markedly reduced grammatical structure, lexicon, and stylistic range,\nformed by two mutually unintelligible speech communities”\n• A pidgin is a new language which develops in situations where speakers of different languages\nneed to communicate but don't share a common language.\n• The vocabulary of a pidgin comes mainly from one particular language, called the 'lexifier'.\n• It is a language with no native speaker; it is no one's first language but it is a contact language.\n• It is restricted in use; it is a reduced variety of language.\n• Pidgin is an ‘odd mixture’ of two languages which cannot be said a divergent variety of ‘a\nlanguage’ but of two or more languages.\n• An early 'pre-pidgin' is quite restricted in use and variable in structure.\n• Here languages mixed up oddly that from morphemes to sentence structure everything reduces\nand mingles strangely.\n• Most of the present pidgins have developed in European colonies.\n• But the later 'stable pidgin' develops its own grammatical rules which are quite different from\nthose of the lexifier.\n• Once a stable pidgin has emerged, it is generally learned as a second language and used for\ncommunication among people who speak different languages.\n• Examples are Nigerian Pidgin and Chinese Pidgin English with only 700 words. Creole:\n• When two pidgin language speakers marry and their children start learning pidgin as their\nfirst language and it becomes the mother tongue of a community, it is called a creole.\n• Creole has its own grammatical rules. Unlike a pidgin, a creole is not restricted in use and\nis like any other language in its full range of function.\n• When children start learning a pidgin as their first language and it becomes the mother\ntongue of a community, it is called a creole.\n• Major difference between pidgin and Creole is that former has no native speakers but the\nlatter has.\n• In fact, when any pidgin is acquired by children of any community it becomes Creole.\n• At that time it develops its new structures and vocabulary.\n• In other words when a pidgin becomes ‘lingua franca’ it is called Creole.\n• Like a pidgin, a creole is a distinct language which has taken most of its vocabulary from\nanother language, the lexifier, but has its own unique grammatical rules.\n• Examples are Gullah, Jamaican Creole and Hawai`i Creole English.\n• Note that the words 'pidgin' and 'creole' are technical terms used by linguists, and not\nnecessarily by speakers of the language.\n• For example, speakers of Jamaican Creole call their language 'Patwa' (from patois) and\nspeakers of Hawai`i Creole English call theirs 'Pidgin.'\n• Creolization: the process of developing from a pidgin to a creole, in contrast to\ndecreolization.\n• Decreolization: the process whereby a creole is used with fewer distinct creole features as\nit becomes more like a standard variety. Classical language:\n• It is a language with a literature that is classical.\n• According to U.C Berkeley linguist George L.Hart, it should be ancient, it should be\nan independent tradition that arose mostly on its own, not as an offshoot of another\ntradition, and it must have a large and extremely rich body of ancient literature.\n• Some languages have classical form as well as they have everyday modern variety e.g.\nArabic language.\n• Greek and Latin are classical languages but not modern.\n• Some Latin vocabulary is used by medical and legal professions.\nLingua Franca:\n• It is defined as\n\"a language which is used habitually by people whose mother tongues are different in order to\nfacilitate communication between”.\n• It may refer to a trade language, a contact language, an international language.\n• It is a language which has developed in response to the need of the people, being using\ntwo different languages in everyday communication.\n• It is an auxiliary language e.g. Urdu in Pakistan and Swahili in East Africa.\n• English is world lingua franca followed by French.\n• Lingua fracas may be spoken in different ways.\n• They are not only spoken differently in different places, but individual speakers varied\nwidely in their ability to use language. Diglossia:\n• Furgoson has defined diglossia as,\n\"It is relatively a stable language situation in which, in addition to the primary dialect\nof the language there is a very divergent highly codified super posed variety”.\n• He identifies four language situations which show the major characteristic of the\ndiglossia; they are Arabic, Swiss, German, Haitian and Greek.\n• In each situation there is high language and low language.\n• Each variety has its own special function and each is viewed differently by those\nwho are aware of both.\n• Often one variety is literary or prestige dialect and the other is a common dialect\nspoken by most of the population.\nStyle:\n• The term style refers to a language variety that is divided based on speech or speak\nsituation into formal or informal styles.\n• One can speak very formally or very informally; our choice of style is governed by\ncircumstances.\n• The level of formality depends on number of factors:\na) the kind of occasion\nb) the various social, age and other differences that exist between the participants\nc) the particular task that is involved e.g. writing or speaking\nd) the emotional involvement of one or more of the participants Definition of terms:\nLinguistic geography:\nThe study of language variation based on where different varieties of the language are used\nIsogloss:\nA line on a map separating two areas I which a particular linguistic feature in significantly\ndifferent, used in the study of dialect.\nNorms:\nNon mobile, older, rural, male speakers, selected as informants in dialect surveys.\nDialect continuum:\nThe gradual merging of one regional variety of a language into another.\nBilingual:\nA term used to describe a native speaker of two languages or a country with two official languages,\nin contrast to monolingualism.\nLanguage planning:\nChoosing and developing an official language or languages for use in government and education.\nView publication stats "}