{"text":"4 | 1. THE VERB \"TO BE\" IN PRESENT\n1. THE VERB \"TO BE\" IN PRESENT\nLearning Outcomes\nAfter completing Chapter 1, students will know how to:\n• use the functions of the verb “To Be”.\n• form the verb “To Be” in affirmative statements, negative statements and questions.\n• apply the verb “To Be” in various situations.\nFunctions of “To Be”\nThe verb “to be” is used for:\n1. showing the existence of something.\n2. describing the condition of a noun.\nLet us discuss these points in detail. 1. THE VERB \"TO BE\" IN PRESENT | 5\nThe Existence of Something:\nThe existence of something can include nouns that are present. Some examples are:\n• I am at home.\n• He is in the living room.\n• They are at school.\n• She isn’t at work today.\n• We aren’t there yet.\n• Are you here?\n• Is the dog in the kitchen?\nThe Condition of a Noun:\nThe condition of a noun describes something. This includes an adjective after the ‘be’ verb.\nSome examples are:\n• I am hungry.\n• He is angry.\n• She is beautiful.\n• They aren’t sorry.\n• It isn’t pleasant out.\n• Are you happy?\n• Is she shy? 6 | 1. THE VERB \"TO BE\" IN PRESENT\nForm of the Verb “To Be”\nAffirmative Sentences: Subject + “be”\nSubject + “be” + happy.\nI am happy.\nHe is happy.\nShe is happy.\nIt is happy.\nYou are happy.\nWe are happy.\nThey are happy.\nNegative Sentences: Subject + “be + not\nSubject + “be”+ not\nI am not happy.\nHe is not* happy.\nShe is not happy.\nIt is not happy.\nYou are not** happy.\nWe are not happy.\n* is not = isn’t **are not = aren’t\nYes\/No Questions: “Be” + subject…?\n“Be” + subject + ? Short Answer\nAm I happy? Yes, you are.\/No, you aren’t.\nIs he happy? Yes, he is.\/No, he isn’t.\nAre you happy? Yes, we are.\/No, we aren’t. 1. THE VERB \"TO BE\" IN PRESENT | 7\nInformation Questions: Wh- + “be” + subject?\nWh- + “be” + subject …?\nWhere am I?\nWhy is he angry?\nWhen are they home?\nSimple Present “To Be” Functions Practice\nSimple Present “To Be” Functions Practice (Text Version)\nRead the sentence and decide the function of ‘to be’. Guess if the function is 1. the existence of\nsomething or 2. the condition of a noun.\n1. Her dress is gorgeous.\n2. There are many books in the library.\n3. The marathon runner is exhausted.\n4. There is a long line at the restaurant.\n5. His daughter is a surgeon.\n6. He is on the phone.\n7. They are in a meeting.\n8. She isn’t in her office at the moment.\n9. The dog is very hungry.\n10. He is on vacation.\n1\nCheck your answers\nActivity source: “Function Practice Simple Present ‘To Be'”, by Sari Martin, licensed under CC BY-\nNC SA 4.0. 8 | 1. THE VERB \"TO BE\" IN PRESENT\nPresent “To Be” Form Practice – Affirmative, Negative,\nInterrogative\nPresent “To Be” Form Practice (Text Version)\nFill in the blanks using the verb “to be” in present tense. Your sentence might be in affirmative,\nnegative or interrogative. Use contractions whenever possible.\n1. He ________ at home, at the moment, sorry. He ________ on vacation.\n2. ________ the cat hungry? I don’t think anyone fed her yet.\n3. The cat ________ hungry. I just fed her.\n4. Where ________ my glasses? I can’t remember where I put them.\n5. Many of the children in the school _______ sick right now. They all have terrible colds.\n6. ________ they at the restaurant already?\n7. Even though they worked a long day, they ________ tired at all right now.\n8. I ________ not at work today. I ________ at home instead.\n9. ________ you smart enough to get 100% on the exam?\n10. There _________ a great shoe sale at the shopping mall.\n11. She ________ very patient. She always loses her temper quickly.\n12. There _________ many songs to choose from on the list.\n2\nCheck your answer\nActivity source: “Present ‘To Be’ Form Practice”, by Sari Martin, licensed under CC BY-NC SA 4.0. 1. THE VERB \"TO BE\" IN PRESENT | 9\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• We are the Champions by Queen\n• You’re Beautiful by James Blunt\nCan you hear the verb “to be” in the lyrics?\n“The Verb “To Be’ Joke” by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Verb “To Be” in Present” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0.\nNotes\n1. 1. the condition of a noun 6. the existence of something\n2. the existence of something 7. the existence of something\n3. the condition of a noun 8. the existence of something\n4. the existence of something 9. the condition of a noun\n5. the existence of something 10. the existence of something\n2. 1. isn't\/is\n2. Is\n3. isn't\n4. are\n5. are\n6. Are\n7. aren't 10 | 1. THE VERB \"TO BE\" IN PRESENT\n8. 'm\/'m\n9. Are\n10. is\n11. isn't\n12. are 2. THE SIMPLE PRESENT TENSE | 11\n2. THE SIMPLE PRESENT TENSE\nLearning Outcomes\nAfter completing Chapter 2, students will know how to:\n• use the functions of the Simple Present Tense.\n• form the Simple Present Tense in affirmative statements, negative statements and\nquestions.\n• apply the Simple Present Tense in various situations.\n• use the correct spelling rules for 3rd person singular verbs in the Simple Present Tense.\nFunctions of The Simple Present Tense\nSimple present tense is used for\n1. general truths\n2. actions happening at the moment (stative verbs)\n3. routines, habits, and schedules\n4. future appointments or future schedules\nLet us discuss all these points in detail. 12 | 2. THE SIMPLE PRESENT TENSE\nGeneral Truths:\n“General Truths” by Virginia McHardy, licensed under CC BY 4.0.\nGeneral truths can include facts or something that exists and is always true. These\ncan be scientific facts, preferences, likes, dislikes, descriptions, or general states, for\ninstance. Some examples are:\n• I like pizza.\n• I don’t like coffee.\n• Erin works really hard.\n• The sun rises in the east.\n• That store doesn’t open early in the morning.\n• He has brown hair and brown eyes.\n• She owns a car.\nActions Happening at the Moment:\n“Actions happening at the moment” by Virginia McHardy, licensed under CC BY 4.0.\nWe usually use the Present Continuous Tense when we want to express actions happening at the\nmoment. However, some verbs cannot be put in a continuous tense, so they are called stative\nverbs. Stative verbs include verbs like feel, understand, have, etc. This is when we use The Simple\nPresent Tense. Some examples are:\n• I have a headache at the moment. 2. THE SIMPLE PRESENT TENSE | 13\n• I see my teacher at the water fountain.\n• He feels jealous.\n• I don’t understand this lesson.\n• She doesn’t appear happy right now.\nBelow are some examples of stative verbs:\n“Stative Verbs” by Annapurna Madhuri, licensed under CC BY-NC-SA 4.0.\nRoutines, Habits, and Schedules:\n“Routines, Habits and Schedules” by Virginia McHardy, licensed under CC BY 4.0.\nThe Simple Present Tense is used to express regular habits, routines, schedules, and repeated\nactions. Some examples are:\n• I take a shower every morning.\n• I turn off all the lights before I leave the house.\n• Samir plays basketball on Saturday afternoons.\n• We visit the dentist twice a year.\n• The class doesn’t meet on Wednesdays.\n• I don’t watch TV in the evening. 14 | 2. THE SIMPLE PRESENT TENSE\nWith this function, frequency adverbs can be used, including always, never, sometimes, usually,\noften, rarely, hardly ever, etc. These adverbs come before the main verb, or after the verb “to be”.\nSome examples are:\n• I usually wake up at 7am.\n• I don’t often have a cup of coffee in the afternoon.\n• They rarely visit us in the winter.\n• He is never late to class in the mornings.\nFuture Appointments or Schedules:\n“Future Appointments or Schedules” by Virginia McHardy, licensed under CC BY 4.0.\nWe sometimes use The Simple Present Tense for future appointments or meetings. This is\nespecially true for public transportation and formal appointments with a scheduled time. Some\nexamples are:\n• We have a test next Friday.\n• She sees the doctor in 2 days.\n• The bus leaves at 7am tomorrow.\n• The train leaves in one hour.\n**Time Markers Used with The Simple Present Tense\nSome common time markers used with The Simple Present Tense are:\n• every day\/night\/week\/month\/year\n• in the morning\/afternoon\/evening\n• once a day\/week\/month\/year\n• on Mondays\/Tuesdays\/Wednesdays etc… 2. THE SIMPLE PRESENT TENSE | 15\nForm of The Simple Present Tense\nLet us now explore how the Simple Present Tense is formed:\nAffirmative Sentences: Subject + base verb(s) .\nSubject + base verb (s) + every day.\nI swim every day.\nHe swims every day.\nShe swims every day.\nThey swim every day.\nNegative Sentences: Subject + do\/does+ not + base verb.\nSubject + do\/does+ not + base verb\nI do not (don’t) swim.\nHe does not (doesn’t) swim.\nYes\/No Questions: Do\/Does + subject + base verb?\nDo\/Does + subject+ base verb? Short Answer\nDo you swim? Yes, I do.\/ No, I don’t.\nDoes he swim? Yes, he does.\/ No, he doesn’t.\nInformation Questions: Wh ? + do\/does + subject + base verb?\nWh ? + do\/does+ subject + base verb? Answer\nWhere do you swim? I swim in my friend’s pool.\nWhen does he swim? He swims every Saturday. 16 | 2. THE SIMPLE PRESENT TENSE\n“Spelling Rules for Simple Present Tense” by Virginia McHardy, licensed under CC BY 4.0.\nWatch It!\nWatch the video: Forming the Present Simple tense in English (5 minutes)\nSimple Present Functions Practice\nRead each sentence and guess the function. Click ‘turn’ to see the answer.\nSimple Present Tense Functions (Text Versions)\nRead each simple present sentence and guess the function. The functions are: General truth\n(preference); General truth (fact); General truth (states); actions happening at the time of speaking\n(stative verbs); routines\/habits; and future schedules.\n1. She earns a lot of money.\n2. The bus leaves at 3:00pm.\n3. The moon revolves around the earth. 2. THE SIMPLE PRESENT TENSE | 17\n4. The baby drinks a glass of milk every morning.\n5. Neelu likes chocolate.\n6. Wood always floats on water.\n7. Lions hunt at night.\n8. She leaves for Mexico in two days.\n9. I have a really bad stomachache.\n10. I feel nervous.\n11. I own a car and a bicycle.\n12. He occasionally drinks coffee in the morning.\n13. Richard does not take care of his pets.\n14. The students do not have a test tomorrow.\n15. The flowers do not bloom until late spring.\n16. I play the piano.\n17. I do not like broccoli.\n18. He works out on the weekends mostly.\n19. I don’t understand what he’s saying.\n1\nCheck your Answers:\nActivity source: “Simple Present Tense Functions” by Sari Martin, licensed under CC BY-NC SA 4.0.\nSimple Present Form Practice – Affirmative\nSimple Present form quiz (Text version)\nFill in the given blanks with the correct form of verb listed below each question\n1. She ______ a lot of money.\na. earns\nb. earn\n2. Mona’s dress _____ beautiful. 18 | 2. THE SIMPLE PRESENT TENSE\na. to be\nb. is\n3. The bus _________ at 3.00 pm.\na. leave\nb. leaves\n4. The moon ____________ round the earth.\na. revolve\nb. revolves\n5. The baby ______ a glass of milk every morning.\na. drink\nb. drinks\n6. Aurora _______ chocolates.\na. like\nb. likes\n7. Wood always __________ on water.\na. float\nb. floats\n8. Lions ________ at night.\na. hunt\nb. hunts\n9. There ______ many books in the library.\na. is\nb. are\n10. She ______ for Mexico in two days .\na. leave\nb. leaves 2. THE SIMPLE PRESENT TENSE | 19\n2\nCheck your answers:\nActivity source: “Simple Present form quiz” by Annapurna Madhuri, edited by Sari Martin, from “2\nSimple present” In Effective English for Teachers by Annapurna Madhuri, licensed under CC BY-NC\nSA 4.0. \/ Converted to Text and some examples edited and added.\nSimple Present Tense Form Practice – Negative and\nInterrogative\nSimple Present Tense Functions (Text Version)\nFill in the blanks with the words in correct boxes using: do, does, do not :\n1. Neelu ______walk to school in the morning.\n2. _______Sheela paint?\n3. The students ________ have a test tomorrow.\n4. _______Mr. and Mrs. Murty work in the same school?\n5. _______ the woman work at the college?\n6. The boy _______does not study hard for his exams.\n7. The flowers ______ bloom until late spring.\n8. ______the play begin at 9 O’ clock?\n9. _____the children play in the park every evening?\n10. They ______earn a lot of money.\n11. Richard _____take care of his pets.\n3\nCheck your Answers:\nActivity source: “Simple Present – Negative and Interrogative form practice” by Annapurna\nMadhuri, edited by Sari Martin, from “2 Simple present” In Effective English for Teachers by\nAnnapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to Text and some examples\nedited. 20 | 2. THE SIMPLE PRESENT TENSE\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• You Belong with Me (Taylor’s Version) by Taylor Swift\n• Don’t Worry, Be Happy by Bobby McFerrin\nCan you hear the Simple Present Tense in the lyrics?\n“The Simple Present Tense Joke” by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Simple Present Tense” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0.\nNotes\n1. 1. general truth (fact) 7. general truth (fact)\n2. general truth (state or preference) 8. general truth (fact)\n3. future schedule 9. general truth (fact)\n4. general truth (fact) 10. future schedule\n5. routine\/habit 11. actions happening at the time of speaking (stative verbs)\n6. general truth (preference) 12. actions happening at the time of speaking (stative verbs) 2. THE SIMPLE PRESENT TENSE | 21\n13. general truth (state) 18. general truth (state)\n14. routine\/habit 19. general truth (preference)\n15. general truth (fact) 20. routine\/habit\n16. future schedule 21. actions happening at the time of speaking (stative verbs)\n17. general truth (fact)\n2. 1. She earns a lot of money. 6. Neelu linkes chocolates.\n2. Mona's dress is beautiful. 7. Wood always floats on water.\n3. The bus leaves at 3.00 pm. 8. Lions hunt at night.\n4. The moon revolves round the earth. 9. There are many books in the library.\n5. The baby drinks a glass of milk every morning. 10. She leaves for Mexico in two days.\n3. 1. Neelu does notwalk to school in the morning.\n2. Does Sheela paint?\n3. The students do not have a test tomorrow.\n4. Do Mr. and Mrs. Murty work in the same school?\n5. Does the woman work at the college?\n6. The boy does not study hard for his exams.\n7. The flowers do not bloom until late spring.\n8. Does the play begin at 9 O' clock?\n9. Do the children play in the park every evening?\n10. They do not earn a lot of money.\n11. Richard does not take care of his pets. 22 | 3. THE PRESENT CONTINUOUS TENSE\n3. THE PRESENT CONTINUOUS TENSE\nLearning Outcomes\nAfter completing Chapter 3, students will know how to:\n• use the functions of the Present Continuous Tense.\n• form the Present Continuous Tense in affirmative statements, negative statements and\nquestions.\n• apply the Present Continuous Tense in various situations.\n• use the correct spelling rules for 3rd person singular verbs in the Present Continuous Tense.\n• compare the Simple Present Tense with the Present Continuous Tense.\nFunctions of The Present Continuous Tense\nThe Present Continuous is used for:\n1. actions happening at the present moment.\n2. temporary actions continuing over a period of time.\n3. complaints\n4. informal personal plans for the future\nLet us discuss these points in detail. 3. THE PRESENT CONTINUOUS TENSE | 23\nActions Happening at the Present Moment:\n“Actions happening at the moment” by Virginia McHardy, licensed under CC BY 4.0.\nActions that are happening at the present moment are activities occurring at the time of speaking.\nSome examples are:\n• I am cleaning my house at the moment.\n• He is watching tv in the living room.\n• They are studying at school.\n• She isn’t helping at work today.\n• We aren’t listening to you.\n• Are you sitting here?\n• What are you doing right now?\nTemporary Actions Continuing over a Period of Time:\n“Temporary Actions Continuing over a Period of Time” by Virginia McHardy licensed under CC BY 4.0\nThese are temporary actions that continue over a period of time. The actions started in the past\nand are still happening in the current time. The actions will probably finish in the future but they\nare not finished yet. The action might not be happening at the moment of speaking. Some\nexamples are:\n• I am taking English classes.\n• He is building a new house.\n• She is writing a book. 24 | 3. THE PRESENT CONTINUOUS TENSE\n• Are you looking for a job?\nComplaints:\n“Complaints” by Virginia McHardy licensed under CC BY 4.0\nThis function is commonly used with the adverb “always” or “constantly” to describe ongoing\ndissatisfaction about a situation that happens repeatedly. Some examples are:\n• My teacher is always giving us homework.\n• My students are always coming late to class.\n• My son is always leaving his dirty socks on the floor.\nPlans for the Future:\n“Plans for the future” by Virginia McHardy licensed under CC BY 4.0\nThese actions are for personal plans and arrangements for the future. Some examples are:\n• I am playing tennis next Saturday.\n• Petro is having a party on the weekend.\n• Katie and Roman aren’t going on a honeymoon. They are saving for a house instead.\n• Are you travelling to Europe next summer? 3. THE PRESENT CONTINUOUS TENSE | 25\nTime Markers for The Present Continuous Tense\nSome common time markers for The Present Continuous Tense are:\n• right now\n• now\n• at the moment\nForm of The Present Continuous Tense\nLet us now explore how the Present Continuous Tense is formed:\nAffirmative sentences: Subject + “be” +verb + ing.\nSubject + + “be” + ing.\nI am cleaning.\nMohamed is studying.\nNebrass is smoking.\nThe Level 7 students are presenting.\nNegative Sentences: Subject + “be” + not+ verb + ing\nSubject + “be” + not + verb + ing.\nI am not studying.\nJanice is not* cooking.\nPete and Kim are not** dating.\nYou are not studying.\n*is not = isn’t **are not = aren’t 26 | 3. THE PRESENT CONTINUOUS TENSE\nYes\/No Questions: “Be” + subject + verb + ing?\n“Be” + subject + verb + ing? Short Answer\nAm I studying? Yes, you are.\/No, you aren’t.\nIs Ryan playing? Yes, he is.\/No, he isn’t.\nAre you cheating? Yes, I am.\/No, I’m not.\nInformation Questions: Wh ? + “be” + subject + verb + ing?\nWh ? + “be” + subject verb + ing Answer\nWhat am I doing? You are listening to a podcast.\nWhere is Jenne studying? She is studying at Georgian College.\nWhen are you leaving? I am leaving after lunch.\n“Spelling Rules for Continuous Tenses” by Virginia McHardy licensed under CC BY 4.0\nPresent Continuous Functions & Form Review\nWatch this interactive video to review the forms and functions of Present Continuous. Be ready to\npause and play the video, and complete the activities!\nPresent Continuous Functions & Examples (Text Version) 3. THE PRESENT CONTINUOUS TENSE | 27\nWatch the video The Present Continuous Tense (6:30 min)\n1. Pause at 0:15: What is the contraction of “I am” in the sentence “I am sleeping”? ______\n2. Pause at 0:18: What’s the contraction of “you are” in the sentence “You are sleeping”? _____\n3. Pause at 0:22: What is the contraction of “he is” in the sentence “He is sleeping”? ______\n4. Pause at 0:25: What is the contraction of “we are” in the sentence “We are sleeping”?\n______\n5. Pause at 0:30: For the negative, what is the contraction of “I am not” in the sentence “I am\nnot sleeping”? _____\n6. Pause at 0:33: What is the contraction of “you are not” in the sentence “You are not\nsleeping”? _______\n7. Pause at 0:39: What is the contraction of “she is not” in the sentence “She is not sleeping”?\n________\n8. Pause at 0:44: What is the contraction of “they are not” in the sentence “They are not\nsleeping”? _______\n9. Pause at 1:03: Put the following words and punctuation in the correct order to make a\nquestion:\n◦ house ◦ our\n◦ are ◦ to\n◦ coming ◦ ?\n◦ they\n__________________\n10. Pause at 1:13: Multiple choice question: Are you having fun?\na. Yes, I am.\nb. No, I’m not.\nc. Yes, I am having fun.\nPause at 1:34-1:38: Remember: these are actions that can be seen and they are happening\nnow. They are not stative verbs.\nPause at 2:05-2:12: Notice these actions are temporary and not permanent. They are happening\naround now, but have not finished yet and are expected to end.\n11. Pause at 4:27: Which sentences shows something you don’t like, or is irritating or annoying?\na. She is always sending long texts.\nb. She always sends long texts. 28 | 3. THE PRESENT CONTINUOUS TENSE\n12. Pause at 5:17: Which sentence shows something that happens a lot but I’m not angry about\nit?\na. He always talks in class.\nb. He is always talking in.\n13. Pause at 5:24: Put these words in order to make a complete accurate sentence:\n◦ at ◦ the\n◦ currently ◦ her\n◦ sleeping ◦ moment\n◦ in ◦ is\n◦ she ◦ room\n______________________________________\nThe summary below reviews what we’ve learned in the video:\nI can use the present continuous to show:\n• an action is happening right now at the time of speaking;\n• an action is happening in my life around the time of speaking, it is a longer action in progress,\nit is temporary, and the action hasn’t finished yet;\n• a future action that is planned and arranged;\n• and an action that happens repeatedly or all the time and it is annoying, irritating, and I don’t\nlike it.\n1\nCheck your answers\nActivity source: “Present Continuous Form and Function Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. Video Source: Smrt English. The Present Continuous Tense\n[Video]. YouTube. https:\/\/www.youtube.com\/watch?v=W1xJ4bk1pGc\nPresent Continuous Functions Practice\nPresent Continuous Functions (Text Version) 3. THE PRESENT CONTINUOUS TENSE | 29\nGuess the function of each present continuous sentence. The functions are: actions happening at\nthe present moment; temporary actions happening over time around now; complaints about\nrepeated actions; future plans.\n1. They are leaving for Thailand in 2 months.\n2. He’s always leaving dishes in the sink.\n3. A: Long time no see! What’s new? B: Well, I’m reading a great new book.\n4. I can’t talk on the phone right now. I’m studying for a test.\n5. It’s 6:00pm and I’m cooking dinner.\n6. I’m meeting with my friends for dinner tonight.\n7. She’s always losing her keys.\n8. The dog is always playing in mud.\n9. I’m working at a car dealership for my placement program this summer.\n10. I’m looking out the window and watching a squirrel feed her babies in the tree.\n11. Do you like what I’m wearing?\n12. Do you like my dress? I’m going on a date soon.\n2\nCheck your answers\nActivity source: “Present Continuous Functions” by Sari Martin, licensed under CC BY-NC SA 4.0.\nPresent Continuous Form Practice – Affirmative\nTry the interactive activity below to practice the form of Present Continuous. Fill in the blanks, and\nclick ‘Check’ to check your answers.\nPresent Continuous (Text version)\nFill in the missing words. Complete the following sentences using present continuous form of verbs\ngiven in the bracket, (formed by adding ‘ing’ to the base verb, along with a helping verb).\n1. Sunita ______ (go) to the movie with her mother.\n2. Sheela ______ (walk) to school this morning, 30 | 3. THE PRESENT CONTINUOUS TENSE\n3. The boys ______ (play) football in the park.\n4. Please turn off the TV. I ______ (do) my homework.\n5. My mother _______ (make) pizza today.\n6. Anita _______ (laugh) at the funny clown in the circus.\n7. Astrid _______ (eat) a sandwich for breakfast.\n8. All girls _______(wear) pink dresses today.\n9. Raj ______ (hide) something under the bed.\n10. Dunja _______(walk) towards the bus stop to board her school bus.\n3\nCheck your answers:\nActivity source: “Present Continuous” by Annapurna Madhuri, edited by Sari Martin, from “3 –\nSimple Present and Present Continuous” In Effective English for Teachers by Annapurna Madhuri,\nlicensed under CC BY-NC SA 4.0. \/ Activity title, names and instructions changed, converted to text.\nPresent Continuous Form Practice – Negative\nRewrite in negative form (Text Version)\nRewrite in negative form:\nEg. The children are watching TV now.\nAnswer: The child is not watching TV now.\n1. Jay is having breakfast now. __________\n2. Stefan is answering the call at the moment. __________\n3. I am helping Melodie with her work today.__________\n4. The boys are washing dishes.__________\n5. The student is sleeping in the class.__________\n6. It is raining heavily now.__________\n7. The students are writing an essay. __________\n8. You are doing this exercise correctly.__________\n9. The dog is drinking milk.__________ 3. THE PRESENT CONTINUOUS TENSE | 31\n4\nCheck your answers:\nActivity source: “Rewrite in negative form” by Annapurna Madhuri, edited by Sari Martin, from “3\n-Simple Present and Present Continuous” In Effective English for Teachers by Annapurna Madhuri,\nlicensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits.\nPresent Continuous Form Practice – Interrogative\nPresent Continuous Interrogative Form (Text version)\nRewrite the sentences in interrogative form.\nEg. The children are watching TV now.\nAnswer: Are the children watching TV now?\n1. Jay is having breakfast now. __________\n2. Stefan is answering the call at the moment. __________\n3. I am helping Melodie with her work today.__________\n4. The boys are washing dishes.__________\n5. The student is sleeping in the class.__________\n6. It is raining heavily now.__________\n7. The students are writing an essay. __________\n8. You are doing this exercise correctly.__________\n9. The dog is drinking milk.__________\n5\nCheck your answers:\nActivity source: “Present Continuous Interrogative Form” by Annapurna Madhuri, edited by Sari\nMartin, from “3 – Simple Present and Present Continuous” In Effective English for Teachers by\nAnnapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits. 32 | 3. THE PRESENT CONTINUOUS TENSE\nFocus on Time Markers\nWe now know that present continuous tense is used to describe actions in the situations discussed\nin the picture below.\nTime Markers or Signal words for present continuous tense:\n• Actions happening at the time of speaking:\n◦ at the moment, now, just now. right now, listen.., look..\n• Actions going on now:\n◦ at the moment, now\n• Actions depicting current trend\/taking place for a given time period\/temporary situation:\n◦ this week\/this month\/this year\n• Actions planned in the near future:\n◦ in the morning\/afternoon\/evening, at noon\/night, tonight, tomorrow, next week\/\nmonth\/year\/session\nPresent Continuous Signal Words and Form Practice (Text version)\nUse the suitable form of verbs given in the brackets, to complete the sentences, taking hints from\nsignal words:\n1. My brother, Ivan, _______ (stay) in California at present.\n2. Mr. Kim _________ (watch) IPL on TV at the moment\n3. For the time being, Maria ______ (work) as a principal.\n4. Listen! Somebody _______ (play) rock music on the street.\n5. Look at that man! He ________ (wear) a uniform. He must be a police officer.\n6. Right now, I *____________* (sit) at my desk in class.\n7. They ______ (watch) TV now.\n6\nCheck your answers: 3. THE PRESENT CONTINUOUS TENSE | 33\nActivity source: “Present Continuous Signal Words and Form Practice” by Annapurna Madhuri,\nedited by Sari Martin, from “3 – Simple Present and Present Continuous” In Effective English for\nTeachers by Annapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to Text and minor\nedits.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• Tom’s Diner by Suzanne Vega\n• Lemon Tree by Fool’s Garden\nCan you hear the Present Continuous Tense in the lyrics?\n“The Present Continuous Tense Joke” by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Present Continuous Tense” by Sari Martin & Virginia McHardy is\nlicensed under CC BY-NC-SA 4.0.\nNotes\n1. 1. I'm sleeping\n2. You're sleeping.\n3. He's sleeping. 34 | 3. THE PRESENT CONTINUOUS TENSE\n4. We're sleeping.\n5. I'm not sleeping.\n6. You aren't sleeping.\n7. She isn't sleeping.\n8. They aren't sleeping.\n9. Are they coming to our house?\n10. a) Yes, I am.\n11. a) She is always sending long texts.\n12. a) He always talks in class.\n13. She is currently sleeping in her room at the moment.\n2. 1. future plans 7. a complaint about a repeated action\n2. a complaint about a repeated action 8. a complaint about a repeated action\n3. a temporary action happening over time around now 9. a temporary action happening over time around now\n4. an action happening at the moment 10. an action happening at the moment\n5. an action happening at the moment 11. an action happening at the moment\n6. future plans 12. future plans\n3. 1. is going 6. is laughing\n2. is walking 7. is eating\n3. are playing 8. are wearing\n4. am doing 9. is hiding\n5. is making 10. is walking\n4. 1. Jay is not having breakfast now.\n2. Stefan is not answering the call at the moment.\n3. I am not helping Melodie with her work today.\n4. The boys are not washing the dishes.\n5. The student is not sleeping in the class.\n6. It is not raining heavily now.\n7. The students are not writing an essay.\n8. You are not doing the exercise correctly.\n9. The dog is not drinking milk.\n5. 1. Is Jay having breakfast now?\n2. Is Stefan answering the call at the moment?\n3. Am I helping Melodie with her work today?\n4. Are the boys washing dishes?\n5. Is the student sleeping in the class?\n6. Is it raining heavily now?\n7. Are the students writing an essay?\n8. Are you doing the exercise correctly?\n9. Is the dog drinking milk?\n6. 1. is staying 3. is working\n2. is watching 4. is playing 3. THE PRESENT CONTINUOUS TENSE | 35\n5. is wearing 7. are watching\n6. am sitting 36 | 4. THE SIMPLE FUTURE TENSE\n4. THE SIMPLE FUTURE TENSE\nLearning Outcomes\nAfter completing Chapter 4, students will know how to:\n• use the functions of the Simple Future Tense.\n• form the Simple Future Tense in affirmative statements, negative statements and questions.\n• apply the Simple Future Tense in various situations.\nFunctions of the Simple Future Tense\nThe Simple Future Tenses is used for:\n1. Predictions\n2. Promises\n3. Offers\/Refusals\n4. Requests\n5. Quick Decisions\n6. Future expectations\nLet us discuss these points in detail. 4. THE SIMPLE FUTURE TENSE | 37\nPredictions\nActions that you think are going to happen in the future. Some examples are:\n• It will rain tonight.\n• They will have a lot of children.\n• The population will grow in 5 years.\n• We won’t finish the project on time.\nPromises\nActions that are an agreement or commitment for the future. Some examples are:\n• I will love you forever.\n• My parents will pay for my tuition next year.\n• The company will hire him after graduation.\n• We won’t hurt you.\nOffers\/Refusals\n• I will help you with your homework.\n• My husband will drive the kids to school.\n• Will you marry me?\n**If the answer to the offer is “no”, then it is considered a refusal. For example: No, I won’t marry\nyou.\n• I won’t help him ever again.\n• They won’t give him a chance.\nRequests\nActions that are asking someone to do something. Some examples are:\n• Will you open the window, please?\n• Will they sign the contract on time? 38 | 4. THE SIMPLE FUTURE TENSE\nQuick Decisions\nChoices that are made at the moment of speaking. Some examples are:\n• Do you want tea, or coffee? I will have tea, please.\n• I will take the backroads home today because of the busy traffic.\nFuture Expectations\n**Time Markers Used with The Simple Future Tense\nSome common time markers used with The Simple Future Tense are:\n• tomorrow\n• the day after tomorrow\n• next week\/month\/year\n• in a couple of days\n• in # days\/weeks\/months\/years\n• on Monday\/Tuesday\/Wednesday etc…\nForms of the Simple Future Tense\nLet us now explore how the Simple Future Tense is formed:\nAffirmative Sentences Table: Subject + will + base verb\nSubject + will + base verb\nI will help.\nHe will wash the dishes.\nThey will study. 4. THE SIMPLE FUTURE TENSE | 39\nNegative Sentences Table: Subject + will + not + base verb\nSubject + will +not* + base verb\nI will not help.\nHe will not wash the dishes\nThey will not study.\n* will not = won’t\nYes\/No Questions: Will + subject + base verb?\nWill+ subject + base verb? Short Answer\nWill you help? Yes, I will.\/No, I won’t.\nWill they stay? Yes, they will.\/No, they won’t.\nWh-Questions: Wh- + will + subject + base verb?\nWh + will + subject +base verb? Long Answer\nWhy will you help? I will help because I am nice.\nWhere will she go? She will go to her sister’s house.\nWatch It!\nWatch the short video below to review the functions of ‘will’ and some more examples.\nWatch the video Future Simple Tense – WILL – A Future Simple Tense Story (1 min)\nSimple Future with ‘Will’ Functions Practice\nSimple Future with will (Text version) 40 | 4. THE SIMPLE FUTURE TENSE\nGuess which function of ‘will’ (prediction, promise, offer, a quick decision, an expected future\naction) the sentence represents. Turn the card around for the answer!\n1. Father: “You can’t go out with your friends. You haven’t done your homework yet.\n“Daughter: “OK, dad. I’ll do it before I go.”\n2. She will be here soon.\n3. Fernando Alonso will win the next Formula 1 race.\n4. Miko: “It’s really hot in here. ” Lee: “I’ll open a window for you.”\n5. Server: “What would you like to drink?” Customer: “I’ll have an espresso.”\n6. I’ll be very busy for the next few weeks.\n7. Shop Clerk: “So which sweater do you prefer?”. Customer: “I’ll take the blue one.”\n8. Those bags look heavy. I’ll carry them for you.\n9. Dad will be upset when he finds out you didn’t do the dishes.\n10. Taylor: “Will you marry me?”. Brook: “Yes! I will marry you!”\n11. I heard you need help painting your kitchen. I’ll help you. I’m good at painting.\n12. The president will visit our company location next week.\n13. It won’t be sunny this weekend.\n14. She probably won’t pass the course because she hasn’t studied enough.\n15. Son: “I don’t feel so good. I have a stomachache.” Mother: “I’ll get you some medicine.”\n16. I’m a bit bored. I think I’ll watch a movie on Netflix.\n1\nCheck your Answers:\nActivity source: “Simple Future with ‘Will'” by Sari Martin, licensed under CC BY-NC SA 4.0.\nSimple Future with ‘Will’ Form Practice – Affirmative\nSimple future (Text version)\nFill in the blanks using simple future form of the verb given in the bracket.\nTomorrow, students ________ (assemble) in the school playground at 08:00 am, to go to Heritage\nVillage. They _______ (have) their school picnic. The bus ________ (arrive) at 08:30 am, sharp.\nWe ____________ (reach) the Heritage Village at around 10:30 am. On reaching, students 4. THE SIMPLE FUTURE TENSE | 41\n____________ (go) around to see various displays. The staff at the spot _________ (welcome)\nthe students with flowers and sented perfumes. They ____________(offer) the students snacks.\nAfter they eat their snacks, children _______- (play) in the park. Around 01:00 pm, all\nstudents_________ (assemble) for lunch. They __________ (sit) in a circle and _________ (sing)\nsongs. At around 04:00 pm, students __________(gather) near the bus. They ________ (board)\nthe bus in a queue. At around 06:00 pm, they ________ (reach) school. Their parents\n___________ (pick) them up from the school.\n2\nCheck your Answers:\nActivity source: “Simple future” by Annapurna Madhuri from “8 Future Simple” In Effective\nEnglish for Teachers by Annapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text.\nSimple Future with ‘Will’ Form Practice – Negative\nSimple Future – Negative (Text version)\nRewrite the given sentences in negative form.\nExample: He will come here tomorrow.\nHe will not come tomorrow\n1. It is going to rain.\n2. Ram will buy a car next month.\n3. I will give Jyothi a nice gift on her birthday.\n4. She will take the exam at the end of the month.\n5. Sam will come to office tomorrow\n6. They are going to win the match.\n7. They will shift to a new home next week.\n8. Lakshmi will wait for me.\n9. We will know the results in a few days.\n10. The bus is about to leave.\n3\nCheck your Answers: 42 | 4. THE SIMPLE FUTURE TENSE\nActivity source: “Simple Present- Negative” by Annapurna Madhuri, edited by oeratgc, from “8\nFuture Simple” In Effective English for Teachers by Annapurna Madhuri, licensed under CC BY-NC\nSA 4.0. \/ Converted to text and minor accessibility edits.\nSimple Future with ‘Will’ Form Practice – Interrogative\nSimple Future – Interrogative (Text version)\nRewrite the given sentences in interrogative form i.e. yes\/no questions.\nExample: He will come here tomorrow.\nWill he come here tomorrow?\n1. India will win the match\n2. Ram will buy a car next month\n3. I will give Jyothi a nice gift on her birthday.\n4. She will take the exam at the end of the month.\n5. Sam will come to office tomorrow\n6. They are going to win the match.\n7. They will shift to a new home next week.\n8. Lakshmi will wait for me.\n9. We will know the results in a few days.\n10. The bus is about to leave.\n4\nCheck your Answers:\nActivity source: “Simple Future – interrogative” by Annapurna Madhuri, from “8 Future Simple” In\nEffective English for Teachers by Annapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted\nto text. 4. THE SIMPLE FUTURE TENSE | 43\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• I Will Remember You by Sarah McLaughlin\n• My Heart Will Go On by Celine Dion\nCan you hear the Simple Future Tense in the lyrics?\nThe Simple Future Tense Joke by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Simple Future Tense” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0.\nNotes\n1. 1. promise (if you said a spontaneous, quick decision, that's OK too!).\n2. an expected action\n3. prediction.\n4. Offer (but if you said spontaneous, quick decision, that's OK too!)\n5. A spontaneous\/quick decision\n6. an expected action\n7. A spontaneous\/quick decision\n8. offer (if you said spontaneous, quick decision, that's OK too).\n9. prediction\n10. promise\n11. offer\n12. an expected action\n13. prediction 44 | 4. THE SIMPLE FUTURE TENSE\n14. prediction\n15. Offer (if you said a spontaneous, quick decision, that's OK too!)\n16. a spontaneous, quick decision\n2. Tomorrow, students *will assemble* (assemble) in the school playground at 08:00 am, to go to Heritage Village. They\n*will have* (have) their school picnic. The bus *will arrive* (arrive) at 08:30 am, sharp. We *will reach* (reach) the\nHeritage Village at around 10:30 am. On reaching, students *will go* (go) around to see various displays. The staff at\nthe spot *will welcome* (welcome) the students with flowers and sented perfumes. They *will offer* (offer) the\nstudents snacks. After they eat their snacks, children *will play* (play) in the park. Around 01:00 pm, all students *will\nassemble* (assemble) for lunch. They *will sit* (sit) in a circle and *will sing* (sing) songs. At around 04:00 pm,\nstudents *will gather* (gather) near the bus. They *will board* (board) the bus in a queue. At around 06:00 pm, they\n*will reach* (reach) school. Their parents *will pick* (pick) them up from the school.\n3. 1. It is not going to rain.\n2. Ram will not buy a car next month.\n3. I will not give Jyothi a nice gift on her birthday\n4. She will not take the exam at the end of the month.\n5. Sam will not come to office tomorrow.\n6. They are not going to win the match\n7. They will not shift to a new home next week.\n8. Lakshmi will not wait for me.\n9. We will not know the results in a few days.\n10. The bus is not about to leave.\n4. 1. Will India win the match?\n2. Will Ram buy a car next month?\n3. Will I give Jyothi a nice gift on her birthday?\n4. Will she take the exam at the end of the month?\n5. Will Sam come to office tomorrow?\n6. Are they going to win the match?\n7. Will they shift to a new home next week?\n8. Will Lakshmi wait for me?\n9. Will we know the results in a few days?\n10. Is the bus about to leave? 5. THE FUTURE - \"BE GOING TO\" | 45\n5. THE FUTURE - \"BE GOING TO\"\nLearning Outcomes\nAfter completing Chapter 5, students will know how to:\n• use the functions of the Future “Be Going to”..\n• form the Future “Be Going to” in affirmative statements, negative statements and questions.\n• apply the Future “Be Going to” in various situations.\n• understand the pronunciation of “going to” in oral communication.\nFunctions of the Future “Be Going to”\nThe Future “Be Going to” is used for\n1. predictions\n2. plans\nLet us discuss these points in detail.\nPredictions:\nActions that you think are going to happen in the future. Some examples are: 46 | 5. THE FUTURE - \"BE GOING TO\"\n• It is going to rain tonight.\n• They are going to have a lot of children.\n• The population is going to grow in 5 years.\n• We aren’t going to finish the project on time.\nPlans:\n• I am going to clean the living room after breakfast.\n• He is going to travel after college.\n• They aren’t going to bake a cake for my birthday. They are going to buy one instead.\n**Pronunciation of “Going to”\nIn speaking only, the words “going to” are often reduced to “gonna”. However, “gonna” is not an\nactual word and should never be written in formal English.\nIf a speaker uses “gonna” in a sentence, only the base verb will follow, not “to”.\nFor example:\n“I’m gonna meet Peter at the bar tonight” not, “I’m gonna to meet Peter at the bar tonight.”\nForm of The Future “Be Going to”\nLet us now explore how the Future “Be Going to” is formed: 5. THE FUTURE - \"BE GOING TO\" | 47\nAffirmative Sentences: Subject + be + going to + base verb .\nSubject + “be” + going to + base verb.\nI am going to eat.\nHe is going to cook.\nShe is going to swim.\nThey are going to leave.\nNegative Sentences: Subject + do\/does+ not + base verb.\nSubject + “be” + not + going to + base verb\nI am not going to swim.\nHe is not going to dance.\nYes\/No Questions: “Be” + subject +going to + base verb?\n“Be” + subject+ going to + base verb?\nAre you going to teach?\nIs he going to listen?\nInformation Questions: Wh ? + “be” + subject + going to + base verb?\nWh ? + “be”+ subject + going to base verb ?\nWhere are you going to go?\nWhen is he going to leave?\nWatch It!\nWatch the following video to listen to and review the form and functions of simple future with ‘be\ngoing to’.\nWatch the video Be Going To (5:30 minutes) 48 | 5. THE FUTURE - \"BE GOING TO\"\nFuture with ‘Be Going To’ Functions Practice\nPractice the functions of “be going to” by reading each sentence, and deciding if “be going to” is\nused for a predication or a plan. Flip the card to see the answer!\nBe Going To Functions Practice” Interactive Video (Text Version)\n1. I’m going to look for a new place to live next month.\n2. I think buying a house is going to be expensive.\n3. I’m going to buy a house soon.\n4. It’s going to snow again.\n5. I’m going to move to another country if it snows one more time!\n6. She’s not going to be happy with this mess you made.\n7. He’s going to break the window if he keeps throwing the ball like that!\n8. Tara is going to be a professional dancer when she gets older.\n1\nCheck your answers\nActivity source: “Be Going To Functions Practice” by Sari Martin, licensed under CC BY-NC SA 4.0.\nFuture ‘Be Going To’ Form Practice – Affirmative\nFuture ‘Be Going To’ Form Practice – Affirmative (Text Version)\nFill in the missing words with the ‘be going to’ tense in affirmative, using the subject and verb and\nsometimes an adverb in brackets. Use contractions where possible. Spelling and punctuation\ncount!\n1. Look at those dark clouds overhead! __________________ any second! (it\/rain) 5. THE FUTURE - \"BE GOING TO\" | 49\n2. ________________ this match! They’re leading by 3 goals! (Italy\/win)\n3. If you eat all that cake, _________________ sick. (you\/feel)\n4. Maria believes the Conservatives ______________ the next election. (win)\n2\nAnswers\nActivity source: “Future ‘Be Going To’ Form Practice Affirmative” by Sari Martin, licensed under CC\nBY-NC SA 4.0.\nFuture ‘Be Going To’ Form Practice – Negative\nFuture ‘Be Going To’ Form Practice – Negative (Text Version)\nFill in the missing words by using ‘Be Going To’ in the negative with the verb in the brackets. Use\nthe contraction when possible. Spelling and punctuation count!\n1. Pedro ________________ on time because the traffic is horrible. (arrive)\n2. It’s going to rain tomorrow so we ______________ the beach. (visit)\n3. Alona __________________ that house anymore because it failed the inspection. (buy)\n4. _____________________ any take out food for a month because I need to save\nmoney for a vacation. (I\/purchase)\n5. You _________________ the course if you don’t study more often. (pass)\n3\nAnswers\nActivity source: “Future ‘Be Going To’ Form Practice Negative” by Sari Martin, licensed under CC\nBY-NC SA 4.0. 50 | 5. THE FUTURE - \"BE GOING TO\"\nFuture ‘Be Going To’ Form Practice – Interrogative\nFuture ‘Be Going To’ Form Practice – Interrogative (Text Version)\nFill in the missing words with the question form of ‘Be Going To’ and the subject and verb in\nbrackets. Use contractions when possible. Spelling and punctuation count!\n1. _______________ to a new house next month? (they\/move)\n2. What _________________ if she can’t find a new job in Victoria? (Angeni\/do)\n3. ____________________on your date? You aren’t even ready yet! (you\/not\/go)\n4. __________________somewhere tropical? I know he likes hot weather. (Marco\/\ntravel)\n5. What ________________her? She is going to be so upset when she finds out. (we\/tell)\n4\nCheck your answers\nActivity source: “Future ‘Be Going To’ Form Practice Interrogative” by Sari Martin, licensed under\nCC BY-NC SA 4.0.\nFuture with ‘Be Going To’ Form Practice – Affirmative, Negative,\nInterrogative\nFill in the blanks using the verb in brackets (and the subject). You may need to create affirmative,\nnegative, or interrogative sentences. Spelling and punctuation count!\nBe Going To – Form Practice (Text Version)\nFill in the blanks using “be going to” and the verb in brackets. You might have to write in the\naffirmative, negative or interrogative form. Spelling and punctuation count! 5. THE FUTURE - \"BE GOING TO\" | 51\n1. _______________the gala next Friday? (you\/attend – interrogative)\n2. When ___________________ her second novel? (she\/write – interrogative)\n3. We _____________________ a nap before we go to the concert tonight. (take – negative)\n4. I __________________ dinner in 20 minutes. (prepare – affirmative)\n5. My husband _________________at the end of the year. (retire – affirmative)\n6. Mom, what ______________________ for dinner tonight? (we\/have – interrogative)\n7. Why _____________________ to New York? He should take the train. (your brother\/drive –\ninterrogative)\n8. They _________________________ if they continue to get poor grades. (graduate –\nnegative)\n9. He _________________ meat because he is a vegetarian. (eat – negative)\n10. ________________________ the mouse? (the cat\/chase – interrogative)\n5\nCheck your answers\nActivity source: “Be Going To – Form Practice” by Sari Martin, licensed under CC BY-NC SA 4.0.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• I Gotta Feeling by Black Eyed Peas\n• Never Gonna Give You Up by Rick Astley\nCan you hear “Be Going to” in the lyrics? 52 | 5. THE FUTURE - \"BE GOING TO\"\n“The Future “Be\nGoing to” Joke”\nby Virginia\nMcHardy, licensed\nunder CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Future – “Be Going to”” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0.\nNotes\n1. 1. plan 5. plan\n2. prediction 6. prediction\n3. plan 7. prediction\n4. prediction 8. plan\n2. 1. Look at those dark clouds overhead! It's going to rain any second!\n2. Italy's going to win this match! They're leading by 3 goals!\n3. If you eat all that cake, you're going to feel sick.\n4. Maria believes the Conservatives are going to win the next election.\n3. 1. Pedro isn't going to arrive on time because the traffic is horrible.\n2. It's going to rain tomorrow so we aren't going to visit the beach.\n3. Alona isn't going to buy that house anymore because it failed the inspection.\n4. I'm not going to purchase any takeout food for a month because I need to save money for a vacation.\n5. You aren't going to pass the course if you don't study more often.\n4. 1. Are they going to move to a new house next month?\n2. What is Angeni going to do if she can't find a job in Victoria?\n3. Aren't you going to go on your date? You aren't even ready yet!\n4. Is Marco going to travel somewhere tropical? I know he likes hot weather.\n5. What are we going to tell her? She is going to be so upset when she finds out.\n5. 1. Are you going to attend the gala next Friday?\n2. When is she going to write her second novel? 5. THE FUTURE - \"BE GOING TO\" | 53\n3. We are not going to take a nap before we go to the concert tonight.\n4. I am going to prepare dinner in 20 minutes.\n5. My husband is going to retire at the end of the year.\n6. Mom, what are we having for dinner tonight?\n7. Why is your brother driving to New York? He should take the train.\n8. They are not going to graduate if they continue to get poor grades.\n9. He is not going to eat meat because he is a vegetarian.\n10. Is the cat going to chase the mouse? 54 | 6. THE FUTURE CONTINUOUS TENSE\n6. THE FUTURE CONTINUOUS TENSE\nLearning Outcomes\nAfter completing Chapter 6, students will know how to:\n• use the functions of the Future Continuous Tense.\n• form the Future Continuous Tense in affirmative statements, negative statements and\nquestions.\n• apply the Future Continuous Tense in various situations.\n• use the correct spelling rules for continuous verbs.\nFunctions of the Future Continuous Tense\nThe Future Continuous Tense is used for:\n1. actions that are happening at a specific time in the future\n2. continuous temporary actions that will be ongoing in the future\n3. polite questions\n4. predicting, projecting or imagining actions.\n5. actions that have started now and will continue into the future\nLet us discuss these points in detail. 6. THE FUTURE CONTINUOUS TENSE | 55\nActions that are happening in progress at a specific time in the\nfuture:\n“The Future Continuous Tense Timeline” by Virginia McHardy, licensed under CC BY 4.0.\n• I will be sleeping at midnight.\n• The Level 4 students will be writing their test at 1pm tomorrow.\n• He won’t be studying at 10pm because the Georgian College library closes at 9:30.\nContinuous temporary actions that will be ongoing during a\ncertain time in the future:\n• I will be studying at a university in Australia this time next year.\n• Joanne will be drinking margaritas on a beach next week on vacation.\nAsking polite questions:\nSome examples are:\n• Will Leny be joining us for dinner?\n• Will you be having the steak or the fish?\n• Will Celina be leaving in the morning?\n• Will they be making dinner for everyone?\nProjecting\/Imagining\/Predicting actions in the future:\n• I will be living in Florida in 10 years.\n• Gord will be working in a top company when he’s 40.\nActions happening now that will continue to happen into the 56 | 6. THE FUTURE CONTINUOUS TENSE\nfuture (We use the word ‘still’ with this function):\n• He will still be living with his parents when he’s 50.\n• Olivia will still be working at the same job when she’s ready for retirement.\nForms of the Future Continuous Tense\nLet us now explore how the Future Continuous Tense is formed:\nAffirmative Sentences: Subject + will be + verb + ing\nSubject + will be+ + verb + ing\nI will be going.\nMarcus will be teaching.\nThey will be playing.\nNegative Sentences: Subject + will not be + verb +ing\nSubject + will not +be + verb +ing\nI will not be listening.\nHe will not be dancing.\nThey will not be editing.\n* will not = won’t 6. THE FUTURE CONTINUOUS TENSE | 57\nYes\/No Questions: Will + subject + be + verb + ing?\nWill+ subject + be + verb + ing?\nWill Mariam be working?\nWill they be sleeping?\nWh-Questions: Wh- + will + subject + be + verb + ing?\nWh + will + subject +be + verb + ing?\nWhy will Laila be studying?\nWhere will she be living?\n“Spelling Rules for Continuous Verbs” by Virginia McHardy, licensed under CC BY 4.0.\nFuture Continuous Form and Function Review\nWatch the video to review the form and function of Future Continuous.\nFuture Continuous Form & Functions Review (Text Version)\nWatch the video 5 Ways to Use The Future Continuous Tense in English (11 minutes)\nPause at 1:40: If you want to learn more about ‘Want’ vs ‘Won’t’ in Canadian\/American\npronunciation, take a look at the video WANT vs. WON’T Pronunciation – American English. 58 | 6. THE FUTURE CONTINUOUS TENSE\nPause at 6:06: Remember that predicting is also guessing, or imagining about the future.\nPause at 8:23: I will be in the middle of sleeping at 4:00am.\nPause at 8:25: She’ll be living in Paris one day.\nPause at 8:29: Will you be dining with us this evening?\nPause at 8:35: Next week, I’ll be tanning in the sunshine on vacation.\nActivity Source: “Future Continuous Form & Functions Review” by Sari Martin, licensed under CC\nBY-NC-SA 4.0. Video Source: English with Greg. 5 Ways to Use The Future Continuous Tense in\nEnglish [Video]. YouTube. youtube.com\/watch?v=TV8uXTdXH1w.\nFuture Continuous Functions Practice\nFuture Continuous Functions Practice (Text Version)\nRead each sentence with the future continuous. Guess which function of the future continuous is\nused. There are 5 functions to choose from:\n1. a continuous action happening at a specific time 3. asking polite questions\nin the future 4. predicting, imagining, or projecting into the future\n2. continuous temporary actions that will 5. an action that has started now and will continue\nbe ongoing during a time in the future in the future\n1. I’ll be lying on a beach and reading a good book next week when I travel to the Bahamas.\n2. Will you be joining me for dinner this evening?\n3. At this exact time tomorrow, I’ll be on a plane going to the Bahamas!\n4. She’ll be jumping with excitement when you give her that gorgeous ring!\n5. They will still be washing that car well into the night! That car was so dirty.\n6. She will still be wearing her Halloween costume at Christmas! She loves it and won’t take it\noff!\n7. We will be landing in Toronto at 3:00pm.\n8. Will you be purchasing the white or silver Mercedes?\n9. I will be sailing around the world next year.\n10. Dad will be driving you to school tomorrow morning. 6. THE FUTURE CONTINUOUS TENSE | 59\n11. I won’t be working with the team at 2:00pm. I will be free after 1:30pm.\n1\nCheck your answers\nActivity source: “Future Continuous Functions Practice Dialog Cards” by Sari Martin, licensed\nunder CC BY-NC SA 4.0.\nFuture Continuous Form Practice – Affirmative\nFuture Continuous Form Practice – Affirmative (Text Version)\nIn each of the sentences given below, there is an error and it is bolded. You have to write the\ncorrect form of future continuous.\nExample: We went to the beach next Sunday.\nwill be going\n1. At midnight we are sleep. ___________________________\n2. Next Saturday by this time, I was enjoy myself at the beach.\n__________________________\n3. Next week, we tour the famous movies studios in Los Angeles.\n_________________________\n4. Josiane will shop with you all day tomorrow. __________________________\n2\nCheck your answers\nActivity source: “Future Continuous” by Annapurna Madhuri, edited by Sari Martin and oeratgc,\nfrom “Future Simple and Future Continuous” In Effective English for Teachers by Annapurna\nMadhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits. 60 | 6. THE FUTURE CONTINUOUS TENSE\nFuture Continuous Form Practice – Negative\nFuture Continuous – Negative Form Practice (Text Version)\nRewrite the following sentences in negative form. Write the whole sentence, and use the\ncontraction.\nExample: Sakshi will be coming to Ottawa.,\nNegative form: Sakshi won’t be coming to Ottawa.\n1. Qiping and Roman will be working in a steel plant.\n_______________________________________\n2. Juslin will be waiting for me. __________________________________________\n3. Virginia will be writing an essay in the exam tomorrow.\n_________________________________\n4. The school team will be playing against the state champions.\n_______________________________\n5. Tomorrow, Felipe will be using the internet to browse videos.\n____________________________________________\n3\nCheck your answers\nActivity source: “Future Continuous” by Annapurna Madhuri, edited by Sari Martin,\nfrom “Future Simple and Future Continuous” In Effective English for Teachers by\nAnnapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text, removal of\nquestions, and minor edits.\nFuture Continuous Form Practice – Interrogative\nFuture Continuous – Interrogative (Text Version) 6. THE FUTURE CONTINUOUS TENSE | 61\nRewrite the following sentences in interrogative form.\nExample: Florentine will be coming to Miami.\nInterrogative form: Will Florentine be coming to Miami?\n1. Ravi and Kiran will be working in a steel plant. ___________________________\n2. Edward will be listening to the music by this time tomorrow. ________________________\n3. Sora will be writing an essay in the exam tomorrow. _____________________________\n4. The school team will be playing against the state champions. ______________________\n4\nCheck your answers\nActivity source: “Future Continuous” by Annapurna Madhuri, edited by Sari Martin, from “Future\nSimple and Future Continuous” In Effective English for Teachers by Annapurna Madhuri, licensed\nunder CC BY-NC SA 4.0. \/ Converted to text, removal of questions, minor edits.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• Every breath You Take by The Police\n• Sittin’ on the Dock of the Bay by Otis Redding\nCan you hear the Future Continuous Tense in the lyrics?\nThe Future\nContinuous\nTense Joke by\nVirginia McHardy,\nlicensed under CC\nBY 4.0. 62 | 6. THE FUTURE CONTINUOUS TENSE\nAttribution & References\nExcept where otherwise noted, “The Future Continuous Tense” by Sari Martin & Virginia McHardy is\nlicensed under CC BY-NC-SA 4.0.\nNotes\n1. 1. continuous temporary actions that will be ongoing during a time in the future\n2. asking polite questions\n3. a continuous action happening at a specific time in the future\n4. predicting, imagining, or projecting into the future\n5. an action that has started now and will continue in the future\n6. an action that has started now and will continue in the future\n7. a continuous action happening at a specific time in the future\n8. asking polite questions\n9. continuous temporary actions that will be ongoing during a time in the future\n10. continuous temporary actions that will be ongoing during a time in the future\n11. a continuous action happening at a specific time in the future\n2. 1. At midnight, we will be sleeping.\n2. Next Saturday by this time, I will be enjoying myself at the beach.\n3. Next week, we will be touring the famous movies studios in Los Angeles.\n4. Josiane will be shopping with you all day tomorrow.\n3. 1. Qiping and Roman won't be working in a steel plant.\n2. Juslin won't be waiting for me.\n3. Virginia won't be writing an essay in the exam tomorrow.\n4. The school team won't be playing against the state champions.\n5. Tomorrow, Felipe won't be using the internet to browse videos.\n4. 1. Will Ravi and Kiran be working in a steel plant?\n2. Will Edward be listening to the music by this time tomorrow?\n3. Will Sora be writing an essay in the exam tomorrow?\n4. Will the school team be playing against the state champions? 7. THE SIMPLE PAST TENSE | 63\n7. THE SIMPLE PAST TENSE\nLearning Outcomes\nAfter completing Chapter 7, students will know how to:\n• use the functions of the Simple Past Tense.\n• form the Simple Past Tense in affirmative statements, negative statements and questions.\n• apply the Simple Past Tense in various situations.\n• use the correct spelling rules for regular verbs in the Simple Past Tense.\nFunctions of the Simple Past Tense\nThe Simple Past Tense is used for\n1. finished past actions.\n2. repeated past actions.\nLet us discuss these points in detail:\nFinished past actions: 64 | 7. THE SIMPLE PAST TENSE\n“Simple Past Timeline” by Virginia McHardy, licensed under CC BY 4.0.\nActions that started and finished in the time before now. Some examples are:\n• I cleaned my house yesterday.\n• He played basketball last night.\n• They didn’t wash their dishes.\n• We didn’t finish our homework in time.\n• Did you go to the game on Friday?\nRepeated past actions:\n“Repeated Past actions” by Virginia McHardy, licensed under CC BY 4.0.\nActions that happened over and over again in the past. Some examples are:\n• I went to the store 3 times yesterday.\n• They played basketball every day in elementary school.\n• She watched that movie repeatedly as a child.\n**Time Markers for The Simple Past Tense\nSome common time markers used with The Simple Past Tense are:\n• yesterday\n• last night\/week\/month\/year\n• ago (2 days ago\/5 weeks ago\/10 years ago) 7. THE SIMPLE PAST TENSE | 65\nForm of The Simple Past Tense\nLet us now explore how the Simple Past Tense is formed with regular *verbs:\nAffirmative Sentences: Subject + verb + ed\nSubject + verb + ed + past time marker.\nI cleaned yesterday.\nHe played yesterday.\nMelissa danced yesterday.\nThey studied** yesterday.\n* Irregular verbs are all different. You need to memorize the affirmative forms using the\nlist of commonly used verbs in Chapter 13.\nNegative Sentences: Subject + did + not + base verb\nSubject + did+ not + base verb\nI did not * clean.\nHe did not play.\nThey did not study.\n* did not = didn’t\nYes\/No Questions: Did + subject + base verb?\nDid + subject + base verb? Short Answer\nDid you clean? Yes, I did.\/No, I didn’t.\nYes, he did.\/No, he\nDid Noah play?\ndidn’t.\nYes, they did.\/No, they\nDid they study\ndidn’t. 66 | 7. THE SIMPLE PAST TENSE\nInformation Questions: Wh- + did + subject + base verb?\nWh- question word + did + subject base verb?\nWhat did you eat?\nWhere did Meghan go?\nWhen did they arrive?\nSpelling Rules for The Simple Past Tense by Virginia McHardy, licensed under CC BY 4.0.\n(For common irregular verb forms, see Chapter 13.)\nSimple Past Review of Form and Function Video\nWatch the video to review the form of Simple Past and some irregular verbs. Do the practice\nactivities at the end of the video!\nSimple Past Review and Form Practice (Text Version)\nWatch the video Simple Past – Grammar & Verb Tenses (5:47 minutes)\nActivity source: “Simple Past Review and Form Practice” by Sari Martin, licensed under CC BY-NC 7. THE SIMPLE PAST TENSE | 67\nSA 4.0. Video Source: Ellii (formerly ESL Library). (2020, September 14). Simple Past – Grammar &\nVerb Tenses [Video]. YouTube. https:\/\/www.youtube.com\/watch?v=MI3S3kdkofo\nSimple Past Form Practice – Affirmative\nFill in the blanks with the verb in brackets. Remember that some verbs are irregular. See if you can\nguess the correct form.\nSimple past – Recap (Text Version)\nFill in the blanks with simple past tense form of the verb given in the bracket.\n1. I ________________(receive) a parcel from my aunt last week.\n2. The great ship Titanic _____________ (sink) after colliding with an iceberg.\n3. The little girl ____________________ (break) the glass tumbler.\n4. If he ___________________(play) well, we would not have been defeated.\n5. The members _______________(select) him as the captain.\n6. The shephard __________________(count) his sheep twice, after he returned home in the\nevening.\n7. I __________________ (get) a beautiful gift from my brother.\n8. Praveen ___________________(keep) his books in the book-shelf.\n9. The plane _____________________(fly) towards the east after it took off.\n10. They ___________________ (record) the complete wedding.\n11. The teacher ___________________ (appreciate) Youssef for getting good grades.\n1\nCheck your answers\nActivity Source: “Simple past – Recap” by Annapurna Madhuri, edited by Sari Martin, from “Simple\nPast and Past Continuous” In Effective English for Teachers by Annapurna Madhuri, licensed under\nCC BY-NC SA 4.0. \/ Converted to text. 68 | 7. THE SIMPLE PAST TENSE\nSimple Past Form Practice – Negative\nSimple past – negative sentences (Text Version)\nRewrite each of the sentences in the negative form, as shown in the example.\nExample: Shanti bought a car last year.\nShanti did not buy a car last year.\nNote the sentence structure: Subject (Shanti) + did not buy (base verb of bought) + object (a car) +\ntime period (signal word – last year)? (most importantly – question tag)\n1. Valentina came here three days ago. ______________\n2. They watched a movie last night. _______________\n3. David cleaned his house yesterday. _______________\n4. We worked hard that day. _____________________\n5. She had a bath early in the morning. _________________\n2\nCheck your answers\nActivity source: “Simple Past – Negative Sentences” by Annapurna Madhuri, edited by Sari\nMartin, from “Simple Past” In Effective English for Teachers by Annapurna Madhuri, licensed under\nCC BY-NC SA 4.0. \/ Converted to text and minor edits.\nSimple Past Form Practice – Interrogative\nSimple past – interrogative sentences (Text Version)\nRewrite each of the sentences in the form of a question\/interrogative form, as shown in the\nexample.\nExample: Pierre bought a car last year. 7. THE SIMPLE PAST TENSE | 69\nDid Pierre buy a car last year?\nNote the sentence structure: Did + subject (Pierre) + buy (base verb of bought) + object (a car) +\ntime period (signal word – last year)? (most importantly – question tag)\n1. Valentina came here three days ago.\n2. They watched a movie last night.\n3. David cleaned his house yesterday.\n4. We worked hard that day.\n5. She had a bath early in the morning.\n3\nCheck your answers\nActivity source: “Present Continuous” by Annapurna Madhuri, edited by Sari Martin, from “Simple\nPast and Past Continuous” In Effective English for Teachers by Annapurna Madhuri, licensed under\nCC BY-NC SA 4.0. \/ Questions edited and converted to text.\nSimple Past All Forms Review\nSimple Past – Wrap up 2 (Text Version)\nArrange the jumbled words, using a suitable form of the verb to make proper sentences.\nExample: you\/from\/hear\/the\/new\/job\/did\/?\nAnswer: Did you hear from the new job?\n1. Mohammed\/play\/toys\/did\/with\/?\/his\n2. borrow\/Alice\/sister’s\/dress\/new\/for\/party\/the\/her\n3. train\/leave\/did\/the\/station\/?\/time\/on\/the\n4. examination\/lot\/Sameer\/before\/waste\/of\/a\/time\/his\n5. not\/Sofia\/grade\/receive\/good\/a\/did\/\n4\nCheck your answers\nActivity source: “Simple Past – Wrap Up 2” by Annapurna Madhuri, edited by Sari Martin, from 70 | 7. THE SIMPLE PAST TENSE\n“Simple Past” In Effective English for Teachers by Annapurna Madhuri, licensed under CC BY-NC SA\n4.0. \/ Questions edited and converted to text.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• Because You Loved Me by Celine Dion\n• A Day in the Life – The Beatles\nCan you hear the Simple Past Tense in the lyrics?\n“The Simple Past Tense Joke” by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Simple Past Tense” by Sari Martin & Virginia McHardy is licensed under\nCC BY-NC-SA 4.0.\nNotes\n1. 1. received 7. got\n2. sank 8. kept\n3. broke 9. flew\n4. played 10. recorded\n5. selected 11. appreciated\n6. counted\n2. 1. Valentina did not come here three days ago. 7. THE SIMPLE PAST TENSE | 71\n2. They did not watch a movie last night.\n3. David did not clean his house yesterday.\n4. We did not work hard that day.\n5. She did not have a bath early in the morning.\n3. 1. Did Valentina come here three days ago?\n2. Did they watch a movie last night?\n3. Did David clean his house yesterday?\n4. Did we work hard that day?\n5. Did she have a bath early in the morning?\n4. 1. Did Mohammed play with his toys?\n2. Alice borrowed her sister's new dress for the party.\n3. Did the train leave the station on time?\n4. Sameer wasted a lot of time before his examination.\n5. Sofia did not receive a good grade. 72 | 8. PAST CONTINUOUS TENSE\n8. PAST CONTINUOUS TENSE\nLearning Outcomes\nAfter completing Chapter 8, students will know how to:\n• use the functions of the Past Continuous Tense.\n• form the Past Continuous Tense in affirmative statements, negative statements and\nquestions.\n• apply the Past Continuous Tense in various situations.\n• use the correct spelling rules for continuous verbs.\n• use the Simple Past Tense with the Past Continuous Tense.\nFunctions of the Past Continuous Tense\nThe Past Continuous Tense is used for:\n1. actions happening at a specific time or during a quick action in the past.\n2. actions that were ongoing over a period of time in the past.\n3. actions happening at a time in the past when another action interrupted.\n4. two actions happening at the same time.\nLet us discuss these points in detail. 8. PAST CONTINUOUS TENSE | 73\nActions happening at a specific time in the past:\n“The Past Continuous at a Specific Time” by Virginia McHardy, licensed under CC BY 4.0.\nActions that started and were occurring at a certain point of time before now. They started before\nthe specific time or quick action, and continued after. Some examples are:\n• I was cleaning my house at 1:00pm yesterday.\n• Richard was playing basketball when his mom arrived.\n• They weren’t washing their dishes at noon.\n• Sarah wasn’t working at midnight.\n• It was snowing at the time of the accident.\nActions that were ongoing over a period of time in the past:\n“The Past Continuous Tense Timeline” by Virginia McHardy, licensed under CC BY 4.0.\n• I was taking Spanish lessons when I lived in Argentina.\n• She was travelling through Europe all summer.\n• The Smiths were having problems with their teenage daughter last year.\n• The company wasn’t making a lot of money in the last quarter. 74 | 8. PAST CONTINUOUS TENSE\nActions happening at a time in the past when another action\ninterrupted (The Simple Past is used with “when” as the\ninterrupting action):\n“The Past Continuous Tense with Simple Past Timeline” by Virginia McHardy, licensed under CC BY 4.0.\n• I was taking a bath when the telephone rang.\n• They were having breakfast there was a knock at the door.\nTwo actions happening at the same time in the past (“while” is\nused to connect the two actions):\n“Two Past Actions Happening at the Same Time” by Virginia McHardy, licensed under CC BY 4.0.\n• I was taking a bath while my husband was cooking dinner.\n• The dog was running around the table while they were eating breakfast 8. PAST CONTINUOUS TENSE | 75\nForm of The Past Continuous Tense\nLet us now explore how the Past Continuous Tense is formed:\nAffirmative sentences: Subject + was\/were + verb + ing\nSubject + + was\/were + verb + ing.\nI was studying.\nJoe was teaching.\nYou were working.\nNegative Sentences: Subject + was\/were + not + verb +ing.\nSubject + was\/were + not + verb + ing\nI was not* eating.\nShe was not playing.\nThe children were not * working.\nYou were not studying.\n*was not = wasn’t\n**were not = weren’t\nYes\/No Questions: Was\/Were + subject + verb + ing?\nWas\/Were + subject + verb + ing? Short Answer\nYes, you were.\/No, you\nWas I helping?\nweren’t.\nWas he jumping? Yes, he was.\/No, he wasn’t.\nWere you listening? Yes, I was.\/No, I wasn’t. 76 | 8. PAST CONTINUOUS TENSE\nInformation Questions: Wh- + was\/were + subject + verb+ing?\nWh- question word+ was\/were + subject +verb + ing?\nWhat was he doing?\nWhere was she sleeping?\nWhen were you fighting?\n“Spelling Rules for Continuous Verbs” by Virginia McHardy, licensed under CC BY 4.0.\nPast Continuous Function and Form Review\nWatch the interactive video to review form and function of past continuous. Read the pop-ups\ncarefully!\nPast Continuous Function and Form Practice (Text Version)\nWatch the video The Past Continuous | Past Progressive (5:45 minutes)\nPause at 1:20: Remember our examples from before? I was cleaning my house at 1:00pm\nyesterday. She wasn’t working at midnight.\nPause at 1:22: This might mean that the ‘specific time’ isn’t an actual time, but a quick action\ninstead. The longer action continues before and after the quick one. For example: He was cooking\ndinner when the kids came home from school. (He started cooking before, and continued to cook 8. PAST CONTINUOUS TENSE | 77\nafter the kids came home). ‘Cooking’ was in progress when another action happened, and cooking\ncontinued to happen afterwards.\nActivity Source: “Past Continuous Function and Form Practice Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. Video Source: First Class English. (2022, February 4 ). The Past\nContinuous | Past Progressive | Free English Grammar lesson 2022 [Video]. YouTube.\nhttps:\/\/www.youtube.com\/watch?v=LH-prYzG2Ug\nPast Continuous Functions Review\nPast Continuous Function Practice (Text Version)\nPractice the functions of Past Continuous and guess which function was used in each sentence.\nThe functions you can choose from are:\n• actions happening at a specific time or during quick action in the past;\n• actions that were ongoing over a period of time in the past;\n• actions happening at a time in the past when another action interrupted;\n• two actions happening at the same time.\n1. Last night I was watching TV while my husband was reading.\n2. She was driving when she received a phone call. She pulled over to answer the call.\n3. His sisters were both yelling at him for breaking their favorite toy.\n4. She was backpacking through Thailand last summer.\n5. He still wasn’t sleeping at midnight.\n6. She was walking in the school yard when she slipped on a banana peel.\n7. We were watching the movie when our food was delivered.\n8. The moon was shining brightly while we were driving to the farm.\n9. She was cooking dinner when her husband came home.\n10. She was talking on the phone for hours last night.\n11. She was teaching the lesson when a student raised their hand.\n1\nCheck your answers 78 | 8. PAST CONTINUOUS TENSE\nActivity source: “Present Continuous Function Practice” by Sari Martin, licensed under CC BY-NC\nSA 4.0.\nPast Continuous Form Practice – Affirmative\nPast Continuous and Simple Past Form Practice (Text Version)\nFill in the blanks with the correct form of the verb given in the bracket in either past continuous or\nsimple past\n1. The sun _______________ (shine) when Catherine __________________ (get) up.\n2. We ________________ (drive) when suddenly we __________________(notice) bad\nweather.\n3. My parents _______________ (meet) while they _______________ (study) in college.\n4. While you _________________ (take) it easy, I __________________ (prepare) lunch for\neveryone.\n2\nCheck your answers\nActivity source: “Past Continuous and Simple Past Form Practice” by Annapurna Madhuri, edited\nby Sari Martin, from “Simple Past and Past Continuous” In Effective English for Teachers by\nAnnapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits.\nPast Continuous Form Practice – Negative\nPast continuous – negative (Text Version)\nRewrite the following sentences in the negative form, as given in the example. 8. PAST CONTINUOUS TENSE | 79\nShe was bringing ice-cream for us.\nShe was not bringing ice-cream for us.\n1. She was having a bath. _________________\n2. We were running down the road. _____________________\n3. The soldiers were guarding the city. _________________\n4. The children were watching a movie. ___________________\n5. Sharief was lying on the sofa. _____________________\n3\nCheck your answers\nActivity source: “Past Continuous – negative” by Annapurna Madhuri, edited by Sari Martin, from\n“Simple Past and Past Continuous” In Effective English for Teachers by Annapurna Madhuri,\nlicensed under CC BY-NC SA 4.0. \/ Converted to text, some questions removed, and other minor\nedits.\nPast Continuous Form Practice – Interrogative\nPast continuous – interrogative (Text Version)\nRewrite the following sentences in the interrogative form, as given in the example.\nShe was bringing ice-cream at 7.\nWas she bringing ice-cream at 7?\n1. She was having a bath. ______________\n2. They were running down the road. ___________________\n3. Yuki was eating a sandwich in her room. ____________________\n4. Hong was cooking breakfast when the door bell rang. _______________________\n5. The girls were studying for the test. _______________________\n6. The men were going to work. ________________________\n7. When the war broke out, they were living in France. __________________\n4\nCheck your answers 80 | 8. PAST CONTINUOUS TENSE\nActivity source: “Past Continuous Interrogative” by Annapurna Madhuri, edited by Sari Martin,\nfrom “Simple Past and Past Continuous” In Effective English for Teachers by Annapurna Madhuri,\nlicensed under CC BY-NC SA 4.0. \/ Converted to text, some questions removed, and other minor\nedits.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• Don’t You Want Me Baby by Human League\n• Never Tear Us Apart by INXS\nCan you hear the Past Continuous Tense in the lyrics?\n“The Past Continuous Tense Joke” by Virginia McHardy, licensed under CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “Past Continuous Tense” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0.\nNotes\n1. 1. two actions happening at the same time\n2. actions happening at a time in the past when another action interrupted\n3. two actions happening at the same time\n4. actions that were ongoing over a period of time in the past\n5. actions happening during a specific time or quick action in the past 8. PAST CONTINUOUS TENSE | 81\n6. actions happening at a time in the past when another action interrupted\n7. actions happening at a time in the past when another action interrupted\n8. two actions happening at the same time\n9. actions happening during a specific time or quick action in the past\n10. actions that were ongoing over a period of time in the past\n11. actions happening at a time in the past when another action interrupted\n2. 1. The sun was shining when Catherine got up.\n2. We were driving when suddenly we noticed bad weather.\n3. My parents met while they were studying in college.\n4. While you were taking it easy, I was preparing lunch for everyone.\n3. 1. She was not having a bath.\n2. We were not running down the road.\n3. The soldiers were not guarding the city.\n4. The children were not watching a movie.\n5. Sharief was not lying on the sofa.\n4. 1. Was she having a bath?\n2. Were they running down the road?\n3. Was Yuki eating a sandwich in her room?\n4. Was Hong cooking breakfast when the door bell rang?\n5. Were the girls studying for the test?\n6. Were the men going to work?\n7. Were they living in France when the war broke out? 82 | 9. THE PRESENT PERFECT TENSE\n9. THE PRESENT PERFECT TENSE\nLearning Outcomes\nAfter completing Chapter 9, students will know how to:\n• use the functions of the Present Perfect Tense.\n• form the Present Perfect Tense in affirmative statements, negative statements and\nquestions.\n• apply the Present Perfect Tense in various situations.\n• use appropriate time markers with the Present Perfect Tense.\nFunctions of the Present Perfect Tense\nThe Present Perfect Tense is used for\n1. past actions that happened at an unspecific time.\n2. actions that started in the past and are continuing up until now.\nLet us discuss these points in detail. 9. THE PRESENT PERFECT TENSE | 83\nPast actions that happened at an unspecific time:\nPresent Perfect Timeline by Virginia McHardy, licensed under CC BY 4.0.\nThese are actions that finished, but you don’t know when they happened. Some examples are:\n• I have seen Niagara Falls.\n• Petro has written the test.\n• Sari has helped many students.\n• We have eaten breakfast.\nWith this function, the common time markers that are used include already, yet, still, ever, and\nnever. See the table below:\nPresent Perfect Time Markers by Virginia McHardy, licensed under CC BY 4.0. 84 | 9. THE PRESENT PERFECT TENSE\nRepeated past actions at an unspecific time:\nPresent Perfect Repeated Past Actions by Virginia McHardy, licensed under CC BY 4.0.\nThese actions happened repeatedly in the past, but we don’t know when. They are finished\nactions. Some examples are:\n• Sora has seen the movie Titanic three times.\n• Gali and Tara have been to Italy several times.\n• Zainab has failed her driver’s test twice.\nActions that started in the past and have continued up until now:\nPresent Perfect Timeline 2 by Virginia McHardy, licensed under CC BY 4.0.\nThese are actions that started in the past and have continued up until now and might continue into\nthe future. With this function, common time markers used are since andfor.\nSince is used with a specific time – since 1995, since Tuesday, since childhood\nFor is used with a duration of time – for 3 years, for 2 days, for a long time\nSome examples are:\n• I have lived in Barrie for 15 years.\n• Mary has worked at Georgian College since 2005.\n• Corrine has known me since childhood.\n• Mariam has taught ESL for a long time. 9. THE PRESENT PERFECT TENSE | 85\nForms\nLet us now explore how the Present Perfect Tense is formed:\nAffirmative sentences: Subject + has\/have + past participle\nSubject + + has\/have + past participle\nI have studied.\nGaelle has eaten.\nAugusta has gone.\nMary and Alma have finished.\nNegative Sentences: Subject + has\/have + not+ past participle\nSubject + have+ not + past participle.\nI have not (haven’t taught.\nNebrass has not (hasn’t) laughed.\nAdlet has not (hasn’t) played.\nYou have not (haven’t) arrived.\nWang and Shengbo have not (haven’t) decided.\nYes\/No Questions: Has\/Have + subject + past participle?\nHas\/Have + subject + past participle? Short Answer\nHave I answered? Yes, you have.\/No, you haven’t.\nHas Stephen failed? Yes, he has.\/No, he hasn’t.\nHave the teachers slept? Yes, they have.\/No, they haven’t. 86 | 9. THE PRESENT PERFECT TENSE\nInformation Questions: Wh ? + has\/have + subject + past participle?\nWh ? + has\/have + subject past participle? Answer\nShe had cleaned the kitchen, mopped\nWhat has Yumi done?\nthe floors and dusted.\nWhere have they gone? They have gone to the dentist.\nI have lied because I didn’t want to get in\nWhy have you lied?\ntrouble.\n***Do not use “When” with the Present Perfect Tense questions. Use it with The Simple Past\n***For a list of past participles, see Chapter 13.\nPresent Perfect Form and Function Practice\nWatch the video here to review the form and function of Present Perfect. Pay attention to the pop-\nup messages! There are some practice questions at the end.\nPresent Perfect Form and Function Review and Practice (Text Version)\nWatch the video Present Perfect – Grammar & Verb Tenses (6 minutes)\n1:00-1:05 Notice that for actions that started in the past and continue until now, we include a\nperiod of time (used with ‘for) or a start time (used with ‘since’).\nActivity source: “Present Perfect Form and Function Review and Practice” by Sari\nMartin, licensed under CC BY-NC SA 4.0. Video Source: Ellii (formerly ESL Library).\n(2020, September 14). Present Perfect – Grammar & Verb Tenses [Video]. YoutTube.\nhttps:\/\/www.youtube.com\/watch?v=553eeL1Dvho 9. THE PRESENT PERFECT TENSE | 87\nPresent Perfect More Practice\nPresent Perfect is sometimes a difficult tense to understand. This video gives some great examples\ncomparing the Simple Past and Present Perfect to highlight the difference. Watch the video to see\nthe difference between the two tenses. Pay attention to the pop-up messages.\nMore Present Perfect Practice Interactive Video (Text Version)\nWatch the video Introduction to Present Perfect Tense (5:20 minutes)\n1:16-1:20 Remember: The Present Perfect connects the past to the present!\n1:32-1:36 Again, a time period connecting the past to now.\nActivity source: “Present Perfect Form and Function” by Sari Martin, licensed under CC\nBY-NC SA 4.0. Video Source: EasyTeaching. (January 2, 2020 ) Introduction to Present\nPerfect Tense | EasyTeaching [Video]. YouTube. https:\/\/www.youtube.com\/\nwatch?v=LWubbhIr0Og\nPresent Perfect Form Practice – Affirmative\nPresent Perfect – Affirmative (Text Version)\nUse have\/has along with the past participle form of the verb given, to form sentences in present\nperfect tense:\nExample:\nThe train\/leave platform\nThe train has left the platform.\n1. Mr. Roy\/write a book _______________________ 88 | 9. THE PRESENT PERFECT TENSE\n2. My father\/go to Shanghai. _________________________\n3. I\/lose my pencil box ______________________\n4. Rohan\/live in this house for five years. _________________________\n5. we\/just arrived from Vancouver __________________________\n6. Children\/go to bed _____________________\n7. Mother\/cook soup for lunch today ___________________________\n8. Hannah\/just\/board the bus ___________________________\n9. we\/live here for ten years now ________________________\n10. the shop\/open recently ______________________\n1\nCheck your answers\nActivity source: “Present Perfect – Affirmative” by Annapurna Madhuri, edited by Sari\nMartin, from “Simple Present, Present Continuous, and Present Perfect” In Effective\nEnglish for Teachers by Annapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Title of\nactivity changed, converted to text and minor edits.\nPresent Perfect Form Practice – Negative\nPresent perfect – negative (Text Version)\nRewrite the following sentences in negative form\nExample: Svetta has eaten the whole pie.\nNegative form: Svetta has NOT eaten the whole pie.\n1. Qiping has hidden the toys in her shelf. ____________________\n2. Rina and Sheila have reached the school. ____________________\n3. Ms. Kim has given milk to the puppies. _____________________\n4. The cat has caught the mouse. _______________________\n5. Glen has finished his homework. ____________________\n6. The artists have used all the colours. ____________________ 9. THE PRESENT PERFECT TENSE | 89\n7. She has lived in Jordan for 5 years. ______________________\n8. I have received a parcel from my parents. _______________________\n2\nCheck your answers\nActivity source: “Present perfect – negative” by Annapurna Madhuri, edited by Sari Martin, from\n“Simple Present, Present Continuous, and Present Perfect ” In Effective English for Teachers by\nAnnapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits.\nPresent Perfect Form Practice – Interrogative\nPresent perfect – interrogative (Text Version)\nRewrite the following sentences in interrogative form\nExample: Svetta has eaten the whole pie.\nInterrogative form: Has Svetta eaten the whole pie?\n1. Qiping has hidden the toys in her shelf. ________________\n2. Rina and Sheila have reached the school. ________________\n3. Ms. Kim has given milk to the puppies. ________________\n4. The cat has caught the mouse. __________________\n5. She has lived in Jordan for 5 years. ______________\n6. The artists have used all the colours. _________________\n7. His parents have advised him to join a good school. __________________\n3\nCheck your answers\nActivity source: “Present perfect – interrogative” by Annapurna Madhuri, edited by Sari Martin,\nfrom “Simple Present, Present Continuous, and Present Perfect ” In Effective English for Teachers\nby Annapurna Madhuri, licensed under CC BY-NC SA 4.0. \/ Converted to text and minor edits. 90 | 9. THE PRESENT PERFECT TENSE\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• I Still Haven’t Found What I’m Looking For by U2\n• In My Life by The Beatles\nCan you hear the Present Perfect Tense in the lyrics?\nThe Present\nPerfect Tense\nJoke by Virginia\nMcHardy, licensed\nunder CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Present Perfect Tense” by Sari Martin & Virginia McHardy is licensed\nunder CC BY-NC-SA 4.0\nNotes\n1. 1. Mr. Roy has written a book.\n2. My father has gone to Shanghai.\n3. I have lost my pencil box.\n4. Rohan has lived in this house for five years.\n5. We have just arrived from Vancouver.\n6. Children have gone to bed.\n7. Mother has cooked soup for lunch today.\n8. Hannah has just boarded the bus.\n9. We have lived here for 10 years now. 9. THE PRESENT PERFECT TENSE | 91\n10. The shop has opened recently.\n2. 1. Qiping has not hidden the toys in her shelf.\n2. Rina and Sheila have not reached the school.\n3. Ms. Kim has not given milk to the puppies.\n4. The cat has not caught the mouse.\n5. Glen has not finished his homework.\n6. The artists have not used all the colours.\n7. She has not lived in Jordan for 5 years.\n8. I have received a parcel from my parents.\n3. 1. Has Qiping hidden the toys in her shelf?\n2. Have Rina and Sheila reached the school?\n3. Has Ms. Kim given milk to the puppies?\n4. Has the cat caught the mouse?\n5. Has she lived in Jordan for 5 years?\n6. Have the artists used all the colours?\n7. Have his parents advised him to join a good school? 92 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\n10. THE PRESENT PERFECT CONTINUOUS\nTENSE\nLearning Outcomes\nAfter completing Chapter 10, students will know how to:\n• use the functions of the Present Perfect Continuous Tense.\n• form the Present Perfect Continuous Tense in affirmative statements, negative statements\nand questions.\n• apply the Present Perfect Continuous Tense in various situations.\n• distinguish between stative verbs and continuous verbs.\n• use the correct spelling rules for continuous verbs.\nFunctions\nThe Present Perfect Continuous Tense is used for\n1. actions that started in the past and are continuing up until now (and will probably continue\ninto the future).\n2. actions that were ongoing in the past, but just recently finished.\nLet us discuss this point in detail. 10. THE PRESENT PERFECT CONTINUOUS TENSE | 93\nActions that started in the past and are continuing up until now\n(and will probably continue into the future)\nPresent Perfect Continuous Timeline by Virginia McHardy, licensed under CC BY 4.0.\nThese are actions that started in the past and have continued up until now and might continue into\nthe future. With this function, common time markers used are since andfor, or a period of time\nthat has not ended yet (this morning, all year, this week, this summer, etc.).\nSince is used with a specific time – since 1995, since Tuesday, since childhood\nFor is used with a duration of time – for 3 years, for 2 days, for a long time\nSome examples are:\n• I have been living in Barrie for 15 years.\n• Mary has been working at Georgian College since 2005.\n• Mariam has been teaching ESL for a long time.\n• Mustafa has been coming to class on time all semester.\n**This is the same function as the Present Perfect Tense, however do not use stative verbs in this\ntense. Use the Present Perfect Tense instead. Stative Verbs cannot be used in continuous tenses.\nCorrine has been knowing me since childhood.\nCorinne has known me since childhood.\nAs a review from Chapter 2, here are examples of stative verbs: 94 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\n“Stative Verbs” by Annapurna Madhuri, licensed under CC BY-NC-SA 4.0.\nActions that were ongoing in the past, but just recently finished\nPresent Perfect Continuous 2 Timeline by Virginia McHardy, licensed under CC BY 4.0.\nThese actions were happening in the past, but were recently completed. Usually there is evidence\nto support that the action just finished.\nSome examples are:\n• Have you been smoking? I can smell it on your breath.\n• My clothes are dirty because I have been painting all day.\n• Celina has been washing the dishes. Look at all the water on the floor! 10. THE PRESENT PERFECT CONTINUOUS TENSE | 95\nForm\nLet us now explore how the Present Perfect Continuous Tense is formed:\nAffirmative sentences: Subject + has\/have + been +verb + ing.\nSubject + + has\/have been + verb + ing.\nI have been studying.\nHe has been eating.\nShe has been watching.\nThey have been playing.\nNegative Sentences: Subject + has\/have + not+ + been + verb + ing\nSubject + has\/have + not + been + verb + ing.\nI have not (haven’t) been studying.\nShe has not (hasn’t) been waiting.\nLisa has not (hasn’t) been teaching.\nCorinne and Hannah have not (haven’t) been working.\nYes\/No Questions: Has\/Have+ subject + been + verb + ing?\nHas\/Have+ subject been + verb + ing? Short Answer\nHave I been helping? Yes, you have.\/No, you haven’t.\nHas Catherine been teaching? Yes, she has.\/No, she hasn’t.\nHave the children been working? Yes, they have.\/No, they haven’t.\nInformation Questions: Wh ? + has\/have + subject + been + verb + ing?\nbeen + verb +\nWh ? + has\/have + subject Answer\ning\nWhat have I been doing? You have been procrastinating.\nShe has been studying at Georgian\nWhere has she been studying?\nCollege.\nWhen have you been going there? I have been going there every Tuesday. 96 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\nSpelling Rules for Continuous Verbs by Virginia McHardy, licensed under CC BY 4.0.\nPresent Perfect Continuous Form and Function Review\nWatch this short video to review the function and form of Present Perfect Continuous. Pay\nattention to the contractions and their pronunciation, and don’t forget to do the practice activities\nat the end! Remember that the Present Perfect Continuous is also sometimes called the\nPresent Perfect Progressive.\nPresent Perfect Continuous Function and Form Interactive Video (Text Version)\nWatch the video Present Perfect Progressive – Grammar & Verb Tenses ( 5\nminutes)\nActivity source: “Present Perfect Continuous Function and Form Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. Video Source: Ellii (formerly ESL Library). (2020, September\n14). Present Perfect Progressive – Grammar & Verb Tenses [Video]. YouTube.\nhttps:\/\/www.youtube.com\/watch?v=iCzJN0g5NHQ 10. THE PRESENT PERFECT CONTINUOUS TENSE | 97\nThe Present Perfect vs The Present Perfect Continuous\nThe Present Perfect and Present Perfect Continuous are two tricky tenses to learn and use. This\nvideo compares these two tenses and when to use them. You will see examples using Present\nPerfect with stative verbs that are still true and including an amount of time, or with actions that\nhave ended at some point in the past, while comparing the use of Present Perfect Continuous for\naction verbs (non-stative verbs) that started in the past and continued until now or just now.\nWatch the video carefully, take notes, and don’t forget to pause and answer the questions!\nPresent Perfect vs Present Perfect Continuous (Text Version)\nWatch the video Explained! I have LIVED v I have been LIVING \/\/ Present Perfect\nv Present Perfect Continuous (11 minutes)\nPause at 2:18: Again, the present perfect connects the past to now either with time (today, this\nyear, ever) or with actions that affect the present.\nPause at 3:05: My whole life\n1. Pause at 6:50: Select all the stative verbs from the verbs below:\n• think • be • fall\n• believe • own • want\n• taste • say • change\n• look • hate • hope\n• listen • show • wish\n• see • understand • need\n• watch • touch • plan\n• hear • know 98 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\nSome Stative Verbs…\nPossession Sense Emotion Mental State Other\nhave hear love\/like know weigh\nown sound hate\/dislike believe owe\npossess smell adore disagree seem\nconsist see prefer agree fit\ncontain taste need recognize cost\n– – desire promise –\n– – wish understand –\n– – value mean –\n– – appreciate – –\n2. Pause at 8:02. True or false: These two sentences mean the same thing:\n1. I have lived in Amsterdam for many years.\n2. I have been living in Amsterdam for many years.\n3. Pause at 8:40. True or false: These two sentences mean the same thing:\n1. I have lived in Halifax.\n2. I have been living in Halifax.\n4. Pause at 9:20. Which action has ended?\na. I have lived in Seoul for 1 year.\nb. I have been living in Seoul for 1 year.\nc. I have lived in Seoul.\nPause at 9:24: So if we use the present perfect or the present perfect continuous with an amount\nof time, it means the action is still continuing. We can use ‘live’ and ‘work’ with both tenses and it\nmeans the same thing, but stative verbs must be used with present perfect only – they cannot be\ncontinuous.\n1\nCheck your answers\nActivity source: “Present Perfect vs Present Perfect Continuous Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. Video Source: English with Greg. (2021, March 19). EXPLAINED! I 10. THE PRESENT PERFECT CONTINUOUS TENSE | 99\nhave LIVED v I have been LIVING \/\/ Present Perfect v Present Perfect Continuous [Video]. YouTube.\nhttps:\/\/www.youtube.com\/watch?v=oLDpZ8W-P8Y\nPresent Perfect Continuous Function Practice\nPresent Perfect Continuous Function Practice (Text Version)\nRead each present perfect continuous sentence and guess the function. Turn the card to see the\nanswer. The functions you can choose from are:\n1. Actions that started in the past and continuing until now (and may continue into the future)\n2. Actions that were ongoing in the past but just recently finished (and with present evidence or\neffect)\n1. He’s been checking his email all morning.\n2. The car is all wet. It’s been raining.\n3. Cassandra has been working on her research for her Masters degree and now it’s finally\ndone!\n4. There’s no way I can let the dog inside the house like that! He’s been rolling around in fresh\nmud!\n5. Tyler hasn’t been studying at all this evening.\n6. Sarit has been working from home because she hasn’t been feeling well.\n2\nAnswers\nActivity source: “Present Perfect Continuous Form and Function Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. 100 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\nPresent Perfect Continuous Form Practice – Affirmative\nPresent Perfect Continuous Form Practice – Affirmative (Text Version)\nUsing the verb in brackets, fill in the blanks using the affirmative form of present perfect\ncontinuous. Spelling and punctuation count! You do not need to use the contraction, but if you do,\ngive yourself a point.\n1. His pants are so dirty. He ____________________ all day. (paint)\n2. Reza __________________ around doing errands all morning. (run)\n3. Yuki ____________________ for 3 hours. I hope she’s almost done. (bake)\n4. Sabrina and Junyoung _________________ classes regularly. (attend)\n5. We _________ this problem since 9am. Let’s take a break. (discuss)\n3\nCheck your answers\nActivity source: “Present Perfect Continuous Form Practice – Affirmative” by Sari Martin, licensed\nunder CC BY-NC SA 4.0.\nPresent Perfect Continuous Form Practice – Negative\nPresent Perfect Continuous Form Practice – Negative (Text Version)\nFill in the negative form of the tense Present Perfect Continuous. Use the verb in brackets. Spelling\nand punctuation count! USE THE CONTRACTION whenever possible.\n1. Leah ___________________ to work lately. (come)\n2. The students ___________________ high scores on their tests lately. (achieve)\n3. My mom and dad ________________ as much homemade food this month. They’ve been 10. THE PRESENT PERFECT CONTINUOUS TENSE | 101\nenjoying dining at restaurants. (make)\n4. The dog _________________ as much as he usually does. I wonder if she’s sick. (play)\n5. We ______________yet this month. We’ve been saving our money. (shop)\n4\nCheck your answers\nActivity source: “Present Perfect Continuous Form Practice – Negative” by Sari Martin, licensed\nunder CC BY-NC SA 4.0.\nPresent Perfect Continuous Form Practice – Interrogative\nPresent Perfect Continuous Form Practice – Interrogative 1 (Text version)\nPut the words in order to make a question using the Present Perfect Continuous. There is one extra\nword you don’t need. Put this extra word in the blank space at the end.\nthe\/been\/through\/flowed\/?\/water\/the\/has\/flowing\/dam\/\n5\nCheck your answer\nActivity source: “Present Perfect Continuous Form Practice – Interrogative 1” by Sari Martin,\nlicensed under CC BY-NC SA 4.0.\nPresent Perfect Continuous Form Practice – Interrogative 2 (Text version)\nPut the words in order to make a question using the Present Perfect Continuous. There is one extra\nword you don’t need. Put this extra word in the blank space at the end.\nstudying\/has\/textbooks\/been\/sisters\/this\/the\/?\/have\/their\/from\/week\n6\nCheck your answer\nActivity source: “Present Perfect Continuous Form Practice – Interrogative 2” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. 102 | 10. THE PRESENT PERFECT CONTINUOUS TENSE\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• I’ve Been Waiting for a Girl Like You by Foreigner\n• In View by The Tragically Hip\nCan you hear the Present Perfect Continuous Tense in the lyrics?\n“The Present\nPerfect\nContinuous\nTense Joke” by\nVirginia McHardy,\nlicensed under CC\nBY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Past Perfect Continuous Tense” by Sari Martin & Virginia McHardy is\nlicensed under CC BY-NC-SA 4.0.\nNotes\n1. 1. believe, taste, see, hear, be, own, know, hate, understand, want, wish, need.\n2. True.\n3. False.\n4. c) I have lived in Seoul.\n2. 1. Actions that started in the past and continuing until now (and may continue into the future)\n2. Actions that were ongoing in the past but just recently finished (and with present evidence or effect)\n3. Actions that were ongoing in the past but just recently finished (and with present evidence or effect)\n4. Actions that were ongoing in the past but just recently finished (and with present evidence or effect)\n5. Actions that started in the past and continuing until now (and may continue into the future) 10. THE PRESENT PERFECT CONTINUOUS TENSE | 103\n6. Actions that started in the past and continuing until now (and may continue into the future)\n3. 1. He has been painting all day.\n2. Reza has been running around doing errands all morning.\n3. Yuki has been baking for 3 hours.\n4. Sabrina and Junyoung have been attending classes regularly.\n5. We have been discussing this problem since 9am.\n4. 1. Leah hasn't been coming to work lately.\n2. The students haven't been achieving high scores on their tests lately.\n3. My mom and dad haven't been making as much homemade food this month. They've been enjoying dining at restaurants.\n4. The dog hasn't been playing as much as he usually does. I wonder if she's sick.\n5. We haven't been shopping yet this month. We've been saving our money.\n5. Has the water been flowing through the dam? flowed\n6. Have the sisters been studying from their textbooks this week? has 104 | 11. THE PAST PERFECT TENSE\n11. THE PAST PERFECT TENSE\nLearning Outcomes\nAfter completing Chapter 11, students will know how to:\n• use the functions of the Past Perfect Tense.\n• form the Past Perfect Tense in affirmative statements, negative statements and questions.\n• apply the Past Perfect Tense in various situations.\n• use appropriate time markers with the Present Perfect Tense and the Simple Past.\nFunctions of the Past Perfect Tense\nThe Past Perfect Tense is used for actions that finished before another past action.\nLet us discuss this in detail.\nThe Past Perfect is usually used together with the Simple Past Tense. We use the Past Perfect\nTense to describe the first action that happens The Simple Past Tense is used for the second past\naction. Notice the timeline below: 11. THE PAST PERFECT TENSE | 105\nPast Perfect Timeline by Virginia McHardy, licensed under CC BY 4.0.\nSome examples are:\n• I had visited my mother before I went for lunch.\n• Adlet had already finished breakfast when his friends invited him out to eat.\n• Alma had taught 3 classes by the time she got home.\nCommon Time Markers used with The Past Perfect Tense and the Simple Past:\n• when\n• by the time\n• before\nThe Past Perfect + (time marker) + The Simple Past\nI had played 3 games of tennis before my mom picked me up.\nThe students had finished their presentations when the bell rang.\nLaurentine had given her baby a bath by the time her husband got home.\n(Time Marker) + The Simple Past + , + The Past Perfect\nBefore my mom picked me up, I had played 3 games of tennis.\nWhen the bell rang, the students had finished their presentations.\nBy the time Laurentine’s husband got home, she had given her baby a bath.\n**With this function, we can also use similar time markers used with the Present Perfect Tense\n(see Chapter 9 ) such as already, yet, still, ever, and never.\nExamples:\nJason had already interviewed for 6 jobs before he was hired. 106 | 11. THE PAST PERFECT TENSE\nKaren hadn’t finished her dinner yet by the time her friends called on her.\nDaniel had never seen snow when he arrived in Canada.\nHad you ever done a presentation in English before this class?\nForms\nLet us now explore how the Past Perfect Tense is formed:\nAffirmative sentences: Subject + had + past participle\nSubject + + had + past participle\nI had studied…\nGaelle had eaten…\nAugusta had had…\nMary and Alma had finished…\nNegative Sentences: Subject + had + not+ past participle\nSubject + had+ not + past participle.\nI had not (hadn’t) taught…\nNebrass had not (hadn’t) laughed…\nAdlet had not (hadn’t) played…\nYou and Simon had not (hadn’t) gone… 11. THE PAST PERFECT TENSE | 107\nYes\/No Questions: Had + subject + past participle?\nHad+ subject + past participle? Short Answer\nHad she answered…? Yes, she had.\/No, she hadn’t.\nHad Stephen failed? Yes, he had.\/No, he hadn’t.\nHad the teachers slept? Yes, they had.\/No, they hadn’t.\nInformation Questions: Wh ? + had + subject + past participle?\nWh ? + had + subject past participle? Answer\nShe had cleaned the kitchen, mopped the\nWhat had Yumi done?\nfloors before lunchtime.\nWhere had they gone? They had gone to the dentist.\nI had lied when I saw you because I didn’t\nWhy had you lied?\nwant to get in trouble.\n***When the main verb is “have”, you will see the past participle “had” the same as the\nauxiliary verb. For example: I had had breakfast before I went to work.\n***See Chapter 13 for common past participles.\nPast Perfect Example Conversation and Practice\nWatch this cute cartoon that tells a story using a lot of past perfect. Remember to answer the\nquestions that appear!\nPast Perfect Example Conversation and Practice (Text Version)\nWatch Past Perfect Tense (7 mins) on YouTube and stop the video to answer the following\nquestions\n1. Pause at 0:33: Which action happened first – brushed teeth or used mouthwash? 108 | 11. THE PAST PERFECT TENSE\n2. Pause at 0:55: Which action happened first – used mouthwash or realized?\n3. Pause at 1:36: Which action happened first – meant to get it from the washer or mom put it\nin the dryer?\n4. Pause at 1:45: Which action happened first? – took it out of the dryer or it shrunk?\n5. Pause at 3:58: Which action happened first? – saw her or the waiting?\n1\nCheck your answers\nActivity source: “Past Perfect Conversation Example and Practice Interactive Video” by Sari\nMartin, licensed under CC BY-NC SA 4.0. Video Source: Easy English. (2020, March 25). Past\nPerfect Tense [Video]. YouTube. https:\/\/www.youtube.com\/watch?v=-TrE6VdtgLE\nPast Perfect Form Practice – Affirmative\nPast Perfect Form Practice – Affirmative (Text Version)\nFill in the blanks with past perfect OR simple past form of verbs given in the bracket. Take a hint\nfrom the signal words to use the appropriate form of verb tesne.\n1. Diego _______________ (type) all the letters before his boss _______________(come)\nback.\n2. By the time Aminah ________________ (reach) home, her kids\n_________________ (go) to play.\n3. The students ___________________ (complete) their assignment before they\n__________________ (submit) it.\n4. Tiago _________________ (finish) the housework when his wife _________________\n(arrive) home.\n5. The fire _________________ (start; already) when the residents ___________________\n(call) the fire department.\n6. When the bell ________________ (ring), I _______________________ (finish) 11. THE PAST PERFECT TENSE | 109\nmy paper.\n2\nCheck your answers\nActivity source: “Past Perfect – Signal Words” by Annapurna Madhuri, “Simple past, Past\ncontinous & Past perfect” In Effective English for Teachers by Annapurna Madhuri, edited by Sari\nMartin licensed under CC BY-NC SA 4.0. \/ Converted to Text and some examples edited and added.\nPast Perfect Form Practice – Negative\nPast Perfect Form Practice – Negative (Text Version)\nChange the following sentences into negative form. Use the contraction when possible.\nExample:\nAmir had finished his assignment before 8.00 PM.\nAmir hadn’t finished his assignment before 8:00 PM.\n1. I had eaten at that restaurant before last night.\n2. I had cleaned up the mess when my parents came.\n3. Adam had informed us about the project.\n4. Tatiana had applied for another job before quitting.\n5. I had visited that yoga center before.\n3\nCheck your answers\nActivity source: “Past Perfect Negative” by Annapurna Madhuri, from “Simple past, Past\ncontinous & Past perfect” In Effective English for Teachers by Annapurna Madhuri, edited by Sari\nMartin, licensed under CC BY-NC SA 4.0. \/ Converted to Text and some examples edited and added. 110 | 11. THE PAST PERFECT TENSE\nPast Perfect Form Practice – Interrogative\nPast Perfect Form Practice – Interrogative (Text Version)\nRewrite the sentence in the interrogative (question) form. Spelling and punctuation count!\nExample:\nHans hadn’t seen that famous movie before last night.\nAnswer: Had Hans seen that famous movie before last night?\n1. Anna and Max had travelled to Japan and Vietnam before returning home.\n2. Fatimah had locked her keys in her car.\n3. Despite going to the same school, Sasha and Louise had never met before.\n4. Kwandung had lent Haoyi a lot of money before he spent it.\n5. Stella had thrown out the store-bought meal before she finished it.\n4\nCheck your answers\nActivity source: “Past Perfect Form Practice – Interrogative” by Sari Martin, licensed under CC BY-\nNC SA 4.0.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following songs:\n• Goodbye My Lover by James Blunt\n• Somebody that I Used to Know by Goyte\nCan you hear the Past Perfect Tense in the lyrics? 11. THE PAST PERFECT TENSE | 111\n“The Past\nPerfect Tense\nJoke” by Virginia\nMcHardy, licensed\nunder CC BY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Past Perfect Tense” by Sari Martin & Virginia McHardy is licensed under\nCC BY-NC-SA 4.0.\nNotes\n1. 1. brushed teeth\n2. used mouthwash\n3. mom put it in the dryer\n4. the shirt shrunk\n5. the waiting\n2. 1. Diego had typed all the letters before his boss came back.\n2. By the time Aminah reached home, her kids had gone to play.\n3. The students had completed their assignments before they submitted it.\n4. Tiago had finished the housework when his wife arrived home.\n5. The fire had already started when the residents called the fire department.\n6. When the bell rang, I had finished my paper.\n3. 1. I hadn't eaten at that restaurant before last night.\n2. I hadn't cleaned up the mess when my parents came.\n3. Adam hadn't informed us about the project.\n4. Tatiana hadn't applied for another job before quitting.\n5. I hadn't visited that yoga center before.\n4. 1. Had Anna and Max travelled to Japan and Vietnam before returning home?\n2. Had Fatimah locked her keys in her car?\n3. Had Sasha and Louise met before despite going to the same school?\n4. Had Kwandung lent Haoyi a lot of money before he spent it?\n5. Had Stella thrown out the store-bought meal before she finished it? 112 | 12. THE PAST PERFECT CONTINUOUS TENSE\n12. THE PAST PERFECT CONTINUOUS\nTENSE\nLearning Outcomes\nAfter completing Chapter 12, students will know how to:\n• use the functions of the Past Perfect Continuous Tense.\n• form the Past Perfect Continuous Tense in affirmative statements, negative statements and\nquestions.\n• apply the Past Perfect Continuous Tense in various situations.\n• use the Past Perfect Continuous Tense with the Simple Past and appropriate time markers.\n• distinguish between stative verbs and continuous verbs.\n• use the correct spelling rules for continuous verbs.\nFunctions of the Past Perfect Tense\nThe Past Perfect Continuous Tense is used for actions that were ongoing up until another past\naction happened.\nLet us discuss this point in detail.\nThe Past Perfect Continuous is usually used together with the Simple Past Tense. We use the Past 12. THE PAST PERFECT CONTINUOUS TENSE | 113\nPerfect Continuous Tense to describe an action that was ongoing until another action happened.\nThe Simple Past Tense is used for the second past action. Notice the timeline below:\n“Past Perfect Continuous Timeline” by Virginia McHardy, licensed under CC BY 4.0.\nCommon Time Markers used with The Past Perfect Continuous Tense and the Simple Past (see\nChapter 11):\n• when\n• by the time\n• before\n• ***since and for are also used to show the length of the first action\nSome examples are:\n• I had been painting for three hours by the time the paint ran out.\n• Carolina had been doing her homework since 4pm when the power went out.\n• Hannah had been making dinner before her kids got home.\n**Just as a reminder, Stative Verbs cannot be used in continuous tenses.\nDonna had been knowing me since childhood when we stopped talking to each other.\nDonna had known me since childhood when we stopped talking to each other.\nAs a review from Chapter 2, here are examples of stative verbs: 114 | 12. THE PAST PERFECT CONTINUOUS TENSE\n“Stative Verbs” by Annapurna Madhuri, licensed under CC BY-NC-SA 4.0.\nForms of The Past Perfect Continuous Tense\nLet us now explore how the Past Perfect Continuous Tense is formed:\nAffirmative sentences: Subject + had + been +verb + ing.\nSubject + + had been + verb + ing.\nI had been studying.\nHe had been eating.\nShe had been watching.\nThey had been playing. 12. THE PAST PERFECT CONTINUOUS TENSE | 115\nNegative Sentences: Subject + had + not+ + been + verb + ing\nSubject + had+ not + been + verb + ing.\nI had not * been studying.\nShe had not been waiting.\nLisa had not been teaching.\nCorinne and Hannah had not been working.\n*had not = hadn’t\nYes\/No Questions: Had+ subject + been + verb + ing?\nHad+ subject been + verb + ing? Short Answer\nHad I been helping? Yes, you had.\/No, you hadn’t.\nHad Catherine been teaching? Yes, she had.\/No, she hadn’t.\nHad the children been working? Yes, they had.\/No, they hadn’t.\nInformation Questions: Wh- + had+ subject +been + verb + ing?\nWh ? + had + subject been + verb + ing Answer\nWhat had I been doing? You had been procrastinating by the time our mother got home.\nWhere had she been studying? She had been studying at Georgian College when she got a job.\nWhy had you been going there? I had been going there before classes to get help with grammar.\n“Spelling Rules for Continuous Verbs” by Virginia McHardy, licensed under CC BY 4.0. 116 | 12. THE PAST PERFECT CONTINUOUS TENSE\nPast Perfect Continuous – Some Uses and Comparisons\nPast Perfect Continuous can be a tricky tense to understand, especially because English has so\nmany past tenses that seem similar. In this video, the speaker, Greg, makes comparisons between\nthe Past Perfect Continuous, the Past Perfect, and the Past Continuous and some of their\ndifferences. Take notes if you need to and don’t forget to pause to answer the pop-up questions!\nPast Perfect Continuous – Some Uses and Comparisons (Text Version)\nWatch EXPLAINED! Past Continuous and Past Perfect Continuous Tenses (8 mins) on\nYouTube & pause to answer the questions.\n1. Pause at 3:27: Clarification: The rain didn’t stop falling from the sky when I left the house. It\ncontinued. Past Continuous shows two closely connected actions: (one long, continuous one)\nand one short one that ends the continuous one, or happens during the ongoing action.\n2. Pause at 3:54: Past Perfect Continuous IS NOT closely related to the second action. They do\nnot connect, crossover, or happen at the same time (but only when there’s no time clause\/\ntime marker)\n3. Pause at 5:21: Remember: an amount of time, like 2 hours, is a completed amount, which is\nwhy we use the Past Perfect Continuous when followed by a short action.\n4. Pause at 6:33: Is the following statement correct? I was eating my dinner for 1 hour when I\nchoked on broccoli.\n5. Pause at 7:12: Which action was NOT completed when the phone rang?\na. I was studying all night last night when the phone rang.\nb. I had been studying for 4 hours last night when the phone rang.\nc. I had studied all night last night when the phone rang.\nd. I had been studying all night last night when the phone rang.\n6. Pause at 7:19: Which action happened closer in time to the second action “before we\nwatched a movie”?\na. We had been painting the walls before we watched a movie.\nb. We had painted the walls yesterday before we watched a movie.\nc. We had been painting the walls for 2 hours before we watched a movie. 12. THE PAST PERFECT CONTINUOUS TENSE | 117\n1\nCheck your answers\nActivity source: “Past Perfect Continuous – Some Uses Interactive Video” by Sari Martin, licensed\nunder CC BY-NC SA 4.0. Video Source: English with Greg. (2020, September 25). Explained! Past\nContinuous and Past Perfect Continuous Tenses [Video]. YouTube. https:\/\/www.youtube.com\/\nwatch?v=N2aXMCv1-WM\nPast Perfect Continuous – A Sample Conversation\nWatch this dramatic cartoon conversation about love and dating, and especially focus on the Past\nPerfect Continuous examples!\nActivity source: “Present Perfect Continuous Function and Form Interactive Video” by Sari Martin,\nlicensed under CC BY-NC SA 4.0. Video Source: Easy English. (2020, September 23). We’d been\nhoping for a romantic trip – Past Perfect Continuous [Video]. YouTube. https:\/\/www.youtube.com\/\nwatch?v=qvIZ204JorM\nPast Perfect Continuous Form Practice – Affirmative\nPast Perfect Continuous Form Practice – Affirmative (Text Version)\nFill in the missing words using affirmative past perfect continuous and the verb in brackets. Spelling\nand punctuation count! 118 | 12. THE PAST PERFECT CONTINUOUS TENSE\n1. I _________________ all day so I didn’t want to go out. (work)\n2. Ayo __________________ for 10 hours when I woke him up. (sleep)\n3. Dimitri and Athena ________________ in Beijing for 3 years when he lost his job. (live)\n4. We felt a bit ill because we _________________ all day. (eat)\n5. It _______________ as the road was covered in water. (rain)\n6. It _______________ for 3 days. (snow)\n2\nCheck your answers\nActivity source: “Past Perfect Continuous Form Practice – Affirmative”, by Sari Martin, licensed\nunder CC BY-NC SA 4.0.\nPast Perfect Continuous Form Practice – Negative\nPast Perfect Continuous Form Practice – Negative (Text Version)\nFill in the missing words using the negative form of Past Perfect Continuous and the verb in\nbrackets. Use the contraction when possible. Spelling and punctuation count!\n1. I ___________________ there long when Minh quit. (work)\n2. Even though JinAe __________________ anything, she was still too tired to go out. (do)\n3. Hussein was in trouble with the teacher because he ________________ to classes. (go)\n4. Rania _________________ long when there was a knock at the door. (sleep)\n5. Ravi didn’t feel healthy because he ______________ to the gym. (go)\n3\nCheck your answers\nActivity source: “Past Perfect Continuous Form Practice – Negative” by Sari Martin, licensed under\nCC BY-NC SA 4.0. 12. THE PAST PERFECT CONTINUOUS TENSE | 119\nPast Perfect Continuous Form Practice – Interrogative\nPast Perfect Continuous Form Practice – Interrogative (Text Version)\nFill in the missing words by forming the interrogative form of Past Perfect Continuous using the\nverb and subject in brackets. Spelling and punctuation count!\n1. When you got sick, __________________ enough? (you\/eat)\n2. There was water everywhere inside. What ___________________ ? (the children\/do)\n3. _____________________ when you left the restaurant? (it\/rain)\n4. How long ___________________ in Brazil when she found that job? (Julia\/live)\n5. How long _______________ when the bus finally arrived? (we\/wait)\n4\nCheck your answers\nActivity source: “Past Perfect Continuous Form Practice – Interrogative” by Sari Martin, licensed\nunder CC BY-NC SA 4.0.\nVerb Tenses in Music\nFor a fun activity, search the web and find the following song:\n• I’ll Never Forget You by Birdy\nCan you hear the Past Perfect Continuous Tense in the lyrics? 120 | 12. THE PAST PERFECT CONTINUOUS TENSE\n“The Past\nPerfect\nContinuous\nTense Joke” by\nVirginia McHardy,\nlicensed under CC\nBY 4.0.\nAttribution & References\nExcept where otherwise noted, “The Past Perfect Continuous Tense” by Sari Martin & Virginia McHardy is\nlicensed under CC BY-NC-SA 4.0.\nNotes\n1. 4. False. \"One hour\" is a COMPLETED amount of time, so we cannot use Past Continuous. Past Continuous actions are not completed\nactions when followed by Simple Past. Only Past Perfect Continuous are completed actions followed by Simple Past.\n5. (a) I was studying all night last night when the phone rang.\n6. (c) We had been painting the walls for 2 hours before we watched a movie.\n2. 1. I had been working all day so I didn't want to go out.\n2. Ayo had been sleeping for 10 hours when I woke him up.\n3. Dimitri and Athena had been living in Beijing for 3 years when he lost his job.\n4. We felt a bit ill because we had been eating all day.\n5. It had been raining as the road was covered in water.\n6. It had been snowing for 3 days.\n3. 1. I hadn't been working there long when Minh quit.\n2. Even though JinAe hadn't been doing anything, she was still too tired to go out.\n3. Hussein was in trouble with the teacher because he hadn't been going to class.\n4. Rania hadn't been sleeping long when there was a knock at the door.\n5. Ravi didn't feel healthy because he hadn't been going to the gym.\n4. 1. When you got sick, had you been eating enough?\n2. There was water everywhere inside. What had the children been doing?\n3. Had it been raining when you left the restaurant?\n4. How long had Julia been living in Brazil when she found that job?\n5. How long had we been waiting when the bus finally arrived? 13. PAST PARTICIPLE FORMS | 121\n13. PAST PARTICIPLE FORMS\nPast Participle Forms of Verbs\nThe table given below shows the past tense form as well as the past participle form of commonly\nused irregular verbs. 122 | 13. PAST PARTICIPLE FORMS\nIrregular verbs\nBase Verb Past Tense Past Participle\nbe (is\/am\/are) was\/were been\nbeat beat beaten\nbecome became become\nbegin began begun\nbend bent bent\nbite bit bit\/bitten\nblow blew blown\nbreak broke broken\nbring brought brought\nbuild built built\nbuy bought bought\ncatch caught caught\nchoose chose chosen\ncome came come\ncost cost cost\ncut cut cut\ndig dug dug 13. PAST PARTICIPLE FORMS | 123\nBase Verb Past Tense Past Participle\ndo did done\ndraw drew drawn\ndream dreamt dreamt\ndrink drank drunk\ndrive drove driven\neat ate eaten\nfall fell fallen\nfeel felt felt\nfight fought fought\nfind found found\nfly flew flown\nforget forgot forgotten\nfreeze froze frozen\nget got got\/gotten\ngive gave given\ngo went gone 124 | 13. PAST PARTICIPLE FORMS\nBase Verb Past Tense Past Participle\ngrow grew grown\nhave had had\nhear heard heard\nhide hid hidden\nhit hit hit\nhold held held\nkeep kept kept\nknow knew known\nlay laid laid\nlead led led\nlearn learnt\/learned learnt\/learned\nleave left left\nlet let let\nlie lay lain\nlose lost lost\nmake made made\nmean meant meant\nmeet met met 13. PAST PARTICIPLE FORMS | 125\nBase Verb Past Tense Past Participle\npay paid paid\nput put put\nread read read\nride rode ridden\nring rang rung\nrise rose risen\nrun ran run\nsay said said\nsee saw seen\nsell sold sold\nsend sent sent\nshake shook shaken\nshine shone shone\nshoot shot shot\nshow showed shown\/showed\nsing sang sung\nsink sank sunk 126 | 13. PAST PARTICIPLE FORMS\nBase Verb Past Tense Past Participle\nsit sat sat\nsleep slept slept\nspeak spoke spoken\nspell spelt\/spelled spelt\/spelled\nspend spent spent\nspill spilt\/spilled spilt\/spilled\nstand stood stood\nsteal stole stolen\nstick stuck stuck\nswim swam swum\ntake took taken\nteach taught taught\ntear tore torn\ntell told told\nthink thought thought\nthrow threw thrown 13. PAST PARTICIPLE FORMS | 127\nBase Verb Past Tense Past Participle\nunderstand understood understood\nwake woke woken\nwear wore worn\nwin won won\nwrite wrote written\nAttributions\nExcept where otherwise noted, this chapter is adapted from “11 Past participle forms” In Effective English for\nTeachers by Annapurna Madhuri, licensed under CC BY-NC-SA 4.0. \/ List of terms is reused and expanded\nfrom the original version. "}