{
    "text": "24.900 Fall 2012 lecture notes\nWhat is Innate (in this domain):\nMorphology Drive to analyze speech into words.\n1 Why morphology matters? What is Learned (in this domain):\nWhat the words actually are.\nInnate bias for words\n• If it is true that words are not marked in the physical stream of speech, two questions: Morpheme: the minimal subpart of a word that expresses a meaning (or grammatical\nproperty)\n• Why did our brains in childhood (infancy) go to the trouble of working out\nhow to parse the speech stream into words? Example: dogs contains two morphemes:\ndogs = dog 'furry beast' + s 'plura\n• Why do our brains now go to the trouble of segmenting the speech stream\ndogs ≠ d 'furry' + og 'beast' + s 'plural'\ninto words?\n• Why is the nature of the analysis so nearly identical across languages?\n2 How we learn words and morphemes\n• To question 1: One can give a functional explanation for the existence of words.\nRapidly!\n• It is advantageous to construct a flexible communication system out of a\nsmallish set of units, combined and recombined. • First words appear around age 1. (One-word stage.)\nKeeps memory use under control. Kids already know more than they say:\nAllows novel utterances. • In 11-month old, selective looking reveals preference for pauses that coincide\nwith word boundaries over pauses inserted between syllables of words.\n• But does this tell us how or why the baby acquires the words? Does she do • In 9-month old, no preference.\na little communication theory and decide that speech must contain words?\nProbably not. So what happened between 9 and 11?\nHow do you segment speech into words if you don't know the words?\n• Answer is an innate bias to perform some sort of analysis of speech No magic bullet, it seems! Part of the story must be a statistical analysis of input\n(explaining 1 and 2), and probably innate knowledge of what the product data carried out by the child — and there are explicit proposals about this.\nof this analysis will look like (explaining 3).\nBut a deeper question remains: Why does the baby perform this statistical analysis\nperformed, and why are the results saved in memory (ultimately, in the lexicon)?\nArbitrariness\n• But remember:\nAn approach to an answer:\nThe words themselves are not innately specified, or else they would not\nAn instinct for language acquistion.\ndiffer from speech community to speech community (arbitrariness).\nInnate knowledge coupled with environment-dependent learning.\n• Arbitratriness pervades language...\nEnglish dog, French chien, Russian sobaka...\n• ...even in \"onomatopoeia\" — how we represent animal sounds linguistically is fixed:1\n3 The knowledge underlying use of a complex word\ncow: Dutch boeh, Hungarian bú, Thai maw maw (with mid tone), Bengali hamba\ndog: Russian gav-gav, Catalan bup-bup, Indonesian gong-gong\n• Productivity of morphology:\n(1) industry, industrial, industrialize, industrialization., industrializational,\nindustrializationalize, industrializationalization, ...\n1 http://en.wikipedia.org/wiki/Cross-linguistic_onomatopoeias#Animal_sounds -2-\n• There is no termination to the process, except that the words become too long and their\nmeanings too complex to keep track of all the morphemes. Because the real poem truly is written in English (because its closed-class items are\nEnglish), the notion \"translating Jabberwocky\" into a foreign language is a meaningful\none, and lots of translations have been made.\n• An interesting difference between words and sentences: We have no problem parsing\nsentences with as many words as industrializationalization has morphemes (7 of\nthem!) -- compare even the process of turning a question about something else into a\nquestion about industrialization, which has the same meaning but 14 words! The\n• free vs. bound ≠ open vs. closed class\nmulti-word phrase is much easier to understand than the multi-morpheme word. We\nare not as good at parsing words as we are at parsing sentences.\n• For example:\nThere are free closed-class morphemes (prepositions, pronouns, articles...)\nThere are bound open-class morphemes (un+kempt, sanit+ize)\n• Distinctions: bound morpheme vs. free morpheme / open-class vs. closed-class\nIndustry is a word on its own. free morpheme\n-ize, -al, and -ation are not. bound morpheme\n4 How to build a morphologically complex word: the rule Merge\n• The free morpheme industry belongs to an open class of lexical items, an extendible\nclass of items with a wide range of meanings. You can make up new ones, and are not You have to start somewhere!\nsurprised to learn new ones even in adulthood: screeve, Obama, cromulent.\nStep 0:\n• The opposite of \"open class\" is \"closed class\" (also known as \"function words\").\n• Take a morpheme from the lexicon whose lexical entry does not say \"I am a\nsuffix\" or \"I am a prefix\"... This starting point, which (as the textbook says)\nSince open class items can be coined at will (more or less), it is really the closed-class carries \"the main meaning of the sentence\", is the called root.\nitems that identify the language — that make English English, make French French etc.\nLewis Carroll's poem Jabberwocky contains lots of unfamiliar (\"nonsense\") open-class • Putting aside a special kind of complex word called a compound (to which\nitems, but all its closed-class items — all its function words — are English. Crazy though we return next week) — if there's a free morpheme in the word, it's the root.\nthe poem may sound, it is clearly a poem written in English!\nStep 1:\n’Twas brillig, and the slithy toves\nDid gyre and gimble in the wabe;\n• A morphological rule that we can call \"Merge\" takes an appropriate\nAll mimsy were the borogoves,\nmorpheme from the lexicon and glues it to the root. (We return soon to\nAnd the mome raths outgrabe.\nwhat we mean by \"appropriate\".)\nCompare a version in which the open-class words are replaced with normal English, but • A non-root morpheme in a word is called an affix. So morphologically\ncomplex words are made up of a root and some number of affixes.\nthe function words are replaced with \"non-sense\". It no longer looks like English:\nGlorm cloudy, yurk lim noisy frogs\nRur croak yurk fidget uf lim lake;\nCaj nervous trid lim hunting dogs,\nYurk lim hungry cats lay awake.\nOr worse, replace both function words and open-class items with made-up words:\nGlorm brillig, yurk lim slithnit tovem\nRur gyre yurk gimble uf lim wabe;\nCaj mimsnit trid lim borogovem,\nYurk lim mome rathem nusgrabe. -3-\nThe lexical entry for each morpheme specifies • An argument against this: find a prefix that makes a noun (or adjective) into a verb!\n1. its sound The prefix en- (sometimes em-) forms verbs out of nouns (and adjectives):\n2. its meaning\n3. whether it is a root or affix body --> embody\n4. its part-of-speech (category): N, V, A... trance --> entrance\n5. if it is an affix, the part of speech it merges with: power --> empower\n6. if it is an affix, its place of attachment:\na. left edge (prefix) Now notice that these verbs can take the suffix -ment. Even though the morpheme next to\nb. right edge (suffix) -ment is not a verb morpheme, structurally -ment is being added to a verb.\n[c. after the first syllable, before the last syllable, before the main stress...\n(infix)]2\n6 \"Sound\" in more detail\nStep 2:\n• The output of step 2 can undergo Merge again. Another affix can be attached to it.\n• Whether a morpheme even has a sound is arbitrary.\n• The element to which an affix attaches (whether a root or a morphologically\ncomplex word) is called its base.\nIn English, the fact that a noun is singular is not represented by an overt morpheme\n• When an affix attaches to the root, the root is also its base. But when an affix (one can say there is a zero morpheme) — though plural is a morpheme with a sound\nattaches to a an already complex form, its base is not the root. of its own (dog vs. dog-s).\n• Some morphemes that do have a sound do not have a sound of their own. Their sound\n5 Trees\nis a copy of sounds already present in the base. This is called reduplication:\nExample 1: Lakhota (Siouan, S. Dakota)\n• A tree diagram can illustrate the internal structure of a word, and reflects how it was\nformed by one or more operations of Merge.\nsg inanimate pl\ngí gigí 'to be rusty brown'\n[see the textbook for lots of actual trees]\nská skaská 'to be white'\nʃá ʃaʃá 'to be red'\n• Words really are trees (structures) -- not just strings of morphemes\nthó thothó 'to be blue or green'\nʒí ʒiʒí 'to be yellow'\nFor example ...\nthe suffix -ment attaches to a verb and produces a noun:\nSound: Copy first CV of the base.\ngovern government\nExample 2: Ilocano (Austronesian, Phillippines)\nadjourn adjournment\nsg plural\ntreat treatment\npíŋgan piŋpíŋgan 'dish'\namuse amusement\ntálon taltálon 'field'\ndálon daldálon 'road'\nbody —X→ *bodiment\nbíag bibíag 'lives'\ntrance —X→ *trancement\nnuáŋ nunuáŋ 'carabao'\npower —X→ *powerment\núlo ulúlo 'head'\nmúla mumúla 'plant'\n• You might say: \"the morpheme next to -ment must be a verb\" as an alternative to \"the\ntáwa tawtáwa 'window'\nbase to which -ment attaches must be a verb\".\n2 Discussed below. -4-\nExample 3: Latin forms of the verb meaning 'love'\n• In the lexical entry for plural, under the heading \"sound\", it says not -ness, or un-, but:\npresent past future\n\"Copy first (C)V(C) of the base.\"\nyou (sg)... ama-s ama-ba-s ama-bi-s\n[C = consonant, V = vowel, parentheses = \"if present...\")\nshe/he/it... ama-t ama-ba-t ama-bi-t\n• Reduplication is extremely common in languages of the Austronesian group we... ama-mus ama-ba-mus ama-bi-mus\n(Phillipines, Malaysia, Indonesia)\nyou (pl.) ama-tis ama-ba-tis ama-bi-tis\nbut:\nI ... am-(a)-o ama-ba-m ama-b(i)-o\n7 Allomorphs\nthey ... ama-nt amaba-nt ama-bu-nt\n• Sometimes the sound of a morpheme depends on the base to which it is attached, but is The underlined bits are unexpected, and show allomorphs of the suffixes visible elsewhere\nnot a copy of that base. Such a morpheme will have different arbitrary (i.e. not in the chart.\ncopied) sounds depending on the base to which it attaches. These variants are called\nallomorphs.\n8 \"Place\" in more detail\nExample 1: English plural depends on the identity of the base to which it attaches.\ndog-s, cat-s, horse-s Point 1: The place of attachment must be listed in the lexicon, because it's arbitrary.\nbut...\nox-en • For example, whether a morpheme with a particular affix is a prefix or a suffix\nchild-ren varies across languages.\nsheep-ø, deer-ø\nExample 1: Russian vs. Bulgarian comparative and superlative affixes.\nNote that the -s plural is productive. It is the default plural marker which we\napply in the absence of special knowledge about an irregular plural marker. [I think I didn't do this one in class, but here it is anyway]\nWhat is the plural of wug? Bulgarian: smešna / po-smešna umna / po-umna\nRussian: smešna / smešn-ee umna / umn-ee3\nThe situation is more complicated still: the default affix is -z, which regular 'funny' / 'funnier' 'smart' / 'smarter'\nphonology changes to /s/ for reasons we will discuss later. But after -s, -z, -ch, -sh,\n-j we get a vowel as well. This is more allomorphy... Example 2: The affix meaning (roughly) -ness is a prefix in Kanuri, but a suffix (as in\nEnglish) in Kurdish. It's also worth noting that English -ness attaches only\nWhat is the plural of gruss? (mostly) to adjectives, while its Kurdish cousin also attaches to nouns\nSometimes the plural involves a change of vowel: mouse/mice, woman/women. Kanuri (Nilo-Saharan, Nigeria)\nExample 2: English past tense: gana 'small' nəәmgana 'smallness'\nkura 'big' nəәmkura 'bigness'\nDefault is -d, but here too we have vowel changes, and sometimes both: kurugu 'long' nəәmkurugu 'length'\nkarite 'excellent' nəәmkarite 'excellence'\nwalk/walked, industrialize/industrialized dibi 'bad' nəәmdibi 'badness'\nrun/ran, sing/sang, lead/led, strive/strove\nsleep/slept\n3 Ignore for present purposes the -a of umna, which is a morpheme marking it as a\nfeminine adjective of a particular sort. -5-\nKurdish (Indo-Iranian, Iraq) (2) fuckin'-infixation\nInfix fuckin' to the left of the syllable that bears main stress.\naaqil 'wise' aaqilii 'forethought'\ndiz 'robber' dizii 'robbery' Thus:\ndraiʒ 'long' draiʒii 'length' (3) a. Massa-fuckin'-chusetts\nzaanaa 'wise' zaanaaii 'erudition' but not : b. *Massachu-fuckin's setts.\ngarm 'warm' garmii 'warmth'\n— because the syllable -chu- bears the main stress. Likewise:\nWe know: prefix (attach to left edge of base), suffix (attach to right edge of base)\n(4) a. Conn-fuckin'-ecticut\n[it helps to pause after the first syllable, or to draw it out]\n• Now: Infix! Attach inside the base, according to a rule that refers to the base's sound\nbut not: b. *Connect-fuckin'-icut.\nstructure.\nnor: c. *Connecti-fuckin'-cut.\nExample 1: Bontoc (Austronesian, Philippines)\n• This example shows that the rule does involve stress, and not counting syllables from\nThe infix -um- is positioned following the initial consonant of the base.\nthe end. since the stress in Connecticut falls on the third syllable from the end (the\n'he is becoming ...' antepenult), while the stress in Massachusetts falls on the next-to-last syllable (the\nfikas fumikas 'strong' penult), as we've seen.\nkilad kumilad 'red'\nbato bumato 'stone' (5) un-fuckin'-believable\nfusul fumusul 'enemy'\n• What is especially worth noting about the whole phenomenon is that it really is rule-\nExample 2: Samoan (Austronesian, Samoa) governed! We have clear intuitions about good vs. bad places to infix fuckin' within\nThis example is interesting because it is also reduplication: bases to which we have surely never heard this infixation rule applied.\n\"copy penultimate syllable and position it next to the original\"\n'he ...' 'they ...' • People sometimes think that parental input and correction is a key to language\nmanao mananao 'wish' acquisition. Pretty unlikely here: (\"No my little sweetheart, you know we don't say\nmatua matutua 'be old' Massachu-fuckin'-setts. Say it properly, or you can't have dessert: Massa-fuckin'-\nmalosi malolosi 'be strong' chusetts. Very good!\").\npunou punonou 'bend'\nsavali savavali 'travel'\npese pepese 'sing' 9 Multiple affixes\nlaga lalaga 'weave'\natamaʔi atamamaʔi 'be wise'\n• In many languages, verbs or nouns bear a whole group of affixes. Often these affixes\ngalue galulue 'work'\nmark agreement: they represent properties like \"plural\" or \"3rd person\" that have no\naloga alologa 'love'\nmeaning on the verb, but agree with a plural or 3rd person word or phrase somewhere\nIn these cases, the morpheme is attached in the middle of the sounds belonging to another else in the sentence.\nmorpheme. This type of affixation is called infixation.\n• These agreement affixes often make it possible to leave out the plural or 3rd person\nExample 3: fuckin' infixation (fan-fuckin'-tastic, Massa-fuckin'-chusetts, Missi-fuckin'- words, and just use a verb to express thoughts like \"we saw him\".\nssippi)4\n• Languages with complex morphology of this sort present nice puzzles that will plague\n• The infixation of fuckin', which denotes a strong positive or negative attitude, appears your problem sets and exams in this class!\nto be determined by stress (accent). A first approximation at the correct rule is:\n4 In British, Irish, Australian and New Zealand English, bloody can be used, and appears to\nfollow exactly the same rule: Massa-bloody-chusetts, *Massachu-bloody-setts, etc. MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
}