{
    "text": "24.900 2012\n(cid:36)(cid:70)(cid:84)(cid:88)(cid:76)(cid:86)(cid:76)(cid:87) (cid:76)(cid:82)(cid:81)(cid:3)(cid:82)(cid:73)(cid:3)(cid:54)(cid:92)(cid:81)(cid:87)(cid:68) (cid:91)(cid:3)(cid:86)(cid:88)(cid:80)(cid:80)(cid:68)(cid:85) (cid:92) Yes!— a behaviorist view: \"In teaching the young child to talk, the formal\nspecifications upon which reinforcement is contingent are at first greatly relaxed.\nPoints of interest not covered in class (for reasons of time) are in gray.\nAny response which vaguely resembles the standard behavior of the community is\n1. Overview of language acquisition reinforced. When these begin to appear frequently, a closer approximation is\ninsisted upon. In this manner very complex verbal forms may be reached.\"\nProduction\n-B.F. Skinner (1957) Verbal Behavior, pp. 30-31\n§ Babbling: 6-12 months (roughly)\n§ 1-word: 1 yr - 1.5 years No! — Chomsky's famous reply: \"It is simply not true that children can learn\n§ 2-word: 1.5 years -2 years* language only through 'meticulous care' on the part of adults who shape their\n§ telegraphic: 2 years - 2.5 verbal repertoire through careful differential reinforcement, though it may be that\n§ approaching adult-like: 2.5- such care is often the custom in academic families. It is a common observation\nthat a young child of immigrant parents may learn a second language in the\nstreets, from other children, with amazing rapidity, and that his speech may be\n*vocabulary spurt! 5-9 new words a day until 6 years old! An average\ncompletely fluent and correct to the last allophone, while the subtleties that become\nAmerican high school senior has been estimated to know about 45,000 second nature to the child may elude his parents despite high motivation and\nwords.1 continued practice.\"\n-N. Chomsky, 1957 review of Skinner's Verbal Behavior\n-->There is no 3-word stage!\n§ Implicit instruction -- motherese?\nChildren whose mothers use Motherese more consistently don't pass through the\nPerception/comprehension always ahead of of production.\nmilestones of language development any faster (Newport, et al, 1977).\n§ For example, detectable sensitivity to words and word boundaries from about 10\nmonths. First words appear 1-2 months later. Societies differ in use of Motherese.\n§ Detectable sensitivity to functional categories in 10-11 month-olds, missing from Warlpiri (central Australia): don't talk to someone who can't talk back.\nproduction in the second year (work of LouAnn Gerken). For example:\nRecall our discussion of fuckin' infixation: those rules are not explicitly taught by\nloving parents intent on making sure their children don't say *Massachu-fuckin'-setts\nCritical period: Natural language acquisition process turns off...\ninstead of the wonderfully correct Massa-fuckin'-chusetts!\n§ Acquisition =\n2. Do parents teach children how to speak? — the central puzzle of language\nUniversal Grammar (UG) + Experience\nacquisition\nJust as some languages don't occur, some errors are not made by children.\n§ The puzzle:2 How does the child learn language so quickly, given the complexity of Actually, experience may be overrated as well. Google for discussions of spontaneous\nthe system and the limited and faulty input. sign-language creation by children raised without adult sign speakers (so-called \"home\nsign\"), and the story of Nicaraguan Sign language.\n§ Language surrounding the child is error-full, not designed to accomodate the needs of a\nlanguage learner: no word boundaries, no morpheme boundaries, no trees ... Of course social interaction plays some role in language acquisition. Severe\ndeprivation during the critical period impairs language acquisition.\nAnswers\n§ Perception and comprehension always away ahead of production.\n§ Deliberate instruction (behaviorism): rewards and punishments?\nFor example, detectable sensitivity to words and word boundaries appears about 10\nmonths — but the first produced words appear 1-2 months later.\nDetectable sensitivity to functional categories at 10-11 months — but missing from\n1 Take such numbers with a grain of salt, since the figure includes many morphologically complex words, production in the second year.\nand does not include many morphologically complex words that the average high-school senior easily coins\nand comprehends on the fly. The main point is that the average senior knows lots and lots of words. Skinner, B. F. Verbal Behavior. Copley Publishing Group, 1992.\n2 T o m y s h o c k and horror, I realize that I did not mention in class Chomsky's cute term for ths issue: © Copley Publishing Group. All rights reserved. This content is excluded from our\n\"Plato's Problem\", i.e. how we as humans know so much on the basis of so little information from the Creative Commons license. For more information, see http://ocw.mit.edu/fairuse.\noutside world. Every time I have taught 24.900 in the past, I have not neglected this term, and it has always\nbeen a final exam question too! Shame on me ... but to reward those of you who are reading this footnote, it\nChomsky, Noam. \"A Review of B.F.Skinner's Verbal Behavior .\" Language 35, no. 1 (1959): 26-58.\nmight be on this year's final exam nonetheless.\n© Linguistic Society of America. All rights reserved. This content is excluded from our\nCreative Commons license. For more information, see http://ocw.mit.edu/fairuse. -2-\n3. Phonetics § Children with tracheostomy surgery that eliminates vocal production do not hear\nthemselves babble. When the tracheostomy hole is closed, there are some delays in\n§ Discussed earlier in the course. Infants discriminate the sounds of speech categorially, speech, but they quickly jump to age-appropriate behavior, skipping various stages.\nin an adult-like manner, even when the distinctions lie at arbitrary points along an\nacoustic continuum. Conclusion: Babbling is linguistic (not motoric) — but it is not \"practice\" essential\nfor language acquisition. It is a by-product of the process of language acquisition, not\n§ Distinctions not used in the target language are lost (more accurately: suppressed in an essential building block.\nsome fashion) during the first year of life. See below.\nPerception: During first year, child stops discriminating certain distinctions that are\nnon-phonemic in his/her target language. This parallels the refinement of\n4. Phonology sounds produced in babbling that approximates the target language.\n§ First words/Production: Not all contrasts made, much individual variation in order\nChild's tasks:\nwith which contrasts appear in production (e.g. alveolar/velar then labial).\n§ determine the phonemic inventory (underlying segments) of the language\n§ build the phonological part of the lexicon (underlying representations)\nFor example, a typical development of contrasts:\n§ determine the rule system that relates underlying representations to surface forms\nstage 1: p t-k\nstage 2: p t k\nstage 3: voicing\nDetermining phonemic inventory\nstage 4: nasal\nProduction: 4-5 months, some speech sounds.\nPerception/knowledge lags behind production:\n6-7 months - \"canonical babbling\" begins.\n§ Children know the contrasts that they do not produce/\nBabbling initially contains a wide repertory of speech sounds, and finally zeroes in on the\nspeech sounds of the target language.\n§ Also, numerous observations that children do not recognize words produced with\nthe very phonetic changes they put in them. A child who says sip for ship will not\n§ Around 8-10 months, adults can recognize the target language of a babbling child\nidentify a sip as something you sail in.\n(French, Cantonese, Arabic). By 6 months, Chinese children's babbling contains more\ntonal variation than the babbling of an American child.\n§ Deaf children babble vocally as well, though naturally there's no gradual\napproximation to a target language.\n§ Also: gestures analogous to babbling are noted in deaf children learning ASL.\nConclusion: inner biological clock governs onset of babbling; this clock is unaware of\nchild's deafness.\n§ Just as spoken language babbling shows properties of the language being acquired, so\ndoes sign language babbling.\nLaura Pettito's work: Hearing children who are acquiring sign (deaf parents) babble\nmanually. You can see the video clip from class, along with a fuller description of this\nwork, at http://petitto.gallaudet.edu/%7Epetitto/archive/nature.html. The other\nmaterials on Pettito's website are worth reading as well. -3-\nUnderlying representations/rule system Prosodic bootstrapping:\nSome common, but not universal phonological phenomena respect word boundaries.\n(1) A Japanese child's phonology\n§ For example, in French, the final a of panorama is longer than the first a of\nAge 3;2: substitutes [t] for [k] — but phonological rules that apply to adult [t] only\nmatimaticien. 3-day old infants can distinguish ma-ti from panorama typique from\napply to those [t]'s that really are [t]'s for the adult.\nma-ti out of matematricien. So the information, if relevant to guessing word\nboundaries, is perceived... [Mehler et al -- this is a sucking/habituation experiment]\nchild adult comment meaning\nmitaŋ mikan adult [k]->child [t] 'orange'\n§ Also, typical stress patterns get noticed. Czech - initial / French - final / Polish -\npotetto poketto 'pocket'\npenultimate. English: 90% of nouns have stressed initial syllables. If a child\nneto neko 'cat'\nanticipates this sort of regularity, it at least narrows hypotheses... In a 1993 study\ntama tama adult [t] stays [t] 'ball'\nby Juszyk, Cutler and Redanz, 9-month old American infants listened longer to\nterebi terebi 'TV'\nwords with initial stress than to other words. No such difference among 6-month\ntobɯ tobɯ 'fly' olds.\nmatʃi matʃi t→tʃ /__i 'city'\ntsɯta tsɯta t→ts/__ɯ 'ivy' § Maybe these features are exaggerated in production by parents (motherese)?\nStatistical bootstrapping\nThese rules do not apply to child's [t] that corresponds to adult [k]:\nSequences of syllables that overlap word boundaries are often less likely than sequences of\nsyllables within words, simply because it's words that are being learned.\n'fall'\nati aki\n'bear' • pretty baby: [tibej] (pret-ty ba-by) less common because it's not a word. If kids\ntɯma kɯma\nare sensitive to these probabilities, they can form hypotheses about word/non-\nword on the basis of these probabilities.\nBut production differences are systematic and linguistic:\n• Computer corpus analysis does fairly well (emphasize \"fairly\") finding word\nFor example, common to use only initial onset and rhyme of adult production. This boundaries this way. Do babies do this too? Perhaps.\ncreates syllable simplification in monosyllabic words: (bɛd → bɛ). But this simplified\nsyllable is copied (reduplication) in production of a disyllabic word: chicken → [dɪdɪ],\nwater →[wɑwɑ]. The syllable count of the word is preserved, with a morphological 6. Morphology\nprocess known in the adult grammar (reduplication) used to create the second syllable.\nChild's tasks:\n§ determine the morphemes/words of the language\n5. Lexicon § determine the rules that combine morphemes into words\nDiscerning word-boundaries: Example:\nlearn that walked contains two morphemes\nKids already know more than they say. Work of (the late) Peter Jucszyk and others:\n• In 11-month old, selective looking reveals preference for pauses that coincide\nOn the one hand...\nwith word boundaries over pauses inserted between syllables of words.\n§ Some evidence that language acquisition device is \"pretuned\" to pick up\n• In 9-month old, no preference. morphological patterns.\nSo what happens between 9 and 11? A bootstrapping problem. Those of you who read the paper by Safran, Aslin & Newport on statistical\nHow do you segment speech into words if you don't know the words? learning by infants (one of the choices for the first paper) might be interested in\nNo magic bullet, it seems!\na follow-up by Marcus et al (1999) in Science:\ntwo possibilities:\nIn a clever twist on the Saffran et al. experiment, Gary Marcus of NYU and three colleagues\ndid a similar experiment with 7-month old (actually, slightly younger) infants. (Science,\nJanuary 1, 1999). Once again, a two-minute stream of synthesized speech was played to the\ninfants. Once again, the speech stream was composed of three-syllable nonsense words, made\nfrom synthesized speech, with no cues identifying the word boundaries. Once again, the -4-\nchildren were played different recordings in a later presentation which they could control by % correct pre-school answers %correct first-grade answers\ngazing at or looking away from a blinking light. glasses 75 99\nwugs 76 97\nThis time, however, the nonsense words in the first presentation were not randomly chosen\nsequences of syllables, but conformed to simple rules, or templates. One group of infants, for luns 68 92\nexample, heard a string of nonsense words in which the second two syllables were identical (ga tors 73 90\nti ti, li na na). Another group heard words in which the first and third syllables were identical heafs 79 80\n(ti ga ti, na li na).\neras 58 86\nThe key recording in the second presentation did not consist this time of the same words tasses 28 39\nrearranged, but consisted of entirely new words that followed the same rule as the first set of gutches 28 38\nwords. Could infants distinguish new words that followed the rule from new words that did kazhes 25 36\nnot? Strikingly, they could. The infants preferred novel second presentations over familiar\nnizzes 14 33\nsecond presentations. But \"familiar\" here meant -- not containing the same \"words\" -- but\ncontaining new words that followed the old rule. In their words: \"Infants [can] extract abstract\nalgebra-like rules that represent relationships between placeholders (variables), such as “the Note about 2/3 of the first-graders tested failed to produce adult-like plurals for words that\nfirst item X is the same as the third item Y,” or more generally, that “item I is the same as item\nend in sibilants. That is very late by the standards of language acquisition experiments!\nJ...In addition to having the capacity to represent such rules, our results appear to show that\ninfants have the ability to extract those rules rapidly from small amounts of input and to\ngeneralize those rules to novel instances.\"\nOn the other hand...\n§ Morphological rule learning across the entire language takes a while longer.\nIt's still miraculously fast, but far from instantaneous! 7. Syntax\nClassic experiment: the \"wug test\". At what age do English-speaking children\n(2) What we find when we carefully study the world's languages\nproduce the correct plural endings [-s], [-z] and [-əәz]? Answer: quite early for\nLanguages are not all the same, but the ways in which they differ are highly\n[-s] (cats), and [-z] (dogs), but quite late for the [-əәz] that follows sibilants\nrestricted. The same peculiar bits show up again and again, all over the world.\n(horses, edges). Testing is done with a mixture of nouns that the children know\nand invented nouns like the now-famous wug: What's the same is called Universal Grammar (UG)\nWhat's different are settings of parameters within UG.\nAn acquisition perspective on UG and parameter setting:\n• UG reflects our genetic endowment for language\n• Parameter setting reflects our linguistic experience in early childhood.\n• For example, though we don't find verb-second in all the languages of the world,\nwe do find it popping up repeatedly — as discussed in the syntax lecture notes. On\nThis is a Wug.\nthe other hand (I am repeating myself here) there are some types of languages that are\njust as easy to describe in words as the verb-second languages, which we never find:\n(3) Some languages that don't exist anywhere (as far as we know):\na. Like German, but patterns of embedded and main clause are reversed.\nb. Main verb must follow the second phrase, third phrase, etc.\nc. Not the main verb, but the direct object must follow the first phrase.\n• We made a similar point in class when we discussed the relative ordering of heads of\nphrases and their complements. We observed that the relative order of a head and the\nNow there is another one. element that it merges with varies systematically across languages.\nThere are two of them.\nThere are two . We also observed that postulating a uniform \"head-first/head-last\" parameter across\nImage by MIT OpenCourseWare. -5-\nentire languages oversimplifies the picture. Certain kinds of mixed languages do exist, (11) Mohawk: [+ incorporation intoV]\nbut they are restricted by FOFC (the Final-over-Final Constraint). If correct, FOFC is Owira'a waha'-wahrake'.\n(or is a by-product of) a principle of UG — a principle that restricts the ways in baby meat-ate (Baker p. 91)\nwhich languages vary (and restricts the \"search space\" for a child acquiring\nlanguage).\nMohawk:\npolysynthesis (V): + (\"incorporation\")\nsubject pro-drop: +\nSome other parameters (and how they are set in a few languages)\nobject pro-drop: +\n[See Baker's book for much more,]\n(12) a. Wa'eksohare'\n1. Subject pro-drop 'She dishwashed'\n(4) Italian: + b. Wa'kenaktahninu'\n'I bed-bought.'\na. Io parlo italiano\n(I) speak Italian\nc. Wahana'tarakwetare'\nb. Noi parliamo italiano 'He bread-cut.'\n(we) speak Italian\nEnglish:\npolysynthesis (V): —\n(5) Chinese: +\nsubject pro-drop: —\nTa kanjian ta le.\nobject pro-drop: —\n(he) see he LE\n'He saw him'.\n(13) The verb-object constraint\nThe object of a verb must be the first noun (phrase) to combine with the verb; the\n(6) English: -\nsubject cannot combine with the verb until after the object does.\n*(We) speak English.\n(14) ...in English compounding\n2. Object pro-drop a. I disapprove of meat eating in here. (i.e. meat getting eaten)\nb. *I disapprove of baby eating in here. (i.e. babies eating dinner)\n(7) Chinese: +\n(15) ...in Mohawk \"incorporation\"\nTa kanjian ta le.\nhe see (him) LE *Wahawirake' ne o'wahru.\nbaby-ate the meat\n'The baby ate the meat.'\n(8) Italian: -\n(compare (11)\n*Gianni lo vede.\nGianni (him) sees.\n(Object pronouns generally move to the left of I in Italian.) An acquisition perspective on parameter-setting\n(9) English: - • Early production of complete sentences may show parameters set in a fashion familiar\n*John saw him. from languages other than the language that the child is in the process of acquiring.\nExample: pro-drop\n3. Polysynthesis Danish, English and French are not pro-drop languages, but early sentence production\nappears to show selective omission of subject pronouns:\n(10) English: [+ incorporation into N] (and A), but [- incorporation into V]\na, I disapprove of book-burning\nb. A user-friendly computer is a distant goal.\nc. *The baby meat-ate last night. -6-\n(16) Early pro-drop (18) Optional root infinitive stage\na. Danish a. Danish\nSe, blomster har. (Jens, 2;2) Hun sove. (Jens, 2;0)\nlook flowers have/has she sleep-INFIN\nb. English b. Dutch\nTickles me. (Adam, 3;6) Earst kleine boekje lezen. (Hein, 2;6)\nfirst little book read-INFIN\nc. French 'First (I/we) read little book'\nMange du pain. (Grégoire, 2;1)\neat-3sg some bread c. French\nDormir petit bébé. (Daniel, 1; 11)\nsleep-INFIN little baby\nAre young English-speaking children in effect \"speaking Italian\" until they start 'Little baby is sleeping.'\nregularly using subject pronouns? Much controversy ...\nEnglish does not have a specifically infinitive suffix, but the root infinitive state is\nWe also saw a video of English-speaking kids \"speaking German\" or \"speaking found among English-speaking children as well — showing up as missing -s on\nthird-person present-tense verbs. This is not an inability to pronounce the -s, since\nSwedish\" with respect to other phenomena, making the same points.\nplural and possessive -s is regularly present (with the caveat discussed above in\nconnection with the wug discussion):\n(19) English root infinitives\na. Papa have it. (Eve, 1;6)\nb. Cromer wear glasses. (Eve, 2;0)\nc. Marie go. (Sarah, 2;3)\nd. Mumma ride horsie. (Sarah, 2;6)\nAlas, we did not have time for the following discussion, but you may find the topic\ninteresting nonetheless: § It has been claimed that \"early pro-drop\" in languages like Dutch or English is\nlargely limited to such root infinitival clauses. Hmm... So is it pro-drop after all.\n§ Italian kids drop subject pronouns much more often than their English-speaking And if so ...\ncounterparts. So English pro-drop can't just be \"English-speaking children\nspeaking Italian\". There must be a different factor. Possibility: maturation. So what about parameter setting? When does it happen?\n§ Root infinitive stage: Speakers of many languages go through a period in which Answer: Perhaps some syntactic parameters are set earlier than we can yet detect.\nthey use infinitival verbs in main clauses, and these may lack subjects,\nFor example, German children around age 2 already know V2 — and even\n(17) a. Michel dormir. (French: 'Michel sleep-infin,') though they use root infinitives, they almost never apply V/2 to them.\nb. Ik ook lezen. (Dutch: 'I also read-infin.')\nIn adult German, an infinitive verb does not move to C, but remains final in VP:\n(20) German (adult) infinitival verb does not move to C\nIch will [dieses Buch lesen]\nI want this book read-INFIN\n'I want to read this book'\nHere are some examples of sentences uttered by the German speaking child\nAndreas (2;1). The first two examples show finite (non-infinitive) verbs, while the\nsecond two show root infinitives: -7-\n(21) Andreas (2;1): finite and infinitive root sentence\na. Ich hab ein dossen Ball.\nI have a big ball (note: dossen for grossen)\nb. Ich mach das nich.\nI do that not\n'I'm not doing that.'\nc. Thorsten Caesar haben. (note: Caesar = a doll)\nThorsten Caesar have-INFIN\nd. Du das haben.\nyou that have-INFIN\n• In fact, out of 281 sentences in a corpus of Andreas's utterances on a single day, which\nincluded 231 finite sentences and 51 sentences with root infinitives, Andreas\noverwhelmingly applied V2 to the finite verbs and failed to apply it to the non-finite\nverbs — following the adult rule in this respect. (He disobeys the adult rules of V2\n7.8% of the time. Child data is always noisy.)\n+Finite -Finite\nVerb second 216 7\nVerb final 15 44\n• Some example of Andreas' finite sentences with V2:\n(22) Direct object topicalization\na. Kahehabahn fahr i ch.\ntoy-race-car drive I\nb. Eine Fase hab ich.\na vase have I\n(23) Adverb topicalization\na. Da bin ich.\nthere am I\nb. So macht der.\nso does he MIT OpenCourseWare\nhttp://ocw.mit.edu\n24.900 Introduction to Linguistics\nFall 2012\nFor information about citing these materials or our Terms of Use, visit: http://ocw.mit.edu/terms."
}