{"text":"6: Writing Skills\nWhy Write?\n1\nOf all aspects of studying, writing is probably the most challenging. That is\nbecause when you write down an account of your ideas for other people to\nread you have to express yourself particularly carefully. You can't make the\nmental leaps you do when you are in conversation with others or thinking\nabout something for yourself. To make your meaning clear, using only words\non a page, you have to work out exactly what you think about the subject. You\ncome to understand it for yourself in the process of explaining it to others. So\nwriting makes you really grapple with what you are studying. In other words, it\nforces you into a very deep and powerful kind of learning. That is what makes\nit so demanding. When you write you are really putting ideas to use.\nIn some writing that you have done previously you may have ‘taken in’ ideas\nfrom books, articles, TV and so on. But it is only when you can use these\nideas to say something for yourself that you have really ‘learned’ them. Ideas\nonly become a properly functioning part of your thought-processes when you\ncan call on them as you communicate with other people. It is very valuable to\ndebate issues with other students in discussion groups. But an even more\nexacting way of using ideas in argument is to do it in writing.\nA key part of using ideas effectively is to be able to write clearly, pleasantly\nand persuasively. In our society this is a very valuable skill. It puts you on a\nmuch better footing with other people if you can present your point of view\nforcefully in writing. Perhaps you started out on your studies with the idea only\nof learning more about Biology, Chemistry or Mathematics, but you may\ndiscover that one of the most valuable things you gain is the ability to write\nmuch more effectively. Whether you start with a rather weak writing style or a\nfairly well-developed one, there is always plenty of progress to be made.\nSo writing tends to be both the most demanding and the most rewarding part\nof any course of study. And, because it contributes so much to what you learn,\nyou have to put a lot of your time and energy into it.\nOutcomes\nBy the end of this chapter you should:\n• be able to explain why writing is so important;\n• have an understanding of and be able to use critically the main criteria\nof good essay-writing;\n• be aware of the basic technical and stylistic considerations involved in\nwriting;\n1 Adapted from OpenLearn: http:\/\/openlearn.open.ac.uk\/mod\/resource\/view.php?id=210753 ( CC: BY-NC-SA) • be able to write appropriately any given form of writing;\n• state the rationale for referencing and citation;\n• quote texts from different sources in different ways in scholarly\ndocuments;\n• write endnotes\/footnotes and references\/bibliographies from different\nsources using the APA and MLA formats.\nWhat is an Essay?\nThe different science, arts and humanities subjects make their own particular\ndemands on you. You may have to do various kinds of writing – projects, logs,\nlab reports, case-studies – or even write creatively. In this chapter, though, we\nare going to concentrate on the essay because that is by far the most\ncommon form of writing in higher learning.\nThe word ‘essay’ originally meant ‘an attempt’ or try at something, but now it\nusually means a short piece of writing on a specific subject. It is a complete\npiece of writing that can stand alone – it must make sense to the reader ‘in\nitself’. You are given an essay title or question, which sets out the issues you\nneed to address, and a word limit of around one or two thousand words –\npossibly a bit shorter to begin with. You work from the title, putting together an\nargument that leads the reader towards a conclusion. Your lecturer marks\nyour essay, making comments not only about what you have said but also the\nway you have structured and written the essay. These ‘criticisms’ are meant to\nhelp you develop both your grasp of the subject and your powers of\nexpression. So an essay opens up a teaching–learning dialogue between you\nand your lecturer. In fact, it does still have some of the original sense of ‘trying\nyour hand’ at something, with the idea that you can get better at it through\npractice.\nYour lecturer will usually grade your essay too, so that you can see where you\n‘stand’ in relation to whatever standards apply to your course. This means\nthat, over time, you can see what kind of progress you are making.\nKey points\nWriting essays is a very important part of studying because:\n• it deepens your learning of the subject you are studying;\n• you learn to use ideas to argue a case;\n• it enables you to enter into a dialogue with your audience like lecturer\nthrough which you can extend and refine your thinking, and your writing\nskills;\n• it enables your lecturer or supervisor to assess your progress.\n2 What is a Good Essay?\nCriteria for Good Essay-writing\nWhen a lecturer reads your essay, she or he will be asking the following\nquestions:\n• Have you answered the question in the title?\n• Have you drawn on the relevant parts of the course for the main content\nof your essay?\n• Do you show a good grasp of the ideas you have been studying in the\ncourse?\n• Have you presented a coherent argument?\n• Is the essay written in an objective, analytical way, with appropriate use\nof illustration and evidence?\n• Is the essay clearly written and well presented?\nShow a Good Grasp of the Ideas\nTo show your grasp of the ideas you have been studying, you have to express\nthem for yourself, in your own words. Your lecturer will certainly be looking out\nfor signs that you understand the centrally important issues. Your lecturer has\nto be able to see your thought-processes at work in this way in order to give\nyou the kind of advice and support that will help develop your understanding.\nSo what you must avoid doing is using other people's words.\nPlagiarizing\nWhen you are writing an essay you are often working with ideas and terms\nyou are not familiar with. This makes it difficult for you to produce a clear,\ncoherent argument and you may become anxious about whether you will ‘get\nit right’. To be on the safe side, some students are tempted to ‘lift’ sections of\nwords from textbooks and articles and put them in their essays without using\nquotation marks or acknowledging the source. In other words, they try to pass\nthese words off as their own. This is known as ‘plagiarism’.\nLecturers are usually very familiar with the difference between the way\nstudents write and the way experienced authors write, and soon notice when a\nstudent lurches between an ‘expert’ and a ‘beginner’ style. A particular\ngiveaway is when most of the words are as in the original except for one or\ntwo (changed for purposes of camouflage), which stick out like sore thumbs\nbecause they are in a different style. Another is when smoothly flowing\nsections of writing are interspersed with short, inelegant linking phrases. It\nseems that most people write particularly badly when they are trying to stitch\ntogether someone else's words. Because you are not in control of ‘making’ the\nsense as you write, plagiarizing actually makes your writing worse.\nThis approach will not get you good marks. Indeed, when lecturers spot what\nis going on (which is not difficult) they will tend to assume you understand very\n3 little and mark you down. Worse, you do not develop your own writing style. If\nyou become locked into the sterile and tedious business of parroting other\npeople's words rather than expressing thoughts for yourself, then you are\nlikely to remain a beginner for a long time. And you will not learn much about\nthe ideas in the course either.\nThere is only one way to learn to use ideas in writing and that is to practise\nexpressing them in your own words. They may not come out very well to begin\nwith but, like a learner in any field, you have to be prepared to make mistakes\nsometimes. It is through letting your weaknesses show that you learn how to\ndo something about them, and allow others to help you learn.\nPresent a Coherent Argument\nPresenting a coherent argument is closely linked to ‘answering the question’.\nThe essence of an essay is that it sets out to be an argument about the issues\nraised in the title. Even if you have a lot of good material in it, it will not be\njudged ‘a good essay’ unless the material is organised so that it hangs\ntogether. This implies two things:\n1. You need to sort out your points into groups so that they can be\npresented in a structured way, giving the essay a beginning, a\nmiddle, and an end.\n2. You need to keep a thread of meaning running through your essay.\nEach sentence should flow on from the previous one, with adequate\nsignposting to help your reader follow the moves you are making.\nPresenting a coherent argument is also closely linked with ‘showing your\ngrasp of ideas’. One of the reasons why your writing tasks are set in the essay\nform – the form of an argument – is because that makes you use the ideas\nyou have been studying to say something. Anyone can copy material from\nbooks. The point of an essay is to make you think. When you present a\ncoherent argument you are showing that you can take hold of the ideas and\norganise them to do some work for you. The writer must be objective, precise,\nlogical, and concerned to back a case with evidence.\nTake an Objective, Analytical Stance\nAn essay should be ‘objective’. What does that mean? Being objective about\nsomething means standing back from it and looking at it coolly. It means\nfocusing your attention on the ‘object’, on what you are discussing, and not on\nyourself and your own (subjective) feelings about it. Your ideas should be able\nto survive detailed inspection by other people who are not emotionally\ncommitted to them.\nAn essay should argue by force of reason, not emotion. You must make\ndeliberate efforts to develop a style of writing that is cool, dispassionate and\nfair to all sides. That means you yourself must be open to doubt and criticism.\n4 Your arguments should be presented in the spirit that your reader might not\nagree with them. And if you want to dispute a claim someone else makes, you\nare expected to have analysed that claim carefully, to argue your case and\nprovide evidence for your point of view, rather than setting out to criticise or\ncast doubts on your opponent's character or motives. You should be\nrespectful to other writers. You should assume that you are writing as a\nmember of a community of equals, all of whom are intelligent, open-minded,\nfair people. You should write on the assumption that your readers are also\nmembers of that community, and that they will be interested only in your\nreasons for thinking what you do. They will not be interested in you as a\nperson, or in your ideas because they are your ideas.\nWrite Clearly\nA good essay is easy to read. Grand-sounding phrases and elaborate\nsentences do not make an essay impressive. Clarity and economy are what\ncount. Such ease of reading is achieved at several levels.\nTechnical Considerations\nHandwriting\nNowadays most people use a word processing package to write essays while\nsome people may use a typewriter. However, if you don't have access to\neither of these you will need to hand-write your essay. Should this be the\ncase, the ease of reading depends on the quality of your handwriting . It is\nonly fair to your lecturer to try to make your writing as legible as possible. This\nwill take time and care. But when you have spent a long time putting an essay\ntogether, it is a waste if what you say is misunderstood just because your\nwriting is misread. It is also prudent to take care. It would be an angel of a\nlecturer who was not a bit impatient at having to spend ages trying to make\nout your handwriting. If it is really dreadful you will have to get someone to tell\nyou which letters are hardest to read and practise straightening them out,\nrounding them more, or whatever is required. Having said that, most lecturers\nhave resigned themselves, in the course of duty, to becoming expert at\ndeciphering all kinds of scrawl. They will usually do their best not to be too\ninfluenced by it. (Actually, a lot of students complain that they can't read their\nlecturers’ or supervisors’ scribbled comments on their essays or reports.\nTherefore, this is not a one-way street.)\nLayout\nWhen using a word processing package, it is best to use a font like Times\nNew Roman which is sober and easy to read. Set the font size to 11 or 12\npoints and use double line spacing. You should also make sure that there are\ngenerous margins – the default settings are usually sufficient. If you are\nwriting by hand, your essay is easier to read if it is set out neatly on the page.\nYou should use lined A4 paper and leave generous margins for your lecturer\n5 to write comments. Write on one side of the paper only – this makes it much\neasier to cross-refer from one section of the essay to another. Make sure you\nleave spaces between paragraphs. This is all straightforward stuff, but the\npoint is that you should ‘stand back’ from your finished essay and look at it as\nan ‘object’ you have created. Does it look inviting to read? It is surprising how\nmany essays have words squashed onto every square centimetre of the page.\nBe ‘page-proud’ and generous with space. Unless your essays look as if you\ncare, why should anyone else?\nGrammar, Punctuation and Spelling\nAs we have seen, these contribute enormously to ease of reading. The whole\npoint of punctuation is to help the reader approach your words in the right\nway, and the rules of grammar are what enable the reader to construct the\nsense intended by the writer. Mistakes in either make the reader stop to work\nout what is being said. Poor spelling can also cause frequent interruptions.\nMeanwhile, the reader ‘loses’ the thread of your meaning. None of these\nabilities is easy to improve quickly, and all fall beyond the scope of this book.\nBut if you think you are particularly weak in them you should seek help. Take\ncomfort from the thought that your lecturer will usually try to ‘read through’ to\nyour intended meaning, and will also try to help you improve. A common\ngrammatical mistake is the ‘dangling modifier’. Let’s take a closer look at this\ncommon grammar problem:\nDangling Modifiers\nWhen writing it is always important that you communicate your meaning\nclearly. A common error amongst student writers is to create dangling\nmodifiers. This normally occurs when you leave out the subject or only infer\na subject in your sentence. Inserted additional information (the modifier) then\nseems to describe the object instead. Consider this example2;\n“Walking down Main Street (no subject), the trees were beautiful.”\nHere the \"walking down\" participle or modifier seems to connect to \"the trees\"\nbecause the sentence has no subject, when on reflection it really should\nconnect to the invisible speaker of the sentence. The speaker is the one\nwalking down the street (and finding the trees beautiful). Strunk and White's,\nThe Elements of Style, provides another kind of example, a misplaced\nmodifier (another participle):\n“ I saw the trailer peeping through the window. ”\nPresumably, the speaker means he or she was peeping through the window,\nbut the incorrect placement of \"peeping through the window\" makes it sound\nas though the trailer was peeping through the window. Because the modifier\n2 Adapted from Wikipedia: http:\/\/en.wikipedia.org\/wiki\/Dangling_modifier (CC: BY_SA)\n6 has been placed at the end of the sentence instead of at the beginning it\nseems to describe the object rather than the subject. Ambiguous modifiers\nhave sometimes been used for humorous effect. A famous example of this is\nby Groucho Marx as Captain Jeffrey T. Spaulding in the 1930 film, Animal\nCrackers:\n“One morning I shot an elephant in my pyjamas.\nHow he got into my pyjamas I'll never know.”\nGroucho Marx\nThough under the most plausible interpretation of the first sentence, Captain\nSpaulding would have been wearing the pyjamas, the line plays on the\ngrammatical possibility that the elephant was somehow within his pyjamas. So\nmake sure that when you compose a sentence as part of a report, essay or\nassignment you have clearly identified a subject and an object and that the\nmodifier or participle is located next to the correct subject or object.\nLet’s see if you can do it?\nSelf Study Activity: Dangling Modifiers\nStudy the examples of dangling modifiers below and:.\n1] identify why each sentence does not work properly.\n2] rewrite the sentence so that it is expressed correctly.\nExamples:\n“Having completed the essay, the radio was turned on.”\n“Having been thrown in the air, the dog caught the ball.”\n“While walking across the street, the bus hit her.”\n“After reading the article, the newspaper is aimed at the working class.”\n“The self study activity was a failure, not having studied the paragraph\non ‘Dangling Modifiers’ carefully.”\n“Last week I caught a cold at school.”\nLanguage\nYour language should be direct rather than fancy. Don't strive for effect. You\nshould always go for short and simple sentences where you can – especially\nwhen you are building up a basic essay-writing style. You can play with more\nelaborate words and grammatical structures later, when you have established\na secure basic technique. Don't beat about the bush; pitch straight into\nanswering the essay question in a direct, purposeful way.\n7 Fluency\nTry to make your essays flow from one sentence to the next. As we have\nseen, this is partly a matter of structure and partly of signposting. It is vital to\nthink of your essay in terms of its overall structure – to move points around,\nand cut and trim, in search of a clear sequence for your ideas. Then, having\nworked out a structure, you have to ‘talk’ your reader through it, emphasizing\nthe key turning points in the essay, summarising where you have got to,\nshowing how each new point follows from the last, and finally bringing it all to\na conclusion.\nExplaining\nYou need to be able to think of things from your reader's point of view. The\nreader cannot see into your mind so you have to explain your points quite fully\nand carefully. You need to give examples to illustrate what you are talking\nabout and to justify what you say. In other words, you need a sense of your\n‘audience’ and you have to work out how to ‘speak’ to these readers in the\nright ‘tone of voice’.\nAlso…\nFinally, a few key messages to take from this unit. One is that there is no great\nmystery or magic about what good writing is. We can recognize it just by\nreading it. The difficulty is how to produce it. However, since there are\ndifferent aspects of writing well, you will find it useful to return to the ‘Criteria of\ngood essay writing’ from time to time to consider how your writing is\ndeveloping. When you are about to submit an essay or report to a lecturer, or\nafter you get it back with comments on it, you can check through the list to see\nwhat progress you are making on each front.\nLast, take away the knowledge that you don't have to get your writing perfect\nbefore submitting it. In fact, there isn't such a thing as ‘perfect’ anyway. There\nare many different ways of writing a good essay. A good learner in any field is\nprepared to make mistakes and learn from them.\nSelf Activity: Essay Comparison\nCritically read the following two student’s essays and critique them using the\nguidelines outlined above:\nDid eighteenth century women migrate to towns mainly because of the attractions of\nthe towns, or mainly to escape from life in the countryside?3\n3 Accessed from OpenLearn, Looking at other people's essays, http:\/\/openlearn.open.ac.uk\/mod\/resource\/view.php?id=210753 (CC: BY-\nNC-SA)\n8 Masozi’s Essay who lived a fairly comfortable style of life\nbelonged to a class of society where the father or\nEighteenth century society expected women to husband would be a land-owner, these males\nhave accomplishments such as the ability to were orientated to country life and all it entailed\nembroider, play the piano and sing. They were so they expected their wifes or daughters to fit in\nsupposed to be fragile, delicate and innocent; to a standard of life they felt gave a certain status\nthey were taught at smart boarding schools or by to the country way of life. These were under-\nprivate lecturers, social skills to fit them for the privileged women as the boredom of country life\nrole expected of them at the time, as could become frustrating to them, does it not\n‘embodiments of their husbands’ and fathers’ make you see a resemblance to the modern day\nstatus’. Life in the country during this period of young woman, she can combine marriage,\nhistory offered little scope for the indulgence of raising children, and holding on to a carreer as\nthese skills owing to the scarcity of the well.\npopulation and the difficulty of transport, as\nwomen from the higher ranks were constrained With society becoming more wealthy it was\nto mix only with their own kind. possible for the fathers and husbands to provide\nan even better standard of life for their wifes and\nThus the lives of these well born ladies were daughters, more servants could be provided to\nimmensely boring. It was not considered fitting do the work and this left the woman more time\nthat a woman should take any part in the than ever to develop the social skills of the era,\nmanagement of a country estate, or in the but this in turn led to extreme frustration among\ncountry pursuits of riding, hunting or fishing as woman of that class. The country was no place\nenjoyed by the men and she was therefore now to exercise these new skills they had been\nreduced to spend her time reading or writing taught, for one thing females outnumbered males\nletters. However, in an urban environment, it was at that time, also few chances arose to meet and\nacceptable that women could socialize on a mingle with crowds of people, but most\nmuch wider scale and even organize and plan importantly the demands of propriety meant that\nsocial events, an added dimension to their very their conduct should be impeccable at all times\nconstrained lives. Because of this, and because any error would be seen in such a limited\nan urban environment offered women so much environment so therefore woman began to long\nmore scope, not only to display their for the urban or city way of living, if even for a\naccomplishments but also to indulge their own short period so that they could deploy the art of\ndesire for sociability, amusement and socializing and mingling with a greater amount of\ncompanions’, the female population of England’s society\ntowns expanded dramatically.\nTowns offered woman a great variation of\nIn view of the somewhat prescribed role forced respectable ways in which to carry out the social\nupon women in the eighteenth century by the skills, indeed many women have gone down in\nmale dominated society which formulated social history as being great experts as organizers of\nmores, it was inevitable that women would be social events thus enhancing their husbands\nattracted to the towns where the skills that standing. In a town or city, women could meet\nsociety required of them could be more widely with many more of the female sex than they did\nindulged and more fully displayed. In the towns in the country, they could exchange views and\nthere were more people of the same rank, so that learn new ideas from each other, also they could\nwomen could socialize on a wider scale, and as meet with more of the male population as the\nthere was public transport they had greater citys had theatres concert halls, and many places\nmobility. They therefore fled from the country in where both sexes could mingle together\norder to escape the restrictions and consequent respectably. In many ways going into urban life\nboredom placed upon them by the very limited from the countryside was beneficial to woman of\npastimes that a high ranking women in the the upperclass.\neighteenth century was permitted to indulge.\nThis transition was not without a certain amount\nIn effect, I think that the high ranking women of of jibes from the male population against the\nthe eighteenth century were neither mainly women of that time, who looked on them as\nattracted to the towns, or escaping from the being inferior in many ways, and considered\ncountryside, what they were seeking to do was to those who chose to get away from boredom of\nfulfil the very limited role with which society had the country as being improper in outlook.\nburdened them as fully as was possible.”\nNevertheless woman, whether wealthy or poor\nKondwani’s Essay need the stimulus of company and the need to\nescape from routine and boredom and so will\nJoyce Ellis presents to us a portrayal of woman continue to seek for the things that will be in their\nliving around the eighteenth century. The women favour. Activity Tasks\n1. As you read, note any places where you have difficulty grasping the point,\nand write any other thoughts that come to you in the margins. Pencil in any\nalterations you think could usefully be made. (If possible, work on printed\ncopies of the essays.)\n2. When you get to the end of the essays, take a sheet of paper and write two\nheadings: ‘Strengths’ and ‘Weaknesses’. Note down the good things about\nKondwani's essay and the weak points. Then do the same for Masozi's.\n3. Try to weigh up the quality of these essays. Do you think that one of them\nis better than the other? (Can they be good in different ways?) Overall, do\nyou think that they are good essays or poor ones? How much of that is to\ndo with the quality of the ideas in them and how much to do with the way\nthe ideas are presented?\n4. Finally, can you draw any general conclusions about the qualities a good\nessay should have? (Look back over your answers to 2 and 3 above.)\nActivity Advice \/ Tips: Judging Writing\nThis is an interesting activity and it will take you some time. You may not do\nthe best at this stage. However, it is worth doing. It will be time well spent\nbecause you need to develop your ability to see what works in writing and\nwhat doesn't. It is not helpful to try to learn formal ‘rules’ of writing. Rather, you\nhave to become a reasonably good judge of real pieces of writing, including\nyour own. ‘Marking’ other people's work helps you understand what you\nshould be aiming for in your own writing.\nSelf Activity: Essay Writing\n• Use the notes you have made as a critique for the two essays to rewrite\nthe essay so that it is a much better essay that meets the discussed\ncriteria.\n• Give your essay to a colleague to mark using the criteria given by\nstating strengths, weaknesses and suggestions about what could be\ndone to make the essay even better\nReferencing and Citation\nIn institutions of higher learning, like Bunda College of Agriculture, students\nare required to write their documents such as projects and assignments with\nscholarly professionalism. In this unit, you will go through different forms of\nreferencing and citation that can help you write academic texts. You will\nparticularly also be exposed to MLA and APA styles of referencing.\nReferencing is generally all about acknowledging the sources of information\nused in either written or oral scholarly work or text. References are therefore,\na list of texts used in an academic work. In a related term, a bibliography,\n10 however, is a list of recommended readings on a given topic which may or\nmay not have been used or cited in a scholarly text (document). Citation is\nsynonymously used with referencing. As the term connotes, citation refers to\nlocating the ‘cites’ or places where information has been taken from in a\ndocument. Citation could be in the form of endnotes or footnotes or embedded\n(included) notes as we will see later. Here at Bunda College of Agriculture,\nyou will be expected to cite all the sources of information that you have used\nin your assignments or research projects. Otherwise, using people’s\ninformation without acknowledging the sources is tantamount to ‘academic\ntheft’ called plagiarism. Your lecturers will punish you for plagiarism and the\npunishment could include failure in the assignment or research project that\nyou present to them.\nJustifications for Referencing and Citation\nAmong the reasons why scholars, like you, are expected to make referencing\nand citations are that doing so helps in:\n• Locating and verifying the places where information is said to have\nbeen taken from.\n• Directing readers to read more on the topic under discussion in your\npaper or text.\n• Showing a sense of belonging to the group of academic scholars that\nabide by the given referencing requirement.\n• Standardising the way scholars write; hence it is easier to assess and\ncompare different academic work based on the same principles.\n• Protecting the intellectual property of thinkers that contribute(d) to the\nworld through their work through the crimes that arise from plagiarism.\n• Continuity of research and intellectual development because it shows\nwhat is already done by others.\nStyles of Documenting Sources of Information\nThere are basically two popular styles of documenting sources of information\nthat one can use in scholarly work. The first is the American Psychological\nAssociation’s format, hereafter abbreviated as APA. The APA citation style\nrefers to the rules and conventions recommended by the American\nPsychological Association on how to document sources of information mainly\nused in research papers. The second style is the Morden Language\nAssociation’s format, hereafter, abbreviated as MLA. The MLA citation style\nrefers to rules and conventions established and recommended by the Modern\nLanguage Association on how to document sources of information used in\nscholarly work, like research papers. The APA and MLA conventions on\nacknowledging sources of information are different in some way and so\ndifferent institutions and lecturers prefer different styles mainly due to their\nexpositions to them. You are, therefore, supposed to know both of them in\ndetail so that you use the right convention for the right institutions and people\nyou present your scholarly work to.\n11 Quotations\nIn referencing, quotations refer to the way of acknowledging direct words or\nphrases or statements formally used by other people. Quotations appear in\ninverted commas when quoted word for word or paraphrased when one uses\nsomeone’s ideas in his\/her own words. In both cases, you need to cite the\nsource of information. When writing an academic text, there are some times\nwhen you may have to include a footnote or an endnote to supplement what\nyou have written in the main text. A footnote is similar to an endnote in that the\ncontent is the same. The only difference is that a footnote is place at the\nbottom of the page while an endnote appears at the end of a text like a\nchapter. Take note that there are two types of footnotes\/endnotes. The first\ntype is called citation\/reference which locates the source of information used\nin a text. The second type, called content footnote\/endnote only add more\ninformation (notes) to the issues discussed in the text which if put in the main\ntext might be not that necessary to the reader. In other words, footnotes and\nendnotes of this type are most often used as an alternative to long explanatory\nnotes that could be distracting to readers.\nThe APA Style\nAmerican Psychological Association (APA) style is a widely accepted style of\ndocumentation, particularly in the social sciences. APA style specifies the\nnames and order of headings, formatting, and organization of citations and\nreferences, and the arrangement of tables, figures, footnotes, and\nappendices, as well as other manuscript and documentation features. APA\nstyle uses the author-date style of parenthetical referencing, with such source\ncitations keyed to a subsequent list of \"References.\" Also known as the\nHarvard Style.4\nIncluded or Embedded Citation\nReference citations in texts are done using parenthetical acknowledgement.\nMost often, this involves enclosing the author's surname and the date of\npublication within brackets, separated by a comma, generally placed\nimmediately after the reference or at the end of the sentence in which the\nreference is made. However, it is also common for the authors to be the\nsubject or object of a sentence. In such a case only the year is in parenthesis.\nIn all cases of citation, author name(s) are always followed immediately by a\nyear, and years are never presented without author name(s) immediately\npreceding it. In the case of a quotation, the page number is also included in\nthe citation.\nFull bibliographic information is then provided in a Reference section at the\nend of the article. APA style defines that the reference section may only\ninclude articles that are cited within the body of an article. This is the\n4 Adapted from Wikipedia: http:\/\/en.wikipedia.org\/wiki\/APA_style (CC: BY-SA)\n12 distinction between a document having a Reference section and a\nbibliography, which may incorporate sources which may have been read by\nthe authors as background but not referred to or included in the body of a\ndocument.\nSingle author\nFormat should be Author's last name followed directly by a comma, then the\nyear of publication. When one makes the reference to the author(s) directly as\na part of the narrative, then only the year (and page number if needed) would\nremain enclosed within parentheses. The same holds for multiple authors as\nyou can see in the following examples.\nA recent study found a possible genetic cause of alcoholism (Pauling, 2005).\nPauling (2005) discovered a possible genetic cause of alcoholism.\nTwo authors\nAuthors should be presented in order that they appear in the published article.\nIf they are cited within closed parentheses, use the ampersand (&) between\nthem. If not enclosed in parentheses then use expanded \"and\".\nA recent study found a possible genetic cause of alcoholism (Pauling & Liu,\n2005). Pauling and Liu (2005) discovered a possible genetic cause of\nalcoholism.\nThree to five authors\nWith three to five authors, the first reference to an article includes all authors.\nSubsequent citations in the same document may refer to the article by the\nprincipal author only plus \"et al.\" However, all authors must be present in the\nreferences section.\nA recent study found a possible genetic cause of alcoholism (Pauling, Liu, &\nGuo, 2005). Pauling, Liu, and Guo (2005) conducted a study that discovered a\npossible genetic cause of alcoholism. Pauling et al. (2005) discovered a\npossible genetic cause of alcoholism. A recent study found a possible genetic\ncause of alcoholism (Pauling et al., 2005).\nSix authors or more\nThe correct format is (First Author et al., Year). In the reference section, all six\nauthors' names should be included.\nPauling et al. (2005) discovered a possible genetic cause of alcoholism.\nMultiple publications, same author\nIf an author has multiple publications that you wish to cite, you use a comma\nto separate the years of publication in chronological order (oldest to most\nrecent). If the publications occur in the same year, the Publication Manual\n13 recommends using suffixes a, b, c, etc. (note that corresponding letters should\nbe used in the reference list, and these references should be ordered\nalphabetically by title).\nRecent studies have found a possible genetic cause of alcoholism (Pauling,\n2004, 2005a, 2005b).\nPauling (2004, 2005a, 2005b) has conducted studies that have discovered a\npossible genetic cause of alcoholism\nMultiple publications, different authors\nFollow the rules for one author above, and use a semicolon to separate\narticles. Citation should first be in alphabetical order of the author, then\nchronological.\nRecent studies found a possible genetic cause of alcoholism (Alford, 1995;\nPauling, 2004, 2005; Sirkis, 2003)\nDirect quotes\nThe same rules as above apply here, the format being (Author, Year, Page\nNumber).\nWhen asked why his behavior had changed so dramatically, Max simply said,\n\"I think it's the reinforcement\" (Pauling, 2004, p. 69).\nReference List\nThe APA style guide prescribes that the Reference section, bibliographies and\nother lists of names should be accumulated by surname first, and mandates\ninclusion of surname prefixes. For example, \"Martin de Rijke\" should be sorted\nas \"De Rijke, M.\" and \"Saif Al Falasi\" should be sorted as \"Al-Falasi, S.\" (The\npreference for Arabic names now is to hyphenate the prefix so that it remains\nwith the surname.)\nPrint sources\nA] Book by one author\nSheril, R. D. (1956). The terrifying future: Contemplating color\ntelevision. San Diego: Halstead.\nB] Book by two authors or more\nSmith, J., & Peter, Q. (1992). Hairball: An intensive peek behind the\nsurface of an enigma. Hamilton, ON: McMaster University Press.\nC] Article in an edited book\n14 Mcdonalds, A. (1993). Practical methods for the apprehension and\nsustained containment of supernatural entities. In G. L. Yeager (Ed.),\nParanormal and occult studies: Case studies in application (pp. 42–\n64). London: OtherWorld Books.\nD] Article in a journal paginated separately\nCrackton, P. (1987). The Loonie: God's long-awaited gift to colourful\npocket change? Canadian Change, 64 (7), 34–37.\nE] Article in a journal with continuous pagination\nRottweiler, F. T., & Beauchemin, J. L. (1987). Detroit and Narnia: Two\nfoes on the brink of destruction. Canadian\/American Studies Journal,\n54, 66-146.\nF] Article in a weekly magazine\nHenry, W. A., III. (1990, April 9). Making the grade in today's schools.\nTime, 135, 28–31.\nG] Article in a newspaper\nWrong, M. (2005, August 17). \"Never Gonna Give You Up\" says\nMayor.Toronto Sol, p. 4.\nI] Government document\nRevenue Canada. (2001). Advanced gouging: Manual for employees\n(MP 65–347\/1124). Ottawa: Minister of Immigration and Revenue.\nElectronic sources\nFor electronic references, websites, and online articles, APA Style asserts\nsome basic rules, including to direct readers specifically to the source material\nusing URLs which work, include the access date and include all other relevant\nAPA style details for the source Internet article based on a print source (With\nexact formatting of original)\nMarlowe, P., Spade, S., & Chan, C. (2001). Detective work and the\nbenefits of colour versus black and white [Electronic version]. Journal\nof Pointless Research, 11, 123–124.\nA] Internet article based on a print source (Formatting differs from original)\nMarlowe, P., Spade, S., & Chan, C. (2001). Detective work and the\nbenefits of colour versus black and white. Journal of Pointless\n15 Research, 11, 123–124. Retrieved October 25, 2007, from\nhttp:\/\/www.pointlessjournal.com\/colour_vs_black_and_white.html\nB] Article in an Internet-only journal\nBlofeld, E. S. (1994, March 1). Expressing oneself through Persian cats\nand modern architecture. Felines & Felons, 4, Article 0046g.\nRetrieved October 3, 1999, from\nhttp:\/\/journals.f+f.org\/spectre\/vblofeld-0046g.html\nC] Article in an Internet-only newsletter\nParadise, S., Moriarty, D., Marx, C., Lee, O. B., Hassel, E., Bradford, J.,\net al. (1957, July). Portrayals of fictional characters in reality-based\npopular writing: Project update. Off the Beaten Path, 7 (3). Retrieved\nOctober 3, 1999, from\nhttp:\/\/www.newsletter.offthebeatenpath.news\/otr\/complaints.html\nD] Stand-alone Internet document, no author identified, no date\nWhat I did today. (n.d.). Retrieved August 21, 2002, from\nhttp:\/\/www.cc.mystory.life\/blog\/didtoday.html [Fictional entry.]\nE] Document available on university program or department website (note that\nAPA spells website Web site)\nRogers, B. (2078). Faster-than-light travel: What we've learned in the\nfirst twenty years. Retrieved August 24, 2079, from Mars University,\nInstitute for Martian Studies Web site,\nhttp:\/\/www.eg.spacecentraltoday.mars\/university\/dept.html [Fictional\nentry.]\nF] Electronic copy of a journal article, three to five authors, retrieved from\ndatabase\nCostanza, G., Seinfeld, J., Benes, E., Kramer, C., & Peterman, J.\n(1993). Minutiæ and insignificant observations from the nineteen-\nnineties. Journal about Nothing, 52, 475–649. Retrieved October 31,\n1999, from NoTHINGJournals database. [Fictional entry.]\nG] E-mail or other personal communication (cite in text only)\n(A. Monterey, personal communication, September 28, 2001)\nH] Book on CD\nNix, G. (2002). Lirael, Daughter of the Clayr [CD]. New York: Random\nHouse\/Listening Library.\n16 I] Book on tape\nNix, G. (2002). Lirael, Daughter of the Clayr [Cassette Recording No.\n1999-1999-1999]. New York: Random House\/Listening Library.\nJ] Movie\nGilby, A. (Producer), & Schlesinger, J. (Director). (1995). Cold comfort\nfarm [Motion picture]. Universal City, CA: MCA Universal Home\nVideo.\nThe MLA Style\nAccording to the MLA book catalogue description, since first being published\nin 1985, the MLA Style Manual has been \"the standard guide for graduate\nstudents, scholars, and professional writers.\" MLA style \"has been widely\nadopted by schools, academic departments, and instructors for over half a\ncentury\"; the MLA's \"guidelines are also used by over 1,100 scholarly and\nliterary journals, newsletters, and magazines and by many university and\ncommercial presses,\" and they are \"followed throughout North America and in\nBrazil, China, India, Japan, Taiwan, and other countries around the world\"\n(\"What Is MLA Style?\")5.\nPurpose\nThe MLA Style Manual and Guide to Scholarly Publishing, 3rd ed. (2008), by\nthe Modern Language Association of America (based on the work of Joseph\nGibaldi with co-author Walter S. Achtert for The MLA Style Manual [1985],\nrevised in the 2nd ed. in 1998), is addressed primarily to academic scholars,\nprofessors, graduate students, and other advanced-level writers of scholarly\nbooks and articles in humanities disciplines such as English and other modern\nlanguages and literatures. Many journals and presses in these disciplines\nrequire that manuscripts be submitted following MLA style.\nMLA style provides a bibliography of \"Works Cited\" listing works cited in one's\ntext and notes (either footnotes and\/or endnotes), which is placed after the\nmain body of a term paper, article, or book.\nSelected bibliography or works consulted\nIn addition to \"Works Cited\", MLA style also provides other possible options\nfor bibliographies such as more-selective lists headed \"Selected Bibliography\"\nor \"Works Consulted.\"\nContent notes\n5 Adapted from Wikipedia: http:\/\/en.wikipedia.org\/wiki\/The_MLA_Style_Manual (CC: BY-SA)\n17 In composing \"content notes\" (formatted as either footnotes or endnotes), one\nis directed to \"avoid lengthy discussions that divert the reader's attention from\nthe primary text\" and advised: \"In general, comments that you cannot fit into\nthe text should be omitted unless they provide essential justification or\nclarification of what you have written\" (259). \"You may use a note, for\nexample, to give full publication facts for an original source for which you cite\nan indirect source\" (259). MLA style \"content notes\" use the same method of\n\"Parenthetical Documentation and the List of Works Cited,\" with sources\nkeyed to the list of \"Works Cited\", discussed in Section 7: \"Documentation:\nCiting Sources in the Text\" (240–60).\nFormats for Bibliographies in MLA\nBook\nAuthor's name [last name, first name, middle initial or middle name (as given)].\nTitle. Place of publication: publisher, date. Print. Supplementary information (if\nany).Example\nHodgkinson, Tom. How to Be Idle. New York: Harper, 2005. Print.\nArticle in a periodical (magazine or journal, as well as newspapers)\nAuthor's name [last name, first name, middle initial or middle name (as given)].\n\"Article title.\" Title of periodical Volume number (\"for a scholarly\njournal\").[period]issue number (\"if available, for a scholarly journal\") Date of\npublication within parentheses (\"for a scholarly journal, the year; for other\nperiodicals, the day, month, and year, as available\"): Pages (\"inclusive\"). Print.\nBrophy, Mike. \"Driving Force.\" Hockey News 21 Mar. 2006: 16-19. Print.\nKane, Robert. \"Turing Machines and Mental Reports.\" Australasian Jour. of\nPhilosophy 44.3 (1966): 334-52. Print.\nIf the journal uses only issue numbers, cite the issue number alone.\nIf citing a \"locally-published newspaper\" whose city of publication is not in its\ntitle, the city is put in square brackets (but not italicized) after the title of the\nnewspaper (178–79).\nInternet Resource\nName of author of webpage (last name, first name, middle initial or middle\nname [as given]). \"Article Title.\" Title of Webpage [publication]. Sponsoring\nAgency, date of publication (or date page was last modified). Web. Date\naccessed.\nCNN and Reuters. \"Boston Columnist Resigns Amid New Plagiarism\nCharges.\" Cable News Network. Turner Broadcasting System, Inc., 19 Aug.\n1998. Web. 6 Mar. 2009.\n18 CD ROM\nName of author (last name, first name, middle initial or middle name [as\ngiven]). \"Article title of printed source.\" Periodical title of printed source, or title\nof printed analogue Date: inclusive pages. Title of database. CD-ROM. Name\nof vendor or computer service. Electronic-publication data or data for access.\nReed, William. \"Whites and the Entertainment Industry.\" Tennessee Tribune\n25 Dec. 1996: 28. Ethnic News Watch. CD-ROM. Data Technologies, Feb.\n1997.\nPersonal Interview\nName of person interviewed (last name, first name, middle initial or middle\nname [as given]). Personal interview. Date interviewed.\nPei, I. M. Personal interview. 22 July 1993.\nChapter Assessment Task\nThis chapter has discussed several ways you could reference your sources.\nSee if you can perform these tasks:\n1. Study the information below taken from a book, Using Moodle, and\nreference this book using both APA and MLA techniques.\n2. Study the information below from a book called An Introduction to\nClassroom Observation and reference it in both APA and MLA Styles\n19 3. Provide an APA reference for an online open access journal article\ncalled, A Pictorial Technique for Mass Screening of Sorghum\nGermplasm for Anthracnose (Colletotrichum sublineolum) Resistance\nby Louis K. Prom, Ramasamy Perumal, John Erpelding, Thomas\nIsakeit, Noe Montes-Garcia, Clint W. Magill. Available at\nhttp:\/\/www.bentham.org\/open\/toasj\/openaccess2.htm\nAdditional Enrichment Resources\nThe following web resources are recommended and will offer enrichment on\nwriting skills:\nResource Location\nHow-to-Study.com,\nhttp:\/\/www.how-to-study.com\/study-skills\/en\/language-arts\/18\/writing-\nWriting Techniques techniques\/\nHow-to-Study.com,\nhttp:\/\/www.how-to-study.com\/study-skills\/en\/language-arts\/16\/a-word-\nA Word Identification Strategy identification-strategy\/\nVUMA! Portal, How to Improve\nhttp:\/\/www.vuma.ac.za\/drupal\/?q=content\/how-improve-your-writing-skills-0\nyour Writing Skills\nVUMA! Portal,\nhttp:\/\/www.vuma.ac.za\/drupal\/?q=content\/basics-good-writing\nBasics of Good Writing\nVUMA! Portal, Five Ways to\nhttp:\/\/www.vuma.ac.za\/drupal\/?q=content\/five-ways-improve-your-writing-style\nImprove Your Writing Style\n20 Glossary\nBelow is a list of words and abbreviations used in the chapter.\nTerm Definition\nAmerican Psychological Association. Style for\nAPA acknowledging sources of information formally used in a\ntext.\nThis is a list of recommended readings which may have\nBibliography been used and cited in an academic work or not. It is\nwritten in alphabetical order of authors’ surnames.\nThis refers to ways of acknowledging or showing the\nCitation\nlocation of information used in an academic text.\nThe source of the information in the text, or additional\nEndnote information about the text placed at the end of a\ndocument.\nThe source of the information in the text, or additional\nFootnote information about the text, placed at the bottom (foot) of\nthe page.\nMorden Language Association. Style for acknowledging\nMLA\nsources of information formally used in a text.\nA list of texts used and cited in an academic work in\nReferences\nalphabetical order of authors’ surnames\n21 "}