{"text":"SYMBOLISM – A KEY CONCEPT IN LITERATURE\nDR. RAJKUMAR M. LAKHADIVE\nHead & Associate Professor,\nDepartment of English,\nMahatma Basweshwar College, Latur\n(MS) INDIA\nSymbols are a means of complex communication that often times can have multiple levels of\nmeaning. This separates symbols from signs, as signs have only one meaning. A symbol’s\nmeaning may be modified by various factors including popular usage, history and contextual\nintent. The history of a symbol is one of many factors in determining a particular symbol’s\napparent meaning. The word ‘symbol’ has been used to mean anything from a simple mark to\ncomplex and arcane images through convoluted stories, and even to philosophic arguments.\nUnfortunately, most tomes claiming to discuss or collect symbols try to ignore this ambiguity,\nmaking any effort to categorize books and other sources a highly subjective, not to mention\ntremendously intricate task. Further, there are all the similar and related terms: symbolize,\nsymbolism, symbolic, signs, signals, significance, myths, mythology, images. The context of a\nsymbol may change its meaning. Similar five-pointed stars might signify a law enforcement\nofficer or a member of the armed services, depending upon the uniform.\nINTRODUCTION\nHuman cultures use symbols as a means to express their specific ideology, social structures,\nand to represent characteristics of their specific culture. Thus, symbols carry different\nmeaning depending upon one‟s cultural background. The meaning of a symbol is not inherent\nin the symbol itself, but is culturally learned. Heinrich Zimmer gives a concise overview of\nthe nature, and perennial relevance, of symbols:\nConcepts and words are symbols, just as visions, rituals, and images are;\nso too are the manners and customs of daily life. Through all of these, a\ntranscendent reality is mirrored. They are so many metaphors reflecting\nand implying something which, though thus variously expressed, is\nineffable, though thus rendered multiform, remains inscrutable. Symbols\nhold the mind to truth but are not themselves the truth, hence it is delusory\nto borrow them. Each civilization, every age, must bring forth its\nown.”[Zimmer, Heinrich. 122]\nDR. RAJKUMAR M. LAKHADIVE 1P age Symbolism In Literature:\nSymbolism is often used by writers to enhance their writing. Symbolism can give a literary\nwork more richness and colour and can make the meaning of the work deeper. In literature,\nsymbolism can take many forms including:\n1. A figure of speech where an object, person, or situation has another meaning other than\nits literal meaning.\n2. The actions of a character, word, action, or event that have a deeper meaning in the\ncontext of the whole story.\nMany poets used symbolism to deepen the meaning of their poems. Here is an excerpt from\nWilliam Blake‟s “Ah Sunflower.” In it, William Blake refers to life cycle and uses\nsunflowers to represent humankind and that they desire everlasting life. ”Ah Sunflower,\nweary of time, Who countest the steps of the sun; Seeking after that sweet golden\nclime\/Where the traveler‟s journey is done.” In another poem of Robert Burns “My love is\nlike a red, red rose…”, he expresses his love by using the „rose‟ as a token of love or symbol\nof love.\nThe symbolic reference leads to a transference of emotion, purpose, and belief, which cannot\nbe justified by an intellectual comparison of the direct information derived from the two\nschemes and their elements of intersection. The justification, such as it is, must be sought in\na pragmatic appeal to the future. In this way, intellectual criticism founded on subsequent\nexperience can enlarge and purify the primitive native symbolic transference.\nTime is known to us as the succession of our acts of experience, and thence derivatively as\nthe succession of events objectively perceived in those acts. But this succession is not pure\nsuccession. It is the derivation of state from state, with the later state exhibiting conformity to\nthe antecedent. Time, in the concrete, is the conformation of state to state, the later to the\nearlier. The pure succession is an abstraction from the irreversible relationship of settled past\nto derivative present. The notion of pure succession is analogous to the notion of colour.\nThere is no mere colour, but always some particular colour such as red or blue. Analogously,\nthere is no pure succession, but always some particular relational ground in respect to which\nthe terms succeed each other. The integers succeed each other in one way, and events\nsucceed each other in another way. When we abstract from these ways of succession, we find\nthat pure succession is an abstraction of the second order, a generic abstraction omitting the\ntemporal character of time and the numerical relation of integers. The past consists of the\nDR. RAJKUMAR M. LAKHADIVE 2P age community of settled acts which, through their objectifications in the present act, establish\nthe conditions to which that act must conform.\nAristotle conceived “matter” as being pure potentiality awaiting the incoming of form in\norder to become actual. Hence employing Aristotelian notions, we may say that the\nlimitation of pure potentiality, established by “objectifications” of the settled past, expresses\nthat “natural potentiality”––or, potentiality in nature––which is “matter” with that basis of\ninitial, realized form presupposed as the first phase in the self-creation of the present\noccasion. The notion of “pure potentiality” here takes the place of Aristotle‟s “matter.” The\n“natural potentiality” is “matter” with that given imposition of form from which each actual\nthing arises. All components which are given for experience are to be found in the analysis of\nnatural potentiality. Thus the immediate present has to conform to what the past is for it. The\nmere lapse of time is an abstraction from the more concrete relatedness of “conformation.”\nThe “substantial” character of actual things is not primarily concerned with the predication of\nqualities. It expresses the stubborn fact that whatever is settled and actual must in due\nmeasure be conformed to by the self-creative activity. The phrase “stubborn fact” exactly\nexpresses the popular apprehension of this characteristic. Its primary phase, from which each\nactual thing arises, is the stubborn fact which underlies its existence. According to Hume,\nthere are no stubborn facts. Hume‟s doctrine may be good philosophy. But it is certainly not\ncommon sense. In other words, it fails before the final test of obvious verification.\nSymbolism is also the name given to an important movement in late 19th century and early\n20th century. It is used to describe any mode of expression, which instead of referring to\nsomething directly refers to it indirectly through the medium of something else. In discussing\nliterature, the term „symbol‟ is applied to a word or phrase that signifies an object or event.\nObjects like flags and crosses also function symbolically.\nSymbols are of two kinds. They are:\n1. Conventional or public symbols.\n2. Private and personal symbols.\nPoets like William Blake, John Donne and William Shakespeare used „Conventional\nSymbols‟ in their writings and Dylan Thomas, W.B. Yeats, T.S. Eliot and W.H. Auden used\n“Private Symbols” in their writings. Take an example of the word „rose‟ which in its literal\nuse signifies a kind of flower. In Robert Burns‟ Poem “A Red, Red Rose” in the line „O my\nlove‟s like a red, red rose‟. The word „rose‟ is used as a simile. Then in William Blake‟s\npoem, “The Sick Rose”, the „rose‟ is not the vehicle for a simile because it lacks the paired\nsubject “My love”. Blake‟s rose is a personal symbol and not like the symbolic rose in other\nDR. RAJKUMAR M. LAKHADIVE 3P age poems. The important feature of Romanticism and succeeding phases of Western Literature\nwas a much more pronounced reliance upon enigmatic symbolism in prose fiction and poetry.\nIt involves obscure private codes of meaning as in the poetry of William Blake and W. B.\nYeats. William Blake exceeded all his romantic contemporaries in his course to a sustained\nsymbolism.\nIn 19th century America, a symbolist procedure was prominent in the prose of Emerson and\nThoreau and in the novels of Nathaniel Hawthorne and Herman Melville. Melville has used\nsymbolic methods in his novels like Mardi (1849), Moby Dick (1851), Billy Budd, (1924),\nThe Confidence Man (1851). Indeed every object and character in the books become a focus\nfor many different suggested meanings. Melville‟s extravagant symbolism was encouraged\npartly by the importance which „American Transcendentalism give to symbolic interpretation\nof the world‟. Symbolism can, then be finally said, as it is an attempt to penetrate beyond\nreality to a world of ideas within the poet or ideas in the Platonic sense. In order to get behind\nthe surface of reality, there is often a fusion of images for giving third dimension. In this way,\nsymbolism has been shaping an identity for itself.\nMetaphors As Symbolism:\nA metaphor is a figure of speech that uses symbolism.\n1. It compares two things that are not similar and shows that they actually do have something\nin common.\n2. In a metaphor, there is an additional meaning to a word. This makes it an example of\nsymbolism.\nExamples of symbolism that take the form of metaphors include:\n1. Time is money: This is symbolic because it warns us that when we spend our time, we are\ngiving up the opportunity to be doing something else with that time (just as when we spend\nour money, we give up our chance to do something else with the money). Further, like\nmoney, time is not infinite.\n2. Life is a roller-coaster: This is symbolic because it indicates that there will be ups and\ndowns in life that we have to weather.\n3. He is a rock: This is symbolic because it signifies that he is strong and dependable.\n4. Love is a jewel: This is symbolic because it suggests that love is rare and pressure.\nDR. RAJKUMAR M. LAKHADIVE 4P age Allegory As Symbolism:\nSometimes symbolism takes the form of a literary tool called an allegory. Allegory is an\nextended use of symbolism and metaphors. A story, a poem, or even a whole book can be an\nallegory and the symbolism will permeate throughout. One example of an allegory is the\nmonologue from Shakespeare in As You Like It. “All the world‟s a stage and all the men and\nwomen merely players; they have their exits and their entrances; And one man in his time\nplays many parts.” This is symbolic of the fact that people are putting on a show and that they\nplay many roles over the course of their lives.\nSymbolism in Everyday Life:\nOur language contains an immense number of symbols whose intended meaning or\nsignificance is well-known and accepted by the majority. Of course, many of these do wind\nup in books, magazines, stories, and other written works. Symbolism plays a dominant part in\nthe way in which all higher organisms conduct their lives. It is the cause of progress, and the\ncause of error. The higher animals have gained a faculty of great power, by means of which\nthey can define with some accuracy those distant features in the immediate world by which\ntheir future lives are to be determined. But this faculty is not infallible. The risks are\ncommensurate with its importance.\nSymbolism is found in Colours:\n1. Black is used to represent death or evil.\n2. White stands for life and purity.\n3. Red can symbolize blood, passion, danger, or immoral character.\n4. Purple is a royal colour.\n5. Yellow stands for violence or decay.\n6. Blue represents peacefulness and calm.\nObjects are often used to symbolize something else:\n1. A chain can symbolize the coming together of two things.\n2. A ladder can represent the relationship between heaven and earth or ascension.\n3. A mirror can denote the sun but when it is broken, it can represent an unhappy union\nor a separation.\nEven flowers can have a symbolism:\nDR. RAJKUMAR M. LAKHADIVE 5P age 1. Roses stand for romance.\n2. Violets represent shyness.\n3. Lilies stand for beauty and temptation.\n4. Chrysanthemums represent perfection.\nSymbolic Expression:\nSymbolism can be found almost anywhere. Any time there is something that represents more\nthan its literal meaning, this can be an example of symbolism. In order to appreciate the\nnecessary function of symbolism in the life of any society of human beings, we must form\nsome estimate of the binding and disruptive forces at work. There are many varieties of\nhuman society, each requiring its own particular investigation so far as details are\nconcerned. Thus, geographical unity is at once presupposed. Communities with geographical\nunity constitute the primary type of communities which we find in the world. Indeed the\nlower we go in the scale of being, the more necessary is geographical unity for that close\ninteraction of individuals which constitutes society.\nSocieties of the higher animals, of insects, of molecules, all possess geographical unity. A\nrock is nothing else than a society of molecules, indulging in every species of activity open to\nmolecules. The attention can be drawn to this lowly form of society in order to dispel the\nnotion that social life is a peculiarity of the higher organisms. The contrary is the case. So\nfar as survival value is concerned, a piece of rock, with its past history of some eight hundred\nmillions of years, far outstrips the short span attained by any nation. The emergence of life is\nbetter conceived as a bid for freedom on the part of organisms, a bid for a certain\nindependence of individuality with self-interests and activities not to be construed purely in\nterms of environmental obligations. The immediate effect of this emergence of sensitive\nindividuality has been to reduce the term of life for societies from hundreds of millions of\nyears to hundreds of years, or even to scores of years.\nThe emergence of living beings cannot be ascribed to the superior survival value either of the\nindividuals, or of their societies. National life has to face the disruptive elements introduced\nby these extreme claims for individual idiosyncrasies. Symbolic expression first preserves\nsociety by adding emotion to instinct. Secondly, it affords a foothold for reason by its\ndelineation of the particular instinct which it expresses. This doctrine of the disruptive\ntendency due to novelties, even those involving a rise to finer levels, is illustrated by the\neffect of Christianity on the stability of the Roman Empire. It is also illustrated by the three\nrevolutions which secured liberty and equality for the world––namely the English\nrevolutionary period of the 17th century, the American Revolution, and the French\nDR. RAJKUMAR M. LAKHADIVE 6P age Revolution. England barely escaped a disruption of its social system. America was never in\nany such danger. France, where the entrance of novelty was most intense, did for a time\nexperience this collapse.\nEdmund Burke, the Whig statesman of the 18th century, was the philosopher who was the\napproving prophet of the two earlier revolutions, and the denunciatory prophet of the French\nRevolution.\nThe slightest survey of different epochs of civilization discloses great differences in their\nattitude towards symbolism. For example, during the medieval period in Europe symbolism\nseemed to dominate men‟s imaginations. Architecture was symbolical, ceremonial was\nsymbolical, heraldry was symbolical. With the Reformation, a reaction set in. Men tried to\ndispense with symbols as “fond things, vainly invented,” and concentrated on their direct\napprehension of the ultimate facts. But such symbolism is on the fringe of life. It has an\nunessential element in its constitution. The very fact that it can be acquired in one epoch and\ndiscarded in another epoch testifies to its superficial nature.\nThere are deeper types of symbolism, in a sense artificial, and yet such that we could not get\non without them. Language, written or spoken, is such a symbolism. The mere sound of a\nword, or its shape on paper, is indifferent. The word is a symbol. Its meaning is constituted\nby the ideas, images, and emotions, which it raises in the mind of the hearer. There is also\nanother sort of language, purely a written language, which is constituted by the mathematical\nsymbols of the science of algebra. In some ways, these symbols are different to those of\nordinary language, because the manipulation of the algebraical symbols does our reasoning\nfor us, provided that we keep to the algebraic rules. This is not the case with ordinary\nlanguage. We can never forget the meaning of language, and trust to mere syntax to help us\nout. In any case, language and algebra seem to exemplify more fundamental types of\nsymbolism.\nCollins English Dictionary – Complete and Unabridged HarperCollins Publishers\n1991, 1994, 1998, 2000, 2003.\nThe American Heritage Dictionary of the English Language, Fourth Edition\ncopyright 2000, by Houghton Mifflin Company. Updated in 2009.\nPublished by Houghton Mifflin Company. All rights reserved.\nHans Biedermann, Dictionary of Symbols, vii.\nThe Secret Language of Symbols, 1993: 8\nThompson & Davenport, The Dictionary of Graphic Images. 1990.\nDR. RAJKUMAR M. LAKHADIVE 7P age "}