{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nLiterary Criticism\nHow to Read Like a Writer\nIn 1997, I was a recent college graduate living in London for six months and working at the Palace Theatre owned by Andrew Lloyd Webber.* The\nPalace was a beautiful red brick, four-story theatre in the heart of London’s famous West End, and eight times a week it housed a threehour\nperformance of the musical Les Miserables. Because of antiquated \u0000re-safety laws, every theatre in the city was required to have a certain\nnumber of sta\u0000 members inside watching the performance in case of an emergency.\nMy job (in addition to wearing a red tuxedo jacket) was to sit inside the dark theater with the patrons and make sure nothing went wrong. It didn’t\nseem to matter to my supervisor that I had no training in security and no idea where we kept the \u0000re extinguishers. I was pretty sure that if there\nwas any trouble I’d be running down the back stairs, leaving the patrons to fend for themselves. I had no intention of dying in a bright red tuxedo.\nThere was a Red Coat stationed on each of the theater’s four \u0000oors, and we all passed the time by sitting quietly in the back, reading books with\ntiny \u0000ashlights. It’s not easy trying to read in the dim light of a theatre—\u0000ashlight or no \u0000ashlight—and it’s even tougher with shrieks and shouts\nand gunshots coming from the stage. I had to focus intently on each and every word, often rereading a single sentence several times.\nSometimes I got distracted and had to re-read entire paragraphs. As I struggled to read in this environment, I began to realize that the way I was\nreading—one word at a time—was exactly the same way that the author had written the text. I realized writing is a word-by-word, sentence-by-\nsentence process. The intense concentration required to read in the theater helped me recognize some of the interesting ways that authors\nstring words into phrases into paragraphs into entire books.\nI came to realize that all writing consists of a series of choices.\nI was an English major in college, but I don’t think I ever thought much about reading. I read all the time. I read for my classes and on the\ncomputer and sometimes for fun, but I never really thought about the important connections between reading and writing, and how reading in a\nparticular way could also make me a better writer.\nWhat Does It Mean to Read Like a Writer?\nWhen you Read Like a Writer (RLW) you work to identify some of the choices the author made so that you can better understand how such\nchoices might arise in your own writing. The idea is to carefully examine the things you read, looking at the writerly techniques in the text in\norder to decide if you might want to adopt similar (or the same) techniques in your writing.\nYou are reading to learn about writing.\nInstead of reading for content or to better understand the ideas in the writing (which you will automatically do to some degree anyway), you are\ntrying to understand how the piece of writing was put together by the author and what you can learn about writing by reading a particular text.\nAs you read in this way, you think about how the choices the author made and the techniques that he\/she used are in\u0000uencing your own\nresponses as a reader. What is it about the way this text is written that makes you feel and respond the way you do?\nThe goal as you read like a writer is to locate what you believe are the most important writerly choices represented in the text—choices as large\nas the overall structure or as small as a single word used only once—to consider the e\u0000ect of those choices on potential readers (including\nyourself). Then you can go one step further and imagine what di\u0000erent choices the author might have made instead, and what e\u0000ect those\ndi\u0000erent choices would have on readers.\nSay you’re reading an essay in class that begins with a short quote from President Barack Obama about the war in Iraq. As a writer, what do you\nthink of this technique? Do you think it is e\u0000ective to begin the essay with a quote? What if the essay began with a quote from someone else?\nWhat if it was a much longer quote from President Obama, or a quote from the President about something other than the war?\nAnd here is where we get to the most important part: Would you want to try this technique in your own writing?\nWould you want to start your own essay with a quote? Do you think it would be e\u0000ective to begin your essay with a quote from President\nObama? What about a quote from someone else?\nYou could make yourself a list. What are the advantages and disadvantages of starting with a quote? What about the advantages and\ndisadvantages of starting with a quote from the President? How would other readers respond to this technique? Would certain readers (say\nDemocrats or liberals) appreciate an essay that started with a quote from President Obama better than other readers (say Republicans or\nconservatives)? What would be the advantages and disadvantages of starting with a quote from a less divisive person? What about starting with\na quote from someone more divisive?\nThe goal is to carefully consider the choices the author made and the techniques that he or she used, and then decide whether you want to\nmake those same choices or use those same techniques in your own writing. Author and professor Wendy Bishop explains how her reading\nprocess changed when she began to read like a writer:\nIt wasn’t until I claimed the sentence as my area of desire, interest, and expertise—until I wanted to be a writer writing better—that I had to\nlook underneath my initial readings . . . I started asking, how—how did the writer get me to feel, how did the writer say something so that it\nremains in my memory when many other things too easily fall out, how did the writer communicate his\/her intentions about genre, about\nirony? (119–20)\nBishop moved from simply reporting her personal reactions to the things she read to attempting to uncover how the author led her (and other\nreaders) to have those reactions. This e\u0000ort to uncover how authors build texts is what makes Reading Like a Writer so useful for student\nwriters.\nHow Is RLW Di\u0000erent from “Normal” Reading?\nMost of the time we read for information. We read a recipe to learn how to bake lasagna. We read the sports page to see if our school won the\ngame, Facebook to see who has commented on our status update, a history book to learn about the Vietnam War, and the syllabus to see when\nthe next writing assignment is due. Reading Like a Writer asks for something very di\u0000erent.\nIn 1940, a famous poet and critic named Allen Tate discussed two di\u0000erent ways of reading:\nThere are many ways to read, but generally speaking there are two ways. They correspond to the two ways in which we may be interested\nin a piece of architecture. If the building has Corinthian columns, we can trace the origin and development of Corinthian columns; we are\ninterested as historians. But if we are interested as architects, we may or may not know about the history of the Corinthian style; we must,\nhowever, know all about the construction of the building, down to the last nail or peg in the beams. We have got to know this if we are going\nto put up buildings ourselves. (506)\nWhile I don’t know anything about Corinthian columns (and doubt that I will ever want to know anything about Corinthian columns), Allen Tate’s\nmetaphor of reading as if you were an architect is a great way to think about RLW. When you read like a writer, you are trying to \u0000gure out how\nthe text you are reading was constructed so that you learn how to “build” one for yourself. Author David Jauss makes a similar comparison when\nhe writes that “reading won’t help you much unless you learn to read like a writer. You must look at a book the way a carpenter looks at a house\nsomeone else built, examining the details in order to see how it was made” (64).\nPerhaps I should change the name and call this Reading Like an Architect, or Reading Like a Carpenter. In a way those names make perfect\nsense. You are reading to see how something was constructed so that you can construct something similar yourself.\nWhy Learn to Read Like a Writer?\nFor most college students RLW is a new way to read, and it can be di\u0000cult to learn at \u0000rst. Making things even more di\u0000cult is that your college\nwriting instructor may expect you to read this way for class but never actually teach you how to do it. He or she may not even tell you that you’re\nsupposed to read this way. This is because most writing instructors are so focused on teaching writing that they forget to show students how\nthey want them to read.\nThat’s what this essay is for.\nIn addition to the fact that your college writing instructor may expect you to read like a writer, this kind of reading is also one of the very best\nways to learn how to write well. Reading like a writer can help you understand how the process of writing is a series of making choices, and in\ndoing so, can help you recognize important decisions you might face and techniques you might want to use when working on your own writing.\nReading this way becomes an opportunity to think and learn about writing.\nCharles Moran, a professor of English at the University of Massachusetts, urges us to read like writers because:\nWhen we read like writers we understand and participate in the writing. We see the choices the writer has made, and we see how the writer\nhas coped with the consequences of those choices . . . We “see” what the writer is doing because we read as writers; we see because we\nhave written ourselves and know the territory, know the feel of it, know some of the moves ourselves. (61)\nYou are already an author, and that means you have a built-in advantage when reading like a writer. All of your previous writing experiences—\ninside the classroom and out—can contribute to your success with RLW. Because you “have written” things yourself, just as Moran suggests, you\nare better able to “see” the choices that the author is making in the texts that you read. This in turn helps you to think about whether you want to\nmake some of those same choices in your own writing, and what the consequences might be for your readers if you do.\nWhat Are Some Questions to Ask Before You Start Reading?\nAs I sat down to work on this essay, I contacted a few of my former students to ask what advice they would give to college students regarding\nhow to read e\u0000ectively in the writing classroom and also to get their thoughts on RLW. Throughout the rest of the essay I’d like to share some of\ntheir insights and suggestions; after all, who is better quali\u0000ed to help you learn what you need to know about reading in college writing courses\nthan students who recently took those courses themselves?\nOne of the things that several students mentioned to do \u0000rst, before you even start reading, is to consider the context surrounding both the\nassignment and the text you’re reading. As one former student, Alison, states: “The reading I did in college asked me to go above and beyond,\nnot only in breadth of subject matter, but in depth, with regards to informed analysis and background information on context.” Alison was asked\nto think about some of the factors that went into the creation of the text, as well as some of the factors in\u0000uencing her own experience of\nreading—taken together these constitute the context of reading. Another former student, Jamie, suggests that students “learn about the\nhistorical context of the writings” they will read for class. Writing professor Richard Straub puts it this way: “You’re not going to just read a text.\nYou’re going to read a text within a certain context, a set of circumstances . . . It’s one kind of writing or another, designed for one audience and\npurpose or another” (138).\nAmong the contextual factors you’ll want to consider before you even start reading are:\n• Do you know the author’s purpose for this piece of writing?\n• Do you know who the intended audience is for this piece of writing?\nIt may be that you need to start reading before you can answer these \u0000rst two questions, but it’s worth trying to answer them before you start.\nFor example, if you know at the outset that the author is trying to reach a very speci\u0000c group of readers, then his or her writerly techniques may\nseem more or less e\u0000ective than if he\/she was trying to reach a more general audience. Similarly—returning to our earlier example of beginning\nan essay with a quote from President Obama about the war in Iraq—if you know that the author’s purpose is to address some of the dangers\nand drawbacks of warfare, this may be a very e\u0000ective opening. If the purpose is to encourage Americans to wear sunscreen while at the beach\nthis opening makes no sense at all. One former student, Lola, explained that most of her reading assignments in college writing classes were\ndesigned “to provoke analysis and criticisms into the style, structure, and purpose of the writing itself.”\nIn What Genre Is This Written?\nAnother important thing to consider before reading is the genre of the text. Genre means a few di\u0000erent things in college English classes, but it’s\nmost often used to indicate the type of writing: a poem, a newspaper article, an essay, a short story, a novel, a legal brief, an instruction manual,\netc. Because the conventions for each genre can be very di\u0000erent (who ever heard of a 900-page newspaper article?), techniques that are\ne\u0000ective for one genre may not work well in another. Many readers expect poems and pop songs to rhyme, for example, but might react\nnegatively to a legal brief or instruction manual that did so.\nAnother former student, Mike, comments on how important the genre of the text can be for reading:\nI think a lot of the way I read, of course, depends on the type of text I’m reading. If I’m reading philosophy, I always look for signaling words\n(however, therefore, furthermore, despite) indicating the direction of the argument . . . when I read \u0000ction or creative non\u0000ction, I look for\nhow the author inserts dialogue or character sketches within narration or environmental observation. After reading To the Lighthouse [sic]\nlast semester, I have noticed how much more attentive I’ve become to the types of narration (omniscient, impersonal, psychological, realistic,\netc.), and how these di\u0000erent approaches are utilized to achieve an author’s overall e\u0000ect.\nAlthough Mike speci\u0000cally mentions what he looked for while reading a published novel, one of the great things about RLW is that it can be used\nequally well with either published or student-produced writing.\nIs This a Published or a Student-Produced Piece of Writing?\nAs you read both kinds of texts you can locate the choices the author made and imagine the di\u0000erent decisions that he\/she might have made.\nWhile it might seem a little weird at \u0000rst to imagine how published texts could be written di\u0000erently—after all, they were good enough to be\npublished—remember that all writing can be improved. Scholar Nancy Walker believes that it’s important for students to read published work\nusing RLW because “the work ceases to be a mere artifact, a stone tablet, and becomes instead a living utterance with immediacy and texture. It\ncould have been better or worse than it is had the author made di\u0000erent choices” (36). As Walker suggests, it’s worth thinking about how the\npublished text would be di\u0000erent—maybe even better—if the author had made di\u0000erent choices in the writing because you may be faced with\nsimilar choices in your own work.\nIs This the Kind of Writing You Will Be Assigned to Write Yourself?\nKnowing ahead of time what kind of writing assignments you will be asked to complete can really help you to read like a writer. It’s probably\nimpossible (and de\u0000nitely too time consuming) to identify all of the choices the author made and all techniques an author used, so it’s important\nto prioritize while reading. Knowing what you’ll be writing yourself can help you prioritize. It may be the case that your instructor has assigned\nthe text you’re reading to serve as model for the kind of writing you’ll be doing later. Jessie, a former student, writes, “In college writing classes,\nwe knew we were reading for a purpose—to in\u0000uence or inspire our own work. The reading that I have done in college writing courses has\nalways been really speci\u0000c to a certain type of writing, and it allows me to focus and experiment on that speci\u0000c style in depth and without\ndistraction.”\nIf the text you’re reading is a model of a particular style of writing—for example, highly-emotional or humorous—RLW is particularly helpful\nbecause you can look at a piece you’re reading and think about whether you want to adopt a similar style in your own writing. You might realize\nthat the author is trying to arouse sympathy in readers and examine what techniques he\/she uses to do this; then you can decide whether these\ntechniques might work well in your own writing. You might notice that the author keeps including jokes or funny stories and think about whether\nyou want to include them in your writing—what would the impact be on your potential readers?\nWhat Are Questions to Ask As You Are Reading?\nIt is helpful to continue to ask yourself questions as you read like a writer. As you’re \u0000rst learning to read in this new way, you may want to have a\nset of questions written or typed out in front of you that you can refer to while reading. Eventually—after plenty of practice—you will start to ask\ncertain questions and locate certain things in the text almost automatically. Remember, for most students this is a new way of reading, and you’ll\nhave to train yourself to do it well. Also keep in mind that you’re reading to understand how the text was written— how the house was built—more\nthan you’re trying to determine the meaning of the things you read or assess whether the texts are good or bad.\nFirst, return to two of the same questions I suggested that you consider before reading:\n• What is the author’s purpose for this piece of writing?\n• Who is the intended audience?\nThink about these two questions again as you read. It may be that you couldn’t really answer them before, or that your ideas will change while\nreading. Knowing why the piece was written and who it’s for can help explain why the author might have made certain choices or used particular\ntechniques in the writing, and you can assess those choices and techniques based in part on how e\u0000ective they are in ful\u0000lling that purpose\nand\/or reaching the intended audience.\nBeyond these initial two questions, there is an almost endless list of questions you might ask regarding writing choices and techniques. Here are\nsome of the questions that one former student, Clare, asks herself:\nWhen reading I tend to be asking myself a million questions. If I were writing this, where would I go with the story? If the author goes in a\ndi\u0000erent direction (as they so often do) from what I am thinking, I will ask myself, why did they do this? What are they telling me?\nClare tries to \u0000gure out why the author might have made a move in the writing that she hadn’t anticipated, but even more importantly, she asks\nherself what she would do if she were the author. Reading the text becomes an opportunity for Clare to think about her own role as an author.\nHere are some additional examples of the kinds of questions you might ask yourself as you read:\n• How e\u0000ective is the language the author uses? Is it too formal? Too informal? Perfectly appropriate?\nDepending on the subject matter and the intended audience, it may make sense to be more or less formal in terms of language. As you begin\nreading, you can ask yourself whether the word choice and tone\/ language of the writing seem appropriate.\n• What kinds of evidence does the author use to support his\/her claims? Does he\/she use statistics? Quotes from famous people? Personal\nanecdotes or personal stories? Does he\/she cite books or articles?\n• How appropriate or e\u0000ective is this evidence? Would a di\u0000erent type of evidence, or some combination of evidence, be more e\u0000ective?\nTo some extent the kinds of questions you ask should be determined by the genre of writing you are reading. For example, it’s probably worth\nexamining the evidence that the author uses to support his\/ her claims if you’re reading an opinion column, but less important if you’re reading a\nshort story. An opinion column is often intended to convince readers of something, so the kinds of evidence used are often very important. A\nshort story may be intended to convince readers of something, sometimes, but probably not in the same way. A short story rarely includes\nclaims or evidence in the way that we usually think about them.\n• Are there places in the writing that you \u0000nd confusing? What about the writing in those places makes it unclear or confusing?\nIt’s pretty normal to get confused in places while reading, especially while reading for class, so it can be helpful to look closely at the writing to\ntry and get a sense of exactly what tripped you up. This way you can learn to avoid those same problems in your own writing.\n• How does the author move from one idea to another in the writing? Are the transitions between the ideas e\u0000ective? How else might he\/she\nhave transitioned between ideas instead?\nNotice that in these questions I am encouraging you to question whether aspects of the writing are appropriate and e\u0000ective in addition to\ndeciding whether you liked or disliked them. You want to imagine how other readers might respond to the writing and the techniques you’ve\nidenti\u0000ed. Deciding whether you liked or disliked something is only about you; considering whether a technique is appropriate or e\u0000ective lets\nyou contemplate what the author might have been trying to do and to decide whether a majority of readers would \u0000nd the move successful. This\nis important because it’s the same thing you should be thinking about while you are writing: how will readers respond to this technique I am\nusing, to this sentence, to this word? As you read, ask yourself what the author is doing at each step of the way, and then consider whether the\nsame choice or technique might work in your own writing.\nWhat Should You Be Writing As You Are Reading?\nThe most common suggestion made by former students—mentioned by every single one of them—was to mark up the text, make comments in\nthe margins, and write yourself notes and summaries both during and after reading. Often the notes students took while reading became ideas\nor material for the students to use in their own papers. It’s important to read with a pen or highlighter in your hand so that you can mark—right on\nthe text—all those spots where you identify an interesting choice the author has made or a writerly technique you might want to use. One thing\nthat I like to do is to highlight and underline the passage in the text itself, and then try to answer the following three questions on my notepad:\n• What is the technique the author is using here?\n• Is this technique e\u0000ective?\n• What would be the advantages and disadvantages if I tried this same technique in my writing?\nBy utilizing this same process of highlighting and note taking, you’ll end up with a useful list of speci\u0000c techniques to have at your disposal when\nit comes time to begin your own writing.\nWhat Does RLW Look Like in Action?\nLet’s go back to the opening paragraph of this essay and spend some time reading like writers as a way to get more comfortable with the\nprocess:\nIn 1997, I was a recent college graduate living in London for six months and working at the Palace Theatre owned by Andrew Lloyd Webber.\nThe Palace was a beautiful red brick, four-story theatre in the heart of London’s famous West End, and eight times a week it housed a three-\nhour performance of the musical Les Miserables. Because of antiquated \u0000re-safety laws, every theatre in the city was required to have a\ncertain number of sta\u0000 members inside watching the performance in case of an emergency.\nLet’s begin with those questions I encouraged you to try to answer before you start reading. (I realize we’re cheating a little bit in this case since\nyou’ve already read most of this essay, but this is just practice. When doing this on your own, you should attempt to answer these questions\nbefore reading, and then return to them as you read to further develop your answers.)\n• Do you know the author’s purpose for this piece of writing? I hope the purpose is clear by now; if it isn’t, I’m doing a pretty lousy job of\nexplaining how and why you might read like a writer.\n• Do you know who the intended audience is? Again, I hope that you know this one by now.\n• What about the genre? Is this an essay? An article? What would you call it?\n• You know that it’s published and not student writing. How does this in\u0000uence your expectations for what you will read?\n• Are you going to be asked to write something like this yourself? Probably not in your college writing class, but you can still use RLW to learn\nabout writerly techniques that you might want to use in whatever you do end up writing.\nNow ask yourself questions as you read.\nIn 1997, I was a recent college graduate living in London for six months and working at the Palace Theatre owned by Andrew Lloyd Webber.\nThe Palace was a beautiful red brick, four-story theatre in the heart of London’s famous West End, and eight times a week it housed a three-\nhour performance of the musical Les Miserables. Because of antiquated \u0000re-safety laws, every theatre in the city was required to have a\ncertain number of sta\u0000 members inside watching the performance in case of an emergency.\nSince this paragraph is the very \u0000rst one, it makes sense to think about how it introduces readers to the essay. What technique(s) does the\nauthor use to begin the text? This is a personal story about his time working in London. What else do you notice as you read over this passage?\nIs the passage vague or speci\u0000c about where he worked? You know that the author worked in a famous part of London in a beautiful theater\nowned by a well-known composer. Are these details important? How di\u0000erent would this opening be if instead I had written:\nIn 1997, I was living in London and working at a theatre that showed Les Miserables.\nThis is certainly shorter, and some of you may prefer this version. It’s quick. To the point. But what (if anything) is lost by eliminating so much of\nthe detail? I chose to include each of the details that the revised sentence omits, so it’s worth considering why. Why did I mention where the\ntheater was located? Why did I explain that I was living in London right after \u0000nishing college? Does it matter that it was after college? What\ne\u0000ect might I have hoped the inclusion of these details would have on readers? Is this reference to college an attempt to connect with my\naudience of college students? Am I trying to establish my credibility as an author by announcing that I went to college? Why might I want the\nreaders to know that this was a theater owned by Andrew Lloyd Weber? Do you think I am just trying to mention a famous name that readers will\nrecognize? Will Andrew Lloyd Weber \u0000gure prominently in the rest of the essay?\nThese are all reasonable questions to ask. They are not necessarily the right questions to ask because there are no right questions. They\ncertainly aren’t the only questions you could ask, either. The goal is to train yourself to formulate questions as you read based on whatever you\nnotice in the text. Your own reactions to what you’re reading will help determine the kinds of questions to ask.\nNow take a broader perspective. I begin this essay—an essay about reading—by talking about my job in a theater in London. Why? Doesn’t this\nseem like an odd way to begin an essay about reading? If you read on a little further (feel free to scan back up at the top of this essay) you learn\nin the third full paragraph what the connection is between working in the theater and reading like a writer, but why include this information at all?\nWhat does this story add to the essay? Is it worth the space it takes up?\nThink about what e\u0000ect presenting this personal information might have on readers. Does it make it feel like a real person, some “ordinary guy,”\nis talking to you? Does it draw you into the essay and make you want to keep reading?\nWhat about the language I use? Is it formal or more informal? This is a time when you can really narrow your focus and look at particular words:\nBecause of antiquated \u0000re-safety laws, every theatre in the city was required to have a certain number of sta\u0000 members inside watching the\nperformance in case of an emergency.\nWhat is the e\u0000ect of using the word “antiquated” to describe the \u0000resafety laws? It certainly projects a negative impression; if the laws are\ndescribed as antiquated it means I view them as old-fashioned or obsolete. This is a fairly uncommon word, so it stands out, drawing attention to\nmy choice in using it. The word also sounds quite formal. Am I formal in the rest of this sentence?\nI use the word “performance” when I just as easily could have written “show.” For that matter, I could have written “old” instead of “antiquated.”\nYou can proceed like this throughout the sentence, thinking about alternative choices I could have made and what the e\u0000ect would be. Instead\nof “sta\u0000 members” I could have written “employees” or just “workers.” Notice the di\u0000erence if the sentence had been written:\nBecause of old \u0000re-safety laws, every theatre in the city was required to have a certain number of workers inside watching the show in case\nof an emergency.\nWhich version is more likely to appeal to readers? You can try to answer this question by thinking about the advantages and disadvantages of\nusing formal language. When would you want to use formal language in your writing and when would it make more sense to be more\nconversational?\nAs you can see from discussing just this one paragraph, you could ask questions about the text forever. Luckily, you don’t have to. As you\ncontinue reading like a writer, you’ll learn to notice techniques that seem new and pay less attention to the ones you’ve thought about before.\nThe more you practice the quicker the process becomes until you’re reading like a writer almost automatically.\nI want to end this essay by sharing one more set of comments by my former student, Lola, this time about what it means to her to read like a\nwriter:\nReading as a writer would compel me to question what might have brought the author to make these decisions, and then decide what\nworked and what didn’t. What could have made that chapter better or easier to understand? How can I make sure I include some of the\ngood attributes of this writing style into my own? How can I take aspects that I feel the writer failed at and make sure not to make the same\nmistakes in my writing?\nQuestioning why the author made certain decisions. Considering what techniques could have made the text better. Deciding how to include the\nbest attributes of what you read in your own writing. This is what Reading Like a Writer is all about.\nAre you ready to start reading?\nDiscussion\n1. How is “Reading Like a Writer” similar to and\/or di\u0000erent from the way(s) you read for other classes?\n2. What kinds of choices do you make as a writer that readers might identify in your written work?\n3. Is there anything you notice in this essay that you might like to try in your own writing? What is that technique or strategy? When do you plan\nto try using it?\n4. What are some of the di\u0000erent ways that you can learn about the context of a text before you begin reading it?\nWorks Cited\nBishop, Wendy. “Reading, Stealing, and Writing Like a Writer.” Elements of Alternate Style: Essays on Writing and Revision. Ed. Wendy Bishop.\nPortsmouth, NH: Boynton\/Cook, 1997. Print.\nJauss, David. “Articles of Faith.” Creative Writing in America: Theory and Pedagogy. Ed. Joseph Moxley. Urbana, IL: NCTE, 1989. Print.\nMoran, Charles. “Reading Like a Writer.” Vital Signs 1. Ed. James L. Collins. Portsmouth, NH: Boynton\/Cook, 1990. Print.\nStraub, Richard. “Responding—Really Responding—to Other Students’ Writing.” The Subject is Reading. Ed. Wendy Bishop. Portsmouth, NH:\nBoynton\/Cook, 2000. Print.\nTate, Allen. “We Read as Writers.” Princeton Alumni Weekly 40 (March 8, 1940): 505- 506. Print.\nWalker, Nancy. “The Student Reader as Writer.” ADE Bulletin 106 (1993) 35–37. Print.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}