{"text":"1\n1. Introduction\nIn one form or another, stories are part of everyone’s lives. We are\nconstantly telling each other stories, usually about events that happen to\nus or to people we know. These are usually not invented stories, but they\nare stories nonetheless. And we would not be able to make sense of our\nworld and our lives without them.\nWe also enjoy reading, watching, or listening to stories that we\nknow are not true, but whose characters, places, and events spark our\nimagination and allow us to experience different worlds as if they were\nour own. These are the kind of stories we call ‘fiction.’ Many people like\nto watch series or soap operas on TV. And even more people like to watch\nmovies, whether in the cinema or streamed to their laptop or smartphone.\nVideo games, comics and manga, songs and musicals, stage plays, and\nYouTube blogs, they all tell stories in their own ways. But if there is one\nmedium that has shown itself particularly well-suited to tell engaging\nand lasting stories throughout the ages, it is written language. It is fair\nto say, then, that stories, and most particularly fictions, in their various\nforms and genres, constitute the backbone of literature.\nIn this chapter, we will introduce some basic ideas about storytelling,\nand in particular about the narrative forms of literature and the ways in\nwhich they create meaning. We will also present the main genres into\nwhich literary narratives have been divided historically, and how these\ngenres have evolved from their origins until today. We will then try to\ndefine and frame the two genres of prose fiction that are more common\nnowadays and from which we will draw the examples in this textbook:\nshort stories and novels.\nNot everyone approaches these genres in the same way. Here, we will\nfollow a semiotic model to study and interpret narrative structure and\nmeaning. In order to understand this model, it is essential to grasp the\ndistinction between story and discourse, which will guide our discussions\nthroughout the book. To conclude this chapter, we will consider how\nshort stories and novels spread beyond the written word and become\ninterconnected with other media in contemporary culture.\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.01\nnoitcudortnI\n.1 2\n1.1 What Is Narrative?\nNarrative is notoriously difficult to define with precision. But even before\nwe attempt a working definition of the concept, we already know that\nit refers to storytelling. The term itself comes from the Latin word narro,\nwhich means ‘to tell.’ In English, to narrate means to tell a story. According\nto many anthropologists, this ability is universal amongst human beings.1\nAll peoples, everywhere and throughout history, tell each other stories, or,\nas they are technically called, narratives. As the semiotician and literary\ncritic Roland Barthes once wrote,\nThe narratives of the world are numberless. Narrative is first and foremost\na prodigious variety of genres, themselves distributed amongst different\nsubstances — as though any material were fit to receive man’s stories.\nAble to be carried by articulated language, spoken or written, fixed or\nmoving images, gestures, and the ordered mixture of all these substances;\nnarrative is present in myth, legend, fable, tale, novella, epic, history,\ntragedy, drama, comedy, mime, painting, stained-glass windows, cinema,\ncomics, news items, conversation. Moreover, under this almost infinite\ndiversity of forms, narrative is present in every age, in every place, in every\nsociety; it begins with the very history of mankind and there has never\nbeen a people without narrative. All classes, all human groups, have their\nnarratives, enjoyment of which is very often shared by men with different,\neven opposing, cultural backgrounds. Caring nothing for the division\nbetween good and bad literature, narrative is international, transhistorical,\ntranscultural: it is simply there, like life itself.2\nFor the purpose of this book, we will define narrative as the semiotic\nrepresentation of a sequence of events, meaningfully connected by time\nand cause.3 This definition highlights certain key elements shared by all\nforms of narrative:\n1. Narratives are semiotic representations, that is, they are made\nof material signs (written or spoken words, moving or still\nimages, etc.) which convey or stand for meanings that need to\nbe decoded or interpreted by the receiver.\n2. Narratives present a sequence of events, that is, they connect\nat least two events (actions, happenings, incidents, etc.) in a\ncommon structure or organised whole.\n1 See, for example, William Bascom, ‘The Forms of Folklore: Prose Narratives,’ The\nJournal of American Folklore, 78:307 (1965), 3–20.\n2 Roland Barthes, ‘Introduction to the Structural Analysis of Narrative,’ in A Roland\nBarthes Reader, ed. by Susan Sontag, trans. by Stephen Heath (London: Vintage, 1994),\npp. 251–52.\n3 Based on Narratology: An Introduction, ed. by Susana Onega Jaén and José Angel\nGarcía Landa (London: Routledge, 1996), p. 3, https:\/\/doi.org\/10.4324\/9781315843018\nnoitciF\nesorP 3\n3. Narratives connect events by time and cause, that is, they organise\nthe sequence of events based on their relationship in time (‘Hear\nthe sweet cuckoo. Through the big-bamboo thicket, the full\nmoon filters.’4), as cause and effect (‘Into the old pond, a frog\nsuddenly plunges. The sound of water.’5), or, in most narratives,\nby both temporal and causal relationships.\n4. Narratives are meaningful, that is, they have meaning for both\nsenders and receivers, although these meanings do not need to\nbe the same.\nAs this definition suggests, narrative is the fundamental way in which\nwe humans make sense of our existence. Without effort, we connect\neverything that happens in our lifeworld (events) as a temporal or\ncausal sequence, and most often as both. In order to understand our\nlives and the world around us, we need to tell ourselves and each other\nmeaningful stories. Even our perception of things that appear to be\nstatic inevitably involves making up stories.6 Are you able to look at\nthe picture in Figure 1.1 below without seeing a connected sequence of\nevents, a narrative, in it?\nFig. 1.1 Collision of Costa Concordia, cropped (2012). By Roberto Vongher,\nCC BY-SA 3.0, https:\/\/commons.wikimedia.org\/wiki\/File:Collision_of_\nCosta_Concordia_5_crop.jpg\n4 H aiku by Matsuo Bashō, in Daniel Crump Buchanan, One Hundred Famous Haiku\n(Tokyo: Japan Publications, 1973), p. 87.\n5 H aiku by Matsuo Bashō, in Buchanan, p. 88.\n6 H. Porter Abbott, The Cambridge Introduction to Narrative (Cambridge, UK: Cambridge\nUniversity Press, 2008), https:\/\/doi.org\/10.1017\/cbo9780511816932\nnoitcudortnI\n.1 4\n1.2 Genres\nGenres are conventional groupings of texts (or other semiotic\nrepresentations) based on certain shared features. These groupings, which\nhave been used since ancient times by writers, readers, and critics, serve\na variety of functions:\n1. Classification: By identifying the features that are worthy of\nattention, genres help us to place a particular text among similar\ntexts and distinguish it from most other texts.\n2. Prescription: Genres institute standards and rules that guide\nwriters in their work. Sometimes these rules are actively\nenforced (normative genres), while at other times they act\nsimply as established customs.\n3. Interpretation: These same standards and rules help readers to\ninterpret texts, by providing them with shared conventions and\nexpectations about the different texts they might encounter.\n4. Evaluation: Critics also use these standards and rules when they\nset about judging the artistic quality of a text, by comparing it\nwith other texts in the same genre.\nAlready in Ancient Greece and Rome, narrative was a major literary genre\n(epic), distinct from poetic song (lyric) and stage performance (drama).\nOther generic classifications, particularly those related to the content of\nthe story (tragedy, comedy, pastoral, satire, etc.), were also commonly\nused. But the basic classification of poetic forms at the time, established by\nPlato and Aristotle, was based on whether the poet told the story (diegesis)\nor the story was represented or imitated by actors (mimesis).\nWhile Classical and Neoclassical poetics thought of genres as fixed and\npreordained forms that poets needed to abide by, modern literary theory,\nstarting with the Romantic period, has come to see genres as dynamic\nand loosely defined conventions. Genres change and evolve through time.\nDifferent cultures define and institute different genres. In fact, modern\nliterature has seen a significant expansion of genres, as a visit to any\nbookstore or online bookseller will attest (see Fig. 1.2).\nGenres are continuously evolving across many different dimensions,\nsuch as content, style, form, etc. They are often organised at different levels\nof subordination, in hierarchies or taxonomies of genres and subgenres.\nNowadays, for example, the following generic distinctions are commonly\nused to classify stories:\n1. Fiction vs. nonfiction (based on whether the events and the\ncharacters of the story are invented or taken from reality).\nnoitciF\nesorP 5\nFig. 1.2 E l Ateneo Gran Splendid. A theatre converted into a bookshop. Buenos Aires,\nArgentina. Photo by Galio, CC BY-SA 3.0, https:\/\/commons.wikimedia.org\/\nwiki\/File:Buenos_Aires_-_Recoleta_-_El_Ateneo_ex_Grand_Splendid_2.JPG\n2. Prose vs. verse (based on the literary technique used to tell the\nstory).\n3. Narrative vs. drama (based on whether the story is told or\nshown).\n4. Novel, novella, or short story (based on the length of the story).\n5. Adventure, fantasy, romance, humour, science-fiction, crime,\netc. (based on the content of the story).\nThese and many other generic classifications allow us to impose some\norder on the vast number of stories that are published every year. But they\nare not set in stone and are certainly not eternal. Following the disposition\nof writers, readers, and critics, new genres appear and disappear, often\ncombining the characteristics of previous texts or developing from the\nambiguous boundaries of existing genres, as with the blending of ‘fact’\nand ‘fiction’ into ‘faction’ (or nonfiction novel).7 There is little doubt that\nnovels and short stories are the most popular narrative fiction genres\nin contemporary literature. Like all genres, however, they appeared at\nsome point in history and will only last as long as people are interested in\nwriting and reading them.\n7 S ee David Lodge, The Art of Fiction: Illustrated from Classic and Modern Texts (New York,\nNY: Viking, 1993), p. 203.\nnoitcudortnI\n.1 6\n1.3 Prose Fiction\nProse is text written or spoken with the pattern of ordinary or everyday\nlanguage, without a metrical structure. Verse, on the other hand, is written\nor spoken with an arranged metrical rhythm, and often a rhyme. While\nnarrative fiction composed in verse was very common in the past, modern\nwriters overwhelmingly tell their stories in prose, to the point that most\nreaders today would be baffled if they encountered fiction written in verse.\nBy far, the most popular genres of prose fiction nowadays are novels\nand short stories. The distinction between the two is fairly simple and\nstraightforward: short stories are short, novels are long. Any other\ndifference that we might be able to find between these two genres of\nnarrative is derived in one way or another from this simple fact.\nBut before identifying certain key differences, it is important to\nunderstand that both short stories and novels are modern narrative\ngenres, which only emerged in their current forms during the European\nRenaissance.8 Of course, people had been telling each other fictional stories\nin other forms since much earlier and in many other places. Perhaps the\ntwo forms that had the strongest influence on the emergence of these\nmodern genres of prose fiction were the Classical epic poems, most\nparticularly Homer’s Iliad and Odyssey, and the Hebrew Bible, which is\nfilled with a wide variety of short stories.\nDuring the European Renaissance, these and other influences\nstimulated many writers to produce fictional narratives in prose using\nvernacular languages (instead of Latin), so that they could reach a growing\naudience of readers. These narratives were not intended to be read aloud,\nlike epic poems or other forms of poetry and drama, but silently, as\npart of an intimate experience between the reader and the text.9 Initially,\nthese new narratives, inspired in Middle Eastern and Indian storytelling,\ntended to be short and were often published as a collection, like Giovanni\nBoccaccio’s Decameron (1353, Fig. 1.3). Contemporaries referred to them\nas novelle (singular, novella), which means ‘new’ in Italian and is a term\nstill in use today to refer to short novels. From the perspective of Western\nculture, these early novelle are the first modern forms of prose fiction.\nA little later in the Renaissance, some authors began to extend these\nnovelle into longer stories that occupied the whole book with the adventures\nof a single protagonist. In this way, what we now call the novel was\nborn. The first modern novel, according to most, is Miguel de Cervantes’\nDon Quixote (1605, Fig. 1.4), the tragicomic story of a deluded country\nsquire who tries to revive the heroic lifestyle depicted in fictional books\n8 For a detailed history, see Paul Cobley, Narrative (London, UK: Routledge, 2014).\n9 Alberto Manguel, A History of Reading (New York, NY: Penguin Books, 2014).\nnoitciF\nesorP 7\nFig. 1.3\nBoccaccio, Decameron: ‘The Story of the\nMarchioness of Montferrat,’\n15th century. Bibliothèque nationale\nde France, Public Domain, https:\/\/\ncommons.wikimedia.org\/wiki\/\nFile:Decameron_BNF_MS_\nItalien_63_f_22v.jpeg\nof chivalry. We should not forget, however, that long narratives, similar\nin many ways to modern novels, had already been written and read in\ndifferent cultures throughout history. For example, Lucius Apuleius’ The\nGolden Ass (ca. 170), Longus’ Daphnis and Chloe (2nd century), Murasaki\nShikibu’s Tale of Genji (1010), Ramon Llull’s Blanquerna (1283), or Luo\nGuanzhong’s Romance of the Three Kingdoms (ca. 1321), amongst many\nothers.\nDue to their difference in length, short stories and novels also tend to\ndiffer from each other in certain respects:\n• Short stories need to focus on a few characters, a limited number\nof environments, and just one sequence of events. They cannot\nafford to digress or add unnecessary complications to the plot.\nDensity, concentration, and precision are essential elements of\ngood short-story writing.\n• Novels, on the other hand, can explore many different characters,\nenvironments, and events. The story can be enriched with\nsubplots and complications that add perspective, dynamism,\nand interest to the novel. Characters have room to evolve and\nthe author can introduce digressions and commentary without\nundermining the form. Scope, breadth, and sweep are essential\nelements of good novel writing.\nnoitcudortnI\n.1 8\nFig. 1.4.\nTitle page of the first edition of Miguel\nde Cervantes’ Don Quixote (1605).\nBiblioteca Digital Hispánica, Public\nDomain, https:\/\/en.wikipedia.org\/\nwiki\/Don_Quixote#\/media\/File:El_\ningenioso_hidalgo_don_Quijote_de_\nla_Mancha.jpg\nThis does not mean that the novel is better or worse than the short story.\nThey are simply different forms of narrative, both well adapted to achieve\ntheir own purposes. While the novel can recreate a fictional world in all\nits complexity and vastness, the short story is able to shine a sharper light\non a particular character or situation.\nDiscourse\nStory\nImplied Events (plot) Implied\nNarrator Environments (setting) Narratee\nauthor reader\nCharacters (characterisation)\nReal author Real reader\nFig. 1.5 Semiotic model of narrative. By Ignasi Ribó, CC BY.\nnoitciF\nesorP 9\n1.4 Story and Discourse\nThe systematic study of narratives in order to understand their structure\n(how they work) and function (what they are for) is called narratology.10\nThis field has developed a set of conceptual tools that allow us to discern\nwith more clarity and precision the process through which narratives are\nmeaningful for writers and readers. Narratology is closely linked with\nsemiotics, the study of meaning-making processes, and in particular the\nuse of signs and signifying systems to communicate meanings. In this\nsense, it is important to realise that narratological models are not so\nmuch concerned with explaining individual narratives, but rather they\nattempt to identify the underlying semiotic system that makes narrative\nproduction and reception possible.11\nThe semiotic or communicative model of narrative that will be\ndeveloped in this textbook (see Fig. 1.5) begins by distinguishing the\nreal people who participate in the communicative act of writing and\nreading (the real author and the real reader) from their textual or implied\ncounterparts.\nThus, the ‘implied author’12 is not the actual individual who wrote the\nbook, but a projection of that individual in the book itself. For instance,\nErnest Hemingway (Fig. 1.6) was born in 1899, wrote novels like The Old\nMan and the Sea and short stories like ‘The Snows of Kilimanjaro,’ and\ndied in 1961. When we read one of his narratives, we are not listening to\nhim telling us a story (how could we?), but to a virtual persona to whom\nwe can attribute a style, attitudes, and values, based on what we find in\nthe text itself.\nSimilarly, although we are the actual readers, the text does not address\nus as particular individuals. Otherwise, every book could only have a\nsingle intended receiver and the rest of us would be eavesdroppers. But\nbooks, unlike letters, are generally addressed to an abstract or generic\nreceiver. We can define the notion of ‘implied reader’13 as the virtual\npersona to whom the implied author is addressing the narrative, as can\nbe deduced from the text itself. When anyone of us, at any time, picks up\na Hemingway novel or short story and starts to read it, we are effectively\nstepping into the shoes of its implied reader.\n10 See Mieke Bal, Narratology: Introduction to the Theory of Narrative (Toronto: University\nof Toronto Press, 2017).\n11 David Herman, Basic Elements of Narrative (Chichester, UK: Wiley-Blackwell, 2009),\nhttps:\/\/doi.org\/10.1002\/9781444305920; Jørgen Dines Johansen, Literary Discourse: A\nSemiotic-Pragmatic Approach to Literature (Toronto: University of Toronto Press, 2002),\nhttps:\/\/doi.org\/10.3138\/9781442676725\n12 Wayne C. Booth, The Rhetoric of Fiction (Chicago, IL: University of Chicago Press, 1983).\n13 Wolfgang Iser, The Implied Reader: Patterns of Communication in Prose Fiction from\nBunyan to Beckett (Baltimore, MD: Johns Hopkins University Press, 1995).\nnoitcudortnI\n.1 10\nFig. 1.6\nErnest Hemingway posing for a\ndust-jacket photo by Lloyd Arnold\nfor the first edition of For Whom the\nBell Tolls (1940), at Sun Valley Lodge,\nIdaho, 1939. By Lloyd Arnold, Public\nDomain, https:\/\/en.wikipedia.org\/wiki\/\nFile:ErnestHemingway.jpg\nOnce we move into the narrative text itself, which already contains an\nimplied author and an implied reader, both only circumstantially related\nto human beings in the real world, we need to distinguish two different\nlevels of communication: discourse and story.14\nAt one level, there is the message that the implied author sends to the\nimplied reader. We will call this message ‘discourse.’ Narrative discourse\nis the means through which the narrative is communicated by the implied\nauthor to the implied reader. It includes elements like:\n• Narration (narrator and narratee, point of view, etc.)\n• Language\n• Theme\nThe content of narrative discourse is a ‘story.’ But the story is not told\ndirectly by the implied author to the implied reader. It is the narrator\n(a figure of discourse) who tells the story to a narratee (another figure\nof discourse). Sometimes, narrators and narratees are also characters\nin the story, but at other times they are not. Therefore, we cannot say\nthat narrators or narratees are people, nor even characters. Both exist\nonly in narrative discourse. The story, then, is simply what the narrator\ncommunicates to the narratee (see Fig. 1.7). It includes elements like:\n14 See Seymour Benjamin Chatman, Reading Narrative Fiction (New York, NY: Macmillan,\n1993); Seymour Benjamin Chatman, Story and Discourse: Narrative Structure in Fiction\nand Film (Ithaca, NY: Cornell University Press, 2000).\nnoitciF\nesorP 11\nFig. 1.7 Semiotic model of narrative shown in speech bubbles. By Ignasi Ribó, CC BY.\n• Events (plot)\n• Environments (setting)\n• Characters (characterisation)\nIn the next chapters, we will examine all these elements in more detail. First,\nwe will look at the key elements of story: plot, setting, and characterisation.\nThen, we will examine the key elements of discourse: narration, language,\nand theme. While reading these chapters it is important to keep in mind\nthe fundamental distinction between story and discourse, without which\nmany aspects of narrative fiction cannot be properly understood.\n1.5 Beyond Literature\nAs we have seen, narratives are not confined to literary works. Certainly,\nnovels and short stories have been the privileged vehicles of storytelling\nsince the European Renaissance until the present day. But the invention of\nother media, such as cinema, television, or the Internet, has been rapidly\nchanging the way people produce and consume narratives.\nDuring the twentieth century, cinema developed into an alternative\nmedium to tell the kind of stories that previously were the domain\nof novels or plays. Like novels, movies are narratives that present\na sequence of events connected by time and cause. Unlike novels,\nhowever, movies are not meant to be read, but to be watched. In this\nsense, movies are like theatre plays: they show a performance of the\nevents, environments, and characters of the story, rather than having\nnoitcudortnI\n.1 12\na narrator convey those events, environments, and characters through\nwords. Of course, cinema is not completely like drama, because the\ncamera, by selecting and framing the events presented in the narrative,\nacts in some ways like a narrator. In fact, we may well consider cinema\na new narrative form, one that draws both from the epic (prose fiction)\nand dramatic (stage play) genres.15\nThe intimate relationship between literary and cinematographic\nnarratives is clearly shown by the fact that many movies have tried to\nretell the stories found in prose fiction. In general, a narrative based on a\nstory previously presented in a different medium is called an adaptation.\nIn some cases, prose fictions are also adaptations, for example when they\ntake their stories from journalistic accounts, history books, or even movies.\nMuch more common, however, is for movies to attempt to bring successful\nnovels and short stories to the screen. For example, J. K. Rowling’s series\nof novels about the adventures of the young wizard Harry Potter and\nhis friends has been adapted into popular movies by Hollywood (see Fig.\n1.8). Television has also drawn many of its fictions from literary narratives.\nOne example is the adaptation of George R. R. Martin’s series of medieval\nfantasy novels A Song of Ice and Fire into a successful television show,\nGame of Thrones.\nFig. 1.8 Warner Bros. Studio Tour London: The Making of Harry Potter. Photo\nby Karen Roe, CC BY 2.0, https:\/\/commons.wikimedia.org\/wiki\/File:The_\nMaking_of_Harry_Potter_29-05-2012_(7528990230).jpg\nAdaptations are always the subject of passionate debate and controversy.\nMany attempts to adapt great novels to cinema or television have been\n15 See Robert Stam, Film Theory: An Introduction (Malden, MA: Blackwell, 2000).\nnoitciF\nesorP 13\nnegatively received by spectators, who decry the lack of respect for the\noriginal story or find the movie less engaging and pleasing than the novel.\nLess frequently, film adaptations are acclaimed by spectators and critics\nas superior to the novels or short stories that inspired them.\nWhat most people tend to forget is that adaptations are not translations\nof the original works. Rather, an adaptation is always an interpretation. In\nthe same way that two readers will never read the same novel, because their\ninterpretation of the events, environments, and characters represented in\nthe story will be different, an adaptation is necessarily a subjective reading\nof the original text. Moreover, adaptations are creative interpretations,\nbecause they produce new texts or semiotic representations (cinema,\ntelevision, comic, videoclip, etc.) driven by their own artistic motivations\nand structural constraints.\nThe fact is that stories cannot be contained in any particular medium\nor restricted to any predetermined set of rules. Once they have been\ntold, in whatever form or shape, and as long as people pay attention\nto them, they become part of our cultural makeup. People are free to\nread them and use them as they like, whether it is for their own private\nenjoyment, or to adapt, transform, and share them with others. These\nadaptations may try to be as faithful as possible to what the adapter\nthinks is the original intention of the author or the true meaning of the\ntext. But they can also subvert those meanings through irony, humour,\nand commentary, like the memes that proliferate in the Internet era. At\nthe end of the day, stories are not there to be revered and conserved in\na state of purity. They constitute the fundamental means by which we\nhumans give meaning to our world. And as such, they are always open\nto new interpretations.16\nSummary\n• Narrative is the semiotic representation of a sequence of events,\nmeaningfully connected by time and cause. Literary narratives\nuse written language to represent the connected sequence of\nevents.\n• There are many ways to classify literary narratives into different\ngenres, according, for example, to the truthfulness of the events\n(fiction and nonfiction), to the way the story is told (prose and\nverse), to the length of the story (novel and short story), or to\nthe content of the story (adventure, science-fiction, fantasy,\nromance, etc.).\n16 Umberto Eco, The Open Work (Cambridge, MA: Harvard University Press, 1989).\nnoitcudortnI\n.1 14\n• Prose fiction is narrative written without a metrical pattern that\ntells an imaginary or invented story. The most common genres\nof prose fiction in modern literature are novels and short stories.\nNovels tend to be much longer than short stories.\n• The semiotic model of narrative, developed in the field of\nnarratology, makes a key distinction between discourse (how\nthe narrative is conveyed from the implied author to the implied\nreader) and story (what the narrator tells the narratee).\n• Prose fictions are part of the manifold narratives that we humans\nuse to communicate relevant meanings to each other through a\nwide variety of media, such as film, television, comics, etc.\nReferences\nAbbott, H. Porter, The Cambridge Introduction to Narrative (Cambridge, UK:\nCambridge University Press, 2008), https:\/\/doi.org\/10.1017\/cbo9780511816932\nBal, Mieke, Narratology: Introduction to the Theory of Narrative (Toronto, CA:\nUniversity of Toronto Press, 2017).\nBarthes, Roland, ‘Introduction to the Structural Analysis of Narrative,’ in A Roland\nBarthes Reader, ed. by Susan Sontag, trans. by Stephen Heath (London, UK:\nVintage, 1994), pp. 251–95.\nBascom, William, ‘The Forms of Folklore: Prose Narratives,’ The Journal of American\nFolklore, 78:307 (1965), 3–20.\nBooth, Wayne C., The Rhetoric of Fiction (Chicago, IL: University of Chicago Press,\n1983).\nBuchanan, Daniel Crump, One Hundred Famous Haiku (Tokyo: Japan Publications,\n1973).\nBurroway, Janet, Writing Fiction: A Guide to Narrative Craft (Chicago, IL: University of\nChicago Press, 2019), https:\/\/doi.org\/10.7208\/chicago\/9780226616728.001.0001\nChatman, Seymour Benjamin, Reading Narrative Fiction (New York, NY: Macmillan,\n1993).\nChatman, Seymour Benjamin, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\nCobley, Paul, Narrative (London, UK: Routledge, 2014).\nEco, Umberto, The Open Work (Cambridge, MA: Harvard University Press, 1989).\nHerman, David, Basic Elements of Narrative (Chichester, UK: Wiley-Blackwell,\n2009), https:\/\/doi.org\/10.1002\/9781444305920\nIser, Wolfgang, The Implied Reader: Patterns of Communication in Prose Fiction from\nBunyan to Beckett (Baltimore, MD: Johns Hopkins University Press, 1995).\nJohansen, Jørgen Dines, Literary Discourse: A Semiotic-Pragmatic Approach\nto Literature (Toronto: University of Toronto Press, 2002), https:\/\/doi.\norg\/10.3138\/9781442676725\nnoitciF\nesorP 15\nLodge, David, The Art of Fiction: Illustrated from Classic and Modern Texts (New York,\nNY: Viking, 1993).\nManguel, Alberto, A History of Reading (New York, NY: Penguin Books, 2014).\nOnega Jaén, Susana, and José Angel García Landa, eds., Narratology: An Introduction\n(London, UK: Routledge, 1996), https:\/\/doi.org\/10.4324\/9781315843018\nStam, Robert, Film Theory: An Introduction (Malden, MA: Blackwell, 2000).\nnoitcudortnI\n.1  17\n2. Plot\nIn the previous chapter, we defined narrative as the semiotic representation\nof a sequence of events, meaningfully connected by time and cause. But\nwhat precisely are events? And what constitutes a sequence of events?\nDoes it matter whether the connecting thread that makes up that sequence\nis time or cause, or perhaps both? These are some of the essential questions\nthat we will try to untangle in this chapter.\nTo be sure, they are not easy questions to answer. Narratology has\nstruggled with them for some time and has come up with a range of terms\nand theories that sometimes bring more confusion than clarity. We will\nnot delve here into the complexities of theory or the endless terminological\ndiscussions that have plagued the field.1 But we do need to introduce the\nkey conceptual distinction between story and plot, which has been key to\nachieve a better understanding of the structure and function of narratives.\nThe concept of plot dates all the way back to Aristotle (Fig. 2.1), who\ndefined mythos as the arrangement or ‘organisation of events’ and argued\nthat it was the most important element of storytelling.2 At the beginning\nof the twentieth century, the Russian formalists recovered this concept\nand established a key distinction between the ‘story’ (fabula) and the\n‘plot’ (szujet) of a narrative.3 In the English language, the translation of\nthese terms has created and continues to create a considerable amount\nof confusion, derived from the fact that ‘story’ is used at the same time\nas a generic term for narrative and as a technical term in narratology. For\nthe purpose of this textbook, we will obviate these problems and simply\nintegrate this important distinction into the semiotic model of narrative\npresented in the previous chapter.\n1 See Handbook of Narratology, ed. by Peter Hühn (New York, NY: Walter de Gruyter,\n2009), https:\/\/doi.org\/10.1515\/9783110316469\n2 Aristotle, Poetics, trans. by Malcolm Heath (London, UK: Penguin Books, 1996), p. 11.\n3 V iktor Borisovic Sklovskij, Theory of Prose (Elmwood Park, IL: Dalkey Archive Press,\n1991).\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.02\ntolP\n.2 18\nFig. 2.1\nBust of Aristotle. Marble Roman\ncopy after a Greek bronze original\nby Lysippos from 330 BC. Ludovisi\nCollection, photograph by Jastrow\n(2006), Public Domain, https:\/\/commons.\nwikimedia.org\/wiki\/File:Aristotle_\nAltemps_Inv8575.jpg\nFirst, we will discuss more precisely the distinction between story and\nplot, clarifying what we understand by an ‘event’ and the different ways\nin which the events of a narrative can be connected. Then we will look\nat the mechanisms of emplotment, the specific operations that can be\napplied to a story when arranging it into a plot. By arranging events in a\nmeaningful and coherent structure that has a beginning, a middle, and an\nend, these mechanisms can result in many kinds of plot. We will look at a\nfew of these, which are quite common in prose fiction. Most of these plots\nare motivated by a conflict, which can be external or internal, and lead to\nsome form of resolution. We will look at this ‘story as war’ analogy and\npresent a five-stage general structure that can be found in many narrative\nplots. Finally, we will discuss two important mechanisms of emplotment\nat the micro level, suspense and surprise, which are often used by writers\nto engage readers and hook them to the narrative.\n2.1 The Thread of Narrative\nAs we pointed out earlier, the story is the message that the narrator\ncommunicates to the narratee in a narrative. In this sense, it refers to a set\nof events happening in an alternative world, which we call the storyworld.\nWe can define narrative events as changes of state occurring in the\nstoryworld.4 Such a world could be an accurate reflection of the lifeworld\nof the writer and his readers or an imaginary world that has never actually\n4 D avid Herman, ‘Events and Event-Types’, in Routledge Encyclopedia of Narrative Theory,\ned. by David Herman, Manfred Jahn, and Marie-Laure Ryan (London, UK: Routledge,\n2005), pp. 151–52, https:\/\/doi.org\/10.4324\/9780203932896\nnoitciF\nesorP 19\nexisted. Whatever the truthfulness of this storyworld, the events of the\nstory are supposed to have happened in it. These events can be actions\nundertaken by characters, but they can simply be situations, incidents,\nexperiences, or things that happen to them or to their environment.\nLet us imagine a simplified story to clarify these ideas. In this story,\nwe only have five events: (1) George rode to the lake, (2) George slew\nthe dragon, (3) George rescued the princess, (4) George and the princess\nrode away from the lake, and (5) George and the princess got married\nin the castle. We can display these events as marks in a horizontal arrow\nrepresenting time (see Fig. 2.2).\nFig. 2.2 D iagram showing events interconnected by time only. By Ignasi Ribó, CC BY.\nThis is an arrangement of the events according to their succession in time.\nAnd this is what we call the story. Of course, the events in this story are also\nimplicitly connected by cause (for example, event three is the consequence\nof event two). But our arrangement does not stress those connections. It\nsimply reflects when the events happened in relation to each other (event\ntwo comes after event one, event three after event two, etc.).\nIt is unlikely, however, that the narrator will arrange the events of the\nstory in such a simple fashion when telling it to the narratee. One thing\nthe narrator could do, for example, is to stress the causal connections\nbetween the events: (1) George rode to the lake looking for the princess,\n(2) George slew the dragon in order to rescue the princess, (3) After killing\nthe dragon, George rescued the princess, (4) George and the princess\nrode away from the lake to find safety in her castle, and (5) The princess\nmarried George to thank him for rescuing her from the dragon. We can\ndisplay the causal connections with curved lines (see Fig. 2.3).\nFig. 2.3 Diagram showing events interconnected by time and cause. By Ignasi Ribó,\nCC BY.\nAnother thing that the narrator could do is to present the events in a\ndifferent order, without necessarily following their sequence in time. For\nexample, he could begin by telling the narratee about (1) the wedding\nbetween George and the princess, and only then go on to explain why\nthe princess accepted George as her husband by telling how (2) George\ntolP\n.2 20\nrode to the lake looking for the princess, (3) slew the dragon, and (4)\nescaped to safety with the princess. In this case, we would need to alter\nthe representation of the sequence of events in the narrative (see Fig. 2.4).\nFig. 2.4 Diagram showing events interconnected by time and cause, with the order\nof events altered by emplotment. By Ignasi Ribó, CC BY.\nWe call the actual arrangement of the sequence of events by the narrator of\nthe story the ‘plot.’ Emplotment can involve simple modifications to the\nstory, for example when the narrator tells the story ‘as it happened.’ But\nplots can also be much more complex and modify substantially the order\nof events, their duration, or the connections between them. As the novelist\nE. M. Forster explained,\nWe have defined a story as a narrative of events arranged in their time-\nsequence. A plot is also a narrative of events, the emphasis falling on\ncausality. ‘The king died, and then the queen died,’ is a story. ‘The king\ndied, and then the queen died of grief,’ is a plot. The time-sequence is\npreserved, but the sense of causality overshadows it. Or again: ‘The queen\ndied, no one knew why, until it was discovered that it was through grief\nat the death of the king.’ This is a plot with a mystery in it, a form capable\nof high development. It suspends the time-sequence, it moves as far away\nfrom the story as its limitations will allow. Consider the death of the queen.\nIf it is in a story we say, ‘and then?’ If it is in a plot we ask, ‘why?’5\n2.2 Emplotment\nStories can be arranged into many kinds of plot. And there can never\nbe a story without a plot, even if the plot is simply the presentation of\nevents in their chronological succession, which would make the plot\nindistinguishable from the story. In fact, the story is only an abstraction,\nwhich is never accessed directly as such (either by the reader, the implied\nreader, or the narratee). What we read in a narrative is always a particular\nemplotment of the story.\nFor instance, the story of Saint George and the dragon, which we\nhave simplified as an example in the previous section, has been told in\ndifferent ways (Fig. 2.5). The succession of events is not the same in all\nthese retellings. The narrator might begin the tale with the apparition of\n5 E. M. Forster, Aspects of the Novel (San Diego, CA: Harcourt Brace Jovanovich, 1985),\np. 86.\nnoitciF\nesorP 21\nFig. 2.5\nMiniature of St. George and the\nDragon, ms. of Legenda aurea, Paris\n(1382). British Library Royal 19 B XVII,\nf. 109, Public Domain, https:\/\/upload.\nwikimedia.org\/wikipedia\/commons\/e\/\nef\/St_George_Royal19BXVII_109.jpg\nthe plague-bearing dragon that poisons the lake and forces the kingdom\nto sacrifice their children to appease the beast. But the narrator might\nalso begin with George riding near the lake and hearing the cries of\ndistress from the princess. Some retellings invest much time recreating\nthe conversation between George and the princess at that moment, while\nothers move directly to the fight between George and the dragon. In\nsome retellings of the story, George marries the princess at the end. But\nin others the marriage, whether it happened or not, is left out of the tale.\nAll these versions stem from different decisions on the part of the authors\nand result in different plots of the same story. We call emplotment the\nprocess of arranging the events of the story into a narrative message\ncommunicated by the narrator to the narratee.\nEmplotment involves five basic operations:6\n1. Order: The sequence of events in the plot may or may not follow\na strict chronological succession. Emplotment can modify the\norder in which the events are presented by the narrator, for\nexample by beginning at some point in the middle of the story\n(in medias res) and then jumping back to events that happened\nearlier (flashback) or later (flashforward).\n2. Duration: The duration of the events in the plot may or may not\nreflect the actual duration of those events in the story. Emplotment\ncan modify the duration of the events presented by the narrator,\nfor example by compressing time (e.g. telling fifty years in the\nlife of a character in one paragraph) or expanding time (e.g.\ndescribing a kiss that lasted for one second in ten pages).\n6 B ased on Gérard Genette, Narrative Discourse: An Essay in Method (Ithaca, NY: Cornell\nUniversity Press, 1990).\ntolP\n.2 22\n3. Frequency: The number of times that events are repeated in a plot\nmay or may not reflect the number of times that those events\noccurred in the story. Emplotment can modify the frequency of\nthe events presented by the narrator, for example by repeating\nthe same event several times in the plot (repetition, e.g. telling\nthe same murder from different perspectives) or collapsing\nseveral events of similar nature into a single event (iteration, e.g.\ntelling the protagonist’s daily work routine as one exemplary\nset of events happening on any given day).\n4. Connection: The connections between the events in the plot may\nor may not reflect the actual connections between the events in\nthe story. Emplotment can modify the meaning of the events\npresented by the narrator through the establishment of explicit\nor implicit causal connections between them. Ultimately, of\ncourse, it will depend on the reader’s interpretation to determine\nwhich causal connections need to be retained from the narrative\nbeyond the basic chronological succession of events.\n5. Relevance: Similarly, the information about the events provided\nin the plot may or may not exhaust the actual information that\nis relevant about those events in the story. Emplotment can\nmodify the meaning of the events presented by the narrator by\nproviding or withholding information related to those events.\nOnce again, the reader will have to interpret which of the pieces\nof information presented are relevant and fill in the gaps left by\nthe narrator.\nNot every plot applies all these operations to the story. As we have seen,\nit is even possible to have a plot that does not modify or add causality\nto the chronological succession of events. These operations are simply\ntheoretical possibilities, which writers may or may not use to arrange the\nevents of the story told by the narrator.\n2.3 Beginnings, Middles, and Ends\nAs pointed out by Aristotle in his Poetics, plots are generally arranged to\nhave a beginning, a middle, and an end.7 But Aristotle was not simply\nstating the obvious fact that plots start at some point, extend during\nsome time, and finish at another point. What he meant is that plots have\nan internal coherence that connects beginnings with endings through a\nmeaningful and purposeful development. Unlike events in life, which\nsimply happen, without any coherence or purpose, emplotted events are\n7 A ristotle, pp. 13–14.\nnoitciF\nesorP 23\nmeaningfully connected to form a coherent whole. In real life, there is no\nsuch thing as a ‘beginning’ or an ‘ending,’ unless someone turns those\nevents into a plot. Even a person’s birth or death are unconnected events,\nwithout any meaning or significance in the general scheme of things. We\nneed to emplot those two events, together with whatever happens in the\nmiddle, into some kind of narrative (e.g. ‘he was born in 1903, worked as\nan accountant during most of his life, and died peacefully in his own bed\naged 82’) before they become a beginning and an end, the opening and\nclosure of a biographical plot.\nBiography, the narrative of a person’s life, is a type of plot that seems\nquite natural to us, accustomed as we are to see ourselves and other\nindividuals as coherent and meaningful entities. It is not surprising,\ntherefore, that biographical plots have often been used by fiction\nwriters to arrange their stories. For example, Daniel Defoe’s classic\nnovel Robinson Crusoe (Fig. 2.6) begins with the eponymous character’s\nbirth and goes on to narrate his life adventures, including the time\nhe spent as a castaway on a remote desert island. Although the novel\nends somewhere in the middle of Robinson’s life, while promising a\nsecond part to the story, the organising principle of the plot is clearly\nbiographical.\nFig. 2.6 Title page and portrait of Robinson Crusoe in the first edition of Daniel\nDefoe’s The Life and Strange Surprizing Adventures of Robinson Crosoe (1719).\nBritish Library, Ambre Troizat, CC BY-SA 4.0, https:\/\/upload.wikimedia.\norg\/wikipedia\/commons\/f\/f1\/The_life_and_Strange_Surprizing_\nAdventures_of_Robinson_Crosoe%2C_London%2C_1719.png\nBut biography is only one of the many kinds of plot that we find in narrative.\nSince Aristotle, many typologies of plot (sometimes called masterplots)\ntolP\n.2 24\nhave been proposed.8 While the best of these typologies might be able to\ncapture certain recurrent aspects of emplotment, they can never embrace\nall possible narrative plots. Provided we take these typologies as an\norientation, and avoid turning them into rigid and normative taxonomies,\nthey can help us to better understand the various ways in which narrators\ncan arrange the events of the plot.\nFor example, the following are seven kinds of plot that we often find\nin popular novels and short stories, described in terms of beginnings,\nmiddles, and ends:9\nFig. 2.7\nIllustration of ‘Hansel and Gretel’\nby Arthur Rackham (1909), Public\nDomain, https:\/\/upload.wikimedia.org\/\nwikipedia\/commons\/d\/d1\/Hansel-and-\ngretel-rackham.jpg\n1. Overcoming the monster: It begins with the protagonist setting\nout to defeat an evil (or threatening) force; it narrates the fight\nbetween the hero and this monster; and it ends with the defeat\nof the monster. For example, in ‘Hansel and Gretel’ (Fig. 2.7),\na German fairy tale recorded by the Brothers Grimm, two\nchildren try to escape from the forest house of a witch who has\nkidnapped them and intends to eat them.\n8 See Seymour Benjamin Chatman, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\n9 Christopher Booker, The Seven Basic Plots: Why We Tell Stories (London: Continuum,\n2004).\nnoitciF\nesorP 25\n2. From rags to riches: It begins with a poor protagonist; it narrates\nhow she goes on to acquire wealth and power, but then loses\neverything again (or loses and regains it once more); and it ends\nwith her becoming wiser thanks to the experience. An example\nof this kind of plot is the Middle Eastern folk tale ‘Aladdin\nand the Magic Lamp,’ often included in One Thousand and One\nNights, which tells the adventures of a young and poor orphan\nwho becomes rich and powerful with the help of a genie.\n3. The quest: It begins with the protagonist (and maybe some\ncompanions) setting out to obtain an important object; it\nnarrates the many obstacles that they must face; and it ends\nwith the successful completion of the quest. J. R. R. Tolkien’s\nnovel The Hobbit is a famous example of this kind of plot, where\nthe hobbit Bilbo and his companions set out on a dangerous\nquest to recover the treasure guarded by a dragon.\n4. Voyage and return: It begins with the protagonist departing her\nhome for a strange land; it narrates the threats and adventures\nthat she needs to overcome; and it ends with her return home\nenriched by the experience. Lewis Carroll’s fantasy novel Alice’s\nAdventures in Wonderland, where the protagonist suddenly\nfinds herself in a strange underground world, is a well-known\nexample of this kind of plot.\n5. Comedy: It begins with a light and humorous protagonist; it\nnarrates the various circumstances and problems that she\nmust overcome; and it ends with the happy resolution of these\ncircumstances or problems. An example of a novel with this kind\nof plot is Jane Austen’s Sense and Sensibility, where the Dashwood\nsisters end up happily married after all sorts of complications.\n6. Tragedy: It begins with a protagonist who is affected by some sort\nof mistake or flaw that is the origin of a certain conflict; it narrates\nhow he tries to overcome this conflict; and it ends with his failure\nto do so, and perhaps with the recognition of his mistake or flaw.\nA modern example of this kind of plot is Vladimir Nabokov’s\ncontroversial novel Lolita, where the sexual obsession of an aged\nliterature professor for a twelve-year-old girl leads him to commit\nsuccessive transgressions until he dies in prison.\n7. Rebirth: It begins with the protagonist living her normal life; it\nnarrates how certain circumstances (normally adverse ones)\nforce her to change her life; and it ends with her transformation\ninto a new person capable of overcoming those circumstances.\nA well-known example of this kind of plot is Charles Dickens’\ntolP\n.2 26\nA Christmas Carol, where old Scrooge, a miser who is unable\nto partake in Christmas celebrations, becomes a kinder person\nafter receiving the visit of several ghosts.\n2.4 Conflict and Resolution\nIn the masterplots described above, the main characters (or protagonists)\nare motivated to act by some conflict. Whether this conflict is external (e.g.\na monster or a circumstance that poses a threat) or internal (e.g. a mistake\nor a flaw in one’s character), the kernel of the plot seems to be the need to\novercome this conflict and find some form of resolution.\nAncient Greeks referred to conflict as agon. The importance of this\nconcept for narrative can be grasped by the fact that we still call the\nleading character of a story its ‘protagonist’ (meaning, one who fights for\nsomething or someone). We also call the main enemy of this character,\nwhether it is another character or some natural or supernatural force, the\n‘antagonist’ (meaning, one who fights against something or someone).\nFig. 2.8\nOedipus and the Sphinx. Tondo of an\nAttic red-figure kylix, 480–470 BC. From\nVulci. Photograph by Juan José Moral\n(2009), captured at Museo Gregoriano\nEtrusco, room XI, Public Domain,\nhttps:\/\/commons.wikimedia.org\/wiki\/\nFile:Oidipous_sphinx_MGEt_16541_\nreconstitution.svg\nIn the Poetics, Aristotle claims that plots can be divided into those where\nthe protagonist succeeds in overcoming the conflict (goes from misfortune\nto fortune, as in comedy) and those where the protagonist falls victim\nto the conflict (goes from fortune to misfortune, as in tragedy).10 In both\ncases, there is a reversal of fortune (peripeteia) and some form of resolution,\nwhich may or may not involve a recognition or gain in knowledge for\nthe protagonist (anagnorisis).11 For example, in Sophocles’ Oedipus Rex\n(Fig. 2.8), King Oedipus faces a devastating plague in his city of Thebes\n10 Aristotle, pp. 8–9.\n11 Aristotle, pp. 18–19.\nnoitciF\nesorP 27\n(conflict) and seeks to find the person responsible for spreading the\ninfection. A carefully crafted series of events lead Oedipus to discover\n(reversal of fortune and recognition) that the culprit is none other than\nhimself, having unknowingly killed his father and married his own\nmother many years earlier. At the end, after his mother\/wife commits\nsuicide, Oedipus blinds himself and is banished from Thebes.\nAristotle’s description of tragic conflict and resolution, as exemplified\nin Oedipus Rex, has been tremendously influential throughout history\nand has resulted in the view that all plots are essentially motivated by a\nconflict and move forward to close or resolve this conflict. This idea has\nbeen formalised in the five stages of Freytag’s pyramid (Fig. 2.9), which\nwas originally conceived to describe the conventional emplotment of\ndramatic plays in five acts,12 but is often applied to narrative plots as well:\nFig. 2.9 Schema of Freytag’s pyramid. By Ignasi Ribó, based on Gustav Freytag,\nFreytag’s Technique of the Drama: An Exposition of Dramatic Composition and\nArt, trans. by Elias J MacEvan (Charleston, SC: Bibliobazaar, 2009), CC BY.\n1. Exposition: In this initial stage, the environments and the\ncharacters, particularly the protagonist, are introduced. There is\nno conflict yet, but we might get indications about the conflicting\ngoals of the characters and the motives that will drive the plot.\n2. Rising action: At some point, the (external or internal) conflict\nis revealed and provokes a series of events (confrontations,\nreversals, adventures, etc.) that move the plot forward and\nalways towards a higher degree of intensity. In novels and short\nstories, this stage tends to be the longest and includes most of\nthe vicissitudes of the plot.\n3. Climax: This is the point where the rising action achieves its\nmaximum level of intensity and the conflict reaches the decisive\nconfrontation. It is also a turning point, because from here on\nthe conflict can only move towards the final resolution. The\n12 Gustav Freytag, Freytag’s Technique of the Drama: An Exposition of Dramatic Composition\nand Art, trans. by Elias J MacEvan (Charleston, SC: Bibliobazaar, 2009).\ntolP\n.2 28\nclimax is not always an external event, such as a battle between\nthe protagonist and the antagonist. It can also be a more subtle\nreversal of fortune, for example the recognition of one’s own\nguilt, which decides the outcome of the conflict.\n4. Falling action: The events that follow the climax might still be\nmotivated by the conflict, but they tend to wane in intensity\nand progressively lead to some form of resolution. Characters\nsettle their confrontations, solve or abandon their problems,\novercome or submit to existing threats and enemies. In one\nway or another, the climax has already decided the outcome of\nthe conflict and the falling action needs to bring the situation\nback to an equilibrium. In prose fiction, this stage is often much\nshorter and does not include as many events as the rising action.\n5. Resolution: At the end, the conflict has been solved, either\nbecause the protagonist or the antagonist have won, or because\nthey have found some way to solve their disagreements, or\nsimply because they have exhausted their capacity to continue\nfighting. In the resolution stage, we might be shown what the\ncharacters do after everything is settled or find answers for the\noutstanding questions. In prose fiction, this stage often tries to\nprovide a sense of closure.\nThis model, based on a ‘story as war’ analogy, is often presented as the only\nway to emplot a story. While it is true that many popular fiction stories\nfollow this pattern in one way or another, there are other plots, particularly\nin modern and contemporary literature, that depart quite significantly\nfrom the dynamic of conflict and resolution that author Ursula K. Le Guin\ndescribed as the ‘gladiatorial view of fiction’:\nPeople are cross-grained, aggressive, and full of trouble, the storytellers\ntell us; people fight themselves and one another, and their stories are full\nof their struggles. But to say that that is the story is to use one aspect of\nexistence, conflict, to subsume all other aspects, many of which it does not\ninclude and does not comprehend.13\nWhile perhaps not as common, there are alternative models of emplotment\nthat reflect these other aspects of existence. One such model could be ‘story\nas birth,’ where the plot is motivated, not by conflict, but by the desire and\nthe struggle to arise and grow, as in the experience of many living things.14\nA novel that seems to follow this model of plot is Virginia Woolf’s To The\n13 Quoted in Janet Burroway, Writing Fiction: A Guide to Narrative Craft (Chicago,\nIL: University of Chicago Press, 2019), p. 133, https:\/\/doi.org\/10.7208\/chicago\/\n9780226616728.001.0001\n14 Burroway, p. 134.\nnoitciF\nesorP 29\nLighthouse. While this story does not lack elements of conflict or tension,\nits plot is mainly arranged by the emergence of emotions in the subjective\nexperience of the characters, for example through the creative process\nthat Lily Briscoe undergoes before she is able to complete her painting at\nthe end of the novel.\nYet another model, somehow related to the organic analogy of the\nprevious one, but also incorporating Aristotle’s theory of recognition\n(anagnorisis)15 and James Joyce’s conception of epiphany,16 is ‘story as\nillumination,’ where the protagonist moves from darkness to light,\nfrom ignorance to knowledge, without the need to engage in any form\nof conflict. In Joyce’s collection of short stories, Dubliners, for example,\ncharacters experience sudden moments of illumination (epiphany) that\ngive them a new understanding of their world and produce a meaningful\nchange in their lives.\nEven when modern prose fiction follows the war analogy and\nuses conflict to motivate the plot, it often presents these conflicts as\nfundamentally unresolvable. Many authors see the classic idea of an\nending that brings resolution to the conflict as unrealistic and only fit for\nentertainment. Thus, open and ambiguous endings are quite common in\nserious modern literature, which tends to avoid providing the reader with\nan artificial sense of closure (‘and they lived happily ever after’). Even in\nthese narratives, however, there is often some form of ending. While they\nmight leave many questions unanswered at the end, it is precisely this\nquestioning that provides meaning and gives coherence to the whole plot.\n2.5 Suspense and Surprise\nSo far, we have been speaking of plots at a macro level. But there are\ntwo important mechanisms of emplotment, suspense and surprise, which\noperate at the micro level, particularly as the events move through the\nrising action towards the climax of the plot (provided that the plot follows\nFreytag’s pyramid or a similar structure). These mechanisms cross over in\nsome ways from story to discourse, but we need to discuss them here to\ncomplete our presentation of plot.\nSuspense is a phenomenon that derives from the arrangement of\nevents in the plot, but which cannot exist without the reader. It arises\nfrom the gap between what the reader knows from the previous events\nin the plot and what she anticipates is going to happen next.17 In a way, it\n15 Aristotle, pp. 18–19.\n16 Irene Hendry, ‘Joyce’s Epiphanies,’ The Sewanee Review, 54:3 (1946), 449–67.\n17 Teresa Bridgeman, ‘Time and Space,’ in The Cambridge Companion to Narrative, ed.\nby David Herman (Cambridge, UK: Cambridge University Press, 2007), pp. 52–65,\nhttps:\/\/doi.org\/10.1017\/ccol0521856965\ntolP\n.2 30\nstems from the curiosity of the reader asking herself ‘and then what?’ as\nthe plot unfolds.\nSuspense can be heightened when the reader knows more than the\ncharacters, or even the narrator. For example, the reader might know that\nthe killer is hiding in the bedroom of the detective’s girlfriend, as he walks\nunwittingly back home after leaving her at the door of her apartment.\nBut suspense can be created simply by arranging the events in the plot\nin a way that ignites the curiosity of the reader. For example, the reader,\nas well as the detective and his girlfriend, might know that there is a killer\non the loose. Certain events in the plot might indicate that the killer is\nmoving on to murder the detective’s girlfriend (a cigarette butt found in\nher apartment, a strange midnight call, etc.). The anticipation of future\nevents through hints given earlier in the plot is called foreshadowing.\nUsing foreshadowing is generally enough to create suspense, and it is a\ncommon technique in some genres, such as mystery and horror fiction.\nWhen the event foreshadowed never actually happens, it is called a red\nherring, a technique that is sometimes employed to mislead and surprise\nreaders.\nWhile suspense depends on the reader’s knowledge (or suspicion) of\nevents to come, surprise is an effect of the reader’s ignorance.18 As the plot\nunfolds, the reader anticipates future events based on what she already\nknows. If something unexpected happens, that is a surprise. When they\naffect crucial kernels in the plot or alter the situation of the main characters,\nsurprises are the kind of twists that make readers gasp and experience\nthe thrill of unforeseen revelation. For example, if the reader suddenly\ndiscovers that the killer is actually the detective’s girlfriend, who has been\npreparing her alibi before moving on to murder the detective, the whole\nplot takes a surprising new direction.\nSuspense and surprise can work together in the plot to great effect. By\nkeeping the reader always alert, not knowing whether the next event will\nbe the confirmation of a suspenseful anticipation or an unexpected twist,\nemplotment can create the kind of narrative tension that hooks readers to\nthe book and compels them to keep turning the pages.\nSummary\n• Story is the arrangement of events according to their sequence\nin time, while plot is the arrangement of the events by the\nnarrator when telling them to the narratee. In addition to the\ntemporal connection, events in the plot generally have a causal\nconnection.\n18 Seymour Benjamin Chatman, Reading Narrative Fiction (New York, NY: Macmillan,\n1993), p. 21.\nnoitciF\nesorP 31\n• Emplotment is the arrangement of the events of the story by\nmodifying their order, duration, frequency, connection, or\nrelevance, in order to make a plot.\n• Plots have an internal coherence that connects beginnings with\nends through a meaningful and purposeful development.\n• While there are various ways to connect beginnings with ends,\nemplotment is often motivated by a fundamental conflict or\ntension that moves the plot through the stages of exposition,\nrising action, climax, falling action, and resolution.\n• Emplotment can engage the reader by creating anticipation\nabout future events through suspense and foreshadowing,\nwhile at the same time disproving the reader’s expectations\nthrough surprise.\nReferences\nAristotle, Poetics, trans. by Malcolm Heath (London, UK: Penguin Books, 1996).\nBooker, Christopher, The Seven Basic Plots: Why We Tell Stories (London, UK:\nContinuum, 2004).\nBridgeman, Teresa, ‘Time and Space,’ in The Cambridge Companion to Narrative, ed.\nby David Herman (Cambridge, UK: Cambridge University Press, 2007), pp.\n52–65, https:\/\/doi.org\/10.1017\/ccol0521856965\nBurroway, Janet, Writing Fiction: A Guide to Narrative Craft (Chicago, IL: University of\nChicago Press, 2019), https:\/\/doi.org\/10.7208\/chicago\/9780226616728.001.0001\nChatman, Seymour Benjamin, Reading Narrative Fiction (New York, NY: Macmillan,\n1993).\nChatman, Seymour Benjamin, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\nForster, E. M., Aspects of the Novel (San Diego, CA: Harcourt Brace Jovanovich,\n1985).\nFreytag, Gustav, Freytag’s Technique of the Drama: An Exposition of Dramatic\nComposition and Art, trans. by Elias J MacEvan (Charleston, SC: Bibliobazaar,\n2009).\nGenette, Gérard, Narrative Discourse: An Essay in Method (Ithaca, NY: Cornell\nUniversity Press, 1990).\nHendry, Irene, ‘Joyce’s Epiphanies,’ The Sewanee Review, 54:3 (1946), 449–67.\nHerman, David, ‘Events and Event-Types,’ in Routledge Encyclopedia of Narrative\nTheory, ed. by David Herman, Manfred Jahn, and Marie-Laure Ryan (London,\nUK: Routledge, 2005), pp. 151–52, https:\/\/doi.org\/10.4324\/9780203932896\nHühn, Peter, ed., Handbook of Narratology (New York, NY: Walter de Gruyter, 2009),\nhttps:\/\/doi.org\/10.1515\/9783110316469\nSklovskij, Viktor Borisovic, Theory of Prose (Elmwood Park, IL: Dalkey Archive\nPress, 1991).\ntolP\n.2  33\n3. Setting\nAs we have seen, the temporal dimension is represented in narrative by\nthe plot, which is an arrangement of the events in the story. But what about\nthe spatial dimension? How are the environments where these events\ntake place arranged in narrative? What aspects of those environments are\ncommunicated to the narratee by the narrator? What is the relationship\nof narrative environments with the other existents of the story, characters\nand events? And how are literary narratives able to induce mental images\nof those environments in their readers using only words? These are some\nof the questions that we will try to answer in this chapter.\nIf plot is the meaningful arrangement of the events (temporal existents)\nof the story, setting can be conceived as the meaningful arrangement of\nthe story’s environments (spatial existents). An existent in this context\nis simply something that exists, i.e. that is the case or has being, in a\nparticular world. In our semiotic model of narrative, we distinguish three\ntypes of existents in any given storyworld: events, environments, and\ncharacters (Fig. 3.1).\nFig. 3.1 \u0007Relationships between existents in the storyworld. By Ignasi Ribó, CC BY.\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.03\ngnitteS\n.3 34\nIn reality, however, things are not so simple. Rather than being two\nseparate entities, space and time are intimately connected in what\nphysicists call space-time continuum and literary theorists refer to as the\nchronotope.1 In English, we say that ‘events take place,’ reflecting the\nrealisation that events can never happen separated from space, or rather\nfrom a particular place. In fact, the distinction between space and time\nis only an abstraction, an attempt to untangle and better understand\nthe complex processes that make up our own lifeworld. Similarly, the\ndistinction between environments (space) and events (time) in the\nstoryworld should be taken as an abstraction to help us to understand\nthe structure of narrative. Actually, both are intimately related and often\nintersect in complex ways.\nAnd it is not just environments and events that are interconnected.\nIn the previous chapter, when analysing the process of emplotment, we\nhave seen some of the close connections that link events with characters.\nSimilarly, environments and characters are also intimately connected with\neach other. Environments are more than just an objective background, or\na stage filled with things (landscapes, buildings, furniture, etc.) where\ncharacters act. At a fundamental level, environments are the meaningful\nentanglements of characters with their own world, often represented in\nnarrative as the subjective or psychological aspect of setting.\nIn this chapter, we will discuss in some detail how the environments of\nthe storyworld are arranged in narrative. We will begin by defining what we\nunderstand by environment and the crucial role of environments in building\nthe world of short stories and novels. We will then distinguish two basic\nways to arrange environments into a fictional setting: as a topographical\nlayout of natural and artificial things in space or as atmospheric relationships\nbetween those same things and the characters of the story. This distinction\nwill allow us to present a typology with four major kinds of setting that\nmay be found in prose fiction: irrelevant, functional, mental, and symbolic.\nWe will then see how literary narratives use description to represent the\nsetting and induce in the reader’s mind a vivid image of the storyworld.\nFinally, we will discuss the notion of verisimilitude and show how literary\ndescription can be used to encourage readers to read fictional stories as if\nthey were happening in the ‘real’ world.\n3.1 The World of Narrative\nAll narratives involve the creation of a particular world, the world of the\nstory or storyworld, with its own temporal and spatial existents.2 Most\n1 Mikhail M. Bakhtin, The Dialogic Imagination: Four Essays, trans. by Michael Holquist\nand Caryl Emerson (Austin, TX: University of Texas Press, 2011).\n2 See David Herman, Basic Elements of Narrative (Chichester, UK: Wiley-Blackwell, 2009),\nhttps:\/\/doi.org\/10.1002\/9781444305920\nnoitciF\nesorP 35\noften, this world is very similar to our own lifeworld. Things appear and\nbehave just as they do in our everyday experience. When a character\nthrows a pebble into a pond, the pebble bounces a few times and then\nsinks in the water. This is what we call realism, a principle of narrative\ndiscourse that uses our perceptions and assumptions about our lifeworld,\nwhich is often described as the ‘real world,’ to build, with more or less\naccuracy, the world of the story.\nBut the world created by narrative discourse can also be very different\nfrom our own. In a science-fiction short story, for example, the pebble\nthat the character throws into the pond might rebound and fly out to\nspace. Storyworlds are not necessarily bound by the same physical laws\nthat seem to rule our world. They are alternative or possible worlds,\nconfigurations of space and time that may defy any aspect of common\nsense or our everyday experience.3 Fiction genres like fantasy, horror,\nor science fiction make much use of this worldbuilding capacity of\nnarrative. But more realistic genres, such as romance, thriller, or comedy,\neven nonfiction books, also create their own storyworlds through the\narrangement of the different existents of the story.\nIn most narratives, environments tend to be the existents of the\nstory that contribute more directly to worldbuilding. An environment\nis everything that surrounds the characters, including landscapes, trees,\nanimals, buildings, rooms, furniture, and any other natural or man-made\nobjects or structures that characters may inhabit or move through.\nSome stories take place in a single environment. This environment\nmight be quite limited in scope, like the room where the protagonist of\nFranz Kafka’s The Metamorphosis becomes trapped after turning into a\ngiant insect (Fig. 3.2). But single environments can also be quite extensive\nand include various spaces, like the different chambers, corridors, and\ndungeons at Hogwarts castle in the Harry Potter novels.\nMany novels take place in a variety of environments, where the\ndifferent characters evolve and interact. For example, in Leo Tolstoy’s\nWar and Peace, a vast chronicle of the Napoleonic wars in Russia, there\nare two main environments where the story unfolds, Moscow and Saint\nPetersburg. But other environments are also important for the novel’s\nplot, such as the locations of crucial battles like Austerlitz, Smolensk, or\nBorodino.\nThere are also short stories and novels, particularly in the genres of\nadventure and travel narrative, where the movement through different\nenvironments is the fundamental driver of the plot. In Jules Verne’s\nAround the World in Eighty Days, for example, Phileas Fogg travels from\nLondon to Suez, Bombay, Calcutta, Hong Kong, Yokohama, San Francisco,\n3 Marie-Laure Ryan, Possible Worlds, Artificial Intelligence, and Narrative Theory\n(Bloomington, IN: Indiana University Press, 1991).\ngnitteS\n.3 36\nFig. 3.2\nCover of an early German edition of\nFranz Kafka’s The Metamorphosis (Die\nVerwandlung, 1915), Public Domain,\nhttps:\/\/commons.wikimedia.org\/wiki\/\nCategory:Kafka_Die_Verwandlung#\/\nmedia\/File:Kafka_Verwandlung_016.jpg\nNew York, and back to London, in a hectic and adventure-filled journey\nmotivated by a wager.\nWhichever environments make up the storyworld, whether it is a\nlonely house in the hills or a multiverse with many different galaxies,\nprose fiction needs to arrange and represent those environments in one\nway or another. This is what we call the setting of the story, which might\ncomprise an arrangement of objects and landmarks in space (topography)\nor a more subjective experience of place (atmosphere).\n3.2 Topography and Atmosphere\nEnvironments can be represented topographically, as an arrangement of\nnatural and artificial objects or things laid out in space. Natural things\ncan include clouds, mountains, paths, trees, plants, flowers, rocks, rivers,\nanimals, and so on. They can also include people when they are not\ncharacters, but simply background elements of the story. Artificial things\ncan include buildings, walls, doors, windows, furniture, machines, tools,\nand many other man-made objects and structures. What matters in a\ntopography is the quality of all these things and the spatial relationships\nbetween them, which define the particular features of a given landscape\nor interior.\nnoitciF\nesorP 37\nTopographies often serve as mere backgrounds for the actions and\ninteractions of the characters, very much like a theatre stage where events\nhappen and characters speak to each other. This stage can be more or less\nelaborate, more or less naturalistic, but it is arranged and represented as\nif it could stand on its own, once all the characters have left and there are\nno more events to tell. Topographic setting is thus related to a certain\ncultural conception of our own existence, one that sees humans as self-\nreliant individuals (or embodied souls) acting out their temporal lives in\nthe vast stage that is the objective world.\nWhile topographical setting is very common in film and drama, it is\nless common in literary narrative, at least in a pure form. An objective\ndescription of objects and spatial relationships might help the reader to\ncreate in her mind a visual representation of the story’s environment, but\nthe true interest of the story lies in the way characters experience their\nown environment.\nWe call atmosphere the arrangement or representation of\nnatural and artificial things, not as they stand on their own, but in\ntheir association with characters’ actions, thoughts, feelings, and\nexperiences. The distinction between topography and atmosphere\nparallels the distinction in geography between ‘space,’ the abstract and\nundifferentiated extension of location, and ‘place,’ which emerges when\nhuman beings give meaning to that location, both by experiencing it and\nconceptualising it in language.4\nIn narrative, atmosphere can be represented through the emotions that\na certain environment induces in one or more of the characters of the story.\nFor example, in J. R. R. Tolkien’s fantasy trilogy The Lord of the Rings, the\natmosphere of the Shire, an idyllic countryside with meadows and little\nfarmhouses, where Frodo and the other hobbits live, is very different from\ntheir destination, the barren and ominous Mordor, the dark land of Sauron\n(Fig. 3.3). As Frodo and his friends approach Mordor, the narrator often\nhighlights the contrast between these environments through the feelings\nof fear, desolation, and even insanity that grip the characters and tint the\ndifferent environments with an increasingly oppressive atmosphere.\nAtmosphere can also be represented by the tone of the narrative. The\nnarrator’s choice of language, as he describes the different environments\nin the story, can create various atmospheric effects. Tone is generally an\naspect of narrative discourse, but it can also be an element of the story,\nparticularly when it reflects the emotions or subjective perceptions\nof characters. In Charles Dickens’ Great Expectations, for example, the\ntone used by Pip, the narrator and protagonist, changes throughout the\nnovel, providing atmospheric descriptions of the different environments\n4 Yi-Fu Tuan, Space and Place: The Perspective of Experience (Minneapolis, MN: University\nof Minnesota Press, 2011).\ngnitteS\n.3 38\nFig. 3.3 Map of Middle Earth, the fantasy world of J. R. R. Tolkien’s novels.\nCC BY-SA 4.0, https:\/\/commons.wikimedia.org\/wiki\/File:World_map_.jpg\nhe experiences, such as the gloomy Kent countryside, the mysterious\nmarshes, the dazzling city of London, or the gothic ruins of Satis House.\nIn some stories, atmosphere does not stem from the subjectivity of\nany character but is rather a projection of dominant social and cultural\nvalues. In Jane Austen’s Pride and Prejudice, for example, environments\nlike castles, country houses, and elegant sitting rooms are tinted by the\ncultural conventions and expectations of the English upper classes, whose\nwealth and social position allowed them to enjoy a privileged, if not\nalways happy, lifestyle. In contrast, the environments of some of Émile\nZola’s novels are marked by the miserable day-to-day existence of the\nlower classes in France, like the shafts, railways, and shacks where miners\ndwell in Germinal (Fig. 3.4). When we discuss theme, we will see that the\ncontrast between different social atmospheres in the same narrative can\nbe a powerful instrument to criticise social arrangements, as in the vast\npanorama of nineteenth century French society depicted in Honoré de\nBalzac’s sequence of novels The Human Comedy.\n3.3 Kinds of Setting\nNot surprisingly, we tend to find a great variety of settings in prose\nfiction. There is an almost inexhaustible number of environments where\nthe events of a plot can take place. And those environments can be\narranged in many ways, notably by making different decisions regarding\ntopographic and atmospheric description.\nnoitciF\nesorP 39\nFig. 3.4 Pit No. 10 of the Compagnie des mines de Béthune, Nord-Pas-de-Calais,\nFrance (ca. 1910), Public Domain, https:\/\/commons.wikimedia.org\/wiki\/\nFile:Sains-en-Gohelle_-_Fosse_n%C2%B0_10_-_10_bis_des_mines_\nde_B%C3%A9thune_(B).jpg\nSuch diversity has prevented narratological theory from coming up with\ntypologies of setting like the ones that have been proposed for plot or\ncharacterisation. Below, we present a classification of setting based on\nthe relative importance of topography and atmosphere, as well as on\nthe connections between the environments and the other existents of the\nstory, events and characters. Once again, this typology should only be\ntaken as an orientation. There are many stories whose setting does not\nfall squarely into any of these categories. And the environments of many\nothers are arranged by combining different kinds of setting.\n1. Irrelevant: Setting does not matter much for the story. The\nnarrator provides minimal or no information about topography\nor atmosphere, and the characters do not seem particularly\nconscious or affected by setting in any way. Rather, they seem\nto move through a neutral and featureless space. They might\neven behave as disembodied minds. Irrelevant setting is quite\nrare in prose fiction, but it is a possibility. One example of this\nkind of setting can be found in Samuel Beckett’s existentialist\nnovel The Unnamable.\n2. Functional: Setting is presented in order to support the\ndevelopment of characters or the unfolding of events. The\nnarrator provides only the information needed to sustain the\nstory. Descriptions tend to emphasise topography rather than\natmosphere. But atmospheric description can also be used when\nit serves to support plot or characterisation. Popular novels often\ngnitteS\n.3 40\nuse this kind of setting, laying out space as a multidimensional\nstage for the development of the plot. One example is Dan\nBrown’s bestseller The Da Vinci Code.\n3. Mental: Setting is presented from the perspective of one of the\ncharacters, as a kind of inner experience or landscape of the mind.\nMost descriptions are heavily atmospheric, but topography\nmight also be used occasionally. Setting and characterisation\nare closely integrated. This is the kind of setting that is often\nused in dramatic and psychological fiction to highlight the\ninner life of the main character and heighten the identification\nof the reader. An example of this kind of setting can be found in\nVirginia Woolf’s modernist novel Mrs Dalloway.\n4. Symbolic: Setting is presented in order to call attention or\ngive prominence to other elements of story or discourse, by\nestablishing a meaningful relationship between these elements\nand a particular environment. Symbolic setting might be related\nwith plot (e.g. foreshadowing future events), characterisation\n(e.g. reflecting or contrasting the personality of characters), or\ntheme (e.g. representing abstract ideas). Edgar Allan Poe’s\ngothic horror story ‘The Fall of the House of Usher’ provides an\nexample of this kind of setting.\n3.4 Description\nUnlike movies, literary narratives cannot represent setting directly. As the\nstory is conveyed exclusively through words, there can be no visual or\niconic representation of the environments where the story takes place. It\nrests on readers to recreate in their own imagination those environments\nbased on the descriptions found in the text. Thus, every reader of Harry\nPotter’s novels will imagine Hogwarts in their own particular way (Fig.\n3.5). This is not the case for spectators of the film adaptations, all of whom\nsee on the screen the exact same setting, a visual recreation of the literary\nenvironment based on the interpretative and framing decisions made by\nthe movie’s director and crew.\nIn general, a description is a text that represents environments or\ncharacters. Narrators in prose fiction may provide only a minimal\ndescription of the environment, sometimes nothing more than an\nindication: ‘The detective arrived home and found his girlfriend pointing\na gun at him.’ But narrators can also represent the environment with all\nsorts of particular and sensory details: ‘The house was dark and cold.\nFumbling for the light switch, the detective saw that the window of his\nbedroom was wide open. He did not remember having left it open. The\nnoitciF\nesorP 41\nFig. 3.5\nHogwarts Castle in the ride Harry\nPotter and the Forbidden Journey at The\nWizarding World of Harry Potter,\nUniversal Studios Islands of Adventure\nOrlando, Florida. Source: Marcos\nBecerra, CC BY 2.0, https:\/\/www.flickr.\ncom\/photos\/mbecerra\/6402825573\ncurtains flapped against the pale moonlight. The rain had soaked the\ncarpet and left a dark stain on the bed sheets. He heard a familiar voice\nwhispering from the deepest corner of the room. The light blinked and he\nsaw the gun pointing at him.’\nDetailed descriptions of the environment are not always appreciated\nby readers or critics. Some argue that they are too static and halt the flow\nof the plot or the development of character, which are supposed to be\nthe fundamental components of the story. Thus, inexperienced writers\nare often encouraged to avoid lengthy descriptions and to make them as\n‘narrative’ as possible. But descriptions are already narrative. They allow\nenvironments, which are basic existents of the story, to be represented.\nIn this way, they contribute to the recreation of the storyworld in the\nimagination of the reader.\nDescriptions can be sharp and quick, using only as many words\nas needed to fix the setting in the mind of the reader while letting the\ncharacters and events move forward, as in Ernest Hemingway’s short\nstories and novels. But they can also be long, meticulous and intricate like\na tapestry (see Fig. 3.6), as in Marcel Proust’s seven-volume novel In Search\nof Lost Time, where environments, more than being mere background,\nbecome as relevant for the story as the characters or the plot, if not more.\nWhether it is long or short, an effective description usually requires\nthe presentation of significant details about the environment being\ngnitteS\n.3 42\nFig. 3.6\nThe Art of Painting (1666–1668), oil on\ncanvas by Jan Vermeer, Public Domain,\nhttps:\/\/commons.wikimedia.org\/\nwiki\/File:Jan_Vermeer_-_The_Art_of_\nPainting_-_Google_Art_Project.jpg\ndescribed. A detail may be significant for different reasons. For example,\ndetails are significant when they reveal the character’s emotional or\nperceptive connection with the environment. Or they can be significant\nfor the development of the plot, by revealing the connection between the\nenvironment and the events of the story. Details can also be significant\nfor the reader. In this sense, a crucial aim of narrative discourse is to\nallow readers to recreate the setting of the story in their imagination by\nproviding them with vivid, concrete, and specific details about the story’s\nenvironments.\nIf those who have studied the art of writing are in accord on any one point,\nit is on this: the surest way to arouse and hold the attention of the reader\nis by being specific, definite and concrete. The greatest writers — Homer,\nDante, Shakespeare — are effective largely because they deal in particulars\nand report the details that matter. Their words call up pictures.5\n3.5 Verisimilitude\nApart from significant details that connect the different existents of the\nstory and help the reader to imagine the setting, descriptions in prose\nfiction are often filled with insignificant or ‘useless details.’6 For example,\n5 W illiam Strunk and E. B. White, The Elements of Style (Boston, MA: Allyn and Bacon,\n1999), pp. 30–31.\n6 Roland Barthes, The Rustle of Language (Berkeley, CA: University of California Press,\n1989), p. 142.\nnoitciF\nesorP 43\nin Gustave Flaubert’s short story ‘A Simple Heart,’ the narrator describes\nMadame Aubain’s house as having, amongst other things, an old piano\nand a barometer (Fig. 3.7). While the piano might be there to recreate the\natmosphere of a typical bourgeois home, the function of the barometer is\nless clear. It does not seem to be a necessary element of the environment\nand does not play any role in characterisation or emplotment. So, what is\nit doing there?\nFig. 3.7\nDrawing of a wall barometer, Public\nDomain, https:\/\/pixabay.com\/p-1297523\nIn his letters, the playwright Anton Chekhov famously recommended\naspiring writers to ‘remove everything that has no relevance to the story.\nIf you say in the first chapter that there is a rifle hanging on the wall, in\nthe second or third chapter it absolutely must go off. If it is not going\nto be fired, it should not be hanging there.’7 This dramatic principle,\nknown as ‘Chekhov’s gun,’ stresses the functional role of setting, and in\nparticular the necessary connection with the plot, through symbolism and\nforeshadowing, of salient elements in the environment. If this is the case,\nwhat happens with Madame Aubain’s barometer? Should we conclude\nthat Flaubert has indulgently presented an unnecessary detail that only\ndistracts us from the story?\n7 V alentine Tschebotarioff Bill, Chekhov: The Silent Voice of Freedom (New York, NY:\nPhilosophical Library, 1987).\ngnitteS\n.3 44\nAccording to Barthes, one possible explanation is that the barometer\nis there, not to perform any specific function for setting, plot, or\ncharacterisation, but simply to reinforce the verisimilitude of the story.8\nVerisimilitude (from the Latin ‘truth-likeness’) is the attempt by\nnarrative discourse to convince readers that the storyworld is a faithful\nimitation or representation of the ‘real’ world. A verisimilar story is one\nthat looks as if it could be true, regardless of whether it is true or not. We\ncall nonfiction a story that claims to be true. But nonfiction narratives, even\nwhen they are true, can still fail to be verisimilar if they seem unbelievable\nto readers. Similarly, fictional stories, which do not pretend to be true,\nmay or may not seem true to the reader (Fig. 3.8).\nFig. 3.8 Schema of verisimilitude in fiction and nonfiction. By Ignasi Ribó, CC BY.\nMadame Aubain’s barometer, like other insignificant details of setting\noften found in literary descriptions, might just function as a reminder that\nthe environment represented, while being fictitious, could be a real one.\nJust as our own rooms and offices are filled with objects that serve no\npurpose, adding these ‘useless details’ to the setting would encourage\nreaders to willingly suspend their disbelief9 and submerge themselves in\nthe storyworld ‘as if’ it were the real one.\nSummary\n• All narratives build an alternative storyworld, which includes,\nbesides other existents, one or more environments. An\nenvironment is everything that surrounds characters, wherever\nevents take place.\n8 Barthes, pp. 141–48.\n9 Samuel Taylor Coleridge, Biographia Literaria, or, Biographical Sketches of My Literary Life\nand Opinions, ed. by James Engell and Walter Jackson Bate (Princeton, NJ: Princeton\nUniversity Press, 1984).\nnoitciF\nesorP 45\n• The arrangement of the environments of the story is called the\nsetting, which may involve laying out artificial and natural\nthings in space (topography) or establishing meaningful\nrelationships between things and the actions, experiences,\nemotions, or thoughts of characters (atmosphere).\n• In prose fiction we can identify four basic kinds of setting:\nirrelevant, functional, mental, and symbolic.\n• Writers represent setting by providing long or short descriptions,\nwhich often include significant details that associate\nenvironments with characters and events, while helping readers\nto recreate them in their imagination.\n• Descriptions can also include insignificant details about the\nenvironment in order to create an effect of reality and enhance\nthe verisimilitude of the storyworld.\nReferences\nBakhtin, Mikhail M., The Dialogic Imagination: Four Essays, trans. by Michael\nHolquist and Caryl Emerson (Austin, TX: University of Texas Press, 2011).\nBarthes, Roland, The Rustle of Language (Berkeley, CA: University of California\nPress, 1989).\nBill, Valentine Tschebotarioff, Chekhov: The Silent Voice of Freedom (New York, NY:\nPhilosophical Library, 1987).\nColeridge, Samuel Taylor, Biographia Literaria, or, Biographical Sketches of My Literary\nLife and Opinions, ed. by James Engell and Walter Jackson Bate (Princeton, NJ:\nPrinceton University Press, 1984).\nHerman, David, Basic Elements of Narrative (Chichester, UK: Wiley-Blackwell,\n2009), https:\/\/doi.org\/10.1002\/9781444305920\nRyan, Marie-Laure, Possible Worlds, Artificial Intelligence, and Narrative Theory\n(Bloomington, IN: Indiana University Press, 1991).\nStrunk, William, and E. B. White, The Elements of Style (Boston, MA: Allyn and\nBacon, 1999).\nTuan, Yi-Fu, Space and Place: The Perspective of Experience (Minneapolis, MN:\nUniversity of Minnesota Press, 2011).\ngnitteS\n.3  47\n4. Characterisation\nThe worlds of prose fiction are not only made of events arranged into\nplots and environments arranged into settings. In order to have a story,\nthere must also be characters. The arrangement of characters in the story\nis called characterisation. But what are characters? Why are they so\nnecessary for narrative? What kinds of characters do we find in fiction\nstories? How are they characterised and represented? These are some\nof the questions that will occupy us in this last chapter dedicated to the\nelements of story.\nA character is any entity in the story that has agency, that is, who is able\nto act in the environments of the storyworld. Characters are most often\nindividuals (e.g. Ivan Karamazov in The Brothers Karamazov, Werther in\nThe Sorrows of Young Werther, or Henry Jekyll in Dr Jekyll and Mr Hyde), but\nthere are some special cases where we find collective or choral characters\n(e.g. Thebans in Oedipus Rex, or the group of neighbourhood boys in The\nVirgin Suicides). Characters are most often human beings, but they can\nalso be nonhuman animals or other entities who behave like humans (e.g.\nthe White Rabbit in Alice in Wonderland — Figure 4.1 — or the robots in\nI, Robot). Only exceptionally are the characters of short stories and novels\nanimals or other entities without human features (e.g. the white whale\nin Moby Dick, or the aliens in 2001: A Space Odyssey). In our discussion of\ncharacter, therefore, we will assume that the characters of the story are\nhuman or human-like individuals, although there are notable exceptions\nto this rule.\nThat characters are important for narrative fiction can be seen from\nthe fact that the titles of many short stories and novels are taken from\nthe proper names of their main characters (protagonists). These are\nsometimes called eponymous characters and are very frequent in the\nhistory of literature. Some of the most famous novels are named after\ntheir protagonists, such as Don Quixote, Robinson Crusoe, Jane Eyre, Madame\nBovary, or Anna Karenina. Even when characters do not appear in the title,\nthey are still the most relevant existents in a great majority of short stories\nand novels. This seems to be a consequence of the nature and function\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.04\nnoitasiretcarahC\n.4 48\nFig. 4.1\nIllustration of Lewis Carroll Alice in\nWonderland (1865). By John Tenniel,\nPublic Domain, https:\/\/en.wikipedia.\norg\/wiki\/Alice%27s_Adventures_in_\nWonderland#\/media\/File:Alice_par_\nJohn_Tenniel_02.png\nof narrative. As we saw in the introduction, narrative is fundamentally a\nway for us humans to give meaning to our own world. And what is more\nimportant for us than ourselves and other entities like us?\nWhile recognising the relevance of characters in narrative, we should\nnot forget the intimate connections between characters and the other two\nexistents of the story, events and environments (see Fig. 3.1, in Chapter\n3). Stories are not simply made of characters acting in an environment.\nAll the existents of the story are equally indispensable to the recreation\nof a convincing storyworld, just as they are in our own lifeworld. Thus,\ncharacterisation, plot, and setting need to work together in order to\neffectively sustain narrative discourse and contribute to meaningful\ncommunication between authors and readers.\nIn this chapter, we will start by discussing how the nature of characters\nchanges when we analyse them at the level of narrative, discourse, or\nstory. We will then consider the notion of individuation in order to show\nthat characterisation in prose fiction is generally aimed at constructing\nfully individuated characters, but very often also produces typical and\nuniversal characters. When analysing fictional characters in psychological\/\nrealistic terms, it is common to distinguish their degree of individuation\n(flat vs. round characters), as well as their degree of personal development\nthroughout the plot (static vs. dynamic characters). After looking at these\ntypologies of character, we will discuss the most common approaches to\nrepresenting them in narrative: indirect and direct characterisation. An\nnoitciF\nesorP 49\nimportant method of direct characterisation is dialogue, which will be the\ntopic of the last section in this chapter.\n4.1 The Actants of Narrative\nThe nature of characters varies depending on what level of the semiotic\nmodel we position ourselves in (see Figs. 1.5 and 1.7 in Chapter 1). At the\nlevel of narrative, characters may be seen as figments of the author, who\nendows them with certain features or qualities drawn from his imagination\nor observations, which are then recreated by readers in every reading. At\nthe level of discourse, however, we can see characters as a construct of the\ntext, a sort of ‘paper people’ whose features are exclusively constituted\nby the descriptions found in the text and the inferences that can be made\nfrom textual cues.1 In this sense, characters are incomplete creatures, mere\nactants with no life beyond the text and no reason to exist other than to\nfulfil their function in the plot.2 Harry Potter, for example, might appear\nas an almost real individual for many readers, but at the level of discourse\nhe is simply the hero of an adventure story whose ‘life’ does not extend\nbeyond the events narrated in the eponymous novels.\nThings look different when we analyse characters as existents of the\nstory. At that level, characters may be seen as individuals who inhabit an\nalternative world, the storyworld. It is a matter of some debate whether\nthe existence of characters in the alternative world of the story should be\nregarded as complete or limited to text-based inferences. Here, we will\nassume that characters are endowed with at least a potentially complete\nexistence in the storyworld. Of course, this existence is ultimately\ndependent on the narrator of the story (a figure of discourse). But within\nthe confines of the storyworld created by narrative discourse, characters\nare generally agents endowed with an identity, social and personal\nrelationships, feelings, desires and thoughts, just like any of us in our\nown lifeworld. Thus, Harry Potter might not be, nor could ever be, a real\nperson in the world of its readers. But, in the storyworld created by J. K.\nRowling’s novels, he is a heroic and charismatic young wizard, with a\nmultifaceted life, which includes the adventures narrated in the plots of\nthe novels, but also, at least potentially, many other events, big and small,\nof which we may never hear.\nAs existents in the storyworld, all characters have in principle\nthe same importance. In J. K. Rowling’s fictional world, to continue\n1 Uri Margolin, ‘Character,’ in The Cambridge Companion to Narrative, ed. by David\nHerman (Cambridge, UK: Cambridge University Press, 2007), pp. 66–79, https:\/\/doi.\norg\/10.1017\/ccol0521856965\n2 Algirdas Julien Greimas and Joseph Courtés, Semiotics and Language: An Analytical\nDictionary, trans. by Larry Crist and Daniel Patte (Bloomington, IN: Indiana University\nPress, 1982), pp. 5–8.\nnoitasiretcarahC\n.4 50\nwith the same example, Harry is not more important than Hermione\nGranger or Neville Longbottom. But narrative discourse, by arranging\nevents, environments, and characters into a plot, necessarily establishes\ndistinctions amongst the characters, just as it does amongst the events\nand environments. Thus, Harry Potter becomes much more relevant\nthan all the other characters, taking on the role of the main character\n(the protagonist or hero) in the story, while the rest appear as secondary\ncharacters. Some of these secondary characters, like Hermione or Ron,\nhave a very prominent role next to Harry, while many others, like\nAngelina Johnson or Bertha Jorkins, only appear fleetingly and play minor\nsupporting roles in the plot. A few other characters from this storyworld,\nlike Draco Malfoy or Dolores Umbridge, are cast as antagonists to Harry\nand his friends in the conflicts that drive the plot of the novels, even if,\nunder a different arrangement of events and environments, they might\nhave been cast in a different role.\n4.2 Individuation\nWhether characters are central to the story or only play a secondary\nrole, their characterisation generally requires the narrator to directly\nor indirectly ascribe to them certain characteristics or properties\nthat identify them as individuals. This is what we call individuation.\nIn principle, a primary character will be more individuated than a\nsecondary one. And we can expect the characters that are least relevant\nfor the plot to be also the least individuated. But this rule has, in fact,\nnotable exceptions. It is not uncommon to find secondary characters with\ncharacteristics so well defined that they become at least as individuated\nin the minds of the reader as the protagonist himself, if not more so. In\nJoseph Conrad’s Heart of Darkness, for example, the elusive ivory trader\nKurtz is characterised with more detail and nuance than Marlow, the\nprotagonist of the story.\nIn general, individuation involves three sets of defining characteristics\nor traits:3\n1. Physical: These are the features of the body, such as whether the\ncharacter is tall or short, slim or fat, blue-eyed or brown-eyed,\nfair or dark, male or female, etc. Many physical characteristics\nare external and can be observed with the naked eye (e.g. the\nshape of the nose or a scar on the forehead), while others might\nbe internal and thus difficult to perceive directly (e.g. diabetes\nor heartburn).\n3 U ri Margolin, ‘Individuals in Narrative Worlds: An Ontological Perspective,’ Poetics\nToday, 11:4 (1990), 843–71.\nnoitciF\nesorP 51\n2. Mental: These are the features of personality or psychology,\nsuch as whether the character is modest or arrogant, upbeat\nor depressive, cruel or kind, dreamy or practical, etc. These\ntraits compose what is commonly understood as the character\nof a person. They might include traits that are perceptual (e.g.\npowers of observation), emotive (e.g. excitability), volitional\n(e.g. ambition), and cognitive (e.g. shrewdness).\n3. Behavioural: These are the features of behaviour or habits, such\nas whether the character is punctual or unpunctual, shouts\nor whispers when speaking, laughs easily or never laughs at\nall, drinks or avoids alcohol, etc. Sometimes it is difficult to\ndistinguish mental and behavioural traits, as they tend to be\nintimately connected. Behavioural traits may be related to any\nactions that characters undertake, including communicating\nand interacting with other characters.\nThe aim of individuation is to represent characters in such a way that they\nappear, speak, and act like real individuals. In the context of psychological\nor realistic fiction, a fully individuated character should be endowed with\na particular set of physical, mental, and behavioural characteristics so as\nto allow readers to imagine him or her as a person living in the same\nkind of world in which we all live. Of course, storyworlds might be very\ndifferent from our own lifeworld. It is possible, for example, to imagine a\nstoryworld where individuality as we understand it does not exist and all\n‘individuals’ are actually clones or genetic replicas of the same organism.\nIn such a context, the notion of individuation would lose most of its\nsense. This kind of fiction, however, is notably difficult to create, precisely\nbecause individuality is such a central assumption in the worldview of\nboth writers and readers.\nAs long as we stay within the boundaries of storyworlds that imitate,\nor are extrapolated from our own world, it makes sense to strive for\nindividuality in characterisation. As social animals, we have evolved\na set of perceptual and cognitive mechanisms that allow us to identify\nand distinguish other human individuals from each other. Given\nthe importance of individuality for our own social existence, it is not\nsurprising that our narratives should attempt to represent characters as\nplausible and self-standing individuals, endowing them with a distinctive\nset of characteristics.\nNot all human cultures, however, give the same importance to\nindividuality. We should not forget that modern novels and short stories\nare largely the products of the individualistic culture that emerged from\nthe European Renaissance (see Chapter 1), closely associated with the\nscientific and industrial revolutions, the expansion of capitalism, and a\nnoitasiretcarahC\n.4 52\nphilosophical conception of the human being as an isolated, autonomous,\nand self-reflecting individual. In this culture, which has now become\nglobalised, narrative characters that are not fully individuated seem to\nlack something important, as if not being properly distinguishable from\nother characters would make them less real. This has not always been the\ncase. In mythical narratives, for example, the characters are not so much\nindividuals as types (e.g. the ‘messenger’) or universals (e.g. the ‘hero’).\nBoth typical and universal characters are still important in modern fiction,\nalthough their nature and function has been somewhat modified by the\nprevailing individualism of modern culture.\nFig. 4.2\nFan art representing Lord Voldemort\nand Nagini, from the Harry Potter\nsaga, made with charcoal, acrylics and\nwatercolours. By Mademoiselle Ortie\naka Elodie Tihange, CC BY 4.0, https:\/\/\nfr.wikipedia.org\/wiki\/Fichier:Lord_\nVoldemort.jpg\nTypical characters (or simply, types) represent a particular aspect of\nhumanity or a particular group of humans. For example, characters\nrepresenting evil in a concentrated and simplified form, like Lord\nVoldemort (Fig. 4.2), have become quite common in certain kinds of\npopular fiction. While these ‘villains’ might be individuated to a certain\nextent, they are not so much individuals as types. Many other typical\ncharacters, like the ‘mad professor,’ the ‘femme fatale,’ or the ‘wise old\nman,’ can be found in modern short stories and novels, where they tend\nto play secondary or supporting roles as stock characters. When types\nbecome ingrained in the psychology and culture of a society and start\nappearing in many different storyworlds, they are said to be archetypes.\nIn some respects, every character, no matter how well individuated,\ncan be regarded as a type.4 Even in real life we often perceive other\nindividuals as types (e.g. immigrant, lawyer, Chinese, gay, nerd), a\nsimplification that helps us to classify and group them into meaningful\n4 H. Porter Abbott, The Cambridge Introduction to Narrative (Cambridge, UK: Cambridge\nUniversity Press, 2008), pp. 129–31, https:\/\/doi.org\/10.1017\/cbo9780511816932\nnoitciF\nesorP 53\ncategories. This is the basis of prejudice and negative bias, but it is also an\nevolved mechanism to cope with complex social information. Similarly,\ncharacters in fiction, even those that have been individuated with the\nutmost craft, cannot avoid being cast as types by readers. Emma Bovary,\nthe eponymous protagonist of Gustave Flaubert’s novel Madame Bovary,\nis one of the characters of realist fiction that has been characterised with\nmore detail and subtlety (see Fig. 4.3). And yet, she is often perceived as\nthe typical adulterous woman, trying to balance the social imperatives of\nmarriage with her romantic longings.\nFig. 4.3\n‘Madame Hessel en robe rouge\nlisant’ (1905), oil on cardboard. By\nÉdouard Vuillard, Public Domain,\nhttps:\/\/commons.wikimedia.org\/\nwiki\/File:%C3%89douard_Vuillard_-_\nMadame_Hessel_en_robe_rouge_lisant_\n(1905).jpg\nFig. 4.4 ‘Don Quixote and Sancho Panza at a crossroad,’ oil on canvas. By Wilhelm\nMarstrand (1810–1873), CC0 1.0, https:\/\/commons.wikimedia.org\/wiki\/\nFile:Wilhelm_Marstrand,_Don_Quixote_og_Sancho_Panza_ved_en_skillevej,_\nuden_datering_(efter_1847),_0119NMK,_Nivaagaards_Malerisamling.jpg\nnoitasiretcarahC\n.4 54\nThere are times when fictional characters are somehow able to\ntranscend their individuality and typicality in order to attain some\nform of universality. Universal characters represent a general aspect of\nhumanity or the whole human species. For example, Don Quixote and\nSancho Panza, the protagonists of Cervantes’ novel, have become a pair\nof universal characters, representing two fundamental and contrasting\nattitudes towards life that are generally found in human beings: idealism\nand materialism (Fig. 4.4). Similarly, in her desperate longing for a more\nfulfilling and authentic life, Emma Bovary may represent the alienation of\nall individuals in modern society, torn between reveries of plenitude and\nthe unsatisfactory realities of everyday existence.\n4.3 Kinds of Character\nA certain number of typologies have been proposed to classify and\ndistinguish analytically the kinds of character most often found in fiction.\nTwo of these typologies are still used extensively by critics and writers,\neven though their psychological assumptions only make them applicable\nto realist fiction, that is, to storyworlds that attempt to imitate or replicate\nour own lifeworld.5\nThe first one of these typologies6 distinguishes characters based on\ntheir degree of individuation:\n1. Flat characters: These characters, which are sometimes equated\nto what we have called types in the previous section, are\nconstructed around a limited number of traits or characteristics.\nOf course, there are varying degrees of flatness. At one extreme,\nwe would find characters with a single characteristic or trait,\nsuch as a messenger whose only purpose in the story is to deliver\na message at a certain point of the plot. Flat characters can be a\nbit more individuated than that, but their identity, personality,\nand purpose can often be expressed by a single sentence. They\ntend to lack depth or complexity and are easily recognisable and\nremembered by the reader. Because of their limited qualities,\nhowever, they also tend to seem quite artificial and most readers\nhave a hard time identifying with them or taking them for real\nhuman beings. Minor or secondary characters in fiction tend to\nbe flat, even when the main characters in the same story are not.\nIn genres like comedy or adventure, flat characters are quite\ncommon. And some writers, like Charles Dickens or H. G. Wells,\n5 S ee Seymour Benjamin Chatman, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\n6 E . M. Forster, Aspects of the Novel (San Diego, CA: Harcourt Brace Jovanovich, 1985).\nnoitciF\nesorP 55\nseemed quite inclined to populate their novels and short stories\nwith flat secondary characters. An example of a flat character\nfrom the Harry Potter series is Argus Filch, the caretaker of\nHogwarts, characterised almost exclusively by his love for cats\nand obsession with catching students who break the rules of the\nschool (Fig. 4.5).\nFig. 4.5\nWarner Bros. Studio Tour, London:\nThe Making of Harry Potter. Source:\nKaren Roe, CC BY 2.0, https:\/\/\ncommons.wikimedia.org\/wiki\/File:The_\nMaking_of_Harry_Potter_29-05-2012_\n(7358054268).jpg\n2. Round characters: These characters are endowed with many\ndifferent traits or characteristics, some of which might even be\ncontradictory and cause them internal or psychological conflicts.\nWith well-crafted characterisation, round characters can appear\nto be as complex and multifaceted as any human being we\nmight encounter in our world. Major characters in realist prose\nfiction, such as Emma Bovary, Rodion Raskolnikov, or Anna\nKarenina, are often round. And there are writers, like Gustave\nFlaubert or Jane Austen, who tend to characterise even minor\ncharacters with such nuance and complexity that they appear to\nbe round, even though they might not have a prominent role in\nthe story. An example of a round character in the Harry Potter\nnovels is Hermione Granger, one of Harry’s closest friends at\nHogwarts. While roundness of character is the aim of many\nrealist and popular stories, in modernist and postmodernist\nfiction the notion of character has often been questioned. In\nRobert Musil’s novel The Man Without Qualities, for example,\nthe main character is presented as devoid of any of those stable\nnoitasiretcarahC\n.4 56\ncharacteristics, individual or typical, which would allow him\nto fit comfortably into the preconceived patterns of modern\nbourgeois society (Fig. 4.6).\nFig. 4.6\n‘Man without Qualities n°2’\n(2005), oil and metal on canvas.\nBy Erik Pevernagie, CC BY-SA\n4.0, https:\/\/commons.wikimedia.\norg\/wiki\/File:Man_without_\nQualities_n%C2%B02.jpg\nAnother typology, also based on a psychological-realist conception\nof character and often confused with the previous one, distinguishes\ncharacters in terms of their ability to change or evolve throughout the\nplot:\n1. Static characters: These characters do not experience any profound\nchange or personal evolution from the moment they appear in\nthe plot until they disappear. Most flat characters are also static,\nalthough these classifications are based on different variables. It\nis possible, although relatively unusual, to have a flat character\nwhose limited characteristics undergo a radical transformation\nin the story. More common is to have round characters that are\nstatic, retaining the same personality, identity, or characteristics\nthroughout the whole narrative. In the Harry Potter novels, for\nexample, most major characters, including Harry, Ron, and\nHermione, are fairly static, evolving only superficially from\ntheir initial appearance until the end of the series, even if the\nauthor has tried to add dynamism into their characterisation in\norder to take account of their growing up into adulthood.\n2. Dynamic characters: These characters undergo profound and\nsignificant changes as the story develops, showing some\ndegree of personal evolution or growth which transforms\nthem into somewhat different characters at the end of the\nnoitciF\nesorP 57\nplot. This evolution is not always positive or constructive,\nand the changes experienced by the character may involve\ndifferent forms of crisis, physical or psychological degradation,\ndepression, and other negative or destructive changes. Given\ntheir complexity and depth, round characters are generally\nmore able to experience this kind of dynamism, although there\nare many cases where round characters remain static. In short\nstories, dynamic characters are far less common than in novels,\nwhere the length of the narrative provides more opportunities\nto show character development and evolution. To continue with\nexamples from the Harry Potter novels, Neville Longbottom is\none of the few characters who undergoes a significant evolution\nthroughout the series, as he grows up and develops a more\nconfident and bold personality.\n4.4 Representing Characters\nLike environments, characters in literary narrative need to be represented\nthrough words. They cannot be shown directly to the audience, as in film\nor drama. There are basically two ways to represent characters in prose\nfiction:7\n1. Indirect characterisation: The character is presented by the\nnarrator, who describes his or her physical, mental, or\nbehavioural characteristics. Character descriptions are similar\nto environmental descriptions. They can be long and detailed or\nshort and cursory. And they often rely on significant details that\nconnect characters to the setting, the plot, or even the reader.\nIn certain cases, some details in a character description might\nbe unnecessary or insignificant, but they can serve to make the\ncharacter seem more realistic. In indirect characterisation, the\nnarrator also tends to use commentary to qualify or evaluate\nthe character, providing a subjective interpretation that goes\nbeyond mere description. Indirect characterisation has the\nadvantage of conveying a lot of information about characters in\na short time. But, as a form of ‘telling’ (see Chapter 5), it creates\nsome distance between the reader and the character, making the\nlatter less moving and memorable than when direct methods of\ncharacterisation are used.\n2. Direct characterisation: The character is revealed through his\nor her actions, words, looks, thoughts, or effects on other\n7 Janet Burroway, Writing Fiction: A Guide to Narrative Craft (Chicago, IL: University of\nChicago Press, 2019), https:\/\/doi.org\/10.7208\/chicago\/9780226616728.001.0001\nnoitasiretcarahC\n.4 58\ncharacters. Here, the narrator simply records external or internal\nevents related to the character, including words and thoughts,\nwithout undertaking a descriptive summary or evaluation of\nthe character’s traits. Direct characterisation is, therefore, a form\nof ‘showing’ (see Chapter 5). It leaves the reader to interpret the\ncharacter based on the information provided in the narrative.\nThis kind of characterisation is more vivid and effective than\nthe indirect method. But it also asks more from readers, who are\nrequired to participate in the construction of characters through\ntheir interpretations.\nBoth forms of characterisation are often used in short stories and novels.\nBut direct characterisation is generally preferred in modern works of\nfiction, as it does not require the mediation of an intrusive narrative\nvoice and allows characters to appear more like real people. There are\nfive methods of direct characterisation that are commonly used in\nnarrative: speech, thoughts, effects, actions, and looks. These can be easily\nremembered with the acronym STEAL.\n1. Speech: What characters say and how they say it is one of the\nmost important components of direct characterisation. Verbal\nlanguage is the fundamental semiotic system that we humans\nemploy to communicate meanings, emotions, intentions, and so\non. When it involves an interaction with other people, we call\nthis dialogue. In prose fiction, speech is a widely used method\nof characterisation, as it can be very effective in revealing\nexplicit and implicit information about the characters engaged\nin dialogue. At the same time, speech can serve to move the plot\nforward and provide information about events, environments,\nor other characters in the storyworld.\n2. Thoughts: Knowing what the characters think (or desire, want,\nplan, etc.) can also help to define their characteristics. Of course,\nin our lifeworld, we have no access to what other people think,\nexcept when they tell us about it. This is the reason why some\nmodern writers try to avoid this method of characterisation,\nconstraining the narrator to represent what can be observed\nfrom the outside, but never entering the characters’ minds.\nHowever, in many other works of fiction, both classical and\nmodern, readers are allowed access to the thoughts of at least\nsome of the characters, which are necessarily expressed in\nwords, as some form of interior speech or monologue. Modern\nwriters often use more sophisticated techniques like free indirect\nspeech or interior monologue (stream of consciousness) to try to\nnoitciF\nesorP 59\nconvey the complex and fluid mental processes of characters.8\nMolly Bloom’s interior monologue at the end of James Joyce’s\nUlysses is perhaps the most famous example of this technique in\nmodern literature.\n3. Effects: How other characters are affected or react to a character\ncan be used to characterise, not just those characters (using\nspeech, thought, or action), but also the character that causes\nthe effect. For example, if the characters surrounding John\nlaugh every time he says or does something, readers will tend\nto assume that John is either funny or ridiculous. This is an\neffective characterisation technique because it replicates how we\njudge character in our own life. As social animals, we are always\nattentive to the impression people make on other people. For\ninstance, we would tend to see as attractive someone at whom\nothers stare with desire or interest, even without knowing what\nthat person looks like.\n4. Actions: What characters do, their behaviour, is perhaps the\nmost important method of direct characterisation. In general,\nactions often involve some kind of physical movement (e.g.\ngesturing, walking, running, etc.), but they can also be passive\nstates (e.g. sleeping, sitting, etc.), or even internal changes\nreflected in the face or body of the character (e.g. staring,\nfrowning, etc.). Nonverbal communication, which usually\naccompanies and supports dialogue, is based on actions. Since\nthe characters in fiction are almost always doing something as\npart of the plot, every action is an opportunity to characterise\nthem in one way or another in the mind of the reader. This is\nalso how we judge each other in life, not only by our words,\nbut also by our deeds.\n5. Looks: How a character looks or appears in the story can also\nbe a useful method of direct characterisation. Appearance\nincludes the physical traits of the character’s face and body (e.g.\neye colour, hair length, height, skin complexion, etc.), but also\ntheir way of dressing or presenting themselves in front of others.\nIn our lifeworld, appearance provides important cues about a\nperson’s social status, occupation, mental and physical state,\nintentions and thoughts, etc. In prose fiction, looks are often\nemployed to provide the same kind of information, typically\nthrough some form of description. In some cases, it can be\n8 Dorrit Cohn, Transparent Minds: Narrative Modes for Presenting Consciousness in Fiction\n(Princeton, NJ: Princeton University Press, 1988).\nnoitasiretcarahC\n.4 60\ndifficult to distinguish between descriptions that use indirect\ncharacterisation (presented from the subjective perspective of\nthe narrator) and those that use direct characterisation (without\nany subjective intervention by the narrator).\n4.5 Dialogue\nIn narrative, the representation of communicative interaction using\nspeech, or dialogue, contributes both to the development of plot and to\nthe characterisation of characters. It can also help to establish the setting,\nfor example through the representation of different dialects or ways of\nspeaking. It is thus a crucial resource used in many short stories and\nnovels, although the importance of dialogue and the techniques employed\nto convey it vary quite substantially from one narrative to another.\nBy far the most common method of representing dialogue in prose\nfiction is direct speech, where the words spoken by the characters appear\ntranscribed and enclosed in quotation marks or other conventional signs.\nSometimes, the characters’ words are accompanied with dialogue (or\nspeech) tags that indicate who is speaking and provide other relevant\ninformation about the interaction (e.g. ‘“How could I suspect she wanted\nto kill me?,” said the detective, still shaking his head.’). This method of\nrepresenting dialogue introduces a dramatic element into the narrative,\nproviding the reader of prose fiction with an experience that approaches\nthat of watching a play or a film.\nWhile many authors attempt to write realistic dialogue that captures\nthe quality and structure of spoken interaction, the truth is that narrative\ndialogue is subject to many conventions and must be stylised in order to\nbe intelligible for readers. Conversations in real life are full of fragments,\nrepetitions, meaningless sounds, nonverbal cues, gaps, lapses, pauses, etc.\nBut narrative representations of dialogue are often tidied up to provide\nan idealised and artificial version of conversation, in order to create the\nimpression of reality without wearing down or losing the interest of\nreaders.9\nThere are other methods to convey dialogue in narrative, although\nthey tend to lack the immediacy and effectiveness of direct speech. In\nindirect speech, for example, the narrator reports the words of a character\nwithout quoting them directly (e.g. ‘The detective claimed that he never\nsuspected his girlfriend wanted to kill him.’). Free indirect speech (or\nfree indirect style) can also serve to report spoken words, although it is\nmore commonly used to convey the character’s thoughts. This method\n9 Norman Page, Speech in the English Novel (London, UK: Macmillan, 1988).\nnoitciF\nesorP 61\ncombines the narrator’s third-person narration with the essence of the\ncharacter’s first-person speech, without using quotation marks (e.g. ‘The\ndetective shook his head when he found out. How could he ever suspect\nthat his girlfriend wanted to kill him?’).\nRegardless of the actual method used to represent speech and\nconversation, there is little doubt that dialogue and, in general, the\nrepresentation of different voices and perspectives, is a fundamental\nprinciple of modern prose fiction. As the literary theorist Mikhail Bakhtin\npointed out in his analysis of Dostoevsky’s narratives (Fig. 4.7), many\nnovels tend to be ‘polyphonic,’ that is, they combine, without merging\nthem, ‘a plurality of consciousnesses, with equal rights and each with\nits own world.’10 The ‘dialogic principle’11 brings together voices from a\nmultiplicity of social and ideological worlds (including the voices of the\ndifferent characters, the voices of narrators, and even voices external to\nthe story itself) in order to create a narrative that aspires to be as rich\nand multifarious as life itself.\nFig. 4.7\nPortrait of Fyodor Dostoevsky\nby Vasily Petrov (1872). Tretyakov\nGallery, Public Domain, https:\/\/\ncommons.wikimedia.org\/wiki\/\nФёдор_Михайлович_Достоевский#\/\nmedia\/File:Dostoevsky_1872.jpg\n10 Mikhail M. Bakhtin, Problems of Dostoevsky’s Poetics, ed. by Caryl Emerson (Minneapolis,\nMN: University of Minnesota Press, 1984), p. 6.\n11 Mikhail M. Bakhtin, The Dialogic Imagination: Four Essays, trans. by Michael Holquist\nand Caryl Emerson (Austin, TX: University of Texas Press, 2011).\nnoitasiretcarahC\n.4 62\nSummary\n• At the level of discourse, characters are mere actants with no\nfeatures other than those defined in the text and no reason for\nbeing other than their function in the plot. At the level of story,\nhowever, we can regard them as existents of the storyworld.\n• In realist prose fiction, characterisation aims to individuate\ncharacters by ascribing to them physical, mental, and\nbehavioural characteristics or properties that distinguish them\nas individuals.\n• Most characters can be classified according to their degree\nof individuation (flat vs. round) or their degree of personal\nevolution throughout the plot (static vs. dynamic).\n• The representation of characters in short stories and novels\nis generally achieved through indirect or direct methods of\ncharacterisation. Direct methods involve the representation\nof characters’ speech, thoughts, effects (on other characters),\nactions, or looks.\n• In prose fiction, dialogue (the representation of speech\ninteractions between characters) is usually an important\nelement of the story, contributing both to emplotment and\ncharacterisation.\nReferences\nAbbott, H. Porter, The Cambridge Introduction to Narrative (Cambridge, UK:\nCambridge University Press, 2008), https:\/\/doi.org\/10.1017\/cbo9780511816932\nBakhtin, Mikhail M., Problems of Dostoevsky’s Poetics, ed. by Caryl Emerson\n(Minneapolis, MN: University of Minnesota Press, 1984).\nBakhtin, Mikhail M., The Dialogic Imagination: Four Essays, trans. by Michael\nHolquist and Caryl Emerson (Austin, TX: University of Texas Press, 2011).\nBurroway, Janet, Writing Fiction: A Guide to Narrative Craft (Chicago, IL: University of\nChicago Press, 2019), https:\/\/doi.org\/10.7208\/chicago\/9780226616728.001.0001\nChatman, Seymour Benjamin, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\nCohn, Dorrit, Transparent Minds: Narrative Modes for Presenting Consciousness in\nFiction (Princeton, NJ: Princeton University Press, 1988).\nForster, E. M., Aspects of the Novel (San Diego, CA: Harcourt Brace Jovanovich,\n1985).\nGreimas, Algirdas Julien, and Joseph Courtés, Semiotics and Language: An Analytical\nDictionary, trans. by Larry Crist and Daniel Patte (Bloomington, IN: Indiana\nUniversity Press, 1982).\nnoitciF\nesorP 63\nMargolin, Uri, ‘Character’, in The Cambridge Companion to Narrative, ed. by David\nHerman (Cambridge, UK: Cambridge University Press, 2007), pp. 66–79,\nhttps:\/\/doi.org\/10.1017\/ccol0521856965\nMargolin, Uri, ‘Individuals in Narrative Worlds: An Ontological Perspective,’\nPoetics Today, 11:4 (1990), 843–71.\nPage, Norman, Speech in the English Novel (London, UK: Macmillan, 1988).\nnoitasiretcarahC\n.4  65\n5. Narration\nSo far, we have been analysing the main constituents of the story, or, as we\nhave called them, the existents of the storyworld: events, environments,\nand characters. But the storyworld only comes to exist because someone\n(a narrator) tells a story to someone else (a narratee). This is what we call\nnarration, a communicative act that does not happen in the storyworld or\nat the level of the story. Narration is part of discourse, which constitutes\nthe second level in our semiotic model of narrative.\nNarrative discourse is basically the communication between the\nimplied author and the implied reader of a narrative (see Fig. 1.5, Chapter\n1). The ‘implied author’1 is implied because it does not have an explicit or\nindependent reality, as the real author does, but must be reconstructed\nby the reader from the narrative itself. It is important in this sense to\ndistinguish the implied author from the narrator of the story. The implied\nauthor does not tell anything; it does not have a voice, but it is simply\nthe organising principle of discourse, which includes the narrator and\nthe other aspects of the narration.2 Every narrative has an implied author,\neven if it does not have a real author (e.g. a computer-generated text) or\nit has many of them (e.g. collaborative fiction). Similarly, every narrative\nhas an implied reader, which is the ideal reader addressed by narrative\ndiscourse.3\nIn this chapter, we will examine in some detail the different elements of\nnarration. Then, in the next chapters, we will look at other key aspects of\ndiscourse, namely language and theme. Of course, the questions raised by\nthe analysis of discourse often cross over to the story. Therefore, we must\nalways keep in mind the distinction between these two levels of narrative.\n1 Wayne C. Booth, The Rhetoric of Fiction (Chicago, IL: University of Chicago Press,\n1983).\n2 Seymour Benjamin Chatman, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000), pp. 147–51.\n3 Wolfgang Iser, The Implied Reader: Patterns of Communication in Prose Fiction from\nBunyan to Beckett (Baltimore, MD: Johns Hopkins University Press, 1995).\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.05\nnoitarraN\n.5 66\nThis is particularly important when we discuss narration, because the object\nof narration is the story itself. We can only interpret the storyworld (with all\nits events, environments, and characters) from the story told by the narrator\nto the narratee. While neither the narrator nor the narratee need to exist as\nsuch in the storyworld, these figures of discourse can also be characters in\nthe story, a complication that we will try to clarify in the following pages.\nFirst, we need to define more precisely what we mean by narration\nand the relationship between narration and the story being narrated.\nThen we will look more closely at the two figures of discourse involved\nin narration, the narrator and the narratee, outlining the types most\ncommonly found in prose fiction. We will then examine the concept\nof focalisation, an important and closely related aspect of narration,\nwhich refers to the point of view or perspective adopted by the narrator\nof the story. Next, we will discuss in more detail the basic means by\nwhich narrators can represent events, characters, and environments:\ntelling and showing. But narrators, besides representing the existents\nof the storyworld, often also make comments about them. To conclude\nthe chapter, therefore, we will consider the use of explicit and implicit\ncommentary in prose fiction.\n5.1 The Expression of Narrative\nNarration is the communicative act of telling a story. The figures of\ndiscourse involved in this act are the narrator (who tells the story) and\nthe narratee (who listens to, or reads, the story). The story is what is\nbeing told. Narration is how it is being told. This involves a series of prior\ndecisions, attributed to the implied author (and, ultimately, to the real\nauthor), about who the narrator will be, what kind of knowledge the\nnarrator will have about the existents of the storyworld, what narrative\ntechniques the narrator will employ to convey the story, etc. All these\ndecisions, taken together, define the expression of narrative, that is, the\nprocess of communicating the story.\nHere, we are mostly concerned with the narration of a story, which\nis an instance of narrative discourse. But prose fiction can also include\nnarration within the story itself.4 For example, in One Thousand and One\nNights a narrator tells the story of a sultan who kills all of his new wives\nafter the first night, until Scheherazade keeps him in suspense for 1,001\nnights by telling him different stories (see Fig. 5.1). The narrator of these\nstories is of course Scheherazade herself. But many of the stories she\ntells include characters who tell other stories in their turn. The result is\n4 Shlomith Rimmon-Kenan, Narrative Fiction: Contemporary Poetics (London, UK:\nRoutledge, 2002), pp. 94–97, https:\/\/doi.org\/10.4324\/9780203426111\nnoitciF\nesorP 67\nan intricate structure of embedded or subordinated narratives. While\nmost short stories and novels are not as complex as One Thousand and\nOne Nights, the technique of embedding narratives, also known as ‘a story\nwithin a story,’ is a relatively common literary device. Such a technique,\nhowever, does not affect the general framework of our semiotic model\nof narrative. Regardless of how many embedded stories we find in a\nnarrative, every story is framed by a higher level of discourse, which\nincludes its narration.5 If that narration is part of another story, then the\nwhole structure is repeated, until we reach the highest level of narrative,\nwhich links an implied author with an implied reader.\nFig. 5.1 Édouard Frédéric Wilhelm Richter, Scheherazade (before 1913), Public\nDomain, https:\/\/commons.wikimedia.org\/wiki\/File:Edouard_Frederic_\nWilhelm_Richter_-_Scheherazade.jpg\nIn some cases, short stories and novels consciously play with the different\nlevels of narrative, in order to transgress them or simply for comic\neffect. For example, Laurence Sterne’s novel Tristram Shandy is narrated\nby the eponymous character, who is supposed to tell his life story. But\nthe narrator constantly crosses the boundaries of narration in order to\ndirectly address the reader or to call into question the verisimilitude of\nthe narrative itself. In postmodernist fiction of the late twentieth century,\nthere are quite a few examples of this sort of transgression, often using\nthe so-called ‘mise en abyme’ device, in which the technique of embedding\n5 See Gérard Genette, Narrative Discourse: An Essay in Method (Ithaca, NY: Cornell\nUniversity Press, 1990), pp. 25–32.\nnoitarraN\n.5 68\nstories within stories creates unresolvable paradoxes, as in André Gide’s\nThe Counterfeiters, where one of the characters intends to write the same\nnovel in which he appears.\nAll these self-conscious devices, rather than contradicting the general\nframework of narrative that we have been presenting here, are exceptions\nthat confirm the rule. The fact is that most fictions establish, explicitly\nor implicitly, a clear distinction between the level of discourse and the\nlevel of story. Narration, which occurs at the level of discourse, is the\ncommunicative act between a narrator and a narratee responsible for\nexpressing or representing all the elements of the story.\n5.2 Narrators and Narratees\nThe narrator of a story is the figure of discourse that tells the story.\nThis definition seems simple enough, but in practice there are several\ncomplications. Similarly, the narratee is the figure of discourse to\nwhom the narrator tells the story. Again, there are quite a few practical\nconsiderations about this figure that we need to clarify.\nIn most short stories and novels, the narrator can be easily identified\nby asking the question: ‘who speaks?’ (or ‘who writes?’ when the story is\nsupposedly told in writing). Very often, however, this narrator does not\nhave a name or a clear identity, so we speak of an unknown narrator, even\nthough we can sometimes infer details about his or her life, personality,\nor opinions from the narration itself. In other cases, the narrator is just a\nvoice with no subjective dimension whatsoever.\nOne aspect of this voice that is usually obvious from the narrative is\nthe so-called person. Founded on a grammatical distinction, the notion\nof person allows us to discern the underlying relationships between the\nnarrator, the narratee, and the characters in the story:\n1. First-person narrator: The narrator tends to use the first\nperson quite often (‘I went out at five o’clock.’), even if other\ngrammatical persons can also be used. This kind of narrative\nvoice is commonly found in stories told by a narrator who is also\nthe protagonist, or at least a relevant character, in the plot. The\nnarratee may or may not be explicit. For example, J. D. Salinger’s\nThe Catcher in the Rye (Fig. 5.2) is narrated by its seventeen-year-\nold protagonist, Holden Caulfield, who naturally tends to talk\nquite a lot about himself.\n2. Second-person narrator: The narrator uses the second person most\nof the time (‘You went out at five o’clock.’). The second person\nexplicitly refers to the narratee, which in some cases might be\nthe narrator himself. This kind of voice is difficult to sustain\nnoitciF\nesorP 69\nFig. 5.2\nFirst-edition cover of The Catcher in\nthe Rye (1951) by J. D. Salinger, Public\nDomain, https:\/\/commons.wikimedia.\norg\/wiki\/File:The_Catcher_in_the_Rye_\n(1951,_first_edition_cover).jpg\nthroughout the narrative, and has generally been tried only\nin experimental novels, such as Italo Calvino’s If on a Winter’s\nNight a Traveller, where the framing narrative directly addresses\na reader of the novel (narratee).\n3. Third-person narrator: The narrator uses the third person most of\nthe time (‘The marquise went out at five o’clock.’). This is, by far,\nthe most common narrative person in prose fiction. The narrator\nmay or may not be a character in the story. Similarly, the narratee\nmay be explicit or implicit. There are countless examples of this\nkind of person. One of them is John Steinbeck’s The Grapes of\nWrath, told by a narrator who does not participate in the story.\nIt is also important to make a distinction, somewhat related to the previous\nclassification, between two kinds of narrators:\n1. External narrator: The narrator only exists as a figure of discourse.\nShe is not a character in the story and only speaks from outside\nof the storyworld. Once again, The Grapes of Wrath is a good\nexample of this type of narrator.\n2. Internal narrator: An internal narrator, on the other hand,\nbesides being a figure of discourse, is also an existent in the\nstoryworld. Whether he is actually a character depends on his\nparticipation in the story, which can be extensive (e.g. a narrator\nwho is also a major character, like the husband in Raymond\nCarver’s short story ‘Cathedral’), or limited (e.g. a narrator\nwho is just a secondary character, like Dr Watson in ‘A Scandal\nin Bohemia’ and many other Sherlock Holmes stories). While\nnoitarraN\n.5 70\nit is also possible for the narrator to be part of the storyworld\nwithout being a character in the story, this is quite rare and, for\nall practical purposes, not easy to distinguish from an external\nnarrator.\nThere are also certain types of narrative that seem to lack a narrator, for\nexample epistolary novels like Pierre Choderlos de Laclos’ Les Liaisons\ndangereuses, which is entirely made up of letters exchanged between the\ndifferent characters. But even in such cases there is an implicit figure of\ndiscourse, a narrator, who has arranged and edited the letters to tell a\ncertain story. What is lacking here, therefore, is not the narrator, but the\nnarrative voice or an explicit narration.\nFinally, we should not forget that narration is itself a process, a\ncommunicative act carried out by a narrator at a certain time and place.\nThe spatial relationship between the narrator’s environment and the\nenvironments of the storyworld is usually only relevant if the narrator\nis internal to the storyworld. But the temporal relationship between\nnarration and the events of the story has some influence on the form\nof narrative discourse, even if the temporalities of the narrator and the\nstoryworld belong to different levels. When considered in relation to the\nevents arranged in the plot, there are basically three kinds of narration:6\n1. Ulterior narration: Events are supposed to have already happened\nwhen the narrator tells the story. This is the most common form\nof narration, which uses past tense as a standard narrative tense.\nMost short stories and novels are narrated using this convention.\n2. Anterior narration: Events are not supposed to have happened\nyet when the narrator tells the story. This form, which tends to\nuse the future tense, is quite rare in prose fiction. We generally\nonly find it in prophecy or visionary narratives, for example in\nthe Bible.\n3. Simultaneous narration: Events are supposed to happen while\nthe narrator tells the story. This form is usually only found in\ndiaries or novels that experiment with narrative voice, as in\nMichel Butor’s Second Thoughts, narrated in present tense and\naddressed by the narrator to himself.\nAs with any communicative act, narration involves a sender, the narrator,\nbut also a recipient, the narratee. The narratee is situated at the same\nlevel as the narrator. But narratees are generally not as easy to identify\nas narrators. While they are sometimes explicitly mentioned in the\nnarrative, most often they are only implicit figures, never mentioned or\neven acknowledged.\n6 Rimmon-Kenan, pp. 90–102.\nnoitciF\nesorP 71\nLike narrators, narratees can be external or internal to the storyworld.\nExternal narratees are generally left implicit and could easily be mistaken\nfor implied or real readers. Even when the narrator addresses the narratee\nas ‘reader,’ for example in Charlotte Brontë’s novel Jane Eyre, it does not\nmean that she is in fact addressing the real (or even the implied) reader. In\nthis case, the label ‘reader’ is simply the term employed by the narrator to\naddress an otherwise undetermined external narratee. Certainly, it seems\nthat the (implied) author has chosen to put in the mouth of the narrator\na term that refers to the (implied) reader. But such transgression of the\nlevels of narrative (see Chapter 1) is only superficial. In fact, the narrator\nof a story can never address the implied reader, which is necessarily\nexternal to the discourse that brings the narrator herself into existence.\nInternal narratees can also be left implicit, in which case it is difficult\nto distinguish them from external ones. When they are identified during\nthe narration, internal narratees tend to be minor characters (e.g. the\nstranger who listens to the story told by Jean-Baptiste Clamence in\nAlbert Camus’ The Fall) or other existents in the storyworld (e.g. the\nunnamed individual to whom the narrator of Edgar Allan Poe’s ‘The\nTell-Tale Heart’ addresses his plea). There are also instances of collective\nnarratees, when the narrator addresses an audience instead of a single\nrecipient (e.g. the sailors who listen to Marlow’s story in The Heart of\nDarkness or the academic public of the ape Red Peter in Kafka’s ‘A Report\nto an Academy’), as well as cases where the narrator and the narratee are\nidentical, for example when the story is narrated in an intimate diary\n(e.g. Helen Fielding’s Bridget Jones’s Diary).\nFinally, we should not forget that narration in prose fiction is sometimes\nshared by multiple narrators and can address multiple narratees, with\nthe different parts of the narrative presented as a sequence of chapters,\nas in William Faulkner’s The Sound and the Fury, or intertwined in more\ncomplex arrangements, as in Vladimir Nabokov’s Pale Fire.\n5.3 Focalisation\nIdentifying the narrator of a story is generally not enough to properly\nunderstand the mechanism of narration. Some narrators seem to move\nin and out of different characters’ consciousness with ease, while others\nremain attached to a single character’s perspective or constrain themselves\nto narrating observable events, without ever penetrating any character’s\nconsciousness or presuming to know their thoughts. These differences\ncan be better grasped with the concept of focalisation, a technical term\nthat is commonly used in narratology to replace the more ambiguous, but\nstill popular, concept of point of view.\nnoitarraN\n.5 72\nIf the response to the question ‘who speaks?’ in a narrative is\n‘the narrator,’ focalisation responds to the additional question ‘from\nwhich perspective or point of view?’ Focalisation can be defined as the\nperspective adopted by the narrator when telling the story, which is\nbasically determined by the position of the narrator in relation to the\ncharacters in the storyworld. We can identify two fundamental types of\nfocalisation:7\n1. Inward focalisation: The narrator tells the story from the\nsubjective perspective of a focal character, revealing her inner\nthoughts and feelings as if he could somehow enter inside or\nread her mind. In the case of a first-person narrator, of course,\nfocalisation tends to be inward, even if the narrator might be\nspeaking from the perspective of his younger or infant self, as\nin many autobiographical narratives, such as Charles Dickens’\nGreat Expectations. A third-person narrator, even one that is\nexternal to the storyworld, can also be inwardly focalised, when\nhe adopts or tells the story from the subjective perspective of\none of the characters. A classic example is Henry James’s novel\nThe Ambassadors, narrated by an external narrator from the\nperspective or point of view of its protagonist, Lambert Strether.\n2. Outward focalisation: The narrator tells the story without\npresuming to know or have access to the subjective perspective\nof any character, simply reporting what can be observed from\nthe outside. When the narrator is internal to the storyworld,\neven if she doesn’t participate directly in the events of the\nstory, outward focalisation usually involves a certain degree of\nsubjectivity, given that the narrator herself is a focal character.\nIt is difficult in those cases to determine with precision whether\nthe narration is outwardly or inwardly focalised. If the narrator\nis external, on the other hand, it is much simpler to sustain an\noutwardly focalised narration, where the narrator acts like a\ncamera, recording everything that happens in the storyworld\nwithout entering the consciousness of any of the characters.\nExamples of this type of focalisation can be found in Dashiell\nHammett’s detective novels and short stories, such as The\nMaltese Falcon (Fig. 5.3).\nInward and outward focalisation may be fixed throughout the narrative,\nas in the examples provided above. But focalisation can also be variable,\nfor example when the narrator alternates between inward and outward\n7 Based on Genette, pp. 189–211.\nnoitciF\nesorP 73\nFig. 5.3 Promotional still from the 1941 film The Maltese Falcon, published in the\nNational Board of Review Magazine, p. 12. L-R: Humphrey Bogart, Mary Astor,\nBarton MacLane, Peter Lorre, and Ward Bond, Public Domain, https:\/\/\ncommons.wikimedia.org\/wiki\/File:Maltese-Falcon-Tell-the-Truth-1941.jpg\nfocalisations (e.g. Stendhal’s The Red and the Black), or multiple, when the\nnarrator uses different focal characters to tell the story (e.g. George R. R.\nMartin’s A Song of Ice and Fire).\nAnother important aspect of narration, which is related (and often\nconfused) with focalisation, is the degree of knowledge that the narrator\nhas about the existents of the storyworld, in particular about the inner\nthoughts and feelings of the characters. Here, we are implicitly asking\nthe question ‘how much does the narrator know?’ In this sense, we can\ndistinguish three types of narrators:\n1. Omniscient: The narrator is like a God of the storyworld,\nknowing everything about its existents, including the internal\nor psychological states of all characters and the unfolding of\nevents. In this case, focalisation is often variable and multiple,\nchanging from outward to inward and from one character to\nanother as the narrator thinks appropriate, which might give\nthe impression that there is in fact no focalisation at all. Many\nclassic short stories and novels are narrated with this sort of\nGod-like narrator, for example J. R. R. Tolkien’s The Lord of\nthe Rings.\n2. Limited: The narrator has only limited knowledge about the\ninternal or psychological states of one or some of the existents\nin the storyworld. This is quite common in inwardly focalised\nnoitarraN\n.5 74\nfictions, where the narrator only knows what the focal character\nor characters think and perceive, while having no access to the\nconsciousness of other characters. When the focal character is\nthe narrator himself, as in first-person narratives, his perspective\nis generally limited. An example of this kind of narration may be\nfound in Jorge Luís Borges’s short story ‘Funes the Memorious,’\nwhere an unnamed first-person narrator recounts his\nrelationship with a man who remembers absolutely everything.\n3. Objective: The narrator has no knowledge about the internal or\npsychological states of any of the characters in the storyworld\nand can only report what can be observed from the outside.\nThe perspective of an objective narrator, which tends to be\noutwardly focalised, can be compared to that of a movie camera.\nWhile both the camera and the objective narrator need to select\nand frame their perceptions, they can only record what can be\nexternally perceived in the storyworld, but not what characters\nthink or feel. Ernest Hemingway’s ‘The Killers’ is a minimalist\nshort story about a pair of criminals in a restaurant which is\nnarrated with this kind of camera-eye perspective.\n5.4 Telling and Showing\nAlready established in Classical poetics, particularly by Plato and\nAristotle, the distinction between ‘telling’ (diegesis) and ‘showing’\n(mimesis) can help to clarify certain important aspects of narrative\ndiscourse. Telling refers to the representation of the story through the\nmediation of a narrator, who gives an account and often interprets or\ncomments on the events, environments, or characters of the storyworld.\nShowing, on the other hand, is supposed to be the direct representation\nof the events, environments, and characters of the story without the\nintervention of a narrator, leaving readers or spectators to make their\nown inferences or interpretations.\nThe distinction between these two concepts is quite clear when we\ncompare a story told by a third-person narrator (telling) and the same story\nrepresented as a dramatic play, with a stage imitating the environments,\nactors playing the characters, and events being enacted as if they were\nhappening in the storyworld (showing). However, using this same pair\nof concepts to distinguish between different forms of narration is not so\nstraightforward.\nWe have already seen that all narratives have a narrator, even if the\nnarrator can adopt an outward focalisation (e.g. camera-eye perspective)\nor even lack a perceptible narrative voice (e.g. the editor of a set of letters).\nnoitciF\nesorP 75\nIn this sense, all narration is a form of telling (diegesis), not showing\n(mimesis). But we have also seen that there can be different forms of\nnarration. In some cases, the narrator conveys the words of characters\nusing his own voice, as in ‘The detective claimed that he never suspected\nhis girlfriend wanted to kill him.’ In other cases, the narrator quotes the\nwords that were supposedly spoken by the characters themselves, as in\n‘“How could I suspect she wanted to kill me?” said the detective.’ The\nfirst type of narration can be qualified as telling, while the second is a\nderived form of showing. In this case, the distinction is not based on the\npresence or absence of a narrator, but rather on his prominence or degree\nof involvement in the narration.\nIn prose fiction, telling and showing usually involve the use of two\ndifferent narrative methods to represent the events of the plot:\n1. Summary: A summary narrates events by compressing their\nduration. For example, a narrator might tell about a long war by\nsaying: ‘Battles were won and lost, many died, and at the end\nno one felt victorious.’ A single sentence summarises years of\nwar, with all its battles and other significant events. In general,\nsummary brings narration closer to the ideal of telling. In the\nsame way that description is the telling of environments and\ncharacters, summary is the telling of events.\nFig. 5.4 Theatre scene: two women making a call on a witch (all three of them wear\ntheatre masks). Roman mosaic from the Villa del Cicerone in Pompeii, now\nin the Museo Archeologico Nazionale (Naples). By Dioscorides of Samos,\nPublic Domain, https:\/\/commons.wikimedia.org\/wiki\/File:Pompeii_-_\nVilla_del_Cicerone_-_Mosaic_-_MAN.jpg\nnoitarraN\n.5 76\n2. Scene: A scene narrates a sequence of events in enough detail\nto create the illusion that they are unfolding in front of the\nnarratee (and ultimately, the reader). Usually, the illusion is\ncreated by quoting dialogue in direct speech, intersected with\nbrief descriptions of the environment and the characters, as well\nas some narration of the characters’ actions. This method, which\nis already found in Ancient epic, seems to be inspired by drama,\nwhich has traditionally been considered the most effective\nmethod of representing a story (see Fig. 5.4). Thus, scene brings\nnarration closer to the ideal of showing.\nDespite the recurrent debates that oppose telling to showing, the fact is\nthat both forms of narration are commonly found in most short stories\nand novels. Neither of them is superior to the other, and both have their\nown uses and limitations.\n5.5 Commentary\nNarrative discourse can do more than just tell a story through the voice\nof a narrator. It can also contain commentary, which consists of any\npronouncement of the narrator that goes beyond a description or account\nof the existents of the story. While commentary, like the rest of narration,\nis expressed by the narrator’s voice, it can also include messages sent by\nthe implied author to the implied reader through the narrator’s voice,\neven if the narrator is unaware of them.\nThere are two basic forms of commentary: explicit and implicit.8\nExplicit commentary is easier to grasp and understand, as it consists of a\nstraightforward message found in the narration. There are three types of\nexplicit commentary that the narrator can make about the story and one\nabout the narration itself:\n1. Interpretation: The narrator explains the meaning, relevance,\nor significance of the existents in the storyworld. In Balzac’s\nseries of novels The Human Comedy, for example, narrators often\nprovide interpretations that contextualise and analyse the social\nimplications of the various behaviours of the characters, almost\nlike a sociologist would do.\n2. Judgement: The narrator expresses a moral opinion or another\nform of personal evaluation of the existents in the storyworld.\nIn Henry Fielding’s Tom Jones, for example, the narrator is\nconstantly giving his opinion about the events and characters of\nthe story, in keeping with his moralising intentions.\n8 Chatman, pp. 228–60.\nnoitciF\nesorP 77\n3. Generalisation: The narrator extrapolates the existents of the\nstory to reach general conclusions about his own world (or the\nlifeworld of the reader). This is most common in philosophical\nnovels, such as Milan Kundera’s The Unbearable Lightness of Being,\nwhere the narrator comments on the characters and reflects on\nthe events in the novel by connecting them with philosophical\nnotions or events in European history.\n4. Reflection: The narrator comments on his own narration or\nother aspects of narrative discourse. This form of self-reflective\ncommentary is already found in early examples of the novel,\nfor instance in Cervantes’ Don Quixote, where the narrator often\npauses to reflect on the task of narrating his story, particularly\nin the second part of the book, when he feels the need to defend\nhis creation from a plagiariser.\nImplicit commentary is a form of irony, a use of discourse to state\nsomething different from, or even opposite to, what is actually meant.\nThe irony might be at the expense of the characters or at the expense of\nthe narrator himself. Depending on which levels of narrative it crosses,\nwe can distinguish two basic kinds of implicit commentary in prose\nfiction:\n1. Ironic narrator: The narrator makes a statement about the\ncharacters or events in the story that means something very\ndifferent, even the opposite, to what is being stated. Thus, the\nnarrator is being ironic. In this case, the irony is at the expense of\nthe characters in the story but can be understood by the narratee\n(and eventually, by the reader). A classic example of this form\nof irony is the first sentence in Jane Austen’s Pride and Prejudice:\n‘It is a truth universally acknowledged, that a single man in\npossession of a good fortune must be in want of a wife.’ In fact,\nthe narrator thinks that this is far from being a universal truth,\nexcept under the assumptions of a narrow-minded bourgeoisie,\nas is made clear in the rest of the novel.\n2. Unreliable narrator: The narrator makes statements that\ncontradict what the implied reader can know (or infer) to be the\nreal intention or meaning of the narrative discourse. In this case,\nit is the implied author who is being ironic, by communicating\nindirectly with the implied reader at the expense of the narrator.\nThe narrator in this case is said to be unreliable.9 In Nikolai\nGogol’s short story ‘Diary of a Madman,’ for example, the\n9 Booth, pp. 149–68.\nnoitarraN\n.5 78\nnarrator, a minor civil servant, becomes increasingly unreliable\nas he descends into madness, making statements whose irony\n(and comic effect) are only accessible to the implied reader (Fig.\n5.5). Another celebrated example of an unreliable narrator is\nGulliver in Jonathan Swift’s Gulliver’s Travels, where irony turns\ninto satire, as the gullible narrator tells of his misadventures\namongst exotic creatures without ever suspecting that they are\nmeant to ridicule the absurdities and pretensions of human\nsociety.\nFig. 5.5\nIllustration of Nikolai Gogol’s short\nstory ‘Diary of a Madman’ (1835) by\nIlya Repin, Public Domain, https:\/\/\ncommons.wikimedia.org\/wiki\/\nFile:Repin_IE-Illustraciya-Zapiski-\nsumasshedshego-Gogol_NV4.jpg\nSummary\n• An element of narrative discourse, narration is the\ncommunicative act between a narrator and a narratee that\nexpresses or represents all the existents of the story (characters,\nevents, and environments).\n• Narrators (as well as narratees) can be external or internal to\nthe story. Moreover, narrators can speak in the first, second,\nor third person. And they can narrate events that have already\nhappened, have not yet happened, or are happening at the same\ntime as they are being told.\n• When telling a story, narrators can adopt the subjective\nperspective of one or more of the characters (inward focalisation)\nnoitciF\nesorP 79\nor limit themselves to observable events without entering any of\nthe characters’ consciousness (outward focalisation).\n• Similarly, narrators can know everything about the inner\nthoughts of characters and the unfolding of events (omniscient),\nor they can have only partial information about one or more\nof the characters (limited), or they can only know what can be\nperceived with the senses (objective).\n• Depending on the prominence or degree of involvement of\nthe narrator in the narration, we can distinguish two different\nnarrative methods: telling (summary) and showing (scene).\n• Beyond telling and showing, narrators can also make\nexplicit and implicit commentary on the story, sometimes\nat the expense of characters (ironic narrator) or themselves\n(unreliable narrator).\nReferences\nBooth, Wayne C., The Rhetoric of Fiction (Chicago, IL: University of Chicago Press,\n1983).\nChatman, Seymour Benjamin, Story and Discourse: Narrative Structure in Fiction and\nFilm (Ithaca, NY: Cornell University Press, 2000).\nGenette, Gérard, Narrative Discourse: An Essay in Method (Ithaca, NY: Cornell\nUniversity Press, 1990).\nIser, Wolfgang, The Implied Reader: Patterns of Communication in Prose Fiction from\nBunyan to Beckett (Baltimore, MD: Johns Hopkins University Press, 1995).\nRimmon-Kenan, Shlomith, Narrative Fiction: Contemporary Poetics (London, UK:\nRoutledge, 2002), https:\/\/doi.org\/10.4324\/9780203426111\nnoitarraN\n.5  81\n6. Language\nIf we are speaking about literature, there is no doubt that narrative\ndiscourse is made up of language. In fact, the closest we can get to\na definition of literature might be to say that it is ‘the creative use of\nlanguage.’1 Of course, not all stories are told using language. We have\nalready seen (in Chapter 1) that stories can be expressed in many different\nmedia, such as comics, dance, or movies. By definition, however, prose\nfiction narratives are precisely those where a narrator tells a story using\nwords arranged into sentences (see Fig. 6.1).\nFig. 6.1\nFirst page of the Book of Genesis\nin the Gutenberg Bible, Public\nDomain, https:\/\/de.wikipedia.org\/\nwiki\/Gutenberg-Bibel#\/media\/\nFile:Gutenberg_Bible_B42_Genesis.JPG\n1 Geoffrey N. Leech, Language in Literature: Style and Foregrounding (Harlow, UK:\nPearson Longman, 2008), p. 12, https:\/\/doi.org\/10.4324\/9781315846125\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.06\negaugnaL\n.6 82\nThe language employed in prose fiction varies widely. Some stories are told\nin a language that seems common or ordinary, with little use of adjectives\nand figurative devices, as in Raymond Carver’s ‘Cathedral’ and other\nminimalist short stories. At the other extreme, some stories are written in\na style that is so far removed from everyday language that most readers\nhave a hard time understanding it, as in James Joyce’s experimental novel\nFinnegans Wake. This diversity of styles and techniques makes it difficult to\ndescribe the language of narrative in any systematic way, short of saying\nthat it is a reflection of the variability of language itself.\nThe study of language in literature and other forms of discourse has\ntraditionally been the task of rhetoric, an ancient discipline that attempted to\nunderstand and teach the art of crafting effective and persuasive discourse.\nThe tradition of rhetoric still influences the analysis and classification of\nfigures of speech and other linguistic devices employed in contemporary\nprose fiction. In recent times, the application of modern linguistics to the\nstudy of literary texts has given rise to stylistics, a discipline that maintains\nsome of the interests and terminology of traditional rhetoric, while\nincorporating new concerns, concepts, and methodologies.\nIn this chapter, we will present some key insights about the language\nof short stories and novels, mostly derived from rhetoric and stylistics,\nwithout fleshing out all the linguistic details. To begin with, we need to\nexplain what we mean by style, a characteristic set of linguistic features\nthat is sometimes attributed to the implied author of a story, but also to\nthe real author, or even to a group of authors or to a whole culture. Then,\nwe will discuss the notion of foregrounding, which can help us to identify\nwith more precision the features that distinguish literary from everyday\nlanguage. Foregrounding in prose fiction can involve different aspects of\nlanguage, such as the use of figurative devices or figures of speech. After\nreviewing the most significant of these devices for narrative prose, we will\nexamine the use of symbols and allegory in short stories and novels, an\naspect of discourse that brings together language and theme. We will end\nthe chapter by briefly pointing out the importance of literary translation\nin giving readers access to the rich variety of prose fiction stories written\nall over the world.\n6.1 The Style of Narrative\nAccording to our semiotic model of narrative, discourse is the message\nthat the implied author communicates to the implied reader. This\nmessage not only has a content, which is the story, but also a form. The\nform of discourse is what we generally call its style. In general, the style\nis a characteristic set of linguistic features associated with a text or group\nnoitciF\nesorP 83\nof texts. Thus, the style of a short story or novel is the sum of linguistic\nfeatures that characterise its narrative discourse.\nNarrative style may be attributed to the implied author, which is the\nvirtual entity that enounces the discourse. In this sense, it is generally\npossible to analyse the linguistic features of style based on the text itself,\nwithout any need to know the identity of its real author. In some cases, as\nin anonymous works or publications under a pseudonym, we might not\neven have this information. However, we can still identify the specific\nlinguistic features of the text that define its style, or more precisely the\nstyle of its implied author. It is in this way that we speak, for example, of\nthe style of One Thousand and One Nights, even though it is probably the\nwork of several anonymous compilers.\nWhen we know the identity of the real author of several narratives,\nwe might compare the linguistic features of these works and identify\na common style that can be attributed to that author. For example, we\nspeak of the writing style of Jack Kerouac, by comparing the style of\nnovels like On the Road or The Dharma Bums. Sometimes, we can also\nidentify linguistic features that are shared by texts written in the same\ngenre, or around the same time, or in the same geographic or cultural\narea, even when the authors are different. In these cases, we may\nattribute a certain style to a genre (e.g. the style of thrillers), a period\n(e.g. the style of Romantic novels), or a whole culture (e.g. the style of\nKorean literature).\nGiven that short stories and novels are products of modern culture,\nwhich is highly individualistic and gives considerable importance\nto originality and to the creative genius of authors, it is not surprising\nthat style should be associated most of the time with the identity and\nreputation of a given writer. In such a context, writers themselves often\nstrive to shape (or ‘find,’ as they sometimes say) their own style, a unique\nand identifiable set of linguistic features that can raise the literary value\nof their work.\nBut style is not just the result of a vain search for literary glory. Authors\ncan be extremely conscious of their use of language, being aware of the\ncrucial importance of choosing the right word, the right turn of phrase,\nin order to engage the interest and imagination of their readers. Gustave\nFlaubert, for example, was famously determined to write in the most\nperfect style, working tirelessly to craft every sentence, every paragraph,\nsometimes during weeks or months. And although he published some of\nthe most elegant and evocative short stories and novels in the history of\nliterature, with a prose style that has been admired ever since, he always\nlaboured under the impression that his daily battle for perfection could\nnot be won (Fig. 6.2). ‘Human language,’ says the narrator of Madame\negaugnaL\n.6 84\nFig. 6.2\nFacsimile of the first draft of Gustave\nFlaubert’s short story ‘A Simple Heart’\n(Paris: Edition Conard des Oeuvres\nComplètes, 1910), Public Domain,\nhttps:\/\/commons.wikimedia.org\/wiki\/\nFile:Gustave_Flaubert_-_Trois_Contes,_\npage_66.jpg\nBovary, ‘is like a cracked pot on which we tap crude melodies to make\nbears dance, while we long to melt the stars.’2\n6.2 Foregrounding\nAs mentioned above, style is the set of linguistic features that characterise\na text. Thus, style generally results from multiple and complex decisions\nabout rhythm, phonological patterns, syntactic structure, lexical choice,\ncollocation, paragraph organisation, etc. These decisions are often guided\nby habit and convention. But they can also involve a variable degree\nof deviance from established norms and standards. In literature, these\ndeviations are generally more frequent and significant than in other forms\nof discourse.\nA key aspect of literary style is thus the notion of foregrounding. If\nthe language that we use to communicate in everyday situations is taken\nas the ‘norm,’ there are many literary texts, including short stories and\nnovels, which tend to deviate from that norm in various ways. Of the\nspecific linguistic features in those texts that diverge from the normal use\nof language, or from the background, we say that they are foregrounded.\nFor example, if we wanted to describe the presence of bees in a garden\nwhere two people are sitting in silence, we could say something like: ‘The\nsilence was interrupted by the buzzing of bees around the plants.’ There\nis nothing extraordinary in this sentence, which simply tries to convey\n2 Gustave Flaubert, Madame Bovary: Provincial Manners, trans. by Margaret Mauldon and\nMark Overstall (Oxford, UK: Oxford University Press, 2004), p. 170, my translation.\nnoitciF\nesorP 85\nthe intended meaning as economically and effectively as possible. The\nnarrator of Oscar Wilde’s The Picture of Dorian Gray, however, expresses\nthe same idea very differently: ‘The sullen murmur of the bees shouldering\ntheir way through the long unmown grass, or circling with monotonous\ninsistence round the dusty gilt horns of the straggling woodbine, seemed\nto make the stillness more oppressive.’3 In this long and resonant sentence,\nwhich uses many adjectives and figures of speech, the language is\nforegrounded and brought to the attention of the reader.4\nThe degree of foregrounding in literary texts varies quite considerably.\nIn lyrical poetry, for example, language is usually much more\nforegrounded than in prose narrative. Short stories and novels, especially\nthe most popular ones, are often written in a style that exhibits few or\nno perceptible differences from everyday language. But there are also\nmany prose fictions whose language deviates as much as any poem\nfrom a supposed norm. Short stories and novels written in prose that\nuses a highly foregrounded language, reminiscent of lyrical poetry, are\nsometimes classified as poetic or lyrical prose. Consider, for example, this\nparagraph from Virginia Woolf’s To the Lighthouse:\nTo want and not to have, sent all up her body a hardness, a hollowness, a\nstrain. And then to want and not to have — to want and want — how that\nwrung the heart, and wrung it again and again!5\nWhile foregrounding can be a useful notion to analyse the style of literary\ntexts, it is increasingly difficult to sustain the idea that there is a style-\nfree norm that could serve as background or as a reference to identify the\nfeatures of literary style. Even when we communicate with each other\nin everyday situations, our language is not devoid of figures of speech\nand other linguistic devices that we normally associate with literary\nlanguage (note, for example, the alliteration in the ‘buzzing of bees’ of\nthe sentence above). This is particularly the case for metaphors, which\nare the most significant and widely used figures of speech. Metaphors are\ncommonly employed in prose fiction, but they are also found in ordinary\nconversation and constitute the most important source of new words and\nexpressions in any language.6\nMoreover, we should not forget that foregrounding is not just a way\nof calling attention to language itself, but can serve important functions\n3 Oscar Wilde, The Picture of Dorian Gray, ed. by Robert Mighall (London, UK: Penguin,\n2003), p. 5.\n4 S ee also Roman Jakobson, ‘Linguistics and Poetics’, in Style in Language (Cambridge,\nMA: MIT Press, 1960), pp. 350–77, where foregrounding is described in terms of the\n‘poetic function’ of linguistic communication.\n5 Virginia Woolf, To the Lighthouse, ed. by Max Bollinger (London, UK: Urban Romantics,\n2012), p. 135.\n6 G eorge Lakoff and Mark Johnson, Metaphors We Live By (Chicago, IL: University of\nChicago Press, 2017).\negaugnaL\n.6 86\nin narrative and other forms of discourse. In prose fiction, foregrounded\nlanguage is commonly used in descriptions, when representing\ncharacters or environments, and when summarising events. In most\nordinary communicative interactions, both the speaker and the listener\nshare a context to which they can refer explicitly or implicitly. In principle,\nthe narrator could also rely on a shared context when telling the story\nto the narratee. But then many of the details and meanings of the story\nwould be lost to the implied reader, who has no presence at the level of\ndiscourse and no direct access to the storyworld. In fact, the existents of\nthe storyworld (events, environments, and characters) only exist insofar\nas narrative discourse succeeds in representing them in the imagination of\nthe reader. And this can only be done by means of language. In narrative\ncommunication, therefore, language is burdened, not only with conveying\nmeaning, but also with recreating the whole context where meaning can\nemerge in the reader’s mind.\nIn order to succeed in this difficult task, literary discourse needs to use\nthe features of language in slightly different ways than normal discourse\ntends to do. For example, descriptions in prose fiction often include\nnouns, adjectives, and phrases that evoke sensory experiences and convey\nsignificant details to readers. In summaries and scenes, verbs and adverbs\nare often carefully selected to recount as precisely and meaningfully as\npossible the actions of characters and other events in the plot. Moreover,\nsentences are crafted, not just to communicate events and ideas, but\nalso to affect the rhythm and flow of the narrative. But perhaps the\nmost noticeable rhetorical aspect of literary discourse, common to both\nshort stories and novels, is the widespread use of figurative language to\nstimulate and engage the reader’s imagination.\n6.3 Figures of Speech\nFigurative language, which includes so-called rhetorical figures, tropes,\nor figures of speech, is the use of language in ways that deviate from the\nliteral meaning of words and sentences. Literal meaning refers to the\nprecise definition or denotation of words. Figurative meaning, on the\nother hand, exploits the connotations and associations of words with\nother words or sounds.\nThis definition covers a wide array of linguistic features, most of which\nare part of everyday language, given that we seldom rely exclusively on\nliteral or precise definitions when we communicate with each other. The\ndifference between literary and ordinary language is not that one uses\nfigures of speech while the other one does not. Both literary and ordinary\ndiscourse use figurative language, but in literature its use tends to be\nnoitciF\nesorP 87\nmore intensive and creative than in most other communicative situations,\nincluding everyday speech or conversation.\nThroughout history, there have been many classifications of figurative\ndevices, which can be found in treatises and textbooks on rhetoric.7 Here,\nwe will only introduce briefly the most common figures of speech found\nin narrative discourse, giving some examples drawn from short stories\nand novels:\n1. Metaphor: A metaphor establishes a relationship of resemblance\nbetween two ideas or things by equating or replacing one (the\n‘tenor’) by the other (the ‘vehicle’). Metaphors are usually not\ncreated from similarity in denotation (literal meaning), but from\nsome similarity in the connotation of words (their associated\nor secondary meanings). In Kate Chopin’s short story ‘The\nStorm,’ for example, the narrator describes the sexual encounter\nbetween Alcée and Calixta by saying: ‘Her mouth was a fountain\nof delight.’ Of course, she does not mean that there was delight,\nmuch less any kind of liquid, gushing out from Calixta’s mouth.\nBut the image created by the narrator’s metaphor, equating the\nwoman’s mouth (tenor) to a fountain (vehicle), allows the reader\nto understand more vividly the cascade of emotions experienced\nby Alcée as he kisses his lover. Metaphor is perhaps the most\nimportant figure of speech, and many other forms of figurative\nlanguage can be considered, in a broad sense, metaphorical.\n2. Simile: Like metaphor, a simile establishes a relationship of\nresemblance between two ideas or things (tenor and vehicle),\nbut it makes the comparison explicit with a connector (usually,\n‘like’ or ‘as’). This connector is not a mere linguistic conjunction,\nbut it allows the simile to specify more clearly the quality or\nattribute that underlies the comparison between tenor and\nvehicle. In John Steinbeck’s The Grapes of Wrath, for example,\nthe narrator describes the landscape with the following words:\n‘The full green hills are round and soft as breasts.’ Here, the\nhills (tenor) and the breasts (vehicle) are explicitly compared in\nterms of certain connotative qualities (roundness and softness),\nbut not others (e.g. greenness).\n3. Personification: A personification attributes personal or human\ncharacteristics to a nonhuman entity, object, or idea. In this case,\nthe tenor is not human while the implicit or explicit vehicle is a\nhuman-specific quality or attribute. A variant of personification\nis the attribution of characteristics of animate entities, such as\n7 For example, Ward Farnsworth, Farnsworth’s Classical English Rhetoric (Jaffrey, NH:\nDavid R Godine, 2016).\negaugnaL\n.6 88\nnonhuman animals, to inanimate objects or ideas. In Arundhati\nRoy’s The God of Small Things, for example, the narrator describes\na house (tenor) as if it was an awkwardly dressed person\n(vehicle): ‘The old house on the hill wore its steep, gabled roof\npulled over its ears like a low hat.’\n4. Metonymy: A metonymy replaces an idea or thing by another\nidea or thing with which it is somehow connected or related in\nmeaning. Unlike metaphor, metonymy does not transfer qualities\nor attributes from the vehicle to the tenor. In a metonymy, ideas\nor things are associated because of their contiguity, not their\nresemblance. The narrator of Louis-Ferdinand Céline’s Journey\nto the End of the Night, for example, says: ‘When you write, you\nshould put your skin on the table.’ Here, the skin is not replacing\nthe writer’s self or consciousness based on any resemblance, but\nbecause it is contiguous or envelops his body.\n5. Synecdoche: A synecdoche is a form of metonymy (or at least,\nclosely related with it) where a term for a part refers to the\nwhole of something, or vice versa. In Margaret Mitchell’s Gone\nwith the Wind, one of the characters says: ‘I’m mighty glad\nGeorgia waited till after Christmas before it secedes or it would\nhave ruined the Christmas parties.’ The whole state of Georgia\nis used to refer to its constituents, or rather to its government\nand legislators. This synecdoche is very common, as we often\nspeak of the actions of a country’s government as if they were\ntaken by the whole country.\n6. Hyperbole: Hyperbole is an exaggeration aimed at emphasising\na certain point or creating a strong impression. In Gabriel\nGarcía Márquez’s One Hundred Years of Solitude, for example,\nthe narrator introduces the imaginary and primeval world of\nMacondo with this hyperbolic description: ‘The world was so\nrecent that many things lacked names, and in order to indicate\nthem it was necessary to point.’\n7. Oxymoron: An oxymoron connects or combines elements that\nappear to be contradictory, but in fact contain a concealed point\nor a paradox. The narrator of David Foster Wallace’s Infinite Jest,\nfor example, makes this paradoxical statement: ‘That everybody\nis identical in their secret unspoken belief that way deep down\nthey are different from everyone else.’\nAll these tropes are routinely used in everyday language, even if they\noften are not perceived as being figures of speech by speakers or listeners.\nWhen a figure of speech has been incorporated into normal language\nnoitciF\nesorP 89\nand is no longer recognised as such, we say that it is dead. For example,\nto say that one has ‘fallen in love’ (dead metaphor) or that ‘time is\nrunning out’ (dead personification) no longer elicits the kind of surprise,\nsensory experience, or revelation that literary tropes are supposed to\nelicit. However, these dead tropes still convey some of their figurative\nmeanings and associations. In general, dead tropes tend to be very good\ntropes, and this is the reason why they have become so much a part of\ncommon language that we do not even notice them anymore.\nOther tropes that are also used quite often, both in everyday language\nand in literary discourse, are clichés. Unlike dead figures of speech, clichés\noften fail to convey a figurative meaning or create any sensory effect in the\nreader. Instead, they tend to call attention to themselves, coming across as\ncommonplace and somewhat annoying. Examples of clichés are similes\nsuch as ‘eyes like stars’ or ‘teeth like pearls,’ which have been so overused\nin the Western literary tradition that they have lost much of their original\nforce. It is usual, therefore, for critics and rhetoricians to recommend\naspiring writers to avoid clichés as much as possible.\nIn other cases, writers go too far in their efforts to coin new and original\ntropes and fall into the opposite stylistic blunder. Farfetched tropes or\nconceits are figures of speech that are too strange, complex, awkward,\nor extreme to be effective. Like clichés, they tend to call attention to\nthemselves in a negative way. Comparing eyes to ‘pearly teeth,’ for\nexample, seems like a farfetched image, a conceit that would probably\nleave the reader baffled and scratching his head.\nIn figurative language, however, as in all matters of style, there are\nno hard rules or universally valid prescriptions. At the end of the day,\nit depends on the readers and the critics to decide whether a trope, no\nmatter how trite or farfetched it may seem, is effective and worthy of\npraise in the context of a particular narrative discourse.\n6.4 Symbolism\nIn general, a symbol is anything that represents something else by virtue\nof an arbitrary association.8 Symbols commonly used by modern humans\nare traffic signs, words, and flags, amongst many others. Symbols might\nrepresent other objects or things, but they can also represent individuals\nor groups of people, cultures, ideas, beliefs, values, etc. Insofar as human\nlanguage is a symbolic system, and we also routinely use non-linguistic\nsymbolic systems, there is no doubt that symbols play a crucial role in our\nunderstanding of the world and allow us to communicate effectively with\neach other.\n8 Charles Sanders Peirce, Philosophical Writing of Peirce, ed. by Justus Buchler (New York,\nNY: Dover Publications, 1955), pp. 102–3.\negaugnaL\n.6 90\nIn narrative discourse, any existent of the story (event, environment,\nor character) can become a symbol. Sometimes, symbolic associations\nare expressed by the narrator or by characters in the story, but they can\nalso be left implicit. Some symbols are unequivocally associated with\na certain meaning, like the letter ‘A’ that adulterous women are forced\nto wear to symbolise their crime in Nathaniel Hawthorne’s The Scarlet\nLetter. But there are other symbols whose meaning is open to different\ninterpretations, like the ‘night’ in Elie Wiesel’s novel Night, which could\nbe understood to represent, amongst other things, death, Nazism, despair,\nthe loss of faith, or the Holocaust.\nSome symbols used in narrative carry their meaning directly from the\nlifeworld of writers and readers, such as the Christian symbol of the cross.\nBut narratives can also create new symbols, by associating existents of the\nstory with any arbitrary meaning, or give new meanings to symbols that\nare also used in the lifeworld of readers. For example, the father and son\nin Cormac McCarthy’s novel The Road speak about having or carrying ‘the\nfire,’ which they conceive as a symbol of goodness and hope as they try to\nsurvive in the throes of worldwide annihilation.\nNarrative symbols can be internal, when they are associated with other\nexistents of the story. In the Harry Potter series, for example, the scar on\nHarry’s forehead symbolises the connection with his mortal enemy Lord\nVoldemort, but also marks him as the hero chosen to defeat the evil forces.\nSymbols can also be external, when the referent is not part of the storyworld,\nbut belongs to the level of discourse or the lifeworld of readers. Again, in\nHarry Potter, the names of some characters, like Albus Dumbledore, are\nsymbolic to the extent that they refer to meanings in Latin (‘albus’ means\nwhite) or Old English (‘dumbledore’ means bumblebee) which are only\nrelevant for the implied (or real) reader.\nIn certain narratives, symbolism becomes the structuring framework\nof the whole story, turning the events, environments, and characters of\nthe storyworld into representations of something other than themselves,\ngenerally moral or abstract ideas. This is what we call an allegory, from\nthe Ancient Greek ‘to speak of something else.’ Religious myths, like the\nstory of Christ’s crucifixion or the life of Buddha, are often constructed\nas allegories. Beyond their literal meaning, they have a moral and\nmetaphysical significance.\nSometimes, readers will interpret a story as an allegory even if the\nauthor did not intend to write it as such. This is called allegoresis, the\nact of reading any story as allegory. But there are also short stories\nand novels that are meant to be read as allegories. Narrative discourse\nis then constructed in such a way that invites readers to find hidden or\ntranscendent meanings in the events, characters, or environments of the\nstoryworld. This kind of sustained symbolism is quite common in fables,\nnoitciF\nesorP 91\nparables, and other literary stories that attempt to convey a lesson or\nillustrate a complex or abstract idea in narrative form.\nAn example of modern political allegory is George Orwell’s Animal\nFarm, a novel about farm animals rebelling against their human owners\n(Fig. 6.3). While the story can be read literally as a sort of fairytale, it\nis obvious that the events, characters, and environments of Orwell’s\nimaginary storyworld stand in for the real events, characters, and\nenvironments of the Russian Revolution, in order to extract a moral\nand political lesson about the degeneration of Communist ideals into\noutright tyranny.\nFig. 6.3\nA depiction of a pig dressed as a\nhuman capitalist to illustrate George\nOrwell’s Animal Farm. By Carl Glover,\nCC BY 2.0, https:\/\/www.flickr.com\/\nphotos\/34239598@N00\/16143409811\n6.5 Translation\nProse fiction is written in hundreds of different languages throughout\nthe world. Languages that have the largest share of total speakers (and\ntherefore, writers and readers) tend to be also the languages in which\nmost books are published, although the correlation is far from being exact.\nAt the top of the list, we find languages like English, Chinese, Spanish,\nFrench, German, Japanese, or Russian. But there are many other languages\nwith a relatively small number of speakers and yet a considerable number\nof readers and writers, such as Norwegian, Catalan, or Czech. And there\nare also widely spoken languages like Malay, Swahili, or Punjabi, whose\nproportion of writers and publications is comparatively small, but still\nadds up to a large number in absolute terms.\nIn such a diverse and globalised world, there is no reader who\ncould possibly be able to read every story in its original language. Even\negaugnaL\n.6 92\nsomeone with enough proficiency in all major languages of the planet\nwould require at some point or another to rely on translation in order\nto read prose fiction written in relatively minor or distant languages.\nThus, translations play a crucial role in allowing the flow of ideas and\nstories across different cultures.9 How many people in China or Japan, for\nexample, have read the original of Pride and Prejudice or Don Quixote? And\nhow many Europeans have read, or would be able to read, the original\nof Romance of the Three Kingdoms or the Tale of Genji? In fact, how many\npractising Christians around the world have read the Old Testament of\nthe Bible in its original Hebrew version?\nBut a translation is far from being an exact reproduction of the original\ntext into the target language. Like adaptations, literary translations are\nalways interpretations or rewritings of the original. Even if the translator\nis successful in faithfully preserving the existents of the story, its narrative\ndiscourse is going to be different because it is written in another language.\nWhen translating prose fiction, translators need to make difficult linguistic\nand interpretative choices, balancing their fidelity to the original content\nand form with the specific requirements and possibilities of the target\nlanguage. They also need to take into account the expectations of readers\nin a different language, as well as the rules and conventions prevalent in\nthat culture.\nPerhaps the most formidable challenge of literary translation is how\nto reproduce the style of the original text in the target language. This\ndifficulty tends to increase with the degree of foregrounding of the\nlinguistic features of the text. Thus, translating a popular thriller, such as\nDan Brown’s The Da Vinci Code, into hundreds of languages is a simple\noperation, which does not require difficult decisions on the part of the\nvarious translators involved. On the other hand, translating a lyrical\nand highly elliptical short story like Yasunari Kawabata’s ‘The Dancing\nGirl of Izu,’ or a polyphonic modernist novel like Alfred Döblin’s Berlin\nAlexanderplatz, with its heavy use of slang and local dialect, can be a\ndaunting task for any translator. This is also the reason why, in general,\nthe translation of poetry tends to be more difficult, and its results more\nuncertain, than the translation of prose fiction.\nIn short, literary translation is a creative endeavour, and one that is\noften unrecognised and undervalued, despite its obvious cultural benefits.\nWhile reading a translation is never the same as reading the original, it is\nthe only means for most readers to access the rich and boundless variety\nof stories that make up ‘world literature.’10\n9 Susan Bassnett and André Lefevere, Constructing Cultures: Essays on Literary Translation\n(Clevedon, UK: Multilingual Matters, 1998), pp. 9–10.\n10 Johann Wolfgang von Goethe, Conversations with Eckermann, trans. by John Oxenford\n(New York, NY: North Point Press, 1994), p. 132.\nnoitciF\nesorP 93\nSummary\n• Style is the characteristic set of linguistic features (rhythm,\nphonology, syntactic structure, lexical choice, etc.) associated\nwith a text. Style can be attributed to the implied author, but\nalso to the real author, and even to a specific cultural group.\n• A key aspect of literary style is foregrounding. In order to\neffectively communicate the content and meaning of the story\nand engage the imagination of readers, narrative discourse\noften relies on foregrounded language, deploying features and\ndevices that diverge from normal or everyday language.\n• Figurative language, or the use of figures of speech, including\nmetaphor, simile, personification, metonymy, synecdoche,\nhyperbole, oxymoron, and others, is a common form of\nforegrounding in prose fiction.\n• Events, environments, and characters in prose fiction become\nsymbols when they represent something other than themselves by\nvirtue of an arbitrary association. When symbolism is sustained\nthroughout the narrative, the story becomes an allegory.\n• Despite its complications and limitations, translation is the only\nmeans by which most readers can access the rich diversity of\nshort stories and novels published throughout the world.\nReferences\nBassnett, Susan, and André Lefevere, Constructing Cultures: Essays on Literary\nTranslation (Clevedon, UK: Multilingual Matters, 1998).\nFarnsworth, Ward, Farnsworth’s Classical English Rhetoric (Jaffrey, NH: David R\nGodine, 2016).\nFlaubert, Gustave, Madame Bovary: Provincial Manners, trans. by Margaret Mauldon\nand Mark Overstall (Oxford, UK: Oxford University Press, 2004).\nGoethe, Johann Wolfgang von, Conversations with Eckermann, trans. by John\nOxenford (New York, NY: North Point Press, 1994).\nJakobson, Roman, ‘Linguistics and Poetics,’ in Style in Language (Cambridge, MA:\nMIT Press, 1960), pp. 350–77.\nLakoff, George, and Mark Johnson, Metaphors We Live By (Chicago, IL: University\nof Chicago Press, 2017).\nLeech, Geoffrey N., Language in Literature: Style and Foregrounding (Harlow, UK:\nPearson Longman, 2008).\nPeirce, Charles Sanders, Philosophical Writing of Peirce, ed. by Justus Buchler (New\nYork, NY: Dover Publications, 1955).\nWilde, Oscar, The Picture of Dorian Gray, ed. by Robert Mighall (London, UK:\nPenguin, 2003).\nWoolf, Virginia, To the Lighthouse, ed. by Max Bollinger (London, UK: Urban\nRomantics, 2012).\negaugnaL\n.6  95\n7. Theme\nIn previous chapters, we have been examining in some detail how prose\nfiction is constructed and communicated. We have seen how stories are\nshaped by the arrangement of events into a plot, environments into a\nsetting, and characters into a characterisation. We have also looked at the\nvarious ways in which narrative discourse can be articulated in order to\neffectively communicate stories to the reader, including the process of\nnarration and the use of specific features of language. But we have not\nyet addressed what is perhaps the most crucial question any reader asks\nwhen dealing with a story: what does it mean?\nAt the beginning of this book, we defined narrative as the semiotic\nrepresentation of a sequence of events, meaningfully connected by\ntime and cause. But what exactly do we mean by ‘meaningful’? Are we\nspeaking about the meaning that authors give to the narratives they write,\nor about the meaning that readers give to the narratives they read? And\nwhat happens when these meanings, as they often do, diverge? Should\nthe intention of the author be the standard with which we determine the\nmeaning of a narrative text? Or should we recognise that every reader\ninterprets narrative texts from his or her own perspective, often generating\nmeanings that are at least as valid as those generated by the author?\nWhile literary theory has been asking these questions for a long time,1\nhere we are only interested in exploring the elements of meaning that\ncan be identified in narrative discourse, whether they are identified by\nwriters or readers. These elements of meaning are what we call themes.\nThe plural reflects the fact that meanings in fiction are always multiple\nand changing. A theme, therefore, is simply a meaning identified by an\ninterpreter of narrative discourse. It is important to stress that themes\n1 For an introduction to these and other debates in literary theory, see Terry Eagleton,\nLiterary Theory: An Introduction (Minneapolis, MN: University of Minnesota Press,\n2008); Jonathan D. Culler, Literary Theory: A Very Short Introduction (Oxford, UK:\nOxford University Press, 2011).\n© Ignasi Ribó, CC BY 4.0 https:\/\/doi.org\/10.11647\/OBP.0187.07\nemehT\n.7 96\nrequire some form of interpretation in order to emerge, whether it is the\nauthor, a critic, or any other reader who provides such interpretation. It\nis in this sense that themes connect narrative discourse, and the story\nconveyed by this discourse, with the lifeworld of readers and writers.\nIn this final chapter, we will first examine in some detail the concept\nof theme and we will try to locate its expression in prose fiction. Then\nwe will discuss how narratives often explore themes relating to identity\nand alterity, particularly in connection with gender and ethnicity. An\nimportant notion in the analysis of meaning in narrative is ideology,\nwhich encompasses the ideas, values, and beliefs that structure a\nworldview. As we will see, every narrative is ideological, but ideology can\nbe expressed in different ways in each text. This will lead us to some final\nconsiderations regarding the moral and political significance of prose\nfiction, particularly in the modern world. We will see that some narratives\nattempt to persuade readers of a moral truth, while others provide a more\nambiguous or complex representation of human morality. The function of\nshort stories and novels, as well as other literary texts, has often been the\nobject of passionate discussions. As a conclusion to this textbook, we will\nconsider whether writers should use prose fiction to intervene in society\nor confine themselves to purely artistic pursuits.\n7.1 The Meaning of Narrative\nWhen someone asks what a short story or novel is about, we tend to\nrespond with a synopsis or summary of the plot. The only thing we do\nin a synopsis is to identify the key existents in the story, including events,\nenvironments, and characters, and explain them in our own words. But a\nsynopsis is not a proper answer when someone asks what the story means.\nIn order to respond to this question, we need to identify and give an\ninterpretation of at least one theme in the narrative. Themes are elements\nof discourse, not of the story. They tell us what the story means, not for\nthe characters in the storyworld, but for anyone who has an interpretative\nperspective on the story.\nThemes are often identified explicitly by narrators when they tell\nthe story and add some form of commentary, whether it is to interpret,\njudge, generalise, or reflect on the events, environments, and characters\nof the storyworld (see Chapter 5). While the interpreter in this case is part\nof narrative discourse, the theme is usually also relevant for the actual\nreaders, who might agree or disagree with the framing of the theme\nprovided by the narrator. In many short stories and novels, especially\nthose with an omniscient narrative voice, the themes explicitly identified\nby the narrator reflect themes that the author has intentionally introduced\ninto the narrative and to which she is often quite attached. For example, the\nnoitciF\nesorP 97\nomniscient narrator of Harriet Beecher Stowe’s Uncle Tom’s Cabin clearly\nidentifies the immorality of slavery as a key theme in the narrative (Fig.\n7.1). This conviction is very much at the heart of the author’s intention\nwhen writing the book, and it has been shared by many of its readers\nthroughout the years.\nFig. 7.1\nHarriet Beecher Stowe, Uncle Tom’s\nCabin (Boston: John P. Jewett, 1852),\nInternet Archive Book Images, Public\nDomain, https:\/\/commons.wikimedia.\norg\/wiki\/File:Uncle_Tom%27s_cabin_-_\nor,_life_among_the_lowly_(1852)_\n(14586176090).jpg\nIn many other stories, however, the themes are not explicitly identified.\nThis might be because the narrator refrains from making explicit\ncommentary about the story, for instance when narration is conveyed\nby an objective narrative voice. One theme in Ernest Hemingway’s short\nstory ‘Hills Like White Elephants,’ for example, seems to be the moral\nambiguity of abortion. But this theme is never expressed as such by the\nnarrator, who merely conveys the words and gestures of the couple\nhaving a conversation in a forsaken train station, leaving readers to come\nup with their own interpretations of what it all means.\nSimilarly, when the narrator is inwardly focalised and has limited\nknowledge or perspective about the storyworld, his opinions or comments\nmight not reflect the actual themes of the narrative. This is generally the\ncase with unreliable narrators, who are not fully aware of the meaning of\nthe story they are telling. The story of Harper Lee’s To Kill a Mockingbird,\nfor example, is narrated from the perspective of Scout, a six-year-old\ngirl, who does not understand the meaning of the tragic events she is\nexperiencing. Like Uncle Tom’s Cabin, one key theme of the book seems\nto be the immorality of racial inequality. But since the girl is not able to\nframe or express it, at least not in those terms, this theme can only emerge\nfrom the interpretation of readers.\nRegarding theme, internal narrators are in a similar position to other\ncharacters in the storyworld, the only difference being that at least they\nknow that they are telling a story. Non-narrating characters only exist\nemehT\n.7 98\nin the storyworld and take part in the story being told, but they are\ngenerally not aware of the story as a story. Thus, unlike the narrator,\nthey are not able to add commentary or give an interpretation of the\nmeaning of events, environments, and characters at the level of narrative\ndiscourse. In many cases, however, characters express aspects of theme,\nin the form of subjective or general reflections about crucial elements of\nmeaning in the story. This is most common in so-called philosophical\nnovels, which often include long dialogues or monologues where\ncharacters develop ideas or opinions that connect with the themes\nof the story. This is the case in Fyodor Dostoyevsky’s The Brothers\nKaramazov, for example, where the brothers Ivan and Alyosha engage in\na passionate discussion about God and morality, which reveals many of\nthe themes in the novel. And yet, it is only when an external interpreter\nlinks these statements with the overall structure of the story that themes\nbegin to emerge.\nFinally, themes should not be confused with motifs. If themes are\nelements of meaning in narrative discourse, motifs are existents that\nrecur throughout the story and often acquire a symbolic significance. For\nexample, in F. Scott Fitzgerald’s novel The Great Gatsby, the green light\nthat shines at the end of the bay across from Gatsby’s mansion is a motif\nthat seems to represent or symbolise his hopes and expectations for the\nfuture, and more generally the American dream. Insofar as motifs are\nusually symbolic, their meaning tends to relate to narrative theme. This\nis the reason why motifs are sometimes called ‘minimal thematic units.’2\nA key theme in The Great Gatsby is the decadence and unreality of the\nAmerican dream; and motifs like the green light serve to reinforce and\nhighlight this theme throughout the narrative.\n7.2 Identity\nAs mentioned at the beginning of this book, narrative is the fundamental\nway by which we humans make sense of ourselves and our world. Our\nown identity is little more than a narrative, a story that we tell ourselves\nand others about who we are, where we come from, and where we are\ngoing. But our identity is also constructed by others, as they tell stories\nabout us and place us in the context of social narratives over which we\ngenerally have little control or influence. The complex dynamic of identity\nand alterity, how we construct ourselves, but also how we construct others\nand how we are constructed by them, is therefore an essential aspect of\nnarrative in all its forms.\n2 Gerald Prince, A Dictionary of Narratology (Lincoln , NE: University of Nebraska Press,\n2003), p. 97.\nnoitciF\nesorP 99\nIn modern times, prose fiction has become a privileged vehicle for\nthe construction of individual and collective identities, as well as for the\nconstruction of the different others that sustain and demarcate social\nidentification. Only through narrative fiction can we share (or think we\nshare) the subjective experience of another individual, access his or her\nthoughts, and participate from within in his or her life decisions. This\nillusion created by fiction is a powerful way to reinforce identification\nwith a given in-group, as well as to approach and try to understand out-\ngroups. But the same illusion can also contribute to distance readers from\nout-groups that are portrayed in ways that reinforce social stereotypes\nand negative biases.3 A crucial theme in many short stories and novels is\nprecisely the social process of defining oneself and others, particularly in\nrelation to two important dimensions of subjectivity: gender and ethnicity.\nGender refers to the set of characteristics that differentiate males and\nfemales. Beyond objective characterisations of gender, however, human\nbeings develop their own gender identity based on subjective and social\nfactors. These same factors are often reflected in the themes of short stories\nand novels, particularly in the depiction of male and female characters\nand the different roles or psychological traits that narrative discourse\nassigns to them. As most stories have been written by men, generally\nfrom an androcentric perspective, they have tended to cast women in\nsubordinate or dependent roles, often presenting them as ambivalent\nobjects of male desire and repulsion.4 This construction of the female\nother in narratives mostly written by males can be seen, for example, in\nWilliam Thackeray’s novel Vanity Fair, where women are characterised as\neither angelic creatures like Emmy Sedley or as dangerous temptresses\nlike Becky Sharp, a dualistic and imaginary representation of femininity\nthat serves to support patriarchal values and discourses.\nBefore the twentieth century, only a few female writers, such as\nCharlotte Brontë or George Eliot, had the courage or the opportunity to\nbreak social restrictions and conventions in order to produce short stories\nand novels that represented female subjectivity and agency in their own\nright, even if they often had to do so by complying with the dominant\nworldviews of a patriarchal society (see Fig. 7.2). It is only with the\ndevelopment of identity politics that women, as well as other minority\ngroups such as LGBT people, have been able to use prose fiction to openly\nexplore themes of gender identity and sexuality, or simply to speak with\ntheir own creative voice about themes that had traditionally been the sole\n3 On this point, see Chimamanda Ngozi Adichie, ‘The Danger of a Single Story’ (TED\nGlobal, July 2009), https:\/\/www.ted.com\/talks\/chimamanda_adichie_the_danger_of_\na_single_story\n4 S andra M. Gilbert and Susan Gubar, The Madwoman in the Attic: The Woman Writer\nand the Nineteenth-Century Literary Imagination (New Haven, CT: Yale University Press,\n2000).\nemehT\n.7 100\nFig. 7.2\n‘Young Woman Drawing’ (1801), oil\non canvas by Marie-Denise Villers\ndepicting an independent feminine\nspirit (possibly a self-portrait), Public\nDomain, https:\/\/commons.wikimedia.\norg\/wiki\/File:Villers_Young_Woman_\nDrawing.jpg\nprerogative of heterosexual men. A novel like Doris Lessing’s The Golden\nNotebook, for example, mixes personal, professional, literary, political,\nand feminist themes into a fragmentary narrative that aims to replicate\nthe fragmentation of female consciousness amid social and individual\nstruggles.\nEthnicity is another important theme in modern narrative, as numerous\nshort stories and novels have attempted to reflect on the dynamics\nof power, oppression, and resistance in the context of colonialism and\nother interethnic dynamics. We should not forget that prose fiction, at\nleast in its modern form, originates to a large extent in European culture\nat precisely the same time as Europeans were beginning a worldwide\nexpansion that allowed them to achieve economic, military, and cultural\nhegemony at the expense of other peoples. Revealing an entrenched\nethnocentrism, the European narratives of this period often portray these\n‘others’ as inferior, docile, or underdeveloped, sustaining in more or less\nexplicit terms the colonial project of Western powers.5 One example of this\nkind of legitimation can be found in Gustave Flaubert’s novel Salammbô,\nwhose themes of oriental sensuality, exoticism, and corruption reflect and\nstrengthen a stereotypical and objectifying view of Middle-Eastern and\nnon-European others.\nAs the process of decolonisation gave way to a postcolonial and\nglobalised world, previously colonised and other non-Western peoples\nhave been struggling to recover their own identity and sense of agency\n(see Fig. 7.3). And they have often done so by writing stories where they\nrepresent themselves as subjects, telling stories with themes that are\n5 E dward W. Said, Orientalism (New York, NY: Vintage Books, 1979).\nnoitciF\nesorP 101\nrelevant and meaningful for them, and expressing those themes from their\nown individual and collective perspective. This is the case, for example, in\nChinua Achebe’s Things Fall Apart, a novel dealing with the destructive\nconsequences of Western colonialism in Africa from the point of view of\nthe colonised.\nFig. 7.3\nMural of Frantz Fanon, author of The\nWretched of the Earth, Public Domain,\nhttps:\/\/www.flickr.com\/photos\/\nmontrealprotest\/19582249739\n7.3 Ideology\nWe call ideology the interconnected set of beliefs, ideas, values, and\nnorms that structure the worldview of a person or group. Ideology is\ngenerally invisible, especially for the individuals or groups whose views\nand opinions are largely defined by it. For example, a devout Christian\nor Buddhist will probably not identify his beliefs as constituting an\nideological view of the world, but rather the way things actually are.\nBut all of us are, in one way or another, subject to different ideological\npositions, whether we adhere to rationalism, liberalism, communism, or\nother structured systems of thought and value. These ideologies influence\nto a large extent the meanings we ascribe to ourselves and to everything\nelse in our lifeworld, including other people.\nNarrative discourse is particularly effective at communicating\nideological views without necessarily stating or even recognising them. If\na narrative manages to convince readers that its storyworld is a verisimilar\nrepresentation of their own lifeworld, the ideology that structures its\ndiscourse is likely to be tacitly accepted as a valid and credible one. This is\nwhy narratives are often used, consciously or not, to sustain the ideologies\nof certain social groups, usually those that have more power, or at least\nthe capacity to produce and propagate their discourses more effectively\nemehT\n.7 102\nthroughout society.6 At the same time, however, narratives are also used,\nagain, consciously or not, by other groups with less power in society, as\nthey attempt to resist dominant ideologies and express their own set of\nvalues and beliefs.\nProse fiction has been, and continues to be, an important vehicle for\nconveying or contesting ideology, whether explicitly or implicitly. In fact,\nthere is no fiction narrative whose discourse does not express in one way\nor another at least one ideological position, just as there is no individual\nor collective opinion that is not ideological. There are four different ways\nin which ideology can be represented in the narrative discourse of short\nstories and novels:\n1. Concealed: Prose fiction can embrace an ideology implicitly,\nwithout recognising it as an ideological commitment. Yet,\nideology often impregnates the representation of the storyworld\n(events, environments, characters) or narrative discourse\n(narration, language, theme). For example, in Ian Fleming’s\nCasino Royale and other novels about the secret agent James Bond,\neverything denotes the masculine, imperialistic, and capitalistic\nworldview of British elites after the Second World War, from\nthe sports cars Bond drives to the enemies he fights against, the\nwomen he seduces, or the language he speaks.\n2. Committed: Prose fiction can also embrace an ideology explicitly,\nwhile trying to convince readers of the truthfulness of its tenets.\nSocialist realist novels, such as Maxim Gorky’s The Mother,\nopenly advocate the ideals and values of socialism, by portraying\nthe working class as a heroic agent of political, cultural, and\neconomic transformation towards a better society, against the\nopposition of self-interested groups like the capitalists or the\naristocracy.\n3. Critical: Prose fiction is sometimes critical of dominant ideologies,\nwithout necessarily embracing or committing to an alternative\nideology. George Orwell’s 1984 (Fig. 7.4), for example, offers\na bleak representation of a totalitarian society in a dystopian\nfuture, as a way to criticise both the capitalist and socialist\nideologies that were struggling for world dominance at the time\nof the Cold War.\n4. Ambiguous: Some prose fiction stories present a more ambivalent\nor ambiguous view of alternative ideological positions. For\ninstance, ideologies can be advocated or symbolised by\ndifferent characters, as in Thomas Mann’s novel The Magic\n6 S ee Terry Eagleton, Ideology: An Introduction (London, UK: Verso, 1991).\nnoitciF\nesorP 103\nMountain, where the liberal, humanistic, religious, conservative,\nhedonistic, and nihilistic ideologies prevalent in Europe\naround the First World War are conveyed through the actions\nand opinions of various characters in the story. Ideologies can\nalso be represented directly by the events, environments, and\ncharacters of an alternative storyworld, as in Ursula K. Le Guin’s\nscience-fiction novel The Dispossessed, where two different\nplanets, one based on hierarchical capitalism, the other one on\nauthoritarian communism, cooperate and compete with each\nother in a fictional universe.\nFig. 7.4 Poster depicting Big Brother’s slogan from George Orwell’s dystopian\nnovel 1984. By Frederic Guimont, Free Art Licence, https:\/\/commons.\nwikimedia.org\/wiki\/File:Cropped-big-brother-is-watching-1984.png\n7.4 Morality\nSome fictional stories try to convey an unambiguous moral message or\nlesson. We call this message the moral or thesis of the narrative. If there is\na thesis, it is always one of the most relevant themes in the narrative. But\nthere might be other themes besides the thesis that the narrative touches\nupon. The thesis is an aspect of narrative discourse, not of the story. It is\nan idea, theory, or lesson that the implied author is trying to persuade the\nimplied reader to accept.\nA thesis or moral can be explicitly stated in the narrative, but it can also\nbe left implicit. Traditional narrative genres like the fable or parable often\nhave morals, even if these morals are not always explicit. Fables present\nsupernatural characters, often nonhuman animals who act like humans,\nemehT\n.7 104\nin order to convey a moral lesson, while parables present ambiguous\nor puzzling situations and dilemmas in order to provide the lesson in a\nmore roundabout way. These genres were popular in the past, when it\nwas often assumed that literature’s main function was to educate readers\nand provide them with some sort of moral guidance. To a certain extent,\nthis is still the case in modern literature, but the kinds of lessons that\nnarrative and other forms of literary discourse provide today tend to be\nmore ambivalent and controversial.\nNovels that have a clear didactic purpose and expound a moral or\nphilosophical message are sometimes called ‘thesis novels’ (from the\nFrench, ‘roman à thèse’). An example of this kind of novel is Voltaire’s\nCandide, which tells in a sarcastic tone the story of a young man whose\noptimistic worldview is repeatedly shaken by the hardships and disasters\nof the real world.\nFig. 7.5 Oscar Wilde (1884), photographic print on card mount: albume. By\nNapoleon Sarony, Public Domain, https:\/\/commons.wikimedia.org\/wiki\/\nFile:A_Wilde_time_3.jpg\nIn general, however, moral lessons in modern prose fiction tend not to\nconstitute the whole theme of the narrative, as in thesis novels. To be sure,\nthere are still modern fictions that explicitly and unambiguously present\na moral thesis, especially in children’s or popular genres, as in the Harry\nPotter series. But for the most part, literature is no longer tasked with\nthe education of readers. Rather, it is expected that it will present them\nwith moral or existential alternatives that reflect the complexities and\nuncertainties of life. Moral lessons, therefore, are often mixed with other\nnoitciF\nesorP 105\nthemes and ideas, which may even contradict or undermine moral certitude.\nIn Robert Louis Stevenson’s novel The Strange Case of Dr Jekyll and Mr Hyde,\nfor example, the moral dualism that drives the plot and constitutes the\nmain theme of the narrative is undercut by the realisation that good and\nevil cannot be easily distinguished from one another, much less decanted\nas if they were separate essences. In fact, as modern narratives often imply,\nmorality is more a matter of perspective and interpretation, rather than a\nset of absolute principles or rules that people should follow.\nOne important consequence of this moral relativism is the modern\nview that short stories and novels should not refrain from showing what\nis ugly, unpleasant, improper, or revolting about life and human nature.\nAs one of the characters in Oscar Wilde’s The Portrait of Dorian Gray says,\n‘the books that the world calls immoral are books that show the world its\nown shame’ (see Fig. 7.5).7\n7.5 Art and Politics\nA question that has often stirred controversy amongst writers and readers\nis whether literary narratives should be used as instruments to achieve\npolitical and social ends. As we have seen, the idea that narratives,\nincluding short stories and novels, have a didactic function is not a\nmodern one. Narratives have traditionally been used to convey moral\nlessons and worldviews that tended to reflect the ideologies of writers\nand the societies in which they lived. Even when these ideologies were\nconcealed, instead of being explicitly stated in narrative discourse, they\nstill exercised an influence on readers and had therefore an impact on\nsocial and political developments.\nDominant ideologies, when presented as convincing narrative fictions,\ncan make partial worldviews held by specific social groups seem natural\nand common-sensical. In the past, institutions like slavery, colonialism,\nor patriarchy, which today are generally considered oppressive and\nunacceptable, were held as incontrovertible by most reasonable and well-\neducated people. And narratives reflected those values and ideas, as well\nas its contestations, in the same way that today’s narratives might reflect\nthe values and ideas associated with capitalism, democracy, socialism,\nmulticulturalism, or other ideological positions that occupy current\npolitical debates.\nWhat should writers do in relation to these ideas and controversies?\nShould they use their narratives to intervene in political argument, even\nto the point of providing a platform to propagate a certain ideology and\n7 Oscar Wilde, The Picture of Dorian Gray, ed. by Robert Mighall (London, UK: Penguin,\n2003), p. 208.\nemehT\n.7 106\npersuade readers to embrace it? Or should they refrain from taking a\npolitical stance and from trying to convert readers to their cause, while\nconcentrating instead on perfecting their art and writing self-sufficient\nprose fictions?\nBoth positions have been defended in modern times by writers\nand critics who were concerned about this question. For some, like\nthe philosopher Jean-Paul Sartre, author of the novel Nausea, writers\ncannot isolate themselves from reality and have the responsibility to use\nnarratives to express their political commitment in the face of the various\nforms of exploitation and injustice found in the world. For others, however,\na writer should not be bound to any ideology or asked to become the\npreacher for any cause, no matter how noble or justified it might be. This\nposition is exemplified by Stephen Dedalus, James Joyce’s fictional alter\nego in his novel A Portrait of the Artist as a Young Man, for whom the writer\nshould aim ‘to discover the mode of life or of art whereby the spirit can\nexpress itself in unfettered freedom.’8\nAt a time when many prose fiction writers are perhaps less motivated\nby a personal commitment to bring about change in society or by the\naspiration to attain beauty or artistic perfection, and rather by the more\nprosaic goals of entertainment, it might seem idle to ask these questions.\nBut even when authors are not aware of their own motivations or\nresponsibilities, their stories, recreated at every reading by the imagination\nof countless readers, continue nonetheless to have an impact in the world.\nWhether prose fiction can contribute to make the world a better place in\nwhich to live, helping us to sustain its injustices and immoralities, is still\nan open question. And perhaps it is one that will remain unanswered as\nlong as we need to tell stories in order to better understand each other.\nSummary\n• Themes are meanings identifiable in narrative discourse\nby anyone who has an interpretive perspective on the story,\nwhether it is the narrator, the author, or the reader.\n• Many themes in modern prose fiction deal with the dynamics\nand conflicts of identity (the construction of the self) and alterity\n(the construction of others), particularly in relation to gender\nand ethnicity.\n• All narratives express some form of ideology — a structured\nset of values, ideas, and beliefs — whether discourse conceals\n8 James Joyce, A Portrait of the Artist as a Young Man (Oxford: Oxford University Press,\n2000), p. 207.\nnoitciF\nesorP "}