{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nCritical Thinking\nCritical Thinking in College Writing: From the Personal\nto the Academic\nThere is something about the term “critical thinking” that makes you draw a blank every time you think about what it means.* It seems so fuzzy\nand abstract that you end up feeling uncomfortable, as though the term is thrust upon you, demanding an intellectual e\u0000ort that you may not yet\nhave. But you know it requires you to enter a realm of smart, complex ideas that others have written about and that you have to navigate,\nunderstand, and interact with just as intelligently. It’s a lot to ask for. It makes you feel like a stranger in a strange land.\nAs a writing teacher I am accustomed to reading and responding to di\u0000cult texts. In fact, I like grappling with texts that have interesting ideas no\nmatter how complicated they are because I understand their value. I have learned through my years of education that what ultimately engages\nme, keeps me enthralled, is not just grammatically pristine, \u0000uent writing, but writing that forces me to think beyond the page. It is writing where\nthe writer has challenged herself and then o\u0000ered up that challenge to the reader, like a baton in a relay race. The idea is to run with the baton.\nYou will often come across critical thinking and analysis as requirements for assignments in writing and upper-level courses in a variety of\ndisciplines. Instructors have varying explanations of what they actually require of you, but, in general, they expect you to respond thoughtfully to\ntexts you have read. The \u0000rst thing you should remember is not to be afraid of critical thinking. It does not mean that you have to criticize the\ntext, disagree with its premise, or attack the writer simply because you feel you must. Criticism is the process of responding to and evaluating\nideas, argument, and style so that readers understand how and why you value these items.\nCritical thinking is also a process that is fundamental to all disciplines. While in this essay I refer mainly to critical thinking in composition, the\ngeneral principles behind critical thinking are strikingly similar in other \u0000elds and disciplines. In history, for instance, it could mean examining and\nanalyzing primary sources in order to understand the context in which they were written. In the hard sciences, it usually involves careful\nreasoning, making judgments and decisions, and problem solving. While critical thinking may be subject-speci\u0000c, that is to say, it can vary in\nmethod and technique depending on the discipline, most of its general principles such as rational thinking, making independent evaluations and\njudgments, and a healthy skepticism of what is being read, are common to all disciplines. No matter the area of study, the application of critical\nthinking skills leads to clear and \u0000exible thinking and a better understanding of the subject at hand.\nTo be a critical thinker you not only have to have an informed opinion about the text but also a thoughtful response to it. There is no doubt that\ncritical thinking is serious thinking, so here are some steps you can take to become a serious thinker and writer.\nAttentive Reading: A Foundation for Critical Thinking\nA critical thinker is always a good reader because to engage critically with a text you have to read attentively and with an open mind, absorbing\nnew ideas and forming your own as you go along. Let us imagine you are reading an essay by Annie Dillard, a famous essayist, called “Living like\nWeasels.” Students are drawn to it because the idea of the essay appeals to something personally fundamental to all of us: how to live our lives.\nIt is also a provocative essay that pulls the reader into the argument and forces a reaction, a good criterion for critical thinking.\nSo let’s say that in reading the essay you encounter a quote that gives you pause. In describing her encounter with a weasel in Hollins Pond,\nDillard says, “I would like to learn, or remember, how to live . . . I don’t think I can learn from a wild animal how to live in particular . . . but I might\nlearn something of mindlessness, something of the purity of living in the physical senses and the dignity of living without bias or motive” (220).\nYou may not be familiar with language like this. It seems complicated, and you have to stop ever so often (perhaps after every phrase) to see if\nyou understood what Dillard means. You may ask yourself these questions:\n• What does “mindlessness” mean in this context?\n• How can one “learn something of mindlessness?”\n• What does Dillard mean by “purity of living in the physical senses?”\n• How can one live “without bias or motive?”\nThese questions show that you are an attentive reader. Instead of simply glossing over this important passage, you have actually stopped to\nthink about what the writer means and what she expects you to get from it. Here is how I read the quote and try to answer the questions above:\nDillard proposes a simple and uncomplicated way of life as she looks to the animal world for inspiration. It is ironic that she admires the quality of\n“mindlessness” since it is our consciousness, our very capacity to think and reason, which makes us human, which makes us beings of a higher\norder. Yet, Dillard seems to imply that we need to live instinctually, to be guided by our senses rather than our intellect. Such a “thoughtless”\napproach to daily living, according to Dillard, would mean that our actions would not be tainted by our biases or motives, our prejudices. We\nwould go back to a primal way of living, like the weasel she observes. It may take you some time to arrive at this understanding on your own, but\nit is important to stop, re\u0000ect, and ask questions of the text whenever you feel stumped by it. Often such questions will be helpful during class\ndiscussions and peer review sessions.\nListing Important Ideas\nWhen reading any essay, keep track of all the important points the writer makes by jotting down a list of ideas or quotations in a notebook. This\nlist not only allows you to remember ideas that are central to the writer’s argument, ideas that struck you in some way or the other, but it also\nyou helps you to get a good sense of the whole reading assignment point by point. In reading Annie Dillard’s essay, we come across several\npoints that contribute toward her proposal for better living and that help us get a better understanding of her main argument. Here is a list of\nsome of her ideas that struck me as important:\n1. “The weasel lives in necessity and we live in choice, hating necessity and dying at the last ignobly in its talons” (220).\n2. “And I suspect that for me the way is like the weasel’s: open to time and death painlessly, noticing everything, remembering nothing, choosing\nthe given with a \u0000erce and pointed will” (221).\n3. “We can live any way we want. People take vows of poverty, chastity, and obedience—even of silence—by choice. The thing is to stalk your\ncalling in a certain skilled and supple way, to locate the most tender and live spot and plug into that pulse” (221).\n4. “A weasel doesn’t ‘attack’ anything; a weasel lives as he’s meant to, yielding at every moment to the perfect freedom of single necessity” (221).\n5. “I think it would be well, and proper, and obedient, and pure, to grasp your one necessity and not let it go, to dangle from it limp wherever it\ntakes you” (221).\nThese quotations give you a cumulative sense of what Dillard is trying to get at in her essay, that is, they lay out the elements with which she\nbuilds her argument. She \u0000rst explains how the weasel lives, what she learns from observing the weasel, and then prescribes a lifestyle she\nadmires—the central concern of her essay.\nNoticing Key Terms and Summarizing Important Quotes\nWithin the list of quotations above are key terms and phrases that are critical to your understanding of the ideal life as Dillard describes it. For\ninstance, “mindlessness,” “instinct,” “perfect freedom of a single necessity,” “stalk your calling,” “choice,” and “\u0000erce and pointed will” are weighty\nterms and phrases, heavy with meaning, that you need to spend time understanding. You also need to understand the relationship between them\nand the quotations in which they appear. This is how you might work on each quotation to get a sense of its meaning and then come up with a\nstatement that takes the key terms into account and expresses a general understanding of the text:\nQuote 1: Animals (like the weasel) live in “necessity,” which means that their only goal in life is to survive. They don’t think about how they should\nlive or what choices they should make like humans do. According to Dillard, we like to have options and resist the idea of “necessity.” We \u0000ght\ndeath—an inevitable force that we have no control over—and yet ultimately surrender to it as it is the necessary end of our lives.\nQuote 2: Dillard thinks the weasel’s way of life is the best way to live. It implies a pure and simple approach to life where we do not worry about\nthe passage of time or the approach of death. Like the weasel, we should live life in the moment, intensely experiencing everything but not\ndwelling on the past. We should accept our condition, what we are “given,” with a “\u0000erce and pointed will.” Perhaps this means that we should\npursue our one goal, our one passion in life, with the same single-minded determination and tenacity that we see in the weasel.\nQuote 3: As humans, we can choose any lifestyle we want. The trick, however, is to go after our one goal, one passion like a stalker would after a\nprey.\nQuote 4: While we may think that the weasel (or any animal) chooses to attack other animals, it is really only surrendering to the one thing it\nknows: its need to live. Dillard tells us there is “the perfect freedom” in this desire to survive because to her, the lack of options (the animal has\nno other option than to \u0000ght to survive) is the most liberating of all.\nQuote 5: Dillard urges us to latch on to our deepest passion in life (the “one necessity”) with the tenacity of a weasel and not let go. Perhaps\nshe’s telling us how important it is to have an unwavering focus or goal in life.\nWriting a Personal Response: Looking Inward\nDillard’s ideas will have certainly provoked a response in your mind, so if you have some clear thoughts about how you feel about the essay this\nis the time to write them down. As you look at the quotes you have selected and your explanation of their meaning, begin to create your personal\nresponse to the essay. You may begin by using some of these strategies:\n1. Tell a story. Has Dillard’s essay reminded you of an experience you have had? Write a story in which you illustrate a point that Dillard makes or\nhint at an idea that is connected to her essay.\n2. Focus on an idea from Dillard’s essay that is personally important to you. Write down your thoughts about this idea in a \u0000rst person narrative\nand explain your perspective on the issue.\n3. If you are uncomfortable writing a personal narrative or using “I” (you should not be), re\u0000ect on some of her ideas that seem important and\nmeaningful in general. Why were you struck by these ideas?\n4. Write a short letter to Dillard in which you speak to her about the essay. You may compliment her on some of her ideas by explaining why you\nlike them, ask her a question related to her essay and explain why that question came to you, and genuinely start up a conversation with her.\nThis stage in critical thinking is important for establishing your relationship with a text. What do I mean by this “relationship,” you may ask?\nSimply put, it has to do with how you feel about the text. Are you amazed by how true the ideas seem to be, how wise Dillard sounds? Or are you\nannoyed by Dillard’s let-me-tell-you-how-to-live approach and disturbed by the impractical ideas she so easily prescribes? Do you \u0000nd Dillard’s\nvoice and style thrilling and engaging or merely confusing? No matter which of the personal response options you select, your initial reaction to\nthe text will help shape your views about it.\nMaking an Academic Connection: Looking Outward\nFirst year writing courses are designed to teach a range of writing— from the personal to the academic—so that you can learn to express\nadvanced ideas, arguments, concepts, or theories in any discipline. While the example I have been discussing pertains mainly to college writing,\nthe method of analysis and approach to critical thinking I have demonstrated here will serve you well in a variety of disciplines. Since critical\nthinking and analysis are key elements of the reading and writing you will do in college, it is important to understand how they form a part of\nacademic writing. No matter how intimidating the term “academic writing” may seem (it is, after all, associated with advanced writing and\nbecoming an expert in a \u0000eld of study), embrace it not as a temporary college requirement but as a habit of mind.\nTo some, academic writing often implies impersonal writing, writing that is detached, distant, and lacking in personal meaning or relevance.\nHowever, this is often not true of the academic writing you will do in a composition class. Here your presence as a writer—your thoughts,\nexperiences, ideas, and therefore who you are—is of much signi\u0000cance to the writing you produce. In fact, it would not be farfetched to say that\nin a writing class academic writing often begins with personal writing. Let me explain. If critical thinking begins with a personal view of the text,\nacademic writing helps you broaden that view by going beyond the personal to a more universal point of view. In other words, academic writing\noften has its roots in one’s private opinion or perspective about another writer’s ideas but ultimately goes beyond this opinion to the expression\nof larger, more abstract ideas. Your personal vision—your core beliefs and general approach to life— will help you arrive at these “larger ideas” or\nuniversal propositions that any reader can understand and be enlightened by, if not agree with. In short, academic writing is largely about taking\na critical, analytical stance toward a subject in order to arrive at some compelling conclusions.\nLet us now think about how you might apply your critical thinking skills to move from a personal reaction to a more formal academic response to\nAnnie Dillard’s essay. The second stage of critical thinking involves textual analysis and requires you to do the following:\n• Summarize the writer’s ideas the best you can in a brief paragraph. This provides the basis for extended analysis since it contains the central\nideas of the piece, the building blocks, so to speak.\n• Evaluate the most important ideas of the essay by considering their merits or \u0000aws, their worthiness or lack of worthiness. Do not merely agree\nor disagree with the ideas but explore and explain why you believe they are socially, politically, philosophically, or historically important and\nrelevant, or why you need to question, challenge, or reject them.\n• Identify gaps or discrepancies in the writer’s argument. Does she contradict herself? If so, explain how this contradiction forces you to think\nmore deeply about her ideas. Or if you are confused, explain what is confusing and why.\n• Examine the strategies the writer uses to express her ideas. Look particularly at her style, voice, use of \u0000gurative language, and the way she\nstructures her essay and organizes her ideas. Do these strategies strengthen or weaken her argument? How?\n• Include a second text—an essay, a poem, lyrics of a song— whose ideas enhance your reading and analysis of the primary text. This text may\nhelp provide evidence by supporting a point you’re making, and further your argument.\n• Extend the writer’s ideas, develop your own perspective, and propose new ways of thinking about the subject at hand.\nCrafting the Essay\nOnce you have taken notes and developed a thorough understanding of the text, you are on your way to writing a good essay. If you were asked\nto write an exploratory essay, a personal response to Dillard’s essay would probably su\u0000ce. However, an academic writing assignment requires\nyou to be more critical. As counter-intuitive as it may sound, beginning your essay with a personal anecdote often helps to establish your\nrelationship to the text and draw the reader into your writing. It also helps to ease you into the more complex task of textual analysis. Once you\nbegin to analyze Dillard’s ideas, go back to the list of important ideas and quotations you created as you read the essay. After a brief summary,\nengage with the quotations that are most important, that get to the heart of Dillard’s ideas, and explore their meaning. Textual engagement, a\nseemingly slippery concept, simply means that you respond directly to some of Dillard’s ideas, examine the value of Dillard’s assertions, and\nexplain why they are worthwhile or why they should be rejected. This should help you to transition into analysis and evaluation. Also, this part of\nyour essay will most clearly re\u0000ect your critical thinking abilities as you are expected not only to represent Dillard’s ideas but also to weigh their\nsigni\u0000cance. Your observations about the various points she makes, analysis of con\u0000icting viewpoints or contradictions, and your understanding\nof her general thesis should now be synthesized into a rich new idea about how we should live our lives. Conclude by explaining this fresh point\nof view in clear, compelling language and by rearticulating your main argument.\nModeling Good Writing\nWhen I teach a writing class, I often show students samples of really good writing that I’ve collected over the years. I do this for two reasons:\n\u0000rst, to show students how another freshman writer understood and responded to an assignment that they are currently working on; and\nsecond, to encourage them to succeed as well. I explain that although they may be intimidated by strong, sophisticated writing and feel\npressured to perform similarly, it is always helpful to see what it takes to get an A. It also helps to follow a writer’s imagination, to learn how the\nmind works when confronted with a task involving critical thinking. The following sample is a response to the Annie Dillard essay. Figure 1\nincludes the entire student essay and my comments are inserted into the text to guide your reading.\nThough this student has not included a personal narrative in his essay, his own world-vievvw is clear throughout. His personal point of view, while\nnot expressed in \u0000rst person statements, is evident from the very beginning. So we could say that a personal response to the text need not\nalways be expressed in experiential or narrative form but may be present as re\u0000ection, as it is here. The point is that the writer has traveled\nthrough the rough terrain of critical thinking by starting out with his own ruminations on the subject, then by critically analyzing and responding\nto Dillard’s text, and \u0000nally by developing a strong point of view of his own about our responsibility as human beings. As readers we are engaged\nby clear, compelling writing and riveted by critical thinking that produces a movement of ideas that give the essay depth and meaning. The\nchallenge Dillard set forth in her essay has been met and the baton passed along to us.\nDiscussion\n1. Write about your experiences with critical thinking assignments. What seemed to be the most di\u0000cult? What approaches did you try to\novercome the di\u0000culty?\n2. Respond to the list of strategies on how to conduct textual analysis. How well do these strategies work for you? Add your own tips to the list.\n3. Evaluate the student essay by noting aspects of critical thinking that are evident to you. How would you grade this essay? What other qualities\n(or problems) do you notice?\nWorks Cited\nDillard, Annie. “Living like Weasels.” One Hundred Great Essays. Ed. Robert DiYanni. New York: Longman, 2002. 217–221. Print.\nLicenses and Attributions\nNext\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}