{"text":"1\nIntroduction to Literature:\nWhat? Why? How?\nWhen is the last time you read a book or a story simply because\nit interested you? If you were to classify that book, would you\ncall it fiction or literature? This is an interesting separation,\nwith many possible reasons for it. One is that “fiction” and\n“literature” are regarded as quite different things. “Fiction,” for\nexample, is what people read for enjoyment. “Literature” is\nwhat they read for school. Or “fiction” is what living people\nwrite and is about the present. “Literature” was written by\npeople (often white males) who have since died and is about\ntimes and places that have nothing to do with us. Or “fiction”\noffers everyday pleasures, but “literature” is to be honored and\nrespected, even though it is boring. Of course, when we put\nanything on a pedestal, we remove it from everyday life, so the\ncorollary is that literature is to be honored and respected, but\nit is not to be read, certainly not by any normal person with\nnormal interests.\nSadly, it is the guardians of literature, that is, of the classics,\nwho have done so much to take the life out of literature, to\nput it on a pedestal and thereby to make it an irrelevant aspect\nof American life. People study literature because they love\n1 2\nliterature. They certainly don’t do it for the money. But what\nhappens too often, especially in colleges, is that teachers forget\nwhat it was that first interested them in the study of literature.\nThey forget the joy that they first felt (and perhaps still feel)\nas they read a new novel or a poem or as they reread a work\nand saw something new in it. Instead, they erect formidable\nwalls around these literary works, giving the impression that\nthe only access to a work is through deep learning and years of\nstudy. Such study is clearly important for scholars, but this kind\nof scholarship is not the only way, or even necessarily the best\nway, for most people to approach literature. Instead it makes\nthe literature seem inaccessible. It makes the literature seem\nlike the province of scholars. “Oh, you have to be smart to read\nthat,” as though Shakespeare or Dickens or Woolf wrote only\nfor English teachers, not for general readers.\nWhat is Literature?\nIn short, literature evokes imaginative worlds through the\nconscious arrangement of words that tell a story. These stories\nare told through different genres, or types of literature, like\nnovels, short stories, poetry, drama, and the essay. Each genre\nis associated with certain conventions. In this course, we will\nstudy poetry, short fiction, and drama (in the form of movies).\nSome Misconceptions about Literature\nOf course, there are a number of misconceptions about\nliterature that have to be gotten out of the way before anyone\ncan enjoy it. One misconception is that literature is full\nof hidden meanings. There are certainly occasional works\nthat contain hidden meanings. The biblical book of Revelation,\nfor example, was written in a kind of code, using images that 3\nhad specific meanings for its early audience but that we can\nonly recover with a great deal of difficulty. Most literary works,\nhowever, are not at all like that. Perhaps an analogy will\nillustrate this point. When I take my car to my mechanic\nbecause something is not working properly, he opens the hood\nand we both stand there looking at the engine. But after we\nhave looked for a few minutes, he is likely to have seen what\nthe problem is, while I could look for hours and never see it. We\nare looking at the same thing. The problem is not hidden, nor\nis it in some secret code. It is right there in the open, accessible\nto anyone who knows how to “read” it, which my mechanic\ndoes and I do not. He has been taught how to “read” automobile\nengines and he has practiced “reading” them. He is a good\n“close reader,” which is why I continue to take my car to him.\nThe same thing is true for readers of literature. Generally\nauthors want to communicate with their readers, so they are\nnot likely to hide or disguise what they are saying, but reading\nliterature also requires some training and some practice. Good\nwriters use language very carefully, and readers must learn\nhow to be sensitive to that language, just as the mechanic\nmust learn to be sensitive to the appearances and sounds of\nthe engine. Everything that the writer wants to say, and much\nthat the writer may not be aware of, is there in the words. We\nsimply have to learn how to read them.\nAnother popular misconception is that a literary work has\na single “meaning” (and that only English teachers know\nhow to find that meaning). There is an easy way to dispel this\nmisconception. Just go to a college library and find the section\nthat holds books on Shakespeare. Choose one play, Hamlet, for\nexample, and see how many books there are about it, all by\nscholars who are educated, perceptive readers. Can it be the\ncase that one of these books is correct and all the others are 4\nmistaken? And if the correct one has already been written, why\nwould anyone need to write another book about the play? The\nanswer is this:\nKey Takeaways\nThere is no single correct way to read any piece of\nliterature.\nAgain, let me use an analogy to illustrate this point. Suppose\nthat everyone at a meeting were asked to describe a person\nwho was standing in the middle of the room. Imagine how\nmany different descriptions there would be, depending on\nwhere the viewer sat in relation to the person. For example, an\noptometrist in the crowd might focus on the person’s glasses; a\nhair stylist might focus on the person’s haircut; someone who\nsells clothing might focus on the style of dress; a podiatrist\nmight focus on the person’s feet. Would any of these\ndescriptions be incorrect? Not necessarily, but they would be\ndetermined by the viewers’ perspectives. They might also be\ndetermined by such factors as the viewers’ ages, genders, or\nability to move around the person being viewed, or by their\nprevious acquaintance with the subject. So whose descriptions\nwould be correct? Conceivably all of them, and if we put all\nof these correct descriptions together, we would be closer to\nhaving a full description of the person.\nKey Takeaways 5\nThis is most emphatically NOT to say, however, that\nall descriptions are correct simply because each\nperson is entitled to his or her opinion\nIf the podiatrist is of the opinion that the person is five feet,\nnine inches tall, the podiatrist could be mistaken. And even if\nthe podiatrist actually measures the person, the measurement\ncould be mistaken. Everyone who describes this person,\ntherefore, must offer not only an opinion but also a basis for\nthat opinion. “My feeling is that this person is a teacher” is not\nenough. “My feeling is that this person is a teacher because\nthe person’s clothing is covered with chalk dust and because\nthe person is carrying a stack of papers that look like they\nneed grading” is far better, though even that statement might\nbe mistaken.\nSo it is with literature. As we read, as we try to understand\nand interpret, we must deal with the text that is in front\nof us; but we must also recognize (1) that language is slippery\nand (2) that each of us individually deals with it from a different\nset of perspectives. Not all of these perspectives are necessarily\nlegitimate, and it is always possible that we might misread\nor misinterpret what we see. Furthermore, it is possible that\ncontradictory readings of a single work will both be legitimate,\nbecause literary works can be as complex and multi-faceted as\nhuman beings. It is vital, therefore, that in reading literature\nwe abandon both the idea that any individual’s reading of\na work is the “correct” one and the idea that there is one\nsimple way to read any work. Our interpretations may, and\nprobably should, change according to the way we approach the\nwork. If we read The Chronicles of Narnia as teenagers, then 6\nin middle age, and then in old age, we might be said to have\nread three different books. Thus, multiple interpretations, even\ncontradictory interpretations, can work together to give us a\nfuller and possibly more interesting understanding of a work.\nWhy Reading Literature is Important\nKey Takeaways\nReading literature can teach us new ways to read, think,\nimagine, feel, and make sense of our own experiences.\nLiterature forces readers to confront the complexities of\nthe world, to confront what it means to be a human being\nin this difficult and uncertain world, to confront other\npeople who may be unlike them, and ultimately to\nconfront themselves.\nThe relationship between the reader and the world of a work\nof literature is complex and fascinating. Frequently when we\nread a work, we become so involved in it that we may feel that\nwe have become part of it. “I was really into that movie,” we\nmight say, and in one sense that statement can be accurate.\nBut in another sense it is clearly inaccurate, for actually we do\nnot enter the movie or the story as IT enters US; the words\nenter our eyes in the form of squiggles on a page which are\ntransformed into words, sentences, paragraphs, and\nmeaningful concepts in our brains, in our imaginations, where\nscenes and characters are given “a local habitation and a name.”\nThus, when we “get into” a book, we are actually “getting into”\nour own mental conceptions that have been produced by the 7\nbook, which, incidentally, explains why so often readers are\ndissatisfied with cinematic or television adaptations of literary\nworks.\nIn fact, though it may seem a trite thing to say, writers are\nclose observers of the world who are capable of communicating\ntheir visions, and the more perspectives we have to draw on,\nthe better able we should be to make sense of our lives. In\nthese terms, it makes no difference whether we are reading\na Homeric epic poem like The Odyssey, a twelfth-century\nJapanese novel like The Tale of Genji, or a Victorian novel by\nDickens, or even, in a sense, watching someone’s TikTok video\n(a video or movie is also a kind of text that can be “read”\nor analyzed for multiple meanings). The more different\nperspectives we get, the better. And it must be emphasized that\nwe read such works not only to be well-rounded (whatever that\nmeans) or to be “educated” or for antiquarian interest. We read\nthem because they have something to do with us, with our\nlives. Whatever culture produced them, whatever the gender\nor race or religion of their authors, they relate to us as human\nbeings; and all of us can use as many insights into being human\nas we can get. Reading is itself a kind of experience, and while\nwe may not have the time or the opportunity or or physical\npossibility to experience certain things in the world, we can\nexperience them through reading. So literature allows us to\nbroaden our experiences.\nReading also forces us to focus our thoughts. The world\naround us is so full of stimuli that we are easily distracted.\nUnless we are involved in a crisis that demands our full\nattention, we flit from subject to subject. But when we read a\nbook, even a book that has a large number of characters and\ncovers many years, the story and the writing help us to focus,\nto think about what they show us in a concentrated manner. 8\nWhen I hold a book, I often feel that I have in my hand another\nworld that I can enter and that will help me to understand the\neveryday world that I inhabit.\nLiterature invites us to meet interesting characters and to\nvisit interesting places, to use our imagination and to think\nabout things that might otherwise escape our notice, to see the\nworld from perspectives that we would otherwise not have.\nWatch this video for a discussion of why reading fiction\nmatters.\nOne or more interactive elements has been\nexcluded from this version of the text. You can\nview them online here:\nhttps:\/\/pressbooks.uwf.edu\/fairytalelit\/?p=4#oembed-1\nHow to Read Literature: The Basics\nExercises\n1. Read with a pen in hand! Yes, even if you’re\nreading an electronic text, in which case you\nmay want to open a new document in which\nyou can take notes. Jot down questions,\nhighlight things you find significant, mark\nconfusing passages, look up unfamiliar words\/\nreferences, and record first impressions. 9\n2. Think critically to form a response. Here are\nsome things to be aware of and look for in\nthe story that may help you form an idea of\nmeaning.\n• Repetitions. You probably know from\nwatching movies that if something is repeated,\nthat means something. Stories are similar—if\nsomething occurs more than once, the story is\ncalling attention to it, so notice it and consider\nwhy it is repeated. The repeated element can\nbe a word or a phrase, an action, even a piece\nof clothing or gear.\n• Not Quite Right: If something that happens\nthat seems Not Quite Right to you, that may\nalso have some particular meaning. So, for\nexample, if a violent act is committed against\nsomeone who’s done nothing wrong, that is\nunusual, unexpected, that is, Not Quite Right.\nAnd therefore, that act means something.\n• Address your own biases and compare your\nown experiences with those expressed in the\npiece.\n• Test your positions and thoughts about the\npiece with what others think (we’ll do some of\nthis in class discussions).\nWhile you will have your own individual connection to a piece\nbased on your life experiences, interpreting literature is not a 10\nwilly-nilly process. Each piece of writing has purpose, usually\nmore than one purpose–you, as the reader, are meant to\nuncover purpose in the text. As the speaker notes in the video\nyou watched about how to read literature, you, as a reader, also\nhave a role to play. Sometimes you may see something in the\ntext that speaks to you; whether or not the author intended that\npiece to be there, it still matters to you.\nExamples\nFor example, I’ve had a student who had life experiences\nthat she was reminded of when reading “Chonguita, the\nMonkey Bride” and another student whose experience\nwas mirrored in part of “The Frog King or Iron Heinrich.”\nI encourage you to honor these perceptions if they occur\nto you and possibly even to use them in your writing\nassignments. I can suggest ways to do this if you’re\ninterested.\nBut remember that when we write about literature, our\nobservations must also be supported by the text itself. Make\nsure you aren’t reading into the text something that isn’t there.\nValue the text for what is and appreciate the experience it\nprovides, all while you attempt to create a connection with\nyour experiences.\nAttributions:\n• Content written by Dr. Karen Palmer and licensed CC\nBY NC SA.\n• Content adapted from Literature, the Humanities, and 11\nHumanity by Theodore L. Steinberg and licensed under\na Creative Commons Attribution-NonCommercial-\nShareAlike 4.0 International License.\nLICENSE\nThe Worry Free Writer by Dr. Karen Palmer is licensed under\na Creative Commons Attribution-NonCommercial-ShareAlike\n4.0 International License, except where otherwise noted. Intro to Literature: Fairy Tales and Folk Tales 12\nPART I\nReading and\nUnderstanding Fairy\nTales and Folk Tales\n12 13\nChapter 1: Why\n1.\nStudy Literature?\nWhy Fairy Tales\nand Folk Tales?\nWHY focus on fairy takes and folk tales?\nThe widely respected writer C. S. Lewis (author of The Narnia\nChronicles), gives us a clue:\nKey Takeaways\n“Someday you will be old enough to start reading\nfairy tales again.\nAre you old enough yet? We’re going to find out in this course.\n13 Intro to Literature: Fairy Tales and Folk Tales 14\nBut, FIRST\nWe need a common language to discuss literature as a\ndiscipline. So before you read any farther, watch the following\nthree videos:\nOne or more interactive elements has been\nexcluded from this version of the text. You can\nview them online here:\nhttps:\/\/pressbooks.uwf.edu\/fairytalelit\/?p=5#oembed-1\nSource: “How and Why We Read.” YouTube, uploaded by Crash\nCourse in English Literature, 15 Nov. 2012, www.youtube.com\/\nwatch?v=MSYw502dJNY&t=14s.\nOne or more interactive elements has been\nexcluded from this version of the text. You can\nview them online here:\nhttps:\/\/pressbooks.uwf.edu\/fairytalelit\/?p=5#oembed-2\nSource: “Fiction-Writing: Understand Elements of Story.”\nYouTube, uploaded by Executive Function, ADHD, 2e. Seth\nPerler, 11 Oct. 2015, youtu.be\/TX07–4bybE. 15\nOne or more interactive elements has been\nexcluded from this version of the text. You can\nview them online here: https:\/\/pressbooks.uwf.edu\/\nfairytalelit\/?p=5#oembed-3\nSource: “Writer’s Toolkit: Audience and Purpose.” YouTube,\nuploaded by Executive Function, ADHD, 2e. Seth Perler, 18 Oct.\n2015, youtu.be\/O9by2yFy4do.\nThe information in these videos may be review for some of\nyou, but reminders are helpful. In any case, there’s nothing\nmysterious here, just some terms we can use to be precise in\nour discussions and writings.\nThe first video features an English teacher and his views,\nbut the other two videos are created and presented by a writer\nof literature. See if you think it makes for a different\nexperience—when you’re getting this info from someone who\nwrites actual stories himself. And remember that when I say\n“literature,” I mean pretty much any fiction, and even non-\nfiction.\nSo just to review and add some highlights:\n• Plot\n• Setting\n• Character\n• Point of View\n• Motifs\n• Theme Intro to Literature: Fairy Tales and Folk Tales 16\nPLOT:\nPlot is simply what happens in the text. “Text” by the way can\nmean anything we can discuss in language—a story, a poem, a\nnovel, a graphic novel, a song, a movie, even visual arts.\nPlot is important because things in the text happen for a\nreason—the text’s reasons, which contribute to meaning.\nSETTING:\nWHERE and WHEN the whole thing happens—could be a\nplace, a time period, a season, even in some cases a\n“feeling”—dark\/light, pleasant\/threatening\/confusing—we find\nthis sense of setting mainly in visual texts such as graphic\nnovels and movies. And setting can change, as it does in\n“Beauty and the Beast” from Beauty’s home to the Beast’s\npalace.\nSetting, too, has meaning\nCan suggest certain feelings in the characters\nor even Create feelings in characters or in the reader.\nCHARACTER:\nThe people or other creatures who populate the story. What\nthey say (DIALOGUE) and what they do: all of it has meaning.\nThese are NOT supposed to be real people just going about\ntheir lives. They do and say and think certain things not for\ntheir own reasons, like real people do, but for the story’s\nreasons. It might help you to think of the story itself as an\nentity in its own right—a BEING. The story has a life of its own,\nand the story’s goals are 17\n• To tell you an interesting tale\n• To leave you feeling and thinking in certain\nways. NOT the author, The story ITSELF. Again,\nThink of the story as having a life of its\nown—which it does!\n• And the STORY wants to push you\naround—again to make you feel and think\ncertain things, maybe even in a sneaky way,\nso you don’t even notice that the story is\nimplanting its own choice of thoughts and\nfeelings into you.\nFor example, the Beast says to Beauty, “my heart is good, but\nstill I am a monster.” Of course, this shows us what the Beast\nthinks of himself, but his use of the term “monster” ALSO\nmight cause you, the reader, to think about monsters in general.\nIS the beast the monster? What does it MEAN to think of him\nas a monster? Or to think of him as NOT a monster—is there a\nway to do that?\nWhat in this story is or is not monstrous—ARE there other\nkinds of monsters than the Beast? More on that later.\nPOINT OF VIEW:\nWho’s telling this story? Is it one of the characters (first\nperson), or an omniscient narrator (usually third-person), or is\nthe story being told in what sounds like third person, but only\ngiving you the viewpoint of one of the characters (third person,\ncentral intelligence)? Intro to Literature: Fairy Tales and Folk Tales 18\nMOTIF:\nMotif is somewhat like a pattern in that it is found when\ncertain elements are repeated in the text, such as objects (a ring,\na flower, a sword), phrases (such as “Rapunzel, Rapunzel, let\ndown your hair”), or even descriptions or actions (repeatedly\ncalling someone “beautiful,” playing tricks, refusing requests,\nmaking friends). Repeated elements mean something and\ntherefore they are often related to THEME.\nAs you read, watch for motifs in the text. You are meant to\nnotice them and to think about what they are doing to make\nmeaning in the story.\nTHEME:\nThere are other important elements of narrative, such as tone,\nfigurative language, and others—we’ll discuss these as they\ncome up in the texts we’re reading. The IMPORTANT thing to\nremember about all these elements is that they ALL contribute\nto THE MAIN EVENT: THEME.\nTHEME refers to subtext or meaning. A story is not told\nONLY for its own sake. Of course the writer or the storyteller\nwants to create an interesting story, But the storyteller, as\nSeth Perler says, has their own PURPOSE. And that purpose is\nrelated to THEME—the MEANING the storyteller intends.\nBUT also, there are ALWAYS underlying MEANINGS,\nwhether the writer intends them or not. So, in some ways, we’ll\nthink about what the storyteller is up to,\nBUT we’ll also go beyond that purpose to consider what\nthe STORY ITSELF tells us, regardless of what the storyteller\nmight have had in mind.\nNotice that when I say “Meanings,” it’s plural. Because any 19\ngiven story will have multiple meanings or multiple THEMES.\nSo when we discuss meaning in this class, I’ll try to alert you to\nat least a few possibilities—AND THERE MAY BE MORE.\nNot that the text can mean anything, but that it can mean\nvarious things. And I don’t insist that you agree with my ideas\nof meaning.\nBut if you want to argue an alternative meaning, you must\nSUPPORT it.\nHow do you support your idea of a meaning? With\nTEXTUAL EVIDENCE—which is where those elements of\nnarrative come in. How does the plot support the meaning\nyou’re arguing?\nHow about the setting, character, point of view, tone, and\nother elements? The ways in which characters behave, where\nthey are, how they speak, even what they wear! It is all there to\ncreate meanings.\nAlso, as noted in the Introduction, remember the following:\nBe alert to repetitions and anything that seems not quite\nright. Consider how your own experiences and biases are\nplaying a part in how you read. And be prepared to discuss\nyour responses with your classmates.\nSecond\nOur reading focus: CULTURAL EXPECTATION\nThis is not an element of the text but a name for what we will\nbe looking for in the stories we read.\nWhat is culture?\nWhat is an expectation?\nSo, what then is a cultural expectation? Intro to Literature: Fairy Tales and Folk Tales 20\nKey Takeaways\nCultural expectations are simply the things that our\nculture expects us to do. In some cases, we can take that\na step farther and call these cultural imperatives–things\nthat our culture virtually demands that we do.\nFor example, you’re in college now. Is getting an education\nsomething our culture expects us to do? The general culture\nof our nation expects, even demands, that we all get basic\nschooling through high school. Then, what we might call the\nmicro-culture of your community and family may expect you\nto continue that education by going to college or to a\nprofessional trade school. That is, you are expected to learn\nenough to move out on your own and support yourself. That’s\nwhat both the macro- and the micro-cultures want you to do.\nWhat other things does our culture expect us to do?\nExamples\nGot to college? Go to a trade school?\nMilitary service maybe?\nGet a job and earn a living?\nGet married? Have children? Provide for those children’s\neducation?\nCare for our parents when they grow old and can’t care\nfor themselves? 21\nThese are just a few examples. We’ll find more as we get deeper\ninto our study of the tales.\nFairy tales and folk tales are uniquely created and positioned\nto begin teaching you these expectations–and how important\nthey are. You begin hearing stories from the time when you\nbegin to understand language. First storeis are told or read to\nyou, and then you begin reading some yourself. Maybe your\nfamily takes you to see children’s movies or plays that based\non fairy tales. Maybe you and your siblings or friends imagine\nyourselves as part of these tales. Maybe you become more\ndeeply interested in a particular tale.\nAll this exposure to stories means that you are absorbing\nthem and therefore absorbing the values they illustrate. They\nare teaching you those values–they they exist, that they\nare important, that you must learn them and honor them and\nabide by them. These values suggest cultural expectations.\n(And, looking ahead, these expectations may play a part in the\nTHEMES you argue in your essays about these tales.)\nExamples\n• Young men are expected to be… or to do….\nYoung women are expected to be…. or to do….\n• A monster\/beast\/wild animal is a creature\nwho… (looks a certain way, behaves in certain\nways, says certain things)\n• A princess must… A prince must…\n• Wives must…. Husbands must… Married\ncouples must…. Intro to Literature: Fairy Tales and Folk Tales 22\n• Beauty means… Ugly means…\nFairy tales and folk tales tell stories to teach these expectations\nand imperatives. These are what we will be looking for, in\nvarious ways, in the stories we study throughout this semester.\n“Beauty and the Beast”\nThis story is our first example of the principles explained above.\nOur task is to try to figure out what the story might MEAN in\nterms of cultural expectations, that is, what cultural demands\nmight this story attempt to teach us through the experience of\na beautiful young woman and a prospective bridegroom who is\na Beast, a kind of monster?\nThe ultimate event in this story is marriage, right? Think\nabout what marriage brings with it that might cause\nuncertainty or discomfort.\nExamples\n• Arranged marriages would have been\ncommon in the time when this story was first\ntold. Even now, marriage may be or feel forced\nin various ways. 23\n• What about sex? Some people are\ninexperienced in that sense when they get\nmarried. So it may be a scary thing to face. In\nfact, it used to be that the word MARRIAGE\nwas a euphemism for “when you start having\nsex”—that certainly would’ve been the case\nwhen this story was first told.\n• What about all the other things that are going\nto happen AFTER the wedding?\nThe point here is that a story involving a bride and groom has\nSOMETHING to do with marriage, and we owe it to the story\nto consider what that something might be.\nAlso, MARRIAGE is the TRANSFER of love\/devotion from\nthe father\/family to the new husband\/new family.\nThis transfer—in Beauty and the Beast—is significant in that\nthere is no mother in this story—nobody to teach the daughter\nabout men and marriage.\nSo maybe an important point is the transfer of the woman\nfrom one man to the other—and even though it’s the law of the\nculture (of many cultures—most cultures), it can be frightening\nand difficult for the young woman. What does Beauty’s\nbehavior suggest about this kind of transfer?\nBy the way, even TODAY, in our own culture, this idea of the\ntransfer of the woman from father to husband is still upheld.\nHow? Think about the typical marriage ceremony today: Who\nis “given away”? Still today? Intro to Literature: Fairy Tales and Folk Tales 24\n“Who gives this woman to be married to this man?”\nIs it possible that this is one meaning, and one reason the story\nof “Beauty and the Beast” remains popular?\nIf you’re a young woman who’s marrying a man you hardly\nknow, if at all, could he seem scary to you? What else is scary?\nMonsters? Beasts?\nWouldn’t it be great if you could somehow be assured that\nthe scary guy would turn out to be a wonderful husband? A\nprince even? Might your mother or your grandmother tell you\nstories like that to calm your fear of the unknown groom?\nAnother thing this story can teach us is to look beyond the\nmain characters, and to think about what’s happening at the\nmargins of the story.\nSo, here are some further questions to consider:\nThe sisters—in addition to the idea of marriage, what about\nthat whole sibling rivalry? What’s going on there, with two\nwomen hating and even conspiring against their sister? Do\nthey have their reasons? Are they valid? What might that\nmean?\nAnd what about what the beautiful fairy does to the sisters\nat the end of the story? What meaning might that have?\nOf course, the story is showing us that evil works are\npunished. But that’s fairly obvious—what ELSE might be\ngoing on here? 25\nChapter 2: The\n2.\nAnimal Husband\n“Beauty and the Beast”\n“The Frog King or Iron Heinrich”\n“The Tiger’s Bride”\nNote: These links will take you to the versions of the stories\nin this e-book or, in one case, a link to the library’s course\nreserve version. You must read these versions. If you read\nother versions, some of the lecture and discussion may not\nmake sense to you as there can be great differences among\ndifferent storytellers’ versions of these tales.\nWe begin with stories often known as Animal Groom stories.\nThey are well-known, found in most cultures around the world,\nand they clearly illustrate the function of fairy tales within\ncultures.\nRemember we’re talking about culture, not society. Here’s an\n25 Intro to Literature: Fairy Tales and Folk Tales 26\nextended definition of the difference, which may be important\nin writing your essays.\n“Culture” vs. “Society”\nWhat might it mean to a culture to tell a story in which\nthe bridegroom is an animal? Many fairy tales are based on a\ngroom, or potential groom, who is some kind of animal: lion,\nfrog, or other animal, even sometimes a non-specific animal,\nwho is called simply “the Beast.” These kinds of stories are\nfound in many cultures around the world, so there must be\nreasons why they are so popular. Let’s try to tease out some of\nthose reasons by looking closely at the story, keeping in mind\nthat fairy tales were designed to teach people, especially young\npeople, to know and conform to the expectations and demands\nof their culture.\nBut let’s consider a more basic question before that: Do\nyou think that’s a good thing or a bad thing—that fairy tales\nteach us to be compliant cultural subjects, to show us what our\nculture wants of us and teach us to do those things?\n“Beauty and the Beast”\nLet’s think of this story in terms of cultural expectations.\nThe ultimate event in this story is marriage, right? For a very\nlong time, people have been pairing off and getting married.\nSo is getting married a cultural expectation? Does our culture\nwant us to be married? How do we know, one way or the\nother?\nThere are other ways to approach Animal Groom tales, but a 27\nstory involving a bride and groom has something to do with\nmarriage, and we owe it to the story and to ourselves as readers\nand creatures of our culture, that is, cultural objects, to attempt\nto understand what that something might be.\nConsider some of what marriage brings with it:\n• Sometimes choice, sometimes not. Arranged\nmarriages would have been common in the time\nwhen many fairy tales were first told.\n• What about all the other things that are going to\nhappen after the wedding? Can those be a cause for\nuncertainty?\n• What about sex? Some people are inexperienced in\nthat sense when they get married. So it may be a\nscary thing to face. In fact, it used to be that the\nword “marriage” itself was a euphemism for “when\nyou start having sex”—that certainly would’ve been\nthe case when these stories were first told.\nTraditional marriage is the TRANSFER of the daughter’s\nlove\/devotion from the father\/family to the new husband\/new\nfamily, because traditionally, the bride went to live near or even\nwith her husband’s family (not the other way around). So, she\nbecame a member of the groom’s family and community.\nSo maybe an important point in Animal Groom stories is this\ntransfer of the woman from one man to the other, and that\neven though it’s the law of the culture (of many cultures—most\ncultures), it can be frightening and difficult for the young\nwoman. What does Beauty’s behavior suggest about that?\nBy the way, even today, in our own culture, this idea of the Intro to Literature: Fairy Tales and Folk Tales 28\ntransfer of the woman from father to husband is still upheld.\nHow? Think about the typical marriage ceremony today: Who\nis “given away”? Still today. Is it possible that this is ONE\nmeaning, and ONE reason the story of “Beauty and the Beast”\nremains popular?\nWe learn about the problems of this transfer in “Beauty and\nthe Beast.”\nCould it be scary? Could it be something the bride (and the\ngroom—Animal Grooms in the next module) might resist?\nAnd yet, we’re supposed to get married, even though it may\nnot always seem appealing.\nIf you’re a young woman who’s marrying a man you hardly\nknow, if at all.\nIf by chance your mother is no longer here, so there’s no\nparental wisdom to tap into about dealing with fears of your\nmarriage and your intended groom.\nCould this unknown and unknowable groom seem scary to\nyou? What else is scary? Monsters? Beasts?\nWouldn’t it be great if you could somehow be assured that\nthe scary guy would turn out to be a wonderful husband?\nA prince even? Might your parents or your grandparents, or\neven aunts and uncles, tell you stories to calm your fear of the\nunknown groom, to help you feel not just unafraid but actually\neager to get married?\nAnother thing this story can teach us is to look beyond the\nmain characters, and to think about what’s happening at the\nmargins of the story.\nSo…\nThe SISTERS: In addition to the idea of marriage, what about 29\nthat whole sibling rivalry? What’s going on there, with two\nwomen hating and even conspiring against their sister? Do\nthey have their reasons? Are they valid? What might that\nmean? Aren’t the sisters also cultural objects who are supposed\nto get married? They do get married, so what’s the problem?\nAnd what about what the beautiful fairy does to the sisters\nat the end of the story? What meaning might that have? Of\ncourse, the story is showing us that evil works are punished.\nBut that’s fairly obvious—what ELSE might be going on here?\nFinally, consider the concept of beastliness, of monstrosity.\nIs the Beast a monster?\nIf so, how?\nIf not, how?\nMight the answer be, somehow, “yes and no”?\nThis, then, may be one of those Not Quite Right situations.\nThat is, if it is problematic to read the Beast as a monster, why?\nAnd why, then, is the Beast called a monster? Why does the\nconcept of monstrosity appear in the story?\nThis is a case of irony. Look up that word if you don’t know\nwhat it means.\nIf the Beast is at least problematic as a monster—that is, it’s\nquestionable that he is a monster—then what is the function of\nmonstrosity in the story? That is, if some characters SEE him\nas a monster, and yet he actually is not very monstrous, what\nis the point of this irony?\nFor the reader to recognize that it is problematic to identify\nthe Beast as a monster?\nTo question the meaning of monstrosity?\nTo suggest that there are other monstrosities in the story\nand, therefore, in life? Intro to Literature: Fairy Tales and Folk Tales 30\nThat is, if the Beast isn’t much of a monster, is there someone\nor something else in the story that is a monster, and maybe one\ngoal of the story is to teach something about what constitutes\na monster and what does not?\nComing back to our study of fairy tales as texts that teach\ncultural expectations, what expectations does this story seem\nto honor and illustrate for the reader? Is the story’s irony\nrelated to these expectations?\nImagine yourself as a young person who’s about to be\nmarried to someone you did not choose for yourself—an\narranged or forced marriage to a partner chosen by your family\nor your community or someone else. How would you feel about\nthat? Might it help if you’d been hearing stories all about your\nlife about how wonderful such marriages could turn out to\nbe? That the scary stranger could become a handsome prince?\nAnd, by the way, that the people who’d been mean to you and\nunflattering to your groom would get what they had coming to\nthem?\n“The Frog King or Iron Heinrich” and “The Tiger’s\nBride”\nThese texts will be covered in class according to the ideas\ndiscussed in this chapter.\nLICENSE\nThe comparison between culture and society is from\nLibreTexts Social Sciences, Chapter 3.1B: Culture and Society,\nwhich is shared under a CC BY-SA license and was authored, 31\nremixed, and\/or curated by LibreTexts. This text is licensed\nunder a Creative Commons Attribution-NonCommercial-\nShareAlike 4.0 International License, except where otherwise\nnoted. Intro to Literature: Fairy Tales and Folk Tales 32\nChapter 3 The\n3.\nAnimal Wife\n“The Fisher Boy Urashima”\n“Chonguita the Monkey Bride”\n“The Swan Maiden”\nNote: These links will take you to the versions of the stories\nin this e-book. You must read these versions. If you read\nother versions, some of the lecture and discussion may not\nmake sense to you as there can be great differences among\ndifferent storytellers’ versions of these tales.\nThe purpose of this chapter is to study tales of Animal\nBrides, with some comparison and contrast to Animal Groom\ntales. You may be less familiar with Animal Bride tales, though\nthey are found throughout the world in one form or another,\nmuch like the tales of Animal Grooms. We will use similar\ntechniques to study Animal Bride fairy tales: their meanings,\n32 33\nwhat they are attempting to teach, what might be problematic\nabout those teachings, and what those meanings say about our\nculture or the cultures from which the tales came.\nReminder about our general process\nFirst: Do the reading and write your Journal Entry, which\nis due before the lecture.\nSecond—Listen to my lecture.\nThird—Be prepared to contribute to Book Club Discussion\n(BCD) and Book Club Response (BCR).\nRemember that the main goal of this work is meant to give\nyou a start on ideas for the CRP.\nFourth—Using feedback from your Journal Entry and BCR,\nwrite and submit your CRP.\nThe Animal Bride Stories\nWe’ve already discussed possible themes of stories that present\nus with an Animal Groom. Now, we’re going to consider what\nit might mean to tell a story in which the bride is an animal.\nOf course, we can’t resist—nor should we resist—the urge to\ncompare and contrast Animal Brides with Animal Grooms. One\nvery basic question involves the form of the Animal Spouse.\nIn many Animal Groom tales, the groom isn’t just an animal,\nbut he’s also a Beast. He’s large, scary, maybe ugly, maybe\neven disgusting. Does that form extend to the Animal Bride?\nCan Turtle, Chonguita, or the Swan Maiden be described as\nmonstrous in any ways? Are the Animal Brides different in\nthis way? At least judging by our three tales, aren’t they more Intro to Literature: Fairy Tales and Folk Tales 34\nlikely to be especially attractive, like the Swan Maiden and\nTurtle after she turns into a woman? Chonguita, though she\nisn’t described as beautiful at first, is especially skilled in the\narts a woman is supposed to be good at, such as artwork and\nneedlework. Her appearance is another matter, of course, and\nwe’ll discuss that.\nBut the points before us now involve the differences between\nAnimal Grooms and Animal Brides:\nWhereas Animal Grooms are often especially beastlike and\ntherefore threatening,\nAnimal Brides are usually overtly alluring in appearance or\nsome other aspect of womanliness “womanly arts” (for example\nwhat were known as womanly arts, such as painting, drawing,\nand sewing). And these brides are not found in palatial homes,\nlike the Beast and the Tiger, but in nature.\nBased on those differences alone, we can already see some\ngeneral cultural concerns (possibly leading the way to various\nthemes) which constitute a near-paradox:\nThe Cultural Imperative to Marry\nVS.\nKey Takeaways\n• Warnings against Exogamy;\n• Warnings about women and nature:\n• The strong lure of nature paired with the\nstrong lure of women. 35\nKey Takeaways\nSo culture says, you must get married, but\n____________________________________?\n• Warnings against exogamy—marrying outside the\nclan\/tribe\/community,\n◦ which is dangerous to the man—can\nbecome an outcast, courting danger with\nsomeone from unknown culture and\ntraditions\n◦ and dangerous to the community, because\nit threatens the closed space and known\ncultural rules. Anarchy!\n• Warnings about women and nature—women in\nmany cultures have been thought of as closer to\nnature than men are, and therefore more removed\nfrom civilization or less adaptable to civilizing\ninfluences—again, dangerous to the community. In\nsome civilizations, this is an echo of the tale of\nAdam and Eve (which whatever you take the\nChristian Bible to be, is also a story).\nKey Takeaways Intro to Literature: Fairy Tales and Folk Tales 36\nThe main idea is that many people in many cultures have\nseen women as less civilized and less civilizable than men,\nin terms of learning to go along with cultural\nexpectations.\nThe point is not that everyone thinks this, but it has been a\ntheme among many cultures worldwide.\nIn Christian cultures, this attitude may spring from the story\nof Adam and Eve, Eve being the one who was open to the\nadvances of the Serpent and thus set in motion the events that\nwould lead to the expulsion from the garden.\nBut regardless of the origins of this attitude, it has been\npretty prevalent in human history, and we see this illustrated\nin Animal Bride stories.\nKey Takeaways\nThe LURE of NATURE for BOTH women AND men.\nThis concern admits that both men and women are open to\nthe lure of life beyond the confines and imperatives of culture,\nand both are therefore drawn to nature as a culture-free and\ntradition-free environment. (Of course, there’s no such thing as\nhumans living in a culture-free environment, because humans\nbring culture and tradition with them, wherever they are. But\nstill, many people believe it is possible to escape culture and\ntradition. But it’s not possible—don’t be fooled.)\nAnyway, one meaning is that men, too, are often seduced by\nnature, as represented by animal brides, and they must guard 37\nagainst this kind of seduction because it can be dangerous to\ntheir happiness, humanity.\nKey Takeaways\nThe cultural imperative to MARRY.\nMarriage: cultural imperative for both men and women,\nBut matter of survival for women, in many cultures.\nThat is, women have ALWAYS had jobs outside the home.\nBut it was complicated.\nFirst, because most jobs that were open to women wouldn’t\npay a living wage, so it could only serve as a supplement to a\nspouse’s salary.\nSecond, because upper-class women wouldn’t have had skills\nto get jobs, so they depended on either their family money or\na good marriage to survive. They could sometimes get work\nas live-in governesses, but those jobs were often fraught with\nvarious threats, and you could be fired at any moment for any\nreason. No unions!\nThird, lower-class women could get jobs, but they couldn’t\nearn enough money to live on—again, only a supplement to\nspouse’s earnings.\nFinally, even when the middle class started to appear,\nwomen’s wages were generally not enough to live on.\nCertainly, some cultures looked down on women working\noutside the home (and some still do disapprove of this). But the\nmore common issue was that women just couldn’t get jobs that\nthat would allow them to survive on their own, so again,\nMarriage was an existential requirement—we all have to Intro to Literature: Fairy Tales and Folk Tales 38\neat. Men are expected to marry also, but it was usually less\nof a survival issue. The figure of “the confirmed bachelor”\nis more culturally accepted than an unmarried woman, who\ntraditionally arouses more suspicion.\nSo the imperative to marry is powerful, and it is supported\nby tales of a man who needs to marry so much that he takes an\nanimal bride.\n(Interesting side note: in modern sociology, researchers have\nargued that marriage is one of two major maturing influences\non young men; the other is military service.)\nSo we have these two general concerns:\nKey Takeaways\n• The cultural imperative to marry, but\n• Warnings against exogamy and the dangerous\nlure of nature.\nLet’s look at each tale and see how they engage these concerns.\n“Urashima the Fisherman”\nThe man, Urashima, goes willingly to be married to Turtle.\nAnd although Turtle IS a figure of nature and does\nrepresent exogamy,\nTheir relationship is pretty egalitarian.\nIt is also companionate—they behave like companions: 39\n“Wandering every day among the beautiful trees with emerald\nleaves and ruby berries.” In some versions of the story, they\nalso talk everything over between them.\nThis is an old story, from a time when companionate\nmarriage wasn’t much of a thing, so the equality between\nTurtle and Urashima is exceptional. (Though maybe not so\nexceptional in Japanese culture of that time—you’d want to\nlook that up if you’re writing about this story.)\nAnd yet, Urashima is ultimately punished, isn’t he? Maybe\nsuggesting that companionate marriage is somehow\ndangerous?\nUrashima goes home to see his family but ends up sad,\nlonely, and finally dead because he does a human thing: he\nforgets—what does he forget? This is when the two worlds\nclash—his and Turtle’s.\nTurtle has warned him not to open the box\nBut he’s human so he forgets that warning\nSo does the story warn against the lure of Nature, as\nrepresented by Turtle?\nOr maybe against something else:\nKey Takeaways\nTurtle has something many young women in fairy tales\ndon’t have—agency! She’s not a passive object, but a\nsubject in her own right. And we want to say, Good for\nher! Don’t we?\nBut Urashima’s ultimate punishment comes from this\nwoman with her own agency, Intro to Literature: Fairy Tales and Folk Tales 40\nShe’s able to act on her own and to issue a command to\nher husband: Think of me, but Do Not Open!\nDoes Urashima’s death suggest that this is a bad thing,\nthis ability of Turtle to give him a command?\nSo here, the seduction and maybe even subjugation of the\nman by an Animal Bride—a creature of Nature—illustrates what\nabout men and women and how they are culturally expected to\ninteract with each other? With nature?\nShould a man accept a woman’s having her own agency?\nDemanding things of him?\nShould a man commune so closely with creatures of nature?\nWhat answer does the story suggest?\nAccording to the story, who should be the subject (with\nagency) and who should be the object?\nBut, doesn’t the couple seem happy when they are together\nin a marriage of equality and companionship?\nI’ll leave those questions for you to consider.\n“Chonguita, the Monkey Wife” and “The Swan Maiden” will\nbe covered in depth in class. Meanwhile, consider the brief\npreview of issues and questions noted below.\n“Chonguita, the Monkey Wife”\nKey Takeaways 41\n• Don Juan doesn’t want to marry Chonguita,\nbut he does anyway. Why?\n• What is Chonguita’s father’s role in the story?\nWhat does he represent?\n• What does it mean that Chonguita walks\nbeside her husband? What role has her mother\nplayed in this behavior of Chonguita’s?\n• Consider Chonguita’s performance in the\ntasks set by the king. What does her\nperformance suggest about exogamy?\n• In the final scene, what might be the meaning\nof the sudden change of lighting after Don\nJuan throws Chonguita against the wall? Does\nlight perhaps symbolize something about how\nwe see or perceive things?\n“The Swan Maiden”\nKey Takeaways\nDoes the story involve exogamy and the dangerous lure\nof nature?\nDoes it also suggest these problems are especially\nassociated with women? Why or why not? Intro to Literature: Fairy Tales and Folk Tales 42\nThe hunter kidnaps the swan maiden by stealing her\nfeathers, so it’s easy to say he gets what he deserves in the\nend. But remember that characters do what they do for the\nstory’s reasons. So if he feels the need to kidnap a Swan\nMaiden, what might that mean? What could be making\nhim feel that way?\nWhat might it mean that it’s the hunter’s mother who\nhelps him trap the Swan Maiden?\nMost of the story follows the hunter’s feelings and\nactions. Why do we learn so little about the Swan\nMaiden’s experience and feelings? What is the story\nsaying in this way?\nNotice how fast the story moves from the kidnapping\nto the couple “living lovingly and contentedly together.”\nWhat might that quick transition suggest regarding\ncultural demands or the Swan Maiden’s perspective?\nIn some versions of the story, the hunter and his Swan\nMaiden wife have children. But still, she leaves the family\nbehind as soon as she gets her feathers back. What does\nthe story seem to be teaching about women in this way?\nWhat different ways are there of reading this feature of\nthe story? 43\nChapter 4:\n4.\nSleeping Beauties\n“The Sleeping Beauty in the Wood”\n“Briar Rose”\nMaleficent (found in Canvas Module 4)\nNote: The two links will take you to the versions of the\nstories in this e-book. You must read these versions. If you\nread other versions, some of the lecture and discussion may\nnot make sense to you as there can be great differences\namong different storytellers’ versions of these tales.\nThe purpose of this module is to study the various ways in\nwhich a single fairy tale figure, Sleeping Beauty, along with her\nstory, has been imagined by different storytellers, and as with\nanimal grooms and animal brides, attempts to instill in readers\nthe demands that their culture seeks to impose on them.\nWe’ll use similar techniques to those in previous modules to\n43 Intro to Literature: Fairy Tales and Folk Tales 44\nanalyze our three Sleeping Beauty tales. However, instead of\ndiscussing each story distinctly, we’ll discuss them all together\nin terms of how they respond to the idea of a Sleeping Beauty,\ntheir meanings, what they are attempting to teach, what might\nbe problematic about those teachings, and what those\nmeanings say about the cultures from which the tales came and\nour culture too, since we still pay attention to these stories.\nRemember: Plot, Setting, Characters, Dialogue, and the\nmain event: Theme. As usual, theme is our goal—to understand\nthe various possible meanings.\nThough we’re no longer dealing with animal brides or animal\ngrooms, we are still considering beauty. Also beastliness still\nshows up in some ways, as in the earlier stories we’ve studied.\nRemember that we’re considering possible meanings that\nrelate to cultural expectations. So what might it mean to tell a\nstory in which the bride must sleep for 100 years and then be\nwaked up by a prince (who may or may not have to kiss her to\nwake her up)?\nWe begin with a close consideration of the title. This is\nsometimes a good place to start thinking about meaning.\nSo let’s mine this title a bit—dig into it to see how it gives us\na place to begin understanding.\n“Sleeping Beauty”\nThough the titles of the texts are different, each one features a\nSleeping Beauty character. Let’s consider the two terms of this\ntitle: 1. Sleeping and 2. Beauty.\nKey Takeaways 45\n1. The princess is sleeping. That’s the first thing the story\ntells us about her, right there in the title. So we must pay\nattention to it.\nBut she doesn’t start off sleeping, does she?\n• She starts off being adventurous—HOW do we know\nthis?\n• Don’t we also see this in Maleficent, the movie?\nWhat does the toddler Aurora do that suggests an\nadventurous nature?\nBut then, adventure and exploration give way to what? Now,\nshe can only do what?\nIn this way, the story dramatizes the before-puberty and\nafter-puberty life of girls.\n(Is it possible that this is what the blood is about? The\nblood spilled when Beauty pricks her finger on the spindle:\npossibly illustrating the onset of puberty, when activity (and\nhormones) begin to change?\nThis transformation signals a change in the lives of girls:\nBeauty is active and adventurous before this change, but she is\npassive afterwards, as girls were expected to behave.\nConsider how you feel about this way of thinking of young\nwomen as moving into a passive phase of life. If you’re a young\nwoman, do you feel passive? If you’re a young man, do you\nsee young women as passive? If you have a different gender\nidentity, what does this reading of the story say to you?\nHowever you respond to those questions, remember that\nthese stories are meant to dramatize how men and women are\nexpected to behave and to think of themselves:\n• Men: active\/forthcoming\/bestowing Intro to Literature: Fairy Tales and Folk Tales 46\n• Women: passive\/retiring\/receiving\n• Other gender or identity possibilities: Do these even\nappear in any of the Sleeping Beauty stories?\nBeauty does wake up, which suggests another transition. It\nmight seem like a transition from passive back to active. So\nwhat do we do with that? Again, let’s think about what the\nculture would be trying to teach.\nThat is, if the life she wakes up to is a life in which\n• she accepts the prince who’s just kissed\nher—without her permission!—\n• is that waking to an active or a passive life?\n◦ Does that bring us back to girls being\ntaught passivity?\n◦ Is there a subject\/object relationship here?\nKey Takeaways\n2. She is not just Sleeping, but Sleeping Beauty.\n• What does beauty, the word, mean—something that\npeople enjoy looking at.\n• Being looked at: active or passive?\n• Maybe inspiring others to certain thoughts or\nbehaviors,\n• But not necessarily doing anything in terms of\naction or even thought for itself\/herself. 47\nSo we’re back to the subject\/object concept:\nIf we have a story that that teaches young women that their\nrole is to just sit (or sleep) and wait, what is that story teaching\nthem to know themselves as: subjects or objects?\nOther Characters\nNotice how we’ve put a lot of pressure on the title, but again\nthat’s a valid way to begin thinking about meaning, about\ntheme. In this case, it’s already given us some insight into\nthe main character, the “Beauty.” Now, with this grounding in\nthe title and its meanings, we can begin to explore the other\ncharacters more closely.\nIn addition to the beautiful and active-then-passive young\nwoman, who else is there?\n• Prince’s Ogre Mother (in the Perrault tale “The\nSleeping Beauty in the Wood”)\n◦ Mother-in-law as Beast: Difficult\nrelationships between wives and their\nmothers-in-law.\n◦ What about grandmothers, and husbands\nin relation to their mothers?\n▪ Do grandmothers compete with\nparents for grandchildren’s\nattention?\n▪ Does a grandparent ever try to\ncontrol a grandchild’s time and\nlove?\n▪ What does an overbearing\nmother-in-law say about her son Intro to Literature: Fairy Tales and Folk Tales 48\nas a husband?\n▪ Will he or won’t he\ndefend his wife against\nhis mother?\n▪ Will he or won’t he\nalways be around to\nprotect his wife from\nthreats, like his beastly\nmother?\n◦ So one way of thinking about theme in the\nstory might involve how it illustrates\nbeastliness as a family issue.\n• The Prince: A prince is found in most versions of the\nstory. We’ve discussed the prince in relation to his\nmother and to Beauty, but what else can we notice\nabout the prince that relates to meaning?\n◦ What happens to the other princes—those\nwho are not meant for Beauty?\n◦ What does this suggest about cultural\ndemands on young men?\n◦ Has their culture planted a certain drive in\nthem? A drive to do what?\n◦ And is that good for the prince or\ndangerous? Or some of both?\n• Evil Fairy: This character doesn’t appear in every\nversion, but she’s a significant player in the Charles\nPerrault version.\n◦ Is she evil, or just vengeful?\n◦ At the very least, what does the king’s\ntreatment of the “extra” fairy teach us? 49\n◦ What does the Evil Fairy suggest about\nthreats to children? What kind of cultural\nmessage might there be in the inability or\nindifference of parents, for whatever\nreason, to teach their children the demands\nof their culture? Is there a cultural drive to\nteach these demands even beyond the\nability or even the wishes of parents?\n◦\n• Let’s consider beauty itself—not the character but\nthe quality of being beautiful. I’m including beauty\nas a character because it plays such an essential role\nin the stories. In life?\n◦ What’s the saying? Beauty is in the eye of\nwhat?\n◦ What does that mean? What I see as\nbeautiful may not be beautiful to you.\n◦ If that’s true, then what is it that\nconditions and controls our\nideas of beauty?\n◦ Something determines what we\nsee as beautiful or not\nbeautiful?\n◦ What is it?\nTo help us begin to answer those questions, consider the\nfollowing:\nExamples Intro to Literature: Fairy Tales and Folk Tales 50\nAs little as a hundred years ago, fat bodies were\nconsidered the most beautiful. Even in the United States,\nin the early 20th century, fat men were considered\nappealing and powerful—I mean really fat men. Some\nhistorians now call the period “the banquet years” because\nhuge meals were quite the thing among wealthy\npoliticians and leaders of industry. Another hundred years\nfrom now, who knows? We might have swung back to\nanother banquet period or something altogether different.\nKey Takeaways\nSo what causes these differences in our perception of\nwhat beauty is?\nIn class, we’ll consider this question in relation to the stories\nand to the movie Maleficent, and think about what arguable\nthemes might be created from this discussion. 51\nChapter 5:\n5.\nTricksters in Folk\nLore, Fairy Tales,\nand Graphic Tales\nTrickster Fairy Tales\nMomotaro, or the Story of the Son of a Peach\nLittle Red Cap [Little Red Riding Hood]\nLittle Red Riding Hood and the Wolf\nThe Three Little Pigs\nTrickster Folk Tales\nThe links will take you to websites that often include the story\nand some additional discussion about the trickster figures and\ntheir cultures, in Alaska, in West Africa, and in the American\nSouthwest. In each case, you are only required to read the story\n51 Intro to Literature: Fairy Tales and Folk Tales 52\nitself, though you may find it interesting to read the other\nmaterial as well.\nCoyote and the Golden Eagle : A Tlingit Legend\nRaven\nAnansi and the Box of Stories\nThe Ballad of Mulan\nThe Fox Woman\nGraphic Tricksters\nThe Sleeper and the Spindle, written by Neil Gaiman,\nillustrated by Chris Riddell. This is the illustrated book we will\nstudy. It is available in print from the UWF Bookstore, from\nvarious online booksellers, and possibly other sources as well.\nTrickster Figures in Literature\nWe’ve been studying fairy tales that attempt to teach how our\nculture wants us to think, to see the world, and to behave.\nBut trickster tales suggest other kinds of responses to\nculture.\n1. Characteristics of Tricksters\nVirtually every culture has some kind of trickster figure their\nstories, folklore and legends.\nLOKI: Norse legends have the trickster god Loki, as well as\nsome Raven figures.\nFAIRIES: In Celtic cultures, fairies, also known as\nbrownies, elves, selkies, pookas, or collectively as the Fae, and 53\nall of these can be mischievous and even dangerous as well as\ncute and clever and helpful.\nANANSI: In West Africa, the trickster is variously a man and\na spider called Anansi.\nIn the Americas, Anansi morphed into a female trickster\ncalled Aunt Nancy.\nCOYOTE: In the American southwest and Native American\ncultures.\nRAVEN: Among native Alaskans, the primary trickster is\nRaven.\nSo tricksters come in many forms and with varying traits\nBut there are some broad parameters by which we can know\nmost of them:\nUnderprivileged figures—tricksters are underprivileged by\nwealth or property or education or social position;\nBoundary crossers—tricksters exist at the MARGINS of\ncultures;\nShape shifters—tricksters may shape-shift literally or\nmetaphorically;\nRule breakers—tricksters often break rules in literal or\nmetaphorical ways.\n2. Functions of Tricksters\nFor a culture to really thrive, it cannot be all about obedience\nto expectations and imperatives. It has to change at some\npoint. Otherwise, it won’t last.\nWe see this in the basics of purity vs. hybridity in\npopulations. Intro to Literature: Fairy Tales and Folk Tales 54\nA culture that will not allow any outsiders or any difference\n(however that is defined)\nwill end up falling into ruin and dying out.\nIf for no other reason than inbreeding.\nBut when the outsider does find their way in, or exert some\ninfluence,\nThe culture experiences change, and that opens the door for\nprogress.\nAll change is NOT progress. But progress is change, by\ndefinition.\nSO if most fairy tales attempt to teach obedience to cultural\nexpectations,\nThen what do you imagine tricksters do with cultural\nexpectations?\nMost important: they ILLUSTRATE that defiance,\nresistance, and change ARE possible.\nThis kind of illustration of resistance is important not JUST\nas a model,\nBut also because just reading or hearing about it\nCan change the way you think.\nFor further information about this kind of change, review the\nfollowing video:\nOne or more interactive elements has been\nexcluded from this version of the text. You can\nview them online here:\nhttps:\/\/pressbooks.uwf.edu\/fairytalelit\/?p=292#oembed-1\nSo just reading or, in the case of folklore, hearing stories of\ntrickster defiance can encourage an audience (of readers, 55\nhearers of gossip, listeners around the campfire, any kind of\naudience) to sense the power of that defiance and the\npossibilities that might come out of it.\nOn the other hand, there is danger in defying expectations\n(exogamy, resisting marriage, resisting cultural ideas like\nbeauty and gendered roles).\nBut there is also power.\nFor example, fairy tales often teach us to avoid exogamy.\nThey illustrate the danger of breaking that rule, as happens\nin “The Swan Maiden” and “Urashima the Fisherman.”\nBut doesn’t one story show us the power of risking\nexogamy?\n* * *\nSo the Trickster challenges the power in cultural\nimperatives, and turns it on its head, which is the power and\nthe teaching of trickster behavior and attitude: that change can\nhappen if you’re willing to take some risks.\nWe will cover each trickster tale in depth in class. Be sure\nyou understand the principles discussed here, as they will apply\nto each of the tales in different ways. Intro to Literature: Fairy Tales and Folk Tales 56\nPART II\nWriting about Fairy\nTales and Folk Tales\n56 57\nWriting the\n6.\nCritical Response\nParagraph\nThe Critical Response Paragraph (CRP) is a short, one-\nparagraph mini-essay that requires you to write an argument\nabout one aspect of the assigned reading. Often, book club\ndiscussions will help generate ideas for these essays, but you\nmay also choose to write an individually generated response,\nwith my prior approval. CRPs are graded on a 100-point scale.\nIn the CRP, you state your idea of one of the story’s\nmeanings regarding real life (theme), and then you support that\nclaim with evidence from the text and analysis of the evidence.\nWriting the CRP will require that you think critically about the\ntexts we are reading and discussing in class.\nThe CRP must not simply summarize the text or\nevaluate whether or not you like the text. Instead, it must\nbe a 7- to 10-sentence persuasive argument about how you\ninterpret the text in the context of our class discussions about\n57 Intro to Literature: Fairy Tales and Folk Tales 58\nthe stories and cultural expectations. Because it is a short\nargument, obviously it will be a partial argument. That is, a\nCRP generally only has space to present one piece of evidence,\nsuch as a quotation or paraphrase and your analysis to show\nhow it supports your claim.\nThis work requires and helps you to think critically about\nthe texts you read, and it is meant to help you create a\nshort argument that can be expanded into a longer, more\ncomplex argument for the longer critical response essays\n(CREs), assigned later in the semester. So we do not work\non one CRP on one story and then kick it to the curb and move\non to something new right away. Instead, you will produce a\nnumber of CRPs from which you will choose two on which to\nbase your two CREs (one at mid-term and one near the end of\nthe semester).\nThe CRP has four required parts:\n1) An argumentative topic sentence, also called a CLAIM.\nYou may know this as a thesis statement. This claim must\nappear at or near the beginning of the paragraph.\n2) Evidence in the form of quotations or paraphrases from\nthe text about which you are writing, with the proper source\ninformation: author’s last name and page number, in\nparentheses. Because this is a short argument, I only expect you\nto work on one or two pieces of evidence, but you must choose\nthem wisely as they will be the only support for argument.\n3) Analysis and interpretation of your evidence to show\nhow it supports your claim. Without this part, you will not\nhave made a complete argument. Do not expect your reader\n(me, in this case) to do the work of analysis and interpretation\nfor you.\n4) A strong, worthwhile conclusion, not just a summary of\nthe argument or repetition of the claim. 59\nThe following guidelines tell you more about each part of the\nCRP. Remember: do not write a plot summary. Engage the text\nand try to understand what it is attempting to say about real\nlife.\n1. The Argumentative Claim, written as a Topic Sentence\nAs a mini-essay, the CRP must include a topic sentence\n(usually the first sentence or two) that includes the following:\n• the author’s name and the title of the text you are\nengaging\n• your claim, which must state concisely what theme\nyou will argue. Remember that THEME means what\nthe story suggests about real life.\nCreating a strong argumentative topic sentence is perhaps the\nmost crucial step in writing a critical response paragraph.\nKey Takeaways\nA strong topic sentence expresses your claim and\nthereby gives you something to say; it helps ensure\nthat the paragraph you write argues something that\nthe story shows, illustrates, portrays, or dramatizes.\nThe most common mistakes students make when writing\na critical response paragraph are to start with a weak topic\nsentence or to start with a topic sentence that is a statement of\nfact. Intro to Literature: Fairy Tales and Folk Tales 60\nKey Takeaways\nA weak topic sentence leads to an unfocused,\nrambling response, and a factual statement leads to\nplot summary; neither of those is a clear, persuasive\nargument.\nIf, after writing your paragraph, you find that many of your\nsentences say the same thing or that you have actually\nsummarized all or part of a text, then you probably have not\ncreated a strong topic sentence.\nExamples\nWeak topic sentence: In “Beauty and the Beast,” the\nBeauty’s sisters clearly do not like her.\nWhat do you think is a reader’s response to that\nintroductory sentence? “So what?” “Isn’t that obvious?”\nYes, it is obvious. It is a statement of fact that leaves no room\nfor interpretation or analysis, and it makes no argument. This\nkind of topic sentence leads to plot summary of the text. There\nis nothing to prove.\nInstead, ask yourself what is the point of a story in\nwhich two sisters dislike the third sister? WHY do they\ndislike her, and what does that mean if we want to apply\nthe story to real life (which we do)? 61\nTo identify possible meanings, let’s give this a little more\nthought. WHY do the elder sisters dislike Beauty? Isn’t she\nobviously more beautiful than they are? Do they want her\nout of the way so that they can shine more brightly? Aren’t\nthey unhappy with their husbands, so maybe they want to\nlook for new husbands? Might Beauty’s presence interfere with\nthat search for new husbands? If the answers are “yes,” what\nmight that mean for the real lives of real young women in\ngeneral—outside the story?\nHere’s one possibility: maybe the writer sees the story as an\nexample of how young women may be divided from each other\nbecause they find themselves competing with each other for\nhusbands\/partners. From that idea, we might begin to write a\nbetter claim::\nExamples\nIn Jeanne-Marie Leprince de Beaumont’s version of\n“Beauty and the Beast,” the rivalry between Beauty and\nher sisters may illustrate . . .\nNotice that this beginning of a claim takes the original idea\nthat the sisters dislike Beauty and turns it into an argument\nabout something the story shows us. Finish the claim by\nmaking that something about real life, about the cultural\nexpectation to get married and what it might do to young\nwomen and their relationships with each other. Intro to Literature: Fairy Tales and Folk Tales 62\nExamples\nIn Jeanne-Marie Leprince de Beaumont’s version of\n“Beauty and the Beast,” the rivalry between Beauty and\nher sisters may illustrate how the cultural demand to get\nmarried prevents young women from building healthy\nrelationships with each other.\nThis is a strong claim because it makes a statement that can\nbe argued.\nThere are various ways in which to proceed with the\nargument, but remember that in a CRP, you are only required\nto argue the claim based on one point of textual evidence which\nyou analyze and explain to show how it supports your claim.\n• You could argue about the sisters’ early envy of\nBeauty and how they fear that Beauty will steal the\nspotlight from them and then they’ll end up with\nless-than-satisfactory husbands.\n• Or you could argue about the sisters’ dislike of\nBeauty later because they have in fact married\nunsatisfactory husbands and they don’t want to see\nBeauty do better than they have in choosing a\nhusband.\n• You could even argue how the story suggests that\nthe pressure to marry may lead women (like the\nsisters) to accept unsuitable partners.\nAll three possible arguments might be written so as to support\nthe example claim, above. But you must be sure to relate the 63\ntextual details to the claim’s point about real life. That is, you\nmust say explicitly HOW these points in the story tell us\nsomething about the problems of marriage for real-life young\nwomen.\n2. The Argument: Evidence and Interpretation; Optional\nConfutation\nNow that you have created a strong argumentative topic\nsentence, how do you prove your argument? Much as an\nattorney in a court of law does, you must present evidence\nand analyze it to show precisely how it supports your claim.\nQuotations and paraphrases from the text, plus your\nanalysis and interpretations, supply the evidence you\nneed to support your argument. You may want to go\nthrough the text and mark or write down passages that\nillustrate what you are trying to prove. From these passages,\nchoose one or two that most clearly support your argument.\nThere may be more, but in a 7-10 sentence paragraph, you do\nnot have the space to incorporate all of them, so choose the\nstrongest one, or two at the most.\nHowever, simply filling your paragraph with quotation and\nparaphrase does nothing to prove your argument. When you\nuse a quote or a paraphrase, you must do the following:\n1. Key Takeaways\nIntroduce it. Say something about where\/when\nit occurs in the story and, if it is dialogue,\nidentify the speaker. Intro to Literature: Fairy Tales and Folk Tales 64\n2. Key Takeaways\nIncorporate it accurately into one of your\nsentences. Include an accurate parenthetical\nreference that provides the author’s last name\nand page number(s).\n3. Key Takeaways\nInterpret or explain the evidence in relation to\nyour argument; evidence does not stand alone\nas proof.\nExamples\nUnclear Evidence: Beauty’s sisters dislike\nher, but they turn positively dangerous when\nthey try to keep Beauty from the Beast.\n“‘Let’s try to keep Beauty here for more than\na week. Her stupid beast will get angry . . .\nand maybe he’ll eat her up’” (48)\nThis example does use an interesting passage from the text with 65\nan appropriate introductory comment. However, the passage is\nnot connected to the introductory sentence in any way, so it\nisn’t clear how the sentence and the quotation are related. To\nmake this point a better use of evidence, do the following:\n1. CONNECT the introductory phrase to the quotation\nwith your words or punctuation.\nExamples\nBeauty’s sisters dislike her, but they become positively\ndangerous when they try to keep Beauty from the\nBeast: “‘Let’s try to keep Beauty here for more than a\nweek. Her stupid beast will get angry . . . and maybe\nhe’ll eat her up’” (48).\n2. INTERPRET the quotation to show your reader how\nit supports your claim.\nExamples\nThe sisters may be trying to get rid of Beauty as\ncompetition for eligible men, especially since both\nsisters are so unhappy with their husbands (47). With\nBeauty out of the way, they may feel they will have a\nbetter chance at finding better partners. Intro to Literature: Fairy Tales and Folk Tales 66\nThis way, you, as the writer, tell your reader the meaning\nof the quotation as you see it. Notice how you can add a little\ninterpretation in the same sentence: especially since both\nsisters are so unhappy with their husbands.\nSo you’re saying, in effect, that the sisters intend to clear the\ncompetition—Beauty—from the playing field because they may\nsoon be looking for new husbands and they don’t want Beauty\naround to grab all the attention.\nExercises\nTRY THIS: If you are not sure how to analyze your\nevidence, try using a “because” statement.\nFor example: This quotation shows that Beauty’s\nsisters are dangerous because [now tell me specifically\nhow the quotation shows this danger].\nMaking this kind of move–properly\nintroducing your evidence and then\ninterpreting it–should make up most of your\nparagraph.\n3. Optional: Confutation\nConfutation means presenting some opposing idea that might\nchallenge or disprove your argument, and then refuting or\ndealing with that opposing idea in some way that tends to\nweaken its challenge to your claim. The goal is to strengthen\nyour argument by showing how weak the opposition is. 67\nConfutation is optional in CRPs. So why would you want to\ninclude it in your CRP if it’s not required? Two reasons:\n1. You can earn extra points if your confutation is\nproperly done.\n2. Confutation will be required in your longer essay\n(CRE1 and CRE2), so it’s not a bad idea to practice\nconfutation in your CRPs so you’ll be prepared to\nwrite better confutations when it’s time to write\nyour CREs.\nHowever, the choice whether to include confutation in your\nCRPs is ultimately yours. You won’t lose any points for not\nincluding it.\nExamples\nConfutation Example:\nSome readers may argue that the sisters have good\nreason to dislike Beauty, since they have been living\nin her shadow for most of their lives. But Beauty\nshould not be blamed because others see her as\nbeautiful. On the contrary, she does her best to be\nkind to her sisters, but they resent and reject her\nkindness. [Include some evidence here regarding\nBeauty’s kindness and the sisters’ resentment.]\nSO, now that you’ve produced an arguable claim, provided\nevidence from the text and analysis to show how it supports\nyour claim, and possibly added confutation, it’s time to wrap\nup your argument with a brief concluding sentence or two. Intro to Literature: Fairy Tales and Folk Tales 68\n4. Concluding Statement\nDon’t allow your paragraph to just fade out at the end or to\nstop abruptly after you’ve proven your argument. You’ve stated\nyour claim, supplied evidence to support it, and interpreted\nthe evidence, and possibly refuted a point of opposition. Now,\nend your paragraph with a brief but strong conclusion (one or\ntwo sentences) that identifies how your argument is important\nin some way and makes your reader feel that reading your\nargument has been worthwhile.\nExamples\nIn this way, “Beauty and the Beast” illustrates\nwomen’s competition for marriageable men and\nwarns young women against such competition and\nthe cruelty it may cause.\nNotice that this statement is somewhat like the argument’s\nclaim, but it says more now, in the light of what you’ve argued.\nAnd it says something about real people in real life, not just\nthe characters in the story. This is what it takes to write an\nargument and a useful conclusion—linking your argument to\nreal life and what the story suggests about it.\nExercises\nTry this: If you are having trouble writing a useful 69\nconclusion, try using confutation as your\nconclusion. Write a confutation that relates to your\nclaim and use that to conclude your argument. See\nthe example below.\nExamples\nThough some readers may think the sisters are\njustified in their dislike of Beauty, their deep\nhostility, which has been building throughout the\nstory, illustrates the dangers that can result from\ncultural expectations that encourage women to\ncompete with one another for the attentions of men.\nNotice how this conclusion provides both confutation AND a\nreminder of the initial CLAIM and how your argument has\nsupported it.\n5. Works Cited\nSee the chapter titled “Citing Your Sources”\n6. Some ADDITIONAL Things to Keep in Mind\nBook Club Discussions and Claims\nBook Club Discussions are meant to help you produce possible\nclaims in a group discussion setting. I provide feedback on Intro to Literature: Fairy Tales and Folk Tales 70\nthese claims in class which is meant to help you further\nimprove the claim so it can be used for your CRPs. Many\ninstructors provide a list of questions as critical response\nparagraph topics. Generally, if you can write an argumentative\nresponse to the prompt in one or two sentences, you’ve created\na claim.\nLength\nMost critical response paragraphs are between 7 and 10\nsentences in length. Any shorter and you probably have not\nargued your point persuasively; any longer and you probably\nhave lost focus and drifted outside the scope of your argument.\nFormat\nFormat your paragraph using MLA format, which is the\nformat shown in the CRP Example.\nParenthetical Documentation\nAlways document the page number(s) you quote or\nparaphrase using MLA parenthetical documentation style. Your\ninstructor may not require a works cited page, but most\ninstructors do want to know from where the material is taken\nand that you can demonstrate proper documentation\ntechnique. Not documenting your sources risks plagiarism.\nThe “So what?” Test\nYour topic sentence and your paragraph should be able to pass\nthe “So what?” test. In this case, the question “So what?” is 71\nmeant to remind you that we are reading the story to figure\nout what it says about real people in real life. When you’re\nthinking of what to argue about the story, remember that\nstories mean to push you around, to make you think and feel\ncertain things. What are those things, and how can you build\nan argument about one of them? If you can’t provide an\nanswer, you may want to re-read the story with the connection\nto real life in mind.\nProofreading and Editing\nAlways proofread, edit, and revise. Silly mistakes, awkward\nsentences, and poor grammar detract from the authority you\nare trying to create to prove your argument. They will also cost\nyou points on your grade; but you can easily avoid losing these\npoints with careful proofreading. Two very good ideas to help\nyou revise your paragraph are to read it out loud to yourself\nand to have someone else, such as the Writing Lab, proofread it\nwith you and help you improve it. Intro to Literature: Fairy Tales and Folk Tales 72\nWriting the\n7.\nCritical Response\nEssay (CRE)\nThe Critical Response Essay is a multi-paragraph, multi-page\nessay that requires you to take one of your Critical Response\nParagraphs and revise it to create a more complex and stronger\nargument. You should choose your best CRP or the one that\nmost interests you. Focus on making it not only a longer\nargument, but also a better argument, using what you’ve\nlearned since writing the original piece to improve the\nargument and the writing itself (argument form, paragraph\nform, and grammar). Also use what you’ve learned from my\nfeedback and from our discussions in class and individual\nconferences. You must include confutation.\n72 73\nARGUMENT FORM\nCREs require that you use classical argument form. The parts\nof this kind of argument are as follow:\nKey Takeaways\n• Title.\n• Introduction Paragraph, ending with claim\n• [Confutation as first argument\nparagraph?]\n• Argument Paragraphs (two or three): Begin\nwith a subclaim, then support it by providing\ntextual evidence and analysis of evidence\n[including confutation within?]\n• [Confutation as final argument\nparagraph?]\n• Conclusion [confutation as conclusion?]\n• Works Cited\nTITLE\nYour title may not be simply the title of the story or the\nassignment. It must be a title that is specific to your argument. Intro to Literature: Fairy Tales and Folk Tales 74\nINTRODUCTION PARAGRAPH with CLAIM\n1. Introduce the story and the author about which you\nare writing. If you’re writing about a film, identify\nthe director.\n2. Call attention to the features of the story on which\nyou will base your argument. This is the ONLY part\nof the essay in which you may summarize parts of\nthe story.\n3. END the introduction with your CLAIM.\nTHE CLAIM\n• If you have no claim, you have no argument, and\ntherefore you may earn a disappointing grade.\n• Likewise, if your claim does not appear in the\nintroduction, your reader has no way of knowing\nwhat your subclaims and evidence are attempting to\nprove.\n• It’s not like a joke where you save the punchline\nuntil last.\n• It’s not mystery-writing, where you don’t identify\nthe murderer until the end.\n• It’s an argument. So for your reader to understand\nwhat is the point of all the evidence and analysis\nyou’re working so hard to create, you must tell her,\nin the introduction, what you’re trying to argue and\nprove. 75\nWriting an Arguable Claim\n• Think in terms of theme.\n• Theme cannot be expressed with just a word or even\na short phrase, like sibling rivalry or fear of\nmarriage. Those are interesting topics, but they are\nnot yet themes.\n• To turn a topic into a theme, you must be able to say\nwhat the story shows us about the topic, that\nrelates to real life beyond the story.\nExamples\n“Beauty and the Beast” illustrates sibling rivalry.\nThis is an insufficient claim about theme because it\ndoesn’t give me even a hint of what you think the story\nsays about sibling rivalry. Unless you plan to tell me that\nin the next sentence, there’s a problem with your claim.\nBy the way, a claim can be more than one sentence.\nExamples Intro to Literature: Fairy Tales and Folk Tales 76\nJeanne-Marie Leprince de Beaumont’s “Beauty and\nthe Beast” illustrates how sibling rivalry can be\ncaused by unnecessary competition for mates,\nparticularly in the case of sisters.\nNow that’s an arguable claim because it includes author,\ntitle, a topic, and what the story says about the topic and\nhow it relates to real life.\nYou can make this claim even stronger (and give yourself\ngreater confidence that your argument will be persuasive) by\nincluding the main textual evidence you will cite.\nExamples\nIn Jeanne-Marie Leprince de Beaumont’s “Beauty and\nthe Beast,” the elder sisters’ abusive treatment of\nBeauty illustrates how sibling rivalry can be caused\nby competition for mates.\nOr you could revise this idea to discuss how cultural\nexpectations play a role in this kind of rivalry and unhealthy\ncompetition. See the CRP Example for something like that.\nTRY THIS: 77\nExercises\nIf it helps, you can think of these components as\npart of a formula.\nLet X be the story and some particular feature of it.\nLet Y be the theme you are arguing.\nInstead of an equal sign, we insert a verb that\nexpresses the relationship between X and Y:\n(=) illustrates, shows, portrays, dramatizes, suggests\n(etc.)\nIn this example:\nLet X be the elder sisters’ resentment toward Beauty.\nLet Y be how sibling rivalry can be caused by competition\nfor mates.\nNotice in the example below how this process creates an\narguable claim.\nExamples\n(X) The elder sisters’ resentment toward Beauty in\n“Beauty and the Beast”\n(=) illustrates, shows, portrays, dramatizes, suggests\n(etc.) Intro to Literature: Fairy Tales and Folk Tales 78\n(Y) how sibling rivalry can be caused by competition\nfor mates.\nARGUMENT PARAGRAPHS\n• Support the claim with argument paragraphs.\n• How many you need is up to you, but generally at\nleast two, in some cases three or four.\n• Begin EVERY argument paragraph with a TOPIC\nSENTENCE\n• The topic sentence is like a mini-claim, the\nparagraph’s claim\n• Tells me what you’ll argue in this paragraph\n• And tells or shows how this point supports the main\nclaim.\n• Support the topic sentence with textual evidence and\nanalysis\n• Quotations and your analysis of them.\n• See the Quotation Sandwich document for guidance.\n• Vary the verbs you use to incorporate quotations\ninto your sentences. DO NOT use the words “says,”\n“states,” or “writes” (or any forms of these verbs). See\nthe document titled “Effective Verbs for Introducing\nQuotations in Canvas for many possible verbs that\nyou may use.\n• Use transitional terms—also called “signposts”—to 79\nshow the relationships from one point to the next\nand from one paragraph to the next. The internet is\nfull of lists of transitional terms. Here’s one good\nsource: Transition Words.\nCONFUTATION\nConfutation makes an argument stronger by dealing with\nopposing points and evidence.\n• Confutation includes the following parts:\n• Presenting opposition fairly (opposing claims or\nideas)\nRemember that the opposition must not be a “straw man.” That\nis, you must engage with something that a careful reader would\nactually argue, not a simplistic, obviously erroneous reading.\nExamples\nSome readers might argue that the sisters are not\nabusive toward Beauty.\nThis example is a straw man statement. No one\nwould seriously argue this point because the sisters\nactually plot to get Beauty killed, and what could be\nmore abusive than that?\n• Refuting the opposition: showing how it is incorrect\nor at least as correct as your reading. Intro to Literature: Fairy Tales and Folk Tales 80\n• Confutation may occur in any of four parts of the\nargument\n◦ Directly after the introduction\n◦ o Directly before the conclusion\n◦ o As part of the conclusion\n◦ o Within paragraphs, to deal with possible\nalternative interpretations of your textual\nevidence.\nConsider a confutation involving the fairy who appears at\nthe end of “Beauty and the Beast” and what she does to\nBeauty’s sisters. That is, she punishes the two sisters for their\nbad behavior. Some readers see this as fair because those mean\ngirls get what’s coming to them. But others see it as a missed\nopportunity to promote sisterhood among all three of the girls.\nHere are examples of how to write these points as a complete\nconfutation.\nExamples\nState the opposition, as fairly as possible: When the fairy\npunishes the two sisters for their bad behavior, some\nreaders see this extreme punishment as fair because\nthose mean girls finally get what is coming to them.\nRefute the opposition: But by imposing this\npunishment, the fairy misses a chance to promote\nsisterhood among all three of the girls. But if she has\nsuch powerful magic, that she can turn young women 81\nto stone, shouldn’t she be able to teach them to love\neach other instead?\nThis refutation includes a rhetorical question; it is not meant\nfor you to answer, but to leave the reader thinking about your\nideas. You are not required to pose your refutation as a\nquestion; this is just one way to write your refutation.\nCONCLUSION\nWhat do you do with a conclusion? Do not just restate your\nclaim, even if you change some of the wording. That’s not\nworth your reader’s time. So what is worth your reader’s time?\n• A kind of wrap-up: What’s the point of this\nargument? What has been learned here and why\ndoes it matter? What do you want you and your\nreader to have learned or created together?\n• And why is this important? Does it apply to real life\nnow? How?\n• Certainly the spirit of your claim will be here. But\nnot just your claim reworded.\n• Your claim, but more complex and stronger\n◦ o Because you’ve just been feeding it and\nexercising it,\n◦ o So now it’s bigger and more interesting.\n◦ o So you should be able to talk it about it Intro to Literature: Fairy Tales and Folk Tales 82\nwith greater complexity and authority.\nDon’t go crazy and add new\nideas—remember you’re wrapping things\nup.\n• Confutation as Conclusion: You may be able to write\na conclusion that includes confutation. Why might\nthis be a useful strategy? Why might it be\nproblematic?\nUnderstanding the difference between claim and\nconclusion\n• the conclusion is similar to the claim\n• and yet more detailed and complete in meaning.\n• Notice the relationship between the CLAIM and the\nConclusion in this example:\nExamples\nClaim\nThe story of “The Frog King, or Iron Henry” illustrates\nand even promotes the importance of consent in\nrelationships.\nConclusion\nIn this way, the story highlights the importance of 83\nunderstanding and respecting the value of consent.\nThis tale teaches readers to stand up for themselves\nand refuse to give in to situations that will clearly\ncause discomfort or danger.\nKeep this guidance and these examples handy as you draft your\nessay, and remember that I’m happy to answer questions and\nreview drafts within the time constraints announced in class. Intro to Literature: Fairy Tales and Folk Tales 84\nCiting Your\n8.\nSources\nCiting Your Sources\nCiting sources is a matter of logic and ethics. You can only\nsupport the logic and truth of your arguments if you provide\nevidence, and your argument can only be seen as ethical and\ntherefore credible if you identify the source of that evidence.\nIn the study of literature, we follow the rules and formats\ndetermined by the Modern Language Association (MLA). You\nmay learn another set of rules and formats when you begin\nwriting in your major discipline, but MLA formats are what\nyou will use in this class.\nThere’s nothing mysterious about this format or this process.\nIt’s simply a kind of code (and not a very complex one) to\nhelp the writer explain and the reader understand where the\nmaterial can be found. What you’ll find in this document are\ninstructions on how to use that code.\nI know that many students use online citation creators rather\n84 85\nthan create their own Works Cited entries. I have no problem\nwith that. However, keep in mind that you are the one who’s\nbeing graded on this work, so be sure that you use the correct\nformat, no matter who creates it.\nMLA Citation Formats\nThis chart shows how to identify and create the parts of an\nMLA citation. Intro to Literature: Fairy Tales and Folk Tales 86\nElement Examples\nMcGowan, Britt.\nOR…\nSometimes, all you will find is\nAuthor (Last Name, First Name). an editor or compiler or\n[period] collector. In this case, add an\nabbreviation (ed., comp., coll.)\nafter the author’s name:\nMcGowan, Britt, comp.\nTitle of Source. [period]\nItalics for a large work like a\nbook or movie. Mediocre Book.\nQuotation marks for shorter or “Creepy Story.”\nwork inside a Container (large or “Awesome Article.”\nwork), like an article or short\nstory.\nStories of Justin McCoy, or\nIntroduction to Literature: Faiy\nTitle of Container * [period] If Tales, Folk Tales, and How They\nciting a short work inside a Shape Us.\nlonger one. Or, name of website on which\nthe source is published:\nProject Gutenberg.\nTranslated by, Compiled by,\nOther Contributors * if there are Colledted by, Directed by,\nany. [comma] Adapted by, Edited by,\nIllustrated by Scott Satterwhite,\n2nd edition, (no version\/edition\nEdition or Version * [comma]\nfor journal articles)\nvol. 30, no. 1, (may or may not\nNumber * [comma]\napply to a book)\nUP of Florida, (no publisher for\nPublisher * [comma] journal articles)\n(UP stands for University Press.) 87\nPublication date* [comma if\nmore information to come, such 2010,\na location]\nPrint source—page numbers: pp.\n40-45.\nOnline source—URL where the\nLocation * [final period]\ntext is found:\nhttps:\/\/www.gutenberg.org\/\nebooks\/7074.\n* Indicates an element that is only included if applicable to\nthe source. Books may or may not have an edition number or\nvolume number. Most journal articles will have both volume\nand issue number, and a publisher is not necessary for journal\narticles. Online sources may or may not include editions, issue\nnumbers, or publication dates.\nContainer #2: Elements 3-9 may repeat, e.g., if a journal or\ncollection of short stories (Container #1) is found inside a\ndatabase (Container #2):\nELEMENT SOURCE\nProject Gutenberg\nTitle of Container [comma]\nJSTOR\nLocation: URL [final period] www.jstor.org\/stable\/41403188\nPutting It All Together: Works Cited Entry\nEXAMPLES\nNOTICE the indentations. First line begins at the margin; Intro to Literature: Fairy Tales and Folk Tales 88\nsecond lines and any lines after it are indented as if for a\nparagraph.\nIn MS Word, you can make the program do these\nindentations for you. In the top menu bar, open the Format\nmenu, then Paragraph. In the window that opens, look under\nIndentationà Special, and choose Hanging from the drop-down\nmenu.\nIn Google Docs, open the Format menu and choose Align &\nIndent, scroll down to Indentation Options, and, under Special\nIndent, choose Hanging. Then type in 0.5, so you’ll get half-\ninch indentations.\nBook\nMcGowan, Britt. Mediocre Book. Edited by Scott Satterwhite. UP\nof Florida, 2010.\nStory, Poem, or Article\nExamples\nMcCoy, Justin. “Creepy Story.” Collected Creepy Stories,\nedited by Judy Young, Norton, 2001, pp. 2-5.\nLeprince de Beaumont, Jean Marie. “Beauty and the\nBeast.” The Classic Fairy Tales, edited by Maria Tatar,\nNorton, 2017, pp. 39-50.\nLeprince de Beaumont, Jean Marie. “Beauty and the\nBeast.” Introduction to Literature: Fairy Tales, Folk Tales,\nand How They Shape Us, Judy Young, University of West 89\nFlorida, 2023. Project Gutenberg,\nhttps:\/\/www.gutenberg.org\/ebooks\/7074.\nMOVIE\nNotice that in this example, the director is included. If you\nwere to write specifically about one of the actors or the\ncinematography or the score of the movie (its music, that is),\nthen you must include the names of those contributors, after\nthe director.\nExamples\nMaleficent, Mistress of Evil. Directed by Joachim Renning,\nWalt Disney Pictures, 2019.\nExamples for Commonly Cited Texts\nExamples Intro to Literature: Fairy Tales and Folk Tales 90\nBook Citation\nGaiman, Neil. The Sleeper and the Spindle. Illustrated by\nChris Riddell, HarperCollins, 2015.\nShort Story Citation from an E-book\nLeprince de Beaumont, Jean Marie. “Beauty and the\nBeast.” Introduction to Literature: Fairy Tales, Folk Tales,\nand How They Shape Us, Judy Young, University of West\nFlorida, 2023. Project Gutenberg,\nhttps:\/\/www.gutenberg.org\/ebooks\/7074.\nShort Story Citation from an Online Text\nDe Beaumont, Jeanne-Marie LePrince. “Beauty and the\nBeast.” Project Gutenberg, https:\/\/www.gutenberg.org\/\nebooks\/7074.\nShort Story Citation from an Anthology of Stories\nDe Beaumont, Jeanne-Marie LePrince. “Beauty and the\nBeast.” The Classic Fairy Tales, edited by Maria Tatar,\n2nd edition, Norton, 2017, pp. 39-50.\nCitation of an Article from a Collection of Articles\/\nEssays\/Anthology\nZipes, Jack. “Breaking the Disney Spell.” The Classic 91\nFairy Tales, edited by Maria Tatar, pp. 414-35. From\nMouse to Mermaid: The Politics of Film, Gender, and\nCulture. Edited by Elizabeth Bell, Lynda Haas, and\nLaura Sells, Indiana UP, 1995, pp. 21-42.\nGeneral Format WITH SAMPLE WORKS CITED\nPAGE\nYour Work(s) Cited page should follow this format, of course\nusing the text(s) that you’re citing.\nWork Cited (use this title if you’re only citing ONE text of\nany kind [story, poem, novel, play, movie].\nWorks Cited: Use this title if you are citing MORE than\nONE source.\nIf you cite more than one source, arrange the sources\nalphabetically, based on the author’s last name. If you don’t\nknow the author’s or storyteller’s or film director’s last name,\nuse the first word of the text’s title instead of a last name.\nSample Works Cited Page\nNotice that the entries are listed in alphabetic order. The\nfirst source is the illustrated book we’ll be reading later in the\nsemester. The second source is from our course e-book, and the\nthird source is a movie. For CRPs, you’ll only have one source\nand the list will be titled Work Cited (singular), but for CREs, Intro to Literature: Fairy Tales and Folk Tales 92\nyou may have more than one source, in which case the page is\ntitled Works Cited (plural).\nExamples\nWorks Cited\nGaiman, Neil. The Sleeper and the Spindle. Illustrated by\nChris Riddell, HarperCollins, 2015.\nLeprince de Beaumont, Jean Marie. “Beauty and the\nBeast.” Introduction to Literature: Fairy Tales, Folk Tales,\nand How They Shape Us, Judy Young, University of West\nFlorida, 2023. Project Gutenberg,\nhttps:\/\/www.gutenberg.org\/ebooks\/7074.\nMaleficent, Mistress of Evil. Directed by Joachim\nRenning, Walt Disney Pictures, 2019. 93\nPART III\nFairy Tales\n93 Intro to Literature: Fairy Tales and Folk Tales 94\nBeauty and the\n9.\nBeast\nA Tale for the Entertainment of Juvenile Readers.\nby Jeanne-Marie Leprince de Beaumont\nThere was once a very rich merchant, who had six children,\nthree sons, and three daughters; being a man of sense, he\nspared no cost for their education, but gave them all kinds of\nmasters. His daughters were extremely handsome, especially\nthe youngest; when she was little, every body admired her,\nand called her The little Beauty; so that, as she grew up, she\nstill went by the name of Beauty, which made her sisters very\njealous. The youngest, as she was handsome, was also better\nthan her sisters. The two eldest had a great deal of pride,\nbecause they were rich. They gave themselves ridiculous airs,\nand would not visit other merchants’ daughters, nor keep\ncompany with any but persons of quality. They went out every\nday upon parties of pleasure, balls, plays, concerts, etc. and\n94 95\nlaughed at their youngest sister, because she spent the greatest\npart of her time in reading good books. As it was known that\nthey were to have great fortunes, several eminent merchants\nmade their addresses to them; but the two eldest said they\nwould never marry, unless they could meet with a Duke, or an\nEarl at least. Beauty very civilly thanked them that courted her,\nand told them she was too young yet to marry, but chose to\nstay with her father a few years longer.\nAll at once the merchant lost his whole fortune, excepting a\nsmall country-house at a great distance from town, and told his\nchildren, with tears in his eyes, they most go there and work\nfor their living. The two eldest answered, that they would not\nleave the town, for they had several lovers, who they were sure\nwould be glad to have them, though they had no fortune; but in\nthis they were mistaken, for their lovers slighted and forsook\nthem in their poverty. As they were not beloved on account\nof their pride, every body said, “they do not deserve to be\npitied, we are glad to see their pride humbled, let them go and\ngive themselves quality airs in milking the cows and minding\ntheir dairy. But, (added they,) we are extremely concerned for\nBeauty, she was such a charming, sweet-tempered creature,\nspoke so kindly to poor people, and was of such an affable,\nobliging disposition.” Nay, several gentlemen would have\nmarried her, though they knew she had not a penny; but she\ntold them she could not think of leaving her poor father in\nhis misfortunes, but was determined to go along with him into\nthe country to comfort and attend him. Poor Beauty at first\nwas sadly grieved at the loss of her fortune; “but, (she said to\nherself,) were I to cry ever so much, that would not make things\nbetter, I must try to make myself happy without a fortune.”\nWhen they came to their country-house, the merchant and\nhis three sons applied themselves to husbandry and tillage; Intro to Literature: Fairy Tales and Folk Tales 96\nand Beauty rose at four in the morning, and made haste to\nhave the house clean, and breakfast ready for the family. In\nthe beginning she found it very difficult, for she had not been\nused to work as a servant; but in less than two months she\ngrew stronger and healthier than ever. After she had done\nher work, she read, played on the harpsichord, or else sung\nwhilst she spun. On the contrary, her two sisters did not know\nhow to spend their time; they got up at ten, and did nothing\nbut saunter about the whole day, lamenting the loss of their\nfine clothes and acquaintance. “Do but see our youngest sister,\n(said they one to the other,) what a poor, stupid mean-spirited\ncreature she is, to be contented with such an unhappy\nsituation.” The good merchant was of a quite different opinion;\nhe knew very well that Beauty out-shone her sisters, in her\nperson as well as her mind, and admired her humility, industry,\nand patience; for her sisters not only left her all the work of the\nhouse to do, but insulted her every moment.\nThe family had lived about a year in this retirement, when\nthe merchant received a letter, with an account that a vessel,\non board of which he had effects, was safely arrived. This news\nhad liked to have turned the heads of the two eldest daughters,\nwho immediately flattered themselves with the hopes of\nreturning to town; for they were quite weary of a country life;\nand when they saw their father ready to set out, they begged\nof him to buy them new gowns, caps, rings, and all manner of\ntrifles; but Beauty asked for nothing, for she thought to herself,\nthat all the money her father was going to receive would scarce\nbe sufficient to purchase every thing her sisters wanted. “What\nwill you have, Beauty?” said her father. “Since you are so kind\nas to think of me, (answered she,) be so kind as to bring me a\nrose, for as none grow hereabouts, they are a kind of rarity.”\nNot that Beauty cared for a rose, but she asked for something, 97\nlest she should seem by her example to condemn her sisters’\nconduct, who would have said she did it only to look particular.\nThe good man went on his journey; but when he came there,\nthey went to law with him about the merchandize, and after a\ngreat deal of trouble and pains to no purpose, he came back as\npoor as before.\nHe was within thirty miles of his own house, thinking on\nthe pleasure he should have in seeing his children again, when\ngoing through a large forest he lost himself. It rained and\nsnowed terribly, besides, the wind was so high, that it threw\nhim twice off his horse; and night coming on, he began to\napprehend being either starved to death with cold and hunger,\nor else devoured by the wolves, whom he heard howling all\naround him, when, on a sudden, looking through a long walk\nof trees, he saw a light at some distance, and going on a little\nfarther, perceived it came from a palace illuminated from top\nto bottom. The merchant returned God thanks for this happy\ndiscovery, and hasted to the palace; but was greatly surprised at\nnot meeting with anyone in the out-courts. His horse followed\nhim, and seeing a large stable open, went in, and finding both\nhay and oats, the poor beast, who was almost famished, fell to\neating very heartily. The merchant tied him up to the manger,\nand walked towards the house, where he saw no one, but\nentering into a large hall, he found a good fire, and a table\nplentifully set out, with but one cover laid. As he was wet\nquite through with the rain and snow, he drew near the fire to\ndry himself. “I hope, (said he,) the master of the house, or his\nservants, will excuse the liberty I take; I suppose it will not be\nlong before some of them appear.”\nHe waited a considerable time, till it struck eleven, and still\nnobody came: at last he was so hungry that he could stay\nno longer, but took a chicken and ate it in two mouthfuls, Intro to Literature: Fairy Tales and Folk Tales 98\ntrembling all the while. After this, he drank a few glasses\nof wine, and growing more courageous, he went out of the\nhall, and crossed through several grand apartments with\nmagnificent furniture, till he came into a chamber, which had\nan exceeding good bed in it, and as he was very much fatigued,\nand it was past midnight, he concluded it was best to shut the\ndoor, and go to bed.\nIt was ten the next morning before the merchant waked, and\nas he was going to rise, he was astonished to see a good suit\nof clothes in the room of his own, which were quite spoiled.\n“Certainly, (said he,) this palace belongs to some kind fairy,\nwho has seen and pitied my distress.” He looked through a\nwindow, but instead of snow saw the most delightful arbours,\ninterwoven with the most beautiful flowers that ever were\nbeheld. He then returned to the great hall, where he had supped\nthe night before, and found some chocolate ready made on a\nlittle table. “Thank you, good Madam Fairy, (said he aloud,) for\nbeing so careful as to provide me a breakfast; I am extremely\nobliged to you for all your favours.”\nThe good man drank his chocolate, and then went to look\nfor his horse; but passing through an arbour of roses, he\nremembered Beauty’s request to him, and gathered a branch on\nwhich were several; immediately he heard a great noise, and\nsaw such a frightful beast coming towards him, that he was\nready to faint away. “You are very ungrateful, (said the beast\nto him, in a terrible voice) I have saved your life by receiving\nyou into my castle, and, in return, you steal my roses, which I\nvalue beyond any thing in the universe; but you shall die for\nit; I give you but a quarter of an hour to prepare yourself, to\nsay your prayers.” The merchant fell on his knees, and lifted up\nboth his hands: “My Lord (said he,) I beseech you to forgive\nme, indeed I had no intention to offend in gathering a rose 99\nfor one of my daughters, who desired me to bring her one.”\n“My name is not My Lord, (replied the monster,) but Beast; I\ndon’t love compliments, not I; I like people should speak as\nthey think; and so do not imagine I am to be moved by any of\nyour flattering speeches; but you say you have got daughters; I\nwill forgive you, on condition that one of them come willingly,\nand suffer for you. Let me have no words, but go about your\nbusiness, and swear that if your daughter refuse to die in your\nstead, you will return within three months.” The merchant\nhad no mind to sacrifice his daughters to the ugly monster,\nbut he thought, in obtaining this respite, he should have the\nsatisfaction of seeing them once more; so he promised upon\noath, he would return, and the Beast told him he might set out\nwhen he pleased; “but, (added he,) you shall not depart empty\nhanded; go back to the room where you lay, and you will see a\ngreat empty chest; fill it with whatever you like best, and I will\nsend it to your home,” and at the same time Beast withdrew.\n“Well (said the good man to himself) if I must die, I shall have\nthe comfort, at least, of leaving something to my poor children.”\nHe returned to the bed-chamber, and finding a great quantity\nof broad pieces of gold, he filled the great chest the Beast had\nmentioned, locked it, and afterwards took his horse out of the\nstable, leaving the palace with as much grief as he had entered\nit with joy. The horse, of his own accord, took one of the roads\nof the forest; and in a few hours the good man was at home.\nHis children came around him, but, instead of receiving their\nembraces with pleasure, he looked on them, and, holding up the\nbranch he had in his hands, he burst into tears. “Here, Beauty,\n(said he,) take these roses; but little do you think how dear\nthey are like to cost your unhappy father;” and then related his\nfatal adventure: immediately the two eldest set up lamentable\noutcries, and said all manner of ill-natured things to Beauty, Intro to Literature: Fairy Tales and Folk Tales 100\nwho did not cry at all. “Do but see the pride of that little wretch,\n(said they); she would not ask for fine clothes, as we did; but\nno, truly, Miss wanted to distinguish herself; so now she will be\nthe death of our poor father, and yet she does not so much as\nshed a tear.” “Why should I, (answered Beauty,) it would be very\nneedless, for my father shall not suffer upon my account, since\nthe monster will accept of one of his daughters, I will deliver\nmyself up to all his fury, and I am very happy in thinking that\nmy death will save my father’s life, and be a proof of my tender\nlove for him.” “No, sister, (said her three brothers,) that shall not\nbe, we will go find the monster, and either kill him, or perish\nin the attempt.” “Do not imagine any such thing, my sons, (said\nthe merchant,) Beast’s power is so great, that I have no hopes\nof your overcoming him; I am charmed with Beauty’s kind and\ngenerous offer, but I cannot yield to it; I am old, and have not\nlong to live, so can only lose a few years, which I regret for your\nsakes alone, my dear children.” “Indeed, father (said Beauty),\nyou shall not go to the palace without me, you cannot hinder\nme from following you.” It was to no purpose all they could say,\nBeauty still insisted on setting out for the fine palace; and her\nsisters were delighted at it, for her virtue and amiable qualities\nmade them envious and jealous.\nThe merchant was so afflicted at the thoughts of losing his\ndaughter, that he had quite forgot the chest full of gold; but\nat night, when he retired to rest, no sooner had he shut his\nchamber-door, than, to his great astonishment, he found it\nby his bedside; he was determined, however, not to tell his\nchildren that he was grown rich, because they would have\nwanted to return to town, and he was resolved not to leave the\ncountry; but he trusted Beauty with the secret: who informed\nhim, that two gentlemen came in his absence, and courted her\nsisters; she begged her father to consent to their marriage, and 101\ngive them fortunes; for she was so good, that she loved them,\nand forgave them heartily all their ill-usage. These wicked\ncreatures rubbed their eyes with an onion, to force some tears\nwhen they parted with their sister; but her brothers were really\nconcerned. Beauty was the only one who did not shed tears at\nparting, because she would not increase their uneasiness.\nThe horse took the direct road to the palace; and towards\nevening they perceived it illuminated as at first: the horse\nwent of himself into the stable, and the good man and his\ndaughter came into the great hall, where they found a table\nsplendidly served up, and two covers. The merchant had no\nheart to eat; but Beauty endeavoured to appear cheerful, sat\ndown to table, and helped him. Afterwards, thought she to\nherself, “Beast surely has a mind to fatten me before he eats\nme, since he provides such a plentiful entertainment.” When\nthey had supped, they heard a great noise, and the merchant,\nall in tears, bid his poor child farewell, for he thought Beast\nwas coming. Beauty was sadly terrified at his horrid form,\nbut she took courage as well as she could, and the monster\nhaving asked her if she came willingly; “y—e—s,” said she,\ntrembling. “You are very good, and I am greatly obliged to you;\nhonest man, go your ways tomorrow morning, but never think\nof returning here again. Farewell, Beauty.” “Farewell, Beast,”\nanswered she; and immediately the monster withdrew. “Oh,\ndaughter, (said the merchant, embracing Beauty,) I am almost\nfrightened to death; believe me, you had better go back, and\nlet me stay here.” “No, father, (said Beauty, in a resolute tone,)\nyou shall set out tomorrow morning, and leave me to the care\nand protection of Providence.” They went to bed, and thought\nthey should not close their eyes all night; but scarce were they\nlaid down, than they fell fast asleep; and Beauty dreamed, a fine\nlady came, and said to her, “I am content, Beauty, with your Intro to Literature: Fairy Tales and Folk Tales 102\ngood will; this good action of yours, in giving up your own life\nto save your father’s, shall not go unrewarded.” Beauty waked,\nand told her father her dream, and though it helped to comfort\nhim a little, yet he could not help crying bitterly, when he took\nleave of his dear child.\nAs soon as he was gone, Beauty sat down in the great hall,\nand fell a crying likewise; but as she was mistress of a great\ndeal of resolution, she recommended herself to God, and\nresolved not to be uneasy the little time she had to live; for she\nfirmly believed Beast would eat her up that night.\nHowever, she thought she might as well walk about till then,\nand view this fine castle, which she could not help admiring;\nit was a delightful pleasant place, and she was extremely\nsurprised at seeing a door, over which was wrote, “BEAUTY’S\nAPARTMENT.” She opened it hastily, and was quite dazzled\nwith the magnificence that reigned throughout; but what\nchiefly took up her attention, was a large library, a harpsichord,\nand several music books. “Well, (said she to herself,) I see they\nwill not let my time hang heavy on my hands for want of\namusement.” Then she reflected, “Were I but to stay here a\nday, there would not have been all these preparations.” This\nconsideration inspired her with fresh courage; and opening the\nlibrary, she took a book, and read these words in letters of\ngold:—\n“Welcome, Beauty, banish fear,\nYou are queen and mistress here;\nSpeak your wishes, speak your will,\nSwift obedience meets them still.”\n“Alas, (said she, with a sigh,) there is nothing I desire so\nmuch as to see my poor father, and to know what he is doing.”\nShe had no sooner said this, when casting her eyes on a great\nlooking-glass, to her great amazement she saw her own home, 103\nwhere her father arrived with a very dejected countenance;\nher sisters went to meet him, and, notwithstanding their\nendeavours to appear sorrowful, their joy, felt for having got\nrid of their sister, was visible in every feature: a moment after,\nevery thing disappeared, and Beauty’s apprehensions at this\nproof of Beast’s complaisance.\nAt noon she found dinner ready, and while at table, was\nentertained with an excellent concert of music, though without\nseeing any body: but at night, as she was going to sit down\nto supper, she heard the noise Beast made; and could not help\nbeing sadly terrified. “Beauty, (said the monster,) will you give\nme leave to see you sup?” “That is as you please,” answered\nBeauty, trembling. “No, (replied the Beast,) you alone are\nmistress here; you need only bid me be gone, if my presence\nis troublesome, and I will immediately withdraw: but tell me,\ndo not you think me very ugly?” “That is true, (said Beauty,)\nfor I cannot tell a lie; but I believe you are very good-natured.”\n“So I am, (said the monster,) but then, besides my ugliness, I\nhave no sense; I know very well that I am a poor, silly, stupid\ncreature.” “‘Tis no sign of folly to think so, (replied Beauty,)\nfor never did fool know this, or had so humble a conceit of\nhis own understanding.” “Eat then, Beauty, (said the monster,)\nand endeavour to amuse yourself in your palace; for every\nthing here is yours, and I should be very uneasy if you were\nnot happy.” “You are very obliging, (answered Beauty;) I own\nI am pleased with your kindness, and when I consider that,\nyour deformity scarce appears.” “Yes, yes, (said the Beast,) my\nheart is good, but still I am a monster.” “Among mankind, (says\nBeauty,) there are many that deserve that name more than you,\nand I prefer you, just as your are, to those, who, under a human\nform, hide a treacherous, corrupt, and ungrateful heart.” “If I\nhad sense enough, (replied the Beast,) I would make a fine Intro to Literature: Fairy Tales and Folk Tales 104\ncompliment to thank you, but I am so dull, that I can only say,\nI am greatly obliged to you.” Beauty ate a hearty supper, and\nhad almost conquered her dread of the monster; but she had\nliked to have fainted away, when he said to her, “Beauty, will\nyou be my wife?” She was some time before she durst answer;\nfor she was afraid of making him angry, if she refused. At last,\nhowever, she said, trembling, “No, Beast.” Immediately the poor\nmonster began to sigh, and hissed so frightfully, that the whole\npalace echoed. But Beauty soon recovered her fright, for Beast\nhaving said, in a mournful voice, “then farewell, Beauty,” left\nthe room; and only turned back, now and then, to look at her\nas he went out.\nWhen Beauty was alone, she felt a great deal of compassion\nfor poor Beast. “Alas, (said she,) ’tis a thousand pities any thing\nso good-natured should be so ugly.”\nBeauty spent three months very contentedly in the palace:\nevery evening Beast paid her a visit, and talked to her during\nsupper, very rationally, with plain good common sense, but\nnever with what the world calls wit; and Beauty daily\ndiscovered some valuable qualifications in the monster; and\nseeing him often, had so accustomed her to his deformity, that,\nfar from dreading the time of his visit, she would often look\non her watch to see when it would be nine; for the Beast\nnever missed coming at that hour. There was but one thing that\ngave Beauty any concern, which was, that every night, before\nshe went to bed, the monster always asked her, if she would\nbe his wife. One day she said to him, “Beast, you make me\nvery uneasy, I wish I could consent to marry you, but I am\ntoo sincere to make you believe that will ever happen: I shall\nalways esteem you as a friend; endeavour to be satisfied with\nthis.” “I must, said the Beast, for, alas! I know too well my own\nmisfortune; but then I love you with the tenderest affection: 105\nhowever, I ought to think myself happy that you will stay here;\npromise me never to leave me.” Beauty blushed at these words;\nshe had seen in her glass, that her father had pined himself sick\nfor the loss of her, and she longed to see him again. “I could,\n(answered she), indeed promise never to leave you entirely,\nbut I have so great a desire to see my father, that I shall fret\nto death, if you refuse me that satisfaction.” “I had rather die\nmyself, (said the monster,) than give you the least uneasiness:\nI will send you to your father, you shall remain with him, and\npoor Beast will die with grief.” “No, (said Beauty, weeping,) I\nlove you too well to be the cause of your death: I give you\nmy promise to return in a week: you have shewn me that my\nsisters are married, and my brothers gone to the army; only let\nme stay a week with my father, as he is alone.” “You shall be\nthere tomorrow morning, (said the Beast,) but remember your\npromise: you need only lay your ring on the table before you go\nto bed, when you have a mind to come back: farewell, Beauty.”\nBeast sighed as usual, bidding her good night; and Beauty went\nto bed very sad at seeing him so afflicted. When she waked\nthe next morning, she found herself at her father’s, and having\nrang a little bell, that was by her bed-side, she saw the maid\ncome; who, the moment she saw her, gave a loud shriek; at\nwhich the good man ran up stairs, and thought he should have\ndied with joy to see his dear daughter again. He held her fast\nlocked in his arms above a quarter of an hour. As soon as the\nfirst transports were over, Beauty began to think of rising, and\nwas afraid she had no clothes to put on; but the maid told her,\nthat she had just found, in the next room, a large trunk full of\ngowns, covered with gold and diamonds. Beauty thanked good\nBeast for his kind care, and taking one of the plainest of them,\nshe intended to make a present of the others to her sisters.\nShe scarce had said so, when the trunk disappeared. Her father Intro to Literature: Fairy Tales and Folk Tales 106\ntold her, that Beast insisted on her keeping them herself; and\nimmediately both gowns and trunk came back again.\nBeauty dressed herself; and in the mean time they sent to her\nsisters, who hasted thither with their husbands. They were both\nof them very unhappy. The eldest had married a gentleman,\nextremely handsome indeed, but so fond of his own person,\nthat he was full of nothing but his own dear self, and neglected\nhis wife. The second had married a man of wit, but he only\nmade use of it to plague and torment every body, and his wife\nmost of all. Beauty’s sisters sickened with envy, when they\nsaw her dressed like a Princess, and more beautiful than ever;\nnor could all her obliging affectionate behaviour stifle their\njealousy, which was ready to burst when she told them how\nhappy she was. They went down into the garden to vent it in\ntears; and said one to the other, “In what is this little creature\nbetter than us, that she should be so much happier?” “Sister,\nsaid the eldest, a thought just strikes my mind; let us endeavour\nto detain her above a week, and perhaps the silly monster will\nbe so enraged at her for breaking her word, that he will devour\nher.” “Right, sister, answered the other, therefore we must shew\nher as much kindness as possible.” After they had taken this\nresolution, they went up, and behaved so affectionately to their\nsister, that poor Beauty wept for joy. When the week was\nexpired, they cried and tore their hair, and seemed so sorry to\npart with her, that she promised to stay a week longer.\nIn the mean time, Beauty could not help reflecting on herself\nfor the uneasiness she was likely to cause poor Beast, whom\nshe sincerely loved, and really longed to see again. The tenth\nnight she spent at her father’s, she dreamed she was in the\npalace garden, and that she saw Beast extended on the grass-\nplot, who seemed just expiring, and, in a dying voice,\nreproached her with her ingratitude. Beauty started out of her 107\nsleep and bursting into tears, “Am not I very wicked, (said she)\nto act so unkindly to Beast, that has studied so much to please\nme in every thing? Is it his fault that he is so ugly, and has so\nlittle sense? He is kind and good, and that is sufficient. Why did\nI refuse to marry him? I should be happier with the monster\nthan my sisters are with their husbands; it is neither wit nor\na fine person in a husband, that makes a woman happy; but\nvirtue, sweetness of temper, and complaisance: and Beast has\nall these valuable qualifications. It is true, I do not feel the\ntenderness of affection for him, but I find I have the highest\ngratitude, esteem, and friendship; and I will not make him\nmiserable; were I to be so ungrateful, I should never forgive\nmyself.” Beauty having said this, rose, put her ring on the table,\nand then laid down again; scarce was she in bed before she\nfell asleep; and when she waked the next morning, she was\noverjoyed to find herself in the Beast’s palace. She put on one of\nher richest suits to please him, and waited for evening with the\nutmost impatience; at last the wished-for hour came, the clock\nstruck nine, yet no Beast appeared. Beauty then feared she had\nbeen the cause of his death; she ran crying and wringing her\nhands all about the palace, like one in despair; after having\nsought for him every where, she recollected her dream, and\nflew to the canal in the garden, where she dreamed she saw\nhim. There she found poor Beast stretched out, quite senseless,\nand, as she imagined, dead. She threw herself upon him\nwithout any dread, and finding his heart beat still, she fetched\nsome water from the canal, and poured it on his head. Beast\nopened his eyes, and said to Beauty, “You forgot your promise,\nand I was so afflicted for having lost you, that I resolved to\nstarve myself; but since I have the happiness of seeing you\nonce more, I die satisfied.” “No, dear Beast, (said Beauty,) you\nmust not die; live to be my husband; from this moment I Intro to Literature: Fairy Tales and Folk Tales 108\ngive you my hand, and swear to be none but yours. Alas! I\nthought I had only a friendship for you, but, the grief I now feel\nconvinces me, that I cannot live without you.” Beauty scarcely\nhad pronounced these words, when she saw the palace sparkle\nwith light; and fireworks, instruments of music, every thing,\nseemed to give notice of some great event: but nothing could\nfix her attention; she turned to her dear Beast, for whom she\ntrembled with fear; but how great was her surprise! Beast\nhad disappeared, and she saw, at her feet, one of the loveliest\nPrinces that eye ever beheld, who returned her thanks for\nhaving put an end to the charm, under which he had so long\nresembled a Beast. Though this Prince was worthy of all her\nattention, she could not forbear asking where Beast was. “You\nsee him at your feet, (said the Prince): a wicked fairy had\ncondemned me to remain under that shape till a beautiful\nvirgin should consent to marry me: the fairy likewise enjoined\nme to conceal my understanding; there was only you in the\nworld generous enough to be won by the goodness of my\ntemper; and in offering you my crown, I can’t discharge the\nobligations I have to you.” Beauty, agreeably surprised, gave\nthe charming Prince her hand to rise; they went together into\nthe castle, and Beauty was overjoyed to find, in the great hall,\nher father and his whole family, whom the beautiful lady, that\nappeared to her in her dream, had conveyed thither.\n“Beauty, (said this lady,) come and receive the reward of\nyour judicious choice; you have preferred virtue before either\nwit or beauty, and deserve to find a person in whom all these\nqualifications are united: you are going to be a great Queen; I\nhope the throne will not lessen your virtue, or make you forget\nyourself. As to you, ladies, (said the Fairy to Beauty’s two\nsisters,) I know your hearts, and all the malice they contain:\nbecome two statues; but, under this transformation, still retain 109\nyour reason. You shall stand before your sister’s palace gate,\nand be it your punishment to behold her happiness; and it\nwill not be in your power to return to your former state till\nyou own your faults; but I am very much afraid that you will\nalways remain statues. Pride, anger, gluttony, and idleness, are\nsometimes conquered, but the conversion of a malicious and\nenvious mind is a kind of miracle.” Immediately the fairy gave a\nstroke with her wand, and in a moment all that were in the hall\nwere transported into the Prince’s palace. His subjects received\nhim with joy; he married Beauty, and lived with her many\nyears; and their happiness, as it was founded on virtue, was\ncomplete.\nFINIS\nProject Gutenberg's Beauty and the Beast,\nby Marie Le Prince de Beaumont\nhttp:\/\/www.gutenberg.org\/7\/0\/7\/7074\/\nThis eBook is for the use of anyone anywhere at no cost and with\nalmost no restrictions whatsoever. You may copy it, give it away or\nre-use it under the terms of the Project Gutenberg License included\nwith this eBook or online at www.gutenberg.org Intro to Literature: Fairy Tales and Folk Tales 110\nThe Frog-King;\n10.\nOr, Iron Henry\nIn old times, when wishing was having, there lived a King\nwhose daughters were all beautiful, but the youngest was so\nbeautiful that the sun itself, which has seen so much, was\nastonished whenever it shone in her face.\nClose by the King’s castle lay a great dark forest, and under\nan old lime-tree in the forest, was a fountain. When the day\nwas very warm, the King’s Child went out into the forest and\nsat down by the side of the cool fountain, and when she was\ndull she took a golden ball, and threw it up in the air and caught\nit. And this ball was her favorite plaything.\nNow, it so happened one day, the King’s Daughter’s golden\nball did not fall into the little hand which she was holding up\nfor it, but on to the ground, and rolled straight into the water.\nThe King’s Daughter followed it with her eyes; but it vanished,\nand the well was deep, so deep that the bottom could not14 be\nseen. On this she began to cry, and cried louder and louder, and\ncould not be comforted.\n110 111\nAnd as she thus lamented, some one said to her, “What ails\nyou, King’s Daughter? You weep so that even a stone would\nshow pity.”\nShe looked round to the side from whence the voice came,\nand saw a Frog stretching its thick, ugly head from the water.\n“Ah! old water-splasher, is it you?” said she; “I am weeping for\nmy golden ball, which has fallen into the fountain.”\n“Be quiet, and do not weep,” answered the Frog, “I can help\nyou. But what will you give me if I bring your plaything up\nagain?”\n“Whatever you will have, dear Frog,” said she—“my clothes,\nmy pearls and jewels, and even the golden crown which I am\nwearing.”\nThe Frog answered, “I do not care for your clothes, your\npearls and jewels, or your golden crown, but if you will love me\nand let me be your companion and playfellow, and sit by you at\nyour little table, and eat off your little golden plate, and drink\nout of your little cup, and sleep in your little bed—if you will\npromise me this, I will go down below, and bring your golden\nball up again.”\n“Oh, yes,” said she, “I promise you all you wish, if you will\nbut bring my ball back again.” She, however, thought, “How the\nsilly Frog does talk! He lives in the water with the other frogs\nand croaks, and can be no companion to any human being!”\nBut the Frog, when he had received this promise, put his\nhead into the water and sank down. In a short time he came15\nswimming up again with the ball in his mouth, and threw it on\nthe grass. The King’s Daughter was delighted to see her pretty\nplaything once more, and picked it up, and ran away with it.\n“Wait, wait,” said the Frog. “Take me with you. I can’t run as\nyou can.” But what did it avail him to scream his croak, croak,\nafter her, as loudly as he could? She did not listen to it, but ran Intro to Literature: Fairy Tales and Folk Tales 112\nhome and soon forgot the poor Frog, who was forced to go back\ninto his fountain again.\nThe next day, when she had seated herself at table with the\nKing and all the courtiers, and was eating from her little golden\nplate, something came creeping splish splash, splish splash, up\nthe marble staircase. When it got to the top, it knocked at the\ndoor, and cried:\n“King’s Daughter, youngest.\nOpen the door!”\nShe ran to see who was outside, but when she opened the\ndoor, there sat the Frog in front of it. Then she slammed the\ndoor in great haste, sat down to dinner again, and was quite\nfrightened.\nThe King saw plainly that her heart was beating violently,\nand said, “My Child, what are you so afraid of? Is there a Giant\noutside who wants to carry you away?”\n“Ah, no,” replied she, “it is no Giant, but a disgusting Frog.”\n“What does the Frog want with you?”\n“Ah, dear Father, yesterday when I was in the forest sitting\nby the fountain, playing, my golden ball fell into the16 water.\nAnd because I cried so, the Frog brought it out again for me.\nAnd because he insisted so on it, I promised him he should be\nmy companion; but I never thought he would be able to come\nout of the water! And now he is here, and wants to come in.”\nIn the meantime, it knocked a second time, and cried:\n“King’s Daughter, youngest!\nOpen to me!\nDon’t you remember yesterday,\nAnd all that you to me did say,\nBeside the cooling fountain’s spray?\nKing’s Daughter, youngest!\nOpen to me!” 113\nThen said the King, “That which you have promised you\nmust perform. Go and let him in.”\nShe went and opened the door, and the Frog hopped in and\nfollowed her, step by step, to her chair. There he sat still and\ncried, “Lift me up beside you.”\nShe delayed, until at last the King commanded her to do it.\nWhen the Frog was once on the chair, he wanted to be on the\ntable, and when he was on the table, he said, “Now, push your\nlittle golden plate nearer to me that we may eat together.”\nShe did this, but it was easy to see that she did not do\nit willingly. The Frog enjoyed what he ate, but almost every\nmouthful she took, choked her.\nAt length he said, “I have eaten and am satisfied. Now I am\ntired, carry me into your little room and make your little silken\nbed ready; and we will both lie down and go to sleep.”\nThe King’s Daughter began to cry, for she was afraid of the17\ncold Frog, which she did not like to touch, and which was now\nto sleep in her pretty, clean little bed.\nBut the King grew angry and said, “He who helped you when\nyou were in trouble, ought not afterward to be despised.”\nSo she took hold of the Frog with two fingers, carried him\nupstairs, and put him in a corner. But when she was in bed, he\ncrept to her and said, “I am tired, I want to sleep as well as you;\nlift me up or I will tell your father.”\nThen she was terribly angry, and took him up and threw him\nwith all her might against the wall.\n“Now, you will be quiet, odious Frog,” said she.\nBut when he fell down, he was no Frog but a King’s Son with\nbeautiful kind eyes!\nHe, by her father’s will, was now her dear companion and\nhusband. Then he told her how he had been bewitched by a\nwicked Witch, and how no one could have delivered him from Intro to Literature: Fairy Tales and Folk Tales 114\nthe fountain but herself, and that to-morrow they would go\ntogether into his kingdom.\nThen they went to sleep, and next morning when the sun\nawoke them, a coach came rolling up drawn by eight white\nhorses, with white ostrich feathers on their heads. They were\nharnessed with golden chains, and behind stood the young\nKing’s servant, Faithful Henry. Faithful Henry had been so\nunhappy when his master was changed into a Frog, that he had\nthree iron bands laid round his heart, lest it should burst with\ngrief and sadness.\nThe coach was to conduct the young King into his kingdom.\nFaithful Henry helped them both in, and placed himself behind\nagain, and was full of joy because of this deliverance.18 And\nwhen they had driven a part of the way, the King’s Son heard a\ncracking behind him as if something had broken. So he turned\nround and cried:\n“Henry, the coach does break!”\n“No, no, my lord, you do mistake!\nIt is the band around my heart,\nThat felt such great and bitter smart,\nWhen you were in the fountain strange,\nWhen you into a Frog were changed!”\nAgain and once again, while they were on their way,\nsomething cracked; and each time the King’s Son thought the\ncarriage was breaking. But it was only the bands which were\nspringing from the heart of Faithful Henry because his master\nwas set free and was happy.\nThe Project Gutenberg EBook of Grimm's Fairy Tales,\nby Various\nhttp:\/\/www.gutenberg.org\/5\/2\/5\/2\/52521\/\nThis eBook is for the use of anyone anywhere at no cost and with 115\nalmost no restrictions whatsoever. You may copy it, give it away or\nre-use it under the terms of the Project Gutenberg License included\nwith this eBook or online at www.gutenberg.org Intro to Literature: Fairy Tales and Folk Tales 116\nThe Tiger's\n11.\nBride\nRead “The Tiger’s Bride” By angela Carter*\nNote: This reading is on electronic course reserves and may\nrequire you to use your UWF log-in if you are not logged in\nalready.\n116 117\nChonguita\n12.\nNarrated by Pilar Ejercito, a Tagalog from\nPagsanjan, Laguna. She heard the story from her\naunt, who had heard it when she was still a little\ngirl.\nThere was a king who had three sons, named Pedro, Diego, and\nJuan. One day the king ordered these three gentlemen to set out\nfrom the kingdom and seek their fortunes. The three brothers\ntook different directions, but before they separated they agreed\nto meet in a certain place in the forest.\nAfter walking for many days, Don Juan met an old man on\nthe road. This old man gave Don Juan bread, and told him to\ngo to a palace which was a mile away. “But as you enter the\ngate,” said the old man, “you must divide the bread which I have\ngiven you among the monkeys which are guarding the gate to\nthe palace; otherwise you will not be able to enter.”\nDon Juan took the bread; and when he reached the palace, he\ndid as the old man had advised him. After entering the gate, he\n117 Intro to Literature: Fairy Tales and Folk Tales 118\nsaw a big monkey. Frightened at the sight of the animal, Don\nJuan was about to tun away, when the animal called to him,\nand said, “Don Juan, I know that your purpose in coming here\nwas to find your fortune; and at this very moment my daughter\nChonguita will marry you.” The archbishop of the monkeys\nwas called, and Don Juan and Chonguita were married without\ndelay.\nA few days afterwards Don Juan asked permission from his\nwife to go to the place where he and his brothers had agreed\nto meet. When Chonguita’s mother heard that Don Juan was\ngoing away, she said to him, “If you are going away, take\nChonguita with you.” Although Don Juan was ashamed to go\nwith Chonguita because she was a monkey, he was forced to\ntake her, and they set out together. When Don Juan met his\ntwo brothers and their beautiful wives at the appointed place,\nhe could not say a word. Don Diego, noticing the gloomy\nappearance of his brother, said, “What is the matter with you?\nWhere is your wife, Don Juan?”\nDon Juan sadly replied, “Here she is.”\n“Where?” asked Don Pedro.\n“Behind me,” replied Don Juan.\nWhen Don Pedro and Don Diego saw the monkey, they\nwere very much surprised. “Oh!” exclaimed Don Pedro, “what\nhappened to you? Did you lose your head?”\nDon Juan could say nothing to this question. At last,\nhowever, he broke out, “Let us go home! Our father must be\nwaiting for us.” So saying, Don Juan turned around and began\nthe journey. Don Pedro and Don Diego, together with their\nwives, followed Don Juan. Chonguita walked by her husband’s\nside.\nWhen the return of the three brothers was announced to\nthe king, the monarch hastened to meet them on the stairs. 119\nUpon learning that one of his sons had married a monkey, the\nking fainted; but after he had recovered his senses, he said to\nhimself, “This misfortune is God’s will. I must therefore bear it\nwith patience.” The king then assigned a house to each couple\nto live in.\nBut the more the king thought of it, the greater appeared\nto be the disgrace that his youngest son had brought on the\nfamily. So one day he called his three sons together, and said to\nthem, “Tell your wives that I want each one of them to make me\nan embroidered coat. The one who falls to do this within three\ndays will be put to death.” Now, the king issued this order in the\nhope that Chonguita would be put to death, because he thought\nthat she would not be able to make the coat; but his hope was\ndisappointed. On the third day his daughters-in-law presented\nto him the coats that they had made, and the one embroidered\nby Chonguita was the prettiest of all.\nStill anxious to get rid of the monkey-wife, the king next\nordered his daughters-in-law to embroider a cap for him in two\ndays, under penalty of death in case of failure. The caps were\nall done on time.\nAt last, thinking of no other way by which he could\naccomplish his end, the king summoned his three daughters-\nin-law, and said, “The husband of the one who shall be able to\ndraw the prettiest picture on the walls of my chamber within\nthree days shall succeed me on the throne.” At the end of the\nthree days the pictures were finished. When the king went\nto inspect them, he found that Chonguita’s was by far the\nprettiest, and so Don Juan was crowned king.\nA great feast was held in the palace in honor of the new king.\nIn the midst of the festivities Don Juan became very angry with\nhis wife for insisting that he dance with her, and he hurled her\nagainst the wall. At this brutal action the hall suddenly became Intro to Literature: Fairy Tales and Folk Tales 120\ndark; but after a while it became bright again, and Chonguita\nhad been transformed into a beautiful woman.\nNotes.\nA Visayan variant of this story, though differing from it in\nmany details, is the story of the “Three Brothers,” printed in\nJAFL 20 : 91–93.\nA number of Indian Märchen seem to be related more or less\nclosely to our story. Benfey cites one (1 : 261) which appears in\nthe “Asiatic Journal” for 1833.\nSome princes are to obtain their wives by this device:\neach is to shoot an arrow; and where the arrow\nstrikes, there will each find his bride. The arrow of\nthe youngest hits a tamarind-tree; he is married to\nit, but his bride turns out to be a female monkey.\nHowever, he lives happily with her, but she never\nappears at his father’s court. The sisters-in-law are\ncurious to know what kind of wife he has. They\npersuade the father-in-law to give a least for all his\nsons’ wives. The prince is grieved over the fact that\nthe secret will come out. Then his wife comforts him;\nshe lays off her monkey covering, and appears as a\nmarvellously beautiful maiden. She enjoins him to\npreserve the monkey-skin carefully, since otherwise\ngreat danger threatens her; but he, in order to keep\nher in her present beautiful human form, burns the\nhide while she is at the feast. She disappears\ninstantly. The prince seeks her again, and at last\ndiscovers her in heaven as the queen of the monkeys.\nThere he remains with her. 121\nIn a Simla tale, “The Story of Ghose” (Dracott, 40 f.), the animal\nis a squirrel, which is finally changed by the god Mahadeo into\na human being, after the little creature has performed many\nservices for her husband. Somewhat analogous, also, is Maive\nStokes, “The Monkey Prince” (No. x, p. 41 ff.). Compare also\nthe notes to our No. 19 and Benfey’s entire discussion of “The\nEnchanted Son of the Brahman” (1 : 254–269).\nThese forms are not close enough to our version, however, to\njustify our tracing it directly to any one of them. Both it and\nthe Visayan variant are members of the European cycle of tales\nrepresented by Grimm’s “Three Feathers” (No. 63). The skeleton\noutline of this family group Bolte and Polívka construct as\nfollows (2 : 37):—\nA father wishes to test the skill of his three sons\n(or their wives), and requests that they produce\nextraordinary or costly articles. The despised\nyoungest son wins the reward with the help of an\nenchanted princess in the form of a cat, rat, frog,\nlizard, monkey, or as a doll, or night-cap, or stocking.\nAt last she regains her human form. The\ndisenchantment is sometimes accomplished by a kiss,\nor by beheading, or by the hero’s enduring for three\nnights in silence the blows of spirits.\nIn only two of the variants cited by Bolte-Polívka (to Grimm,\nNo. 63) is the animal wife a monkey,—Comparetti, No. 58, “Le\nScimmie;” and Von Hahn, No. 67, “Die Aeffin.” Of these, only\nthe Greek story resembles our tale; but here the similarities are\nso many, that I will summarize briefly the main points of Von\nHahn’s version:— Intro to Literature: Fairy Tales and Folk Tales 122\nAn old king once called his three sons to him, and\nsaid, “My sons, I am old; I should like to have you\nmarried, so that I may celebrate your wedding with\nyou before I die. Therefore each of you are to shoot\nan arrow into the air, and to follow its course, for\nthere each will find what is appointed for him.” The\neldest shot first: his arrow carried him to a king’s\ndaughter, whom he married. The second obtained a\nprince’s daughter. But the arrow of the third stuck in\na dung-hill. He dug a hole in it, and came to a marble\nslab, which, when raised, disclosed a flight of stairs\nleading down. Courageously he descended, and came\nto a cellar in which a lot of monkeys were sitting in\na circle. The mother of the monkeys approached him,\nand asked him what he wanted. He answered, that,\naccording to the flight of his arrow, he was destined\nto have a monkey-wife. “Choose one for yourself,”\nshe said. “Here sit my maids; there, my daughters.”\nHe selected one, and took her back to his father. His\nbrothers, however, ridiculed him.\nAfter a time the eldest son asked the king to divide\nup his kingdom, as he was already old and was likely\nto die. “I’ll give you three tasks,” said the king to\nhis sons. “The one who performs them best shall be\nking.” The first count was to be won by the son whose\nhouse forty days thence was cleanest and most\nbeautifully adorned. The youngest son was very sad\nwhen inspection-time approached. “Why so sad?”\nsaid his wife. He told her; and she said to him on\nthe morning of the last day, “Go to my mother, and\nask her for a hazel-nut and an almond.” He did so.\nWhen the time for inspection arrived, the monkey- 123\nwife cracked the hazel-nut and drew from it a\ndiamond covering for the whole house. From the\nalmond she drew a very [248]beautiful carpet for the\nking to walk on. Youngest son won the first count,\nnaturally. The second task was to furnish the king\nwith fresh fruits in the winter-time. The two oldest\nsons were unable to get any, but the youngest son got\na fine supply from the monkeys’ garden under the\ndunghill. The third count was to be won by the son\nwhose wife should be declared the most beautiful at\na feast to be given ten days thence. The monkey-wife\nsent her husband again for an almond, a hazel-nut,\ntwo stallions, and five servants. When he returned\nwith them, she cracked the almond and drew from it\na magnificent dress for herself. From the hazelnut she\ndrew her own beauty, and handsome equipment for\nher husband. When she was arrayed, she rode into\nthe courtyard of the king, and tried to escape without\nbeing recognized; but the king was too quick for her:\nshe was caught, and her husband was declared the\nfinal winner. He became king when his father died.\nThis Greek story can hardly have any immediate relationship\nwith “Chonguita,” though it does appear in its first half to\nbe connected with the 1833 Indian Märchen given above. Our\nstory, it will be noticed, lacks the shooting of arrows, so\ncharacteristic of the European forms; it mentions the monkey-\nkingdom to which the youngest prince was directed by an\nold man, and where Chonguita is forced on him; it represents\nthe king as requiring his daughters-in-law to perform difficult\ntasks because he wishes to find an excuse for putting to death\nthe animal-wife. Moreover, the three tasks themselves are Intro to Literature: Fairy Tales and Folk Tales 124\ndifferent, although the first two are reminiscent of some found\nin the Occidental versions. For the third I know of no folk-tale\nparallel. On the whole, I am prone to believe that our story was\nnot imported from Europe, but that it belongs to an Oriental\nbranch of the family.\nThe disenchantment of the monkey-wife by hurling her in\nanger against the wall is exactly like the disenchantment of the\nfrog-prince in Grimm, No. 1. This conceit is most unusual, and,\nit might be added, unreasonable. Hence this identity of detail\nin two stories so far removed in every other way is particularly\nstriking. I know of no further occurrences of the incident.\nProject Gutenberg's Filipino Popular Tales,\nby Dean S. Fanler\nhttp:\/\/www.gutenberg.org\/8\/2\/9\/8299\/\nThis eBook is for the use of anyone anywhere at\nno cost and with almost no restrictions whatsoever.\nYou may copy it, give it away or re-use it under\nthe terms of the Project Gutenberg License included\nwith this eBook or online at www.gutenberg.org 125\nThe Fisher-Boy\n13.\nUrashima\nby Anonymous\nTranslated by B. H. Chamberlain\nLONG, long ago there lived on the coast of the sea of Japan a\nyoung fisherman named Urashima, a kindly lad and clever\nwith his rod and line.\n125 Intro to Literature: Fairy Tales and Folk Tales 126\nWell, one day he went out in his boat to fish. But instead of\ncatching any fish, what do you think he caught? Why! a great\nbig tortoise, with a hard shell and such a funny wrinkled old\nface and a tiny tail. Now I must tell you something which very\nlikely you don’t know; and that is that tortoises always live\na thousand years,—at least Japanese tortoises do. So Urashima\nthought to himself: “A fish would do for my dinner just as well\nas this tortoise,—in fact better. Why should I go and kill the\npoor thing, and prevent it from enjoying itself for another nine\nhundred and ninety-nine years? No, no! I won’t be so cruel. I\nam sure mother wouldn’t like me to.” And with these words, he\nthrew the tortoise back into the sea. 127\nThe next thing that happened was that Urashima went to sleep\nin his boat; for it was one of those hot summer days when\nalmost everybody enjoys a nap of an afternoon. And as he slept,\nthere came up from beneath the waves a beautiful girl, who got\ninto the boat and said: “I am the daughter of the Sea-God, and\nI live with my father in the Dragon Palace beyond the waves.\nIt was not a tortoise that you caught just now, and so kindly\nthrew back into the water instead of killing it. It was myself.\nMy father the Sea-God had sent me to see whether you were\ngood or bad. Intro to Literature: Fairy Tales and Folk Tales 128\n“We now know that you are a good, kind boy who doesn’t like\nto do cruel things; and so I have come to fetch you. You shall\nmarry me, if you like; and we will live happily together for a\nthousand years in the Dragon Palace beyond the deep blue sea.”\nSo Urashima took one oar, and the Sea-God’s daughter took the\nother; and they rowed, and they rowed, and they rowed till at\nlast they came to the Dragon Palace where the Sea-God lived\nand ruled as King over all the dragons and the tortoises and the\nfishes.\nOh dear! what a lovely place it was! The walls of the Palace\nwere of coral, the trees had emeralds for leaves and rubies for\nberries, the fishes’ scales were of silver, and the dragons’ tails\nof solid gold. Just think of the very most beautiful, glittering\nthings that you have ever seen, and put them all together, and\nthen you will know what this Palace looked like. And it all 129\nbelonged to Urashima; for was he not the son-in-law of the Sea-\nGod, the husband of the lovely Dragon Princess? Intro to Literature: Fairy Tales and Folk Tales 130\nWell, they lived on happily for three years, wandering about\nevery day among the beautiful trees with emerald leaves and\nruby berries. But one morning Urashima said to his wife: “I am\nvery happy here. Still I want to go home and see my father and\nmother and brothers and sisters. Just let me go for a short time,\nand I’ll soon be back again.” “I don’t like you to go,” said she;\n“I am very much afraid that something dreadful will happen.\nHowever, if you will go, there is no help for it. Only you must\ntake this box, and be very careful not to open it. If you open it,\nyou will never be able to come back here.” 131\nSo Urashima promised to take great care of the box, and not\nto open it on any account; and then, getting into his boat, he\nrowed off, and at last landed on the shore of his own country.\nBut what had happened while he had been away? Where had\nhis father’s cottage gone to? What had become of the village\nwhere he used to live? The mountains indeed were there as\nbefore; but the trees on them had been cut down. The little\nbrook that ran close by his father’s cottage was still running;\nbut there were no women washing clothes in it any more. It\nseemed very strange that everything should have changed so\nmuch in three short years. So as two men chanced to pass\nalong the beach, Urashima went up to them and said: “Can\nyou tell me please where Urashima’s cottage, that used to stand\nhere, has been moved to?”—“Urashima?” said they; “why! it\nwas four hundred years ago that he was drowned out fishing.\nHis parents, and his brothers, and their grandchildren are all\ndead long ago. It is an old, old story. How can you be so foolish\nas to ask after his cottage? It fell to pieces hundreds of years\nago.” Intro to Literature: Fairy Tales and Folk Tales 132\nThen it suddenly flashed across Urashima’s mind that the Sea-\nGod’s Palace beyond the waves, with its coral walls and its\nruby fruits and its dragons with tails of solid gold, must be\npart of fairy-land, and that one day there was probably as\nlong as a year in this world, so that his three years in the\nSea-God’s Palace had really been hundreds of years. Of course\nthere was no use in staying at home, now that all his friends\nwere dead and buried, and even the village had passed away.\nSo Urashima was in a great hurry to get back to his wife,\nthe Dragon Princess beyond the sea. But which was the way?\nHe couldn’t find it with no one to show it to him. “Perhaps,”\nthought he, “if I open the box which she gave me, I shall be\nable to find the way.” So he disobeyed her orders not to open\nthe box,—or perhaps he forgot them, foolish boy that he was.\nAnyhow he opened the box; and what do you think came out\nof it? Nothing but a white cloud which floated away over the\nsea. Urashima shouted to the cloud to stop, rushed about and\nscreamed with sorrow; for he remembered now what his wife\nhad told him, and how, after opening the box, he should never\nbe able to go to the Sea-God’s Palace again. But soon he could\nneither run nor shout any more. 133\nSuddenly his hair grew as white as snow, his face got wrinkled,\nand his back bent like that of a very old man. Then his breath\nstopped short, and he fell down dead on the beach.\nPoor Urashima! He died because he had been foolish and\ndisobedient. If only he had done as he was told, he might have\nlived another thousand years. Wouldn’t you like to go and see\nthe Dragon Palace beyond the waves, where the Sea-God lives\nand rules as King over the Dragons and the tortoises and the\nfishes, where the trees have emeralds for leaves and rubies for\nberries, where the fishes’ tails are of silver and the dragons’\ntails all of solid gold? Intro to Literature: Fairy Tales and Folk Tales 134\nPrinted by the Kobunsha in Tokyo, Japan. 135\nProject Gutenberg EBook of The Fisher-Boy Urashima,\nby Anonymous\nhttps:\/\/www.gutenberg.org\/3\/0\/0\/2\/30024\/\nThis eBook is for the use of anyone anywhere at\nno cost and with almost no restrictions whatsoever.\nYou may copy it, give it away or re-use it under\nthe terms of the Project Gutenberg License included\nwith this eBook or online at www.gutenberg.org Intro to Literature: Fairy Tales and Folk Tales 136\nThe Swan\n14.\nMaiden\nby herman Hofberg,\ntranslated by W.H. Myers\n136 137\n1\n1.\n* Stories of elvemaidens, who have married humans, lived with them\nsome time and then vanished, are not uncommon in Sweden. One such from\nSmåland is related of a priest whose son held office under him as curate. One\nmorning when the young man wakened he saw the sun streaming into his Intro to Literature: Fairy Tales and Folk Tales 138\nА young peasant, in the parish of Mellby, who often amused\nhimself with hunting, saw one day three swans flying\ntoward him, which settled down upon the strand of\na sound near by.\nApproaching the place, he was astonished at\nseeing the three swans divest themselves of their\nfeathery attire, which they threw into the grass,\nand three maidens of dazzling beauty step forth and\nspring into the water.\nAfter sporting in the waves awhile they returned\nto the land, where they resumed their former garb\nand shape and flew away in the same direction\nfrom which they came.\nOne of them, the youngest and fạirest, had, in the\nmeantime, so smitten the young hunter that neither\nnight nor day could he tear his thoughts from the\nbright image.\nHis mother, noticing that something was wrong\nwith her son, and that the chase, which had\nformerly been his favorite pleasure, had lost its\nattractions, asked him finally the cause of his\napartment through a knot hole in the wall. Suddenly there entered, as if on a\nsunbeam, a maiden, who stood before him as naked as Eve in the garden of\nEden. He hurriedly threw a cloak over the beautiful apparition and\nconducted her down to his parents. Who she was or where she came from,\nneither she nor any other could tell. After a time she became the wife of the\nyoung priest and lived happily with him a number of years. But one day he\nwas relating to her the wonderful manner of her coming, and to confirm his\naccount removed the plug from the knot hole, whereupon she instantly, as\nsuddenly and mysteriously as she had come, vanished, leaving him in\nsorrow and despair. 139\nmelancholy, whereupon he related to her what he\nhad seen, and declared that there was no longer any\nhappiness in this life for him if he could not possess\nthe fair swan maiden.\nNothing is easier,” said the mother. “Go at sunset\nnext Thursday evening to the place where you last\nsaw her. When the three swans come give attention\nto where your chosen one lays her feathery garb,\ntake it and hasten away.”\nThe young man listened to his mother’s\ninstructions, and, betaking himself, the following\nThursday evening, to a convenient hiding place\nnear the sound, he waited, with impatience, the\ncoming of the swans. The sun was just sinking\nbehind the trees when the young man’s ears were\ngreeted by a whizzing in the air, and the three\nswans settled down upon the beach, as on their\nformer visit.\nAs soon as they had laid off their swan attire they\nwere again transformed into the most beautiful\nmaidens, and, springing out upon the white sand,\nthey were soon enjoying themselves in the water.\nFrom his hiding place the young hunter had\ntaken careful note of where his enchantress had\nlaid her swan feathers. Stealing softly forth, he took\nthem and returned to his place of concealment in\nthe surrounding foliage.\nSoon thereafter two of the swans were heard to\nfly a way, but the third, in search of her clothes,\ndiscovered the young man, before whom, believing Intro to Literature: Fairy Tales and Folk Tales 140\nhim responsible for their disappearance, she fell\nupon her knees and prayed that her swan attire\nmight be returned to her. The hunter was, however,\nunwilling to yield the beautiful prize, and, casting a\ncloak around her shoulders, carried her home.\nPreparations were soon made for a magnificent\nwedding, which took place in due form, and the\nyoung couple dwelt lovingly and contentedly\ntogether.\nOne Thursday evening, seven years later, the\nhunter related to her how he had sought and won\nhis wife. He brought forth and showed her, also,\nthe white swan feathers of her former days. No\nsooner were they placed in her hands than she was\ntransformed once more into a swan, and instantly\ntook flight through the open window. In breathless\nastonishment, the man stared wildly after his\nrapidly vanishing wife, and before a year and a\nday had passed, he was laid, with his longings and\nsorrows, in his allotted place in the village church-\nyard.\nAttribution\nTitle: \"The Swan Maiden\"\nAuthor: Hofberg, Herman\nSource: Hofberg, Herman. Swedish Fairy Tales.\nTranslated by W.H. Myers, Bedford-Clarke Co., 1890.\nLicense: Public Domain\nFrom TOTA Curated Archives: This group houses a collection\nof articles pulled from the public domain. They focus on\nprimary sources showing individual viewpoints and\nimportant cultural works. Please note that some articles 141\ncollected here contain outdated ideas, terms, and viewpoints.\nThe authors here do not represent TOTA's opinions or\npositions but have been offered for the historic value\nof their observations.\nhttps:\/\/www.tota.world\/article\/998\/ Intro to Literature: Fairy Tales and Folk Tales 142\nThe Sleeping\n15.\nBeauty in the\nWood\nfrom The Fairy Tales of Charles Perrault,\nillustrated by Harry Clarke with an\nintroduction by Thomas Bodkin.\nThere were formerly a King and a Queen, who were so sorry\nthat they had no children, so sorry that it cannot be expressed.\nThey went to all the waters in the world; vows, pilgrimages,\nall ways were tried and all to no purpose. At last, however, the\nQueen proved with child, and was brought to bed of a daughter.\nThere was a very fine christening; and the Princess had for\nher godmothers all the Fairies they could find in the whole\nkingdom (they found seven), that every one of them might\ngive her a gift, as was the custom of Fairies in those days, and\n142 143\nthat by this means the Princess might have all the perfections\nimaginable.\nAfter the ceremonies of\nthe christening were over, all\nthe company returned to the\nKing’s palace, where was\nprepared a great feast for the\nFairies. There was placed\nbefore every one of them a\nmagnificent cover with a\ncase of massive gold,\nwherein were a spoon, knife\nand fork, all of pure gold set\nwith diamonds and rubies.\nBut as they were all sitting\ndown at table, they saw “At this very instant the young fairy\ncome into the hall a very old came out from behind the hangings.”\nFairy whom they had not\ninvited, because it was above fifty years since she had been out\nof a certain tower, and she was believed to be either dead or\ninchanted. The King ordered her a cover, but could not furnish\nher with a case of gold as the others, because they had seven\nonly made for the seven Fairies. The old Fairy fancied she was\nslighted, and muttered some threat between her teeth. One of\nthe young Fairies, who sat by her, overheard how she\ngrumbled; and judging that she might give the little Princess\nsome unlucky gift, went, as soon as they rose from the table,\nand hid herself behind the hangings, that she might speak last,\nand repair, as much as possible she could, the evil which the old\nFairy might intend.\nIn the mean while all the Fairies began to give their gifts to\nthe Princess. The youngest gave her for gift, that she should Intro to Literature: Fairy Tales and Folk Tales 144\nbe the most beautiful person in the world; the next, that she\nshould have the wit of an angel; the third, that she should have\na wonderful grace in every thing she did; the fourth, that she\nshould dance perfectly well; the fifth, that she should sing like\na nightingale; and the sixth, that she should play upon all kinds\nof music to the utmost perfection.\nThe old Fairy’s turn coming next, with a head shaking more\nwith spite than age, she said, that the Princess should have her\nhand pierced with a spindle, and die of the wound. This terrible\ngift made the whole company tremble, and every body fell a-\ncrying.\nAt this very instant the young Fairy came out from behind\nthe hangings, and spake these words aloud:\n“Be reassured, O King and Queen; your daughter shall not\ndie of this disaster: it is true, I have no power to undo intirely\nwhat my elder has done. The Princess shall indeed pierce her\nhand with a spindle; but instead of dying, she shall only fall\ninto a profound sleep, which shall last a hundred years; at the\nexpiration of which a king’s son shall come and awake her.”\nThe King, to avoid the misfortune foretold by the old Fairy,\ncaused immediately proclamations to be made, whereby every-\nbody was forbidden, on pain of death, to spin with a distaff and\nspindle or to have so much as any spindle in their houses.\nAbout fifteen or sixteen years after, the King and Queen\nbeing gone to one of their houses of pleasure, the young\nPrincess happened one day to divert herself running up and\ndown the palace; when going up from one apartment to\nanother, she came into a little room on the top of a tower,\nwhere a good old woman, alone, was spinning with her spindle.\nThis good woman had never heard of the King’s proclamation\nagainst spindles.\n“What are you doing there, Goody?” said the Princess. 145\n“I am spinning, my pretty child,” said the old woman, who\ndid not know who she was.\n“Ha!” said the Princess, “this is very pretty; how do you do it?\nGive it to me, that I may see if I can do so.” She had no sooner\ntaken the spindle into her hand, than, whether being very hasty\nat it, somewhat unhandy, or that the decree of the Fairy had so\nordained it, it ran into her hand, and she fell down in a swoon.\nThe good old woman not knowing very well what to do in\nthis affair, cried out for help. People came in from every quarter\nin great numbers; they threw water upon the Princess’s face,\nunlaced her, struck her on the palms of her hands, and rubbed\nher temples with Hungary-water; but nothing would bring her\nto herself.\nAnd now the King, who came up at the noise, bethought\nhimself of the prediction of the Fairies, and judging very well\nthat this must necessarily come to pass, since the Fairies had\nsaid it, caused the Princess to be carried into the finest\napartment in his palace, and to be laid upon a bed all\nembroidered with gold and silver. One would have taken her\nfor an angel, she was so very beautiful; for her swooning away\nhad not diminished one bit of her complexion; her cheeks were\ncarnation, and her lips like coral; indeed her eyes were shut,\nbut she was heard to breathe softly, which satisfied those about\nher that she was not dead. The King commanded that they\nshould not disturb her, but let her sleep quietly till her hour of\nawakening was come.\nThe good Fairy, who had saved her life by condemning her to\nsleep a hundred years, was in the kingdom of Matakin, twelve\nthousand leagues off, when this accident befell the Princess;\nbut she was instantly informed of it by a little dwarf, who had\nboots of seven leagues, that is, boots with which he could tread\nover seven leagues of ground at one stride. The Fairy came Intro to Literature: Fairy Tales and Folk Tales 146\naway immediately, and she arrived, about an hour after, in a\nfiery chariot, drawn by dragons. The King handed her out of\nthe chariot, and she approved every thing he had done; but, as\nshe had a very great foresight, she thought, when the Princess\nshould awake, she might not know what to do with herself,\nbeing all alone in this old palace; and this was what she did:\nShe touched with her wand every thing in the palace (except\nthe King and the Queen), governesses, maids of honour, ladies\nof the bedchamber, gentlemen, officers, stewards, cooks, under-\ncooks, scullions, guards, with their beef-eaters, pages, footmen;\nshe likewise touched all the horses which were in the stables,\nas well as their grooms, the great dogs in the outward court,\nand pretty little Mopsey too, the Princess’s little spaniel-bitch,\nwhich lay by her on the bed.\nImmediately upon her touching them, they all fell asleep,\nthat they might not awake before their mistress, and that they\nmight be ready to wait upon her when she wanted them. The\nvery spits at the fire, as full as they could hold of partridges\nand pheasants, did fall asleep, and the fire likewise. All this was\ndone in a moment. Fairies are not long in doing their business.\nAnd now the King and the Queen, having kissed their dear\nchild without waking her, went out of the palace, and put forth\na proclamation, that nobody should dare to come near it. This,\nhowever, was not necessary; for, in a quarter of an hour’s time,\nthere grew up, all round about the park, such a vast number of\ntrees, great and small, bushes and brambles, twining one within\nanother, that neither man nor beast could pass thro’; so that\nnothing could be seen but the very top of the towers of the\npalace; and that too, not unless it was a good way off. Nobody\ndoubted but the Fairy gave herein a sample of her art, that the\nPrincess, while she continued sleeping, might have nothing to\nfear from any curious people. 147\n“The Prince Enquires of the Aged Countryman”\nWhen a hundred years were gone and past, the son of the King\nthen reigning, and who was of another family from that of\nthe sleeping Princess, being gone a-hunting on that side of the\ncountry, asked, what were those towers which he saw in the Intro to Literature: Fairy Tales and Folk Tales 148\nmiddle of a great thick wood? Every one answered according\nas they had heard; some said that it was a ruinous old castle,\nhaunted by spirits; others, that all the sorcerers and witches of\nthe country kept there their sabbath, or nights meeting. The\n1\ncommon opinion was that an Ogre lived there, and that he\ncarried thither all the little children he could catch, that he\nmight eat them up at his leisure, without any-body’s being able\nto follow him, as having himself, only, the power to pass thro’\nthe wood.\nThe Prince was at a stand, not knowing what to believe,\nwhen a very aged countryman spake to him thus: “May it\nplease your Royal Highness, it is now above fifty years since\nI heard my father, who had heard my grandfather, say that\nthere then was in this castle, a Princess, the most beautiful\nwas ever seen; that she must sleep there a hundred years, and\nshould be awaked by a king’s son; for whom she was reserved.”\nThe young Prince was all on fire at these words, believing,\nwithout a moment’s doubt, that he could put an end to this rare\nadventure; and pushed on by love and honour resolved that\nmoment to look into it.\nScarce had he advanced towards the wood, when all the\ngreat trees, the bushes and brambles, gave way of themselves\nto let him pass thro’; he walked up to the castle which he saw at\nthe end of a large avenue which he went into; and what a little\nsurprised him was, that he saw none of his people could follow\nhim, because the trees closed again, as soon as he had pass’d\nthro’ them. However, he did not cease from continuing his way;\na young and amorous Prince is always valiant. He came into a\nspacious outward court, where everything he saw might have\nfrozen up the most fearless person with horror. There reigned\nover all a most frightful silence; the image of death everywhere\nshewed itself, and there was nothing to be seen but stretched 149\nout bodies of men and animals, all seeming to be dead. He,\nhowever, very well knew, by the ruby faces and pimpled noses\nof the beef-eaters, that they were only asleep; and their goblets,\nwherein still remained some drops of wine, shewed plainly, that\nthey fell asleep in their cups.\nHe then crossed a court paved with marble, went up the\nstairs, and came into the guard-chamber, where the guards\nwere standing in their ranks, with their muskets upon their\nshoulders, and snoring as loud as they could. After that he went\nthrough several rooms full of gentlemen and ladies, all asleep,\nsome standing, others sitting. At last he came into a chamber\nall gilded with gold, where he saw, upon a bed, the curtains\nof which were all open, the finest sight was ever beheld: a\nPrincess, who appeared to be about fifteen or sixteen years of\nage, and whose bright, and in a manner resplendent beauty,\nhad somewhat in it divine. He approached with trembling and\nadmiration, and fell down before her upon his knees. Intro to Literature: Fairy Tales and Folk Tales 150\n“He saw, upon a bed, the finest sight was ever beheld.”\nAnd now, as the inchantment was at an end, the Princess\nawaked, and looking on him with eyes more tender than the\nfirst view might seem to admit of: “Is it you, my Prince,” said\nshe to him, “you have tarried long.”\nThe Prince, charmed with these words, and much more with 151\nthe manner in which they were spoken, knew not how to shew\nhis joy and gratitude; he assured her, that he loved her better\nthan he did himself; his discourse was not well connected, but\nit pleased her all the more; little eloquence, a great deal of love.\nHe was more at a loss than she, and we need not wonder at\nit; she had time to think on what to say to him; for it is very\nprobable (though history mentions nothing of it) that the good\nFairy, during so long a sleep, had entertained her with pleasant\ndreams. In short, when they talked four hours together, they\nsaid not half what they had to say.\nIn the mean while, all the palace awaked; every one thought\nupon their particular business; and as all of them were not\nin love, they were ready to die for hunger; the chief lady of\nhonour, being as sharp set as other folks, grew very impatient,\nand told the Princess aloud, That supper was served up. The\nPrince helped the Princess to rise, she was entirely dressed, and\nvery magnificently, but his Royal Highness took care not to tell\nher that she was dressed like his great grand-mother, and had a\npoint-band peeping over a high collar; she looked not a bit the\nless beautiful and charming for all that.\nThey went into the great hall of looking-glasses, where they\nsupped, and were served by the Princess’s officers; the violins\nand hautboys played old tunes, but very excellent, tho’ it was\nnow above a hundred years since they had been played; and\nafter supper, without losing any time, the lord almoner married\nthem in the chapel of the castle, and the chief lady of honour\ndrew the curtains. They had but very little sleep; the Princess\nhad no occasion, and the Prince left her next morning to return\ninto the city, where his father must needs have been anxious\non his account. The Prince told him that he lost his way in the\nforest, as he was hunting, and that he had lain at the cottage of\na collier, who gave him cheese and brown bread. Intro to Literature: Fairy Tales and Folk Tales 152\nThe King his father, who was of an easy disposition, believed\nhim; but his mother could not be persuaded this was true; and\nseeing that he went almost every day a-hunting, and that he\nalways had some excuse ready when he had laid out three or\nfour nights together, she no longer doubted he had some little\namour, for he lived with the Princess above two whole years,\nand had by her two children, the eldest of which, who was\na daughter, was named Aurora, and the youngest, who was a\nson, they called Day, because he was even handsomer and more\nbeautiful than his sister.\nThe Queen said more than once to her son, in order to bring\nhim to speak freely to her, that a young man must e’en take\nhis pleasure; but he never dared to trust her with his secret;\nhe feared her, tho’ he loved her; for she was of the race of the\nOgres, and the King would never have married her, had it not\nbeen for her vast riches; it was even whispered about the court,\nthat she had Ogreish inclinations, and that, whenever she saw\nlittle children passing by, she had all the difficulty in the world\nto refrain from falling upon them. And so the Prince would\nnever tell her one word.\nBut when the King was dead, which happened about two\nyears afterwards; and he saw himself lord and master, he\nopenly declared his marriage; and he went in great ceremony\nto fetch his Queen from the castle. They made a magnificent\nentry into the capital city, she riding between her two children.\nSome time after, the King went to make war with the\nEmperor Cantalabutte, his neighbour. He left the government\nof the kingdom to the Queen his mother, and earnestly\nrecommended to her care his wife and children. He was like\nto be at war all the summer, and as soon as he departed, the\nQueen-mother sent her daughter-in-law and her children to a 153\ncountry-house among the woods, that she might with the more\nease gratify her horrible longing.\n“‘I will have it so,'” replied the Queen, ‘And will eat her with a sauce\nRobert'”\nSome few days afterwards she went thither herself, and said to\nher clerk of the kitchen:\n“I have a mind to eat little Aurora for my dinner to morrow.” Intro to Literature: Fairy Tales and Folk Tales 154\n“Ah! Madam,” cried the clerk of the kitchen.\n“I will have it so,” replied the Queen (and this she spake in\nthe tone of an Ogress, who had a strong desire to eat fresh\n2\nmeat), “and will eat her with a Sauce Robert.”\nThe poor man knowing very well that he must not play\ntricks with Ogresses, took his great knife and went up into little\nAurora’s chamber. She was then four years old, and came up to\nhim jumping and laughing, to take him about the neck, and ask\nhim for some sugar-candy. Upon which he began to weep, the\ngreat knife fell out of his hand, and he went into the back-yard,\nand killed a little lamb, and dressed it with such good sauce,\nthat his mistress assured him she had never eaten anything so\ngood in her life. He had at the same time taken up little Aurora,\nand carried her to his wife, to conceal her in the lodging he had\nat the end of the court yard.\nAbout eight days afterwards, the wicked Queen said to the\nclerk of the kitchen:\n“I will sup upon little Day.”\nHe answered not a word, being resolved to cheat her, as he\nhad done before. He went to find out little Day, and saw him\nwith a little foil in his hand, with which he was fencing with\na great monkey; the child being then only three years of age.\nHe took him up in his arms, and carried him to his wife, that\nshe might conceal him in her chamber along with his sister, and\nin the room of little Day cooked up a young kid very tender,\nwhich the Ogress found to be wonderfully good.\nThis was hitherto all mighty well: but one evening this\nwicked Queen said to her clerk of the kitchen:\n“I will eat the Queen with the same sauce I had with her\nchildren.”\nIt was now that the poor clerk of the kitchen despaired of\nbeing able to deceive her. The young Queen was turned of 155\ntwenty, not reckoning the hundred years she had been asleep:\nher skin was somewhat tough, tho’ very fair and white; and\nhow to find in the yard a beast so firm, was what puzzled him.\nHe took then a resolution, that he might save his own life, to\ncut the Queen’s throat; and going up into her chamber, with\nintent to do it at once, he put himself into as great a fury as he\ncould possibly, and came into the young Queen’s room with his\ndagger in his hand. He would not, however, surprise her, but\ntold her, with a great deal of respect, the orders he had received\nfrom the Queen-mother.\n“Do it, do it,” said she stretching out her neck, “execute\nyour orders, and then I shall go and see my children, my\npoor children, whom I so much and so tenderly loved,” for\nshe thought them dead ever since they had been taken away\nwithout her knowledge.\n“No, no, Madam,” cried the poor clerk of the kitchen, all in\ntears, “you shall not die, and yet you shall see your children\nagain; but it must be in my lodgings, where I have concealed\nthem, and I shall deceive the Queen once more, by giving her\nin your stead a young hind.”\nUpon this he forthwith conducted her to his chamber; where\nleaving her to embrace her children, and cry along with them,\nhe went and dressed a hind, which the Queen had for her\nsupper, and devoured it with the same appetite, as if it had\nbeen the young Queen. Exceedingly was she delighted with her\ncruelty, and she had invented a story to tell the King, at his\nreturn, how ravenous wolves had eaten up the Queen his wife,\nand her two children.\nOne evening, as she was, according to her custom, rambling\nround about the courts and yards of the palace, to see if she\ncould smell any fresh meat, she heard, in a ground-room little\nDay crying, for his mamma was going to whip him, because Intro to Literature: Fairy Tales and Folk Tales 156\nhe had been naughty; and she heard, at the same time, little\nAurora begging pardon for her brother.\nThe Ogress presently knew the voice of the Queen and her\nchildren, and being quite mad that she had been thus deceived,\nshe commanded next morning, by break of day (with a most\nhorrible voice, which made every body tremble) that they\nshould bring into the middle of the great court a large tub,\nwhich she caused to be filled with toads, vipers, snakes, and\nall sorts of serpents, in order to have thrown into it the Queen\nand her children, the clerk of the kitchen, his wife and maid;\nall whom she had given orders should be brought thither with\ntheir hands tied behind them.\nThey were brought out accordingly, and the executioners\nwere just going to throw them into the tub, when the King\n(who was not so soon expected) entered the court on horse-\nback (for he came post) and asked, with the utmost\nastonishment, what was the meaning of that horrible\nspectacle? No one dared to tell him; when the Ogress, all\ninraged to see what had happened, threw herself head-\nforemost into the tub, and was instantly devoured by the ugly\ncreatures she had ordered to be thrown into it for others. The\nKing could not but be very sorry, for she was his mother; but he\nsoon comforted himself with his beautiful wife, and his pretty\nchildren. 157\n1\nOgre is a giant, with long teeth and claws, with a raw head\nand bloody-bones, who runs away with naughty little boys and\ngirls, and eats them up. [Note by the translator.]\n2\nThis is a French sauce, made with onions shredded and\nboiled tender in butter, to which is added vinegar, mustard, salt,\npepper, and a little wine. [Note by the translator.]\nTThhee MMoorraall\nTo get as prize a husband rich and gay,\nOf humour sweet, with many years to stay,\nIs natural enough, ’tis true;\nTo wait for him a hundred years,\nAnd all that while asleep, appears\nA thing entirely new.\nNow at this time of day,\nNot one of all the sex we see\nDoth sleep with such profound tranquillity:\nBut yet this Fable seems to let us know Intro to Literature: Fairy Tales and Folk Tales 158\nThat very often Hymen’s blisses sweet,\nAltho’ some tedious obstacles they meet,\nAre not less happy for approaching slow.\n‘Tis nature’s way that ladies fair\nShould yearn conjugal joys to share;\nAnd so I’ve not the heart to preach\nA moral that’s beyond their reach.\nProject Gutenberg EBook of The Fairy Tales of Charles Perrault,\nby Charles Perrault\nhttp:\/\/www.gutenberg.org\/2\/9\/0\/2\/29021\nThis eBook is for the use of anyone anywhere at no cost\nand with almost no restrictions whatsoever. You may\ncopy it, give it away or re-use it under the terms of\nthe Project Gutenberg License included with this eBook\nor online at www.gutenberg.org 159\nBriar Rose\n16.\nA king and queen once upon a time reigned in a country a great\nway off, where there were in those days fairies. Now this king\nand queen had plenty of money, and plenty of fine clothes to\nwear, and plenty of good things to eat and drink, and a coach to\nride out in every day: but though they had been married many\nyears they had no children, and this grieved them very much\nindeed. But one day as the queen was walking by the side of\nthe river, at the bottom of the garden, she saw a poor little fish,\nthat had thrown itself out of the water, and lay gasping and\nnearly dead on the bank. Then the queen took pity on the little\nfish, and threw it back again into the river; and before it swam\naway it lifted its head out of the water and said, ‘I know what\nyour wish is, and it shall be fulfilled, in return for your kindness\nto me—you will soon have a daughter.’ What the little fish had\nforetold soon came to pass; and the queen had a little girl, so\nvery beautiful that the king could not cease looking on it for\njoy, and said he would hold a great feast and make merry, and\nshow the child to all the land. So he asked his kinsmen, and\nnobles, and friends, and neighbours. But the queen said, ‘I will\nhave the fairies also, that they might be kind and good to our\n159 Intro to Literature: Fairy Tales and Folk Tales 160\nlittle daughter.’ Now there were thirteen fairies in the kingdom;\nbut as the king and queen had only twelve golden dishes for\nthem to eat out of, they were forced to leave one of the fairies\nwithout asking her. So twelve fairies came, each with a high\nred cap on her head, and red shoes with high heels on her feet,\nand a long white wand in her hand: and after the feast was over\nthey gathered round in a ring and gave all their best gifts to the\nlittle princess. One gave her goodness, another beauty, another\nriches, and so on till she had all that was good in the world.\nJust as eleven of them had done blessing her, a great noise\nwas heard in the courtyard, and word was brought that the\nthirteenth fairy was come, with a black cap on her head, and\nblack shoes on her feet, and a broomstick in her hand: and\npresently up she came into the dining-hall. Now, as she had\nnot been asked to the feast she was very angry, and scolded\nthe king and queen very much, and set to work to take her\nrevenge. So she cried out, ‘The king’s daughter shall, in her\nfifteenth year, be wounded by a spindle, and fall down dead.’\nThen the twelfth of the friendly fairies, who had not yet given\nher gift, came forward, and said that the evil wish must be\nfulfilled, but that she could soften its mischief; so her gift was,\nthat the king’s daughter, when the spindle wounded her, should\nnot really die, but should only fall asleep for a hundred years.\nHowever, the king hoped still to save his dear child\naltogether from the threatened evil; so he ordered that all the\nspindles in the kingdom should be bought up and burnt. But\nall the gifts of the first eleven fairies were in the meantime\nfulfilled; for the princess was so beautiful, and well behaved,\nand good, and wise, that everyone who knew her loved her.\nIt happened that, on the very day she was fifteen years old,\nthe king and queen were not at home, and she was left alone\nin the palace. So she roved about by herself, and looked at all 161\nthe rooms and chambers, till at last she came to an old tower,\nto which there was a narrow staircase ending with a little door.\nIn the door there was a golden key, and when she turned it\nthe door sprang open, and there sat an old lady spinning away\nvery busily. ‘Why, how now, good mother,’ said the princess;\n‘what are you doing there?’ ‘Spinning,’ said the old lady, and\nnodded her head, humming a tune, while buzz! went the wheel.\n‘How prettily that little thing turns round!’ said the princess,\nand took the spindle and began to try and spin. But scarcely\nhad she touched it, before the fairy’s prophecy was fulfilled; the\nspindle wounded her, and she fell down lifeless on the ground.\nHowever, she was not dead, but had only fallen into a deep\nsleep; and the king and the queen, who had just come home,\nand all their court, fell asleep too; and the horses slept in the\nstables, and the dogs in the court, the pigeons on the house-\ntop, and the very flies slept upon the walls. Even the fire on the\nhearth left off blazing, and went to sleep; the jack stopped, and\nthe spit that was turning about with a goose upon it for the\nking’s dinner stood still; and the cook, who was at that moment\npulling the kitchen-boy by the hair to give him a box on the\near for something he had done amiss, let him go, and both fell\nasleep; the butler, who was slyly tasting the ale, fell asleep with\nthe jug at his lips: and thus everything stood still, and slept\nsoundly.\nA large hedge of thorns soon grew round the palace, and\nevery year it became higher and thicker; till at last the old\npalace was surrounded and hidden, so that not even the roof or\nthe chimneys could be seen. But there went a report through\nall the land of the beautiful sleeping Briar Rose (for so the\nking’s daughter was called): so that, from time to time, several\nkings’ sons came, and tried to break through the thicket into\nthe palace. This, however, none of them could ever do; for the Intro to Literature: Fairy Tales and Folk Tales 162\nthorns and bushes laid hold of them, as it were with hands; and\nthere they stuck fast, and died wretchedly.\nAfter many, many years there came a king’s son into that\nland: and an old man told him the story of the thicket of\nthorns; and how a beautiful palace stood behind it, and how a\nwonderful princess, called Briar Rose, lay in it asleep, with all\nher court. He told, too, how he had heard from his grandfather\nthat many, many princes had come, and had tried to break\nthrough the thicket, but that they had all stuck fast in it, and\ndied. Then the young prince said, ‘All this shall not frighten me;\nI will go and see this Briar Rose.’ The old man tried to hinder\nhim, but he was bent upon going.\nNow that very day the hundred years were ended; and as\nthe prince came to the thicket he saw nothing but beautiful\nflowering shrubs, through which he went with ease, and they\nshut in after him as thick as ever. Then he came at last to\nthe palace, and there in the court lay the dogs asleep; and the\nhorses were standing in the stables; and on the roof sat the\npigeons fast asleep, with their heads under their wings. And\nwhen he came into the palace, the flies were sleeping on the\nwalls; the spit was standing still; the butler had the jug of ale\nat his lips, going to drink a draught; the maid sat with a fowl\nin her lap ready to be plucked; and the cook in the kitchen was\nstill holding up her hand, as if she was going to beat the boy.\nThen he went on still farther, and all was so still that he could\nhear every breath he drew; till at last he came to the old tower,\nand opened the door of the little room in which Briar Rose\nwas; and there she lay, fast asleep on a couch by the window.\nShe looked so beautiful that he could not take his eyes off\nher, so he stooped down and gave her a kiss. But the moment\nhe kissed her she opened her eyes and awoke, and smiled\nupon him; and they went out together; and soon the king and 163\nqueen also awoke, and all the court, and gazed on each other\nwith great wonder. And the horses shook themselves, and the\ndogs jumped up and barked; the pigeons took their heads from\nunder their wings, and looked about and flew into the fields;\nthe flies on the walls buzzed again; the fire in the kitchen blazed\nup; round went the jack, and round went the spit, with the\ngoose for the king’s dinner upon it; the butler finished his\ndraught of ale; the maid went on plucking the fowl; and the\ncook gave the boy the box on his ear.\nAnd then the prince and Briar Rose were married, and the\nwedding feast was given; and they lived happily together all\ntheir lives long.\nAttribution\nLit2Go, University of South Florida: https:\/\/etc.usf.edu\/lit2go\nGrimm Brothers. \"Briar Rose.\" Grimm's Fairy Tales.\nLit2Go Edition. 1905.\nhttps:\/\/etc.usf.edu\/lit2go\/175\/grimms-fairy-tales\/3058\/briar-rose Intro to Literature: Fairy Tales and Folk Tales 164\nMomotaro, Or\n17.\nthe Story of the\nSon of a Peach\nfrom Japanese Fairy Tales\nCompiled by\nYei Theodora Ozaki\nProfusely IlLustrated by Japanese Artists\nLong, long ago there lived, an old man and an old woman; they\nwere peasants, and had to work hard to earn their daily rice.\nThe old man used to go and cut grass for the farmers around,\nand while he was gone the old woman, his wife, did the work\nof the house and worked in their own little rice field.\n164 165\nOne day the old man went to the hills as usual to cut grass\nand the old woman took some clothes to the river to wash.\nIt was nearly summer, and the country was very beautiful to\nsee in its fresh greenness as the two old people went on their\nway to work. The grass on the banks of the river looked like\nemerald velvet, and the pussy willows along the edge of the\nwater were shaking out their soft tassels.\nThe breezes blew and ruffled the smooth surface of the water\ninto wavelets, and passing on touched the cheeks of the old\ncouple who, for some reason they could not explain, felt very\nhappy that morning.\nThe old woman at last found a nice spot by the river bank\nand put her basket down. Then she set to work to wash the\nclothes; she took them one by one out of the basket and washed\nthem in the river and rubbed them on the stones. The water was\nas clear as crystal, and she could see the tiny fish swimming to\nand fro, and the pebbles at the bottom.\nAs she was busy washing her clothes a great peach came\nbumping down the stream. The old woman looked up from her\nwork and saw this large peach. She was sixty years of age, yet\nin all her life she had never seen such a big peach as this.\n“How delicious that peach must be!” she said to herself. “I\nmust certainly get it and take it home to my old man.”\nShe stretched out her arm to try and get it, but it was quite\nout of her reach. She looked about for a stick, but there was not\none to be seen, and if she went to look for one she would lose\nthe peach.\nStopping a moment to think what she would do, she\nremembered an old charm-verse. Now she began to clap her\nhands to keep time to the rolling of the peach down stream, and\nwhile she clapped she sang this song:\n“Distant water is bitter, Intro to Literature: Fairy Tales and Folk Tales 166\nThe near water is sweet;\nPass by the distant water\nAnd come into the sweet.”\nStrange to say, as soon as she began to repeat this little song\nthe peach began to come nearer and nearer the bank where the\nold woman was standing, till at last it stopped just in front of\nher so that she was able to take it up in her hands. The old\nwoman was delighted. She could not go on with her work, so\nhappy and excited was she, so she put all the clothes back in\nher bamboo basket, and with the basket on her back and the\npeach in her hand she hurried homewards.\nIt seemed a very long time to her to wait till her husband\nreturned. The old man at last came back as the sun was setting,\nwith a big bundle of grass on his back—so big that he was\nalmost hidden and she could hardly see him. He seemed very\ntired and used the scythe for a walking stick, leaning on it as\nhe walked along.\nAs soon as the old woman saw him she called out:\n“O Fii San! (old man) I have been waiting for you to come\nhome for such a long time to-day!”\n“What is the matter? Why are you so impatient?” asked the\nold man, wondering at her unusual eagerness. “Has anything\nhappened while I have been away?”\n“Oh, no!” answered the old woman, “nothing has happened,\nonly I have found a nice present for you!”\n“That is good,” said the old man. He then washed his feet in\na basin of water and stepped up to the veranda.\nThe old woman now ran into the little room and brought\nout from the cupboard the big peach. It felt even heavier than\nbefore. She held it up to him, saying:\n“Just look at this! Did you ever see such a large peach in all\nyour life?” 167\nWhen the old man looked at the peach he was greatly\nastonished and said:\n“This is indeed the largest peach I have ever seen! Wherever\ndid you buy it?”\n“I did not buy it,” answered the old woman. “I found it in the\nriver where I was washing.” And she told him the whole story.\n“I am very glad that you have found it. Let us eat it now, for\nI am hungry,” said the O Fii San.\nHe brought out the kitchen knife, and, placing the peach on\na board, was about to cut it when, wonderful to tell, the peach\nsplit in two of itself and a clear voice said:\n“Wait a bit, old man!” and out stepped a beautiful little child.\nThe old man and his wife were both so astonished at what\nthey saw that they fell to the ground. The child spoke again:\n“Don’t be afraid. I am no demon or fairy. I will tell you the\ntruth. Heaven has had compassion on you. Every day and every\nnight you have lamented that you had no child. Your cry has\nbeen heard and I am sent to be the son of your old age!”\nOn hearing this the old man and his wife were very happy.\nThey had cried night and day for sorrow at having no child to\nhelp them in their lonely old age, and now that their prayer was\nanswered they were so lost with joy that they did not know\nwhere to put their hands or their feet. First the old man took\nthe child up in his arms, and then the old woman did the same;\nand they named him MOMOTARO, OR SON OF A PEACH,\nbecause he had come out of a peach.\nThe years passed quickly by and the child grew to be fifteen\nyears of age. He was taller and far stronger than any other boys\nof his own age, he had a handsome face and a heart full of\ncourage, and he was very wise for his years. The old couple’s\npleasure was very great when they looked at him, for he was\njust what they thought a hero ought to be like. Intro to Literature: Fairy Tales and Folk Tales 168\nOne day Momotaro came to his foster-father and said\nsolemnly:\n“Father, by a strange chance we have become father and\nson. Your goodness to me has been higher than the mountain\ngrasses which it was your daily work to cut, and deeper than\nthe river where my mother washes the clothes. I do not know\nhow to thank you enough.”\n“Why,” answered the old man, “it is a matter of course that\na father should bring up his son. When you are older it will be\nyour turn to take care of us, so after all there will be no profit or\nloss between us—all will be equal. Indeed, I am rather surprised\nthat you should thank me in this way!” and the old man looked\nbothered.\n“I hope you will be patient with me,” said Momotaro; “but\nbefore I begin to pay back your goodness to me I have a request\nto make which I hope you will grant me above everything else.”\n“I will let you do whatever you wish, for you are quite\ndifferent to all other boys!”\n“Then let me go away at once!”\n“What do you say? Do you wish to leave your old father and\nmother and go away from your old home?”\n“I will surely come back again, if you let me go now!”\n“Where are you going?”\n“You must think it strange that I want to go away,” said\nMomotaro, “because I have not yet told you my reason. Far\naway from here to the northeast of Japan there is an island in\nthe sea. This island is the stronghold of a band of devils. I have\noften heard how they invade this land, kill and rob the people,\nand carry off all they can find. They are not only very wicked\nbut they are disloyal to our Emperor and disobey his laws. They\nare also cannibals, for they kill and eat some of the poor people\nwho are so unfortunate as to fall into their hands. These devils 169\nare very hateful beings. I must go and conquer them and bring\nback all the plunder of which they have robbed this land. It is\nfor this reason that I want to go away for a short time!”\nThe old man was much surprised at hearing all this from a\nmere boy of fifteen. He thought it best to let the boy go. He was\nstrong and fearless, and besides all this, the old man knew he\nwas no common child, for he had been sent to them as a gift\nfrom Heaven, and he felt quite sure that the devils would be\npowerless to harm him.\n“All you say is very interesting, Momotaro,” said the old man.\n“I will not hinder you in your determination. You may go if you\nwish. Go to the island as soon as ever you like and destroy the\ndemons and bring peace to the land.”\n“Thank you, for all your kindness,” said Momotaro, who\nbegan to get ready to go that very day. He was full of courage\nand did not know what fear was.\nThe old man and woman at once set to work to pound rice\nin the kitchen mortar to make cakes for Momotaro to take with\nhim on his journey.\nAt last the cakes were made and Momotaro was ready to\nstart on his long journey.\nParting is always sad. So it was now. The eyes of the two old\npeople were filled with tears and their voices trembled as they\nsaid:\n“Go with all care and speed. We expect you back victorious!”\nMomotaro was very sorry to leave his old parents (though he\nknew he was coming back as soon as he could), for he thought\nof how lonely they would be while he was away. But he said\n“Good-by!” quite bravely.\n“I am going now. Take good care of yourselves while I am\naway. Good-by!” And he stepped quickly out of the house. In\nsilence the eyes of Momotaro and his parents met in farewell. Intro to Literature: Fairy Tales and Folk Tales 170\nMomotaro now hurried on his way till it was midday. He\nbegan to feel hungry, so he opened his bag and took out one of\nthe rice-cakes and sat down under a tree by the side of the road\nto eat it. While he was thus having his lunch a dog almost as\nlarge as a colt came running out from the high grass. He made\nstraight for Momotaro, and showing his teeth, said in a fierce\nway:\n“You are a rude man to pass my field without asking\npermission first. If you leave me all the cakes you have in your\nbag you may go; otherwise I will bite you till I kill you!”\nMomotaro only laughed scornfully:\n“What is that you are saying? Do you know who I am? I\nam Momotaro, and I am on my way to subdue the devils in\ntheir island stronghold in the northeast of Japan. If you try to\nstop me on my way there I will cut you in two from the head\ndownwards!”\nThe dog’s manner at once changed. His tail dropped between\nhis legs, and coming near he bowed so low that his forehead\ntouched the ground.\n“What do I hear? The name of Momotaro? Are you indeed\nMomotaro? I have often heard of your great strength. Not\nknowing who you were I have behaved in a very stupid way.\nWill you please pardon my rudeness? Are you indeed on your\nway to invade the Island of Devils? If you will take such a\nrude fellow with you as one of your followers, I shall be very\ngrateful to you.”\n“I think I can take you with me if you wish to go,” said\nMomotaro.\n“Thank you!” said the dog. “By the way, I am very very\nhungry. Will you give me one of the cakes you are carrying?”\n“This is the best kind of cake there is in Japan,” said 171\nMomotaro. “I cannot spare you a whole one; I will give you half\nof one.”\n“Thank you very much,” said the dog, taking the piece\nthrown to him.\nThen Momotaro got up and the dog followed. For a long time\nthey walked over the hills and through the valleys. As they\nwere going along an animal came down from a tree a little\nahead of them. The creature soon came up to Momotaro and\nsaid:\n“Good morning, Momotaro! You are welcome in this part of\nthe country. Will you allow me to go with you?”\nThe dog answered jealously:\n“Momotaro already has a dog to accompany him. Of what\nuse is a monkey like you in battle? We are on our way to fight\nthe devils! Get away!”\nThe dog and the monkey began to quarrel and bite, for these\ntwo animals always hate each other.\n“Now, don’t quarrel!” said Momotaro, putting himself\nbetween them. “Wait a moment, dog!”\n“It is not at all dignified for you to have such a creature as\nthat following you!” said the dog.\n“What do you know about it?” asked Momotaro; and pushing\naside the dog, he spoke to the monkey:\n“Who are you?”\n“I am a monkey living in these hills,” replied the monkey.\n“I heard of your expedition to the Island of Devils, and I have\ncome to go with you. Nothing will please me more than to\nfollow you!”\n“Do you really wish to go to the Island of Devils and fight\nwith me?”\n“Yes, sir,” replied the monkey. Intro to Literature: Fairy Tales and Folk Tales 172\n“I admire your courage,” said Momotaro. “Here is a piece of\none of my fine rice-cakes. Come along!”\nSo the monkey joined Momotaro. The dog and the monkey\ndid not get on well together. They were always snapping at\neach other as they went along, and always wanting to have a\nfight. This made Momotaro very cross, and at last he sent the\ndog on ahead with a flag and put the monkey behind with a\nsword, and he placed himself between them with a war-fan,\nwhich is made of iron.\nBy and by they came to a large field. Here a bird flew down\nand alighted on the ground just in front of the little party. It was\nthe most beautiful bird Momotaro had ever seen. On its body\nwere five different robes of feathers and its head was covered\nwith a scarlet cap.\nThe dog at once ran at the bird and tried to seize and kill it.\nBut the bird struck out its spurs and flew at the dog’s tail, and\nthe fight went hard with both.\nMomotaro, as he looked on, could not help admiring the bird;\nit showed so much spirit in the fight. It would certainly make a\ngood fighter.\nMomotaro went up to the two combatants, and holding the\ndog back, said to the bird:\n“You rascal! you are hindering my journey. Surrender at\nonce, and I will take you with me. If you don’t I will set this dog\nto bite your head off!”\nThen the bird surrendered at once, and begged to be taken\ninto Momotaro’s company.\n“I do not know what excuse to offer for quarreling with the\ndog, your servant, but I did not see you. I am a miserable bird\ncalled a pheasant. It is very generous of you to pardon my\nrudeness and to take me with you. Please allow me to follow\nyou behind the dog and the monkey!” 173\n“I congratulate you on surrendering so soon,” said\nMomotaro, smiling. “Come and join us in our raid on the\ndevils.”\n“Are you going to take this bird with you also?” asked the\ndog, interrupting.\n“Why do you ask such an unnecessary question? Didn’t you\nhear what I said? I take the bird with me because I wish to!”\n“Humph!” said the dog.\nThen Momotaro stood and gave this order:\n“Now all of you must listen to me. The first thing necessary\nin an army is harmony. It is a wise saying which says that\n‘Advantage on earth is better than advantage in Heaven!’\nUnion amongst ourselves is better than any earthly gain. When\nwe are not at peace amongst ourselves it is no easy thing to\nsubdue an enemy. From now, you three, the dog, the monkey\nand the pheasant, must be friends with one mind. The one who\nfirst begins a quarrel will be discharged on the spot!”\nAll the three promised not to quarrel. The pheasant was now\nmade a member of Momotaro’s suite, and received half a cake.\nMomotaro’s influence was so great that the three became\ngood friends, and hurried onwards with him as their leader.\nHurrying on day after day they at last came out upon the\nshore of the North-Eastern Sea. There was nothing to be seen\nas far as the horizon—not a sign of any island. All that broke\nthe stillness was the rolling of the waves upon the shore.\nNow, the dog and the monkey and the pheasant had come\nvery bravely all the way through the long valleys and over the\nhills, but they had never seen the sea before, and for the first\ntime since they set out they were bewildered and gazed at each\nother in silence. How were they to cross the water and get to\nthe Island of Devils? Intro to Literature: Fairy Tales and Folk Tales 174\nMomotaro soon saw that they were daunted by the sight of\nthe sea, and to try them he spoke loudly and roughly:\n“Why do you hesitate? Are you afraid of the sea? Oh! what\ncowards you are! It is impossible to take such weak creatures\nas you with me to fight the demons. It will be far better for me\nto go alone. I discharge you all at once!”\nThe three animals were taken aback at this sharp reproof,\nand clung to Momotaro’s sleeve, begging him not to send them\naway.\n“Please, Momotaro!” said the dog.\n“We have come thus far!” said the monkey.\n“It is inhuman to leave us here!” said the pheasant.\n“We are not at all afraid of the sea,” said the monkey again.\n“Please do take us with you,” said the pheasant.\n“Do please,” said the dog.\nThey had now gained a little courage, so Momotaro said:\n“Well, then, I will take you with me, but be careful!”\nMomotaro now got a small ship, and they all got on board.\nThe wind and weather were fair, and the ship went like an\narrow over the sea. It was the first time they had ever been on\nthe water, and so at first the dog, the monkey and the pheasant\nwere frightened at the waves and the rolling of the vessel, but\nby degrees they grew accustomed to the water and were quite\nhappy again. Every day they paced the deck of their little ship,\neagerly looking out for the demons’ island.\nWhen they grew tired of this, they told each other stories of\nall their exploits of which they were proud, and then played\ngames together; and Momotaro found much to amuse him in\nlistening to the three animals and watching their antics, and\nin this way he forgot that the way was long and that he was\ntired of the voyage and of doing nothing. He longed to be at 175\nwork killing the monsters who had done so much harm in his\ncountry.\nAs the wind blew in their favor and they met no storms\nthe ship made a quick voyage, and one day when the sun was\nshining brightly a sight of land rewarded the four watchers at\nthe bow.\nMomotaro knew at once that what they saw was the devils’\nstronghold. On the top of the precipitous shore, looking out\nto sea, was a large castle. Now that his enterprise was close\nat hand, he was deep in thought with his head leaning on his\nhands, wondering how he should begin the attack. His three\nfollowers watched him, waiting for orders. At last he called to\nthe pheasant:\n“It is a great advantage for us to have you with us.” said\nMomotaro to the bird, “for you have good wings. Fly at once to\nthe castle and engage the demons to fight. We will follow you.”\nThe pheasant at once obeyed. He flew off from the ship\nbeating the air gladly with his wings. The bird soon reached the\nisland and took up his position on the roof in the middle of the\ncastle, calling out loudly:\n“All you devils listen to me! The great Japanese general\nMomotaro has come to fight you and to take your stronghold\nfrom you. If you wish to save your lives surrender at once, and\nin token of your submission you must break off the horns that\ngrow on your forehead. If you do not surrender at once, but\nmake up your mind to fight, we, the pheasant, the dog and the\nmonkey, will kill you all by biting and tearing you to death!”\nThe horned demons looking up and only seeing a pheasant,\nlaughed and said:\n“A wild pheasant, indeed! It is ridiculous to hear such words\nfrom a mean thing like you. Wait till you get a blow from one\nof our iron bars!” Intro to Literature: Fairy Tales and Folk Tales 176\nVery angry, indeed, were the devils. They shook their horns\nand their shocks of red hair fiercely, and rushed to put on tiger\nskin trousers to make themselves look more terrible. They then\nbrought out great iron bars and ran to where the pheasant\nperched over their heads, and tried to knock him down. The\npheasant flew to one side to escape the blow, and then attacked\nthe head of first one and then another demon. He flew round\nand round them, beating the air with his wings so fiercely and\nceaselessly, that the devils began to wonder whether they had\nto fight one or many more birds.\nIn the meantime, Momotaro had brought his ship to land.\nAs they had approached, he saw that the shore was like a\nprecipice, and that the large castle was surrounded by high\nwalls and large iron gates and was strongly fortified.\nMomotaro landed, and with the hope of finding some way\nof entrance, walked up the path towards the top, followed by\nthe monkey and the dog. They soon came upon two beautiful\ndamsels washing clothes in a stream. Momotaro saw that the\nclothes were blood-stained, and that as the two maidens\nwashed, the tears were falling fast down their cheeks. He\nstopped and spoke to them:\n“Who are you, and why do you weep?”\n“We are captives of the Demon King. We were carried away\nfrom our homes to this island, and though we are the daughters\nof Daimios (Lords), we are obliged to be his servants, and one\nday he will kill us”—and the maidens held up the blood-stained\nclothes—“and eat us, and there is no one to help us!”\nAnd their tears burst out afresh at this horrible thought.\n“I will rescue you,” said Momotaro. “Do not weep any more,\nonly show me how I may get into the castle.”\nThen the two ladies led the way and showed Momotaro a 177\nlittle back door in the lowest part of the castle wall—so small\nthat Momotaro could hardly crawl in.\nThe pheasant, who was all this time fighting hard, saw\nMomotaro and his little band rush in at the back.\nMomotaro’s onslaught was so furious that the devils could\nnot stand against him. At first their foe had been a single bird,\nthe pheasant, but now that Momotaro and the dog and the\nmonkey had arrived they were bewildered, for the four enemies\nfought like a hundred, so strong were they. Some of the devils\nfell off the parapet of the castle and were dashed to pieces on\nthe rocks beneath; others fell into the sea and were drowned;\nmany were beaten to death by the three animals.\nThe chief of the devils at last was the only one left. He made\nup his mind to surrender, for he knew that his enemy was\nstronger than mortal man.\nHe came up humbly to Momotaro and threw down his iron\nbar, and kneeling down at the victor’s feet he broke off the\nhorns on his head in token of submission, for they were the\nsign of his strength and power.\n“I am afraid of you,” he said meekly. “I cannot stand against\nyou. I will give you all the treasure hidden in this castle if you\nwill spare my life!”\nMomotaro laughed.\n“It is not like you, big devil, to beg for mercy, is it? I cannot\nspare your wicked life, however much you beg, for you have\nkilled and tortured many people and robbed our country for\nmany years.”\nThen Momotaro tied the devil chief up and gave him into the\nmonkey’s charge. Having done this, he went into all the rooms\nof the castle and set the prisoners free and gathered together all\nthe treasure he found.\nThe dog and the pheasant carried home the plunder, and thus Intro to Literature: Fairy Tales and Folk Tales 178\nMomotaro returned triumphantly to his home, taking with him\nthe devil chief as a captive.\nThe two poor damsels, daughters of Daimios, and others\nwhom the wicked demon had carried off to be his slaves, were\ntaken safely to their own homes and delivered to their parents.\nThe whole country made a hero of Momotaro on his\ntriumphant return, and rejoiced that the country was now freed\nfrom the robber devils who had been a terror of the land for a\nlong time.\nThe old couple’s joy was greater than ever, and the treasure\nMomotaro had brought home with him enabled them to live in\npeace and plenty to the end of their days.\nThe Project Gutenberg eBook of Japanese Fairy Tales,\nby Yei Theodora Ozaki\nhttps:\/\/www.gutenberg.org\/files\/4018\/4018-h\/4018-h.htm\nThis eBook is for the use of anyone anywhere at no cost\nand with almost no restrictions whatsoever. You may\ncopy it, give it away or re-use it under the terms\nof the Project Gutenberg License included with this eBook\nor online at www.gutenberg.org 179\nLittle Red-Cap\n18.\n[Little Red Riding\nHood]\nby Jacob Grimm and wilhelm grimm\nOnce upon a time there was a dear little girl who was loved\nby everyone who looked at her, but most of all by her\ngrandmother, and there was nothing that she would not have\ngiven to the child. Once she gave her a little cap of red velvet,\nwhich suited her so well that she would never wear anything\nelse; so she was always called ‘Little Red-Cap.’\nOne day her mother said to her: ‘Come, Little Red-Cap, here\nis a piece of cake and a bottle of wine; take them to your\ngrandmother, she is ill and weak, and they will do her good.\nSet out before it gets hot, and when you are going, walk nicely\nand quietly and do not run off the path, or you may fall and\nbreak the bottle, and then your grandmother will get nothing;\n179 Intro to Literature: Fairy Tales and Folk Tales 180\nand when you go into her room, don’t forget to say, “Good\nmorning”, and don’t peep into every corner before you do it.’\n‘I will take great care,’ said Little Red-Cap to her mother, and\ngave her hand on it.\nThe grandmother lived out in the wood, half a league from\nthe village, and just as Little Red-Cap entered the wood, a wolf\nmet her. Red-Cap did not know what a wicked creature he was,\nand was not at all afraid of him.\n‘Good day, Little Red-Cap,’ said he.\n‘Thank you kindly, wolf.’\n‘Whither away so early, Little Red-Cap?’\n‘To my grandmother’s.’\n‘What have you got in your apron?’\n‘Cake and wine; yesterday was baking-day, so poor sick\ngrandmother is to have something good, to make her stronger.’\n‘Where does your grandmother live, Little Red-Cap?’\n‘A good quarter of a league farther on in the wood; her house\nstands under the three large oak-trees, the nut-trees are just\nbelow; you surely must know it,’ replied Little Red-Cap.\nThe wolf thought to himself: ‘What a tender young creature!\nwhat a nice plump mouthful—she will be better to eat than\nthe old woman. I must act craftily, so as to catch both.’ So he\nwalked for a short time by the side of Little Red-Cap, and then\nhe said: ‘See, Little Red-Cap, how pretty the flowers are about\nhere—why do you not look round? I believe, too, that you do\nnot hear how sweetly the little birds are singing; you walk\ngravely along as if you were going to school, while everything\nelse out here in the wood is merry.’\nLittle Red-Cap raised her eyes, and when she saw the\nsunbeams dancing here and there through the trees, and pretty\nflowers growing everywhere, she thought: ‘Suppose I take\ngrandmother a fresh nosegay; that would please her too. It is so 181\nearly in the day that I shall still get there in good time’; and so\nshe ran from the path into the wood to look for flowers. And\nwhenever she had picked one, she fancied that she saw a still\nprettier one farther on, and ran after it, and so got deeper and\ndeeper into the wood.\nMeanwhile the wolf ran straight to the grandmother’s house\nand knocked at the door.\n‘Who is there?’\n‘Little Red-Cap,’ replied the wolf. ‘She is bringing cake and\nwine; open the door.’\n‘Lift the latch,’ called out the grandmother, ‘I am too weak,\nand cannot get up.’\nThe wolf lifted the latch, the door sprang open, and without\nsaying a word he went straight to the grandmother’s bed, and\ndevoured her. Then he put on her clothes, dressed himself in\nher cap laid himself in bed and drew the curtains.\nLittle Red-Cap, however, had been running about picking\nflowers, and when she had gathered so many that she could\ncarry no more, she remembered her grandmother, and set out\non the way to her.\nShe was surprised to find the cottage-door standing open,\nand when she went into the room, she had such a strange\nfeeling that she said to herself: ‘Oh dear! how uneasy I feel\ntoday, and at other times I like being with grandmother so\nmuch.’ She called out: ‘Good morning,’ but received no answer;\nso she went to the bed and drew back the curtains. There lay\nher grandmother with her cap pulled far over her face, and\nlooking very strange.\n‘Oh! grandmother,’ she said, ‘what big ears you have!’\n‘The better to hear you with, my child,’ was the reply.\n‘But, grandmother, what big eyes you have!’ she said.\n‘The better to see you with, my dear.’ Intro to Literature: Fairy Tales and Folk Tales 182\n‘But, grandmother, what large hands you have!’\n‘The better to hug you with.’\n‘Oh! but, grandmother, what a terrible big mouth you have!’\n‘The better to eat you with!’\nAnd scarcely had the wolf said this, than with one bound he\nwas out of bed and swallowed up Red-Cap.\nWhen the wolf had appeased his appetite, he lay down again\nin the bed, fell asleep and began to snore very loud. The\nhuntsman was just passing the house, and thought to himself:\n‘How the old woman is snoring! I must just see if she wants\nanything.’ So he went into the room, and when he came to\nthe bed, he saw that the wolf was lying in it. ‘Do I find you\nhere, you old sinner!’ said he. ‘I have long sought you!’ Then\njust as he was going to fire at him, it occurred to him that the\nwolf might have devoured the grandmother, and that she might\nstill be saved, so he did not fire, but took a pair of scissors,\nand began to cut open the stomach of the sleeping wolf. When\nhe had made two snips, he saw the little Red-Cap shining,\nand then he made two snips more, and the little girl sprang\nout, crying: ‘Ah, how frightened I have been! How dark it was\ninside the wolf’; and after that the aged grandmother came\nout alive also, but scarcely able to breathe. Red-Cap, however,\nquickly fetched great stones with which they filled the wolf’s\nbelly, and when he awoke, he wanted to run away, but the\nstones were so heavy that he collapsed at once, and fell dead.\nThen all three were delighted. The huntsman drew off the\nwolf’s skin and went home with it; the grandmother ate the\ncake and drank the wine which Red-Cap had brought, and\nrevived, but Red-Cap thought to herself: ‘As long as I live, I will\nnever by myself leave the path, to run into the wood, when my\nmother has forbidden me to do so.’\nIt also related that once when Red-Cap was again taking "}