{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nLiterary Criticism\nLiterary Criticism\nBy reading and discussing literature, we expand our imagination, our sense of what is possible, and our ability to empathize with others. Improve\nyour ability to read critically and interpret texts while gaining appreciation for di\u0000erent literary genres and theories of interpretation. Read\nsamples of literary interpretation. Write a critique of a literary work.\nTexts that interpret literary works are usually persuasive texts. Literary critics may conduct a close reading of a literary work, critique a literary\nwork from the stance of a particular literary theory, or debate the soundness of other critics' interpretations. The work of literary critics is similar\nto the work of authors writing evaluative texts. For example, the skills required to critique \u0000lms, interpret laws, or evaluate artistic trends are\nsimilar to those skills required by literary critics.\nWhy Write Literary Criticism?\nPeople have been telling stories and sharing responses to stories since the beginning of time. By reading and discussing literature, we expand\nour imagination, our sense of what is possible, and our ability to empathize with others. Reading and discussing literature can enhance our ability\nto write. It can sharpen our critical faculties, enabling us to assess works and better understand why literature can have such a powerful e\u0000ect\non our lives.\n\"Literary texts\" include works of \u0000ction and poetry. In school,\nEnglish instructors ask students to critique literary texts, or works. Literary criticism refers to a genre of writing whereby an author critiques a\nliterary text, either a work of \u0000ction, a play, or poetry. Alternatively, some works of literary criticism address how a particular theory of\ninterpretation informs a reading of a work or refutes some other critics' reading of a work.\nDiverse Rhetorical Situations\nThe genre of literary interpretation is more specialized than most of the other genres addressed in this section, as suggested by the table below.\nPeople may discuss their reactions to literary works informally (at co\u0000ee houses, book clubs, or the gym) but the lion's share of literary criticism\ntakes place more formally: in college classrooms, professional journals, academic magazines, and Web sites.\nStudents interpret literary works for English instructors or for students enrolled in English classes. In their interpretations, students may argue\nfor a particular interpretation or they may dispute other critics' interpretations. Alternatively, students may read a text with a particular literary\ntheory in mind, using the theory to explicate a particular point of view. For example, writers could critique The Story of an Hour by Kate Chopin\nfrom a feminist theoretical perspective. Thanks to the Internet, some English classes are now publishing students' interpretations on Web sites.\nIn turn, some students and English faculty publish their work in academic literary criticism journals.\nOver the years, literary critics have argued about the best ways to interpret literature. Accordingly, many \"schools\" or \"theories of criticism\" have\nemerged. As you can imagine--given that they were developed by sophisticated specialists--some of these theoretical approaches are quite\nsophisticated and abstract.\nBelow is a summary of some of the more popular literary theories. Because it is a summary, the following tends to oversimplify the theories. In\nany case, unless you are enrolled in a literary criticism course, you won't need to learn the particulars of all of these approaches. Instead, your\nteacher may ask you to take an eclectic approach, pulling interpretative questions from multiple literary theories.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}