{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nLiterary Criticism\nLiterary Theory and Schools of Criticism\nIntroduction\nA very basic way of thinking about literary theory is that these ideas act as di\u0000erent lenses critics use to view and talk about art, literature, and\neven culture. These di\u0000erent lenses allow critics to consider works of art based on certain assumptions within that school of theory. The\ndi\u0000erent lenses also allow critics to focus on particular aspects of a work they consider important.\nFor example, if a critic is working with certain Marxist theories, s\/he might focus on how the characters in a story interact based on their\neconomic situation. If a critic is working with post-colonial theories, s\/he might consider the same story but look at how characters from colonial\npowers (Britain, France, and even America) treat characters from, say, Africa or the Caribbean. Hopefully, after reading through and working with\nthe resources in this area of the OWL, literary theory will become a little easier to understand and use.\nDisclaimer\nPlease note that the schools of literary criticism and their explanations included here are by no means the only ways of distinguishing these\nseparate areas of theory. Indeed, many critics use tools from two or more schools in their work. Some would de\u0000ne di\u0000erently or greatly expand\nthe (very) general statements given here. Our explanations are meant only as starting places for your own investigation into literary theory. We\nencourage you to use the list of scholars and works provided for each school to further your understanding of these theories.\nWe also recommend the following secondary sources for study of literary theory:\nThe Critical Tradition: Classical Texts and Contemporary Trends, 1998, edited by David H. Richter\nCritical Theory Today: A User-Friendly Guide, 1999, by Lois Tyson\nBeginning Theory, 2002, by Peter Barry\nAlthough philosophers, critics, educators and authors have been writing about writing since ancient times, contemporary schools of literary\ntheory have cohered from these discussions and now in\u0000uence how scholars look at and write about literature. The following sections overview\nthese movements in critical theory. Though the timeline below roughly follows a chronological order, we have placed some schools closer\ntogether because they are so closely aligned.\nTimeline (most of these overlap)\nMoral Criticism, Dramatic Construction (~360 BC-present)\nFormalism, New Criticism, Neo-Aristotelian Criticism (1930s-present)\nPsychoanalytic Criticism, Jungian Criticism(1930s-present)\nMarxist Criticism (1930s-present)\nReader-Response Criticism (1960s-present)\nStructuralism\/Semiotics (1920s-present)\nPost-Structuralism\/Deconstruction (1966-present)\nNew Historicism\/Cultural Studies (1980s-present)\nPost-Colonial Criticism (1990s-present)\nFeminist Criticism (1960s-present)\nGender\/Queer Studies (1970s-present)\nCritical Race Theory (1970s-present)\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}