{"text":" Donate to ISKME\n \nDiscover  Hubs  Groups  Learn More  Add OER Sign In\/Register\nWriting the Literature Review: Research Practices in Instructional\n Student View  Save \nDesign & Technology\n Report\n Details\nAuthor:\nThomas R. Wilson\nSubject:\nEducational Technology, Higher Education\nMaterial Type:\nTextbook\nLevel:\nCollege \/ Upper Division\nTags:\nEducational Technology Graduate Students IDT\nInstructional Design and Technology\nLiterature Review Research Writing\nLog in to add tags to this item.\nShow More\nOverview\nStudents of instructional design now have their own guide for writing a literature review in their graduate programs.\nFocused on the unique requirements of IDT research, this user-friendly text provides step-by-step instructions for\nplanning, researching, and writing a quality literature review. Based on adult learning principles, this book delivers\nstrategies that students will take with them into their careers as instructional designers. This is the actual text that the\nauthor uses in his graduate-level, IDT research courses, and now his strategies are available for other educators to adapt\nand use for their students.\nTitle page\nDear Instructor:\nIn my university's MSIDT program, students write a 5-chapter project and develop an associated instructional\nproduct. This book provides guidance for meeting our program's requirements regarding the literature review,\nwhich is part of the project. Although this textbook periodically references our program's specific requirements, you\nwill also find abundant information that applies to all instructional design and technology students.\nYou are welcome to borrow from and adapt this text to meet your needs, and I hope to hear how it works for you.\nBest Regards,\nThomas R. Wilson, PhD\ndr.trwilson@gmail.com\nWriting the Literature Review:\nResearch Practices in Instructional Design & Technology\nBy Thomas R. Wilson, PhD\nWriting the Literature Review: Research Practices in Instructional Design and Technology by Thomas Royce\nWilson is licensed under a Creative Commons Attribution-NonCommercial 4.0 International License.\nTable of Contents\nUnderstanding Context\n1.1 Demystifying the Process\n1.2 Real-world Readiness\nGetting Started\n2.1 Selecting Your Topic\n2.2 Needs Analysis\n2.3 Learner Analysis\n2.4 Research Question 1 (Theory)\n2.5 Research Question 2 (Instructional Strategies)\nResearching\n3.1 Annotation & Color Coding\n3.2 Organizing Research\n3.3 Theory Tracker\nWriting RQ Sections\n4.1 Writing the Literature Review\n4.2 Answering RQ1 (Theory)\n4.3 Answering RQ2 (Instructional Strategies)\n4.4 Proofreading with Color\n4.5 Synthesis! Synthesis! Synthesis!\n4.6 Boosting Your Lit Review Score\n1.1 Demystifying the Process\nIn the classic movie The Wizard of Oz, Dorothy and her companions tremble with fear as they face the\nthundering wrath and flames of the Mighty Oz. Undaunted by the blustering bully, Dorothy’s little dog Toto\nwanders away from the drama and pulls back a tall curtain to reveal an old man operating controls that\ncreate the illusion of the ominous Wizard of Oz. Toto exposed the Wizard as nothing to be afraid of, and\nonce the group of friends understood that, they were able to get everything they wanted from the old man.\nThrough this book, my goal is to take on the role of Toto.\nIn graduate school, students can sometimes feel a bit overwhelmed by things that they perceive to be more\nominous and unsurmountable than they really are. That’s where this book comes in. As you encounter the\nwide range of new challenges such as research, APA, and academic writing, I will be right there with you to\npull back the curtain and show you that there’s nothing to fear. Together, we will explore real-world\nstrategies for simplifying, focusing, and progressing through the research process.\nTable of Contents\n1.2 Real-world Readiness\nReal-world Skills\nTo be effective, professional instructional designers must have a range of communication and research\nskills. The process of writing a literature review can help you strengthen real-world skills that you can apply\nimmediately in this program and in your career.\nInstructional Design Skills That Apply to the Literature Review Process:\nWriting\nProofreading\nEditing\nAnnotation\nSynthesizing Information\nResearch\nTable of Contents\n2.1 Selecting Your Topic\n5 Tips for choosing the topic of your research project\nChoose what you know.\nWhen you have familiarity with your topic, you can leverage that expertise to identify problems that\ncan be corrected with instruction.\nIdentify an “instructional challenge” that you can fix.\nIf you identify a problem, you must verify that instruction is the right answer. For example, If call\ncenter operators are dropping customer calls at a high rate, we need to see if the problem is lack of\ntraining or if the problem might be equipment problems. Everything isn’t a training problem, and as\ninstructional designers, we must be able to recognize that.\nThis principle also applies in education. Maybe students aren’t performing well on a certain test. Is\nthe performance because they don’t understand, or are there other mitigating circumstances such\nas the testing environment or technology problems that are affecting grades. In those cases,\ncreating new instruction might not be the answer.\nDon’t try to save the whole world.\nThe biggest mistake that students make is that they try to solve too big of a problem. The list below\nhighlights the refining process that you must go through to select a single pebble from among\nmountains of ideas.\nDrilling down to find a manageable topic:\nWorkplace health (too broad)\nWorkplace safety (still too broad)\nWarehouse safety (still too broad)\nNon-mechanized equipment safety (still too broad).\nLadder safety. (Yes!)\nSlices are OK:\nMaybe you have grand plans to create a multi-part training series for your employer. That scope\nwould be too big for your MSIDT project. However, you can take just a slice of what you plan to do,\nand then develop that as your product. For example, you could create a pilot for the upcoming\nseries of lessons or create a portion of a segment.\nTable of Contents\n2.2 Needs Analysis\nWhat is the Instructional Challenge?\nIs instruction needed? If so, what must be addressed? We answer those questions by conducting a needs\nanalysis. When conducting a needs analysis for an instructional product, instructional designers aim to\nidentify and assess the gap between the current state (what learners know and can do) and the desired\nstate (what learners should know and be able to do). The needs analysis determines whether an\ninstructional solution is necessary and what problem the instruction must address. Below are key steps and\nconsiderations for conducting a needs analysis.\n1. Define the Purpose and Scope:\nNarrow your focus to a specific problem or performance gap that needs corrected.\n2. Identify Target Audience:\nWho needs your instructional product? If you find that more than one group needs training, focus on only\none group for now. Later, with a different instructional product, you can address the other audience(s). One-\nsize-fits-all does not work well in training. For example, when creating training for a new timekeeping\nsystem, a training course for employees would differ from a course for supervisors, even though there will\nbe some overlap in content.\n3. Gather Data:\nCollect data through various methods to understand the current situation.\n4. Analyze Data:\nAnalyze the data you've gathered to identify gaps and discrepancies between the current and desired\nstates. Look for patterns and trends that reveal the root causes of the problem.\n5. Determine Training Needs:\nBased on your analysis, determine if instruction is required to address a performance gap or other problem.\nAnalyze the problem to identify a specific problem that needs corrected.\n6. Set Learning Objectives:\nIf training is deemed necessary, define clear and measurable learning objectives. Objectives should specify\nwhat learners should know or be able to do after completing the instruction. Objectives must be\nmeasurable. For example, it's not enough to say \"Learners will understand...\" because that can't be\nmeasured objectively. A measurable outcome would be, \"Learners will demonstrate their understanding by\ncompleting a customer order within 5 minutes and with 95% accuracy.\"\n7. Consider Constraints and Resources:\nIdentify any constraints that may impact the design and implementation of the instructional product, such as\nbudget, time, technology, and available resources.\n8. Consult Subject Matter Experts:\nCollaborate with subject matter experts (SMEs) regarding the accuracy and relevance of proposed\ninstructional content. Working with a SME provides good practice for work as an instructional designer.\nTable of Contents\n2.3 Learner Analysis\nWho is your audience?\nIdentify who will be using your learning product. What are their characteristics, attitudes, and circumstances\nthat could affect how well they engage with, and respond to, your proposed training? Knowing your\naudience helps you tailor your instructional product to meet learners' specific needs, preferences, and\ncharacteristics.\nFollow these steps when conducting a learner analysis:\n1. Restate the Learning Goals:\nRestate the learning goals that were defined during the Learner Analysis. This helps maintain focus on what\nlearners must be able to do after completing the instruction.\n2. Define the Target Audience:\nIdentify your learners, and be specific. The size and characteristics of your audience will be determined by\nthe problem that you plan to solve.\nNarrowing a target audience:\nEducators (too broad)\nHigher Education Faculty (still too broad)\nHigher-ed Faculty who teach online (better)\n3. Determine Audience Characteristics:\nWhat could affect your target audience's ability to meet the objectives of your instructional\nproduct? Identifying the characterisitcs of your audience enables you to tailor the instructional product to\nmeet learner needs. For example, a single parent with a high school education who works two minimum-\nwage jobs to support four children may not be able to complete an instructional product that's designed for\nretired college professors. Answer the prompts below to analyze your learners.\nPersonal Characteristics\nAge range?\nEducation level?\nMarital status?\nFamily status?\nIncome\/pay?\nNumber of concurrent jobs?\nKnowledge\nLevel of knowledge about the topic?\nLevel of knowledge about the problem?\nAre they aware of the problem?\nAttitude\nAttitude toward the topic\/problem?\nAttitude toward training and learning?\nAttitude toward technology\/internet?\nAbility\nPhysical ability to use your instructional product?\nIntellectual ability to use your instructional product?\nAvailable time to use your instructional product?\nAccess to your instructional product?\nWhat circumstances\/barriers could affect their ability to participate fully?\n4. Create a Learner Profile:\nSummarize your findings into a concise learner profile that highlights the key characteristics, preferences,\nand needs of your target audience. Refer to the profile throughout the instructional design process to ensure\nthat you stay focused on the needs and capabilities of your audience. These profiles are often called\n“personas.”\nTable of Contents\n2.4 Research Question 1 (Theory)\nThe Purpose of Research Questions\nResearchers conduct studies, and they write about those studies in journal articles and books. That general\nbody of research is called \"literature.\" As you read the literature, you will see what others have written about\nthe topic you are researching. You will review, analyze, and synthesize that information to write what is\ncalled a literature review. The first step in the literature review is to write research questions.\nA research question (RQ) poses a question about your topic. It is then your job to search scholarly literature\nfor the answer to that question. The number and focus of research questions depends upon a researcher's\npurpose. Your MSIDT project will have two research questions. Research Question 1 addresses theory, and\nResearch Question 2 addresses instructional strategies.\nThe Role of Theory in Research\nResearch Question 1 (RQ1) deals with theory. Think of a theory as ethnic cuisine. Many restaurants serve\nchicken. However, depending on the restaurant (Thai, Mexican, Italian, etc.), that chicken will have a\ndifferent flavor based on the ethnic tradition of the restaurant. In our example, learning is like the generic\nchicken, and the different theories are like the different restaurants that have their own way of interpreting\nand approaching the meal. The restaurant you choose determines how the chicken will be prepared.\nLikewise, the theory you choose will determine how the instruction will be conducted.\nYour RQ1 can include more than one theory. For example, a training module might have a behaviorist\nelement (video tutorial) and a constructivist element (play a game). Therefore, both theories, behaviorism\nand constructivism, could be addressed in RQ1.\nRQ1 Requirements\nYour Research Question 1 must meet the following criteria:\n1. The question focuses specifically on theory (with no mention of strategies or assessment).\n2. The question has a complex answer. (It is not a yes\/no question.)\n3. The answer requires research.\n4. The question is open to debate.\n5. The question avoids absolutes such as “best,” “most effective,” etc.\n6. The question does not ask \"why.\"\nRQ1 Styles\nRQ1 addresses theory, and it can do so in three different ways.\nExploratory RQ (Recommended for Beginners)\nFor your MSIDT project, you must develop a research question that addresses theory. Unless you know\nwhat theories are out there and which one(s) you want to research, I recommend using an exploratory RQ.\nAn exploratory RQ asks about theories in general rather than focusing on a specific category of theories or\nan individual theory. This general approach will give you an instant start in working toward your final\nliterature review, even if you are unfamiliar with learning theories. This flexible style can serve as the RQ in\nyour final project, or you can narrow it later as you learn more about theories. Here are examples of\nexploratory research questions:\nWhich learning theories can provide relevant guidance when developing online courses to teach\nadult learners over the age of 50?\nWhich learning theories can be appropriate when creating lessons for third grade students in\ncomputer classes?\nFor technical training at a distance, which learning theories can be appropriate?\nWhich learning theories have been cited in research about successful mobile-learning?\nWhich learning theories have guided successful online training courses for frontline employees?\nCategory-based RQ:\nThe category-based RQ narrows the focus to a general category of theories (behaviorism, cogntivism,\nconstructivism). This RQ style can work if you have a general sense of the theories that have relevance to\nyour purpose and audience. Consider the samples below.\nWhy can constructivism be an appropriate theory for developing instruction that guides\nsupervisors in hiring practices?\nWhich aspects of constructivism can have relevance when teaching college faculty the basics of\nvirtual reality?\nWhy are aspects of constructivism and cognitivism applicable to the design of effective language\nlearning experiences in digital platforms?\nIn what ways has successful mobile-learning have reflected the perspective of connectivism?\nSpecific-Theory RQ:\nIf you have identified a specific theory (or theories) that relate to your audience and purpose, you can name\nthe specific theory in your RQ. Here are some examples.\nWhich components of Knowles theory of andragogy can be effectively applied in online\neducation?\nWhat guidance do research-based multimedia theories provide concerning the effect of CBT\ndesign?\nWhat components of Keller’s ARCS model of motivation can be applied to training development\nfor newly-hired assembly line technicians.\nHow can the learning theories of connectivism and transformative learning be integraterd within\nfully online asynchronous classes to support and teach underserved students?\nTable of Contents\n2.5 Research Question 2 (Instructional Strategies)\nInstructional Strategies\nRQ2 references instructional strategies. Through your review of literature, you will answer RQ2 to determine\nwhich instructional strategies are the best fit for your product’s audience, guiding theory(ies), and\ninstructional situation. Each instructional strategy must align with the theory that you have chosen.\nTo use the restaurant example, if I go to a Chinese restaurant (theory), I expect Chinese food (strategies),\nnot a chicken taco. The same principle applies to your literature review. If your RQ1 focuses on\nconstructivism, your RQ2 section must feature studies that focus only on constructivist instructional\nstrategies.\nRQ2 Requirements\nYour Research Question 2 must meet the following criteria.\n1. The question focuses specifically on instructional strategies.\n2. The question has a complex answer. (It is not a yes\/no question.)\n3. The answer requires research.\n4. The question is open to debate.\n5. The question avoids absolutes such as “best,” “most effective,” etc.\n6. The question does not ask why.\nRQ2 Styles\nWhen addressing instructional strategies, RQ2 options range from the general to the specific. Keep in mind\nthat the theories that you choose must align with your guiding theory.\nExploratory RQ (Recommended for Beginners)\nIn the following examples you’ll see that rather than asking about a specific strategy or strategies, the RQ is\nopen to all instructional strategies. Unless you know what strategies are out there and which one(s) you\nwant to research, I recommend using the exploratory RQ for this class. The exploratory RQ gives you an\ninstant start. This flexible style can be in your final project, or you can adapt it later as you learn more about\ntheories. Consider the following examples.\nWhat are effective instructional strategies for online learners who have limited computer\nknowledge?\nWhich online instructional strategies promote transfer of second language acquisition to non-\ndigital tasks?\nWhat online instructional strategies can prepare faculty to successfully implement virtual reality in\ntheir college classes?\nWhich instructional strategies can support increased passing rates among technicians who take\nX9R certification training\nTheory-specific RQ:\nIf you have identified a theory in RQ1, you can reference that theory in RQ2 when addressing your\ninstructional strategies. Here are some examples:\nWhich cognitive and behaviorist teaching strategies can help university faculty acquire basic\nproficiency with their university’s learning management system (LMS)?\nWhich constructivist instructional strategies are most effective when teaching teens about\nparenting?\nWhich behaviorist instructional strategies can improve safety scores among Level 2 warehouse\nworkers?\nWhich constructivist instructional strategies can help call center employees develop strong\ncustomer service skills?\nWhich cognitive and constructivist instructional strategies can prepare K-12 teachers for writing\ntheir teaching-philosophy paper.\nStrategy-specific RQ:\nIf you have identified a theory in RQ1, you can name a specific instructional strategy in RQ2. Keep in mind\nthat the instructional strategy must align with your designated learning theory. Here are some examples.\nHow does the scaffolding of online instruction affect the motivation of learners who possess a\nproblem-centered orientation to learning?\nHow can annotation strategies improve readers’ understanding and retention of what they read?\nHow do segmenting and personalization affect learning from multimedia instruction?\nIn what ways can collaborative learning be successfully integrated into an online learning\nenvironment?\nWhat direct-instruction strategies are effective in asynchronous online learning?\nTable of Contents\n3.1 Annotation & Color Coding\nA Real-world Skill\nWhen researching for a literature review, you will read hundreds of pages. As you find material that you can\nuse in your writing, you will need a way to organize that material for future reference. The first step of\norganization is annotation.\nOne annotation strategy that works well for me is color coding. As an instructional designer, I review large\namounts of information. That information needs to be broken down into categories before I can figure out\nhow to organize it for instruction. I use color coding to tackle the task.\nColor-coding Annotation Strategy\nInstructions\n1. Print the article or display the article on your computer screen.\n2. Read the article, and as you read, highlight theory-related information (RQ1) with yellow, and\nhighlight instructional strategies (RQ2) with green.\n3. Write notes in the margins to identify other key information.\n4. You can assign additional colors for information about target audience, assessment, or other\nthings that you deem important. At the top of the page, write color codes that explain what each\ncolor means.\n5. After reading an article, you might find it helpful to give it a rating at the top of the page.\nImage 3.1 illustrates how the combination of color coding and written annotation can provide rich\ninformation for quick reference.\nImage 3.1: Annotated article that has color and notes to identify relevant content.\nTable of Contents\n3.2 Organizing Research\nGet Organized\nAs you review articles, it is important to organize them in a way that allows you to find specific information\nwhen you need it. The following ideas and resources can help you organize your research.\nLit-Review Matrix\nWhen reading research for a literature review or other research project, it is important to organize your\nresources so that you can access them later when it's time to write. I use something that I call the Lit-\nReview Matrix.\nImage 3.2. Lit-Review Matrix that is used to document key information from reviewed sources\nThe Lit-Review Matrix is a spreadsheet that allows you to organize the key information of articles that you\nread. I like using online tools like Google Sheets, but any spreadsheet software will work. This online\ntemplate can be copied online or downloaded as an Excel or open-source file.\nThe list below identifies what goes into each column within the matrix.\nMatrix Columns\nA: Author & date\nB: URL, a link to article\nC: Population that was studied\nD: Theory or theories of the study (Relates to RQ1)\nE: Instructional strategies that were used (Relates to RQ2)\nF: Results\/Conclusion\/Discussion from the article.\nG: Limitations of the study that have relevance to your project\nH: Connections for Synthesis - Document connections to other studies. This\nsupports synthesis, which is the transformation of information from multiple sources into a new\ncomposite observation. As you research, you’ll find yourself coming back to this column to add\ninformation about new connections that you discover.\nI: Project Relevance: Note how the study relates, or doesn't relate, to your research project.\nJ. Notes\nTable of Contents\n3.3 Theory Tracker\nIf an article does not clearly identify a guiding theory, consult the Theory Tracker below to determine the\nguiding theory behind an instructional strategy. Although the Theory Tracker does not include every theory, it\ndoes contain many of the best known theories.\nTheory Tracker:\nInstructions:\n1. Locate an instructional strategy in Column C.\n2. Find the strategy's associated theory(ies) in Column B and\/or A.\nTheory Tracker\nA: Foundational Theory B: Derivative Theories C: Instructional Strategies\nBehaviorism: (Teacher- Direct Instruction: Information is\ncentered) presented in small components,\nand learners are required to\nAssociated with psychologists like\nmaster simpler skills before\nB.F. Skinner, focuses on\nproceeding to more difficult skills.\nobservable behaviors and their\n(Includes lecture and tutorials).\nassociation with stimuli in the\nenvironment. Drill and Practice: Use repetitive\nexercises to reinforce learning.\nLearning is seen as a passive\nactivity that results from Reinforcement: Provide positive\nconditioning, where behaviors are reinforcement (rewards) for\nshaped through reinforcement desired behaviors and correct\nand punishment. Learners are responses to encourage\nconsidered passive recipients of repetition.\nknowledge from the teacher.\nPunishment: Apply negative\nconsequences for undesirable\nbehaviors to discourage their\noccurrence.\nCognitivism: Focuses on how Cognitive Load Theory: Scaffolding: Provide support,\ninformation is received, Emphasizes the limits of the guidance, and feedback to help\norganized, stored and retrieved mind’s ability to process learners progress through\nby the mind. It considers the mind information based on the incremental stages of\nas an information processor, like difficulty and amount of understanding complex\na computer. information. concepts.\nMetacognition Theory: Chunking: Break down complex\nProposes that students can information into smaller chunks to\nactively monitor and regulate facilitate easier encoding and\ntheir own thinking processes processing.\nto forster more effective\nRepetition and Review:\nlearning.\nSchedule regular review sessions\nSchema Theory: Suggests to reinforce memory and prevent\nthat individuals organize forgetting.\ninformation into mental\nframeworks or \"schemas.\"\nLearning involves the\nactivation and modification of\nthese schemas as new\ninformation is encountered.\nConstructivism: Derived from Experiential Education: Problem-Based Learning\nthe work of Piaget and others, Based on “learning by doing,” (PBL): PBL encourages students\nconstructivism suggests that this theory posits that to solve real-world problems\nlearning is an active process in learning occurs through collaboratively, promoting active\nwhich learners construct new experiences, including learning and the construction of\nknowledge by integrating new cognition, emotions, and knowledge.\ninformation with their existing interaction with\nCollaborative Learning:\nmental structures. Learning is environmental factors.\nEncourage learners to work\ninfluenced by social interaction\ntogether in groups, sharing their\nand personal experiences.\nperspectives and constructing\nknowledge collectively.\nReflection Activities: Prompt\nlearners to reflect on their\nexperiences and connect them to\nexisting knowledge, fostering the\nconstruction of new insights.\nInquiry-Based Learning: This\napproach encourages students to\nask questions, investigate topics,\nand construct their own\nunderstanding through hands-on\nexploration.\nSimulations, Scenarios, Role-\nPlaying: Create virtual or real-life\nscenarios for learners to engage\nin experiential learning, allowing\nthem to apply knowledge in\ncontext.\nField Trips and Site Visits: Offer\nopportunities for learners to\nexperience hands-on learning in\nreal-world environments.\nSocial learning theory: Based Social Constructivism: Modeling: Use role models or\non the idea that students can Unlike social learning theory examples to demonstrate desired\nlearn from watching or imitating that emphasizes the behaviors and outcomes for\nothers. The instructor is a role instructor as a role model, learners to observe and imitate.\nmodel. this theory suggests that\nCollaborative Learning: Create\nthrough self-directed social\nopportunities for learners to\ninteraction and collaboration\ninteract, discuss, and learn from\nwith each other, learners\neach other's experiences and\nconstruct knowledge.\nviewpoints.\nPeer Teaching: Assign learners\nto teach or explain concepts to\ntheir peers, enhancing their\nunderstanding through teaching\nothers.\nConnectivism: This relatively Online Learning Communities:\nrecent theory highlights the Create platforms for learners to\nimportance of networks and connect with others, share\ndigital technologies in learning. It resources, and collaborate on\nsuggests that learning occurs projects using digital tools.\nthrough connections between\nNetworked Learning: Encourage\npeople, information sources, and\nlearners to explore and utilize\ntechnology.\ndiverse online resources to gather\ninformation from various sources.\nHumanism: Humanistic theories, Self-Directed Learning:\nsuch as those by Carl Rogers Empower learners to set their\nand Abraham Maslow, focus on own learning goals, pace, and\nthe individual's self-determination pathways based on their interests\nand potential for growth. Learning and needs.\nis seen as a self-directed process\nPersonalized Learning: Tailor\ndriven by personal motivations\ninstruction to accommodate\nand needs.\nlearners' individual preferences,\nstrengths, and learning styles.\nFeedback and Support: Provide\npositive and constructive\nfeedback to support learners' self-\nesteem and growth.\nMultiple Intelligences:This Differentiated Instruction: Varied Activities: Design\ntheory proposes that intelligence This theory suggests tailoring learning experiences that cater to\nis not a single, general ability, but instruction to accommodate different intelligences, such as\nrather a collection of distinct the diverse range of students' incorporating music, movement,\nabilities or \"intelligences\" that intelligences and learning group discussions, and artistic\nindividuals possess to varying preferences. expression.\ndegrees. These include linguistic,\nlogical-mathematical, musical,\nspatial, bodily-kinesthetic,\ninterpersonal, intrapersonal, and\nnaturalistic intelligences.\nAndragogy: (Adult learning Self-Assessment: Encourage\ntheory) learners to self-assess their\nprogress and learning needs,\nFocuses on the principles of adult\ntaking an active role in their\nlearning, suggesting that adults\neducation.\nhave specific learning needs and\npreferences that differ from those Real-Life Application: Design\nof children. It emphasizes self- learning activities that relate to\ndirected learning, practical learners' professional\nrelevance, and the value of experiences and goals. Create\nlearner experience. learning activities that build real-\nworld skills that can transfer to\nlearners' lives outside the\nclassroom.\nSituated Learning: This theory Communities of Practice: Apprenticeships: Pair novices\nasserts that learning is closely Posits that groups of people with experts in real-world contexts\ntied to the context in which it who share a concern or to learn through observation,\noccurs. Learning is most effective interest develop expertise participation, and immersion.\nwhen situated within authentic, and shared understanding\nCase-Based Learning: Present\nmeaningful activities and through collaboration and the\nlearners with real-life scenarios\ncommunities of practice. sharing of best practices.\nthat require them to apply their\nknowledge to practical situations.\n4.1 Writing the Literature Review\nPurpose of a Literature Review\nThe goal of the literature review is to determine what researchers have discovered about the topic you plan\nto investigate. You accomplish this by reading scholarly literature to see how researchers have approached\nan instructional challenge that is similar to the one you want to solve, and then consider what they\ndiscovered. You will search the literature to find out what has worked and what hasn’t. You will then consider\nthat collected information when shaping your research and instructional product.\nWriting \"RQ Sections”\nThe literature review's purpose is to find research that can answer each of your research questions. I've\ncreated a process to help you do that. The process involves \"RQ Sections.\" An RQ Section begins with a\nresearch question. Underneath the research question, you will discuss how the literature answers the\nresearch question.\nYour final research project will have two RQs. Therefore, you will have two RQ sections. When completed,\nan RQ section will have multiple pages that discuss how the research answers the associated RQ.\nInstructions:\n1. Insert the RQ and make it bold. (Next term, when you finalize your literature review, you will\nremove the RQ.)\n2. Write paragraphs that answer the RQ with cited literature.\nImage 2. Sample RQ Section that contains the Research Question and associated paragraphs.\nFocusing Questions\nUse the following generative writing prompts to jump start and focus your writing. When you take time to\nanswer the questions thoughtfully and thoroughly, you will generate many paragraphs that will soon turn into\nmany pages. You can then shape your raw answers into a literature review.\nJust start writing! Let it flow!\nGeneral questions\nWhat does research have to say about the problem that I plan to solve?\nWhat does research have to say about my target audience, or a similar demographic?\nWhat does research have to say about learning theories that may be relevant to my topic,\ninstructional problem, and\/or target audience?\nWhat does research have to say about instructional strategies that can be used to address my\ninstructional problem and\/or target audience?\nQuestions for specific articles\nHow well does this study answer my RQ1 and RQ2? Why? Give details.\nWhat relevant issues did the study fail to address (if any)? These are called “research gaps,” and\nyou can discuss these gaps in your literature review.\nDo's and Don'ts of Writing an RQ Section\nDo:\nFocus only on answering the designated research question.\nRefer to authors by last names, not first names.\nFocus on what others have discovered rather than your opinion or beliefs.\nDefine acronyms when they are introduced.\nDon’t:\nInclude extraneous study details that don't answer the research question.\nUse colloquialisms (e.g. “early bird,” “driver’s seat”) or slang.\nTable of Contents\n4.2 Answering RQ1 (Theory)\nTips for Writing About Theories\nTheories are assumptions, not facts. Never present a theory as fact. For instance, it is incorrect to write,\n“Learners construct knowledge rather than just passively take in information.” That statement is a debatable\nassumption that is associated with a theory. Never state an assumption as a fact, and always credit the\nassumption to its theory. Here’s one way to rephrase the sentence for accuracy. “According to\nconstructivism, learners construct knowledge rather than just passively take in information (citation).”\nTheories do not teach. Theories influence how people teach others. Never say that a theory \"teaches.\"\nBeware of capitalization. Theories are not capitalized unless they are based on a proper noun. For\nexample, the theory of constructivism is not capitalized.\nWriting Your RQ1 Section\nFocus: Write only about the theory(ies) and information that answer RQ1. Do not include irrelevant\ninformation from a study.\nDefine: Don’t assume that people know about the theory you are discussing. When you mention a theory\nfor the first time, briefly summarize the theory in your own words. Do NOT directly quote someone else’s\ndefinition.\nDiscuss Assumptions: When introducing the theory, discuss its key assumptions. What does the theory\nassume about learners? About our brains? About learning? About educators? About your specific target\naudience? About technology? About the learning environment?...and how do those assumptions relate to\nyour target audience and\/or your project?\nConnect: Find ways to connect the theory to your target audience or project. Establish its relevance to your\nresearch.\nSynthesize: If you are discussing multiple theories, discuss their similarities and differences. That process\nis called synthesizing, and we’ll learn more about that later.\nTable of Contents\n4.3 Answering RQ2 (Instructional Strategies)\nEffective Writing Strategies\n1. Define: Never assume that people know about the instructional strategy that you are discussing.\nWhen you mention an instructional strategy for the first time, briefly summarize it in your own\nwords. Do not directly quote a definition!\n2. Connect to Theory: Establish the strategy’s connection to its guiding theory and explain how the\ntheory influences the way the instruction is designed and executed. If you're not sure what the\ntheory is, use the Theory Tracker to identify an instructional strategy's underlying theory.\n3. Discuss Effectiveness: Explain how well the study's chosen strategy worked for achieving the\ndesired results with its target audience.\n4. Discuss Challenges: In the study, what challenges did this strategy pose for learners? For\neducators\/trainers? Were there challenges with equipment, time, costs, environment?\n5. Eliminate This Word: Remember that in educational and psychological research, we never\n“prove” anything. Study findings “suggest” or “indicate,” but they don't prove.\n6. Connect to the Challenge: Connect an instructional strategy to your audience and\/or\ninstructional challenge.\n7. Discuss Combinations: If you are discussing multiple instructional strategies, explain why the\ncombination is appropriate? Discuss their similarities, how they differ, and how they might have a\ncomplementary effect.\n8. Don't Capitalize. Do not capitalize instructional strategies.\nTable of Contents\n4.4 Proofreading with Color\nIMPORTANT: An RQ section must focus only on answering its associated Research Question.\nAfter you have written an RQ section, color code it to see how well you answered the RQ.\nInstructions:\n1. Read the RQ section and highlight all wording that helps answer the RQ. Ask yourself, \"Do\nthese words answer the RQ?\" If the wording answers the RQ, highlight it.\n2. If wording does not have highlights, delete it. Some connecting phrases will not have highlights,\nbut everything else in the RQ Section should be highlighted. (If relevant, you might be able to\nmove some deleted information to the other RQ section where it belongs.)\n3. As you revise and add content to the section, repeat the process of proofreading and highlighting\nto screen out information that doesn't belong.\nImage 4.4 illustrates color coding for RQ1. In an RQ1 Section, the majority of the wording should be\nhighlighted yellow.\nImage 4.4: Comparison of Strong and Weak RQ Sections\n(Comparison of Good and Bad RQ Sections by Thomas Royce Wilson is licensed under a Creative\nCommons Attribution-NonCommercial 4.0 International License.)\nTable of Contents\n4.5 Synthesis! Synthesis! Synthesis!\nThink of Photosynthesis\nWhen writing a literature review, we must do more than just report what different studies have found. As\nresearchers, we need to find the similarities and differences among our sources and then discuss how those\nfindings relate to our proposed study. We call that process \"synthesis.\"\nSynthesis is the process of analyzing and interpreting separate streams of information in\norder to communicate the ideas in a new form.\nTo understand synthesis in writing, think of photosynthesis that you learned about in grade school.\nPhotosynthesis is the process by which plants transform diverse resources (sunlight, water, and carbon\ndioxide) into new elements (oxygen and sugar). When we synthesize sources in writing, we combine and\ninterpret information from multiple sources in order to transform them into a conclusion for the reader.\nQuestions to Generate Synthesis\nAfter answering the focusing questions in Chapter 4.1, you’ll have written pages of information for each RQ\nsection. You need to synthesize that collected information. Look at everything you’ve written for an RQ\nSection and search for patterns, agreement, disagreement, and gaps in the research. An easy way to do\nthis is to answer the following questions. As you answer a question, you will automatically synthesize\ninformation.\nWhich studies have results that are similar to each other?\nOn what key points do they agree?\nHow does that agreement have relevance for your study?\nWhich studies have conflicting results?\nOn what points do they disagree?\nHow does that disagreement have relevance for your study?\nOn what points do they agree?\nWhy and how do past studies still relate to your current study even though times and conditions\nhave changed?\nWhy might past studies not apply to your current study because the times and conditions have\nchanged. (For example, in past studies about mobile phones, participants complained about tiny\ndark screens. That is no longer a concern with contemporary smartphones, so that change in\ntesting conditions could be mentioned.)\nWhat research do you want to see that doesn’t exist? That’s called a “research gap.”\nWhat trends or patterns do you see in the studies that you’ve read? How do the trends or\npatterns relate to your study?\nSynthesis Examples\nSynthesis can take different forms. When writing, consider the following synthesis strategies.\nExample 1: Synthesize similarities\nSeveral researchers suggest that an online student’s testing environment has a greater influence\non test performance than the type of device used to take the test (Smith, 2015; Traxler, 2009;\nGreen et al., 2020).\nIn Example 1 above, notice how multiple sources are cited together. By identifying a common point in three\ndifferent sources, the author shows how the sources agree on that point. This provides better context for the\nreader than if the individual findings were discussed independently.\nExample 2: Contrasting differences\nOften m-learning definitions have centered on the type of device used in learning, including laptops\n(e.g., Wurst & Gaffney, 2008), PDAs (e.g., Chen et al., 2003), tablets (e.g., Sung & Mayer, 2013),\ncell phones (e.g., Thornton & Houser, 2005), and smartphones (e.g., Vasquez-Cano, 2014).\nIn Example 2, sources are synthesized to show their differences. Bringing five diverse examples into one\nsentence makes the point more effectively than if readers had to gather these definitions from five locations\nthroughout the literature review.\nExample 3: Synthesizing to explain\nDistance educator’s have always sought to provide learning at a student’s convenience. Now m-\nlearning allows educators to offer anytime, anywhere access (Ally, 2009; Gebb & Young, 2014)\nthrough a learning management system, which is known as an LMS (Crescente & Lee, 2017).\nIn Example 3, the writer synthesizes several sources to explain a point in two flowing sentences. The first\nsentence and the start of the second sentence come from the first two sources. The end of the second\nsentence comes from a third source. By synthesizing three sources into two sentences, the writer makes a\npoint clearly and concisely.\nExample 4: Exposing research gaps\nWood (2006) contends that most literature about accreditation focuses primarily on the product of\naccreditation rather than the process. The literature cited in this review supports Wood’s claim. Of\nthe eight reviewed sources that discuss accreditation (e.g., Brittingham, 2008), only one researcher\n(Wood, 2006), gives recommendations for writing an accreditation self study.\nIn Example 4, the writer compares and contrasts various sources to see what the sources say about the\ntopic to be studied. As a result, the writer identifies where research is lacking.\nRegarding style, notice that the second citation uses “e.g.,” which is the latin abbreviation for “for example.”\nThe writer cites a sample source rather than listing all eight sources. Providing one example sufficiently\nmakes the point.\nExample 5: Justifying research design\nThis research project will allow participants to use their own smartphones for two reasons. First,\nstudents generally want to learn on their own mobile devices (Bradley et al., 2009). Second, having\nstudents use their own smartphones may make these results more generalizable (Gedik, et al.,\n2012).\nIn Example 5, the author synthesizes sources to show how other studies have helped shape the design of\nthe current study. This use of synthesis illustrates the primary goal of a literature review. As researchers, we\nlook for guidance from other studies, and we then transform that information into our own approach that fits\nour unique research situation.\nTable of Contents\n4.6 Boosting Your Lit Review Score\nBelow, I provide some strategies for earning full credit on the five standards of the Lit-Review QA Checklist\nthat you will submit with each draft of your literature review. (The Checklist is a downloadable Google Doc.)\nStandard 1: Improvement\nIn your first draft, I will note areas for improvement. On your second draft, if you made the recommended\nimprovements, you will receive full credit for Standard 1. If recommended corrections are not made in\nsubsequent drafts, Standard 1 receives zero points until the recommended corrections are made.\nStandard 2: APA Formatting\nThe Lit-Review QA Checklist identifies the specific APA items that will affect your literature review grade.\nThis checklist makes a handy reference for any of your APA writing. (For general APA guidance, consult\nAPA's helpful Student Paper Checklist.)\nAPA Tips\n1. Cheat Sheet: The Lit-Review QA Checklist highlights the primary types of in-text citations. Create\na “cheat sheet” for each citation type. You can use APA Table 8.1 as a starter.\n2. Search: After citing all sources, use Word’s “find” function to search for a left parenthesis “(.” That\nwill help you find most of your citations for proofreading. However, you will still need to proofread\nthe old-fashioned way to find citations that you forgot to put in parentheses, or content that\nrequires a citation. Use the find function repeatedly throughout your proofreading process.\n3. APA 7th edition does not require a running head on student papers.\n4. Academic writing uses third-person tense. \"This study's researcher\" is preferred over \"I.\"\nStandard 3: Mechanics and Style\nThe term “mechanics” refers to spelling, grammar, punctuation, and capitalization. Don’t rely solely on auto\nspell check and grammar check. Read your sentences aloud and look for errors. Reading aloud will help\nyou catch errors and refine your writing. Reading aloud works!\nStyle refers to the flow of your writing. In literature reviews, students often stitch wording together from\ndifferent sources, which results in long, awkward sentences. Sometimes the rambling isn’t even a real\nsentence. To earn credit for Standard 3, your literature review must not contain awkward or confusing\nsentences.\nImprovement Strategies\nStep 1 - Identify: The best way to identify awkward sentences is to read your writing out loud.\nAwkward sentences are difficult to read out loud. Therefore, convoluted wording is easier to\nidentify when we can hear it.\nStep 2 - Divide: To correct an awkward sentence, break the long sentence into shorter\nsentences. Shorter sentences are easier to control, and they reduce your chances of creating\ngrammatical errors. Remember: shorter is better.\nStep 3 - Use Plain English: If you don’t understand what you’ve written, neither will your reader.\nSay things in your own words, and in a way that you understand. Read sentences out loud to\nmake sure they are actually sentences, and that they clearly communicate in plain language.\nPuctuation Strategies\nStudent writers often misuse commas. The following sentence contains a common punctuation error where\na comma is placed between two potential sentences.\nThe self-paced training is for experienced employees, the in-person training is for new employees.\nHere are options for correcting the sentence above.\nOption 1: Create two sentences.\nThe self-paced training is for experienced employees. The in-person training is for new employees.\nOption 2: Join the two sentences with a comma and a coordinating conjunction such as but, yet,\nand.\nThe self-paced training is for experienced employees, but the in-person training is for new\nemployees.\nOption 3: Create two sentences, and start the second sentence with \"however\" followed by a\ncomma.\nThe self-paced training is for experienced employees. However, the in-person training is for new\nemployees.\nStandard 4: Research Question Alignment\nYou earn credit for Standard 4 when you follow the color-coding instructions for RQ Sections.\nStandard 5: Chapter 2 (Literature Review) Requirements\nYou must cite your sources when you provide information that is not common knowledge. When in doubt,\ncite it.\nDON’T USE DIRECT QUOTATIONS! I understand that it is easier to copy and paste someone else’s words\nrather than think of your own. However, dependence on direct quotations is a bad habit. In this course, I\nallow students up to one direct quotation per literature review if the quotation is brief and if there is a\ncompelling reason for it. Exceeding the limit results in no points for Standard 5. If you think your information\nwarrants more than one direct quotation, contact me early in the writing process, so we can discuss it.\nConclusion:\nIf you’re beginning to think that proofreading and effective writing take much time and effort, you are correct.\nWe’re instructional designers…it’s what we do. As with any skill, the more you practice, the better you\nbecome.\nYou can do this!\nTable of Contents\nAbout the Author\nThomas Royce Wilson teaches instructional design and technology courses at California State University,\nFullerton in the Master of Science in Instructional Design and Technology (MSIDT) program. In higher\neducation, he has served as director of online learning, associate dean of online learning, and as an\ninstructional designer. Prior to entering higher education, Dr. Wilson taught high school English.\nA former TV writer\/producer, Dr. Wilson injects his award-winning multimedia expertise into his online\ncourses. As a professional writer and instructional designer, Dr. Wilson's consulting services include the\nareas of user experience (UX), instructional design, writing\/editing, and multimedia.\nThomas has a PhD in instructional design and technology from Old Dominion University and an MSIDT from\nCalifornia State University, Fullerton. He has a bachelor of science degree in mass communications from\nthe University of Southern Colorado, and a minor in business administration.\nContact:\ndr.trwilson@gmail.com\nLinkedIn\nTable of Contents\nDiscover Community Create Our Services My Account Subscribe to OER Newsletter\nResources All Hubs Open Author About Hubs My Items\nSubscribe\nCollections All Groups Submit a Resource About OER Commons My Groups\nConnect with OER Commons\nProviders OER 101 My Hubs\n \nHelp Center\n Donate to ISKME\nPowered By\nTerms of Service Privacy Policy DMCA\nA project created by ISKME. Except where otherwise noted, content on this site is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0 License.\n© 2007 - 2023, OER Commons\ntroppuS "}