{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nAnalyzing Short Fiction\nHow to Analyze a Short Story\nWhat is a Short Story?\nA short story is a work of short, narrative prose that is usually centered around one single event. It is limited in scope and has an introduction,\nbody and conclusion. Although a short story has much in common with a novel (See How to Analyze a Novel), it is written with much greater\nprecision. You will often be asked to write a literary analysis. An analysis of a short story requires basic knowledge of literary elements. The\nfollowing guide and questions may help you:\nSetting\nSetting is a description of where and when the story takes place. In a short story there are fewer settings compared to a novel. The time is more\nlimited.\nHow is the setting created? Consider geography, weather, time of day, social conditions, etc.\nWhat role does setting play in the story? Is it an important part of the plot or theme? Or is it just a backdrop against which the action\ntakes place?\nStudy the time period which is also part of the setting.\nWhen was the story written?\nDoes it take place in the present, the past, or the future?\nHow does the time period a\u0000ect the language, atmosphere or social circumstances of the short story?\nCharacterization\nCharacterization deals with how the characters in the story are described. In short stories there are usually fewer characters compared to a\nnovel. They usually focus on one central character or protagonist.\nWho is the main character?\nAre the main character and other characters described through dialogue – by the way they speak (dialect or slang for instance)?\nHas the author described the characters by physical appearance, thoughts and feelings, and interaction (the way they act towards\nothers)?\nAre they static\/\u0000at characters who do not change?\nAre they dynamic\/round characters who DO change?\nWhat type of characters are they? What qualities stand out? Are they stereotypes?\nAre the characters believable?\nPlot and structure\nThe plot is the main sequence of events that make up the story. In short stories the plot is usually centered around one experience or signi\u0000cant\nmoment\nWhat is the most important event?\nHow is the plot structured? Is it linear, chronological or does it move around?\nIs the plot believable?\nNarrator and Point of view\nThe narrator is the person telling the story.\nIs the narrator and the main character the same?\nBy point of view we mean from whose eyes the story is being told. Short stories tend to be told through one character’s point of view\nWho is the narrator or speaker in the story?\nDoes the author speak through the main character?\nIs the story written in the \u0000rst person “I” point of view?\nIs the story written in a detached third person “he\/she” point of view?\nIs there an “all-knowing” 3rd person who can reveal what all the characters are thinking and doing at all times and in all places?\nCon\u0000ict\nCon\u0000ict or tension is usually the heart of the short story and is related to the main character. In a short story there is usually one main struggle.\nHow would you describe the main con\u0000ict?\nIs it an internal con\u0000ict within the character?\nIs it an external con\u0000ict caused by the surroundings or environment the main character \u0000nds himself\/herself in?\nClimax\nThe climax is the point of greatest tension or intensity in the short story. It can also be the turning point where events take a major turn as the\nstory races towards its conclusion.\nIs there a turning point in the story?\nWhen does the climax take place?\nTheme\nThe theme is the main idea, lesson or message in the short story. It is usually an abstract idea about the human condition, society or life.\nHow is the theme expressed?\nAre any elements repeated that may suggest a theme?\nIs there more than one theme?\nStyle\nThe author’s style has to do with the author’s vocabulary, use of imagery, tone or feeling of the story. It has to do with his attitude towards the\nsubject. In some short stories the tone can be ironic, humorous, cold or dramatic.\nIs his language full of \u0000gurative language?\nWhat images does he use?\nDoes the author use a lot of symbolism? Metaphors (comparisons which do not use “as” or “like”, similes (comparisons which use\n“as” or “like”) ?\nYour literary analysis of a short story will often be in the form of an essay where you may be asked to give your opinions of the short story at the\nend. Choose the elements that made the greatest impression on you. Point out which character\/characters you liked best or least and always\nsupport your arguments.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}