{"text":"Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nLiterature, Critical Thinking, & Writing\nLiterary Analysis\nWriting about Literature\nWHAT DOES MY PROFESSOR WANT?\nIn 200-level and 300-level English courses, you'll be asked to write a formal analysis (sometimes called a \"research paper,\" a \"term paper,\" or\neven a \"documented literary analysis\"). This paper should present an original argument about an aspect or aspects of literature and should\nengage with critical sources. It is important to keep in mind that this assignment is not a report. It should not merely rehearse the critical\narguments that have already been made about your topic. Rather, the argument should be based on your own close reading of your chosen\ntext(s) and, at the same time, demonstrate the scholarly maturity that comes with situating this argument in relation to the work of other\nscholars. Material from these sources should be carefully documented using the MLA style of documentation.\nHere are some tips:\nAll professors will want to see a strong argument, cogently advanced and well-supported by evidence from the literature.\nOrganization counts. Make sure you have a focused, detailed thesis within your introductory paragraph. Succeeding\nparagraphs should state a topic and supply evidence and argument to support that topic. Don't forget the conclusion. A strong\nconclusion leaves your reader with a clear sense of your perspective and helps the reader to recall the most important aspects of\nyour argument.\nDon't let the critics run away with your paper. Subordinate their views to your own, and make sure that the preponderance of the\npaper is yours. Never cite a critical view that you do not understand.\nRemember to revise your work and proof-read carefully. Some professors care more about one aspect of paper writing than others.\nSome particularly hate to see documentation errors; for others sloppy writing (lots of spelling, punctuation and other mechanical\nerrors) spells doom. Always do your best work, and don't assume that you can neglect any aspect of your essay.\nYour professor will give you speci\u0000c guidelines for topic selection, but general topics often include: poetry explication, analysis\nof theme(s), exploration of one or more characteristic(s) of an author's style and approach, placement of a work or works in literary\nhistorical context, the comparison\/contrast of works sharing similarities but written by di\u0000erent authors and\/or in di\u0000erent literary\nperiods.\nThe English 200-Level Guide at the LND Library website contains links to a variety of research tools, as well as tips on how to\nlocate articles and books. You may \u0000nd the MLA Bibliography tutorial particularly useful.\nThe Help guides page at the LND Library website also can help you use the di\u0000erent databases, \u0000nd articles and books, navigate\nthe library catalog, and cite sources using MLA style.\nAPPROPRIATE GENERAL TOPICS\nAnalysis of theme(s)\nA theme is a recurring idea or concept in a text. It is not explicit; therefore, the writer must to look for repeated imagery or symbols, examine the\nrelationships between plot, setting, characters, and structure, and think about the feelings evoked throughout the text. Common themes in\nliterature include love, jealousy, and friendship. If assigned to analyze a theme in Adventures of Huckleberry Finn, you could analyze the theme of\nfriendship between Huck and Jim.\nExploration of one or more characteristic(s) of an author's style and approach\nConsider analyzing the author's use of imagery or setting:\nAnalyzing Setting\n“Setting refers to the natural or arti\u0000cial scenery or environment in which characters in literature live and move. Seeing also includes what in the\ntheater would be called props or properties—the implements employed by the characters in various activities. Such things as the time of day and\nthe consequent amount of light at which an event occurs, the \u0000ora and fauna, the sounds described, the smells, and the weather are also part of\nthe setting. Paintbrushes, apples, pitchforks, rafts, six-shooters, watches, automobiles, horses and buggies, and innumerable other items belong\nto the setting. References to clothing, descriptions of physical appearance, and spatial relationships among the characters are also part of\nsetting.” (Edgar V. Roberts, Writing Themes about Literature)\nIn order to create an argument about the function of the setting in a particular work, you need to identify the principal settings and to see how\nthey work. Here are some steps you can take:\n1) Read the story and mark references to setting. Start with the place and time of the action and then focus upon recurrent details and objects.\n2) Think about what the story is about. What happens? What is its point? Is it a story about love, jealousy, gain, or loss? What is the main\nexperience here?\n3) Look through your setting notes and see if they fall into any pattern. What are the interesting shifts and contrasts?\n4) Determine how the setting relates to either the main point of the story (step 2) or to some part of it. In other words what does the setting have\nto do with character or action? What are its e\u0000ects? Whatever you decide here will be your thesis statement.\n5) Make an outline, indicating what aspects of setting you will discuss and what you intend to say about them. Discard notes that are not central\nto your plan (you don’t have to discuss everything). Focus on the four or \u0000ve key passages in the story that you wish to examine. List them in\nyour outline in the order in which they occur.\nAnalyzing Imagery\nAs distinct from character, theme, and plot, imagery occurs primarily in language, in the metaphors (i.e. comparisons), similes (comparisons with\n“like” or “as”), or other forms of \u0000gurative (pictorial) language in a literary work. Sometimes setting, i.e., the locality or placing of scenes, or stage\nprops (like swords, \u0000owers, blood, winecups) can also be considered under the rubric of imagery. But whatever the expression, images primarily\nare visual and concrete, i.e., things which the reader sees or can imagine seeing. Some examples are \u0000owers, tears, animals, the moon, sun,\nstars, diseases, \u0000oods, metals, darkness and light.\nIn order to create an argument about the signi\u0000cance of an image in a particular work, identify a principal image or image cluster and to see how\nit works by following these steps:\n1) Read the work and mark recurrent images or image clusters. If you are seeing references to roses, e. g., references to other thorns or to other\n\u0000owers might also be pertinent parts of a cluster. Look at notes to the images carefully. Take out your microscope. You may also track down\noccurrences of related words with the help of a concordance (See Marvin Spevack’s Concordance to Shakespeare in the library) or electronic\nword searches. You can use secondary sources for this assignment as well.\n2) Think about what the play is about. What happens? What is its point? Is it a play about love, jealousy, gain, or loss? What is the main\nexperience here? Look through your images and image clusters and see if they fall into any pattern. What are the interesting shifts? Do they\ngenerally appear in the speeches of certain characters? in certain scenes? Do we have a progression or development? Signi\u0000cant contrasts?\n3) Determine how the images or image clusters (step 3) relate to either the main point of the play (step 2) or to some part of it. In other words\nwhat do the images have to do with character or action? What are their e\u0000ects? Whatever you decide here will be your thesis statement.\n4) Make an outline, indicating what your image pattern is and what you intend to say about it. Discard images that are not central to your plan\n(you don’t have to discuss everything). Focus on the four or \u0000ve key passages in the play that you wish to examine. List them in your outline in\nthe order in which they occur.\n5) Read Criticism and watch \u0000lms to deepen understanding and re\u0000ne your thesis. Compile a bibliography. Adjust outline as necessary.\nPlacement of a work or works in literary historical context\nBy placing a work in its literary historical context, one can trace the in\u0000uences a historical period had on an author and\/or the creation of his\/her\nwork(s). In doing this, a literary historical critic gains insights about the nature of a particular historical period. Using the historical context as a\nlens through which to read literature allows one to gain an understanding of both larger social issues, as well as the personal struggles that\neveryday people endured. As Janet E. Gardner explains in Writing about Literature,\n\"We may be able to learn from parish burial records, for example, how common childhood mortality was at a particular time in English history, but\nonly when we read Ben Johnson's poem \"On My First Son\" do we begin to understand how this mortality may have a\u0000ected the parents who\nlost their children. Likewise, the few pages of James Joyce's story \"Araby\" may tell us more about how adolescent boys lived and thought in\nturn-of-the-century Dublin than several volumes of social history\" (Gardner 147-8).\nComparison\/contrast of works sharing similarities but written by di\u0000erent\nauthors and\/or in di\u0000erent literary periods\nWhile there are many forms of compare-and-contrast essays, the best ones use the points of comparison and contrast that they identify\nbetween the works in order to make a claim about how one text illuminates the other or how they illuminate each other. Rather than a simple\ndelineation of di\u0000erences and similarities, your essay should use those di\u0000erences and similarities to make a larger argument about how\ncomparing the two texts reveals some unexpected or non-obvious about one or both of the works.\nMost often, such claims work to show how texts do similar things di\u0000erently. Therefore, often the best structure for this kind of argument is to\ndetail enough similarities between the works (especially works written by vastly di\u0000erent authors and\/or in di\u0000erent literary periods) to justify\nyour comparison and to narrow the scope of your discussion. In other words, \u0000rst show how your two vastly di\u0000erent texts are attempting similar\nthings. Then, focus the remainder of your essay on the nuanced di\u0000erences between each text’s approach to those similar things and the way in\nwhich juxtaposing them illuminates our understanding of one or both.\nPoetry Explication\nExplication, from explicare meaning “to unfold,” is an exercise in analysis. In it, the writer shows that he or she can read a poem and explain how\nit the various choices a poet makes shape its message and a\u0000ect the reader. One writes an explication by paying close attention to the meaning\nof words, to their sounds, to their placement in lines and sentences. One then explains how the parts contribute to the whole. This exercise\ntrains the ear, eye, and mind. It develops critical faculties and discipline.\n1) Read the poem out loud several times. Look up in a dictionary at least 10 words in it for meanings, alternate meanings, and for shades of\nmeaning. Take notes. Jot down some general observations about the poem and your initial reactions.\n2) Ask yourself who is the speaker? What is the situation and what is the poem about? Be as precise and as speci\u0000c as possible. What about\ntone, diction [level of word choice—high, medium, low, or slang], mood? Jot down your answers.\n3) Underline all repetitions or devices of sound that you notice. Pay attention to any surprising shifts of sound or meaning. Ask yourself what\ne\u0000ects they have? Jot down your answers.\n4) Type the poem out (double-spaced) on a separate sheet of paper. Number the lines and mark all stressed and unstressed syllables. Mark also\nsigni\u0000cant devices of sound: caesuras [breaks within a line, usually signalled by punctuation], alliteration, or assonance (“signi\u0000cant” means\nimportant enough for you to discuss later). This does not count in the four pages and must be handed in with the poem.\n5) Write in your \u0000rst paragraph a brief summary of the poem, i.e. a notice of its central statement and constituent parts. Show some emotion or\ninterest here; don’t be \u0000at or e\u0000usive (avoid general and meaningless praise: “this is a wonderful or incredible or brilliant poem”).\n6) Quote the \u0000rst few lines of the poem (1-4, or whatever you're comfortable with). Talk about the speaker and situation, about what is said, how,\nand why. Note connotations and overtones, how sound creates or enhances sense. Don’t ever notice a poetic device without explaining its\ne\u0000ect. Pay attention to sound and sense, to music and meaning.\n7) Repeat step 3 for the rest of the poem, working your way through slowly and carefully. Note instances of repetition and their e\u0000ects; note\ndevelopment of phrases or ideas. Note images and be account for shifts in tone, sound, rhythm, diction, or subject. Discuss the ending of the\npoem separately.\n8) For a conclusion write a brief, speci\u0000c statement about the e\u0000ect or meaning or artistry of the poem, about structures or patterns or insights\nthat your analysis has revealed. Look through your opening paragraph for hints that you can now develop in closing. Or revise opening in light of\nwhat you have discovered.\nARGUMENTATIVE THESIS\nYour thesis must make an argument, not an observation.\nAn “observation” suggests something that is generally true about the text, like an objective element of the plot or an image used by the author.\nFor example, if we are writing about the Anglo-Saxon epic Beowulf we might make an observation about the way animal imagery seems to\nfunction for the Geat warriors. We might observe that while the Geats feature an image of a boar on their battle helmets (thus seemingly\nidentifying with this ferocious animal), there are other moments in the text when the Geats shun vicious monsters (when they are reluctant to\n\u0000ght the dragon, for example.) Someone who has read the work carefully probably wouldn’t disagree with this observation; it refers to an image\nused by the narrator and a speci\u0000c plot point. This observation does, however, pose a question or “problem” for the careful reader: what do we\nas readers make of this apparent contradiction? Why is this juxtaposition important for the narrative more broadly? What are the consequences\nof this juxtaposition on plot, theme, or character? So what?\nAn “argument”—your thesis statement— is your solution to this problem. The thesis answers the “so what” question by explaining the\nsigni\u0000cance of the observation and explaining why an invested reader should care about this detail. For example, one might argue that the\njuxtaposition of the Geats ferocious helmets and their subsequent unwillingness to approach the dragon suggests an inherent di\u0000erence\nbetween the warriors’ appearance (outward show) and their actions. This seems to be a theme in the work. The Danish coastguard who greets\nthe Geats when they arrive in Denmark remarks that there is often a di\u0000erence between “what is said” and “what is done,” and at the end of the\nepic, Wiglaf says that this discrepancy between word and action will ultimately impair the Geats' ability to protect their kingdom. A thesis\nstatement could read: “The di\u0000erence between the Geats ferocious appearance and their later unwillingness to \u0000ght fearful monsters like the\ndragon suggests a devastating discrepancy between their appearance and their actions—a discrepancy that is responsible for the deterioration\nof the warrior culture in the epic.”\nIt is important to keep in mind that your thesis statement should argue something with which a reader can disagree. If I argued the thesis above,\nthe body of my essay would not only need to prove that there is, in fact, a contradiction between the Geats’ appearance and action, but would\nalso necessarily provide additional textual examples of how this discrepancy contributes to the deterioration of the warrior kingdoms in the epic.\nAnd, I’d need to be aware that other readers might not see the same contradiction. For example, another viable thesis statement could read: “As\nclear from biblical references in the text, humans identify with animals over monsters because animals are more like humans. Both humans and\nanimals were created by God and thereby remind men of Divinity; whereas, monsters are perversions of God’s nature and thereby indicate a\ndiabolic presence.” Rather than suggesting a contradiction, the imagery on the helmet suggests a righteous identi\u0000cation with God’s creation\nand an equally righteous aversion to things that are not “of God.” These two thesis statements o\u0000er opposite solutions to the problem posed\nabove; both are viable and could be supported with textual evidence; and both make points with which a careful reader could disagree.\nCLOSE READING\nBefore a literary scholar can begin writing about a piece of literature, one must engage in the exercise of close reading. As the term suggests,\n“close reading” means closely examining the words on a page in order to come up with a reading or an interpretation about the greater meaning\nof a work.\nHow does one “read closely”?\nThe \u0000rst task involves dissecting a passage or phrase by analyzing literary elements that stick out. For instance, is the tone, diction,\nsyntax, style, imagery, \u0000gurative language, theme(s), cultural\/historical\/religious references, rhyme, rhythm and meter, etc. signi\u0000cant\nin the passage or stanza? Take notes on whatever seems signi\u0000cant by writing in the margins of your text or keeping a reading\njournal.\nAfter taking notes, the second task in close reading is looking for patterns or interruptions of patterns. Gather the evidence\ncollected and think about how each one works together to create the work as a whole or how these elements contribute to or\ncomplicate larger issues such as theme, setting, characterization.\nFinally, think about the purpose and the e\u0000ect of these signi\u0000cant elements\/patterns in the work as a whole. This means\nasking why and how: Why is an author using a particular metaphor, tone, diction, etc. and how does it a\u0000ect one's understanding of\nthe passage? How are they all related to one another? How do they help us understand the larger work?\nThe steps listed above are a pre-writing exercise, designed to help you identify a potential thesis. Once you have formulated a thesis about how\nto read a larger work, you can use the smaller signi\u0000cant elements as evidence. This evidence will then need to be analyzed in order to support\nthat thesis.\nCRITICAL SOURCES\nDe\u0000ning Literary Criticism\nLiterary criticism is a disciplined attempt to analyze some aspect or aspects of one or more works of art—for our purposes, mostly literary art\n(plays, novels, short stories, essays, poems). Serious literary critics study their primary materials very closely and repeatedly, examine the\ncontexts in which the works they are studying were produced, and read widely in the work of other literary critics on their subject before\nproducing their own original analysis of a work or works of literature. Generally, literary criticism is published in one of three forms: in a book; in\nan article published in a professional journal, whether print-based or online; or in an article published in a book as part of a collection. These\nformats insure that experts in the appropriate \u0000eld(s) have reviewed the literary criticism and judged its accuracy in points of fact, its attention to\nscholarship in the \u0000eld, etc. These formats are peer-reviewed sources(also known as \"refereed sources\"). Peer-reviewed means that a source\nhas been rigorously scrutinized by other experts before publication.\nWhy consult and cite literary criticism?\n• Reading a variety of views increases your knowledge of your subject and helps you to demonstrate to your reader that you have considered\nviews other than your own.\n• Reading literary criticism enables you to weigh your conclusions against others’ to check your logic and to see whether you have covered all\nsigni\u0000cant aspects of your argument.\n• Citing others’ views makes you appear a more knowledgeable writer to your readers.\n• Citing literary critics whose views agree with yours can strengthen your case (although you must still supply the appropriate evidence).\n• Taking issue with a critic with whom you disagree can also strengthen your case if you present your counterargument e\u0000ectively.\n• Literary criticism can enable you and your readers to see how evaluations and analyses of literature have changed over time.\nWhere do I \u0000nd literary criticism?\nEncyclopedia articles do not o\u0000er true literary criticism, nor do Cli\u0000’s Notes, Spark Notes, or “overviews” of authors, works, or literary topics\navailable online. Some websites post serious scholarship, but many are run by fans or students who may or may not know more than you do(!)\nWikipedia, for example, is not a peer-reviewed source; any one can post and update information on this site and, as a result, it is not a reliable\nresource. If you \u0000nd your sources either through the SHARC catalogue or the MLA Bibliography database online (the bibliographical resource of\nthe Modern Language Association), you are unlikely to go wrong:\n• Use books and articles from the Loyola\/Notre Dame Library or other libraries and articles located via the library databases. Internet material\nmust have been published in a book or journal before being placed online. (Recall your library workshop.)\n• Good sources can be found through Project Muse and the MLA Bibliography database, but avoid the “Biographies” and “Overview” tabs in the\nLiterature Resource Center. This information can be useful to provide background for your research, but you should not use it in your paper as\none of the documented sources.\n• The MLA Bibliography database is the primary research database for researchers in literature. If a this database doesn’t supply a .pdf of an\narticle you want to look at, write down the full publication information, and search for the journal in the ejournals section of our library’s\nhomepage.\nFORMAL ANALYSIS\nFormal analysis involves a close reading of the literary elements of a text. A formal analysis examines elements such as setting, imagery,\ncharacters, tone, form\/structure, and language. The goal of a formal analysis is to create meaning by exploring how these elements work\ntogether in any given text. You can compare parts of a text or you can analyze how parts of a text relate to the whole text.\nMLA STYLE OF DOCUMENTATION\nFollow the MLA style of documentation, which is a parenthetical style. Remember that you need a “Works Cited” page and a “Bibliography” page,\nand these should follow MLA format, not one you create on the spur of the moment or borrow from some other discipline. The \"Works Cited\"\npage lists all works you cite in the essay, the \"Bibliography\" lists all the works you consulted, including all of those cited. You should always note\nyour professor's requirements as to minimum number of sources.\nThe Department's handbook (A Writer’s Reference by Diana Hacker) provides information under the MLA tab about how to provide parenthetical\ndocumentation and prepare a bibliography and list of works cited. You may also consult dianahacker.com\/resdoc\/ for online help. Use the\n“Humanities” resources tab. A quick look at the sample MLA paper in the Hacker’s A Writer’s Reference will give you a general sense of how\nMLA documentation works.\nORGANIZATION\nEvery paper must contain an introduction (which states the argumentative thesis), subsequent argument paragraphs, and a conclusion.\nINTRODUCTORY PARAGRAPH\nAs Janet E. Gardner writes in Writing About Literature, \"Essentially, and introduction accomplishes two things. First, it gives a sense of both your\ntopic and your approach to that topic, which is why it is common to make your thesis statement a part of the introduction. Second, an\nintroduction compels your readers' interest and makes them want to read on and \u0000nd out what your paper has to say. Some common strategies\nused in e\u0000ective introductions are to begin with a probing rhetorical question, a vivid description, or an intriguing quotation. Weak introductions\ntend to speak in generalities or in philosophical ideas that are only tangentially related to the real topic of your paper. Don't spin your wheels: get\nspeci\u0000c and get to the point right away.\"\nYour introduction is your opportunity to catch your reader's attention and involve that person in the ideas you put forth in your paper. Imagine\nriding in an elevator with someone you'd like to strike up a conversation with about a speci\u0000c topic. How do you do it? How do you catch that\nperson's attention before the ride is up? You can't just immediately throw your claims and evidence at that person, yet at the same time, he or\nshe is unlikely to be compelled by vague general statements about \"the history of time\" or where and when a certain person was born. And you\ncan't stand there all day getting to the point. Instead, you look for compelling point of interest that is both related to where you'd like to go with\nyour discussion, and is of shared interest between you and that person. After raising the topic through this point of common ground, you can\nthen put forth what you will claim about it.\nSUCCEEDING PARAGRAPHS\nA complete argument paragraph consists of the following components:\n1. Topic Sentence: Suggests generally what the paragraph is talking about; often includes a transition from previous paragraphs.\n2. Claim: Makes a very speci\u0000c claim that the paragraph will argue is true; you’ll likely derive this claim from your thesis statement (together,\nall your paragraph claims will work to prove your thesis).\n3. Evidence: Provides the textual support for the claim.\n4. Analysis: Explains how the evidence actually relates to the argument. This is typically the most challenging part of composing your\nparagraph, and it is often forgotten (much to the peril of both reader and writer!). Here, you must articulate how the passage you’ve just cited\nsupports\nthe paragraph claim\/argument premise. You must explain how the textual evidence means what you think it means. Never rely on the reader to\nbe able to\ninterpret the evidence on his or her own. That is, if your argument is a statement with which the careful reader can disagree, this means that the\nevidence\nyou provide can likely be interpreted in many di\u0000erent ways. You need to guide your reader in interpreting the evidence so as to argue why your\nclaim is\ntrue.\n5. Conclusion: O\u0000ers implications of the argument and evidence, often transitions to the next paragraph. This often answers the “so what?”\nquestion. It\narticulates why what you’ve just proven matters and usually articulates how your argument claims relates to\/proves the thesis statement.\nAfter the explanation of evidence, a well-developed paragraph might also include:\nAdditional Evidence\/Explanation: What other evidence is there to support your claim?\nConcession\/ Nonclusion (these are an inseparable pair!): What evidence might contradict your claim? (The concession acknowledges the\nperceived\nopposition (perhaps in the form of another critic) or the skeptical reader). And, why, despite this evidence, is your argument still more e\u0000ective\nthan the\nconcession? (The nonclusion is essential—never end a paragraph with a concession; take the concession into account while further proving\nyour argument!)\nCONCLUSION\nAs Janet E. Gardner points out in Writing About Literature, \"Your conclusion should give your reader something new to think about, a reason not\nto just forget your essay. Some writers like to use the conclusion to return to an idea, a quotation, or an image \u0000rst raised in the introduction,\ncreating a satisfying feeling of completeness and self-containment…. Some writers use the conclusion to show the implications of their claims or\nthe connections between literature and real life. This is your chance to make a good \u0000nal impression, so don't waste it with a simple summary\nand restatement.\"\nThis doesn't mean that your conclusion should not restate your thesis. Your conclusion is the place in which you draw together all the threads of\nyour argument and neatly tie them up. When Gardner says not to \"waste\" your conclusion with \"simple summary and restatement,\" she means\ndon't ONLY summarize and restate. Your should absolutely recap your main points, but a good conclusion ALSO does more. Additionally,\ntreading the path between not giving your reader anything new in the conclusion and introducing more unsupported claims can be tricky. The\nconclusion is a good place to SUGGEST the further implications of your argument, for life, for literature, for an author's body of work, etc., but be\ncareful that you don't \u0000nd yourself making new claims your reader is unlikely to agree with. These implications should follow naturally from the\nstructure of your argument and often are best expressed with less-de\u0000nitive phrasing (i.e. \"perhaps,\" implies,\" \"suggests,\" \"hints,\" \"may,\" etc.).\nPOST\u0000WRITING\n1) Revise again and again. All good writing is rewriting. Clarify, de\u0000ne, smooth-out rough spots. Work to develop ideas, and round out paragraphs.\nTry to be more accurate and graceful, to clean up mistakes, and to correct embarrassing errors. Look hard at your evidence. Be tough and cut\nout the nonsense.\n2) Proofread carefully, by means of spell-check and by your own reading. Make sure you have supplied a title, page numbers for the paper. (No\ndecorative bindings; use 12-point type, double spaced, with standard page margins.)\n3) Make sure you have provided accurate documentation for every quotation and outside source cited or consulted.\nQUOTING CRITICS\n• It is a good idea to include a full quotation when the critic says something particularly well. Paraphrase when the idea is important, but the\nwording is nothing special. (Document both.)\n• Don’t let the critics run away with your paper. Instead, keep their ideas subordinated to your own and use them to support your own claims.\nTypically, your paragraphs should begin with your topic sentence, then provide your evidence from the text, and then (perhaps) include a\ncomment or comments from critics. A rare exception might be when you are disagreeing with a critic. In this instance, you may wish to state the\nopposing idea \u0000rst, and then follow up by expressing your disagreement and presenting the evidence for your point of view.\n• Cited passages should be integrated into your text and be attributed to thier originators. For example, \"Elgin Slapworthy has observed that\n'Dickens remembered this period in his boyhood as both painful and humiliating' \" (237). Don’t just pop in a quotation without making the context\nand source of the quotation clear. Attribution in the text makes the essay read more smoothly and cuts down on the amount of parenthetical\ndocumentation that must be provided.\n• Quotations of more than three lines should be indented and set o\u0000 in the text. Setting o\u0000 indicates quotation, so quotation marks are not\nneeded, unless you have a quotation within a quotation.\nAs Prof. Bladderstock argues:\nAusten’s prose has often been imitated but never matched. Even my own brilliant Austen parody, Sense and Susceptibility, fell short in regard to\ndialogue.\nAusten’s uncanny ability to combine sense and wit, while suiting words and phrasing to character, is di\u0000cult, perhaps impossible to reproduce.\n(132)\n• A quotation within a quotation—say you quote a critic who quotes a passage from Dorothy Sayers—this should be indicated by using single\nquotation marks: According to Evangeline Pink, “Sayers’ use of the line, ‘So, you’re one of them,’ echoes a statement in the trial of the infamous\nMadeline Smith” (299).\nEVIDENCE FROM LITERATURE\nJust as scientists provide data to support their results, literary critics must use evidence from literature in order to convince their audience that\nthey have a cogent argument. Evidence must be provided in every body paragraph in order to support your claims. Where will you \u0000nd evidence?\nFirst, you must do a close reading of the text. It is much easier to \u0000rst analyze and think about how the smaller literary elements work together to\ncreate the whole work, rather than randomly thumbing through a work to \u0000nd support for your thesis. When you provide evidence, you are\nproviding proof from the text that shows your audience that your thesis is valid. Critics most commonly provide evidence by quoting a line or a\npassage from a work. When you provide evidence, it is imperative not to take it out of context. For example, if a character is joking with another\ncharacter that he will kill himself if he fails his chemistry test and there's no other mention of death in the work, it would be unfair to represent\nthis character as suicidal by eliminating the context of him joking. Accurately quoting and fairly representing events\/characters\/etc. adds to your\ncredibility as a writer. If you \u0000nd evidence that counters your thesis, you should still engage with it. Think about what your critics would say and\ncome up with a response to show how that particular piece of evidence might still support your stance. Once you're done gathering evidence,\nyou can move on to the analysis portion in which you explain how the evidence supports your claims.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university. "}