{"text":"Act 1\nPROLOGUE\nCHORUS\nTwo households, both alike in dignity,\nIn fair Verona, where we lay our scene,\nFrom ancient grudge, break to new mutiny,\nWhere civil blood makes civil hands unclean.\n5 From forth the fatal loins of these two foes\nA pair of star-crossed lovers take their life,\nWhose misadventured piteous overthrows° °destruction\nDoth with their death bury their parents’ strife.\nThis fearful showing of their death-marked love,\n10 And the exhibition of their parents’ rage—\nWhich, but their children’s end, naught could remove—\nIs now the two hours’ traffic of our stage\nThat which–if you with patient ears attend—\nHere goes unsaid, our toil shall strive to mend.\n❖❖❖\nACT 1, SCENE 1\nServants of the Capulet family start a fight with Montague family servants. Benvolio, a Montague, draws\nhis sword and attempts to break up the fight. Tybalt, a Capulet, sees the drawn sword of Benvolio. Tybalt\ndraws his sword and, after Benvolio tries to avoid conflict, Tybalt attacks. The fight escalates. Montague\nand Capulet enter the scene. The Prince enters and commands the fight to end. Frustrated with the family\nfeud, the Prince declares a death sentence on anybody who starts more trouble.\nIn the aftermath, Lady Montague asks Benvolio if he’s seen Romeo, her son. Benvolio tells her that he saw\nRomeo earlier, but Romeo seemed troubled. Later, Benvolio approaches to ask Romeo about the mood\nhe’s in. Romeo replies that he is in love with Rosaline, but saddened that she doesn’t seem to love him\nback.\nOn a street somewhere in Verona:\nEnter two servingmen of the Capulets\n2 | Act 1 SAMPSON\n1\nGregory, on my word, we’ll not carry coals.\nGREGORY\nNo, for then we should be colliers°. °coal miners\nSAMPSON\nI mean that if we be in choler° we’ll draw. °anger\nGREGORY\n2\nAye, while you live, draw your neck out of collar.\nSAMPSON\n5 I strike quickly when moved.\nGREGORY\nBut thou art not quickly moved to strike.\nSAMPSON\nA dog of the house of Montague would move me.\nGREGORY\nTo move is to stir; and to be valiant is to stand:\nTherefore if thou art moved, thou runn’st away.\nSAMPSON\n10 A dog of that house shall move me to stand;\n3\nI will take the wall of any man or maid of Montague’s.\nGREGORY\n4\nThat shows thee a weak slave, for the weakest go to the wall.\n1. To not carry coals: to bear no insults\n2. Collar might refer to a hangman’s noose.\n3. take the wall: There were no sidewalks at this time, so when passing one another on the street one person would “take the\nwall,” forcing the other to walk in the gutter.\n4. slave: meant as an insult to someone’s class. See also note to 1.5.55\nAct 1 | 3 SAMPSON\n‘Tis true, and therefore women, being the weaker vessels, are ever\n5\nthrust to the wall. Therefore, I will push Montague’s men from\n15 the wall, and thrust his maids to the wall.\nGREGORY\nThe quarrel is between our masters and us their men.\nSAMPSON\n‘Tis the same. I will show myself a tyrant. When I have fought\nwith the men, I will be civil with the maids, and cut off their\nheads.\nGREGORY\n20 The heads of the maids?\nSAMPSON\nAye, the heads of the maids, or their maidenheads°; take it in °virginities\nwhat sense thou wilt.\nGREGORY\n6\nThose who feel it must take it in that sense.\nSAMPSON\nThey shall feel me while I’m able to stand, and ‘tis known I’m a\n25 pretty piece of flesh.\nGREGORY\n‘Tis well thou art not fish; if thou hadst, thou hadst been poor-\n7\njohn. Draw thy tool! Here comes of the house of Montague.\nEnter ABRAHAM and BALTHASAR, servingmen of the Montagues\n5. Sensitivity Footnote: Thrust...wall is a phrase alluding to sexual assault; in the context of this line, the speaker is saying\nbecause women are weak they are \"thrust to the wall.\" This is an example of victim blaming and misogyny.\n6. Sensitivity note: Take it is referring to rape in this context.\n7. poor-john: fish that was salted or dried because of its inferior quality\n4 | Act 1 SAMPSON\nMy naked weapon is out. Quarrel, I will back thee.\nGREGORY\nHow? Turn thy back and run?\nSAMPSON\n30 Fear this not.\nGREGORY\nNo, marry°, I fear thee. °really\nSAMPSON\nLet us have the law on our side; let them begin.\nGREGORY\nI will frown as I pass by and let them take it as they will.\nSAMPSON\nNay, as they dare. I will bite my thumb at them, which is\n35 disgrace to them if they bear it.\nABRAHAM\nDo you bite your thumb at us, sir?\nSAMPSON\nI do bite my thumb, sir.\nABRAHAM\nDo you bite your thumb at us, sir?\nSAMPSON\n[To GREGORY] Is the law on our side, if I say aye?\nAct 1 | 5 GREGORY\n40 No.\nSAMPSON\nNo sir, I do not bite my thumb at you, sir, but I bite my thumb, sir.\nGREGORY\nDo you quarrel, sir?\nABRAHAM\nQuarrel, sir? No sir.\nSAMPSON\nIf you do, sir, I am yours to fight. I serve as good a man as you.\nABRAHAM\n45 No better than mine.\nSAMPSON\nWell, sir.\nEnter BENVOLIO\nGREGORY\nSay ours is better; here comes one of our master’s kinsmen.\nSAMPSON\nYes: better, sir.\nABRAHAM\nYou lie.\nSAMPSON\n50 Draw, if you be men. Gregory, remember thy swashing blow.\nThey fight\n6 | Act 1 BENVOLIO\nPart, fools! Put up your swords; you know not what you do.\nEnter TYBALT\nTYBALT\nWhat, art thou drawn among these heartless hinds°? °peasants; servants\nTurn thee, Benvolio, look upon thy death.\nBENVOLIO\nI do but keep the peace. Put up thy sword\n55 Or manage it to part these men with me.\nTYBALT\nWhat, drawn, and talk of peace? I hate the word,\nAs I hate hell, all Montagues, and thee.\nHave at thee, coward!\nThey fight\n8\nEnter three or four citizens with clubs and partisans\nCITIZENS OF THE WATCH\n9\nClubs, bills, and partisans, strike!\n60 Beat them down!\nDown with the Capulets!\nDown with the Montagues!\nEnter CAPULET, in his gown, and LADY CAPULET\nCAPULET\nWhat noise is this? Give me my longsword, ho°! °now\nLADY CAPULET\nA crutch you need! Why call you for a sword?\n8. partisan: a weapon, consisting of a spearhead mounted on a pole\n9. bill: a close combat weapon\nAct 1 | 7 CAPULET\n65 My sword I say! Old Montague is come\nAnd flourishes his blade to spite me.\nEnter MONTAGUE and LADY MONTAGUE\nMONTAGUE\nThou villain Capulet! Hold me not! Let me go.\nLADY MONTAGUE\nThou shalt not stir one foot to meet a foe.\nEnter PRINCE ESKALES with his entourage\nPRINCE\nRebellious subjects, enemies to peace,\n70 Profaners with your neighbor-stainèd steel!\nWill they not hear? What, ho! You men, you beasts,\nThat quench the fire of your pernicious rage\nWith purple fountains issuing from your veins.\nOn pain of torture, from those bloody hands\n75 Throw your mistempered weapons to the ground,\nAnd hear the sentence of your movèd prince.\nThree civil brawls bred by an airy word\nFrom thee, old Capulet, and Montague,\nHave thrice disturbed the quiet of our streets,\n80 And made Verona’s ancient citizens\n10\nCast off their gravely-styled ornaments\nTo wield old partisans, in hands as old,\nCankered° with peace, to part your cankered hate. °infested\nIf ever you disturb our streets again\n85 Your lives shall pay the forfeit of the peace.\nFor now, all you rest depart away.\nYou, Capulet, shall go along with me;\nAnd Montague, come you this afternoon\nTo know our further judgment in this case\n90 To old Free-town, our common judgment place.\nOnce more, on pain of death, all men depart.\nExit all but MONTAGUE, LADY MONTAGUE, and BENVOLIO\n10. ornaments: articles of dress, decorative\n8 | Act 1 MONTAGUE\n11\nWho set this ancient quarrel new abroach?\nSpeak, nephew. Were you here when it began?\nBENVOLIO\nHere were the servants of your adversary\n95 And yours, close fighting ere° I did approach. °before\nI drew to part them; in the instant came\nThe fiery Tybalt, with his sword prepared,\nWhich, as he breathed defiance to my ears,\nHe swung about its head and cut the winds,\n100 Which, nothing hurt at all, hissed it in scorn.\nWhile we were interchanging thrusts and blows\nCame more and more who fought on part and part,\nTil the prince came, who parted either part.\nLADY MONTAGUE\nO, where is Romeo? Saw you him today?\n105 Right glad I am he was not at this fray.\nBENVOLIO\nMadam, an hour before the worshipped sun\nPeered forth the golden window of the east,\nA troubled mind drove me to walk abroad\nWhere, underneath the grove of sycamore\n110 Which westward rooteth on this city-side,\nSo early walking did I see your son.\nTowards him I made, but he was ‘ware of me,\nAnd stole into the covert of the wood.\nI, presuming his affections as my own,\n115 Which then most sought where most might not be found,\nFeeling one too many with my weary self,\n12\nPursued my humor, not pursuing his,\nAnd gladly shunned who gladly flew from me.\nMONTAGUE\nMany a morning hath he there been seen,\n120 With tears augmenting the fresh morning dew,\nAdding to clouds more clouds with his deep sighs.\n11. abroach: in action or agitation\n12. humor: fancy, whim; can also refer to mood\nAct 1 | 9 And all so soon as the all-cheering sun\nDoth in the farthest east begin to draw\n13\nThe shady curtains from Aurora’s bed,\n125 Away from light steals home my heavy son,\nAnd private in his chamber pens himself,\nShuts up his windows, locks fair daylight out,\nAnd makes himself an artificial night.\nBlack and portentous° will his humor prove °of a warning\n130 Unless good counsel may the cause remove.\nBENVOLIO\nMy noble uncle, do you know the cause?\nMONTAGUE\nI neither know it nor can learn of him.\nBENVOLIO\n14\nHave you importuned him by any means?\nMONTAGUE\nBoth by myself and many other friends.\n135 But he, his own affections counselor\nIs to himself—I will not say how well—\nKeeping himself so secret and so close,\nSo far from sounding and discovery,\nLike the flowerbud bit by an envious worm\n140 Ere he can spread his sweet leaves to the air,\nOr dedicate his beauty to the same.\nCould we but learn from whence his sorrows grow,\nWe would as willingly give cure as know.\nEnter ROMEO\nBENVOLIO\nSee where he comes. So please you, step aside.\n145 I’ll know his grievance or be much denied.\n13. Aurora: goddess of the dawn\n14. importuned: persistently asked\n10 | Act 1 MONTAGUE\nI wish thee fortune in thy stay\nTo hear the truth. Come, Madam, let’s away.\nExit MONTAGUE and LADY MONTAGUE\nBENVOLIO\nGood morrow, cousin.\nROMEO\nIs the day so young?\nBENVOLIO\n150 It’s newly struck nine.\nROMEO\nAye me! Sad hours seem long.\nWas that my father that went hence so fast?\nBENVOLIO\nIt was. What sadness lengthens Romeo’s hours?\nROMEO\nNot having that, which having, makes them short.\nBENVOLIO\n155 In love.\nROMEO\nOut.\nBENVOLIO\nOf love.\nROMEO\nOut of her favor where I am in love.\nAct 1 | 11 BENVOLIO\n15\nAlas that love, so gentle in his view,\n160 Should be so tyrannous and rough in proof.\nROMEO\nAlas, that love, whose view is blinded still,\nShould without eyes see the path to our will.\nWhere shall we dine? Gods me, what fray was here?\nYet tell me not, for I have heard it all.\n165 That’s much to do with hate, but more with love.\nWhy then, O brawling love, O loving hate,\nO anything that nothing first creates!\nO heavy lightness, serious vanity!\nMisshapen chaos of well-seeming forms,\n170 Feather of lead, bright smoke, cold fire, sick health,\nStill-waking sleep. All is not what it is!\nThis love feel I, for that who feels no love in this.\nDost thou not laugh?\nBENVOLIO\nNo, coz, I rather weep.\nROMEO\n175 Good heart, at what?\nBENVOLIO\nAt thy good heart’s oppression.\nROMEO\nWhy, such is love’s transgression.\nGriefs of mine own lie heavy in my breast\nWhich thou wilt propagate to have them pressed\n180 With more of yours. This love that thou hast shown\nDost add more grief to too much of mine own.\nLove is a smoke raised from the fumes of sighs;\nWhen cleared, a fire sparkling in lovers’ eyes;\nWhen vexed, a sea nourished with loving tears.\n16\n185 What is it else? A madness most discreet,\n15. view: in this case, appearance\n16. discreet: subtle, wise, prudent\n12 | Act 1 A choking gall°, and a preserving sweet. °bitterness, bile\nFarewell, my coz.\nBENVOLIO\nWait, I will go along\nAnd if you leave me so, you do me wrong.\nROMEO\n190 Tut°, I have lost myself. I am not here. °(expresses disapproval)\nThis is not Romeo; he’s some other where.\nBENVOLIO\nTell me in sadness: whom is it that you love?\nROMEO\nWhat, shall I groan and tell thee?\nBENVOLIO\nGroan? Why no, but sadly tell me who.\nROMEO\n195 A sick man in sadness makes his will,\nIll are urging words to one already ill.\nIn sadness, cousin, I do love a woman.\nBENVOLIO\nI aimed so near, when I supposed you loved.\nROMEO\nA right good marksman! And she’s fair I love.\nBENVOLIO\n200 A right fair mark, fair coz, is soonest hit.\nROMEO\nWell, in that hit you miss. She’ll not be hit\nAct 1 | 13 17\nWith Cupid’s arrow; she hath Diana’s wit\nAnd, proving chastity strong and well-armed,\nFrom love’s weak childish bow she lives uncharmed.\n205 She will not stay the siege of loving words,\nNor bear th’ encounter of assailing eyes,\nNor ope° her lap to saint-seducing gold, °open\nO, she is rich in beauty; only poor,\nFor when she dies, with beauty dies her store.\nBENVOLIO\n210 Then she hath sworn that she will still live chaste?\nROMEO\nShe hath, and in that sparing, makes huge waste.\nFor beauty, starved by chaste severity,\nCuts beauty off from all posterity°. °future children\nShe is too fair, too wise, wisely too fair,\n215 To merit bliss° by causing me despair. °heaven\nShe hath forsworn to love, and in that vow,\nDo I live dead that live to tell it now.\nBENVOLIO\nBe ruled by me: forget to think of her.\nROMEO\nO, teach me how I should forget to think!\nBENVOLIO\n220 By giving liberty unto thine eyes:\nExamine other beauties.\nROMEO\n‘Tis the way\nTo call hers exquisite, in question more.\nThese happy masks that kiss fair ladies’ brows,\n225 Being black, puts to mind that they hide the fair.\nHe that is struck blind cannot forget\nThe previous treasure of his eyesight lost.\n17. Diana: Roman goddess of the hunt, who remained a virgin\n14 | Act 1 Show me a mistress that is passing fair;\nWhat doth her beauty serve but as a note\n230 Where I may read who passed that passing fair.\nFarewell. Thou canst not teach me how to forget.\nBENVOLIO\nI’ll pay that doctrine or else die in debt.\nExit all\n❖❖❖\nACT 1, SCENE 2\nParis, a member of the Prince’s family, speaks to Capulet about marrying his daughter Juliet. They debate\nabout whether or not Juliet is old enough, at age thirteen, to be married. Elsewhere, Romeo and Benvolio\nare talking about Romeo’s love of Rosaline. One of Capulet’s servants invites them to a party Capulet is\nthrowing—not knowing they are Montagues. Benvolio encourages Romeo to go, thinking that it will be a\ngood chance to take his mind off of Rosaline. Romeo agrees to go because Rosaline will be at the party.\nLord Capulet’s private office within the Capulet estate; then on a street somewhere in Verona:\nEnter CAPULET, COUNTY PARIS, and PETER, the servingman\nCAPULET\nBut Montague is bound as well as I,\nIn penalty alike, and ‘tis not hard, I think,\nFor men so old as we to keep the peace.\nPARIS\nOf honorable reckoning are you both,\n5 And pity ‘tis you’ve lived at odds so long.\nBut now, my lord, what say you to my suit?\nCAPULET\nBut saying more that I have said before,\nMy child is yet a stranger in the world.\nShe hath not seen the change of fourteen years.\n10 Let two more summers wither in their pride\nEre we may think her ripe to be a bride.\nAct 1 | 15 PARIS\nYounger than she are happy mothers made.\nCAPULET\nAnd too soon marred are those so early made.\nEarth hath swallowéd all my hopes but she.\n15 She’s the hopeful Lady of my earth.\nBut woo her, gentle Paris; get her heart.\nMy will to her consent is but a part.\nAnd she agreed within her scope of choice\nLies my consent, and fair according voice.\n20 This night I hold an old accustomed feast,\nWhereto I have invited many a guest.\nSuch as I love, and you among the store,\nOne more, most welcome, makes my number more.\nAt my poor° house, look to behold this night °modest\n25 Earth-treading stars that make dark heaven light.\nSuch delight as do lusty young men feel\nWith well-appareled April on the heel\nOf limping winter steps. The same delight\n18\nAmong fresh fennel buds shall you this night\n30 Inherit at my house. Hear all, all see.\nYou’ll like her most, whose merit most shall be\nWhich one more view of many, mine being one,\nMay stand in number, though in reckoning none.\nCome, go with me.\nHe hands PETER a paper\n19\n35 [To PETER] Go, sirrah, trudge about\nThrough fair Verona, find those persons out\nWhose names are written there, and to them say\nMy house and welcome on their pleasure stay.\nExit CAPULET and PARIS\nPETER\nFind them out whose names are written here? It is written that\n20\n40 the shoe-maker should meddle with his yard, and the tailor with\n21\nhis last, the fisher with his pencil, and the painter with his nets.\n18. fennel buds: unopened flowers that appear in springtime\n19. sirrah: term of address for a man of lower station\n20. yard: possibly referring to “yards” of clothing\n21. last: tool involved in shoe-making\n16 | Act 1 But I am sent to find those persons whose names are here writ,\nand can never find what names the writing person hath here writ.\nI must to the learned in good time.\nEnter BENVOLIO and ROMEO\nBENVOLIO\n45 Tut, man, one fire burns out another’s burning.\nOne pain is lessened by another’s anguish.\nTurn dizzy, and be helped by backward turning.\nOne desperate grief cures with another’s languish.\nTake thou some new infection to thine eye,\n50 And the rank poison of the old will die.\nROMEO\n22\nYour plantain leaf is excellent for that.\nBENVOLIO\nFor what, I pray thee?\nROMEO\nFor your broken shin.\nROMEO kicks BENVOLIO\nBENVOLIO\nWhy, Romeo, art thou mad?\nROMEO\n23\n55 Not mad, but bound more than a madman is.\nShut up in prison, kept without my food,\nWhipt and tormented, and–[To PETER] Good e’en, good fellow.\nPETER\n24\nGod ‘i’ good e’en. I pray, sir, can you read?\n22. plantain leaf: thought to have curative powers\n23. Sensitivity note: Madman refers to someone who is mentally ill; the term can be traced to the early 14th c. meaning \"one\nwho is insane, a lunatic.\" This is an example of ableist language.\n24. God ‘i’ good e’en: “May God give you a good evening.”\nAct 1 | 17 ROMEO\nAye, mine own fortune in my misery.\nPETER\n60 Perhaps you have learned it without book.\nBut I pray, can you read anything you see?\nROMEO\nIf I know the letters and the language.\nPETER\nA honest answer. Rest you merry.\nROMEO\nStay, fellow, I can read.\n65 “Signeur Martino, and his wife and daughters; Count Anselme and\nhis beauteous sisters; the lady widow of Vitruvio; Seigneur\nPlacentio, and his lovely nieces; Mercutio and his brother\nValentine; mine uncle Capulet; his wife and daughters; my fair\nniece Rosaline and Livia; Seigneur Valentio, and his cousin\n70 Tybalt; Lucio and the lively Hellena.”\nA fair assembly. Whither° should they come? °where\nPETER\nUp.\nROMEO\nWhither to supper?\nPETER\nTo our house.\nROMEO\n75 Whose house?\nPETER\nMy master’s.\n18 | Act 1 ROMEO\nIndeed, I should have asked thee that before.\nPETER\nNow I’ll tell you without asking. My master is the great rich\nCapulet, and if you be not of the house of Montagues, I pray\n80 come and crush a cup of wine. Rest you merry!\nBENVOLIO\nAt this same ancient feast of Capulets\nSups the fair Rosaline, whom thou so loves,\nWith all the admired beauties of Verona.\nGo thither°, and with unattainted° eye °there °impartial\n85 Compare her face with some that I shall show\nAnd I will make thee think thy swan a crow.\nROMEO\nIf the devout religion of mine eye\nAllows such falsehood, then turn tears to fires\nAnd these who, often drowned, could never die,\n90 Transparent heretics, be burnt for liars!\nOne fairer than my love? The all-seeing Sun\nNe’er saw her match since first the world begun.\nBENVOLIO\nTut! You found her fair none else being by,\nHerself poised, with herself in either eye.\n95 But in those crystal scales there let be weighed\nYour lady’s love against some other maid\nThat I will show you, shining at this feast,\nAnd she shall scant° show well that now seems best. °hardly\nROMEO\nI’ll go along, no such sight to be shown,\n100 But to rejoice in splendor of mine own.\nExit all\n❖❖❖\nAct 1 | 19 ACT 1, SCENE 3\nAfter a humorous exchange with the Nurse, Lady Capulet asks for Juliet’s thoughts on marriage. Juliet\nhasn’t thought about it much. Lady Capulet hints that Juliet should consider marrying Paris, who will be\ncoming to the party tonight. Juliet agrees to observe him and consider the possibility.\nSomewhere within the Capulet estate:\nEnter LADY CAPULET and NURSE\nLADY CAPULET\nNurse, where’s my daughter? Call her forth to me.\nNURSE\nNow by my maidenhead, at twelve year old I bid her come.\n[Calls to JULIET] What, lamb! What, lady-bird!\nGod forbid, where’s the girl? [Calls to JULIET] What, Juliet?\nEnter JULIET\nJULIET\n5 How now, who calls?\nNURSE\nYour mother.\nJULIET\nMadam, I am here. What is your will?\nLADY CAPULET\nThis is the matter.—Nurse, give leave a while.\nWe must talk in secret.—Nurse, come back again,\n10 I have remembered thou may hear our counsel.\nThou knowest my daughter’s of a pretty age.\nNURSE\nFaith, I call tell her age unto an hour.\n20 | Act 1 LADY CAPULET\nShe’s not fourteen.\nNURSE\nI’ll bet fourteen of my teeth—and yet to my teen° be it spoken, I °misery\n15 have just four—She’s not fourteen. How long is it now to\n25\nLammastide?\nLADY CAPULET\nA fortnight° and a few odd days. °two weeks\nNURSE\nEven or odd, of all the days in the year,\nCome Lammas-Eve at night shall she be fourteen.\n26\n20 Susan and she—God rest all Christian souls!—\nWere born that day. Well Susan is with God.\nShe was too good for me. But as I said,\nOn Lammas-Eve at night shall she be fourteen,\nThat shall she. Marry, I remember it well.\n25 ‘Tis since the earthquake now eleven years,\nAnd she was weaned (I never shall forget it),\nOf all the days of the year, upon that day.\n27\nFor I had then laid worm-wood to my dug° °breast\nSitting in the sun under the dove-house wall.\n30 My Lord and you were then at Mantua.\nNay, I do bear a brain. But as I said,\n28\nWhen it did taste the worm-wood on the nipple\nOf my dug, and felt it bitter, pretty fool,\n29\nTo see it tetchy, and fall out with the dug.\n35 “Shake,” quoth the dove-house. ‘Twas no need, I trow\n30\nTo bid me trudge:\nAnd since that time it is eleven years,\nFor then she could stand alone. Nay, by the rood°, °cross\nShe could have run and waddled all about\n40 Or even the day before, she broke her brow,\nAnd then my husband—God be with his soul,\n25. Lammastide: August 1st\n26. Susan: the Nurse’s daughter, who died\n27. worm-wood: a bitter plant used in medicine and alcohol\n28. When it did taste: Through here, the nurse refers to the infant Juliet as “it.”\n29. tetchy: irritably or peevishly sensitive\n30. ‘Twas no ned…to bid me trudge: i.e., I didn’t need to be told twice to leave\nAct 1 | 21 He was a merry man—took up the child,\n“Yea,” quoth he, “dost thou fall upon thy face?\nThou wilt fall backward when thou hast more wit,\n31\n45 Wilt thou not, Jule?” And, by my holidam,\nThe pretty wretch quit crying and said, “Aye.”\nTo see now how a jest shall come about!\nI warrant that should I live a thousand years,\nI never should forget it. “Wilt thou not, Jule?” quoth he.\n50 And the pretty fool stopped crying and said, “Aye.”\nLADY CAPULET\nEnough of this. I pray thee, hold thy peace.\nNURSE\nYes, Madam. Yet, I cannot choose but laugh,\nTo think she should stop crying and say, “Aye.”\nAnd yet I warrant she had upon her brow\n32\n55 A bump as big as a young cockerel’s stone.\nA perilous knock, and she cried bitterly.\n“Yea,” quoth my husband, “fall’st upon thy face,\nThou wilt fall backward when thou comest to age.\nWilt thou not, Jule?” She stopped and said, “Aye.”\nJULIET\n60 And stop thou too. I pray thee, Nurse, say “Aye.”\nNURSE\nPeace, I am done. God mark thee to his grace.\nThou wast the prettiest babe that e’re I nursed,\nIf I might live to see thee married once,\nI’ll have my wish.\nLADY CAPULET\n65 Marry, that “marry” is the very theme\nI came to talk of. Tell me, daughter Juliet,\nHow stands your disposition to be married?\n31. by my holidam: similar oath to “by the rood”\n32. cockerel’s stone: a rooster’s testicle\n22 | Act 1 JULIET\nIt is an honor that I dream not of.\nNURSE\nAn honor! Were not I thine only nurse,\n70 I would say thou had’st sucked wisdom from my teat.\nLADY CAPULET\nWell, think of marriage now. Younger than you,\nHere in Verona, ladies of esteem\nAre made already mothers. By my count\nI was your mother much upon these years\n75 That you are now a maid. Thus in brief:\nThe valiant Paris seeks you for his love.\nNURSE\nA man, young Lady! Lady, such a man\n33\nAs all the world. Why, he’s a man of wax.\nLADY CAPULET\nVerona’s summer hath not such a flower.\nNURSE\n80 Nay, he’s a flower, in faith°, a very flower. °truly\nLADY CAPULET\nWhat say you? Can you love the gentleman?\nThis night you shall behold him at our feast.\nRead o’er the volume of young Paris’ face,\nAnd find delight writ there with beauty’s pen.\n85 Examine every several lineament\nAnd see how to each other lends content,\nAnd what obscured in this fair volume lies\nFind written in the margent of his eyes.\nThis precious book of love, this unbound lover,\n90 To beautify him, only lacks a cover.\nThe fish lives in the sea, and ‘tis much pride\n33. man of wax: as perfect as a man fashioned from wax\nAct 1 | 23 34\nFor fair without, the fair within to hide.\nThat book in many eyes doth share the glory\nThat in gold clasps locks in the golden story.\n95 So shall you share all that he doth possess,\nBy having him, making yourself no less.\nNURSE\nNo less? Nay, bigger. Women grow by men.\nLADY CAPULET\nSpeak briefly. Can you like of Paris’ love?\nJULIET\nI’ll look to like, if looking liking move.\n35\n100 But no more deep will I endart mine eye,\nThen your consent gives me strength to make fly.\nEnter SERVINGMAN\nSERVINGMAN\nMadam, the guests are come, supper served up, you called for, my\nyoung lady asked for, the nurse cursed in the pantry, and\neverything is in chaos. I must wait upon them. I beseech you,\n105 follow quick.\nLADY CAPULET\nWe follow thee. Juliet, the County° awaits. °(Paris)\nNURSE\nGo, girl, seek happy nights to happy days.\nExit all\n❖❖❖\n34. fair without: In this instance, “without” means “on the outside.”\n35. endart: to throw or cast like a dart\n24 | Act 1 ACT 1, SCENE 4\nRomeo, along with Benvolio and their friend Mercutio, leave for the party. As they go Romeo claims, among\nother concerns, that he will not dance. Mercutio twists Romeo’s melancholy comments into sexual jokes.\nRomeo, not interested in Mercutio’s humor, says that a dream convinced him that attending the party is\na bad idea. Mercutio launches into a speech about Queen Mab, the fairy queen, who visits people in their\ndreams. Though the speech begins in a lighthearted manner, it takes a dark turn. Romeo snaps Mercutio\nout of his speech. Benvolio convinces them to get moving and get to the party.\nOn a street somewhere in Verona, near the Capulet estate:\nEnter ROMEO, MERCUTIO, BENVOLIO, with five or six other maskers, torch-bearers\nROMEO\nWhat speech shall be spoken to excuse us?\nOr shall we move on without apology?\nBENVOLIO\n36\nThe date is out of such prolixity.\nWe’ll have no Cupid, tricked and blindfolded,\n37\n5 Bearing a Tartar’s painted bow of lath,\nScaring the ladies like a crow-keeper°. °scarecrow\nBut let them measure us by what they will;\nWe’ll measure them a measure, and be gone.\nROMEO\nGive me a torch, I am not for this ambling°. °dancing\n10 Being but heavy, I will bear the light.\nMERCUTIO\nNay, gentle Romeo, we must have you dance.\nROMEO\nNot I, believe me. You have dancing shoes\nWith nimble soles; I have a soul of lead\n36. The date is out of such prolixity: i.e., such boring excuses are unfashionable\n37. Tartar: ethnic group known for shooting arrows while moving on horseback. Bow of lath: cheap wood used for pretend\nbows. Benvolio is saying they won’t have someone dressed up as Cupid introducing them to the party while holding this\nitem. Sensitivity note: Tartar is any member of several Turkic-speaking peoples that lived mainly in west-central Russia. But\nin this line, used as a way to describe Romeo's \"unacceptable\" appearance. This oppressive language exhibits harmful\nrepresentation.\nAct 1 | 25 That so stakes me to the ground I cannot move.\nMERCUTIO\n15 You are a lover: borrow Cupid’s wings\n38\nAnd soar above a common bound.\nROMEO\nI am too sore enpierced with his shaft\nTo soar with his light feathers, and so bound\n39\nI cannot bound a pitch above dull woe.\n20 Under love’s heavy burden do I sink.\nMERCUTIO\nAnd, to sink in it, so you burden love:\nToo great oppression for a tender thing.\nROMEO\nIs love a tender thing? It is too rough,\nToo rude, too boisterous, and it pricks like thorn.\nMERCUTIO\n25 If love be rough with you, be rough with love,\nPrick love for pricking, and you beat love down.\nGive me a case to put my visage° in, °face; expression\nA visor° for a visor. What care I °mask\n40\nIf a curious eye doth note deformities?\n41\n30 Here are the beetle-brows that shall blush for me.\nBENVOLIO\nCome, knock and enter; and no sooner in,\n42\nBut every man betake him to his legs.\n38. common bound: a normal jump, which was a popular dance move\n39. bound a pitch above dull woe: i.e., muster any feeling but woe\n40. Sensitivity note: deformities is used here to mean \"flaws.\" The diction displays ableism, and suggests that disabled folks need\n\"fixing.\"\n41. Beetle-brows: Mercutio’s mask has beetle-brows (thick eyebrows)\n42. betake him to his legs: i.e., let’s start dancing\n26 | Act 1 ROMEO\n43\nA torch for me. Let wantons light of heart\nTickle the senseless rushes° with their heels, °the floor\n44\n35 For I am proverbed with a grandsier phrase.\nI’ll be a candle-holder, and look on,\n45\nThe game was never so fair, and I am done.\nMERCUTIO\n46\nTut, dun’s the mouse, the constable’s own word,\nIf thou art done, we’ll draw thee from the mire° °your misery\n47\n40 Or—save your reverence —love, wherein thou stickest\nUp to the ears. Come, we burn daylight, ho!\nROMEO\nNay, that’s not so.\nMERCUTIO\nI mean, sir, in delay\nWe waste our lights in vain, like lights by day;\n45 Take our good meaning°, for our judgment’s fit °good intentions\nFive times in that, ere once in our fine wits.\nROMEO\nAnd we mean well in going to this masque°, °masquerade\nBut ‘tis no wit to go.\nMERCUTIO\nWhy, may one ask?\nROMEO\n50 I dreamt a dream tonight.\n43. wantons light of heart: i.e., carefree partygoers\n44. For I am proverbed with a grandsier phrase: i.e., I know an old proverb that applies here\n45. The game was never so fair, and I am done: i.e., it’s best to leave when the party is best\n46. Mercutio has interpreted “done” as dun: a reference to the game “Dun the horse is in the mire,” in which players would try to\nlift a large log from the mire (mud). He refers to the phrase “dun’s the mouse” (meaning “quiet as a mouse”), saying this is an\nappropriate saying for a useless policeman. Basically, he mocks Romeo for being mouselike and a stick-in-the-mud.\n47. save your reverence: a phrase used to replace a rude word\nAct 1 | 27 MERCUTIO\nAnd so did I.\nROMEO\nWell, what was yours?\nMERCUTIO\nThat dreamers often lie.\nROMEO\nIn bed asleep, while they do dream things true.\nMERCUTIO\n55 O, then I see Queen Mab has been with you.\nShe is the Fairies’ midwife, and she comes\nIn shape no bigger than an agate-stone,\nOn the forefinger of an alderman°, °councilman\nDrawn with a team of little atomies° °miniscule creatures\n60 Over men’s noses as they lie asleep.\nHer wagon spokes made of long spinners’ legs°, °spider legs\nThe cover, of the wings of grasshoppers,\nHer traces° of the smallest spider web, °reins\nHer collars° of the moonshine’s watery beams, °part of a harness\n65 Her whip of cricket’s bone, the lash of philome°, °film; fine thread\nHer waggoner, a small gray-coated gnat\nNot half so big as a round little worm\n48\nPricked from the lazy finger of a maid.\nHer chariot is an empty hazelnut,\n70 Made by the joiner° squirrel or old grub, °carpenter\n49\nTime out o’ mind the fairies’ coach-makers.\nIn this state she gallops night by night\nThrough lovers’ brains, and then they dream of love;\n50\nOn courtiers’ knees, that dream on curtsies straight,\n75 O’er ladies’ lips, who strait on kisses dream—which\nOft the angry Mab with blisters plagues\nBecause their breaths with sweetmeats° tainted are. °candy\nSometime she gallops o’er a lawyer’s nose,\nThen dreams he of smelling out a suit.\n48. Sensitivity note: lazy finger of a maid is inherently sexist and undermining to the hardworking women of the time period.\n49. Time out o’ mind: for as long as anyone can remember\n50. dream on curties straight: immediately dream about curtsies\n28 | Act 1 51\n80 And sometime comes she with a tithe-pigs tail,\nTickling a person’s nose that lies asleep,\n52\nThen he dreams of another benefice.\nSometimes she drives over a soldier’s neck,\nAnd then dreams he of cutting foreign throats,\n85 Of breaches, ambuscados°, Spanish blades, °ambushes\n53\nOf healths five-fathom deep, and then anon\nDrums in his ears, at which he starts and wakes,\nAnd being thus frighted, swears a prayer or two\nAnd sleeps again. This is that very Mab\n90 That plaits the manes of horses in the night\nAnd bakes the elklocks in foul sluttish hairs\n54\nWhich, once untangled, much misfortune bodes.\nThis is the hag, when maids lie on their backs,\nThat presses them and learns them first to bear,\n95 Making them women of good carriage.\n55\nThis is she—\nROMEO\nPeace, peace, Mercutio, peace!\nThou talkst of nothing.\nMERCUTIO\nTrue, I talk of dreams\n100 Which are the children of an idle brain,\nBegot of nothing but vain fantasy,\nWhich is as thin of substance as the air,\nAnd more inconstant than the wind, who woos\nEven now the frozen bosom° of the North; °breast\n105 And, being angered, puffs away from thence,\nTurning his tide to the dew-dropping South.\n51. tithe-pig: to pay a tax to their church, people would often choose to pay one pig out of ten\n52. benefice: i.e., giving tax to a church\n53. healths five-fathoms deep: The soldier would dream of toasts (“healths”) that go on and on; basically, cups of alcohol that\nnever run dry.\n54. This is that very Mab…which, once untangled, much misfortune bodes: Mab secretely tangles horses’ manes at night, which\nbring bad luck when untangled.\n55. Sensitivity note: Mercutio's description of Mab plays into the concept of \"woman as myth,\" where men describe women as\nbeings with bad intentions, such as the witch\/the seductress\/the Medusa. This mythological aura of women is a direct\nacknowledgement that men do not understand women, and instead of trying to recognize their ignorance they instead\nportray women as unknowable.\nAct 1 | 29 BENVOLIO\nThis wind you talk of blows us from ourselves.\nSupper is done, and we shall come too late.\nROMEO\nI fear too early, for my mind misgives\n110 Some consequence yet hanging in the stars\nShall bitterly begin his fearful date\nWith this night’s revels, and expire the term\nOf the despised life closed in my breast\nBy some vile forfeit of untimely death.\n115 But he that hath the steerage of my course,\nDirect my suit. On, lusty gentlemen!\nBENVOLIO\nStrike, drum!\nExit all\n❖❖❖\nACT 1, SCENE 5\nThe party begins. Capulet greets guests, encouraging them to dance and have a good time. Romeo sees\nJuliet. For him, it’s love at first sight. Tybalt recognizes Romeo as a Montague, and wants to fight. Capulet\nhears this and rebukes Tybalt. Capulet wants no disturbances at the party, and explains that Romeo is a\nrespected youth in the community.\nRomeo approaches Juliet, touching her hand. They flirt back and forth and eventually kiss. The Nurse\nfinds Juliet and beckons her away. Romeo asks the Nurse who Juliet is. The Nurse tells him she’s Capulet’s\ndaughter. Juliet is intrigued by Romeo, and convinces the Nurse to find out who he is. The Nurse finds out,\nand tells Juliet that Romeo is a Montague. Romeo and Juliet are each crushed to find out the identity of\nthe other. They both feel powerful longing for one another despite their family conflict.\nInside the Capulet estate:\nEnter SERVINGMEN with napkins\nPETER\nWhere’s Potpan, that he does not help us clear away? He took a plate? He eats from it?\n30 | Act 1 FIRST SERVINGMAN\nWhen good manners are found in just one or two men’s hands,\nand they unwashed too, ‘tis a foul thing.\nSECOND SERVINGMAN\n5 Take away the joint stools, remove the sideboards, and the plates\n56\ntoo, good thou, save me a piece of marzipan, and if thou loves\n57\nme, let the porter let in Susan Grindstone and Nell.\nEnter ANTHONIE and POTPAN\nAnthonie and Potpan!\nANTHONIE\nAye, boy, ready.\nPETER\n10 You are looked for and called for, asked for and sought for in the\ngreat chamber.\nPOTPAN\nWe cannot be here and there too. Cheerly, boys,\nBe brisk for now, then the longest liver takes all.\nExit all\nEnter CAPULET, TYBALT, JULIET, NURSE, LADY CAPULET as well as ROMEO,\nMERCUTIO, BENVOLIO, and the other guests and servants\nCAPULET\nWelcome, gentlemen! Ladies that have their toes\nUnplagued with corns° will walk about with you. °foot calluses\n15 Ah, my mistresses, which of you all\n58\nWill now deny to dance? She that makes dainty,\nShe I’ll swear hath corns. Am I come near to truth?\nWelcome, gentlemen! I have seen the day\nWhen I could wear a mask and tell\n20 A whispering tale in a fair lady’s ear\n56. marzipan: confection of crushed almonds or almond paste, sugar, and egg whites\n57. Susan Grindstone and Nell: his friends\n58. makes dainty: coyly refuses\nAct 1 | 31 Such as would please. ‘Tis gone, ‘tis gone, ‘tis gone.\nYou are welcome, gentlemen!—Come, musicians, play!\nMusic plays, they dance\nThe hall, the hall, make room! And foot it, girls.\n[To SERVANTS] More light, you knaves°. And turn the tables up. °fools\n25 And quench the fire. The room has grown too hot.\nAh sirrah, this unlooked-for sport feels well.\n[To COUSIN] Nay sit, nay sit, good cousin Capulet,\nFor you and I are past our dancing days.\nHow long is ‘t now since last yourself and I\n30 Were in a mask?\nCOUSIN CAPULET\n59\nBy’r Lady, about thirty years.\nCAPULET\nWhat man, ‘tis not so much, ‘tis not so much.\n‘Tis since the nuptial° of Lucentio, °wedding\nCome the years as quickly as they will,\n35 Some five and twenty years than last we masked.\nCOUSIN CAPULET\n‘Tis more, ‘tis more, his son is older, sir.\nHis son is thirty.\nCAPULET\nWill you tell me that?\nHis son was but a ward° two years ago. °a child\nROMEO\n40 What lady is that which does enrich the hand of yonder Knight?\nSERVINGMAN\nI know not, sir.\n59. By’r Lady: an exclamation derived from the phrase “by our Lady”\n32 | Act 1 ROMEO\nOh, she doth teach the torches to burn bright,\nIt seems she hangs upon the cheek of night\n45 Like a rich jewel in an Ethiop’s° ear, °Ethiopian’s\n60\nBeauty too rich for use, for earth too dear.\nSo shows like a snowy dove trooping with crows,\nThat yonder lady o’er her fellows shows.\nWhen dancing done, I’ll find her place of stand,\n50 And touching hers, make blessèd my rude hand.\nIf my heart loved till now, forswear° it sight, °swear off\nFor I never saw true beauty till this night.\nTYBALT\nThis by that voice, should be a Montague.\n61\nFetch me my rapier, boy.\nHis PAGE exits\n62\n55 How dares the slave\nCome hither covered with a masked face,\nTo laugh and scorn at our ceremony?\nNow, by the stock° and honor of my kin, °breeding; pedigree\nI’ll strike him dead, and hold it not a sin.\nCAPULET\n60 Why, how now, kinsman? Wherefore storm you so?\nTYBALT\nUncle, this is a Montague, our foe.\nA villain that is hither come in spite,\nTo scorn at our ceremony this night.\nCAPULET\nYoung Romeo, is it?\n60. Sensitivity note: Ethiope is a shortening of \"Ethiopian,\" which in the period written implies a Black person. The word evokes\ncontrast: according to this language, rich jewelry stands out on a Black person's skin, as the moon against the night. This is\nan example of how language is used in an oppressive way without an overt statement of racism.\n61. rapier: a thin, sharp sword\n62. Sensitivity note: the word slave was probably meant as an insult to his class or as a way to say rascal. America, specifically the\nUnited States, has a very radicalized history of slavery; when this play was first performed, modern ideas of race were starting\nto develop and England was at the start of a long period of colonization and engagement in the Atlantic slave trade.\nAct 1 | 33 TYBALT\n65 ‘Tis he, that villain Romeo.\nCAPULET\nContent thee, gentle cousin. Let him alone.\nHe bears himself like a real gentleman.\nAnd, to say truth, Verona brags of him\nTo be a virtuous and well-governed youth.\n70 I would not, for the wealth of all this town,\nHere in my house do him disparagement.\nTherefore be patient, take no note of him.\nIt is my will, so if this thou respect,\nShow a fair presence, and give up those frowns\n75 Which are ill-beseeming semblance for a feast.\nTYBALT\nIt fits, when such a villain is a guest.\nI’ll not endure him.\nCAPULET\nHe shall be endured.\n63\nWhat, lordful boy! I say he shall. Go to.\n80 Am I the master here or you? Go to.\nYou’ll not endure him. God shall mend my soul!\nYou’ll make a mutiny among my guests:\nYou will set chaos here. You’ll be the cause!\nTYBALT\nBut Uncle, he shames us.\nCAPULET\n85 Go to, go to.\nYou are a saucy boy. Is’t so, indeed?\nThis trick may chance to scathe you, I know what.\nMust you contradict me? Marry, ‘tis time–\n[To GUESTS] Well said, my hearts — [To TYBALT] You are a young fool. Go.\n90 Be quiet, or — [To SERVANTS] More light, more light! — [To TYBALT] For shame,\nI’ll make you quiet. — [To GUESTS] What, cheerly my hearts!\n63. lordful: lordly. Tybalt is being chastised for his presumptive attitude.\n34 | Act 1 TYBALT\nPatience forced, with willful choler meeting,\nMakes my flesh tremble in their different greeting.\nI will withdraw, but this intrusion shall,\n95 Now seeming sweet, convert to bitterest gall.\nExit TYBALT\nROMEO\nIf I profane with my unworthiest hand\nThis holy shrine, the gentle sin is this:\nMy lips, two blushing pilgrims, readily stand,\nTo smooth that rough touch with a tender kiss.\nJULIET\n100 Good Pilgrim, you do wrong your hand too much.\nSuch mannerly devotion shows in this,\nFor saints have hands, that pilgrims’ hands do touch,\nAnd palm to palm is holy palmers’ kiss.\nROMEO\nHave not saints lips? And holy palmers too?\nJULIET\n105 Aye, pilgrim, lips that they must use in prayer.\nROMEO\nO then, dear saint, let lips do what hands do,\nAnd pray. Grant thou, lest faith turn to despair?\nJULIET\nSaints do not move; they grant for prayers’ sake.\nROMEO\nThen move not while my prayer’s effect I take.\n110 Thus from my lips, by thine, my sin is purged.\nThey kiss\nAct 1 | 35 JULIET\nNow have my lips the sin that they have took.\nROMEO\nSin from my lips? O trespass sweetly urged!\nGive me my sin again.\nThey kiss again\nJULIET\nYou kiss by the book.\nNURSE\nMadam, your mother craves a word with you.\nJULIET joins her mother\nROMEO\n115 Who is her mother?\nNURSE\nMarry, bachelor,\nHer mother is the lady of the house,\nAnd a good lady, and so wise and virtuous.\nI nursed her daughter that you talked withal.\n120 I tell you, he that can lay hold of her\n64\nShall have the chinks.\nROMEO\nIs she a Capulet?\nO, what price! My life is my foe’s charge.\nBENVOLIO\nAway, begone! This sport has reached its best.\n64. the chinks: i.e., lots of money (“chink” being the sound of coins gathered together)\n36 | Act 1 ROMEO\n125 Aye, so I fear. The more is my unrest.\nCAPULET\nNay, gentlemen, prepare not to be gone!\nWe have a trifling foolish feast that comes.\nIs it e’en so? Why, then, I thank you all.\nI thank you, honest gentlemen, good night.—\n130 [To SERVANTS] More torches here.— Come on, then, let’s to bed.\nAh, sirrah, by my thought, it waxes late:\nI’ll to my rest.\nExit all but JULIET and NURSE\nJULIET\nCome hither, nurse. Who was that gentleman?\nNURSE\nThe son and heir of old Tiberio.\nJULIET\n135 Who’s he that now is going out the door?\nNURSE\nMarry, that, I think, be young Petruchio.\nJULIET\nWho’s he that follows here that would not dance?\nNURSE\nI know not.\nJULIET\nGo ask his name.\nNURSE goes\n140 If he be married,\nMy grave is like to be my wedding bed.\nAct 1 | 37 NURSE returns\nNURSE\nHis name is Romeo, and a Montague,\nThe only son of your great enemy.\nJULIET\nMy only love sprung from my only hate!\n145 Too early seen, unknown, and known too late.\nProdigious birth of love it is to me,\nThat I must love a loathed enemy.\nNURSE\nWhat’s this? What’s this?\nJULIET\nA rhyme I learned just now\n150 From one I danced withal.\nOne calls within “JULIET!”\nNURSE\nAnon, anon°. °right away\nCome, let’s away. The strangers are all gone.\nExit all\n38 | Act 1 Act 2\nPROLOGUE\nCHORUS\nNow old desire doth in his death-bed lie,\nAnd young affection gapes° to be his heir °opens\nThat fair for which love groaned for and would die,\nWith tender Juliet matched, is now not fair.\n5 Now Romeo is beloved and loves again,\nAlike bewitched by the charm of looks,\nBut to his foe supposed he must complain,\nAnd she steal love’s sweet bait from fearful hooks:\nBeing held a foe, he may not have access\n10 To breathe such vows as lovers use to swear;\nAnd she as much in love, her means much less\nTo meet her new-beloved anywhere:\nBut passion lends them power, time means, to meet\nTempering extremities with extreme sweet.\n❖❖❖\nACT 2, SCENE 1\nMercutio and Benvolio wonder where Romeo has gone, and Mercutio mocks Romeo’s love of Rosaline.\nOutside the Capulet orchard wall:\nEnter ROMEO alone\nROMEO\nCan I go forward when my heart is here?\nTurn back dull earth and find thy center out.\nEnter BENVOLIO and MERCUTIO\nBENVOLIO\nRomeo, my cousin, Romeo! Romeo!\nAct 2 | 39 MERCUTIO\nHe is wise, and on my life he hath stolen home to bed.\nBENVOLIO\n5 He ran this way and leapt this orchard wall.\nCall, good Mercutio.\nMERCUTIO\nNay, I’ll conjure° too. °summon (as in a spirit)\nRomeo, Humors, Madman, Passion, Lover,\nAppear thou in the likeness of a sigh,\nSpeak but one rhyme, and I’ll be satisfied:\n10 Cry out at me, “Aye me,” pronounce but “love” and “dove.”\nSpeak to my gossip° Venus one fair word, °good friend\n1\nOne nickname for her pureblind° son and heir, °blind\nYoung Abraham: Cupid–he that shot so true,\n2\nWhen King Cophetua loved the beggar maid.\n15 He hears me not, he stirreth not, he moveth not.\nThe ape is dead, and I must conjure him.\nI conjure thee by Rosaline’s bright eyes,\n3\nBy her high forehead, and her scarlet lip,\nBy her fine foot, straight leg, and quivering thigh,\n4\n20 And the domains that there adjacent lie,\nThat in thy likeness, thou appear to us.\nBENVOLIO\nAnd if he hears you, that will anger him.\nMERCUTIO\nThis cannot anger him. It would anger him\nTo raise a spirit in his mistress’s circle,\n25 Of some strange nature, letting it there stand\nTill she had laid it, and conjured it down.\n1. Sensitivity note: Cupid is the Greek god of love, often portrayed as a young winged boy wearing a blindfold and carrying a\nbow and arrow. This is meant to symbolize the randomness of love and attraction, and is where we find the phrase \"Love is\nblind\".\n2. King Cophetua: An African king who had no interest in women until he fell in love with a beggar woman outside his palace.\n3. high forehead: a sign of female beauty\n4. Sensitivity note: In referring to and openly discussing Rosaline's body, Mercutio is being purposefully crude in order to draw\nout Romeo. This type of bawdy humor was a mark of Shakespeare's comedy, and was often done at the expense of the\nfemale characters.\n40 | Act 2 That were some spite. My invocation° °appeal\nIs fair and honest, and, his mistress’s name,\nI conjure only but to raise him up.\nBENVOLIO\n30 Come, he hath hidden himself among these trees\nTo be comforted by the humorous° night. °humid\nBlind is his love, which best befits the dark.\nMERCUTIO\nIf love be blind, love cannot hit the mark.\n5\nNow he will sit under a medlar tree,\n35 And wish his mistress were that kind of fruit,\nAs maids call medlars when they laugh alone.\nO Romeo, that she were–O that she were\n6\nAn open arse, and thou a “poperin” pear.\nRomeo, goodnight, I’ll go to my trundle bed,\n40 This field bed is too cold for me to sleep.\nCome, shall we go?\nBENVOLIO\nGo then, for it is in vain\nTo seek him here that means not to be found.\nExit BENVOLIO and MERCUTIO\nROMEO\nHe laughs at scars that never felt a wound.\n❖❖❖\nACT 2, SCENE 2\nJuliet appears in a window above Romeo, and she thinks she’s alone. She talks to herself, lamenting\nRomeo’s nature as a Montague. She wishes he would abandon his name, or that she could abandon hers,\nso that they could be together. Upon hearing this, Romeo reveals himself and professes his love to Juliet.\nJuliet shares the feelings of love, but worries that Romeo’s feelings might be fleeting. The Nurse calls for\n5. Now he will sit…medlar tree: Medlar tree fruit, also called the “open-arse,” was resemble to an anus.\n6. poperin pear: pun for male genitalia; “pop her in”\nAct 2 | 41 Juliet, and the couple once again declares their love for each other, Juliet promising to send somebody to\nhim at nine the next morning.\nIn the Capulet orchard:\nEnter JULIET on balcony\nROMEO\nBut soft, what light through yonder window breaks?\nIt is the East, and Juliet is the Sun.\nArise, fair Sun, and kill the envious Moon,\nWho is already sick and pale with grief\n5 That thou, her maid, art far more fair than she.\nBe not her maid, since she is envious,\n7\nHer vestal livery is but sick and green,\nAnd none but fools do wear it. Cast it off.\nIt is my lady, O it is my love, O that she knew she were.\n10 She speaks, yet she says nothing. What of that?\nHer eye discourses°; I will answer it. °communicates\n…I am too bold. ‘Tis not to me she speaks:\nTwo of the fairest stars in all the Heaven,\nHaving some business, do entreat her eyes\n15 To twinkle in their spheres till they return.\nWhat if her eyes were there and they in her head?\nThe brightness of her cheek would shame those stars\nAs daylight does a lamp; her eye in Heaven\nWould through the airy region stream so bright\n20 That birds would sing and think it were not night.\nSee how she leans her cheek upon her hand?\nO, that I were a glove upon that hand\nThat I might touch that cheek!\nJULIET\nAye, me.\nROMEO\n25 She speaks!\nO, speak again, bright Angel! For thou art\nAs glorious to this night, being over my head\nAs is a winged messenger of Heaven\nUnto the white, upturned, wondering eyes\n30 Of mortals that fall back to gaze on him\n7. vestal livery: clothing worn by the maidens of Diana, the Roman goddess of the moon\n42 | Act 2 When he bestrides° the lazy, puffing clouds °straddles\nAnd sails upon the bosom of the air.\nJULIET\nO Romeo, Romeo, wherefore° art thou Romeo? °why\nDeny thy father and refuse thy name.\n35 Or if thou will not, be but sworn my love,\nAnd I’ll no longer be a Capulet.\nROMEO\n[To himself] Shall I hear more or shall I speak at this?\nJULIET\n‘Tis but thy name that is my enemy.\nThou art thou self, though, not a Montague.\n40 What’s Montague? It is nor hand nor foot,\nNor arm, nor face, nor any other part\nBelonging to a man.\nWhat’s in a name? That which we call a rose\nBy any other name would smell as sweet.\n45 So Romeo would, were he not Romeo called,\nRetain that divine perfection which he owes\nWithout that title. Romeo, doff° thy name, °remove; cast away\nAnd for thy name which is no part of thee,\nTake all myself.\nROMEO\n50 I take thee at thy word,\nCall me but love, and I’ll be new baptized.\nHenceforth, I never will be Romeo.\nJULIET\nWhat man art thou, that thus bescreened° by night, °concealed\nSo stumbles on my counsel°? °private thoughts\nROMEO\n55 By a name, I know not how to tell thee who I am.\nMy name, dear Saint, is hateful to myself\nBecause it is an enemy to thee.\nHad I it written, I would tear the word.\nAct 2 | 43 JULIET\nMy ears have not yet drunk a hundred words\n60 Of thy tongue’s uttering, yet I know the sound.\nArt thou not Romeo and a Montague?\nROMEO\nNeither, fair Saint, if either thee dislike.\nJULIET\nHow camest thou hither?\nTell me, and wherefore?\n65 The orchard walls are high and hard to climb\nAnd the place death, considering who thou art,\nIf any of my kinsmen find thee here.\nROMEO\nWith love’s light wings did I o’erperch° these walls, °fly over\nFor stony limits cannot hold love out,\n70 And what love can do, that dares love attempt,\nTherefore thy kinsmen are no stop to me.\nJULIET\nIf they do see thee, they will murder thee.\nROMEO\nAlas, there lies more peril in thine eyes\nThan twenty of their swords. Look thou but sweet,\n75 And I am proof° against their enmity°. °immune °hostility\nJULIET\nI would not for the world they saw thee here.\nROMEO\nI have night’s cloak to hide me from their eyes,\nAnd, but thou love me, let them find me here.\nMy life were better ended by their hate\n80 Than death prolonged, wanted of thy love.\n44 | Act 2 JULIET\nBy whose direction found’st thou out this place?\nROMEO\nBy love, that first did prompt me to inquire.\nHe lent me counsel, and I lent him eyes.\nI am no pilot; yet, were thou as far\n85 As the vast shore washeth with the farthest sea,\nI should adventure for such merchandise.\nJULIET\nThou knowest the mask of night on my face,\nElse would a maiden blush bepaint my cheek\nFor that which thou hast heard me speak tonight.\n90 Fain° would I dwell on form°. Fain, fain deny °gladly °formalities\nWhat I have spoke. But farewell complements°! °good manners\nDost thou love me? I know thou wilst say “Aye,”\nAnd I will take thy word. Yet, if thou swear’st,\nThou might prove false. At lovers’ perjuries\n8\n95 They say Jove laughs. O gentle Romeo\nIf thou dost love, pronounce it faithfully.\nOr if thou think I am too quickly won,\nI’ll frown and be perverse°, and say thee nay °destruction\nSo thou wilt woo; but else not for the world.\n100 In truth, fair Montague, I am too fond:\nAnd therefore thou might think my behavior light°. °immodest\nBut trust me, gentleman, I’ll prove more true\nThan those who have more cunning to be strange°. °standoffish\nI should have been more strange, I must confess,\n105 But that thou overheard, ere I was ‘ware,\nMy true love’s passion. Therefore, pardon me,\nAnd not impute this yielding to light love,\nWhich the dark night hath so discovered.\nROMEO\nLady, by yonder blessed moon I vow,\n110 That tips with silver all these fruit-tree tops—\nJULIET\nO swear not by the moon, the inconstant moon,\n8. Jove: Another name for Jupiter, the king of gods in Roman mythology\nAct 2 | 45 That monthly changes in her circled orb,\nLest that thy love prove likewise variable.\nROMEO\nWhat shall I swear by?\nJULIET\n115 Do not swear at all.\nOr if thou wilt, swear by thy gracious self,\nWhich is the god of my idolatry°, °worship\nAnd I’ll believe thee.\nROMEO\nIf my heart’s dear love—\nJULIET\n120 Well, do not swear. Although I joy in thee,\nI have no joy in this contract tonight.\nIt is too rash, too unadvised, too sudden,\nToo like the lightning which doth cease to be\nEre one can say, “It lightens.” Sweet, good night.\n125 This bud of love by summer’s ripening breath\nMay prove a beauteous flower when we next meet.\nGoodnight, goodnight! As sweet repose and rest,\nCome to my heart, as that within my breast.\nROMEO\nO wilt thou leave me so unsatisfied?\nJULIET\n130 What satisfaction can’st thou have tonight?\nROMEO\nTh’ exchange of thy love’s faithful vow for mine.\nJULIET\nI gave thee mine before thou did’st request it,\nAnd yet I wish it would to give again.\n46 | Act 2 ROMEO\nWould’st thou withdraw it? For what purpose, love?\nJULIET\n135 But to be frank and give it to thee again,\nAnd yet I wish but for the thing I have.\nMy bounty is as boundless as the sea,\nMy love as deep; the more I give to thee,\nThe more I have, for both are infinite.\nNURSE calls from within\n140 I hear some noise within, dear love. Adieu!\n[Calls within] Anon, good nurse! [To ROMEO] Sweet Montague, be true.\nStay but a little. I will come again.\nExit JULIET\nROMEO\nO blessed, blessed night! I am afraid,\nBeing in night, all this is but a dream,\n145 Too flattering-sweet to be substantial.\nEnter JULIET again\nJULIET\nThree words, dear Romeo, And goodnight, indeed.\nIf that thy bent° of love be honorable, °intentions\nThy purpose marriage, send me word tomorrow,\nBy one that I’ll procure to come to thee,\n150 Where and what time thou wilt perform the rite.\nAnd all my fortunes at thy foot I’ll lay\nAnd follow thee, my lord, throughout the world.\nNURSE\n[From within] Madam!\nJULIET\nI come, anon! [To ROMEO] But if thou mean not well,\n155 I do beseech thee—\nNURSE\n[From within] Madam!\nAct 2 | 47 JULIET\nBy and by, I come!\n[To ROMEO] To cease thy strife, and leave me to my grief,\nTomorrow I will send.\nROMEO\n160 So thrive my soul—\nJULIET\nA thousand times goodnight!\nExit JULIET\nROMEO\nA thousand times the worse to want thy light.\nLove goes toward love, as schoolboys from their books,\nBut love from love, toward school with heavy looks.\nROMEO starts to go\nEnter JULIET again\nJULIET\n165 Hush, Romeo! Hush! O, for a falconer’s voice\n9\nTo lure this tassel-gentle back again.\nBondage° is hoarse and may not speak aloud °familial duties\n10\nElse would I tear the cave where Echo lies\nAnd make her airy tongue more hoarse than mine\n170 From repetition of “My Romeo.”\nROMEO\nIt is my soul that calls upon my name.\nHow silver-sweet sound lovers’ tongues by night,\nLike softest music to attending° ears. °attentive\n9. O, for a falc’ner’s voice \/ To lure this tassel-gentle back again: Juliet wishes she could call back Romeo the way a falconer\ncalls back a male falcon (“tassel-gentle”).\n10. Echo: a figure from Greek legend; a woman who wasted away from heartbreak and remains only as the voice that echoes\nback to you.\n48 | Act 2 JULIET\nRomeo!\nROMEO\n175 My sweet?\nJULIET\nWhat o’clock tomorrow shall I send to thee?\nROMEO\nBy the hour of nine.\nJULIET\nI will not fail. Tis twenty years ‘till then.\nI have forgot why I did call thee back.\nROMEO\n180 Let me stand here ‘till thou remember it.\nJULIET\nI shall forget, to have thee still stand there,\nRemembering how I love thy company.\nROMEO\nAnd I’ll still stay to have thee still forget,\nForgetting any other home but this.\nJULIET\n185 ‘Tis almost morning. I would have thee gone,\nAnd yet no further than a wanton’s° bird °spoiled child’s\nThat lets it hop a little from his hand\nLike a poor prisoner in twisted cuffs,\nAnd with a silken thread, plucks it back again,\n190 So loving-jealous of its liberty.\nROMEO\nI would I were thy bird.\nAct 2 | 49 JULIET\nSweet, so would I,\nYet I should kill thee with much cherishing.\nGoodnight, goodnight. Parting is such sweet sorrow\n195 That I shall say goodnight ‘till it be morrow.\nExit JULIET\nROMEO\nSleep dwell upon thine eyes, peace in thy breast,\nWould I were sleep and peace so sweet to rest.\nHence will I to my ghostly° friar’s cell. °spiritual\nHis help to crave, and my dear hap° to tell. °good fortune\nExit ROMEO\n❖❖❖\nACT 2, SCENE 3\nFriar Lawrence carries a basket of herbs and plants as he contemplates the goodness of the earth. Romeo\nfinds the friar. The friar notices that Romeo hasn’t slept, and asks if Romeo slept with Rosaline in sin.\nRomeo denies it and describes his new love of Juliet. The friar is concerned at how quickly Romeo’s feelings\nhave changed. Romeo convinces the friar to perform a wedding for Romeo and Juliet. The friar hopes that\nsome good may come of it, perhaps even an end to the feud between the Capulets and Montagues.\nFriar Lawrence’s cell in Verona; early morning:\nEnter FRIAR alone with a basket\nFRIAR\nThe grey-eyed morn smiles on the frowning night,\nCheckering the eastern clouds with streaks of light;\nAnd fleckèd darkness like a drunkard reels\n11\nFrom forth day’s path and Titan’s fiery wheels.\n5 Now ere the sun advance his burning eye,\nThe day to cheer, and night’s dank dew to dry,\nI must fill up this reed basket of ours\nWith deadly weeds, and precious juiced flowers.\nThe earth, that’s nature’s mother, is her tomb,\n10 And is her burying grave, and is her womb.\nAnd from her womb children of diverse kind\n11. Titan’s firey wheels: reference to Helios, Greek god of the sun\n50 | Act 2 We sucking on her natural bosom find.\nMany for many virtues excellent,\nNone but for some, and yet all different.\n15 O, how great is the powerful grace that lies\nIn plants, herbs, stones, and their true qualities.\nFor naught so vile here on the earth doth live\nBut to the earth some special good doth give.\nNor aught so good but strained from that fair use—\n20 Used unnaturally—stumbles on abuse.\nVirtue itself turns vice, being misapplied,\nAnd vice sometimes, by action, dignified.\nEnter ROMEO\nFRIAR\nWith the infant rind of this weak flower,\nPoison hath residence, and medicine power.\n25 For this being smelt, with that part cheers our parts,\nBeing tasted, slays all senses with the heart.\nTwo such opposèd kings encamp them still,\nIn man as well as herbs, grace°, and rude will°. °virtue °desire\nAnd where the worser is predominant,\n30 Full soon, the canker death eats up that plant.\nROMEO\nGood morrow, Father.\nFRIAR\n12\nBenedicte.\nWhat early tongue so sweet salutes me?\nYoung son, it argues a distempered° head °troubled\n35 If you so soon bade good morrow to thy bed.\nCare keeps his watch in every old man’s eye,\nAnd where care lodges, sleep will never lie.\nBut where unbruisèd youth with unstuffed brain\nDoth couch his limbs, there golden sleep doth reign.\n40 Therefore thy earliness doth me assure\nThou art uproused with some distemperature:\nOr if not so, then here I hit it right:\nOur Romeo hath not been in bed tonight.\n12. Benedicte: a blessing\nAct 2 | 51 ROMEO\nThat last is true. The sweeter rest was mine.\nFRIAR\n45 God pardon sin! Wast thou with Rosaline?\nROMEO\nWith Rosaline, my ghostly Father? No,\nI have forgot that name, and that name’s woe.\nFRIAR\nThat’s my good son! But where hast thou been, then?\nROMEO\nI’ll tell thee ere thou ask it me again.\n50 I have been feasting with mine enemy\nWhere on a sudden one hath wounded me,\nAnd, by me, wounded. Both our remedies\nWithin thy help and holy physic° lies. °remedy\nI bear no hatred, blessed man: for now\n55 My intervention likewise steads° my foe. °benefits\nFRIAR\nBe plain, good son, and homely° in thy drift. °simple\nRiddling confession finds but riddling shrift°. °absolution\nROMEO\nThen plainly know my heart’s dear love is set\nOn the fair daughter of rich Capulet.\n60 As mine on hers, so hers is set on mine,\nAnd all combined, save what thou must combine\nBy holy marriage. Where, and when, and how\nWe met, we wooed, and made exchange of vow\nI’ll tell thee as we pass, but this I pray:\n65 That thou consent to marry us today.\nFRIAR\nHoly Saint Francis, what a change is here!\nIs Rosaline that thou didst love so dear\n52 | Act 2 So soon forsaken? Young men’s love then lies\nNot truly in their hearts, but in their eyes.\n70 Jesu° Maria, what a deal of brine° °Jesus °salt water; tears\nHath washed thy sallow cheeks for Rosaline?\nHow much salt water thrown away in waste,\n13\nTo season love, that of it doth not taste.\nThe sun not yet thy sighs from heaven clears,\n75 Thy old groans ring yet in mine ancient ears.\nLo, here upon thy cheek the stain doth sit\nOf an old tear that is not washed off yet.\nIf ever you were you, and these woes thine,\nThou and these woes were all for Rosaline.\n80 And art thou changed, pronounce this sentence then:\n14\nWomen may fall when there’s no strength in men.\nROMEO\nThou chidest° me oft for loving Rosaline. °scolded\nFRIAR\nFor doting, not for loving, pupil mine.\nROMEO\nAnd bad’st° me bury love. °advised\nFRIAR\n85 Not in a grave\nTo lay one in, another out to have.\nROMEO\nI pray thee, chide me not. Her I love now\nDoth grace for grace and love for love allow.\nThe other did not so.\nFRIAR\n90 O, she knew well,\n15\nThy love did read by rote, and could not spell.\n13. To season: as in to salt\n14. Women may fall: women will fail morally\n15. by rote: memorization without understanding\nAct 2 | 53 16\nBut come young waverer, come, go with me,\nIn one respect I’ll thy assistant be,\nFor this alliance may so happy prove,\n95 To turn your households’ rancor to pure love.\nROMEO\nO, let us hence. I stand on sudden haste.\nFRIAR\nWisely and slow. They stumble that run fast.\nExit all\n❖❖❖\nACT 2, SCENE 4\nBenvolio and Mercutio wonder where Romeo has been. Benvolio found out from a Montague servant that\nRomeo never returned home the night before. Benvolio tells Mercutio that Tybalt has challenged Romeo\nto a duel. Mercutio describes why he hates Tybalt. When Romeo arrives, Mercutio mocks Romeo for being\nweak because of his love for Rosaline. Romeo neglects to tell them about Juliet. The Nurse enters with a\nCapulet servant, Peter. Romeo tells her to pass on a message: have Juliet meet him for confessional at Friar\nLawrence’s cell that afternoon, where Friar Lawrence will marry them. The Nurse agrees.\nSomewhere in Verona; morning:\nEnter BENVOLIO and MERCUTIO\nMERCUTIO\nWhere the devil should this Romeo be? Came he not home tonight?\nBENVOLIO\nNot to his father’s. I spoke with his man.\nMERCUTIO\nWhy, that same pale, hard-hearted wench, that Rosaline, torments\nhim so, that he will sure run mad.\n16. young waverer: indecisive young man\n54 | Act 2 BENVOLIO\n5 Tybalt, the kinsman to old Capulet,\nHath sent a letter to his father’s house.\nMERCUTIO\nA challenge, I would swear.\nBENVOLIO\nRomeo will answer it°. °accept\nMERCUTIO\nAny man that can write may answer a letter.\nBENVOLIO\n10 Nay, he will answer the letter’s master, how he dares, being dared.\nMERCUTIO\nAlas, poor Romeo, he is already dead: stabbed with a white\nwench’s black eye; shot through the ear with a love-song; the very\n17 18\npin of his heart cleft with the blind bow-boy’s butt-shaft. And is\nhe a man to encounter Tybalt?\nBENVOLIO\n15 Why, what is Tybalt?\nMERCUTIO\n19\nMore than the Prince of Cats, I can tell you. O, he’s the\ncourageous Captain of Compliments. He fights like you sing\n20\npricksong, keeps time, distance and proportion; he rests, his\n21\nminim rest, one, two, and the third in your bosom. The very\n20 butcher of a silk button, a dualist, a dualist; a gentleman of the\n22\nvery first house, of the first and second cause; ah, the immortal\n17. pin: peg marking the center of a target\n18. butt-shaft: arrow with no barb\n19. Prince of Cats: a figure from a popular story, Reynard the Fox, who is also called Tybalt\n20. Pricksong: or “pricked-song,” is music performed from written notation, instead of from memory or by ear\n21. minim: to rest half a note\n22. very first house: a prestigious school for fencing\nAct 2 | 55 23\npassado! the punto reverso! the hay!\nBENVOLIO\nThe what?\nMERCUTIO\n24 25\nThe pox of such antic, lisping, affecting fanasticoes, these new\n25 tuners of accents! By Jesu, a very good blade! A very tall man! A\nvery good whore! Why, is not this a lamentable thing, grandsire°, °old man\nthat we should be thus afflicted with these strange flies, these\nfashion-mongers, these pardon-me’s, who stand so much on the\nnew form that they cannot sit at ease on the old bench. O, their\n26\n30 bones, their bones!\nEnter ROMEO\nBENVOLIO\nHere comes Romeo, here comes Romeo.\nMERCUTIO\n27\nWithout his roe, like a dried herring. O flesh, flesh, how art thou\nfishified! Now is he for the numbers° that Petrarch flowed in. °verse\nLaura to his lady was but a kitchen-wench; marry, she had a\n28\n35 better love to be-rhyme her; Dido, a dowdy; Cleopatra, a gipsy;\n29\nHelen and Hero, hildings° and harlots; Thisbe, a grey eye or °good-for-nothings\ntwo, but not worth mention.\n[To Romeo] Signior Romeo, bonjour! There’s a French salutation to\n30\nyour French slop°. You gave us the counterfeit fairly last night. °baggy pants\nROMEO\n40 Good morrow to you both. What counterfeit\nDid I give you?\n23. the immortal…the hay: Italian fencing terms\n24. pox: exclamation of irritation\n25. antic: possibly grotesque or “antique,” though due to the era’s spelling and the context “antic” is likely\n26. their bones: pun on French “bon”\n27. roe: fish eggs, or the “ro” in Romeo\n28. dowdy: unattractively dressed woman\n29. Laura…Thisbe: classical figures who killed themselves for love\n30. You gave us the counterfeit: i.e., you ditched us\n56 | Act 2 MERCUTIO\nThe slip, sir, the slip°. Can you not conceive? °counterfeit coin\nROMEO\nPardon, good Mercutio, my business was vital, and in such a case\nas mine a man may strain courtesy.\nMERCUTIO\n45 That’s as much as to say: Such a case as yours constrains a man to\nbow in the hams.\nROMEO\nMeaning to curtsy.\nMERCUTIO\nThou hast most kindly hit it.\nROMEO\nA most courteous explanation.\nMERCUTIO\n50 Nay, I am the very pink° of courtesy. °perfect example\nROMEO\nPink for flower.\nMERCUTIO\nRight.\nROMEO\n31\nWhy, then is my pump well flowered.\n31. my pump well flowered: i.e., my feet are tired from dancing\nAct 2 | 57 MERCUTIO\nWell said. Follow me this jest now, till thou has worn out thy\n55 pump, that when the single role of it is worn, the jest may remain,\nafter the wearing, solely singular.\nROMEO\n32\nO single-soled jest, solely singular for the singleness.\nMERCUTIO\nCome between us, good Benvolio. My wits fail.\nROMEO\n33\nSwits and spurs, swits and spurs, or I’ll win this match.\nMERCUTIO\n60 Nay, if our wits run the wild goose chase, I am done: for thou\nhast more of the wild-goose in one of thy wits than I am sure I\nhave in my whole five. Was I with you there for the goose?\nROMEO\nThou wast never with me for anything when thou was not there\nfor the goose°. °sex worker\nMERCUTIO\n65 I will bite thee by the ear for that jest.\nROMEO\nNay, good goose, bite not.\nMERCUTIO\nThy wit is a very bitter sweeting; it is a most sharp sauce.\n32. single-soled jest: weak joke\n33. Swits and spurs: i.e., make your horse go faster\n58 | Act 2 ROMEO\nAnd is it not, then, well served to a sweet goose?\nMERCUTIO\nO, here’s a wit like cheveril° that stretches from an inch narrow °stretchy leather\n70 to an ell° broad. °forty-five inches\nROMEO\nI stretch it out for that word “broad”°, which added to the goose, °fat\nproves thee far and wide a broad goose.\nMERCUTIO\nWhy, is not this better now than groaning for love? Now art thou\nsociable; now art thou Romeo; now art thou what thou art, by art\n75 as well as by nature: for this riveling love is like a great natural°, °idiot\nthat runs lolling° up and down to hide his bauble° in a hole. °loose °jester’s baton\nBENVOLIO\nStop there, stop there.\nMERCUTIO\n34\nThou desirest me to stop in my tale against the hair.\nBENVOLIO\nThou wouldst else have made thy tale large.\nMERCUTIO\n80 O, thou art deceived; I would have made it short: For I was come\nto the whole depth of my tale, and meant indeed to occupy the\nargument no longer.\nEnter NURSE and her man, PETER\nROMEO\nHere comes goodly stuff. A sail, a sail!\n34. against the hair: against the grain\nAct 2 | 59 BENVOLIO\n35\nTwo, two: a shirt and a smock.\nNURSE\n85 Peter.\nPETER\nAt your service.\nNURSE\nMy fan, Peter.\nMERCUTIO\nGood Peter, to hide her face, for her fan’s the fairer face.\nNURSE\nGod ye good morrow, gentlemen.\nMERCUTIO\n90 God ye good evening, fair gentlewoman.\nNURSE\nIs it good evening?\nMERCUTIO\nTis no less, I tell ye, for the bawdy° hand of the dial is now upon °indecent\n36\nthe prick of noon.\nNURSE\nOut upon you! What kind of man are you?\n35. a shirt and a smock: meaning, a man and a woman\n36. prick: clock point; male genitalia\n60 | Act 2 ROMEO\n95 One, gentlewoman, that God hath made, for himself to mar.\nNURSE\n37\nBy my troth, well said. “For himself to mar,” quoth he?\nGentlemen, can any of you tell me where I may find\nthe young Romeo?\nROMEO\nI can tell you, but young Romeo will be older when you have\n100 found him than he was when you sought him.\nI am the youngest of that name, for lack of a worse.\nNURSE\nYou speak well.\nMERCUTIO\nYea, is the worst well? Very well took, in faith, wisely, wisely.\nNURSE\n38\nIf you be he, sir, I desire some confidence with you.\nBENVOLIO\n39\n105 She will indite him to some supper.\nMERCUTIO\n40\nA bawd, a bawd, a bawd!\nSo ho!\nROMEO\nWhat hast thou found?\n37. By my troth: Upon my word\n38. confidence: The Nurse fumbles on the word “conference.”\n39. indite: Benvolio mocks the nurse by purposefully fumbling the word “invite.”\n40. bawd: a hare; a go-between for prostitutes\nAct 2 | 61 MERCUTIO\n41\nNo hare sir, unless it be a hare in Lenten pie, that is somewhat\n42\n110 stale and hoar ere it be spent.\nHe walks by them and sings\n‘An old hare hoar,\nAnd an old hare hoar\nIs very good meat in Lent.\nBut a hare that is hoar,\n43\n115 Is too much for a score,\n44\nWhen it hoars ere it be spent.’\nRomeo, will you come to your father’s? We’ll dinner thither.\nROMEO\nI will follow you.\nMERCUTIO\nFarwell, ancient lady; farewell, [singing] ‘Lady, Lady, lady.’\nExit BENVOLIO and MERCUTIO\nNURSE\n120 Marry, farewell! I pray you, sir, what saucy merchant° was this °con man\nthat was so full of ropery°? °trickery\nROMEO\nA gentleman, Nurse, that loves to hear himself talk, and will\nspeak more in a minute, than he will stand to in a month.\nNURSE\nIf he speak anything against me, I’ll take him down, even if he\n125 were lustier° than he is, with twenty such Jacks°; and if I could not, °energetic °fellows\nI’d find those that shall. Scurvy knave! I am none of his flirt-girls,\n45\nI am none of his skains-mates.\nShe turns to PETER\nAnd thou like a knave must stand by, and see every knave use me at his pleasure?\n41. Lenten pie: pie with no meat\n42. hoar: moldy; pun on the word “whore”\n43. for a score: to pay for\n44. An old…be spent: If the Nurse were a whore, she would be like old bread that is only eaten as a last resort.\n45. skains-mates: friends who carry knives\n62 | Act 2 PETER\n130 I saw no man use you at his pleasure; if I had, my weapon should\nquickly have been out, I warrant you. I dare draw as\nsoon as another man, if I see occasion in a good quarrel and the law on\nmy side.\nNURSE\nNow afore God, I am so vexed, that every part about me quivers.\n135 Scurvy knave! Pray you, sir, a word. And as I told you, my young\nlady bid me inquire you out; what she bid me say, I will keep to\nmyself, but first let me tell ye, if ye should lead her in a fool’s\nparadise, as they say, it would be very gross kind of behavior, as\nthey say. For the gentlewoman is young, and therefore, if you\n140 should deal double° with her, truly it were an ill thing to be offered °double cross\nto any gentlewoman, and very weak dealing°. °poor behavior\nROMEO\n46\nNurse, commend me to thy lady and mistress, I protest unto\nthee—\nNURSE\nGood heart, and in faith, I will tell her as much. Lord, Lord, she\n145 will be a joyful woman.\nROMEO\nWhat wilt thou tell her Nurse? Thou dost not hear me.\nNURSE\nI will tell her, sir, that you do protest, which as I take it, is a\ngentlemanlike offer.\nROMEO\nBid her devise some means to come to shrift° this afternoon, and °confession\n150 there she shall at Friar Lawrence’s cell be shrived° and married. °have confession\nHere is for thy pains.\nROMEO offers her money.\n46. protest: The Nurse mistakes the word “protest” for “propose” in the subsequent lines.\nAct 2 | 63 NURSE\nNo, truly sir, not a penny.\nROMEO\nGo to; I say you shall.\nNURSE\nThis afternoon, sir? Well, she shall be there.\nROMEO\n155 And stay, good Nurse, behind the abbey wall.\nWithin this hour my man shall be with thee,\n47\nAnd bring thee cords made like a tackled stair,\n48\nWhich to the high top-gallant of my joy\nMust be my convoy in the secret night.\n160 Farewell, be trusty, and I’ll quit° thy pains. °pay you for\nFarewell. Commend me to thy mistress.\nNURSE\nNow God in heaven bless thee! Hark you, sir.\nROMEO\nWhat sayest thou, my dear Nurse?\nNURSE\nIs your man secret? Did you never hear say,\n49\n165 Two may keep counsel, putting one away?\nROMEO\nI warrant thee, my man’s as true as steel.\nNURSE\nWell, sir, my mistress is the sweetest lady. Lord, Lord, when ‘twas\n47. cords made like a tackled stair: a rope ladder\n48. top-gallant: the top of the mast of a ship\n49. Proverb meaning two can only keep a secret if one is far away or dead\n64 | Act 2 a little prating thing°. O, there is a nobleman in town, one Paris, °burbling baby\n50\nthat would fain° lay knife aboard. But she, good soul, would °eagerly\n170 happily see a toad, a very toad, than him. I anger her sometimes,\nand tell her that Paris is the properer man, but I’ll warrant you,\n51\nwhen I say so, she looks as pale as any clout° in the versall °piece of cloth\n52\nworld. Doth not rosemary and Romeo begin both with a letter?\nROMEO\nAye, Nurse, what of that? Both with an “R.”\nNURSE\n53\n175 Ah, mocker! That’s the dog’s name; R is for the—no, I know it\nbegins with some other letter—and she hath the prettiest\n54\nsententious of it, of you and rosemary, that it would do you good\nto hear it.\nROMEO\nCommend me to thy lady.\nNURSE\n180 Aye, a thousand times. Peter?\nPETER\nAnon.\nNURSE\nBefore and apace°. °quickly\nExit all\n❖❖❖\n50. lay knife aboard: lay to claim Juliet\n51. versall: the Nurse fumbles on the word “universal”\n52. rosemary: In Hamlet, it is said that rosemary is “for remembrance” of the dead.\n53. dog’s name: “R” sounds like a dog’s growl\n54. sententious: the Nurse fumbles on the word “sentence”\nAct 2 | 65 ACT 2, SCENE 5\nJuliet waits for the Nurse to return. When the Nurse returns, Juliet begs her for information. The Nurse\ndelays, saying she’s too tired and her body is too sore. Juliet pressures her until the Nurse gives in and tells\nher that Romeo is waiting to marry her at Friar Lawrence’s cell.\nSomewhere outside the Capulet estate:\nEnter JULIET\nJULIET\nThe clock struck nine when I did send the Nurse.\nIn half an hour she promised to return.\nPerchance she cannot meet him. That’s not so:\n55\nO, she is lame! Love’s heralds should be thoughts\n5 Which ten times faster glide than the sun’s beams\nDriving back shadows over lowering hills.\n56\nTherefore do nimble-pinioned doves draw Love,\n57\nAnd therefore hath the wind-swift Cupid wings.\nNow is the sun upon the highmost hill\n10 Of this day’s journey, and from nine till twelve,\nIs three long hours, yet she is not come.\nHad she affections and warm, youthful blood,\nShe would be as swift in motion as a ball,\nMy words would bandy° her to my sweet love, °throw\n15 And his to me. But old folks,\nMany feign as they were dead,\nUnwieldy, slow, heavy, and pale as lead.\nEnter NURSE and PETER\nO God, she comes. O, honey Nurse, what news?\nHast thou met with him? Send thy man away.\nNURSE\n20 Peter, stay at the gate.\nExit PETER\n55. Sensitivity note: \"Lame,\" as used here, means feeble or slow. Though \"lame\" is primarily used to describe someone who is\ndisabled in their leg or foot, it has evolved to mean \"uninspiring\" or \"slow.\" It is important to be conscious of using words\nrelated to disability in a derogatory manner, as it can contribute to a negative connotation surrounding words that are still\nprimarily used to objectively describe differently-abled individuals.\n56. nimble-pinioned doves draw Love: as doves pull Venus in her chariot\n57. Cupid: son of Venus and god of desire, affection, and love\n66 | Act 2 JULIET\nNow, good sweet Nurse—\nO, Lord, why lookest thou sad?\nThough news be sad, yet tell them merrily.\nIf good, thou shames the music of sweet news\n25 By playing it to me with so sour a face.\nNURSE\nO, I am weary. Let me rest awhile.\n58\nFie, how my bones ache! What a jaunt I had!\nJULIET\nI would thou had’st my bones, and I thy news.\nNay, come, I pray thee, speak. Good, good Nurse, speak.\nNURSE\n30 Jesu, what haste? Can you not wait awhile?\nDo you not see that I am out of breath?\nJULIET\nHow art thou out of breath, when thou hast breath\nTo say to me, that thou art out of breath?\nThe excuse that thou dost make in this delay,\n35 Is longer than the tale thou dost excuse.\nIs thy news good or bad? Answer to that.\n59\nSay either, and I’ll stay the circumstance.\nLet me be satisfied, is’t good or bad?\nNURSE\nWell, you have made a foolish choice. You know not how to\n40 choose a man. Romeo, no, not he, though his face be better than\nany man’s; and his leg excels all mens’; and for a hand, and a foot,\nand a body, though not much to talk on, yet they are past\n60\ncompare. He is not the flower of courtesy, but I’ll warrant him as\ngentle as a lamb. Go thy ways, wench; serve God. What, have you\n45 dined at home?\n58. Fie: Here, an exclamation, like “oh!”\n59. stay the circumstance: wait for details\n60. not the flower of courtesy: not very courteous\nAct 2 | 67 JULIET\nNo, no. But all this did I know before.\nWhat says he of our marriage? What of that?\nNURSE\nLord, how my head aches! What a head have I?\nIt beats as it would fall in twenty pieces.\n50 My back a’ t’ other° side! Oh my back, my back. °at the other\nBeshrew° your heart for sending me about °curse\nTo catch my death with jaunting up and down.\nJULIET\nI’faith, I am sorry that thou art not well.\nSweet, sweet, sweet Nurse, tell me, what says my love?\nNURSE\n55 Your love says, like an honest gentleman,\nAnd a courteous, and a kind, and a handsome,\nAnd I warrant, a virtuous—Where is your mother?\nJULIET\nWhere is my mother?\nWhy she is within, where should she be?\n60 How oddly thou repliest.\n“Your love says like an honest gentleman:\nWhere is your mother?”\nNURSE\n61\nOh God’s lady dear,\nAre you so hot? Marry, come up, I trow.\n65 Is this the poultice° for my aching bones? °homemade ointment\nHenceforward do your messages yourself.\nJULIET\nWhat a fuss! Come, what says Romeo?\n61. Oh God’s lady dear: Holy Mary, mother of God\n68 | Act 2 NURSE\nHave you got leave to go to shrift today?\nJULIET\nI have.\nNURSE\n70 Then hie° you hence to Friar Lawrence’s cell, °hurry\nThere waits a husband to make you a wife.\nNow comes the wanton blood up in your cheeks;\nThey turn to scarlet, straight, at any news.\nHie you to church. I must another way\n75 To fetch a ladder by which your love\nMust climb a bird’s nest soon when it is dark,\nI am the drudge, and toil in your delight.\n62\nBut you shall bear the burden soon at night.\nGo. I’ll to dinner; hie you to the cell.\nJULIET\n80 Hie to high fortune! Honest Nurse, farewell.\nExit all\n❖❖❖\nACT 2, SCENE 6\nRomeo and Friar Lawrence wait at the cell. Romeo says his current joy far outweighs any misfortune that\nmay come. Juliet arrives. They all exit and the friar performs the wedding.\nFriar Lawrence’s cell in Verona:\nEnter FRIAR and ROMEO\nFRIAR\nSo smile the heavens upon this holy act,\nThat, after hours, with sorrow chide us not!\n62. The Nurse is enduring pain so that Juliet may find happiness. However, she suggests that Juliet will soon be the one\nenduring pain for the pleasure of another when she consummates her marriage with Romeo. The implication is that it will\nbe Juliet's burden as a wife to please her husband. This fits the comedic albeit insensitive tone typical of the Nurse.\nAct 2 | 69 ROMEO\nAmen, amen, but come what sorrows will,\nThey cannot countervail° the exchange of joy °equal\n5 That one short minute gives me of her sight.\nDo thou but close our hands with holy words,\nThen love-devouring death do what he dare,\nIt is enough I may but call her mine.\nFRIAR\nThese violent delights have violent ends,\n10 And in their triumph die like fire and powder°. °gun powder\nWhich, as they kiss, consume. The sweetest honey\nIs loathsome in his own deliciousness\nAnd is the taste confounds° the appetite. °destroys\nTherefore love moderately. Long love doth so.\n15 Too swift arrives as tardy as too slow.\nEnter JULIET\nFRIAR\nHere comes the Lady. O, so light a foot\nWill never wear out the everlasting flint°. °hardships of life\nA lover may bestride the gossamers°, °spider’s web\nThat idles in the wanton summer air,\n20 And yet not fall, so light is vanity.\nJULIET\nGood evening to my ghostly confessor.\nFRIAR\nRomeo shall thank thee, daughter, for us both.\nJULIET\nAnd same to him, else is his thanks too much.\nROMEO\nAh Juliet, if the measure of thy joy\n25 Be heaped like mine, and since thy skill be more\nTo blazon° it, then sweeten with thy breath °describe\n70 | Act 2 63\nThis neighbor air, and let rich music’s tongue\nUnfold the imagined happiness that we\nReceive in either, by this dear encounter.\nJULIET\n30 Conceit°, more rich in matter than in words, °Understanding\nBrags of his substance, not of ornament.\nThey are but poor folk that can count their worth,\nBut my true love is grown to such excess\nI cannot sum up sum of half my wealth.\nFRIAR\n35 Come, come with me, and we will make short work.\nFor, by your leaves, you shall not stay alone\nTill Holy Church incorporate two in one.\nExit all\n63. This neighbor air: this air we share\nAct 2 | 71 Act 3\nACT 3, SCENE 1\nBenvolio urges Mercutio to come away with him and avoid the Capulets in the streets. Mercutio brushes\nhim off. Tybalt and other Capulets arrive, whom Mercutio taunts. Benvolio tries to move the conflict\nsomewhere private, but Romeo interrupts with his arrival. Tybalt challenges him to fight, citing prior\ngrievances; Romeo refuses and attempts to de-escalate the situation. Mercutio goads Tybalt into a duel,\nwhich Romeo tries and fails to stop. Tybalt stabs Mercutio, who in his dying moments curses both the\nMontague and Capulet houses. Benvolio informs Romeo that Mercutio is dead; upon re-encountering\nTybalt, Romeo fights and kills him. Benvolio convinces Romeo to flee before passersby arrive. The Prince\nand both families then arrive to the scene. Benvolio explains what happened, but Lady Capulet, observing\nBenvolio to be biased, urges the Prince to punish the Montague family by executing Romeo. The Prince\nchooses instead to banish Romeo from the city.\nOn a street somewhere in Verona:\nEnter MERCUTIO and BENVOLIO\nBENVOLIO\nI pray thee, good Mercutio, let’s retire,\nThe day is hot, the Capulets are abroad,\nAnd if we meet we shall not ‘scape a brawl,\nFor these hot days is the mad blood stirring.\nMERCUTIO\n5 Thou art like one of these fellows who, when he enters the\nconfines of a tavern, claps down his sword upon the table and\nsays “God send me no need of thee,” but under the influence\nof the second cup, draws it on the drawer°, when indeed there is no °bartender\nneed.\nBENVOLIO\n10 Am I like such a fellow?\nMERCUTIO\nCome, come, thou art such a Jack in thy moods as any in Italy,\nand as soon moved to be moody, and as soon moody to be\nmoved.\n72 | Act 3 BENVOLIO\n1\nAnd what to?\nMERCUTIO\n15 Nay, an there were two such, we should have none shortly, for\none would kill the other. Thou—why, thou wilt quarrel with a\nman who hath a hair more or a hair less in his beard than thou\nhast. Thou wilt quarrel with a man for cracking nuts°, having no °hazelnuts\nother reason than that thou hast hazel eyes. What eye but such\n20 an eye would spy out such a quarrel? Thy head is as full of\nquarrels as an egg is full of meat, and yet thy head has been\nbeaten as addled° as an egg from quarrelling. Thou once °beaten\nquarreled with a man for coughing in the street because he hath\nwakened thy dog that had lain asleep in the sun. Didst thou not\n25 fall out with a tailor for wearing his new doublet° before Easter? °jacket\nWith another for tying his new shoes with old ribbons? And\n2\nthou wilt tutor me from quarrelling?\nBENVOLIO\nAn I were so apt to quarrel as thou art, any man should buy the\nfee-simple° of my life for an hour and a quarter. °ownership\nMERCUTIO\n30 The fee-simple? O, simple!\nEnter TYBALT and his company\nBENVOLIO\nBy my head, here come the Capulets.\nMERCUTIO\nBy my heel, I care not.\nTYBALT\n[To his company] Follow me close, for I will speak to them.\nGentlemen, good den°. A word with one of you. °good afternoon\n1. what to?: Mercutio deliberately misconstrues “to” as “two.”\n2. tutor: scold\nAct 3 | 73 MERCUTIO\n35 Only one word with one of us? Couple it with something. Make it\na word and a blow.\nTYBALT\nYou shall find me apt enough to that sir, if you will give me\noccasion.\nMERCUTIO\nCould you not take some occasion if not given?\nTYBALT\n40 Mercutio, thou consortest with Romeo.\nMERCUTIO\n3\nConsort! What, dost thou make us minstrels? An thou make\nminstrels of us, you will hear nothing but discords°. Here’s my °ugly noise\n4\nfiddlestick°; here’s that shall make you dance—zounds, °sword\n“Consort!”\nBENVOLIO\n5\n45 We talk here in the public haunt of men.\nEither withdraw unto some private place,\n6\nOr reason coldly of your grievances,\nOr else depart. Here all eyes gaze on us.\nMERCUTIO\nMen’s eyes were made to look, and let them gaze.\n50 I will not budge for no man’s pleasure, I.\nEnter ROMEO\n3. minstrels: musicians, thought of as homeless wanderers\n4. zounds: an exclamation or swearword\n5. public haunt: frequent gathering place\n6. coldly: calmly\n74 | Act 3 TYBALT\n7\nWell, peace be with you, sir. Here comes my man.\nMERCUTIO\nBut I’ll be hanged, sir, if he wear your livery°. Marry, go before °servant’s uniforms\ninto the field°, and he may be your follower; Your Worship in °dueling-place\nthat sense may call him “man.”\nTYBALT\n55 Romeo, the love I bear thee can afford\nNo better term than this: thou art a villain.\nROMEO\nTybalt, a reason which I have to love thee\n8\nDoth much excuse the appertaining rage\nTo such a greeting. Villain am I none—\n60 Therefore farewell. I see thou knowest me not.\nTYBALT\nBoy, that shall not excuse the injuries\nThat thou hast done me—therefore, turn and draw.\nROMEO\nI do protest I never injured thee,\nBut love thee better than thou canst devise\n65 Til thou shalt know the reason of my love.\nAnd so, good Capulet—whose name I value\nAs dearly as mine own—be satisfied.\nMERCUTIO\nO, calm, dishonorable, vile submission!\n9\nAlla stoccatta carries it away.\nHe draws.\n10\n70 Tybalt, you Ratcatcher, will you walk?\n7. Here comes my man: the man I want to fight; Mercutio deliberately misconstrues Tybalt’s “my man,” as “my servant.”\n8. appertaining rage: appropriately angry reaction\n9. Alla stoccatta carries it away: the first thrust wins the fight\n10. will you walk?: i.e., will you fight me?\nAct 3 | 75 TYBALT\nWhat wouldst thou have with me?\nMERCUTIO\nGood King of Cats, nothing but one of your nine lives that I\nmean to make bold withal, and, as you shall use me hereafter,\n11\ndry-beat the rest of the eight. Therefore, come, draw your rapier\n75 out of your scabbard, lest mine be about your ears ere you be\naware.\nTYBALT\nI am for you.\nROMEO\nGentle Mercutio, put thy rapier up—\nMERCUTIO\nCome, sir, your passado!\nTYBALT and MERCUTIO fight\nROMEO\n80 Draw, Benvolio! Beat down their weapons!\nGentlemen, for shame! Forbear this outrage.\nTybalt, Mercutio, the Prince expressly hath\nForbid this bandying in Verona streets.\nROMEO steps in between them\nHold, Tybalt! Good Mercutio!\nTYLBALT under ROMEO’s arm stabs MERCUTIO, and leaves with his company\nMERCUTIO\n85 I am hurt.\nA plague o’ both houses! I am sped°. °done for\nIs he gone and hath nothing°? °no wounds\n11. dry-beat: beat with a sword\n76 | Act 3 BENVOLIO\nWhat, art thou hurt?\nMERCUTIO\nAye, aye, a scratch. Marry, ‘tis enough.\n90 Where is my page?—\nGo, villain, fetch a surgeon.\nExit PAGE\nROMEO\nCourage, man; the hurt cannot be much.\nMERCUTIO\nNo—’tis not so deep as a well, nor so wide as a church door, but\n‘tis enough, ‘twill serve. Ask for me tomorrow, and you shall find\n12\n95 me a grave man. I am peppered°, I warrant, for this world. A °done for\nplague o’ both your houses! Zounds, a dog, a rat, a mouse, a cat to\nscratch a man to death! A braggart, a rogue, a villain that fights by\n13\nthe book of arithmetic! Why the devil came you between us? I\nwas hurt under your arm.\nROMEO\n100 I thought all for the best.\nMERCUTIO\nHelp me into some house, Benvolio,\nOr I shall faint. A plague o’ both your houses!\nThey have made worm’s meat of me.\nI have it, and soundly too. Your houses!\nExit MERCUTIO and BENVOLIO\nROMEO\n105 This gentleman, the Prince’s near ally°, °close relative\nMy very friend, hath got this mortal hurt\nIn my behalf. My reputation stained\n12. grave: serious; dead\n13. A dog… by the book of arithmetic: all referring to Tybalt\nAct 3 | 77 With Tybalt’s slander; Tybalt, that an hour\nHath been my cousin! O sweet Juliet,\n110 Thy beauty hath made me effeminate°, °womanish; unmanly\nAnd in my temper softened valor’s steel.\nEnter BENVOLIO\nBENVOLIO\nO Romeo, Romeo! Brave Mercutio is dead!\nThat gallant spirit hath aspired° the clouds, °gone up towards\nWhich too untimely here did scorn the earth.\nROMEO\n14\n115 This day’s black fate on more days doth depend.\nThis but begins the woe others must end.\nEnter TYBALT\nBENVOLIO\nHere comes the furious Tybalt back again.\nROMEO\nAlive in triumph, and Mercutio slain!\nAway to Heaven, respective leniency,\n120 And fire and fury be my conduct now.\nNow, Tybalt, take the “villain” back again\nThat late thou gavest me, for Mercutio’s soul\nIs but a little way above our heads,\nStaying for thine to keep him company.\n125 Either thou or I, or both, must go with him.\nTYBALT\nThou, wretched boy, that didst consort him here\nShalt with him hence.\nROMEO\nThis shall determine that.\nThey fight; TYBALT falls and dies\n14. This day’s black fate on more days doth depend: This day will affect future days\n78 | Act 3 BENVOLIO\nRomeo, away, begone!\n15\n130 The Citizens are up, and Tybalt slain.\nStand not amazed. The Prince will doom thee dead\nIf thou art taken. Hence, begone! Away!\nROMEO\nO, I am fortune’s fool!\nBENVOLIO\nWhy dost thou stay?\nExit ROMEO\nEnter CITIZENS\nCITIZEN\n135 Which way ran he that killed Mercutio?\nTybalt, that murderer, which way ran he?\nBENVOLIO\nThere lies that Tybalt.\nCITIZEN\n[To TYBALT] Up, sir, go with me.\nI charge thee, in the Prince’s name, obey.\nEnter PRINCE ESKALES, MONTAGUE, LADY MONTAGUE, CAPULET, and LADY\nCAPULET\nPRINCE\n140 Where are the vile beginners of this fray?\nBENVOLIO\nO noble Prince, I can reveal all\nThe unlucky manage of this fateful brawl.\nThere lies the man, slain by young Romeo,\n15. The Citizens are up: meaning, up in arms\nAct 3 | 79 That slew thy kinsman, brave Mercutio.\nLADY CAPULET\n145 Tybalt, my cousin! O my brother’s child!\nO Prince! O cousin! Husband! O, the blood is spilled\nOf my dear kinsman! Prince, as thou art true,\nFor blood of ours, shed blood of Montague.\nO cousin, cousin –\nPRINCE\n150 Benvolio, who began this bloody fray?\nBENVOLIO\nTybalt here slain, whom Romeo’s hand did slay.\nRomeo that spoke him fair°, bade him bethink °with civility\nHow nice° the quarrel was, and urged withal °unimportant\nYour high displeasure. All this—uttered\n155 With gentle breath, calm look, knees humbly bowed—\nCould not make truce with the unruly spleen° °bad temper\nOf Tybalt, deaf to peace, who straightway tilts\nWith piercing steel at bold Mercutio’s breast,\nWho, just as hot, turned deadly point to point,\n160 And, with a martial° scorn, with one hand beat °solider-like\nCold death aside, and with the other sends\nIt back to Tybalt, whose dexterity\nRetorts it. Romeo, he cried aloud:\n“Hold friends! Friends, part!” and, swifter than his tongue,\n165 His agile arm beats down their fatal points,\nAnd ‘twixt them rushes; underneath whose arm\nAn envious° thrust from Tybalt hit the life °malicious\nOf stout Mercutio, and then Tybalt fled.\nBut, by and by, came back to Romeo,\n170 Who had but newly entertained revenge,\nAnd to’t they went like lightning, for ere I\nCould draw to part them was stout Tybalt slain.\nAnd, as he fell, did Romeo turn and flee.\nThis is the truth, or let Benvolio die.\nLADY CAPULET\n175 He is a kinsman of the Montagues.\nAffection makes him false; he speaks not true—\nSome twenty of them fought in this black strife,\nAnd all those twenty could but kill one life.\n80 | Act 3 I beg for justice which thou, Prince, must give:\n180 Romeo slew Tybalt; Romeo must not live.\nPRINCE\nRomeo slew him; he slew Mercutio.\n16\nWho now the price of his dear blood doth owe?\nMONTAGUE\nNot Romeo, Prince. He was Mercutio’s friend.\nHis fault concludes that which the law should end:\n185 The life of Tybalt.\nPRINCE\nAnd for that offense\nImmediately we do exile him hence.\nI have an interest in your hearts’ proceeding—-\nMy blood for your rude brawls doth lie a-bleeding.\n190 But I’ll amerce° you with so strong a fine °punish\nThat you shall all repent the loss of mine.\nI will be deaf to pleading and excuses.\nNo tears, no prayers, shall bribe away abuses.\nTherefore use none. Let Romeo hence in haste;\n195 Else, when he is found, that hour is his last.\nBear hence this body and obey our will.\nMercy but murders, pardoning those that kill.\nExit all\n❖❖❖\nACT 3, SCENE 2\nJuliet impatiently waits to be with Romeo again. The Nurse returns and is evasive about what happened\nbefore finally explaining that Romeo killed Tybalt and was subsequently banished. In shock, Juliet defends\nRomeo to the nurse and tries to feel relief that her husband survived rather than the other way around.\nShe despairs at Romeo’s banishment. The Nurse offers to bring Romeo to her for one final night before he\nleaves; Juliet agrees and sends the Nurse with the token of a ring.\nSomewhere within the Capulet estate:\nEnter JULIET alone\n16. dear blood: beloved\nAct 3 | 81 JULIET\nGallop apace, you fiery-footed steeds,\n17\nTowards Phoebus’ lodging. Such a wagoner\n18\nAs Phaeton would whip you to the west\nAnd bring in cloudy night immediately.\n5 Spread thy close° curtain, love-performing night, °concealing\nThat runaway’s eyes may wink°, and Romeo °shut\nLeap to these arms, untalked of and unseen.\nLovers can see to do their amorous rights\nBy their own beauties, or, if love be blind,\n10 It best agrees with night. Come, civil night,\n19\nThou sober-footed matron all in black,\nAnd learn me how to lose a winning match\nPlayed for a pair of stainless maidenhoods°. °virginities\n20\nHood my unmanned blood bating in my cheeks\n15 With thy black mantle°, till strange° love grow bold, °cloak °unfamiliar\n21\nThink true love acted simple modesty—\nCome, night; come, Romeo; come, thou day in night,\nFor thou wilt lie upon the wings of night\nWhiter than new snow upon a raven’s back.\n20 Come, gentle night; come, loving black-browed night,\nGive me my Romeo. And when I shall die,\nTake him and cut him out in little stars,\nAnd he will make the face of heaven so fine\nThat all the world will be in love with night\n25 And pay no worship to the garish sun.\nO, I have bought the mansion of a love\nBut not possessed it; and though I am sold,\nNot yet enjoyed. So tedious is this day,\nAs is the night before some festival\n30 To an impatient child that hath new robes\nAnd may not wear them. O, here comes my Nurse.\nEnter NURSE with cords of rope\nAnd she brings news, and every tongue that speaks\nBut Romeo’s name speaks heavenly eloquence—\nNow, Nurse, what news? What hast thou there,\n35 The cords that Romeo bid thee fetch?\n17. Gallop apace…Towards Phoebus’ loding: Juliet wants night to come; in Classical mythology Phoebus’ horses pulled the\nchariot of the sun across the sky.\n18. Phaeton: Phaeton, the sun god’s son, was allowed to drive the chariot of the sun, but lost control and had to be killed by\nZeus.\n19. sober-footed matron all in black: like a widow dressed in black\n20. Hood (cover with a hood), unmanned (untamed), and bating (fluttering) are all terms used in falconry.\n21. Think true love acted simple modesty: to think of sex (“true love acted”) as modest\n82 | Act 3 NURSE\nAye, aye. The cords.\nThrows down the rope ladder\nJULIET\nAye me, what news?\nWhy dost thou wring thy hands?\nNURSE\nAh, welladay°! He’s dead, he’s dead, he’s dead! °(expression of woe)\n40 We are undone, lady, we are undone.\nAlack° the day—he’s gone, he’s killed, he’s dead. °(expression of grief)\nJULIET\nCan heaven be so envious?\nNURSE\nRomeo can,\nThough heaven cannot. O Romeo, Romeo!\n45 Whoever would have thought it? Romeo!\nJULIET\nWhat devil art thou that dost torment me thus?\nThis torture should be roared° in dismal hell. °used\nHath Romeo slain himself? Say thou but “Aye,”\nAnd that bare vowel “I” shall poison more\n22\n50 than the death-darting eye of cockatrice.\nI am not I, if there be such an “I,”\n23\nOr those eyes shut that makes thee answer “Aye.”\nIf he be slain, say “Aye,” or if not, “No.”\nBrief sounds determine of my weal° and woe. °happiness\nNURSE\n55 I saw the wound; I saw it with mine eyes—\n24\nGod save the mark! —here on his manly breast.\n22. cockatrice: a mythical beast that can kill with a look\n23. Or those eyes: i.e., if those eyes are Romeo’s\n24. God save the mark: i.e., God avert the ill omen\nAct 3 | 83 A piteous corpse, a bloodied piteous corpse,\nPale, pale as ashes, all bedaubed° in blood, °smeared\nAll in gore° blood. I swooned at the sight. °clotted\nJULIET\n60 O, break my heart! Poor bankrupt, break at once!\nTo prison, eyes; ne’er look at liberty.\n25\nVile earth, to earth resign°, end motion here: °return\n26\nAnd thou and Romeo press one heavy bier.\nNURSE\nO Tybalt, Tybalt, the best friend I had!\n65 O courteous Tybalt, honest gentleman,\nThat ever I should live to see thee dead!\nJULIET\nWhat storm is this that blows so contrary?\nIs Romeo slaughtered? And is Tybalt dead?\nMy dearest cousin and my dearer lord?\n27\n70 Then, dreadful trumpet, sound the general doom,\nFor who is living if those two are gone?\nNURSE\nTybalt is gone and Romeo banished.\nRomeo that killed him: he is banished.\nJULIET\nO God, did Romeo’s hand shed Tybalt’s blood?\nNURSE\n75 It did, it did. Alas the day, it did.\nJULIET\nO serpent heart, hid with a flowering face.\nDid ever dragon keep so fair a cave?\n25. Vile earth: here Juliet seems to be referring to her own body\n26. And thou and Romeo press one heavy bier: meaning, my body and Romeo’s will share a coffin\n27. dreadful trumpet, sound the general doom: A biblical reference to the “last trump,” which announces Judgment Day\n84 | Act 3 Beautiful tyrant, fiend angelical!\nRavenous dove-feathered raven,\n80 Wolfish-ravening lamb!\nDespisèd substance of divinest show°! °appearance\nJust opposite to what thou justly seem’st,\nA damned Saint, an honorable villain.\nO Nature! What had’st thou to do in hell\n85 When thou didst bower° the spirit of a fiend °gives sanctuary\nIn mortal paradise of such sweet flesh?\nWas ever book containing such vile matter\nSo fairly bound? O, that deceit should dwell\nIn such a gorgeous palace!\nNURSE\n90 There’s no trust, no faith, no honesty in men.\nAll perjured, all forsworne, all naught°, all dissemblers°. °evil °liars\nAh, where’s my man?—Give me some aqua-vitae°.— °liquor\nThese griefs, these woes, these sorrows make me old.\nShame come to Romeo!\nJULIET\n95 Blistered be thy tongue\nfor such a wish! He was not born to shame.\nUpon his brow shame is ashamed to sit\nFor ‘tis a throne where honor may be crowned\nSole monarch of the universal earth.\n100 O, what a beast was I to chide him!\nNURSE\nWill you speak well of him that killed your cousin?\nJULIET\nShall I speak ill of him that is my husband?\nAh, poor my lord, what tongue shall smooth thy name,\nWhen I, thy three-hours wife, have mangled it?\n105 But wherefore, villain, didst thou kill my cousin?\nThat villain cousin would have killed my husband—\nBack, foolish tears, back to your native spring;\nYour tributary drops belong to woe,\nWhich you, mistaking, offer up to joy—\n110 My husband lives, that Tybalt would have slain,\nAnd Tybalt’s dead, that would have slain my husband.\nAll this comfort, wherefore weep I then?\nAct 3 | 85 Some word there was, worser than Tybalt’s death,\nThat murdered me. I would forget it fain°, °gladly\n115 But, O, it presses to my memory\nLike damned guilty deeds to sinners’ minds:\n“Tybalt is dead and Romeo—banished.”\nThat “banished,” that one word “banished”\nHath slain ten thousand Tybalts. Tybalt’s death\n120 Was woe enough if it had ended there;\nOr, if sour woe delights in fellowship\nAnd needly° will be ranked with other griefs, °necessarily\nWhy followed not when she said, ‘Tybalt’s dead,”\n“Thy father” or “thy mother,” nay, or both\n125 Which modern° lamentation might have moved°. °ordinary °provoked\nBut with a rearward following Tybalt’s death,\n“Romeo is banished.” To speak that word\nIs father, mother, Tybalt, Romeo, Juliet,\nAll slain, all dead. “Romeo is banished.”\n130 There is no end, no limit, measure, bound,\n28\nIn that word’s death. No words can that woe sound.\nWhere is my father and my mother, Nurse?\nNURSE\nWeeping and wailing over Tybalt’s corpse.\nWill you go to them? I will bring you thither.\nJULIET\n135 Wash they his wounds with tears? Mine shall go on\nWhen theirs are dry, for Romeo is banished.\nTake up those cords. Poor ropes, you are beguiled°, °deceived\nBoth you and I, for Romeo is exiled.\nHe made you for a highway to my bed,\n140 But I, a maid, die maiden-widowèd.\nCome, cords; come, Nurse; I’ll to my wedding bed;\nAnd death, not Romeo, take my maidenhead!\nNURSE\nHie to your chamber. I’ll find Romeo\nTo comfort you. I wot° well where he is. °know\n145 Hark° you, your Romeo will be here at night. °listen\nI’ll to him—he is hid at Lawrence’s cell.\nJULIET hands NURSE a ring\n28. No words can that woe sound: no words can express that woe\n86 | Act 3 JULIET\nO, find him! Give this ring to my true knight\nAnd bid him come, to take his last farewell.\nExit all\n❖❖❖\nACT 3, SCENE 3\nFriar Lawrence returns to Romeo, who was hiding in his quarters. He tells Romeo he has been banished.\nRomeo says he’d prefer execution to exile. Lawrence tries to make Romeo understand the Prince’s mercy,\nbut he refuses to be consoled. The Nurse arrives and tells Romeo of Juliet’s grief. In despair, Romeo draws\nhis dagger to kill himself, but the Friar stops him and chastises him for being willing to abandon his wife in\ndeath. He urges Romeo to flee to Mantua until the issue can be settled, and he and Juliet can be reunited.\nThe Nurse leaves to prepare for Romeo’s arrival that evening, leaving Juliet’s ring with him. The Friar warns\nRomeo to leave for Mantua by dawn to escape capture.\nFriar Lawrence’s cell in Verona:\nEnter FRIAR LAWRENCE\nFRIAR LAWRENCE\nRomeo, come forth; come forth, thou fearful man.\nAffliction° is enamored of thy parts°; °disaster °qualities\nAnd thou art wedded to calamity.\nEnter ROMEO\nROMEO\nFather, what news? What is the Prince’s doom?\n5 What sorrow craves acquaintance at my hand\nThat I yet know not?\nFRIAR LAWRENCE\nToo familiar\nIs my dear son with such sorry company.\nI bring thee tidings of the Prince’s doom.\nROMEO\n10 What less than Doomsday is the Prince’s doom?\nAct 3 | 87 FRIAR LAWRENCE\nA gentler judgment vanished from his lips.\nNot body’s death, but body’s banishment.\nROMEO\nHa! Banishment? Be merciful, say “death,”\nFor exile hath more terror in his look,\n15 Much more than death. Do not say “banishment.”\nFRIAR LAWRENCE\nHere from Verona are thou banished;\nBe patient, for the world is broad and wide.\nROMEO\nThere is no world without Verona walls,\nBut purgatory, torture, hell itself.\n20 Hence banishèd, is banished from the world.\nAnd world’s exile is death. Then banishèd,\nIs death, mistermed. Calling death “banished,”\nThou cut’st my head off with a golden axe,\nAnd smiles upon the stroke that murders me.\nFRIAR LAWRENCE\n25 O deadly sin! O rude unthankfulness!\n29\nThy fault our law calls death, but the kind Prince,\nTaking thy part, hath rushed aside the law,\nAnd turned that black word “death” to “banishment.”\nThis is dear mercy, and thou seeth it not.\nROMEO\n30 Tis torture and not mercy. Heaven is here\nWhere Juliet lives, and every cat and dog,\nAnd little mouse, every unworthy thing,\nLive here in heaven and may look on her.\nBut Romeo may not. More validity°, °value\n35 More honorable state, more courtship lives\nIn carrion° flies than Romeo. They may seize °rotting meat\nOn the white wonder of dear Juliet’s hand,\nAnd steal immortal blessing from her lips,\n29. Thy fault our law calls death: i.e., your crime is punishable by death\n88 | Act 3 Who even in pure and vestal° modesty °virginal\n40 Still blush, as thinking their own kisses sin.\nThis may flies do, when I from this must fly,\nAnd says thou yet, that exile is not death?\nBut Romeo may not, he is banished.\nFlies may do this, but I from this must fly;\n45 They are free men, but I am banished.\nHadst thou no poison mixed, no sharp-ground knife,\nNo sudden means of death—though ne’er so mean—\nBut “banishèd,” to kill me? “Banishèd?”\nO Friar, the damned use that word in hell:\n50 Howling attends it. How hast thou the heart,\nBeing a divine, a ghostly confessor,\nA sin absolver, and my friend professed,\nTo mangle me with that word “banishèd?”\nFRIAR LAWRENCE\nThen, fond° mad man, hear me a little speak— °foolish\nROMEO\n55 O, thou wilt speak again of banishment!\nFRIAR LAWRENCE\nI’ll give thee armor to keep off that word.\nAdversity’s sweet milk, philosophy,\nTo comfort thee though thou art banishèd.\nROMEO\nStill “banishèd?” Hang up philosophy,\n60 Unless philosophy can make a Juliet,\nDisplant° a town, reverse a Prince’s doom, °displace\n30\nIt helps not, it prevails not. Talk no more.\nFRIAR LAWRENCE\nO, then I see that mad men have no ears.\nROMEO\nHow should they, when that wise men have no eyes?\n30. prevails not: has no effect\nAct 3 | 89 FRIAR LAWRENCE\n31\n65 Let me dispute with thee of thy estate.\nROMEO\nThou canst not speak of that thou dost not feel.\nWere thou as young as I, Juliet they love,\nAn hour but married, Tybalt murderèd,\nDoting° like me, and like me banishèd, °lovesick\n70 Then mightest thou speak,\nThen mightest thou tear thy hair\nAnd fall upon the ground, as I do now,\n32\nTaking the measure of an unmade grave.\nThere is a knock from within\nFRIAR LAWRENCE\nArise; one knocks. Good Romeo, hide thyself.\nROMEO\n75 Not I, unless the breath of heartsick groans,\nMist-like, conceal me from the search of eyes.\nContinuous knocking\nFRIAR LAWRENCE\nHark! How they knock.—Who’s there?—Romeo, arise!\nThou wilt be taken.—Stay awhile!—Stand up.\nKnock\n33\nRun to my study.—By and by! —God’s will,\n80 What simpleness° is this?—I come, I come. °nonsense\nKnock\nWho knocks so hard? Whence come you? What’s your will?\nNURSE\n[From within] Let me come in, and you shall know my errand: I come from Lady Juliet.\n31. dispute with thee of they estate: i.e., discuss your state of affairs\n32. Taking the measure of an unmade grave: taking the measurements of a grave not yet dug\n33. By and by: just a moment\n90 | Act 3 Enter NURSE\nFRIAR LAWRENCE\nWelcome then.\nNURSE\n85 O holy Friar! O tell me, holy Friar, where’s my lady’s lord?\nWhere’s Romeo?\nFRIAR LAWRENCE\nThere on the ground,\nWith his own tears made drunk.\nNURSE\n34\nO, he is even in my mistress’ case,\n90 Just in her case. O woeful sympathy!\nPiteous predicament! Even so lies she,\nBlubbering and weeping, weeping and blubbering.—\nStand up, stand up. Stand and you be a man!\nFor Juliet’s sake, for her sake, rise and stand.\n35\n95 Why should you fall into so deep an O?\nROMEO\nNurse.\nNURSE\nAh sir, ah sir, death’s the end of all.\nROMEO\nSpaketh thou of Juliet? How is it with her?\nDoth not she think of me an old murderer,\n100 Now I have stained the childhood of our joy\nWith blood removed but little from her own?\nWhere is she? and how doth she? and what says\nMy concealed Lady to our canceled love?\n34. he is even in my mistress case: i.e., he is just like my mistress\n35. so deep an O: moaning fit\nAct 3 | 91 NURSE\nOh she says nothing, sir, but weeps and weeps,\n105 And now falls on her bed, and then starts up,\nAnd “Tybalt” calls, and then on “Romeo” cries,\nAnd then down falls again.\nROMEO\nAs if that name, shot from the deadly level of a gun,\nDid murder her; as that name’s cursed hand\n110 Murdered her kinsman.—O, tell me Friar, tell me,\nIn what vile part of this anatomy\nDoth my name lodge? Tell me that I may sack° °destroy\nThe hateful mansion.\nHe offers to stab himself, and the Nurse snatches the dagger away\nFRIAR\nHold thy desperate hand!\n115 Art though a man? Thy form cries out thou art.\nThy tears are womanly, thy wild acts denote\nThe unreasonable fury of a beast.\nUnseemly woman in a seeming man,\nAnd ill-beseeming° beast in seeming both! °unnatural\n120 Thou hast amazed me. By my holy order,\nI thought thy disposition better tempered.\nHast thou slain Tybalt? Wilt thou slay thy self?\nAnd slay thy Lady, that in thy life lives,\nBy doing damned hate upon thyself?\n125 Why rails° thou on thy birth, the heaven, and earth? °complains\nSince birth and heaven and earth, all three do meet\nIn thee at once, which thou at once wouldst lose?\nFie, fie°, thou shames thy shape, thy love, thy wit, °(expression of disgust)\n36\nWhich, like a usurer abound’st in all\n130 And uses none in that true use indeed\nWhich should bedeck° thy shape, thy love, thy wit. °decorate\nThy noble shape is but a form of wax\n37\nDigressing from the valor of a man.\nThy dear love sworn but hollow perjury,\n135 Killing that love which thou hast vowed to cherish.\nThy wit, that ornament to shape° and love, °body\n36. usurer: someone who makes a profit by lending money and being repaid with interest. This was considered greedy,\nimmoral, and a misuse of wealth.\n37. Digressing from: lacking of\n92 | Act 3 Misshapen in the conduct of them both,\nLike powder in a skill-less soldier’s flask,\nIs set afire by thine own ignorance,\n38\n140 And thou dismembered with thine own defense.\nWhat, rouse thee, man! Thy Juliet is alive,\nFor whose dear sake thou was but lately dead.\nThere art thou happy°. Tybalt would kill thee, °fortunate\nBut thou slewest Tybalt; there art thou happy.\n145 The law that threatened death becomes thy friend\nAnd turns it to exile; there art thou happy.\nA pack of blessings lights upon thy back;\nHappiness courts thee in her best array;\nBut like a missbehaved and sullen wench,\n150 Thou pouts upon thy fortune and thy love.\nTake heed, take heed; such men die miserable.\nGo, get thee to thy love as was decreed,\nAscend her chamber, hence, and comfort her.\n39\nBut look° thou stay not till the watch be set, °be careful\n155 For then thou canst not pass to Mantua,\nWhere thou shalt live till we can find a time\nTo blaze° your marriage, reconcile your friends, °publicize\nBeg pardon of the Prince, and call thee back\nWith twenty hundred thousand times more joy\n160 Then when thou went forth in lamentation.—\nGo before, Nurse; commend me to thy Lady,\nAnd bid her hasten all the house to bed,\nWhich heavy sorry makes them apt to do.\nRomeo is coming.\nNURSE\n165 O Lord, I could have stayed here all the night,\nTo hear such good council. O, what learning is!—\nMy lord, I’ll tell my lady you will come.\nROMEO\nDo so, and bid my sweet prepare to chide°. °scold\nNURSE\nHere, sir, a ring she bid me give you, sir.\nShe hands ROMEO a ring\n38. thou dismembered by thine own defense: i.e., harmed by what was intended to defend\n39. the watch be set: when the night watchmen take their positions, usually at dusk\nAct 3 | 93 170 Hie you! Make haste, for it grows very late.\nExit NURSE\nROMEO\nHow well my comfort is revived by this.\nFRIAR LAWRENCE\n40\nGo hence, goodnight; and here stands all your state:\nEither be gone before the watch be set,\nOr at the break of day, disguised, go hence.\n175 Sojourn° in Mantua. I’ll seek out your man, °stay awhile\nAnd he shall let you know from time to time\nEvery good hap° to you that happens here. °happening\nGive me thy hand. ‘Tis late; farewell, goodnight.\nROMEO\nBut that a joy past joy calls out to me,\n180 It were a grief so brief to part with thee.\nFarewell.\nExit all\n❖❖❖\nACT 3, SCENE 4\nLord and Lady Capulet explain to Paris that Juliet will not see him tonight due to her grieving for Tybalt.\nThey agree to marry Juliet to Paris in a respectfully humble ceremony on Thursday. Lord Capulet\ncommands Lady Capulet to break the news to their daughter.\nSomewhere within the Capulet estate:\nEnter CAPULET, LADY CAPULET and PARIS\nCAPULET\nThings have fallen out, sir, so unluckily,\n41\nThat we have had no time to move our daughter.\nLook you, she loved her kinsman Tybalt dearly,\n40. here stands all your state: i.e., everything depends on this\n41. we have had no time to move our daughter: i.e., we haven’t had time to convince Juliet\n94 | Act 3 And so did I. Well, we were born to die.\n5 Tis very late. She’ll not come down tonight.\nI promise you, but for your company,\nI would have been a-bed an hour ago,\nPARIS\nThese times of woe afford no times to woo.\nMadam, goodnight. Commend me to your daughter.\nLADY CAPULET\n10 I will, and know° her mind early tomorrow, °(will know)\n42\nTonight she’s mewed up to her heaviness.\nCAPULET\nSir Paris, I will make a desperate tender° °risky offer\nOf my child’s love. I think she will be ruled,\nIn all respects, by me. Surely; I doubt it not.—\n15 Wife, go you to her ere you go to bed.\nAcquaint her here of my son Paris’s love,\nAnd bid her—Mark you me?—on Wednesday next—\nBut soft°! What day is this? °wait\nPARIS\nMonday, my lord.\nCAPULET\n20 Monday, ha ha! Well, Wednesday is too soon.\nA Thursday let it be. A Thursday, tell her\nShe shall be married to this noble Earl.—\nWill you be ready? Do you like this haste?\nWe’ll keep no great ado, a friend or two.\n25 For hark you, Tybalt being slain so late,\nIt may be thought we held him carelessly° °without care\nBeing our kinsman, if we revel much.\nTherefore we’ll have some half a dozen friends,\n43\nAnd there an end. But what say you to Thursday?\n42. mewed up to: shut up with\n43. there an end: that’s it\nAct 3 | 95 PARIS\n30 My Lord, I would that Thursday were tomorrow.\nCAPULET\nWell, get you gone. A Thursday be it then!—\nGo you to Juliet ere you go to bed.\nPrepare her, wife, against this wedding day.—\nFarewell, my lord.—Light to my chamber, ho!—\n44\n35 Afore me, it is so very late that we may call it early by and by.—\nGoodnight.\nExit all\n❖❖❖\nACT 3, SCENE 5\nIn her chambers, Juliet and Romeo go back and forth on whether Romeo needs to leave yet or whether\nhe can stay longer. The Nurse enters to warn them that Lady Capulet is approaching. Romeo departs in\nsecret. Lady Capulet enters to talk to Juliet. Juliet pretends to hate Romeo while telling the audience that\nshe forgives him completely. Lady Capulet tells Juliet that she is set to be married to Paris next Thursday.\nJuliet protests that it is far too soon. Her father enters, just as surprised as his wife that Juliet is still grieving.\nHe expects Juliet to be pleased at the news of the marriage; when she begs him to change their plans,\nhe flies into a rage, silencing the Nurse who jumps to Juliet’s defense. He threatens to disown Juliet if she\nrefuses to marry and then leaves. Juliet asks her mother for help; she refuses and also exits. Juliet then goes\nto the Nurse for comfort, who tells her that she should marry Paris and be happy since Romeo is as good\nas dead in exile. Juliet decides to find Friar Lawrence for help, resolving to kill herself if he will not help her.\nJuliet’s chambers within the Capulet estate, near a window overlooking the orchard:\nEnter ROMEO and JULIET aloft\nJULIET\nWilt thou be gone? It is not yet near day.\n45\nIt was the nightingale, and not the lark,\nThat pierced the fearful° hollow of thine ear. °anxious\nNightly she sings on yond pomegranate tree.\n5 Believe me, love, it was the nightingale.\n44. Afore me: a mild swear\n45. It was the nightingale, and not the lark: The nightingale sings at night; the lark sings in the morning\n96 | Act 3 ROMEO\nIt was the lark, the herald of the morn,\nNo nightingale. Look, love: what envious streaks\nDo lace the severing° clouds in yonder east; °parting\nNight’s candles are burnt out, and jocund° day °cheerful\n10 Stands tiptoe on the misty mountain tops.\nI must be gone and live, or stay and die.\nJULIET\nYond light is not daylight—I know it. Aye:\nIt is some meteor that the sun exhales,\nTo be to thee this night a torch-bearer\n15 And light thee on thy way to Mantua.\nTherefore stay yet; thou needst not to be gone.\nROMEO\nLet me be ta’en°. Let me be put to death. °taken\nI am content, if thou wilt have it so.\nI’ll say yon gray is not the morning’s eye.\n46\n20 ‘Tis but the pale reflect of Cynthia’s brow.\nNor that is not the lark whose notes do beat\nThe vaulty heaven so high above our heads.\nI have more care to stay than will to go:\nCome, death, and welcome. Juliet wills it so—\n25 How is my soul? Let’s talk; ’tis not yet day.\nJULIET\nIt is, it is! Begone fly hence away!\nIt is the lark that sings so out of tune,\nStraining harsh discords and unpleasing sharps.\nSome say the lark makes sweet division°: °melody\n30 This is not so, for she divideth us.\n47\nSome say the lark and loathèd toad change eyes.\nO, now I would they had changed voices too,\nSince arm from arm that voice doth us affray°, °tear apart\n48\nHunting thee hence with hunt’s-up to the day.\n35 O, now begone! More light and light it grows.\n46. Cynthia: another name for the goddess of the moon.\n47. the lark and loathèd toad change eyes: Juliet is referring to the tale that the lark traded its pretty eyes for the toad’s ugly\nones\n48. hunts-up: a song to wake huntsmen\nAct 3 | 97 ROMEO\nMore light and light, more dark and dark our woes.\nEnter NURSE\nNURSE\nMadam.\nJULIET\nNurse?\nNURSE\nYour Lady Mother is coming to your chamber.\n40 The day is broke. Be wary, look about.\nExit NURSE\nJULIET\nThen, window, let day in, and let life out.\nROMEO\nFarewell, farewell! One kiss and I’ll descend.\nThey kiss, and ROMEO begins to climb down\nJULIET\nArt thou gone so, my love, my lord, my husband, my friend?\nI must hear from thee every day in the hour,\n45 For in a minute there are many days.\nO, by this count I shall be much in years,\nEre I again behold my Romeo.\nROMEO\nFarewell!\nI will omit no opportunity\n50 That may convey my greetings, love, to thee.\nJULIET\nO, thinkst thou we shall ever meet again?\n98 | Act 3 ROMEO\nI doubt it not, and all these woes shall serve\nFor sweet discourses in our times to come.\nJULIET\n49\nO God! I have an ill-divining soul.\n55 Methinks I see thee, now thou art so low,\nAs one dead in the bottom of a tomb.\nEither my eyesight fails, or thou lookest pale.\nROMEO\nAnd trust me, love, in my eye so do you.\n50\nDry sorrow drinks our blood. Adieu, adieu!\nExit ROMEO\nJULIET\n51\n60 O Fortune, Fortune, all men call thee fickle.\nIf thou art fickle, what doest thou with him\nThat is renowned for faith°? Be fickle, Fortune, °faithfulness; steadiness\nFor then I hope thou wilt not keep him long,\nBut send him back.\nLADY CAPULET\n65 [From within] Ho, daughter. Are you up?\nJULIET\nWho is’t that calls? It is my lady mother.\nIs she not down° so late or up so early? °in bed\nWhat unaccustomed cause procures° her hither? °sends\nEnter LADY CAPULET\nLADY CAPULET\nWhy, how now, Juliet?\n49. ill-divining soul: i.e., a bad feeling\n50. Dry sorrow drinks our blood: It was thought that sorrow dried up the blood, drop by drop\n51. Fortune: Fortuna, the goddess of chance, was thought to control peoples’ fates, but did so in a very fickle and unpredictable\nmanner\nAct 3 | 99 JULIET\n70 Madam, I am not well.\nLADY CAPULET\nEvermore weeping for your cousin’s death?\nWhat, wilt thou wash him from his grave with tears?\nAnd if thou could’st, thou could’st not make him live.\nTherefore, be done. Some grief shows much of love,\n75 But much of grief shows some want of wit.\nJULIET\nYet let me weep for such a feeling° loss. °devastating\nLADY CAPULET\nSo shall you feel the loss, but not the friend\nWhich you weep for.\nJULIET\nFeeling so the loss,\n80 I cannot choose but ever weep the friend.\nLADY CAPULET\nWell, girl, thou weep’st not so much for his death,\nAs that the villain lives which slaughtered him.\nJULIET\nWhat villain, madam?\nLADY CAPULET\nThat same villain: Romeo.\nJULIET\n85 [Hushed] Villain and he be many miles asunder°. °apart\n[To LADY CAPULET] God pardon him. I do, with all my heart\nAnd yet, no man like he doth grieve my heart.\n100 | Act 3 LADY CAPULET\nThat is because the traitor lives.\nJULIET\nAye, madam, from the reach of these, my hands\n90 Would none but I might ‘venge my cousin’s death.\nLADY CAPULET\nWe will have vengeance for it, fear thou not.\nThen weep no more. I’ll send to one in Mantua,\nWhere that same banished runaway doth live,\nShall give him such an unaccustomed drink\n95 That he shall soon keep Tybalt company.\nAnd then I hope thou wilt be satisfied.\nJULIET\nIndeed, I never shall be satisfied\nWith Romeo, ‘til I behold him. Dead\nIs my poor heart so for a kinsman vexed°. °distressed; frustrated\n100 Madam, if you could find out but a man\nTo bear a poison, I would temper° it; °mix, or dilute\nThat Romeo should, upon receipt thereof,\nSoon sleep in quiet. O, how my heart abhors° °hates\nTo hear him named, and cannot come to him\n105 To wreak the love I bore my cousin\nUpon the body that hath slaughtered him.\nLADY CAPULET\nFind thou the means, and I’ll find such a man.\nBut now, I’ll tell thee joyful tidings, girl.\nJULIET\nAnd joy comes well in such a needy time.\n110 What are they, beseech° your ladyship? °beg\nLADY CAPULET\nWell, well, thou hast a careful father, child,\nOne who, to put thee from thy heaviness°, °sadness\nHath sorted out a sudden day of joy\nThat thou expects not, nor I looked not for.\nAct 3 | 101 JULIET\n115 Madam, in happy time, what day is that?\nLADY CAPULET\nMarry, my child, early next Thursday morn.\nThe gallant, young, and noble gentleman,\nThe County Paris at Saint Peter’s Church\nShall happily make thee there a joyful bride!\nJULIET\n120 Now, by Saint Peter’s Church, and Peter too,\nHe shall not make me there a joyful bride!\nI wonder at this haste, that I must wed\nEre he, that should be husband, comes to woo.\nI pray you, tell my lord and father, madam,\n125 I will not marry yet, and when I do I swear\nIt shall be Romeo, whom you know I hate,\nRather than Paris. These are news, indeed!\nLADY CAPULET\nHere comes your father. Tell him so yourself,\nAnd see how he will take it at your hands.\nEnter CAPULET and NURSE\nCAPULET\n130 When the sun sets, the earth doth drizzle dew,\nBut for the sunset° of my brother’s son °death\nIt rains downright. How now? A conduit°, girl? What, still in tears? °fountain\nEvermore showring in one little body?\nThou counterfeit’st a bark°, a sea, a wind. °sailboat\n135 For still thy eyes, which I may call the sea,\nDo ebb and flow with tears. The bark thy body is,\nSailing in this salt flood. The winds thy sighs,\nWho, raging with thy tears and they with them,\n52\nWithout a sudden calm, will overset\n140 Thy tempest-tossed body.—How now, wife?\nHave you delivered to her our decree?\n52. without a sudden calm: i.e., unless you calm down\n102 | Act 3 LADY CAPULET\n53\nAye, sir, but she will none. She gives you thanks.\nI would the fool were married to her grave!\nCAPULET\n54\nSoft, take me with you, take me with you, wife.\n145 How will she none? Doth she not give us thanks?\nIs she not proud? Doth she not count her blessed,\nUnworthy as she is, that we have wrought\nSo worthy a gentleman to be her bridegroom?\nJULIET\nNot proud you have, but thankful that you have!\n150 Proud can I never be of what I hate,\n55\nBut thankful even for hate that is meant love.\nCAPULET\nHow, now? How, now? Chopped logic. What is this?\nProud, and I thank you, and I thank you not?\n56\nAnd yet not proud? Mistress minion you,\n155 Thank me no thankings, nor proud me no prouds,\nBut fettle° your fine joints ‘gainst Thursday next, °prepare\nTo go with Paris to Saint Peter’s Church,\n57\nOr I will drag thee on a hurdle thither.\n58\nOut, you green-sickness carrion°! Out, you baggage°! °rotting meat °useless woman\n160 You tallow° face! °pale\nLADY CAPULET\nFie, fie! What, are you mad?\nJULIET kneels\nJULIET\nGood father, I beseech you on my knees.\nHear me with patience, but to speak a word.\n53. She gives you thanks: i.e., she says no thanks\n54. take me with you: catch me up\n55. that is meant love: that is meant with love\n56. Mistress minion: spoiled brat\n57. hurdle: used to drag criminals to their executions\n58. green-sickness: anemia, associated with the paleness of young virgins\nAct 3 | 103 CAPULET\nHang thee, young baggage, disobedient wretch.\n165 I tell thee what: get thee to church on Thursday,\nOr never after look me in the face.\nSpeak not, reply not, do not answer me.\n59\nMy fingers itch! Wife, we scarce thought us blessed\nThat God had lent us but this only child;\n170 But now I see this one is one too much,\nAnd that we have a curse in having her.\nOut on her, hilding°! °worthless person\nNURSE\nGod in heaven, bless her!\nYou are to blame, my lord, to rate her so.\nCAPULET\n175 And why, my Lady Wisdom? Hold your tongue,\nGood Prudence. Smatter with your gossips, go.\nNURSE\nI speak no treason.\nCAPULET\nO, God ‘I’ good e’en.\nNURSE\nMay not one speak?\nCAPULET\n180 Peace, you mumbling fool.\nUtter your gravity° o’er a gossip’s drink, °“serious” things\nFor here we need it not.\nLADY CAPULET\nYou are too hot!\n59. My fingers itch: i.e., his fingers itch to hit someone\n104 | Act 3 CAPULET\n60\nGod’s bread, it makes me mad!\n185 Day, night, hour, tide, time, work, play,\nAlone, in company: still my goal hath been\nTo have her matched! And having now provided\nA gentleman of noble parentage,\nOf fair demesnes°, youthful, and nobly-allied, °lands owned\n190 Stuffed, as they say, with honorable parts,\nProportioned as one’s thought would wish a man—\nAnd then to have a wretchèd puling° fool, °whimpering\nA whining mammet°, to her fortune’s tender °doll\nAnswer, “I’ll not wed, I cannot love;\n195 I am too young, I pray you, pardon me.”\nBut if you will not wed, I’ll pardon you!\nGraze where you will; you shall not house with me.\nLook to’t, think on’t; I do not often jest.\nThursday is near. Lay hand on heart, advise.\n200 If you be mine, I’ll give you to my friend.\nIf you be not? Hang, drown, starve, beg, die in the streets,\nFor by my soul, I’ll ne’er acknowledge thee,\nNor what is mine shall never do thee good.\nTrust to’t; bethink° you. I’ll not be forsworn°. °think hard °go back on my word\nExit CAPULET\nJULIET\n205 Is there no pity sitting in the clouds\nThat sees into the bottom of my grief?—\nO, sweet, my mother, cast me not away!\nDelay this marriage for a month, a week,\nOr if you do not, make the bridal bed\n210 In that dim monument where Tybalt lies!\nLADY CAPULET\nTalk not to me, for I’ll not speak a word.\nDo as thou wilt, for I have done with thee.\nExit LADY CAPULET\nJULIET rises\n60. God’s bread: a strong swear\nAct 3 | 105 JULIET\nO God, O Nurse, how shall this be prevented?\nMy husband is on earth, my faith in heaven.\n215 How shall that faith return again to earth,\nUnless that husband send it me from heaven\nBy leaving earth? Comfort me, counsel me!\nAlack, alack, that heaven should practice stratagems° °play tricks\nUpon so soft a subject as myself.\n220 What sayst thou? Hast thou not a word of joy?\nSome comfort, Nurse.\nNURSE\n61\nFaith, here it is: Romeo is banished, and all the world to nothing\nThat he dares ne’er come back to challenge° you. °claim\nOr, if he do, it needs must be by stealth.\n225 Then since the case so stands as now it doth,\nI think it best you married with the county.\nO, he’s a lovely gentleman:\nRomeo is but a dish cloth in respect of him. An eagle, madam,\nHath not so green, so quick, so fair an eye\n230 As Paris hath. Beshrew my very heart,\nI think you are happy in this second match,\nFor it excels your first. Or if it did not,\nYour first is dead, or ‘twere as good he were,\nNot living here, and you no use of him.\nJULIET\n235 Speakst thou from thy heart?\nNURSE\nAnd from my soul too; else beshrew them both.\nJULIET\nAmen.\nNURSE\nWhat?\n61. all the world to nothing: I’d bet anything\n106 | Act 3 JULIET\nWell, thou hast comforted me marvelous much.\n240 Go in, and tell my lady I am gone,\nHaving displeased my father, to Lawrence’s cell,\nTo make confession, and to be absolved.\nNURSE\nMarry, I will; and this is wisely done.\nExit NURSE\nJULIET\nAncient damnation! O, most wicked fiend!\n245 Is it more sin to wish me thus forsworn,\nOr to dispraise my lord with that same tongue\nWhich she hath praised him with above compare\nSo many thousand times? Go, counselor.\n62\nThou and my bosom henceforth shall be twain.\n250 I’ll to the friar to know his remedy.\nIf all else fail, myself have power to die.\nExit JULIET\n62. my bosom: in this context, “bosom” means trust.\nAct 3 | 107 Act 4\nACT 4, SCENE 1\nParis meets with Friar Lawrence, informing him that the wedding will be held on Thursday in a supposed\nattempt to soothe Juliet’s grief over murdered Tybalt. Juliet arrives for confession, and Paris attempts to\npressure her into confessing her love for him. After Paris leaves, Juliet tells the Friar she is resolved to kill\nherself if he can offer no solution out of the impending marriage. The Friar offers her a plan: agree to the\nmarriage, but drink a poison the night before that will make her appear dead while in reality leaving her\nasleep. The Friar will then send word to Romeo, who will return and rescue Juliet once she awakes in the\nfamily tomb. Juliet accepts.\nFriar Lawrence’s cell in Verona:\nEnter Friar Lawrence and County Paris\nFRIAR LAWRENCE\nOn Thursday, sir? The time is very soon.\nPARIS\nMy father Capulet will have it so,\nAnd I am nothing slow to stall his haste.\nFRIAR LAWRENCE\nYou say you do not know the Lady’s mind?\n5 Uneven is the course. I like it not.\nPARIS\nImmoderately she weeps for Tybalt’s death,\nAnd therefore have I little talk of love,\n1\nFor Venus smiles not in a house of tears.\nNow, sir, her father counts it dangerous\n10 That she doth give her sorrow so much sway;\n2\nAnd in his wisdom hastes our marriage\nTo stop the inundation° of her tears, °overflowing abundance\nWhich, too much minded by herself alone,\n1. Venus: a mythical goddess often representing love\n2. Hastes our marriage: To move quickly with the wedding\n108 | Act 4 3\nMay be put from her by society.\n15 Now you do know the reason of this haste.\nFRIAR LAWRENCE\n4\n[To himself] I would I knew not why it should be slowed.\n[To PARIS] Look, sir, here comes the lady towards my cell.\nEnter Juliet\nPARIS\nHappily met, my lady and my wife.\nJULIET\nThat may be, sir, when I may be a wife.\nPARIS\n20 That “may be” must be, love, on Thursday next.\nJULIET\nWhat must be shall be.\nFRIAR LAWRENCE\nThat’s a certain text°. °truth\nPARIS\n5\nCome you to make confession to this father?\nJULIET\nTo answer that, I would confess to you.\n3. May be put from her by society: Paris is saying that with company, she might cry less\n4. I would I knew not what it should be slowed: Friar Lawrence wants to be heard by the audience, not Paris, and is saying that\nhe wishes he didn't know what was to come.\n5. Come you to make confession to this father?: Paris is asking Juliet if she has come to confess to the Friar. Confession is a\ncommon practice in the Catholic religion.\nAct 4 | 109 PARIS\n25 Do not deny to him that you love me.\nJULIET\n6\nI will confess to you that I love him.\nPARIS\nSo will ye – I am sure that you love me.\nJULIET\nIf I do so, it will be of more worth\nBeing spoke behind your back than to your face.\nPARIS\n30 Poor soul, thy face is much abused with tears.\nJULIET\nThe tears have got small° victory by that, °not much\n7\nFor it was bad enough before their spite.\nPARIS\nThou wrong’st it more than tears, with that report.\nJULIET\nThat is no slander, sir, when it’s a truth,\n35 And what I said, I said it to my face.\nPARIS\nThy face is mine, and thou hast slandered it.\n6. I will confess to you that I love him: Juliet is using tricky and playful language to confuse Paris and keep him under the\nimpression that she does love him. In fact, she is actually saying that she will confess that she loves Romeo.\n7. For it was bad enough before their spite: Her face was abused and dirty enough before the tears. She is trying to get Paris to\nleave her alone.\n110 | Act 4 JULIET\nIt may be so, for it is not mine own. —\nAre you at leisure, Holy Father, now,\nOr shall I come to you at evening Mass?\nFRIAR LAWRENCE\n40 My leisure serves me, somber daughter, now.\nMy lord, we must ask for this time alone.\nPARIS\nGod shield I should disturb devotion!\nJuliet, on Thursday early will I rouse you.\nTill then, adieu, and keep this holy kiss.\nHe kisses her\nExit Paris\nJULIET\n45 O, shut the door! And when thou hast done so,\nCome weep with me – past hope, past care, past help.\nFRIAR LAWRENCE\nO Juliet, I already know thy grief;\nIt strains me past the compass of my wits.\nI hear thou must – and nothing may postpone it –\n50 On Thursday next be married to the County.\nJULIET\nTell me not, Friar, that thou hearest of this,\nUnless thou tell me how I may prevent it:\nIf in thy wisdom thou canst give no help,\nDo thou but call my resolution wise,\n55 And with this knife I’ll help it presently.\nGod joined my heart and Romeo’s, thou our hands.\nAnd ere this hand – by thee to Romeo sealed –\n8\nShall be the label to another deed,\nOr my true heart with treacherous revolt\n60 Turn to another, this shall slay them both.\n8. Shall be the label to another deed: That Juliet should be married to both Romeo and Paris.\nAct 4 | 111 Therefore out of thy long-experienced time,\nGive me some present counsel, or, behold,\n‘Twixt my extremes and me this bloody knife\nShall play the umpire, arbitrating that,\n9\n65 Which the commission of thy years and art\nCould not to this issue true honor bring.\nBe not so long to speak; I long to die\nIf what thou speak’st speak not of remedy.\nFRIAR LAWRENCE\nHold, daughter! I do spy a kind of hope\n70 Which craves as desperate an execution\n10\nAs that is desperate which we would prevent.\nIf rather than to marry County Paris\nThou hast the strength or will to slay thyself,\nThen it is likely thou wilt undertake\n75 A thing like death to chide away this shame,\nThat copes with Death himself to ‘scape from it;\nAnd, if thou darest, I’ll give thee remedy.\nJULIET\nO bid me leap – rather than marry Paris –\nFrom off the battlements of any tower,\n80 Or walk in thievish ways, or bid me lurk\nWhere serpents are; chain me with roaring bears\n11\nOr hide me nightly in a charnel house,\nO’ercovered quite° with dead men’s rattling bones, °entirely\n12\nWith reeky shanks and yellow chapless skulls;\n85 Or bid me go into a new-made grave\nAnd hide me with a dead man in his tomb;\nThings that, to hear them told, have made me tremble,\nAnd I will do it without fear or doubt\nTo keep myself a faithful unstained wife\n90 To my dear lord, my dearest Romeo.\nFRIAR LAWRENCE\nHold then: go home, be merry, give consent\nTo marry Paris. Wednesday is tomorrow.\n9. the commission of thy years and art: the authority of your age and skills\n10. Which craves as...which we would prevent: the friar is saying that his plan is as difficult as their current situation, but that it\ncould work.\n11. charnel house: structure that stores burial remains\n12. reeky shanks and yellow chapless skulls: smelly bones and jawless skulls\n112 | Act 4 Let not thy nurse lie with thee in thy chamber.\nAnd when thou art alone, take thou this vial,\n95 And this distilling liquor drink thou off,\nWhen presently through all thy veins shall run\nA cold and drowsy humor; for no pulse\nShall keep his native rhythm but surcease°. °cease\nNo warmth, no breath shall testify thou livest;\n100 The roses in thy lips and cheeks shall fade\nTo many ashes. Thy eyes’ windows fall\nLike Death when he shuts up the day of life;\nEach part, deprived of supple government\nShall, stiff and stark and cold, appear like death,\n105 And in this borrowed likeness of shrunk death\nThou shalt continue two and forty hours\nAnd then awake, as from a pleasant sleep.\nNow when the bridegroom in the morning comes\nTo rouse thee from thy bed, there art thou dead;\n13\n110 Then, as the manner of our country is,\nIn thy best robes uncovered on the bier° °coffin\nBe borne to burial in thy kindred’s grave;\nThou shall be borne to that same ancient vault\nWhere all the kindred of the Capulets lie.\n115 In the meantime, by then thou shalt awake,\nShall Romeo by my letters know our plan,\nAnd hither shall he come, and he and I\nWill watch thy waking, and that very night\nShall Romeo bear thee hence to Mantua.\n120 And this shall free thee from this present shame,\nIf no inconstant toy nor womanish fear\nAbate° thy valor in the acting it. °lessen\nJULIET\nGive me, give me! O, tell not me of fear!\nHe gives her the vial\nFRIAR LAWRENCE\nHold! Get you gone, be strong and prosperous\n125 In this resolve. I’ll send a Friar with speed\n14\nTo Mantua with my letters to thy lord.\n13. As the manner of our country is: it was common to bury families all in the same tomb or cemetery.\n14. thy lord: Romeo\nAct 4 | 113 JULIET\nLove give me strength, and strength shall help afford.\nFarewell, dear Father.\nExit all\n❖❖❖\nACT 4, SCENE 2\nJuliet returns to find her family preparing for the wedding. Repentant, she asks for forgiveness and\nagrees to marry Paris. Lord Capulet, in his excitement, decides to advance the ceremony from Thursday\nto Wednesday (tomorrow). Ignoring his wife’s protests, he instructs her to be with Juliet while he finishes\npreparations and sends word to Paris of the changed itinerary.\nSomewhere within the Capulet estate:\nEnter Capulet, Lady capulet, Nurse, and Servingmen\nCAPULET\nSo many guests invite as here are writ.\nGives a list to a SERVANT, who then exits.\nSirrah, go hire me twenty cunning cooks.\nSERVINGMAN\n15\nYou shall have none ill°, sir, for I’ll test if they will lick their fingers. °unskilled\nCAPULET\nHow canst thou test them so?\nSERVINGMAN\n5 Marry sir, ‘tis an ill cook that will not lick his own fingers:\nTherefore he that will not lick his fingers goes not with me.\nCAPULET\nGo, be gone.\n15. lick their fingers: The servingman speaks with a dialect of the lower class. Licking their fingers is a sign that a cook likes their\nown cooking, so they must be a good hire.\n114 | Act 4 Exit Servingman\nWe shall be much unfurnished° for this time. °unprepared\nWhat, is my daughter gone to Friar Lawrence?\nNURSE\n10 Aye, forsooth.\nCAPULET\nWell he may chance to do some good on her.\nA peevish, self-willed harlotry° it is. °unprincipled behavior\nEnter Juliet\nLADY CAPULET\nSee, here she commeth from confession.\nCAPULET\nHow now, my headstrong?\n15 Where have you been gadding°? °wandering\nJULIET\nWhere I have learnt me to repent the sin\nOf disobedient opposition\nTo you and your behests, and am enjoined° °compelled\nBy holy Lawrence to fall prostrate here [Juliet kneels]\n20 To beg your pardon. Pardon, I beseech you!\nHenceforward I am ever ruled by you.\nCAPULET\nNow before God, this holy reverend Friar,\nAll our whole city is much bound° to him! °indebted\nSend for the County. Go tell him of this.\n16\n25 I’ll have this knot knit up tomorrow morning.\nJULIET\nI met the youthful lord at Lawrence’s cell,\n16. this knot knit up tomorrow morning: this means Juliet will be married in the morning, a day earlier than planned.\nAct 4 | 115 And gave him what becomed love I might,\nNot stepping o’er the bounds of modesty.\nCAPULET\nWhy, I am glad on’t. This is well. Stand up.\n30 This is as’t should be. Let me see the County.\nAye, marry, go I say, and fetch him hither.\nJULIET rises\nJULIET\nNurse, will you go with me into my closet\nTo help me sort such needful ornaments\nAs you think fit to furnish me tomorrow?\nLADY CAPULET\n35 No, not till Thursday. There’s time enough.\nCAPULET\nGo, Nurse, go with her.\nWe’ll to church tomorrow.\nExit Juliet and Nurse\nLADY CAPULET\nMethinks on Thursday would be time enough.\nCAPULET\nI say I will have this dispatched tomorrow.\nLADY CAPULET\n40 I pray, my Lord, let it be Thursday.\nCAPULET\nI say tomorrow while she’s in the mood.\nLADY CAPULET\nWe shall be short in our provision°. °food and drink\n116 | Act 4 ‘Tis now near night.\nCAPULET\nTush, I will stir about.\n45 And all things shall be well, I warrant thee, wife.\nGo thou to Juliet, help to deck° her up. °dress\nI’ll not to bed tonight. Let me alone;\n17\nI’ll play the housewife for this once.— [calls servants] What ho?\nThey are all forth°.— Well, I will walk myself °gone\n50 To County Paris, to prepare up him\nAgainst tomorrow. My heart is wondrous light\nSince this same wayward girl is so reclaimed.\nExit all\n❖❖❖\nACT 4, SCENE 3\nJuliet sends the nurse and Lady Capulet from her bedroom on the pretext of getting rest. She then\nexperiences a series of doubts about the plan: what if the poison doesn’t work? What if the Friar actually\nintends to kill her to preserve the sanctity of her first marriage? What if she wakes up too early and\nsuffocates? What if waking in the tomb will drive her insane? She rebuts most of these fears and drinks the\npoison, falling into a death-like trance.\nJuliet’s chambers within the Capulet estate:\nEnter JULIET and NURSE\nJULIET\nAye, those attires are best; but gentle Nurse\nI pray thee leave me to myself tonight\nFor I have need of many orisons° °prayers\nTo move the heavens to smile upon my state,\n5 Which, well thou know’st, is cross and full of sin.\nEnter LADY CAPULET\nLADY CAPULET\nWhat, are you busy – do you need my help?\n17. Sensitivity note: housewife in this context represents another example of Shakespeare's assumed gender roles. Keep in mind\nthat though this may have been a common phrase in his time, it does not mean it was an accurate or respectful statement.\nAct 4 | 117 JULIET\nNo, madam, we have culled° such necessaries °selected\nAs are behooveful° for our state tomorrow. °necessary\nSo please you, let me now be left alone;\n10 And let the Nurse this night sit up with you,\nFor I am sure you have your hands full all\nIn this so sudden business.\nLADY CAPULET\nGoodnight.\nGet thee to bed and rest, for thou hast need.\nExit NURSE and LADY CAPULET\nJULIET\n15 Farewell:\nGod knows when we shall meet again.\nI have a faint cold fear thrills through my veins,\nThat almost freezes up the heat of life.\nI’ll call them back again to comfort me.—\n18\n20 Nurse!— What should she do here?\nMy dismal scene I needs must act alone.\nCome, vial.\nTakes out vial.\nWhat if this mixture should not work at all?\nShall I be married then tomorrow morning?\n25 No, no, this shall forbid it.\nTakes out knife.\nLie thou there.\nWhat if it be a poison, which the Friar\nSubtly hath ministered to have me dead,\nLest in this marriage he should be dishonored,\nBecause he married me before to Romeo?\n30 I fear it is. And yet methinks it should not,\nFor he hath still been tried a holy man.\nHow, if when I am laid into the tomb,\nI wake before the time that Romeo\nComes to redeem me? There’s a fearful point:\n18. Nurse: Juliet is breaking her soliloquy to call out for the nurse before quickly coming to her senses and thinking to herself\nagain.\n118 | Act 4 35 Shall I not then be stifled° in the vault, °suffocated\nTo whose foul mouth no healthsome air breathes in,\nAnd there die strangled ere my Romeo comes?\nOr, if I live, is it not very like° °likely\nThe horrible conceit° of death and night, °notion; idea\n40 Together with the terror of the place—\nAs in the vault, an ancient receptacle\nWhere for these many hundred years the bones\nOf all my buried ancestors are packed:\n19\nWhere bloody Tybalt, yet but green in earth,\n45 Lies festering in his shroud; where, as they say,\nAt some hours in the night spirits resort°. °haunt\nAlack, alack, is it not like that I\nIn early waking, what with loathsome smells,\n20\nAnd shrieks like mandrakes torn out of the earth,\n50 That living mortals hearing them run mad—\nO, if I wake, shall I not be distraught,\nEnvironed° with all these hideous fears, °surrounded; buried\nAnd madly play with my forefathers’ joints?\nAnd pluck the mangled Tybalt from his shroud?\n55 And, in this rage, with some great kinsman’s bone,\nAs with a club, dash out my desperate brains?\nO look, methinks I see my cousin’s ghost,\nSeeking out Romeo that did spit° his body °impale\nUpon a rapier’s point. Stay, Tybalt, stay!\n21\n60 Romeo, Romeo, Romeo! Here’s drink; I drink to thee.\nShe drinks and falls upon her bed within the curtains.\n❖❖❖\nACT 4, SCENE 4\nThe Capulets work through the night in preparation. Hearing Paris’ arrival, Lord Capulet tells the Nurse to\nwake Juliet.\nSomewhere within the Capulet estate:\nEnter LADY CAPULET and NURSE\n19. yet but green in earth: freshly buried\n20. mandrakes: plants whose roots grow in a humanlike shape and, according to legend, shriek when torn from the ground.\n21. O look, methinks...I drink to thee: This rambling from Juliet conveys her confusion and fear in this moment. These fears of\ndeath and what could be in the vial fill her head until she settles on drinking it.\nAct 4 | 119 LADY CAPULET\nHold, take these keys and fetch more spices, Nurse.\nNURSE\n22\nThey call for dates and quinces° in the pastry. °fruit\nEnter CAPULET\nCAPULET\n23\nCome, stir, stir, stir! The second cock hath crowed;\nThe curfew bell hath rung. ‘Tis three o’clock:\n24\n5 Look to the baked meats, good Angelica,\nSpare not for cost.\nNURSE\n25\nGo, you cotquean, go,\nGet you to bed. Faith, you’ll be sick tomorrow\nFor this night’s watching.\nCAPULET\n10 No, not a whit. What! I have watched ere now\nAll night for lesser cause, and ne’er been sick.\nLADY CAPULET\nAye, you have been a mousehunt° in your time, °a ladies’ man\nBut I will watch you from such watching now.\nExit LADY CAPULET and NURSE\nCAPULET\nA jealous-hood, a jealous-hood! Now, fellow, what is there?\nEnter three or four SERVINGMEN with spits, logs, and baskets\n22. pastry: pastry-making room\n23. The second cock hath crowed: tradition had it that the cock crows first at midnight, then at 3AM, and then an hour before\nthe sun rises\n24. Angelica: a plant used for flavoring, baking, and candies.\n25. cotquean: here, a man doing women’s work or displaying womanish tendencies.\n120 | Act 4 FELLOW\n15 Things for the cook, sir, but I know not what.\nCAPULET\nMake haste, make haste, sirrah! Fetch drier logs.\nCall Peter; he will show thee where they are.\nFELLOW\nI have a head sir, that will find out logs,\nAnd never trouble Peter for the matter.\nCAPULET\n26 27\n20 Mass, and well said. A merry whoreson, ha!\n28\nThou shalt be loggerhead. —Good Father, ‘tis day.\nPlay music\nThe County will be here with music soon,\nFor so he said he would. I hear him near.\nNurse! Wife! What ho! What, Nurse, I say!\nEnter NURSE\n25 Go waken Juliet, go trim her up,\nI’ll go and chat with Paris. Hie, make haste,\nMake haste. The bridegroom: he is come already.\nMake haste, I say!\nExit all but NURSE\n❖❖❖\nACT 4, SCENE 5\nThe Nurse enters Juliet’s bedroom, assuming her to be asleep, but then discovers her to be (apparently)\ndead. Lady Capulet, Lord Capulet, Paris, and Friar Lawrence arrive consecutively and grieve at seeing Juliet\nin her current state. The Friar reassures the family that Juliet is surely well in heaven and urges them to\nbring her to church to begin the funeral rites. After they leave, musicians hired for the wedding linger, and,\nunconcerned by the day’s events, joke and banter about music before making their exit.\n26. Mass: word used to agree with someone else\n27. A merry whoreson: i.e., he’s a funny son of a sex worker\n28. loggerhead: could mean blockhead; could also mean having a big head (out of proportion to the body)\nAct 4 | 121 Juliet’s chambers within the Capulet estate:\nEnter NURSE\nNURSE\nMistress? What, mistress? Juliet? Fast°, I warrant her, she. °fast asleep\nWhy, lamb! Why, lady! Fie, you slugabed°! °sleepyhead\nWhy, love, I say! Madam, sweetheart! Why, bride!\nWhat, not a word? You take your pennyworths° now, °money’s worth\n5 Sleep for a week, for the next night I warrant\n29\nThe County Paris hath set up his rest\nThat you shall rest but little.—God forgive me.\nMarry and Amen! How sound is she asleep.\nI must needs wake her.—Madam, madam, madam!\n10 Aye, let the County take you in your bed;\nHe’ll fright you up, i’faith. Will it not be?\nWhat, dressed and in your clothes and down again?\nI must needs wake you. Lady, lady, lady!\nAlas, alas! Help, help! My lady’s dead!\n15 O welladay° that ever I was born! °woe the day\nSome aqua-vitae, ho! My lord, my lady!\nEnter LADY CAPULET\nLADY CAPULET\nWhat noise is here?\nNURSE\nO lamentable day!\nLADY CAPULET\nWhat is the matter?\nNURSE\n20 Look, look! O heavy day!\nLADY CAPULET\nO me, O me! My child, my only life!\nRevive, look up, or I will die with thee!\n29. hath set up his rest: has resolved\n122 | Act 4 Help, help! Call help!\nEnter CAPULET\nCAPULET\nFor shame, bring Juliet forth. Her Lord is come.\nNURSE\n25 She’s dead, deceased, she’s dead. Alack the day!\nLADY CAPULET\nAlack the day! She’s dead, she’s dead, she’s dead.\nCAPULET\nHa! Let me see her. Out, alas—she’s cold!\nHer blood is settled, and her joints are stiff;\nLife and these lips have long been separated.\n30 Death lies on her like an untimely frost\nUpon the sweetest flower of all the field.\nNURSE\nO lamentable day!\nLADY CAPULET\nO woeful time!\nCAPULET\nDeath, that hath ta’en her hence to make me wail,\n35 Ties up my tongue and will not let me speak.\nEnter FRIAR LAWRENCE and PARIS with MUSICIANS\nFRIAR LAWRENCE\nCome, is the bride ready to go to church?\nCAPULET\nReady to go, but never to return.\nO son, the night before thy wedding day\nAct 4 | 123 Hath Death lain with thy wife. There she lies,\n40 Flower as she was, deflowered by him.\nDeath is my son-in-law; Death is my heir.\nMy daughter he hath wedded. I will die\nAnd leave him all life living. All is Death’s.\nPARIS\nHave I thought long to see this morning’s face,\n45 And doth it give me such a sight as this?\nLADY CAPULET\nAccursed, unhappy, wretched, hateful day!\nMost miserable hour that e’er time saw\n30\nIn lasting labor of his pilgrimage.\nBut one, poor one, one poor and loving child,\n50 But one thing to rejoice and solace in,\nAnd cruel Death hath catched it from my sight.\nNURSE\nO woe, O woeful, woeful, woeful day!\nMost lamentable day, most woeful day\nThat ever, ever I did yet behold.\n55 O day, O day, O day, O hateful day,\nNever was seen so black a day as this:\nO woeful day, O woeful day!\nPARIS\nBeguiled, divorcèd, wrongèd, spited, slain!\nMost detestable Death, by thee beguiled,\n60 By cruel, cruel thee quite overthrown.\nO love, O life; not life, but love in death.\nCAPULET\nDespised, distressèd, hated, martyred, killed!\nUncomfortable time, why cam’st thou now\nTo murder, murder our solemnity?\n65 O child, O child, my soul and not my child!\nDead art thou! Alack, my child is dead,\nAnd with my child, my joys are burièd.\n30. lasting labor of his pilgrimage: i.e., in all his days\n124 | Act 4 FRIAR LAWRENCE\nPeace, ho! For shame! Confusion’s cares lives not\nIn these confusions°. Heaven and yourself °yelling; commotion\n31\n70 Had part in this fair maid. Now heaven hath all,\nAnd all the better it is for the maid.\nYour part in her, you could not keep from Death,\nBut heaven keeps his part in eternal life.\nThe most you sought was her promotion,\n75 For ‘twas your heaven she should be advanced.\nAnd weep ye now, seeing she is advanced\nAbove the clouds, as high as heaven itself?\nO in this love, you love your child so ill\nThat you run mad seeing that she is well.\n80 She’s not well married that lives married long,\nBut she’s best married that dies married young.\n32\nDry up your tears and stick your rosemary\nOn this fair corpse, and, as the custom is,\nIn all her best array° bear her to Church. °attire\n85 For though some nature bids us all lament,\nYet nature’s tears are reason’s merriment.\nCAPULET\nAll things that we ordained festival\nTurn from their office to black funeral.\nOur instruments to melancholy bells,\n90 Our wedding cheer to sad burial feast,\nOur solemn hymns to sullen dirges° change, °songs of lamentation\nOur bridal flowers serve for a buried corpse,\nAnd all things change them to the contrary.\nFRIAR LAWRENCE\nSir, go you in, and madam, go with him;\n95 And go, sir Paris. Every one prepare\nTo follow this fair corpse unto her grave.\nThe heavens do frown upon you for some ill;\nMove them no more, by crossing their high will.\nExit all but NURSE and MUSICIANS\n31. had part in this fair maid: i.e., were alive in her\n32. rosemary: the herb was sometimes used in funeral ceremonies\nAct 4 | 125 FIRST MUSICIAN\n33\nFaith, we may put up our pipes and be gone.\nNURSE\n100 Honest good fellows, ah, put up, put up!\nFor well you know, this is a pitiful case.\nFIRST MUSICIAN\n34\nAye, by my troth, the case may be amended.\nExit NURSE\nEnter PETER\nPETER\n35\nMusicians, O musicians! “Heart’s Ease,” “Heart’s Ease.”\nO, and you will have me live, play “Heart’s Ease.”\nFIRST MUSICIAN\n105 Why “Heart’s Ease?”\nPETER\nO musicians, because my heart itself plays “My heart is full of\nwoe.” O play me some merry dump° to comfort me. °sad song\nFIRST MUSICIAN\nNot a dump, no—’tis no time to play now.\nPETER\nYou will not then?\nFIRST MUSICIAN\n110 No.\n33. put up our pipes: pipe instruments were traditionally used at weddings; “put up” here means “put away.”\n34. the case may be amended: referring to either the case of Juliet’s death, or his instrument case\n35. “Heart’s Ease”: a popular song at the time.\n126 | Act 4 PETER\nI will then give it to you soundly.\nFIRST MUSICIAN\nWhat will you give us?\nPETER\nNo money, on my faith, but the gleek°. I will give° you the °insult °name\n36\nminstrel.\nFIRST MUSICIAN\n37\n115 Then will I give you the serving-creature.\nPETER\nThen will I lay the serving-creature’s daggers on your pate°. I will °head\n38\ncarry no crochets°; I’ll re you, I’ll fa you. Do you note me? °a musical note\nFIRST MUSICIAN\nIf you re us and you fa us, you’ll note us.\nSECOND MUSICIAN\nPray you put up your dagger, and put out your wit. Then have at\n120 you with my wit.\nPETER\nI will dry-beat° you with an iron wit and put up my iron dagger. °thrash\nAnswer me like men:\n[Sings] When griping griefs the heart doth wound,\nAnd doleful dumps the mind oppress,\n125 Then music with her silver sound—\nWhy “silver sound?” Why “music with her silver sound?”\n39\nWhat say you, Simon Catling?\n36. the minstrel: insulting term for “musician”\n37. the serving-creature: insulting term for “servant”\n38. I’ll re you, I’ll fa you: re and fa are both names of musical notes\n39. Catling: a string used for instruments\nAct 4 | 127 FIRST MUSICIAN\nMarry, sir, because silver hath a sweet sound.\nPETER\n40\nPrates°! What say you, Hugh Rebeck? °a stupid answer\nSECOND MUSICIAN\n41\n130 I say “silver sound” because musicians sound for silver.\nPETER\n42\nPrates too! What say you, James Sound-Post?\nTHIRD MUSICIAN\nFaith, I know not what to say.\nPETER\n43\nO, I cry you mercy! You are the singer. I will say for you: It is\n“music with her silver sound” because musicians have no gold for\n135 sounding.\n[Sings] Then Music with her silver sound\nWith speedy help doth lend redress°. °relief\nFarewell, fiddlers! Farewell!\nExit PETER\nFIRST MUSICIAN\nWhat a pestilent knave is this man!\nSECOND MUSICIAN\n44\n140 Hang him, Jack. Come, we’ll be in here, tarry for the mourners, and\n45\nstay dinner.\nExit all\n40. Rebeck: a bowed instrument\n41. sound for silver: i.e., make sound for money\n42. Sound-Post: a small component used in violins and other similar instruments.\n43. cry you mercy: beg your pardon\n44. Hang him: phrase used to disregard or ignore someone\n45. stay dinner: wait for dinner\n128 | Act 4 Act 5\nACT 5, SCENE 1\nBalthasar, a friend of Romeo’s, brings him news that Juliet is dead and lies in the Capulet tomb. Resolved\nto find her and join her in death, Romeo first visits an apothecary and bribes him to obtain an illegal (and\nlethal) poison.\nTrigger warning: Act 5 contains material discussing and portraying suicide.\nA market street in Mantua:\nEnter ROMEO\nROMEO\nIf I may trust the flattering truth of sleep\nMy dreams presage° some joyful news at hand. °foreshadow\n1\nMy bosom’s lord sits lightly in his throne:\nAnd all this day an unaccustomed spirit\n5 Lifts me above the ground with cheerful thoughts.\nI dreamt my lady came and found me dead—\nStrange dream that gives a dead man leave to think—\nAnd breathed such life with kisses in my lips,\nThat I revived and was an Emperor.\n2\n10 Ah me, how sweet is love itself possessed,\nWhen but love’s shadows° are so rich in joy! °dreams\nEnter ROMEO’s man BALTHASAR\nNews from Verona! How now, Balthasar?\nDost thou not bring me letters from the Friar?\nHow doth my lady? Is my father well?\n15 How doth my lady Juliet? That I ask again,\nIf she is well, then nothing can be ill.\nBALTHASAR\nThen nothing can be ill, for she is well!\nHer body sleeps in Capel’s monument,\nAnd her immortal part with angels lives.\n20 I saw her laid low in her kindred’s vault,\nAnd presently took post to tell it you.\n1. My bosom’s lord: my heart\n2. love itself possessed: i.e., love in real life\nAct 5 | 129 O, pardon me for bringing this ill news,\nSince you did leave it for my office°, sir. °duty\nROMEO\nIs it even so? Then I deny you, stars!\n25 Thou knowest my lodging. Get me ink and paper,\n3\nAnd hire post horses. I will hence tonight.\nBALTHASAR\nI do beseech you sir, have patience.\n4\nYour looks are pale and wild, and do import° °imply\nSome misadventure°. °accident, or failed attempt\nROMEO\n30 Tush, thou art deceived!\nLeave me, and do the thing I bid thee do!\nHast thou no letters to me from the Friar?\nBALTHASAR\nNo, my good lord.\nROMEO\nNo matter; get thee gone.\n35 And hire those horses. I’ll be with thee straight.\nExit BALTHASAR\nWell, Juliet, I will lie with thee tonight.\n5\nLet’s see for means. O mischief, thou art swift\nTo enter in the thoughts of desperate men!\nI do remember an apothecary—\n40 And hereabouts he dwells—which late I noted\nIn tattered cloths with overwhelming brows, °clothes\nCulling of simples°. Meager were his looks. °herbs\nSharp misery had worn him to the bones.\nAnd in his needy shop a tortoise hung,\n45 An alligator stuffed, and other skins\nOf ill-shaped fishes. And about his shelves,\n3. post horses: horses for rent, which were kept at inns\n4. Your looks are pale and wild: Balthasar acknowledges the mania in Romeo's actions\n5. Let’s see for means: i.e., how can I do this?\n130 | Act 5 A beggarly° amount of empty boxes, °small\nGreen earthen pots, bladders, and musty seeds,\nRemnants of packthread, and old cakes of roses\n50 Were thinly scattered to make up a show.\nNoting this penury°, to myself I said, °extreme poverty\n“An if a man did need a poison now—\nWhose sale is present death in Mantua—\nHere lives a caitiff° wretch would sell it him.” °miserable; vile\n55 O, this same thought did but forerun my need,\nAnd this same needy man must sell it me.\nAs I remember, this should be the house.\nBeing holiday, the beggar’s shop is shut.—\nWhat ho, apothecary?”\nEnter APOTHECARY\nAPOTHECARY\n60 Who calls so loud?\nROMEO\nCome hither, man. I see that thou art poor.\nHold, there is forty ducats°. Let me have °gold coins\nA dram° of poison, such soon-speeding stuff °small drink\nAs will disperse itself through all the veins\n65 That life-weary taker may fall dead,\nAnd that the trunk° may be discharged of breath °chest\nAs violently as hasty powder fired\nDoth hurry from the fatal cannon’s womb.\nAPOTHECARY\nSuch mortal drugs I have, but Mantua’s law\n70 Is death to any he that utters them!\nROMEO\nArt thou so bare and full of wretchedness\nAnd fearest to die? Famine is in thy cheeks,\nNeed and oppression starveth in thy eyes,\nContempt and beggary hangs upon thy back!\n75 The world is not thy friend, nor the world’s law.\nThe world affords no law to make thee rich.\nThen be not poor, but break it and take this.\nAct 5 | 131 APOTHECARY\nMy poverty, but not my will, consents.\nROMEO\n6\nI pray thy poverty and not thy will.\nAPOTHECARY gives him the poison\nAPOTHECARY\n80 Put this in any liquid thing you will\nAnd drink it off, and if you had the strength\nOf twenty men, it would dispatch you straight.\nROMEO\nThere is thy gold: worse poison to men’s souls,\nDoing more murder in this loathsome world\n85 Than those poor compounds that thou must not sell.\nI sell thee poison; thou hast sold me none.\n7\nFarewell, buy food, and get thyself in flesh.\nExit APOTHECARY\nCome, cordial° and not poison, go with me °medicinal drink\nTo Juliet’s grave, for there must I use thee.\nExit ROMEO\n❖❖❖\nACT 5, SCENE 2\nFriar John returns to Friar Lawrence, informing him that his letter could not be delivered to Romeo due to\nan outbreak of sickness. Aware that Juliet will soon awake, Friar Lawrence heads to the Capulet tomb to\nretrieve Juliet and keep her safe until Romeo can return.\nFriar Lawrence’s cell in Verona:\nEnter FRIAR JOHN\n6. I pray thy...thy will: He will pay for the poison because the Friar is poor, not because he wills it.\n7. get thyself in flesh: meaning, “get some meat on your bones”\n132 | Act 5 FRIAR JOHN\nHoly Franciscan Friar, brother, ho?\nEnter FRIAR LAWRENCE\nFRIAR LAWRENCE\nThis same should be the voice of Friar John.\nWelcome from Mantua! What says Romeo?\nOr if his mind be writ, give me his letter.\nFRIAR JOHN\n5 I went to find a barefoot brother° out, °another friar\nOne of our order, to accompany me,\nWho was in this city visiting the sick,\nAnd, finding him, the searchers of the town\nSuspected that we both were in a house\n10 Where the infectious pestilence did reign,\n8\nSealed up the doors and would not let us forth,\nSo that my speed to Mantua there was stayed.\nFRIAR LAWRENCE\nWho bare my letter then to Romeo?!\nFRIAR JOHN\nI could not send it—here it is again—\n15 Nor get a messenger to bring it thee,\nSo fearful were they of infection.\nFRIAR LAWRENCE\nUnhappy fortune! By my Brotherhood,\n9\nThe letter was not nice but full of charge\nOf dear import, and the neglecting it\n20 May do much danger. Friar John, go hence,\n10\nGet me an iron crow and bring it straight\nUnto my cell!\n8. “Here in…let us forth”: he was quarantined because the searchers suspected him of having the plague\n9. not nice but full of charge: not trivial, but full of important instructions\n10. iron crow: an iron rod used as a lever\nAct 5 | 133 FRIAR JOHN\nBrother, I’ll go and bring it thee!\nExit FRIAR JOHN\nFRIAR LAWRENCE\nNow must I to the Monument° alone. °Capulet family tomb\n25 Within this three hours will fair Juliet wake.\nShe will beshrew me much that Romeo\nHath had no notice of these accidents.\nBut I will write again to Mantua\nAnd keep her at my cell ‘til Romeo come.\n30 Poor living corpse, closed in a dead man’s Tomb.\nExit FRIAR LAWRENCE\n❖❖❖\nACT 5, SCENE 3\nParis mourns at the Capulet tomb, but hides when he hears someone (Romeo) approaching. As he reaches\nthe tomb, Romeo commands Balthasar to leave; Balthasar leaves but decides to linger secretly. Paris\nconfronts Romeo as he attempts to open the tomb. They fight, and Romeo kills Paris. Romeo enters the\ntomb and lays Paris inside it. Approaching Juliet, Romeo grieves for her death and the luster of her still-\nlively beauty. He drinks the poison and dies. Friar Lawrence arrives and witnesses the scene as Juliet wakes,\noffering to hide her away among a convent of nuns. She refuses. Hearing guards approaching, Juliet kills\nherself with Romeo’s dagger. The Prince, the Capulets, and the Montagues are summoned by the guards.\nFriar Lawrence summarizes the events leading to this point and is corroborated by Balthasar and Romeo’s\nletter to his father. In remorse, lords Capulet and Montague make peace.\nThe Churchyard, outside the Capulet Tomb, later moving within the tomb:\nEnter PARIS and his PAGE\nPARIS\nGive me thy torch, boy. Hence, and stand aloof°. °at a distance\nYet put it out, for I would not be seen.\n11\nUnder those young trees, lay thee all along,\nHolding thy ear close to the hollow ground.\n5 So shall no foot upon the churchyard tread,\nBeing loose, unfirm, with digging up of graves,\n11. all along: flat\n134 | Act 5 But thou shalt hear it. Whistle then to me\nAs signal that thou hearest something approach.\nGive me those flowers. Do as I bid thee; go!\nPAGE\n10 I am almost afraid to stand alone\nHere in the churchyard, yet I will adventure.\nPARIS\nSweet flower, with flowers thy bridal bed I strew—\nO woe, thy canopy is dust and stones!\nWhich with sweet water nightly I will dew,\n15 Or, lacking that, with tears distilled by moans.\n12\nThe obsequies that I for thee will keep,\nNightly shall be to strew thy grave and weep.\nThe PAGE whistles\nThe boy gives warning; something doth approach.\nWhat cursed foot wanders this way tonight,\n20 To cross my obsequies and true love’s right?\nWhat, with a torch? Muffle me, night, a while.\nEnter ROMEO and BALTHASAR\nROMEO\nGive me the mattock° and the wrenching iron°. °pickaxe °crowbar\nAnd take this letter early in the morning.\nSee thou deliver it to my lord and father.\n25 Give me the light. Upon thy life I charge thee,\nWhatever thou hearest or seest, stand all aloof,\nAnd do not interrupt me in my course.\nWhy I descend into this bed of death\nIs partly to behold my lady’s face,\n30 But chiefly to take thence from her dead finger\nA precious ring, a ring that I must use,\n13\nIn dear employment; therefore hence, be gone.\nBut if thou, jealous°, dost return to pry, °curious\nIn what I farther shall intend to do,\n35 By heaven, I will tear thee joint by joint,\nAnd strew this hungry churchyard with thy limbs.\n12. The obsequies that I for thee will keep: i.e., the funeral rites that I will perform for you\n13. In dear employment: i.e., for important reasons\nAct 5 | 135 The time and my intents are savage, wild,\nMore fierce and more inexorable far\nThan empty tigers, or the roaring sea!\nBALTHASAR\n40 I will be gone, sir, and not trouble ye.\nROMEO\nIn this thou shows me friendship. [hands BALTHASAR money] Take thou that.\nLive and be prosperous, and farewell, good fellow!\nBALTHASAR and ROMEO part\nBALTHASAR\nFor all this same, I’ll hide me hereabout.\nHis looks I fear, and his intents I doubt.\nROMEO\n45 Thou detestable maw°, thou womb of death, °mouth\nGorged with the dearest morsel of the earth,\nThus I enforce thy rotten jaws to open,\nAnd in despite°, I’ll cram thee with more food! °spite\nPARIS\n[To himself] This is that banished haughty° Montague °arrogant\n50 That murdered my love’s cousin, with which grief\nIt is supposed the fair creature died,\nAnd here is come to do some villainous shame\nTo the dead bodies. I will apprehend him.\n[To ROMEO] Stop thy unhallowed toil, vile Montague!\n55 Can vengeance be pursued further than death?\nCondemned villain, I do apprehend thee!\nObey and go with me, for thou must die!\nROMEO\nI must indeed, and therefore I came hither.\nGood gentle youth, tempt not a desperate man,\n60 Fly hence and leave me. Think upon these gone;\nLet them affright thee. I beseech thee, youth,\nPut not another sin upon my head\n136 | Act 5 14\nBy urging me to fury. O, begone!\nBy heaven, I love thee better than myself,\n65 For I come hither armed against myself.\nStay not: be gone, live, and hereafter say,\nA madman’s mercy bid thee run away.\nPARIS\nI do defy thy commiseration,\nAnd apprehend thee for a felon here.\nROMEO\n70 Wilt thou provoke me? Then have at thee, boy!\nROMEO and PARIS fight\nPAGE\nO Lord, they fight! I will go call the Watch.\nExit PAGE\nPARIS\nO, I am slain! If thou be merciful,\nOpen the tomb; lay me with Juliet.\nPARIS dies\nROMEO\nIn faith, I will. Let me peruse° this face. °examine\n75 Mercutio’s kinsman, noble County Paris!\nWhat said my man, when my betossèd soul\nDid not attend him as we rode? I think\nHe told me Paris should have married Juliet.\nSaid he not so? Or did I dream it so?\n80 Or am I mad, hearing him talk of Juliet,\nTo think it was so? O, give me thy hand,\nOne writ with me in sour misfortune’s book!\nI’ll bury thee in a triumphant grave.\nA grave? O, no. A lantern, slaughtered youth,\n85 For here lies Juliet, and her beauty makes\nThis vault a feasting presence full of light!\n14. Put not another sin upon my head: Do not make me kill again.\nAct 5 | 137 ROMEO arranges PARIS in the Capulet tomb\nDeath, lie thou there, by a dead man interred.\nHow oft when men are at the point of death\nHave they felt merry, which their keepers call\n90 A lightning before death. O, how may I\nCall this a lightning? O my love! My wife!\nDeath that has sucked the honey of thy breath\nHath had no power yet upon thy beauty.\nThou art not conquered. Beauty’s ensign° yet °banner\n95 Is crimson in thy lips and in thy cheeks,\nAnd death’s pale flag is not advanced there.\nTybalt, lie you there in that bloody sheet?\nO, what more favor can I do to thee\nThan with that hand that cut thy youth in twain° °in half\n100 To sunder° his that was thine enemy? °cut off\nForgive me, cousin! Ah, dear Juliet,\nWhy are thou yet so fair? I will believe—\n15\nShall I believe—that unsubstantial Death is amorous,\n16\nAnd that the lean abhorrèd monster keeps\n105 Thee here in dark to be his paramour°? °lover\nFor fear of that I still will stay with thee,\nAnd never from this palace of dim night\nDepart again, here, here will I remain\n17\nWith worms that are thy chambermaids. O, here\n110 Will I set up my everlasting rest,\nAnd shake the yoke of inauspicious stars\nFrom this world-wearied flesh. Eyes, look your last.\nArms, take your last embrace! And lips, O, you\nThe doors of breath, seal with a righteous kiss\n115 A dateless bargain to engrossing death!\nHe kisses JULIET\nCome, bitter conduct! Come, unsavory guide!\nThou desperate pilot, now at once run on\nThe dashing rocks thy seasick weary bark!\nHere’s to my love! O true° apothecary, °honest\n120 Thy drugs are quick. Thus with a kiss, I die.\nROMEO drinks the poison and dies\nEnter FRIAR LAWRENCE with a lantern, crowbar and a spade\n15. unsubstantial Death is amorous: i.e., death is in love with Juliet\n16. lean abhorrèd monster: i.e. Death characterized as thin and detestable.\n17. With worms that are thy chambermaids: i.e. Worms are characterized as servants to Juliet, tending to her grave.\n138 | Act 5 FRIAR LAWRENCE\n18\nSaint Francis be my speed! How oft tonight\nHave my old feet tripped on gravestones.—Who’s there?\nBALTHASAR\nHere’s one, a friend, and one that knows you well.\nFRIAR LAWRENCE\nBliss be upon you! Tell me, good my friend,\n125 What torch is yond that vainly lends his light\nTo grubs and eyeless skulls? As I discern,\nIt burns in the Capulets’ monument.\nBALTHASAR\nIt does so, holy sir,\nAnd there’s my master, one that you love.\nFRIAR LAWRENCE\n130 Who is it?\nBALTHASAR\nRomeo.\nFRIAR LAWRENCE\nHow long hath he been there?\nBALTHASAR\nFull half an hour.\nFRIAR LAWRENCE\nGo with me to the vault.\nBALTHASAR\n135 I dare not, sir.\n18. Saint Francis: the patron saint of Italy\nAct 5 | 139 My master knows not but I am gone hence,\nAnd fearfully did menace me with death,\nIf I did stay to look on his intents.\nFRIAR LAWRENCE\nStay then, I’ll go alone. Fear comes upon me.\n140 O, much I fear some ill unthrifty° thing. °unfortunate\nBALTHASAR\nAs I did sleep under this young tree here,\nI dreamt my master and another fought\nAnd that my master slew him.\nExit BALTHASAR\nFRIAR LAWRENCE\nRomeo!\n145 Alas! Alas! What blood is this which stains\nThe stony entrance of this sepulcher°? °burial place\nWhat mean these masterless and gory swords\nTo lie discolored by this place of peace?\nRomeo! O, pale. Who else? What, Paris too?\n150 And steeped in blood? Ah, what an unkind hour\nIs guilty of this lamentable chance?\nThe lady stirs.\nJULIET\nO comfortable Friar! Where is my lord?\nI do remember well where I should be.\n155 And there I am. Where is my Romeo?\nFRIAR LAWRENCE\nI hear some noise.—Lady, come from that nest\nOf death, contagion, and unnatural sleep.\nA greater power than we can contradict\nHath thwarted our intents. Come, come away,\n160 Thy husband in thy bosom there lies dead,\nAnd Paris too. Come, I’ll dispose of thee\nAmong a sisterhood of holy nuns.\nStay not to question, for the Watch is coming.\nCome, go, good Juliet. I dare no longer stay.\nExit FRIAR LAWRENCE\n140 | Act 5 JULIET\n165 Go get thee hence, for I will not away.\nWhat’s here? A cup closed in my true love’s hand?\nPoison I see has been his timeless end!\nO churl°! Drank all and left no friendly drop °selfish person\nTo help me after? I will kiss thy lips.\n170 Happ’ly some poison yet doth hang on them,\nTo make me die with a restorative.\nShe kisses ROMEO\nThy lips are warm!\nEnter PAGE and WATCH\nWATCHMAN 1\nLead, boy! Which way?\nJULIET\nYea, noise? Then I’ll be brief. O happy dagger,\n175 This is thy sheath. There rust, and let me die.\nJULIET stabs herself and dies\nPAGE\nThis is the place, there where the torch doth burn.\nCHIEF WATCHMAN\nThe ground is bloody! Search about the churchyard.\nGo, some of you; whoe’er you find, arrest.\nPitiful sight! Here lies the County slain,\n180 And Juliet bleeding, warm, and newly dead,\nWho here hath lain these two days burièd.\nGo tell the Prince. Run to the Capulets.\nRaise up the Montagues. Some others search.\nWe see the ground whereon these woes do lie,\n185 But the true ground of all these piteous woes\nWe cannot without circumstance descry°. °decipher\nEnter 2nd WATCHMAN escorting BALTHASAR\n2nd WATCHMAN\nHere’s Romeo’s man; we found him in the churchyard.\nAct 5 | 141 CHIEF WATCHMAN\nHold him in safety ‘til the Prince comes hither.\nEnter 3rd WATCHMAN escorting FRIAR LAWRENCE\n3rd WATCHMAN\nHere is a Friar that trembles, sighs, and weeps.\n190 We took this mattock and spade from him\nAs he was coming from this churchyard’s side.\nCHIEF WATCHMAN\nA great suspicion! Stay the Friar too.\nEnter PRINCE\nPRINCE\nWhat misadventure is so early up\nThat calls our person from our morning rest?\nEnter CAPULET and LADY CAPULET\nCAPULET\n195 What could it be that they so shrieked abroad?\nLADY CAPULET\nO, the people in the street cry “Romeo,”\nSome “Juliet,” and some “Paris,” and all run\nWith open outcry toward our monument.\nPRINCE\nWhat fear is this which startles in our ears?\nCHIEF WATCHMAN\n200 Sovereign, here lies the County Paris slain,\nAnd Romeo dead, and Juliet, dead before,\nWarm and new killed.\nPRINCE\nSearch, seek, and know how this foul murder comes.\n142 | Act 5 CHIEF WATCHMAN\nHere is a Friar, and slaughtered Romeo’s man,\n205 With instruments upon them fit to open\nThese dead men’s tombs.\nCAPULET\nO heavens! O wife, look how our daughter bleeds!\n19\nThis dagger hath mista’en, for lo, his house\nIs empty on the back of Montague\n210 And is mis-sheathed in my daughter’s bosom.\nLADY CAPULET\nO me, this sight of death is as a bell\n20\nThat warns my old age to a sepulcher.\nEnter MONTAGUE\nPRINCE\nCome, Montague, for thou art early up\nTo see thy son and heir, now early down.\nMONTAGUE\n215 Alas, my liege, my wife is dead tonight!\n21\nGrief of my son’s exile hath stopped her breath.\nWhat further woe conspires against mine age?\nPRINCE\nLook and thou shalt see.\nMONTAGUE\n[To ROMEO] Oh, thou untaught°! What manners is this °rude\n220 To press° before thy father to a grave? °hurry\n19. his house: the dagger’s sheath\n20. That warns my old age to a sepulcher: i.e., makes her feel old\n21. Grief of my son's exile hath stopped her breath: i.e., Montague's wife died due to the emotional weight of losing her son.\nAct 5 | 143 PRINCE\nSeal up the mouth of outrage for a while,\n‘Til we can clear these ambiguities\nAnd know their spring°, their head, their true descent; °source\nAnd then will I be general of your woes\n22\n225 And lead you even to death. Meantime, forebear,\n23\nAnd let mischance be slave to patience.\nBring forth the parties of suspicion.\nFRIAR LAWRENCE\nI am the greatest, able to do least,\nYet most suspected as the time and place\n24\n230 Doth make against me of this direful murder.\nAnd here I stand, both to impeach and purge,\nMyself condemned and myself excused.\nPRINCE\nThen say at once what thou dost know in this!\nFRIAR LAWRENCE\nI will be brief, for my short date of breath\n235 Is not so long as is this tedious tale.\nRomeo there, dead, was husband to that Juliet,\nAnd she, there dead, that’s Romeo’s faithful wife.\nI married them, and their stol’n marriage day\nWas Tybalt’s doomsday, whose untimely death\n240 Banished the new-made bridegroom from this city,\n25\nFor whom, and not for Tybalt, Juliet pined.\nYou, to remove that siege of grief from her\nBetrothed and would have married her perforce° °by force\nTo County Paris. Then comes she to me,\n245 And with wild looks bid me devise some means\nTo rid her from this second marriage,\nOr in my cell there would she kill herself.\nThen gave I her, so tutored by my art,\nA sleeping potion, which so took effect,\n250 As I intended, for it wrought on her\nThe form of death. Meantime I wrote to Romeo\n22. And lead you even to death: i.e., be your leader in grief\n23. let mischance be slave to patience: i.e., let patience guide your misfortune\n24. make: give evidence\n25. For whom, and not for Tybalt, Juliet pined: i.e., Friar implies Juliet only care about Romeo and cares nothing for Tybalt.\n144 | Act 5 That he should hither come as this dire night\nTo help to take her from the borrowed grave\nBeing the time the potion’s force should cease.\n255 But he which bore my letter, Friar John,\nWas stayed by accident, and yesternight\nReturned my letter back. Then all alone\nAt the prefixed hour of her waking\nCame I to take her from her kindred’s vault,\n260 Meaning to keep her closely at my cell,\n‘Til I conveniently could send to Romeo.\nBut when I came some minute ere the time\nOf her awakening, here untimely lay\nThe noble Paris, and true Romeo, dead.\n265 She wakes, and I entreated her come forth\n26\nAnd bear this work of heaven with patience.\nBut then a noise did scare me from the tomb,\nAnd she, too desperate, would not go with me\nBut as it seems, did violence on herself.\n270 All this I know, and to the marriage her Nurse is privy.\n27\nAnd if aught in this miscarried by my fault,\nLet my old life be sacrificed some hour before his time\nUnto the rigor of severest law.\nPRINCE\nWe still have known thee for a holy man.\n275 Where’s Romeo’s man? What can he say to this?\nBALTHASAR\nI brought my master news of Juliet’s death,\nAnd then in post° he came from Mantua, °by horseback\nTo this same place, to this same monument.\nThis letter he early bid me give his father,\n280 And threatened me with death, going in the vault,\nIf I departed not, and left him there.\nPRINCE\nGive me the letter; I will look on it.\nWhere is the County’s page that raised the Watch?\n28\nSirrah, what made your master in this place?\n26. this work of heaven: i.e., this tragedy\n27. if aught in this miscarried by my fault: i.e., if anything in this was my fault\n28. what made your master: i.e., what was he doing?\nAct 5 | 145 PAGE\n285 He came with flowers to strew his lady’s grave,\nAnd bid me stand aloof, and so I did.\nAnon comes one with light to open the tomb,\nAnd, by and by, my master drew on him,\nAnd then I ran away to call the Watch.\nPRINCE\n290 [reading letter] This letter doth make good the Friar’s words.\nTheir course of love, the tidings of her death;\nAnd here he writes that he did buy a poison\nOf a poor apothecary, and there with it\nCame to this vault to die and lie with Juliet.\n295 Where be these enemies? Capulet? Montague?\nSee what a scourge is laid upon your hate\nThat heaven finds means to kill your joys with love!\n29\nAnd I, for winking at your discords, too\nHave lost a brace of kinsmen. All are punished.\nCAPULET\n300 O brother Montague, give me thy hand.\nThis is my daughter’s jointure°, for no more °dowry\nCan I demand.\nMONTAGUE\nBut I can give thee more,\nFor I will raise her statue in pure gold\n30\n305 That whiles Verona by that name is known,\nThere shall be no figure at such rate be set° °praised\nAs that of true and faithful Juliet.\nCAPULET\n31\nAs rich shall Romeo’s by his lady’s lie,\nPoor sacrifices for our enmity.\nPRINCE\n310 A glooming peace this morning with it brings.\n29. winking at your discords: looking the other way\n30. whiles Verona by that name is known: while Verona is called Verona\n31. Romeo’s: meaning Romeo’s statue\n146 | Act 5 The sun for sorrow shall not show his head.\nGo hence to have more talk of these sad things.\nSome shall be pardoned, and some punishèd.\nFor never was a story of more woe\n315 Than this of Juliet and her Romeo.\nExit all\nAct 5 | 147 "}