{
    "text": "Search... Home Subjects\nBoundless Management\nLeadership\nBehavioral Approach\nLeadership Model: University of Michigan\nThe Michigan behavioral studies are an important link in the ongoing development of behavioral theory in a leadership framework.\nLearning Objectives\nDiscuss the Michigan Leadership Studies generated in the 1950s and 1960s in the broader context of behavioral approaches to leadership\nKey Takeaways\nKey Points\nThe Michigan Leadership Studies of the 1950s and 1960s researched behavioral approaches and identification of leader relationships and\ngroup processes.\nThe Michigan Leadership Studies classified leaders as either \"employee-centered\" or \"job-centered\".\nThese studies identified three critical characteristics of effective leaders: task-oriented behavior, relationship-oriented behavior, and\nparticipative leadership.\nKey Terms\ntheory: A coherent statement or set of ideas that explains observations or phenomena or that sets out the laws and principles of\nsomething known or observed; a hypothesis confirmed by observation, experiment.\nThe recognition of leaders and the development of leadership theory have evolved over centuries. Individual ideas, actions, and behaviors\nhave been identified as indicating leadership within societal structures. This theoretical evolution has progressed over time, from\nidentifying individual personalities or characteristics to formal studies related to what constitutes leadership and why leadership is or is\nnot successful. Some of these studies and observations have been informal, while others have included empirical research and data.\nStudies of individual leadership styles and behaviors continue to contribute to understanding what it takes to be an effective leader, one\nwho is attuned to the needs of an organization and those it serves. Much of the evolution in the study of leadership behavior has become\nmore connected not only to people within an organization, but also extended to those outside the organization. This extension\nacknowledges that an understanding of the values, beliefs, and norms of those shaping the organization have a definite effect on the\nevolution and growth of the organization as a whole, as well as its ultimate impact on the community and people it serves.\nA group of leaders receiving recognition for their\nservice: These people are all leaders.\nA Brief History of Leadership Research\nRost (1991) writes that in the 20th century, over 200 definitions for leadership were proposed. Leadership research continues as scholars\nobserve, identify, and promote the emergence of new leadership styles and behaviors in the 21st century. A multitude of approaches have\nbeen used to identify and explain the complex factors that shape leadership and how it is practiced. These approaches include\nquantitative methods such as surveys, questionnaires, and diagnostic tests, as well as qualitative observational and ethnographic studies.\nThese theories evaluate the relationship of the leader to organizational members and examine styles of leadership, adding to the general\nknowledge of leader behavior and effectiveness.\nMichigan Leadership Studies in the 1950s and 1960s\nAs a leading center of social science research, the University of Michigan has produced some of the most important studies of leadership.\nStudies dating back to the 1950s identified two broad leadership styles: an employee orientation and a production orientation. The\nstudies also identified three critical characteristics of effective leaders: task-oriented behavior, relationship-oriented behavior, and\nparticipative leadership. The studies concluded that an employee orientation rather than a production orientation, coupled with general\ninstead of close supervision, led to better results. The Michigan leadership studies, along with the Ohio State University studies that took\nplace in the 1940s, are two of the best-known behavioral leadership studies and continue to be cited to this day.\nLeadership Model: The Ohio State University\nThe Ohio State University Leadership Study focused on identifying behaviors (as opposed to traits) that were indicative of a strong leader.\nLearning Objectives\nDistill the key people-oriented and task-oriented behaviors of effective leaders\nKey Takeaways\nKey Points\nThe core characteristics, behaviors, situations and traits that define good leaders area constant sources of study, analysis, and debate.\nTraditionally, leadership was defined from a trait-oriented perspective. In other words, certain characteristics were identified at the\nindividual level to determine good leaders.\nThe Ohio State University Leadership Study underscores two different behavioral views on leadership: people-oriented (consideration) and\ntask-oriented (initiating structure).\nKey Terms\ndelegation: The act of assigning tasks to other members of the team.\nOverview of Leadership\nLeadership is a field of study (and core ability) that focuses on the ability of an individual or group to \"lead\" or guide other teams, people,\nor even entire organizations. The evolution of the field of leadership is quite extensive, ranging from the following perspectives:\nTrait theories\nAttribute patterns\nBehavioral and style theories\nSituational and contingency theories\nFunctional theories\nIntegrated psychological theories\nTransactional and transformative theories\nLeader-member exchange theories\nEmotional intelligence\nEach of these schools of thought are facets of what modern leadership theories try to take into account today, as varying perspectives on\nleadership are useful to take into consideration the complex, global world of organizations.\nLeadership Grid: One perspective on leadership\nis balancing the well-being of the people who\nwork for you with the efficiency of task\ncompletion, as illustrated in this simple chart.\nThe Ohio State Leadership Studies touched upon\nthis concept.\nEarly Leadership Research\nEarly methods of research theory centered around trait theories. The basic premise was that certain characteristics of individuals were the\nideal indicator of success in a leadership role. In other words, for example, extroverted individuals with a highly developed sense of\nempathy, confidence, and decisiveness would make good leaders. As you may already be thinking, this perspective on leadership is\nsomewhat limiting, as there are various external factors and situational considerations one should consider when determining if a given\nindividual is a strong fit for leading a specific initiative or organization.\nThe Ohio State University Leadership Study\nWhile the concept of identifying good leaders based upon individual characteristics had some merit (which has been identified in later\nresearch), the Ohio State Leadership study was more interested in which specific behaviors effective leaders executed (compared to\nineffective leaders). This consideration and initiating structure of behavior yielded a number of interesting results.\nMethod\nA survey with 150 statements (narrowed down from nearly 2000 potential statements), which was titled the Leadership Behavior\nDescription Questionnaire, was delivered to leaders to identify what types of behaviors were most effective in leading. Nine specific\nbehaviors were identified and measured.\nConclusions\nThe results of this questionnaire identified two different groupings of four behaviors within the subtopics of consideration and initiating\nstructure.\nConsideration\nConsideration is the extent to which a leader exhibits concern for the welfare of the members of the group.\nWith a focus on interpersonal relationships, mutual trust and friendship, the consideration leadership style is people-oriented. This\nfocuses primarily on:\nBeing friendly and approachable\nMaintaining equality between leaders, team members, and stakeholders\nEnsuring the personal welfare of group members\nBeing accessible to group members\nInitiating Structure\nThe second behavioral element the study identified revolves around roles, objectives, activities, planning, and delegation. Unlike the\npeople-oriented style above, this is a task-oriented perspective that focuses on behaviors such as:\nSetting individual expectations\nMaintaining performance standards\nScheduling and planning tasks\nEnsuring the group maintains organizational expectations\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}