{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nThe Planning Process\nDefining Strategic Planning\nStrategic planning is concerned with defining company goals and determining the resources needed to achieve them.\nLearning Objectives\nAssess the definition of planning in context with strategy and the various planning process approaches\nKey Takeaways\nKey Points\nTo determine the direction of the organization, it is necessary to understand its current position and the possible avenues through which\nit can pursue a particular course of action.\nThere are many approaches to strategic planning, but typically either the situation-target-proposal approach or the draw-see-think- plan\napproach is used to generate a plan's structure.\nThe primary purpose of planning is to create universal buy-in and understanding of the objectives, and to put operational processes in\nplace to guide the organization towards their achievement.\nKey Terms\nallocate: To distribute according to a plan.\nplan: A set of intended actions, usually mutually related, through which one expects to achieve a goal.\nstrategy: A plan of action intended to accomplish a specific goal.\nStrategic planning is an organization's process of defining its strategy and making decisions on how to allocate resources to pursue that\nstrategy. To determine the direction of the organization, it is necessary to understand its current position and the possible avenues\nthrough which it can pursue a particular course of action. Strategic planning generally deals with at least one of three key questions:\nWhat do we do?\nFor whom do we do it?\nHow do we excel?\nIn many organizations, this is viewed as a process for determining where the organization is going over the next year or, more typically,\nthree to five years, although some extend their vision to 20 years. The last question—how do we excel?—is critical to achieving\ncompetitive advantage, and it should be answered clearly and practically in the planning process prior to extensive investment in\nresources.\nComponents of a Strategic Plan\nPlanning is concerned with defining goals for a company's future direction and determining the resources required to achieve those\ngoals. To meet the goals, managers will develop marketing and operational plans inclusive of key organizational values (vision, mission,\nculture, etc.).\nCommon components of a business plan include external and internal analyses, marketing and branding, investments, debt, resource\nallocation, suppliers, production processes, competition, and research and development. While different business models include different\ncomponents in their planning, based on unique organizational or industry needs, the central theme is that all aspects of the strategy\nshould be researched and discussed prior to incurring the costs of operations.\nBusiness plan: This image summarizes some of the factors\nthat should be considered in the creation of a business\nplan, such as a company's mission and purpose, personnel,\nfinancial resources, market and customer base,\ncompetition, and strengths and weaknesses.\nPlanning Process\nThere are many approaches to strategic planning, but typically one of the following approaches is used.\nSituation-Target-Proposal\nThis method involves the following steps:\nSituation: Evaluate the current situation and how it came about.\nTarget: Define goals and objectives (sometimes called ideal state).\nProposal: Map a possible route to the goals and objectives.\nDraw-See-Think-Plan\nThis method involves addressing the following questions:\nDraw: What is the ideal state or the desired end state?\nSee: What is today's situation? What is the gap between today's situation and the ideal state, and why?\nThink: What specific actions must be taken to close the gap between today's situation and the ideal state?\nPlan: What resources are required to execute these specific actions?\nBenefits of Strategic Planning: Focus, Action, Control, Coordination, and Time Management\nPlanning enables companies to achieve efficiency and accuracy by coordinating efforts and managing time effectively.\nLearning Objectives\nIdentify the critical benefits derived through utilizing business and marketing plans in strategic management\nKey Takeaways\nKey Points\nPlanning is a management process concerned with defining goals for a company's future direction and determining the resources\nrequired to achieve those goals. Managers may develop a variety of plans ( business plan, marketing plan, etc.) during the planning\nprocess.\nAchieving a vision requires coordinated efforts that adhere to a broader organizational plan. This is enabled through consistent strategies\nthat are supported by staff at all levels.\nPlanning enables increased focus on, and coordinated action toward, competitive strategies, while minimizing wasted time and ensuring\nthere are benchmarks for the control process.\nPlanning typically offers a unique opportunity for information-rich and productively focused discussions between the various managers\ninvolved. The plan and the discussions that arise from it provide an agreed context for subsequent management activities.\nKey Terms\ntime management: The management of time in order to make the most of it.\nbusiness plan: A summary of how a business owner, manager, or entrepreneur intends to organize an endeavor and implement activities\nnecessary and sufficient to achieve success.\nplanning: The act of formulating a course of action.\nThe planning process is concerned with defining a company's goals and determining the resources necessary to achieve those goals.\nAchieving a vision requires coordinated efforts that adhere to a broader organizational plan. This is enabled through consistent strategies\nthat are supported by staff at all levels. To meet business goals, managers develop business plans not only to reach targets but also to\nstrengthen and change public perception of the company's brand.\nIntegrated business plan: This business plan takes\naspects of a business and identifies clear goals for\neach: e.g., for the technology to move from being\nweak and non-integrated to enabling workflows,\nand for the business's focus to transition from being\ninwardly to outwardly focused.\nSince they have achieved defined goals through the planning process, managers and employees can focus and control their efforts and\ntheir resources, follow determined plans of action, coordinate activities between divisions, and use time management to meet specific\ngoals. Planning helps to achieve these goals or targets by efficiently and effectively using available time and resources. In short, planning,\nif executed properly, should lead to the following benefits:\nFocus\nThere are a wide variety of activities an organization (or the individuals within the organization) might viably pursue. While there is value\nin the pursuit of many activities, understanding which ones the organization should focus on to leverage organizational competencies and\nalign with market research requires careful planning and delegation. This is how planning achieves focus.\nCoordinated Action\nIf department A is reliant on inputs from department B, department A cannot utilize department B's work without coordination. If\ndepartment B has too much work and department A too little, there is poor interdepartmental coordination. This is alleviated through\ndetail-oriented planning processes.\nControl\nThe control process is based on benchmarks, which is to say that controlling requires a standard of comparison when viewing the actual\noperational results. Control relies on the planning process to set viable objectives, which can then be worked towards through controlling\noperations.\nTime Management\nTime management underlines the importance of maximizing the use of time to minimize the cost of production. If a full-time employee\ncan accomplish their work within 32 hours, the planning process can find meaningful use for their remaining time. Costs can be lowered\nand productivity increased by ensuring that each element in the operational process functions according to ideal time constraints.\nThe Process Itself\nPerhaps the most important benefit of developing business and marketing plans is the nature of the planning process itself. This typically\noffers a unique opportunity, a forum, for information-rich and productively focused discussions between the various managers involved.\nThe plan and the discussions that arise from it provide an agreed context for subsequent management activities, even those not\ndescribed in the plan itself.\nOverview of Inputs to Strategic Planning\nStrategic plans can take the form of business or marketing plans, and consultants and industry experts are used in their development.\nLearning Objectives\nReview the various tools for effective plan development, including stakeholder input, consultants, and data collection\nKey Takeaways\nKey Points\nIn most corporations, there are several levels of management, including the corporate, business, functional, and strategic levels.\nStrategic management is the highest of these levels in the sense that it is the broadest—it applies to all parts of the firm and incorporates\nthe longest time horizon.\nA marketing plan is a written document that details the actions necessary to achieve one or more marketing objectives.\nA business plan is a formal statement of a set of business goals, the reasons they are attainable, and the plan for reaching them.\nAvailable business resources for creating a plan include industry experts, consultants, and stakeholder input, which can help enable an\nobjective and comprehensive view of internal and external factors.\nKey Terms\ntactical planning: An organization's process of determining how to optimize current resources and operations.\nStrategy Hierarchy\nIn most corporations, there are several levels of management. Strategic management is the highest of these levels in the sense that it is\nthe broadest—it applies to all parts of the firm and incorporates the longest time horizon. It gives direction to corporate values, corporate\nculture, corporate goals, and corporate missions. Under the broad corporate strategy are business-level competitive strategies and\nfunctional unit strategies.\nCorporate strategy refers to the overarching strategy of the diversified firm.\nBusiness strategy refers to the aggregated strategies of a single business firm or a strategic business unit (SBU) in a diversified\ncorporation.\nFunctional strategies include marketing strategies, new-product development strategies, human resource strategies, financial strategies,\nlegal strategies, supply-chain strategies, and information-technology management strategies. The emphasis is on short-term and\nmedium-term plans and is limited to the domain of each department's functional responsibility. Each functional department attempts to\ndo its part to meet overall corporate objectives, so to some extent their strategies are derived from broader corporate strategies.\nMany companies feel that a functional organizational structure is not an efficient way to organize activities, so they often re-engineer\naccording to processes or SBUs. A strategic business unit is a semi-autonomous unit that is usually responsible for its own budgeting, new\nproduct decisions, hiring decisions, and price setting. An SBU is treated as an internal profit center by corporate headquarters.\nBusiness Plans\nA business plan is a formal statement of a set of business goals, the reasons they are attainable, and the plan for reaching them. It may\nalso contain background information about the organization or team attempting to reach those goals.\nFor example, a business plan for a nonprofit might discuss the fit between the business plan and the organization's mission. Banks are\nquite concerned about defaults, so a business plan for a bank loan will build a convincing case for the organization's ability to repay the\nloan. Venture capitalists are primarily concerned about initial investment, feasibility, and exit valuation. A business plan for a project\nrequiring equity financing will need to explain why current resources, upcoming growth opportunities, and sustainable competitive\nadvantage will lead to a high exit valuation.\nPreparing a business plan draws on a wide range of knowledge from many different business disciplines: finance, human resource\nmanagement, intellectual-property management, supply-chain management, operations management, and marketing. It can be helpful to\nview the business plan as a collection of subplans, one for each of the main business disciplines.\nMarketing Plans\nA marketing plan is a written document that details the actions necessary to achieve one or more marketing objectives. It can be for a\nproduct, a service, a brand, or a product line. Marketing plans span between one and five years.\nA marketing plan may be part of an overall business plan. Solid strategy is the foundation of a well-written marketing plan, and one way\nto achieve this is by using a method known as the seven Ps (product, place, price, promotion, physical environment, people, and process).\nA product-oriented company may use the seven Ps to develop a plan for each of its products. A market-oriented company will\nconcentrate on each market. Each will base its plans on the detailed needs of its customers and on the strategies chosen to satisfy those\nneeds.\nThe seven Ps: In marketing, the general process of\nidentifying and approaching a target market is captured\nthrough the seven Ps: Place, Price, Promotion, People,\nProcess, Physical Evidence, and Product.\nTools for Planning\nOften discussed in tools for planning are models that measure the internal and external environments (e.g. Porter's Five Forces, SWOT,\nValue Chain, etc.). These models create forward-looking projections based on past and present data; therefore, they are useful only once\nenough data have been collected. Because of this, tools for planning largely focus on generating enough data to construct valid\nrecommendations. These tools can include:\nIndustry experts: Whether internal employees or external consultants, a few individuals with extensive experience in a given industry are\nvaluable resources in the planning process. These industry experts can move beyond the PESTEL and Porter's Five Forces frameworks,\nmaking intuitive leaps as to the trajectory of the industry.\nConsultants: Consultants are commonly brought in during strategy formulation and for a variety of other reasons. Most important of\nthese would be providing an objective lens for internal affairs. It is difficult to see the whole house from inside the house, and upper\nmanagement can utilize an external opinion to ensure they are seeing operations clearly and objectively.\nInclusion of stakeholders: Upper management will want as much information as possible from everyone involved. Some examples include\nconsumer surveys on satisfaction, supplier projections for costs over a given time frame, consumer inputs on needs still unfilled, and\nshareholder views. The inclusion of stakeholders offers a variety of tools, each of which may or may not be a useful input depending on\nthe context of the plan.\nResponding to Uncertainty in Strategic Planning\nUncertainty exists when there is more than one possible outcome; it is best managed using scenario-planning tools.\nLearning Objectives\nRecognize the inevitability of uncertainty in strategic planning, alongside planning for effective responses to these uncertainties\nKey Takeaways\nKey Points\nStrategic management is having a clear view, based on the best available evidence and on defensible assumptions, of what is possible to\naccomplish within the constraints of a given set of circumstances.\nInitial ideas about corporate objectives may have to be altered if there is no feasible implementation plan that will meet with a sufficient\nlevel of acceptance among stakeholders, or if the necessary resources are not available, or both.\nScenario planning starts by separating things believed to be known, at least to some degree, from those considered uncertain or\nunknowable.\nKey Terms\nuncertainty: A state of having limited knowledge such that it is impossible to exactly describe an existing state or future outcomes or to\ndetermine which of several possible outcomes will happen.\ntactical planning: An organization's process of determining how to optimize current resources and operations.\nqualitative: Described in terms of characteristics and attributes rather than numbers and quantities.\nUncertainty\nManagement specialists define uncertainty as a state of having limited knowledge such that it is impossible to exactly describe an existing\nstate or future outcomes or to determine which of several possible outcomes will happen. It is still possible, however, to measure\nuncertainty—by assigning a probability to each possible state or outcome to estimate its likelihood.\nIn the past, strategic plans have often considered only the \"official future,\" which was usually a straight-line graph of current trends\ncarried into the future. Often the trend lines were generated by the accounting department and lacked discussions of demographics or\nqualitative differences in social conditions. These simplistic guesses can be good in some ways, but they fail to consider qualitative social\nchanges that can affect an organization.\nInstead of just following trend lines, scenarios focus on the collective impact of many factors. Scenario planning helps to understand how\nthe various strands of a complex tapestry move if one or more threads are pulled. A list of possible causes, like a fault-tree analysis, tends\nto downplay the impact of isolated factors. When factors are explored together, certain combinations magnify the impact or likelihood of\nother factors. For instance, an increased trade deficit may trigger an economic recession, which in turn creates unemployment and\nreduces domestic production.\nFault tree: Fault trees can help outline possible\noutcomes. This fault tree visually lays out all the\ndifferent steps at which something could go wrong\nin a spacecraft's flight, from the spacecraft itself\nspinning too fast to motor failure to a valve being\nstuck open.\nResponding to Uncertainty\nOrganizations need to cope with issues that are too complex to be fully understood, yet significant decisions need to be made that are\nbased on a limited understanding or limited information. There are several ways of dealing with this.\nBe Iterative\nThe process of developing organizational strategy must be iterative. That is, it should involve toggling back and forth between questions\nabout objectives, implementation planning, and resources. For example, an initial plan for a project may have to be adjusted if the budget\nchanges.\nUse Scenario Planning\nScenario planning starts by separating things believed to be known, at least to some degree, from those considered uncertain or\nunknowable. The first component, knowledge, includes trends, which cast the past forward, recognizing that the world possesses\nconsiderable momentum and continuity. The second component, uncertainties, involves indeterminable factors such as future interest\nrates, outcomes of political elections, rates of innovation, fads in markets, and so on. The art of scenario planning lies in blending the\nknown and the unknown into a limited number of internally consistent views of the future that span a very wide range of possibilities.\nNumerous organizations have applied scenario planning to a broad range of issues, from relatively simple, tactical decisions to the\ncomplex process of strategic planning and vision building. Scenario planning for business was originally established by Royal Dutch/Shell,\nwhich has used scenarios since the early 1970s as part of its process for generating and evaluating strategic options. Shell has been\nconsistently better in its oil forecasts than other major oil companies, and predicted the overcapacity in the tanker business and Europe's\npetrochemicals earlier than its competitors.\nAccept Uncertainty\nIt serves little purpose to pretend to anticipate every possible consequence of a corporate decision, every possible constraining or\nenabling factor, and every possible point of view. What matters for the purposes of strategic management is having a clear view, based on\nthe best available evidence and on defensible assumptions, of what is possible to accomplish within the constraints of a given set of\ncircumstances. As the situation changes, some opportunities for pursuing objectives will disappear and others will arise. Some\nimplementation approaches will become impossible, while others, previously impossible or unimagined, will become viable. Strategic\nmanagement adds little value, and may do harm, if organizational strategies are designed to be used as detailed and infallible blueprints\nfor managers.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}