{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Structure\nCommon Organizational Structures\nFunctional Structure\nAn organization with a functional structure is divided based on functional areas, such as IT, finance, or marketing.\nLearning Objectives\nExplain the functional structure within the larger context of organizational structures in general\nKey Takeaways\nKey Points\nA functional organization is a common type of organizational structure in which the organization is divided into smaller groups based on\nspecialized functional areas, such as IT, finance, or marketing.\nFunctional departmentalization arguably allows for greater operational efficiency because employees with shared skills and knowledge\nare grouped together by function.\nA disadvantage of this type of structure is that the different functional groups may not communicate with one another, potentially\ndecreasing flexibility and innovation. A recent trend aimed at combating this disadvantage is the use of teams that cross traditional\ndepartmental lines.\nKey Terms\nsilo: In business, a unit or department within which communication and collaboration occurs vertically, with limited cooperation outside\nthe unit.\ndepartmentalization: The organization of something into groups according to function, geographic location, etc.\nOverview of the Functional Structure\nAn organization can be arranged according to a variety of structures, which determine how the organization will operate and perform. In\na functional structure, a common configuration, an organization is divided into smaller groups by areas of specialty (such as IT, finance,\noperations, and marketing). Some refer to these functional areas as \" silos \"—entities that are vertical and disconnected from each other.\nCorrespondingly, the company's top management team typically consists of several functional heads (such as the chief financial officer\nand the chief operating officer). Communication generally occurs within each functional department and is transmitted across\ndepartments through the department heads.\nFunctional structure at FedEx: This organizational chart shows a\nbroad functional structure at FedEx. Each different functions (e.g., HR,\nfinance, marketing) is managed from the top down via functional heads\n(the CFO, the CIO, various VPs, etc.).\nAdvantages of a Functional Structure\nFunctional departments arguably permit greater operational efficiency because employees with shared skills and knowledge are grouped\ntogether by functions performed. Each group of specialists can therefore operate independently with management acting as the point of\ncross-communication between functional areas. This arrangement allows for increased specialization.\nDisadvantages of a Functional Structure\nA disadvantage of this structure is that the different functional groups may not communicate with one another, potentially decreasing\nflexibility and innovation. Functional structures may also be susceptible to tunnel vision, with each function perceiving the organization\nonly from within the frame of its own operation. Recent trends that aim to combat these disadvantages include the use of teams that\ncross traditional departmental lines and the promotion of cross-functional communication.\nFunctional structures appear in a variety of organizations across many industries. They may be most effective within large corporations\nthat produce relatively homogeneous goods. Smaller companies that require more adaptability and creativity may feel confined by the\ncommunicative and creative silos functional structures tend to produce.\nDivisional Structure\nDivisional structures group various organizational functions into product or regional divisions.\nLearning Objectives\nDescribe the basic premise behind divisional structures within the general framework of organizational structure\nKey Takeaways\nKey Points\nThe divisional structure is a type of organizational structure that groups each organizational function into a division. These divisions can\ncorrespond to either products or geographies.\nEach division contains all the necessary resources and functions within it to support that product line or geography (for example, its own\nfinance, IT, and marketing departments).\nA multidivisional form (or \"M-form\") is a legal structure in which one parent company owns subsidiary companies, each of which uses the\nparent company's brand and name.\nThe divisional structure is useful because failure of one division doesn't directly threaten the other divisions. In the multidivisional\nstructure, the subsidiaries benefit from the use of the brand and capital of the parent company.\nDisadvantages of divisional structure can include operational inefficiencies from separating specialized function. For the multidivisional\nstructure, disadvantages can include increased accounting and taxes.\nKey Terms\nparent company: An entity that owns or controls another entity.\ndivision: A section of a large company.\nsubsidiary: A company owned by a parent company or holding company.\nDivisional Structure Overview\nOrganizations can be structured in various ways, with each structure determining the manner in which the organization operates and\nperforms. A divisional organization groups each organizational function into a division.\nU.S. Department of Energy organization chart: The DOE organization\nchart shows a divisional structure with different divisions under each of\nthree under-secretaries for energy. Each of the three division is in charge of\na different set of tasks: environmental responsibilities, nuclear-energy\nresponsibilities, or research responsibilities.\nDivisional Strategies\nEach division within this structure can correspond to either products or geographies of the organization. Each division contains all the\nnecessary resources and functions within it to support that particular product line or geography (for example, its own finance, IT, and\nmarketing departments). Product and geographic divisional structures may be characterized as follows:\nProduct departmentalization : A divisional structure organized by product departmentalization means that the various activities related to\nthe product or service are under the authority of one manager. If the division builds luxury sedans or SUVs, for example, the SUV division\nwill have its own sales, engineering, and marketing departments distinct from those departments within the luxury sedan division.\nGeographic departmentalization: Geographic departmentalization involves grouping activities based on geography, such as an Asia/Pacific\nor Latin American division. Geographic departmentalization is particularly important if tastes and brand responses differ across regions, as\nit allows for flexibility in product offerings and marketing strategies (an approach known as localization).\nA common legal structure known as the multidivisional form (or \"M-form\") also uses the divisional structure. In this form, one parent\ncompany owns subsidiary companies, each of which uses its brand and name. The whole organization is ultimately controlled by central\nmanagement; however, most decisions are left to autonomous divisions. This business structure is typically found in companies that\noperate worldwide—for example, Virgin Group is the parent company of Virgin Mobile and Virgin Records.\nAdvantages of a Divisional Structure\nAs with all organizational structure types, the divisional structure offers distinct advantages and disadvantages. Generally speaking,\ndivisions work best for companies with wide variance in product offerings or regions of geographic operation. The divisional structure can\nbe useful because it affords the company greater operational flexibility. In addition, the failure of one division does not directly threaten\nthe other divisions. In the multidivisional structure, subsidiaries benefit from the use of the brand and capital of the parent company.\nDisadvantages of a Divisional Structure\nSome disadvantages of this structure include operational inefficiencies from separating specialized functions—for example, finance\npersonnel in one division do not communicate with those in another division. Disadvantages of the multidivisional structure can include\nincreased accounting and tax implications.\nMatrix Structure\nThe matrix structure is a type of organizational structure in which individuals are grouped via two operational frames.\nLearning Objectives\nIllustrate the way two different operational perspectives can be crossed in a matrix structure to organize a company\nKey Takeaways\nKey Points\nThe matrix structure is a type of organizational structure in which individuals are grouped simultaneously by two different operational\nperspectives.\nMatrix structures are inherently complex and versatile, making them more appropriate for large companies operating across different\nindustries or geographic regions.\nProponents suggest that matrix management is more dynamic than functional management in that it allows team members to share\ninformation more readily across task boundaries; it also allows for specialization that can increase depth of knowledge.\nA disadvantage of the matrix structure is the increased complexity in the chain of command, which can lead to a higher manager-to-\nworker ratio and contribute to conflicting loyalties among employees.\nKey Terms\nmatrix: A two-dimensional array.\nOverview of the Matrix Structure\nOrganizations can be structured in various ways, and the structure of an organization determines how it operates and performs. The\nmatrix structure is a type of organizational structure in which individuals are grouped by two different operational perspectives\nsimultaneously; this structure has both advantages and disadvantages but is generally best employed by companies large enough to\njustify the increased complexity.\nMatrix organizational structure: In a matrix structure,\nthe organization is grouped by both product and\nfunction. Product lines are managed horizontally and\nfunctions are managed vertically. This means that each\nfunction—e.g., research, production, sales, and finance\n—has separate internal divisions for each product.\nIn matrix management, the organization is grouped by any two perspectives the company deems most appropriate. Common\norganizational perspectives include function and product, function and region, or region and product. In an organization grouped by\nfunction and product, for example, each product line will have management that corresponds to each function. If the organization has\nthree functions and three products, the matrix structure will have nine (\n3 × 3\n) potential managerial interactions. This example illustrates how inherently complex matrix structures are in comparison to other, more\nlinear structures.\nAdvantages of a Matrix Structure\nProponents of matrix management suggest that this structure allows team members to share information more readily across task\nboundaries, countering the \"silo\" critique of functional management. Matrix structures also allow for specialization that can both increase\ndepth of knowledge and assign individuals according to project needs.\nDisadvantages of a Matrix Structure\nA disadvantage of the matrix structure is the increased complexity in the chain of command when employees are assigned to both\nfunctional and project managers. This increase in complexity can result in a higher manager-to-worker ratio, which can in turn increase\ncosts or lead to conflicting employee loyalties. It can also create a gridlock in decision making if a manager on one end of the matrix\ndisagrees with another manager. Blurred authority in a matrix structure can result in reduced agility in decision making and conflict\nresolution.\nMatrix structures should generally only be used when the operational complexity of the organization demands it. A company that\noperates in various regions with various products may require interaction between product development teams and geographic\nmarketing specialists—suggesting a matrix may be applicable. Generally speaking, larger companies with a need for a great deal of cross-\ndepartmental communication benefit most from this model.\nTeam-Based Structure\nThe team structure is a newer, less hierarchical organizational structure in which individuals are grouped into teams.\nLearning Objectives\nClassify team-based structures within the larger context of the most common organizational structures\nKey Takeaways\nKey Points\nThe team structure in large organizations is a newer type of organizational structure. A team should be a group of workers, with\ncomplementary skills and synergistic efforts, all working toward a common goal.\nAn organization may have several teams that can change over time. Teams that include members from different functions are known as\ncross- functional teams.\nAlthough teams are characterized as less hierarchical, they typically still include a management structure (or management team).\nCritics argue that the use of the word \"team\" to describe modern organizational structures is a fad—that some teams are not really teams\nat all but merely groups of staff.\nOne aspect of team-based structures likely to persist indefinitely is the integration of team cultures within an broader structure (such as a\nfunctional structure with interspersed teams).\nKey Terms\nsynergistic: Cooperative, working together, interacting, mutually stimulating.\nhierarchical: Classified or arranged according to various criteria into successive ranks or grades.\nOverview of the Team-Based Structure\nOrganizations can be structured in various ways, and the structure of an organization determines how it operates and performs. The team\nstructure in large organizations is considered a newer type of organization that is less hierarchical, less structured, and more fluid than\ntraditional structures (such as functional or divisional). A team is a group of employees—ideally with complementary skills and synergistic\nefforts—working toward a common goal. Teams are created by grouping employees in a way that generates a variety of expertise and\naddresses a specific operational component of an organization. These teams can change and adapt to fulfill group and organizational\nobjectives.\nSome teams endure over time, while others—such as project teams—are disbanded at the project's end. Teams that include members\nfrom different functions are known as cross-functional teams. Although teams are described as less hierarchical, they typically still include\na management structure.\nCritics argue that the use of the word \"team\" to describe modern organizational structures is a fad; according to them, some teams are\nnot really teams at all but rather groups of staff. That said, team-building is now a frequent practice of many organizations and can\ninclude activities such as bonding exercises and even overnight retreats to foster team cohesion. To the extent that these exercises are\nmeaningful to employees, they can be effective in improving employee motivation and company productivity.\nIntegration with Other Structures\nOne aspect of team-based structures that will likely persist indefinitely is the integration of team cultures within an broader structure (e.g.,\na functional structure with teams interspersed). Such integration allows for the authority and organization of a more concrete structure\nwhile at the same time capturing the cross-functional and projected-oriented advantages of teams.\nFor example, imagine Proctor and Gamble brings together a group of employees from finance, marketing, and research and development\n—all representing different geographic regions. This newly created team is tasked with the project of creating a laundry detergent that is\nconvenient, economic, and aligned with the company's manufacturing capabilities. The project team might be allocated a certain number\nof hours a month to devote to team objectives; however, members of the team are still expected to work within their respective functional\ndepartments.\nNetwork Structure\nIn the network structure, managers coordinate and control relationships with the firm that are both internal and external.\nLearning Objectives\nIdentify the structural implications of a network-based organizational design\nKey Takeaways\nKey Points\nThe network structure is a newer type of organizational structure viewed as less hierarchical (i.e., more \"flat\"), more decentralized, and\nmore flexible than other structures.\nIn a network structure, managers coordinate and control relationships that are both internal and external to the firm.\nThe concept underlying the network structure is the social network—a social structure of interactions. Open communication and reliable\npartners (both internally and externally) are key components of social networks.\nProponents argue that the network structure is more agile than other structures. Because it is decentralized, a network organization has\nfewer tiers, a wider span of control, and a bottom-up flow of decision making and ideas.\nA disadvantage of the network structure is that this more fluid structure can lead to more complex relations in the organization.\nKey Terms\nnetwork: Any interconnected group or system.\ndecentralized: Diffuse; having no center or several centers.\nagile: Apt or ready to move; nimble; active.\nOverview of the Network Structure\nAn organization can be structured in various ways that determine how it operates and performs. The network structure is a newer type of\norganizational structure often viewed as less hierarchical (i.e., more flat), more decentralized, and more flexible than other structures. In\nthis structure, managers coordinate and control relations that are both internal and external to the firm.\nThe concept underlying the network structure is the social network—a social structure of interactions. At the organizational level, social\nnetworks can include intra-organizational or inter-organizational ties representing either formal or informal relationships. At the industry\nlevel, complex networks can include technological and innovation networks that may span several geographic areas and organizations.\nFrom a management perspective, the network structure is unique among other organizational structures that focus on the internal\ndynamics within the firm.\nA network organization sounds complex, but it is at its core a simple concept. Take, for example, a T-shirt design company. Because the\ncompany leaders are mainly interested in design, they may not want to get too heavily involved in either manufacturing or retail; however,\nboth aspects of the business are necessary to complete their operations. To maintain control of their product, they may rent retail space\nthrough their network and purchase production capabilities from a variety of partner organizations that have their own manufacturing\nfacilities. While the core company focuses mainly on designing products and tracking finances, this network of partnerships enables it to\nbe much more than just a design operation.\nLike other organizational structures, the network structure has its advantages and its disadvantages.\nAdvantages of a Network Structure\nProponents argue that the network structure is more agile compared to other structures (such as functional areas, divisions, or even some\nteams). Communication is less siloed and flows freely, possibly opening up more opportunities for innovation. Because the network\nstructure is decentralized, it has fewer tiers in its organizational makeup, a wider span of control, and a bottom-up flow of decision\nmaking and ideas.\nDisadvantages of a Network Structure\nOn the other hand, this more fluid structure can lead to a more complex set of relationships in the organization. For example, lines of\naccountability may be less clear, and reliance on external vendors can be quite high. These potentially unpredictable variables essentially\nreduce the core company's control over its operational success.\nModular Structure\nIn the modular structure, an organization focuses on developing specialized and relatively autonomous strategic business units.\nLearning Objectives\nDefine the nature and value of a modular structure in an organizational framework\nKey Takeaways\nKey Points\nThe modular structure divides the business into small, tightly knit strategic business units ( SBUs ),which focus on specific elements of the\norganizational process.\nInterdependencies between modules tends to be weak; however, flexibility is extremely high.\nAn advantage of the modular structure is that loosely coupled structures enable organizations to be more flexible and restructure more\neasily. For example, a firm can switch between different providers and thus respond more quickly to different market needs.\nIncreased internalization and more tightly coupled structures can produce better communication and intellectual property gains. As a\nresult, some argue that the modularity of a firm should be limited to the extent the flexibility it affords results in gains.\nVarious degrees of modularity are possible; however, a business must be consistent in the degree of modularity it employs.\nKey Terms\ndisaggregation: A division or breaking up into constituent parts, particularly categories which have been lumped together.\nmodular: Consisting of separate units, especially where each unit performs a specified function and could be replaced by a similar unit for\nthe same function, independently of other units.\nOverview of the Modular Structure\nOrganizations can be structured in various ways that determine how the organization operates and performs. The modular structure\nfocuses on dividing the business into small, tightly knit strategic business units (SBUs), which focus on specific elements of the\norganizational process. Interdependence among the units is limited because the focus of many SBUs is more inward than outward and\nbecause loyalty within SBUs tends to be very strong.\nThe term modularity is widely used in studies of technological and organizational systems. Product systems are deemed modular when\nthey can be broken down into a number of components that can then be mixed and matched to connect, interact, or exchange resources.\nModularization within organizations leads to the disaggregation of the traditional form of hierarchical governance into relatively small,\nautonomous organizational units (modules). Although modules are not generally interdependent, the modular organization is extremely\nflexible.\nFor example, a firm that employs contract manufacturing rather than in-house manufacturing is using an organizational component that\nis more independent. The firm can switch between different contract manufacturers that perform different functions; the contract\nmanufacturer can similarly work for different firms. Another (more internally focused) modular model involves the existence of various\nconsumer services which cater to dramatically different needs or demographics. At GNU Health, for example, the surgery unit may interact\nwith different departments at different times for different reasons.\nModular organizations: A modular organization involves several\nlargely independent bodies that can rearrange and work with\ndifferent other departments as needed. This image shows the GNU\nhealth module interacting with many different departments, such as\noncology, radiology, surgery and pediatrics, across many contexts,\nsuch as location and socioeconomic status.\nAdvantages of a Modular Structure\nOne advantage of the modular structure is that loosely coupled structures can enable organizations to be more flexible and restructure\nmore easily. For example, a firm can switch between different providers and thus respond more quickly to different market needs. An\norganization can also fill its own corporate needs internally by creating a new modular department, which can operate interdependently\nwith the whole.\nDisadvantages of a Modular Structure\nOn the other hand, more internalization and more tightly coupled structures can produce better communication and intellectual property\ngains. As a result, critics of the modular organization argue that a firm's modularity should be limited to the extent that its flexible nature\naffords gains. Various degrees of modularity are possible but not necessarily useful if the pros do not outweigh the cons. Managers must\ncarefully consider whether or not a modular structure would be useful, either entirely or partially, for a given organization.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}