{
    "text": "Search... Home Subjects\nBoundless Management\nGroups, Teams, and Teamwork\nBuilding Successful Teams\nSetting Team Goals and Providing Team Feedback\nPeriodic performance assessments help a team identify areas for improvement so it can better achieve its goals.\nLearning Objectives\nApply effective performance management procedures to the process of goal setting and feedback\nKey Takeaways\nKey Points\nHow a team functions is as important an indicator of its performance as the quality of what it produces.\nPeriodic assessments help a team identify its strengths and weakness and create plans to improve how members work together.\nMethods of collecting assessment data include discussions, surveys, and personality diagnostic tests.\nKey Terms\nperformance: The act of performing; carrying into execution or action; achievement; accomplishment.\nimplement: To bring about; to put into practice.\nfeedback: Critical assessment of information produced.\nSetting Goals and Providing Feedback\nThe way team members function as a group is as important to the team's success as the quality of what it produces. Because how they\nwork together is so important to achieving the team's goals, members need to be attentive to how they interact and collaborate with\neach other. Periodic self-assessments that consider the team's progress, how it has gotten there, and where it is headed allow the team to\ngauge its effectiveness and take steps to improve its performance.\nTo assess its performance, a team seeks feedback from group members to identify its strengths and its weaknesses. Feedback from the\nteam assessment can be used to identify gaps between what it needs to do to perform effectively and where it is currently. Once they\nhave identified the areas for improvement, members of the team and others (such as managers) can develop a plan to close the gaps.\nA team can gather the necessary data by holding a meeting in which members discuss what has gone well and what they would like to\nchange about how they work together. It can be beneficial to have a non–team member such as a supervisor or a member of the human\nresources department solicit opinions through a brief written survey. The team can then use the results as a starting point for its\ndiscussion.\nPoor communication and conflict can disrupt a team's performance, and sometimes these disruptions are caused by personality clashes\nbetween members. Another type of team assessment involves using diagnostic tests to identify the dominant personality traits of each\nmember. Characteristics such as being an extrovert or an introvert can shape how people prefer to work and communicate. Having an\nunderstanding of personality differences among team members can prove useful for changing how they interact with each other.\nAccountability in Teams\nAccountability is the acknowledgment and assumption of responsibility for actions, products, decisions, and policies.\nLearning Objectives\nIllustrate the concept of accountability in a team-based work environment\nKey Takeaways\nKey Points\nAccountability is the assignment of responsibility for outcomes to an individual or group to create an incentive for performance.\nTeams are accountable for achieving collective goals.\nIndividual team members are accountable to each other for their effort and contributions to the team.\nEffective accountability for teams relies on making choices that support the team's ability to succeed.\nKey Terms\naccountability: The acknowledgment and assumption of responsibility for actions, products, and decisions.\nAccountability\nAccountability is the acknowledgment and assumption of responsibility for actions, products, and decisions. In a management context,\naccountability explicitly identifies who is responsible for ensuring that outcomes meet goals and creates incentives for success.\nFor teams in particular, accountability means that all members share responsibility for their collective output and for their success in\nachieving their goals. Because teamwork is organized at the collective level rather than on a per-person basis, its results are the sum of\neach member's efforts. Organizations often use team-based rewards to hold teams accountable for their work.\nAccountability for team members also implies that individuals have a responsibility to each other to complete tasks and contribute to the\ngroup effort. One benefit of teamwork is the mutual support and assistance that team members can provide each other. A sense of\naccountability to the team creates an incentive for individuals to provide help when needed. Since team tasks are interdependent, the\nquality of one person's work affects that of the others. Teams use norms and other forms of social pressure to hold one another\naccountable.\nConditions for Effective Accountability\nFor accountability to work, teams need to have the resources, skills, and authority to do what they are being held responsible for. If\nleaders expect teams to accept the blame for failing to achieve an assigned goal, they should ensure that success is within the team's\nreach. For this reason, the choices made about goal-setting, team composition, and process design have a direct effect on the degree of\nresponsibility a team can assume for its performance.\nGovernment accountability: Governing\nauthorities have the obligation to report, explain,\nand answer for resulting consequences of their\nactions.\nChoosing Team Size and Team Members\nTeam size and composition affect team processes and outcomes.\nLearning Objectives\nJustify the importance of drafting a team that reflects a manageable size and conducive skill sets\nKey Takeaways\nKey Points\nThe optimal size and composition of teams will vary depending on the team's purpose and goals.\nTeam size should take into account the scope and complexity of required tasks and activities.\nAs a whole, team members should bring all the necessary skills and knowledge to meet the team's goals.\nKey Terms\nComposition: The proportion of different parts to make a whole.\nTeam size and composition affect team processes and outcomes. The optimal size and composition of teams depends on the scope of the\nteam's goals. With too few people, a team will not have the resources and skills it needs to complete its tasks. Too many members can\nmake communication and coordination difficult and lead to poor team performance.\nResearch shows that teams perform best with between five and nine members. Dr. Meredith Belbin did extensive research on teams prior\nto 1990 in the UK that suggested that the optimum team size is eight roles plus a specialist as needed. Fewer than five members resulted\nin decreased perspectives and diminished creativity. Membership in excess of twelve resulted in increased conflict and greater potential of\nsubgroups forming that can disrupt team cohesion.\nThe mix of knowledge and expertise on a team is also important. Individuals should be selected for teams so that as a whole the group\nhas all the expertise needed to achieve its goals. For this reason, cross-functional teams may be larger than groups formed to work on\nless complex activities. Similarly, a task force charged with making recommendations in a short time frame would benefit from having\nfewer members.\nTeams benefit from similarities in background among members, which can reduce conflict and miscommunication. Having fewer\ndifferences can also reduce the amount of time a team takes to become an effective working group since there is less need to adjust\nindividual work styles. On the other hand, more diversity in skills and experience brings broader perspectives and different approaches to\nthe team's work. Having members with different skill sets also reduces redundancies and allows for the more efficient assignment of\npeople to various teams.\nTeam Building\nTeam building is an approach to helping a team become an effective performing unit.\nLearning Objectives\nIdentify how to achieve team success and the underlying value of team building from a broader organizational perspective\nKey Takeaways\nKey Points\nTeam building refers to a wide range of activities intended to help a team become an effective performing unit by increasing members'\nawareness of how they interact with each other.\nTeam building is important as a team is being formed and can also be valuable after a team has begun its work.\nActivities that facilitate team building include introductory meetings, collaborative games, simulations, and retreats.\nKey Terms\nteam: A group of people linked in a common purpose.\nretreat: An event during which people shift focus from their daily routines and responsibilities to personal or group development.\nTeam building refers to a wide range of activities intended to help a team become an effective performing unit. To achieve this, team\nbuilding aims to increase team members' awareness and understanding of their working relationships by focusing on their interactions\nwith each other. The purpose is to create a cohesive group from a set of individuals and avoid common pitfalls that can undermine a\nteam, such as conflict, miscommunication, and lack of trust.\nTeam-building activities require the participation of all team members. These often take place when a team is first created and can include\nactivities such as the team working on a brief exercise to begin the process of collaboration or individuals simply introducing themselves.\nSometimes organizations use more intensive and time-consuming activities such as off-site, day-long retreats with an agenda that can\ninclude interpersonal bonding exercises, simulations, personality and communication style assessments, and group-dynamics games. The\nhuman resources department may coordinate team building, though sometimes companies hire consultants or trainers skilled in\nfacilitating those types of activities.\nA team can also benefit from team building after its work has begun. Sometimes teams recognize that members are missing abilities that\nmake collaboration easier, such as problem solving or conflict-resolution skills. Training sessions that address these deficiencies build the\nteam's ability to work together. After people have been working together for a while, social norms can develop that interfere with a\nteam's performance. Individuals might be afraid to challenge decisions if it has become unacceptable to question a team's leader, or work\nhabits such as tardiness to meetings may have become commonplace. A discussion among team members creates an opportunity to\naddress factors that are standing in the way of their working together effectively.\nStages of Team Development\nThe Forming–Storming–Norming–Performing model of group development was first proposed by Bruce Tuckman in 1965.\nLearning Objectives\nEvaluate each of the stages in team development for opportunities, threats and strategy\nKey Takeaways\nKey Points\nTeams move through a series of four phases—from when they are formed to when their work is complete.\nDuring the forming stage, a the team discusses it purpose, defines and assigns tasks, establishes timelines, and begins forming personal\nrelationships.\nThe often-contentious storming stage is the period when team members clarify their goals and the strategy for achieving them.\nThe norming stage is when the team establishes its values for how individuals will interact and collaborate.\nPerforming is the stage of team development when team members have productive relationships and are able to communicate and\ncoordinate effectively and efficiently.\nWhile teams move through the four stages in sequence, the phases may overlap or be repeated.\nKey Terms\nforming: The stage of group development when the team discusses its purpose, defines and assigns tasks, establishes timelines, and\nbegins forming personal relationships.\nperforming: The stage of group development when team members have productive relationships and are able to communicate and\ncoordinate effectively and efficiently.\nstorming: The stage of group development when the team clarifies its goals and its strategy for achieving them.\nnorming: The stage of group development when the team establishes its values for how individuals will interact and collaborate.\nTeams move through a series of stages, beginning when they are formed and ending when they are disbanded. Bruce Tuckman identified\nfour distinct phases of team development: forming, storming, norming, and performing. Each has a primary purpose and a common set of\ninterpersonal dynamics among team members. Tuckman proposed that all are inevitable and even necessary parts of a successful team's\nevolution.\nThe Forming Stage\nThe first step in a team's life is bringing together a group of individuals. Individuals focus on defining and assigning tasks, establishing a\nschedule, organizing the team's work, and other start-up matters. In addition to focusing on the scope of the team's purpose and how to\napproach it, individuals in the formation stage are also gathering information and impressions about each other. Since people generally\nwant to be accepted by others, during this period they usually avoid conflict and disagreement. Team members may begin to work on\ntheir tasks independently, not yet focused on their relationships with fellow team members.\nJets in formation: All teams go through a life-\ncycle of stages, identified by Bruce Tuckman as:\nforming, storming, norming, and performing.\nThe Storming Stage\nOnce their efforts are under way, team members need clarity about their activities and goals, as well as explicit guidance about how they\nwill work independently and collectively. This leads to a period known as storming—because it can involve brainstorming ideas and also\nbecause it usually causes disruption. During the storming stage members begin to share ideas about what to do and how to do it that\ncompete for consideration. Team members start to open up to each other and confront one another's ideas and perspectives.\nBecause storming can be contentious, members who are averse to conflict will find it unpleasant or even painful. This can decrease\nmotivation and effort by drawing attention away from tasks. In some cases storming (i.e., disagreements) can be resolved quickly. Other\ntimes a team never leaves this stage and becomes stuck and unable to do its work. Patience and consideration toward team members and\ntheir views go a long way toward avoiding this.\nThe Norming Stage\nSuccessfully moving through the storming stage means that a team has clarified its purpose and strategy for achieving its goals. It now\ntransitions to a period focused on developing shared values about how team members will work together. These norms of collaboration\ncan address issues ranging from when to use certain modes of communication, such as e-mail versus telephone, to how team meetings\nwill be run and what to do when conflicts arise. Norms become a way of simplifying choices and facilitating collaboration, since members\nhave shared expectations about how work will get done.\nThe Performing Stage\nOnce norms are established and the team is functioning as a unit, it enters the performing stage. By now team members work together\neasily on interdependent tasks and are able to communicate and coordinate effectively. There are fewer time-consuming distractions\nbased on interpersonal and group dynamics. For this reason, motivation is usually high and team members have confidence in their ability\nto attain goals.\nWhile these four stages—forming, storming, norming, and performing—are distinct and generally sequential, they often blend into one\nanother and even overlap. A team may pass through one phase only to return to it. For example, if a new member joins the team there\nmay be a second brief period of formation while that person is integrated. A team may also need to return to an earlier stage if its\nperformance declines. Team-building exercises are often done to help a team through its development process.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}