{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Theory\nBehavioral Perspectives\nThe Behavioral-Science Approach\nBehavioral science uses research and the scientific method to determine and understand behavior in the workplace.\nLearning Objectives\nDefine the behavioral approaches which maximize potential within a company or organization\nKey Takeaways\nKey Points\nBehavioral science draws from a number of different fields and theories, primarily those of psychology, social neuroscience, and cognitive\nscience.\nOne application of the behavioral-science approach can be seen in a field called organizational development. Organizational\ndevelopment is an ongoing, systematic process of implementing effective organizational change.\nBehavioral sciences include relational sciences, which deal with relationships, interaction, communication networks, associations, and\nrelational strategies.\nCombined, the behavioral science approach is broadly about understanding individual and group behavioral dynamics to initiate\nmeaningful organizational development.\nKey Terms\norganizational development: An ongoing, systematic process of implementing effective organizational change using theories from\nbehavioral sciences.\nBehavioral science draws from a number of different fields and theories, primarily those of psychology, social neuroscience, and cognitive\nscience. Behavioral science uses research and the scientific method to determine and understand behavior in the workplace. Many of the\ntheories in the behavioral perspective are included in the behavioral-science approach to management. For example, the Hawthorne\nstudies used the scientific method and are considered to be a part of the behavioral-science approach.\nBehavioral science within the business management environment is a specific application of this field, and employs a number of specific\ntypes of behavioral observations. This includes concepts such as information processing, relationships and motivation, and organizational\ndevelopment.\nInformation Processing\nInformation processing involves determining how people process stimuli in their environment. This field deals with the processing of\nstimuli from the social environment by cognitive entities in order to engage in decision making, social judgment, and social perception.\nThe field is particularly concerned with information processing as it relates to individual functioning and the survival of an organism in a\nsocial environment.\nRelationships\nOrganization triangle: This diagram illustrates\nthe idea that structure, process, and the people\ninvolved all play a role in an organization's\nculture.\nBehavioral sciences also include relational sciences that deal with relationships, interaction, communication networks, associations, and\nrelational strategies or dynamics between organisms or cognitive entities in a social system. The emphasis on using quantitative data and\nqualitative research methods to determine how people process information and understand social relationships is important to helping\nmanagers better understand the proven methods for increasing employee motivation and employee productivity. The behavioral-science\napproach and the myriad of fields it encompasses is the most common study of management science today.\nOrganizational Development\nThe primary application of the behavioral-science approach can be seen in the field of organizational development. Organizational\ndevelopment is an ongoing, systematic process of implementing effective organizational change. Organizational development is\nconsidered both a field of applied behavioral science that focuses on understanding and managing organizational change as well as a\nfield of scientific study and inquiry. It uses components of behavioral sciences and studies in the fields of sociology, psychology, and\ntheories of motivation, learning, and personality to implement effective organizational change and aid in the development of employees.\nCombined, the behavioral-science approach is broadly about understanding individual and group behavioral dynamics to initiate\nmeaningful organizational development. The study of human behavior in the context of organizational change is an integral part of\nempowering organizations to grow, adapt, and learn to capture competitive advantage.\nBehaviorism: Follett, Munsterberg, and Mayo\nBehaviorism initiated a focus on the psychological and human factors influencing workers.\nLearning Objectives\nCompare and contrast the three most famous pioneers and founders of the behavioral perspective in organizational theory\nKey Takeaways\nKey Points\nMary Parker Follett, Hugo Munsterberg, and Elton Mayo are all considered pioneers and founders of the behaviorism movement in\nmanagement theory. They wrote about the importance of considering behavioral aspects of workers in addition to the efficiency of\nworkers.\nMary Parker Follett (September 3, 1868 – December 18, 1933) was an American social worker, management consultant, and pioneer in the\nfields of organizational theory and organizational behavior.\nHugo Munsterberg was one of the pioneers of applied psychology, extending his research and theories to industrial/organizational (I/O),\nlegal, medical, clinical, educational, and business settings.\nElton Mayo is known as the founder of the human relations movement. His research includes the Hawthorne studies and his book The\nHuman Problems of an Industrialized Civilization.\nKey Terms\nIndustrial Psychology: A field focusing on topics such as hiring workers with personalities and mental abilities best suited to certain\ntypes of vocations.\nMary Parker Follett, Hugo Munsterberg, and Elton Mayo are all considered pioneers and founders of the industrial/organizational\npsychology and behaviorism movements in management theory. These three individuals wrote about the importance of considering\nbehavioral aspects of workers in addition to the efficiency of workers. This was, in many ways, a continuation of the scientific method, with\nthe critical difference of incorporating the human factors involved in effective management.\nFollett\nMary Parker Follett (September 3, 1868 – December 18, 1933) was an American social worker, management consultant, and pioneer in the\nfields of organizational theory and organizational behavior. She criticized the overmanagement of employees, a process now known as\nmicromanaging. Follett was known for the concept of reciprocal relationships and the idea that authority is inferior to integrative\ncollaboration. Managers should enable, not dictate.\nShe also distinguished herself in the field of management by being sought out by President Theodore Roosevelt as his personal\nconsultant on managing not-for-profit, non-governmental, and voluntary organizations. In her capacity as a management theorist, Mary\nParker Follett pioneered the understanding of lateral processes within hierarchical organizations. Her contributions aided the beginning of\nthe behaviorism movement of management by presenting the worker as more than just a machine.\nMary Parker Follett:\nMary Parker Follett\ndefined management\nas \"the art of getting\nthings done through\npeople.\"\nMunsterberg\nHugo Munsterberg (June 1, 1863 – December 19, 1916) was a German-American psychologist. He was one of the pioneers of applied\npsychology, extending his research and theories to industrial/organizational (I/O), legal, medical, clinical, educational, and business\nsettings. Munsterberg's writings are considered the genesis of the field of industrial psychology.\nIndustrial psychology, according to Munsterberg, focuses on topics such as hiring workers with personalities and mental abilities best\nsuited to certain types of vocations, as well as on ways to increase motivation, performance, and retention. Munsterberg suggests that\npsychology could be used in many different industrial applications, including management, vocational decisions, advertising, job\nperformance, and employee motivation. Many of Munsterberg's ideas, especially the idea of matching an individual's personality with the\ncorrect job set and skills, are common in the use of industrial/organizational psychology today.\nHugo Munsterberg: Munsterberg is\nconsidered the father of\nindustrial/organizational psychology.\nMayo\nGeorge Elton Mayo (December 26, 1880 – September 7, 1949) was an Australian psychologist, sociologist, and organization theorist. Mayo\nis known as the founder of the human relations movement. His research includes the Hawthorne studies and his book The Human\nProblems of an Industrialized Civilization (1933).\nThe research he conducted in the Hawthorne studies of the 1930s showed the importance of groups in affecting the behavior of\nindividuals at work. Mayo's employees Roethlisberger and Dickson conducted the practical experiments. This enabled him to make certain\ndeductions about how managers should behave. He concluded that people's work performance is dependent on both social issues and\njob content. He suggested a tension between workers' \"logic of sentiment\" and managers' \"logic of cost and efficiency\" that could lead to\nconflict within organizations. Mayo's studies contributed to the behaviorism movement in management as managers became more aware\nof the \"soft\" skills that are important to successful management.\nFollett, Munsterberg, and Mayo each introduced important components and ideas into the behaviorism perspective of management. They\nall believed that successful management comes from understanding how to best treat and motivate employees in order to help them\nsucceed in their jobs and become as efficient as possible.\nThe Human Side: Hawthorne\nThe Hawthorne studies found that workers were more responsive to group involvement and managerial attention than to financial\nincentives.\nLearning Objectives\nEvaluate Mayo and Roethlisberger's Hawthorne study relative to the behavioral perspective in organizational theories\nKey Takeaways\nKey Points\nThe Hawthorne studies, which were conducted by Elton Mayo and Fritz Roethlisberger in the 1920s with the workers at the Hawthorne\nplant of the Western Electric Company, were part of an emphasis on socio-psychological aspects of human behavior in organizations.\nHawthorne researchers hypothesized that choosing one's own coworkers, working as a group, being treated as special (as evidenced by\nworking in a separate room), and having a sympathetic supervisor were reasons for increases in worker productivity.\nThe Hawthorne studies found that monetary incentives and good working conditions are generally less important in improving employee\nproductivity than meeting employees' need and desire to belong to a group and be included in decision making and work.\nKey Terms\nHawthorne studies: A series of investigations conducted in the 1920s emphasizing the socio-psychological aspects of human behavior in\norganizations.\nThe Hawthorne studies were conducted with the workers at the Hawthorne plant of the Western Electric Company by Elton Mayo and\nFritz Roethlisberger in the 1920s. The Hawthorne studies were part of a refocus on managerial strategy incorporating the socio-\npsychological aspects of human behavior in organizations.\nWestern Electric Company, the location of the Hawthorne studies:\nThis is where the studies where conducted—a factory outside of\nChicago.\nThe studies suggested that employees have social and psychological needs—along with economic and financial needs—which must be\nmet in order to be motivated to complete their assigned tasks. The human relations movement is concerned with morale, leadership, and\nfactors that aid in the cooperation of workers.\nThis theory of management was a byproduct of the issues that arose from the classical, scientific perspectives on management (i.e.,\nTaylorism). The simplest explanation of the hypothesis being investigated is quite intuitive. Employees (i.e. human resources) are not\nmerely motivated by financial gain, and productivity is not simply a byproduct of incentives and optimized working spaces. People are\nmotivated by inclusion, constructive feedback, interest, autonomy, and a wide variety of other 'soft' factors (i.e. factors aside from money\nand other tangible resources).\nResults of the Hawthorne Studies\nThe studies originally looked into whether workers were more responsive and worked more efficiently under certain environmental\nconditions, such as improved lighting. The results were surprising, as Mayo and Roethlisberger found that workers were more responsive\nto social factors—such as the people they worked with on a team and the amount of interest their manager had in their work—than the\nfactors (lighting, etc.) the researchers had gone in to inspect.\nThe Hawthorne studies helped conclude that workers were highly responsive to additional attention from their managers and the feeling\nthat their managers actually cared about, and were interested in, their work. The studies also concluded that although financial motives\nare important, social factors are equally important in defining the worker productivity.\nThere were a number of other experiments conducted in the Hawthorne studies, including one in which two women were chosen as test\nsubjects and were then asked to choose four other workers to join the test group. Together, the women worked assembling telephone\nrelays in a separate room over the course of five years (1927–1932), and their output was measured.\nThe measuring began in secret. It started two weeks before moving the women to an experiment room and continued throughout the\nstudy. In the experiment room, they had a supervisor who discussed changes with them and, at times, used their suggestions. The\nresearchers then spent five years measuring how different variables impacted both the group's and the individuals' productivity. Some of\nthe variables included giving two five-minute breaks (after a discussion with the group on the best length of time), and then changing to\ntwo 10-minute breaks (not the preference of the group).\nIntangible Motivators\nChanging a variable usually increased productivity, even if the variable was just a change back to the original condition. Researchers\nconcluded that the employees worked harder because they thought they were being monitored individually. Researchers hypothesized\nthat choosing one's own coworkers, working as a group, being treated as special (as evidenced by working in a separate room), and\nhaving a sympathetic supervisor were the real reasons for the productivity increase.\nThe Hawthorne studies showed that people's work performance is dependent on social issues and job satisfaction, and that monetary\nincentives and good working conditions are generally less important in improving employee productivity than meeting individuals' need\nand desire to belong to a group and be included in decision making and work.\nManagerial Assumption: McGregor\nMcGregor introduced Theories X and Y, which summarize and compare the classical management and behavioral management\nperspectives.\nLearning Objectives\nExplain Douglas McGregor's Theory X and Theory Y approach, merging classical and behavioral organizational theories\nKey Takeaways\nKey Points\nDouglas McGregor was a management professor at the MIT Sloan School of Management. He wrote a book in 1960 called The Human\nSide of Management, which suggested motivating employees through authoritative direction and employee self- control, respectively\ncalled Theory X and Theory Y.\nTheory X, based more on classical management theory, assumes that workers need a high amount of supervision because people are\ninherently lazy. It assumes that managers need to motivate through coercion and punishment.\nTheory Y assumes that employees are ambitious, self-motivated, exercise self-control, and generally enjoy mental and physical work\nduties. Theory Y is in line with behavioral management theories.\nTheories X and Y relate to Maslow's hierarchy of needs in that they see human behavior and motivation as the main priority in maximizing\noutput in the workplace.\nKey Terms\nTheory X: Suggests that employees are inherently lazy and irresponsible and will tend to avoid work unless closely supervised and given\nincentives; contrasted with Theory Y.\nTheory Y: Postulates that employees are capable of being ambitious and self-motivated under suitable conditions; contrasted with\nTheory X.\nDouglas McGregor was a management professor at the MIT Sloan School of Management. He wrote a book in 1960 called The Human\nSide of Management, which suggested motivating employees through authoritative direction and employee self-control. McGregor's book\nwas voted the fourth most influential management book of the 20th century in a poll of the Fellows of the Academy of Management.\nMcGregor's main theory is comprised of Theory X and Theory Y. Theory X, based more on classical management theory, assumes that\nworkers need a high amount of supervision because people are inherently lazy. Theory Y assumes that employees are ambitious, self-\nmotivated, exercise self-control, and generally enjoy mental and physical work duties. Theory Y is in line with behavioral management\ntheories. Often, managers' actions toward their employees are affected by the theory to which they subscribe.\nTheory X\nIn Theory X, managers tend to micro-manage and closely supervise employees. Complex hierarchical structures are needed in order to\noffer a narrow span of control at every level of the organization. Employees show little ambition without an incentive program and avoid\nresponsibility whenever possible. Managers in Theory X rely more heavily on punishment, fear, and coercion as motivational techniques\nand less on reward. Managers and employees in this theory are generally mistrusted and they do not have rewarding relationships.\nUsually these managers believe that the sole purpose of the employee's interest in the job is money.\nTheory Y\nTheory Y managers are generally the opposite. They believe that given the proper conditions, employees will learn to seek out and accept\nresponsibility and to exercise self-direction in accomplishing objectives, that most people will want to do well at work, and that the\nsatisfaction of doing a good job will be a strong motivation. Many people interpret Theory Y as a positive set of beliefs about workers.\nMcGregor thinks that Theory Y managers are more likely than Theory X managers to develop the climate of trust with employees that is\nrequired for human-resource development. This type of human-resource development is much more similar to the behavioral\nmanagement theories of Maslow's self-actualization and the Hawthorne studies than any of the classical theories of management.\nTheory X or Theory Y?\nTheories X and Y relate to Maslow's hierarchy of needs in that they see human behavior and motivation as the main priority in maximizing\noutput in the workplace. Both McGregor and Maslow would say that in order to help employees achieve maximum efficiency and\nhappiness with their work, a Theory Y manager would need to promote morality, creativity, problem solving, and a lack of prejudice.\nMcGregor was a lifetime proponent of Theory Y.\nModern organizations in developed countries generally side with McGregor, in that they believe Theory Y is superior in getting positive\nresults from employees (and subsequently job satisfaction for employees). However, both theories are still prominent in the workplace,\nwhere many managers treat their employees as if they are lazy and likely to perform poorly without stringent rules and supervision. In\nmanagement, just as everywhere else, it is difficult to effect social change in the face of human nature, even when the benefits are\nestablished.\nProductivity: Argyris\nArgyris's theory of single- and double-loop learning has been applied to management theory to suggest the best ways for employees to\nlearn.\nLearning Objectives\nIdentify Chris Argyris's key contributions to organizational theory through single-loop and double-loop learning\nKey Takeaways\nKey Points\nArgyris studied how humans design and decide on their actions under difficult or stressful situations. He believed that human actions are\ncontrolled by environmental variables, which determine the key differences between single-loop learning and double-loop learning.\nIn single-loop learning, individuals, groups, or organizations modify their actions according to the difference between expected and\nobtained outcomes.\nIn double-loop learning, individuals, groups, or organizations question the values, assumptions, and policies that led to the actions in the\nfirst place.\nArgyris's theory of single- and double-loop learning has been applied to management theory in order to suggest the best way for\nemployees to learn and think about new goals and strategies for an organization.\nKey Terms\ndouble-loop learning: A theory in which an organization or individual questions the values, assumptions, and policies that led to a given\nsituation.\nlearning organization: A company that facilitates the learning of its members and continuously transforms itself.\nsingle-loop learning: A theory that says individuals, groups, or organizations modify their actions according to the difference between\nexpected and obtained outcomes.\nChris Argyris is an American business theorist, a professor emeritus at Harvard Business School, and a thought leader at Monitor Group.\nHe is best known for his work on learning theories in the area of learning organizations.\nArgyris conducted a series of research studies in action science, which studies how humans design and decide on their actions under\ndifficult or stressful situations. Argyris believed that human actions are controlled by environmental variables, which determine the key\ndifferences between single-loop and double-loop learning.\nSingle-Loop Learning\nIn single-loop learning, entities (such as individuals, groups, or organizations) modify their actions according to the difference between\nexpected and obtained outcomes. This essentially means that learning is through experience and direct reflection on outcomes, where the\nends are justifying the means and dictating the fulcrum of the discussion and learning outcomes.\nIn many ways, this is a more reactionary approach. Individuals are tasked with identifying successes and failures, pursuing formulas for the\nformer and minimizing the latter. While this type of learning, and this broader type of behavior, is extremely common in the real world, it\nis not the ideal method to learn and adapt from a broader organizational level. It tends to be simple and short-term, which is not always\nconducive to sustainability.\nDouble-Loop Learning\nIn double-loop learning, the entities question the values, assumptions, and policies that led to the actions in the first place; if they are able\nto view and modify those values, then second-order or double-loop learning has taken place. This is a more integrative, process-oriented,\nand collaborative approach. It is also much more complex, difficult, and sensitive, as the core values and strategies in place must be\nanalyzed, questioned, and defended (or discarded).\nThe simple truth is that people fear change, actively avoid conflict, and generally preserve the status quo. Double-loop learning requires\nthe bravery to challenge what is established organizationally, identify broader systemic issues, and fix problems at the source.\nSingle- and double-loop learning: Argyris wrote about the\ntheories of single- and double-loop learning, which determine\nhow people make decisions in difficult situations.\nFor example, a company that is facing a problem with its management strategy may decide to focus on how to improve or implement the\nstrategy in different ways. In this situation, the company uses single-loop learning because management is focused on making changes\nwithout reconsidering the fundamental standard or strategy itself. However, if the company were to entirely reconsider the problematic\nstrategy and start from scratch, this would constitute double-loop learning. Double-loop learning may lead to a change in the original\nstrategy or goals that the company had in the first place.\nArgyris's theory of single- and double-loop learning has been applied to management theory in order to suggest the best way for\nemployees to learn and think about new goals and strategies for an organization.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}