{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Structure\nDefining Organization\nThe Role of Management in an Organization\nManagement is tasked with generating an organizational system and integrating operations for high efficiency.\nLearning Objectives\nCategorize the three primary managerial levels in an organization\nKey Takeaways\nKey Points\nManagement may be described as the the people who design an organization 's structure and determine how different aspects of the\norganization will interact.\nManagement entails six basic functions: planning, organizing, staffing, leading, controlling, and motivating.\nDifferent levels of management will participate in different components of this design process, with upper management creating the\ninitial organizational architecture and structure.\nOrganizational design is largely a function based on systems thinking: identifying the moving parts within an organization that add value\nand ensuring that these parts function together as an effective and efficient whole.\nOrganizational design is less static in modern organizations; therefore, management must actively adapt organizational design to various\nchallenges, opportunities, and technological improvements to maintain competitive output.\nKey Terms\norganization chart: A graphic display of reporting relationships, which sometimes displays position titles and position holders.\nsystems thinking: The process of understanding how parts influence one another within a whole.\nManagement and Organizational Design\nManagement can be described as the people who design an organization's structure and determine how different aspects of the\norganization will interact. When designing an organization, managers must consider characteristics such as simplicity, flexibility, reliability,\neconomy, and acceptability. Different levels of management will participate in different components of this design process, with upper\nmanagement creating the initial organizational architecture and structure.\nOrganizational design is largely a function based on systems thinking. Systems thinking involves identifying the moving parts within an\norganization that add value and ensuring that these parts function together as an effective and efficient whole. Perspective is essential in\nsystems thinking: a manager's role in organizational design is to refrain from thinking of departments, individuals, processes, and\nproblems as separate from the system and instead think of them as indivisible components of the broader organizational process.\nModern organizations exist within a framework of globalization and constant technological disruptions; as a result their organizational\ndesign is less static than in the past. Management must actively adapt organizations to meet various challenges, opportunities, and\ntechnological improvements to maintain competitive output. Because the organization is always changing, the problems of process and\ndesign are essentially limitless. Using a systems approach, managers view their objectives as moving targets and actively engage in\nexpanding the organization day by day.\nManagement Processes\nOrganizations can be viewed as systems in which management creates the architecture for the system of production. Managers' role in\norganizational design is central but must be understood in the context of their overall responsibilities within the organization.\nManagement operates through functions such as planning, organizing, staffing, leading/directing, controlling/monitoring, and motivation.\nThese functions enable management to create strategies and compile resources to lead operations and monitor outputs.\nThe functions of management:\nManagement operates through four main\nfunctions: planning, organizing, directing\n(i.e., leading), and controlling (i.e.,\nmonitoring and assessing).\nManagement Hierarchy\nAll levels of management perform these functions. However, the amount of time a manager spends on each function depends on the\nlevel of management and the needs of the organization—factors which play a role in organizational design.\nTop-level managers include the board of directors, president, vice-president, CEO, and other similar positions. They are responsible for\nplanning and directing the entire organization.\nMiddle-level managers include general managers, branch managers, and department managers, all of whom are accountable to the top-\nlevel management for the functions of their departments. They devote more time to organizing and directing.\nFirst-level managers include supervisors, section leads, foremen, and similar positions. They focus on controlling and directing.\nAs a result of this hierarchy, upper management will view the organizational design from a macro-level and consider all moving parts of\nthe organization. Middle-management will generally focus on operations within functional or geographic areas. Lower-level managers will\nlook at specific processes within functions or regions. From an organizational-design perspective, the higher managers are in the\norganization, the broader the view they will take and the greater number of moving parts they will consider.\nBasic Types of Organizations\nMost organizations fall into one of four types: pyramids/hierarchies, committees/juries, matrix organizations, and ecologies.\nLearning Objectives\nDescribe the basic types of organizations using four common structures\nKey Takeaways\nKey Points\nOrganizations fall into one of four basic types: pyramids/ hierarchies, committees/juries, matrix organizations, and ecologies.\nFrom a business perspective, the choice of organizational design has substantial implications for strategy, authority distribution, resource\nallocation, and functional approaches.\nA pyramid/hierarchy has a leader who is responsible for making all decisions that affect the organization. This leader manages other\norganizational members.\nCommittees/juries consist of groups of peers who decide collectively, sometimes by casting votes, on the appropriate courses of action\nwithin the organization.\nMatrix organizations assign workers to more than one reporting line in an attempt to maximize the benefits of both functional and\ndecentralized organizational forms.\nIn ecologies, each business unit represents an individual profit center that holds employees accountable for the unit's profitability.\nKey Terms\ncommon law: A precedent or policy developed by judges through decisions of courts and similar tribunals.\nfunctional: A structure that consists of activities such as coordination, supervision, and task allocation.\ndecentralized: A structure where business units operate autonomously and have greater decision-making power.\nBasic Organizational Structures\nAn organization is a social entity with collective goals that is linked to an external environment. Most organizational structures fall into\none of four types: pyramids/hierarchies, committees/juries, matrix organizations, and ecologies. From a business perspective, the choice\nof organizational design has substantial implications for strategy, authority distribution, resource allocation, and functional approaches.\nPyramid/Hierarchy\nAn organization using a pyramid or hierarchy structure has a leader who is responsible for and makes all the decisions affecting the\norganization. This leader manages other organizational members. Pyramids and hierarchies often rely on bureaucratic practices, such as\nclearly defined roles and responsibilities and rigid command and control structures. Like a physical pyramid, these organizations need a\nsturdy base with sufficient members to support various levels of management within the overall structure so that the organization does\nnot fall short of its goals.\nFrom a business perspective, a hierarchy will often be divided according to function or geography. For example, a global retailer may\nutilize a geographic hierarchy at the upper level, with each geographic branch creating a functional hierarchy beneath it. A smaller\norganization operating in a single region may simply have a functional hierarchy.\nThe Iraqi Special Security Organization: This organizational\nchart of the Iraqi Special Security Organization illustrates a\nhierarchy. Note the multiple separate layers to the\norganization's hierarchy; the lowest layer includes individual\nbranches, the next layer involves supervisory directorates,\nwhich report to the director's office, who is accountable to\nthe scientific branch.\nCommittee/Jury\nCommittees or juries consist of groups of peers who decide collectively, sometimes by casting votes, on the appropriate courses of action\nwithin an organization. Committees and juries have a basic distinction: members of a committee usually perform additional actions after\nthe group reaches a decision, while a jury's work concludes once the group has reached a decision. In countries with common-law\npractices, for example, a jury of peers render innocent or guilty verdicts in the court system. Juries are often used to determine athletic\ncontests, book awards, and similar contests.\nIn the business world, a committee structure is more commonly found in smaller institutions. A start-up company with three people, for\nexample, may easily function as a committee in which decisions are made via discussion. Committees represent a decentralized approach\nto organizational design and tend to have a collaborative, often unstructured workplace. The more people involved, the more disparate\nand less effective committee structures become.\nMatrix\nMatrix organizations assign employees to two reporting lines, each with a boss representing a different hierarchy. One hierarchy is\nfunctional and assures that experts in the organization are well-trained and assessed by bosses who are highly qualified in the same areas\nof expertise. The other hierarchy is executive and works to ensure the experts bring specific projects to completion. Matrix organizations\nare by far the most complex and are more common in large corporations.\nProjects can be organized by product, region, customer type, or other organizational need. The matrix structure combines the best parts\nof both separate structures. In a matrix organization, teams of employees perform work to take advantage of the strengths and\ncompensate for the weaknesses of both the functional and decentralized forms of organizational structure. Matrix organizations may be\nfurther categorized as one of the following types:\nWeak/Functional Matrix: A project manager with limited authority is assigned to oversee cross-functional aspects of the project.\nFunctional managers maintain control over their resources and project areas.\nBalanced/Functional Matrix: A project manager is assigned to oversee the project. Power is shared equally between the project manager\nand functional managers, combining the best aspects of functional and project-oriented organizations. This system is the most difficult to\nmaintain because of difficulties in power-sharing.\nStrong/Project Matrix: A project manager is primarily responsible for the project. Functional managers provide technical expertise and\nassign resources as needed.\nEcology\nIn ecologies, each business unit represents an individual profit center that holds employees accountable for the unit's profitability. These\nkinds of organizations foster intense competition, as all members are paid for the actual work they perform. Ineffective parts of the\norganization are left to fail and thriving parts are rewarded with more work. Companies that use this organizational structure define roles\nand responsibilities strictly, and each business unit tends to operate autonomously. In an ecology organization, clearly defined,\nmeasurable objectives that reflect the business's goals are critical.\nThe Organizational Chart\nAn organization chart is a diagram that illustrates the structure of an organization.\nLearning Objectives\nCompare the various types of organization charts that describe company structures\nKey Takeaways\nKey Points\nOrganization charts are a vital tool of management and can be classified into three broad categories: hierarchical, matrix, and flat (or\nhorizontal).\nOrganization charts illustrate the structure of an organization, the relationships and relative ranks of its business units/divisions, and the\npositions or roles assigned to each unit/division.\nBefore working with an organization, employees should procure a copy of its organizational chart. A new employee or manager can then\nunderstand how authority is distributed within the organization and with whom to consult about various concerns.\nKey Terms\ndecentralized: Dispersed rather than concentrated in a single, central location or authority.\nThe Purpose of Organization Charts\nAn organization chart (sometimes called an organizational chart, an org chart, or an organogram) is a diagram that illustrates the\nstructure of an organization, the relationships and relative ranks of its business units/divisions, and the positions or roles assigned to each\nunit/division.\nExamples of such roles include managers of various departments, subordinates within these departments, directors, and chief executive\nofficers. When an organization chart grows too large, it can be split into smaller charts that show only individual departments within the\norganization.\nPrior to applying for a job or beginning work with an organization, a prospective employee should procure a copy of the organization\nchart. New employees or managers can then know with whom to consult about particular issues, as well as understand the distribution of\nauthority within the company. The org chart can also provide insight into the broader strategy of the company—such as the degree of\ninnovation versus process control being pursued, the flexibility of project management, the degree of autonomy, and the broader\ncompany culture.\nThe different types of organization charts include hierarchical, matrix, and flat (also known as horizontal). These are described briefly\nbelow.\nHierarchical Organization Charts\nA hierarchical organization is an organizational structure with several reporting layers. Every entity within the organization—except for the\nowners—is subordinate and reports to a higher level entity.\nMatrix Organization Charts\nA matrix organizational chart displays how people with similar skills are pooled together for work assignments.\nMatrix organizational chart: In a matrix\nstructure, the organization is grouped by\nboth product and function. Product lines\nare managed horizontally and functions are\nmanaged vertically. This means that each\nfunction—e.g., research, production, sales,\nand finance—has separate internal divisions\nfor each product.\nFlat or Horizontal Organization Charts\nA flat organization chart shows few or no levels of intervening management between staff and managers. A flat chart will simply look like\na line of boxes with no overt authority implied.\nCharacteristics of Organizational Structures\nImportant characteristics of an organization's structure include span of control, departmentalization, centralization, and decentralization.\nLearning Objectives\nOutline the departmentalization options available to corporations from an organizational structure perspective and differentiate between\ncentralized and decentralized decision-making, and the resulting structural implications\nKey Takeaways\nKey Points\nOrganizational structures provide basic frameworks to help operations proceed smoothly and functionally.\nSpan of control refers to the number of subordinates a supervisor has; it is used as a means of ensuring proper coordination and a sense\nof accountability among employees.\nDepartmentalization is the basis by which an organization groups tasks together. There are five common approaches: functional,\ndivisional, matrix, team, and network.\nCentralization occurs when decision -making authority is located in the upper organizational levels. Centralization increases consistency in\nthe processes and procedures that employees use in performing tasks.\nDecentralization occurs when decision-making authority is located in the lower organizational levels. With decentralized authority,\nimportant decisions are made by middle-level and supervisory-level managers, thereby increasing adaptability.\nKey Terms\nspan of control: The number of subordinates a supervisor has.\nOrganizational structures provide basic frameworks to help operations proceed smoothly and functionally. Types of organizational\nstructures include functional, divisional, matrix, team, network, and horizontal structures. Each of these structures provides different\ndegrees of four common organizational elements: span of control, departmentalization, centralization, and decentralization.\nSpan of Control\nSpan of control—or the number of subordinates a supervisor has—is used as a means of ensuring proper coordination and a sense of\naccountability among employees. It determines the number of levels of management an organization has as well as the number of\nemployees a manager can efficiently and effectively manage. In the execution of a task, hierarchical organizations usually have different\nlevels of task processes. Workers at various levels send reports on their progress to the next levels until the work is completed.\nIn the past it was not uncommon to see average spans of one to four (one manager supervising four employees). With the development\nof inexpensive information technology in the 1980s, corporate leaders flattened many organizational structures and caused average spans\nto move closer to one to ten. As this technology developed further and eased many middle-managerial tasks (such as collecting,\nmanipulating, and presenting operational information), upper management found they could save money by hiring fewer middle\nmanagers.\nDepartmentalization\nDepartmentalization is the process of grouping individuals into departments and grouping departments into total organizations. Different\napproaches include:\nFunctional - departmentalization by common skills and work tasks\nDivisional - departmentalization by common product, program, or geographical location\nMatrix - a complex combination of functional and divisional\nTeam - departmentalization by teams of people brought together to accomplish specific tasks\nNetwork - independent departments providing functions for a central core breaker\nCentralization\nCentralization occurs when decision-making authority is located in the upper organizational levels. Centralization increases consistency in\nthe processes and procedures that employees use in performing tasks. In this way, it promotes workplace harmony among workers and\nreduces the cost of production. Centralization is usually helpful when an organization is in crisis and/or faces the risk of failure.\nCentralization allows for rapid, department-wide decision-making; there is also less duplication of work because fewer employees perform\nthe same task. However, it can limit flexibility and natural synergies. Autonomy in decision-making is reserved for only a small number of\nindividuals within the workforce, potentially limiting creativity.\nCentralization vs.\ndecentralization: This diagram\ncompares visual representations of\na centralized vs. decentralized\norganizational structure. Notice\nhow the representation of the\ncentralized organization looks like\none large asterisk with many\nspokes, whereas the\nrepresentation of the decentralized\norganization looks like many small\ninterconnected asterisks.\nDecentralization\nDecentralization occurs when decision-making authority is dispersed among the lower organizational levels. With decentralized authority,\nimportant decisions are made by middle-level and supervisory-level managers. Because there are fewer hierarchical layers to navigate,\nthis kind of structure helps to enable adaptability, quick reactions to lower level issues, and more empowered employees. However,\nmaking organization-wide changes that are implemented homogeneously can become quite difficult in this system.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}