{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nCulture\nDefining Organizational Culture\nOrganizational culture can be defined as the collective behavior of people within an organization and the meanings behind their actions.\nLearning Objectives\nDefine culture and it's conceptual development within the context of organizations and innovation\nKey Takeaways\nKey Points\nCulture is inherently intangible, and a static definition of culture struggles to encapsulate the meaning and implications of its role in an\norganization.\nOne way to define culture is simply as the overarching mentality and expectation of behavior within the context of a given group (e.g., an\norganization, business, country, etc.).\nCorporate culture is usually derived from the top down (i.e., upper management sets the tone) and comes in the form of expectation and\nconsistency throughout the organization.\nCulture can be manipulated and altered depending on leadership and members. Instilling positive culture that promotes effective\nemployee behavior is a manager's primary task.\nWhile there are many models for and perspectives on defining culture within an organization, models such as Geert Hofstede's, Edgar\nSchein's and Gerry Johnson's are useful in properly framing a comprehensive definition.\nKey Terms\nculture: The beliefs, values, behavior, and material objects that constitute a people's way of life.\nCulture is inherently intangible, and a static definition of culture struggles to encapsulate the meaning and implications of its role in an\norganization. One way to define culture is simply as the overarching mentality and expectation of behavior within the context of a given\ngroup (e.g., an organization, business, country, etc.). Culture provides a guiding perspective on how individuals within that group should\nact, and what meaning can be derived from those actions. Expectation, traditions, value, ethics, vision, and mission can all both\ncommunicate and reinforce a given group culture. Above all else, culture must be shared internally; otherwise it loses its form.\nCulture in Business\nCorporate culture is usually derived from the top down (i.e., upper management sets the tone) and comes in the form of expectation and\nconsistency throughout the organization. All employees and managers must uphold these cultural expectations to generate a working\nenvironment that correlates to cultural expectations. The shared assumptions should be implicit in behavior and explicit in the mission,\nvision and ethics statements of the organization. Consistency between expectation and action is key here.\nPeople working at Wikimedia: Even small things, such as the way\nan office space is set up, can set the tone for organizational culture.\nCulture and Adaptability\nCulture can be manipulated and altered, depending on leadership and members. Let's take the simple example of a car dealership. Selling\ncars is usually a commission business, where the salesperson is a central success factor. Many car dealerships find that competition is an\neffective cultural component and embed that into the organization. This is easily accomplished with the right tools. A car dealership\nowner may hire specifically for competitiveness, making it clear that this is the type of individual they want to hire. The owner can create\nhigh variable salary and low fixed salary so that high performers are much more highly prized and rewarded than ineffective salespeople.\nThe owner could give out awards at the end of each quarter to the most successful salesperson. The list could go on and on, but the\nimportant consideration here is how strategy and culture can be intertwined to evolve together.\nPerspectives on Culture\nCulture is a deeply important element of organizations and societies that is studied extensively in a variety of disciplines. This has\ngenerated more definitions of culture and how to go about empirically measuring it than could be touched upon in one overview.\nHowever, a few important perspectives for a business manager include:\nHofstede's Cultural Dimensions Theory - Postulates that cultural differences to be aware of include different perspectives on power\ndistance, masculinity (vs. femininity), individualism (vs. collectivism), avoidance of uncertainty, long-term orientation, and indulgence.\nSchein's Cognitive Levels of Organizational Culture - Edgar Schein believes that culture can be viewed most simply via artifacts (e.g.,\nfacilities, dress code, etc.), more acutely through values (e.g., focus on quality, loyalty or other central values) and most complexly through\ntacit assumptions (i.e., unspoken rules of behavior and other intangible expectations that are very difficult to observe and measure).\nGerry Johnson's Cultural Web - This includes the elements of culture, which is an important aspect of how we define it. Johnson underlines\nthe paradigm, control system, organizational structure, power structure, symbols, stories, and myths as central determinants of what a\ngiven organizational culture stands for.\nWhile each of these theories is complex, all together they help create a clearer picture of what exactly culture is and how it applies to\nmanagers and organizations.\nThe Impact of Culture on an Organization\nCulture is a malleable component of an organization that can adapt and evolve through influences to create value.\nLearning Objectives\nIdentify the central components of an organization or company that result from the influence cultural dispositions\nKey Takeaways\nKey Points\nCulture, particularly in large organizations that have a great deal of momentum, can be difficult to influence or change.\nUnderstanding how to change an organizational culture requires some insight into what creates culture in the first place and how altering\nthose components may impact meaningful cultural development.\nSome examples of organizational facets that influence culture are mission and vision statements, control systems, organizational\nstructures, power hierarchies, symbols, routines, and internal stories and myths.\nWhen integrating culture change, it is important to update mission and vision statements, ensure buy-in from upper management,\nupdate control systems and power hierarchies, hire people representative of the desired culture (and remove those who are not), and\nupdate the corporate ethos.\nKey Terms\nparadigm: A system of assumptions, concepts, values, and practices that constitutes a way of viewing reality.\njoint venture: A cooperative partnership between two individuals or businesses in which profits and risks are shared.\ninertia: The property of a body that resists any change to its uniform motion; equivalent to its mass. Figuratively, in a person,\nunwillingness to change.\nCulture, particularly in large organizations that have a great deal of internal momentum, can be difficult to influence or change. The size\nof an organization and the strength of its culture are the biggest contributors to cultural inertia. Big and strong organizational cultures will\nhave a powerful tendency to continue moving in the direction they are already moving (momentum). Therefore, managers must\nunderstand not only how to create culture, but also how to change it when necessary to ensure a positive, efficient and ethical culture.\nCultural Factors\nUnderstanding how to change an organizational culture requires some insight into what creates culture in the first place and how altering\nthose components may impact meaningful cultural development. Gerry Johnson's cultural web offers great clarity about how an\norganizational culture responds to and reflects influencing factors. These include:\nThe paradigm: The mission statement, vision, ethics statement, and other overt definitions of culture.\nControl systems: The processes in place to monitor what is going on, such as an employee handbook.\nOrganizational structures: This comes down to the hierarchy, or who reports to whom and why.\nPower structures: Similar to the organizational structure above, this pertains to who has the power to make decisions.\nSymbols: Most organizations have brand images and other symbols which represent what the culture stands for (logos, etc.).\nRituals and routines: In the business setting this is simply the way in which group interactions are organized. One example is the weekly\nstaff meeting.\nStories and myths: CEOs and other figureheads often have stories or legends associated with them; this generates culture through\nidolatry.\nWhile these are only a few of the elements of culture, they capture a wide variety of components that managers can use to influence and\nchange the general cultural predisposition.\nImplementing Culture Change\nCummings and Worley identify a useful way to frame the stages or steps in integrating broad organizational change through cultural\nreform in six stages, which correlates well with the factors identified above. These stages include:\nEnsure clarity in the strategic vision. This means making sure that the mission statement, vision statement and overall strategy work\ntogether to create one strong culture statement. The vision in particular must describe the new culture forcefully and persuasively.\nEnsure buy-in from the top down. This means communicating (and often determining) specific aspects of needed culture change at the\nupper managerial level.\nLead by example. Top management needs to exhibit the kinds of values and behaviors that they want to see in the rest of the company.\nIdentify areas in the organizational structure and control systems which require updates to conform with the new or adapted culture. This\nincludes altering employee handbooks, compensation strategies, hierarchy, decision-making authority and other central components of\nstructure.\nFollow through on the mandate. Terminating employees who do not conform to the desired culture is difficult. But it allows you to bring\nin new talent that aligns better with your desired culture. Ensuring proper emphasis on the new culture in training materials is useful in\nthis process.\nFinally, ensure that the ethical and legal implications of the adapted culture are understood, planned for and in line with corporate ethics.\nJoint ventures and mergers and acquisitions usually require large cultural changes. When different cultures come together it is wise to\nexpect some degree of culture-clash and differences of opinion. Managers, particularly upper management, must be aware of the\nimplications of cultural change, the facets of organizational culture and the steps involved in altering it. While this model describes a long\nprocess that is generally more applicable to large cultural overhauls, the general strategy is useful for managers leading meaningful\ncultural change at all levels.\nTypes of Organizational Culture\nWhile there is no single \"type\" of organizational culture, some common models provide a useful framework for managers.\nLearning Objectives\nDifferentiate between varying organizational culture tendencies, specifically within the context of Hofstede's cultural dimensions theory\nKey Takeaways\nKey Points\nWhile there are many ways to divide and define culture into \"types,\" Geert Hofstede, Edgar Schein, and Charles Handy provide three basic\ntheoretical frameworks.\nHofstede postulates six dimensions of culture based on a study conducted at IBM offices in 50 different countries. These include power\ndistance, uncertainty avoidance, individualism (vs. collectivism), masculinity (v.s femininity), long-term orientation, and restraint.\nEdgar Schein organizes culture into three types: artifacts (tangible cultural displays), values, and assumptions.\nCharles Handy identifies four types of organizational culture: power, role, task, and person. Each type of culture has strong implications on\ntypes of organizational structure.\nKey Terms\ncultural: Of or pertaining to culture.\nnormative: Of, pertaining to, or using a norm or standard.\nSeveral methods have been used to classify organizational culture. While there is no single \"type\" of organizational culture, and cultures\ncan vary widely from one organization to the next, commonalities do exist, and some researchers have developed models to describe\ndifferent indicators of organizational cultures. We will briefly discuss the details of three influential models on organizational cultures.\nHofstede's Cultural Dimensions\nWhile there are several types of cultural and organizational theory models, Hofstede's cultural dimensions theory is one of the most cited\nand referenced. Hofstede looked for global differences in culture across 100,000 IBM employees in 50 countries in an effort to determine\nthe defining characteristics of global cultures in the workplace. With the rise of globalization, this is particularly relevant to organizational\nculture.\nThrough this process, he underlined observations that relate to six different cultural dimensions (originally there were five, but they have\nbeen updated in response to further research):\nPower distance: Power distance is simply the degree to which an authority figure can exert power and how difficult it is for a subordinate\nto contradict them.\nUncertainty avoidance: Uncertainty avoidance describes an organization's comfort level with risk-taking. As risk and return are largely\ncorrelative in the business environment, it is particularly important for organizations to instill a consistent level of comfort with taking\nrisks.\nIndividualism vs. collectivism: This could best be described as the degree to which an organization integrates a group mentality and\npromotes a strong sense of community (as opposed to independence) within the organization.\nMasculinity vs. femininity: This refers to the ways that behavior is characterized as \"masculine\" or \"feminine\" within an organization. For\nexample, an aggressive and hyper-competitive culture is likely to be defined as masculine.\nLong-Term Orientation: This is the degree to which an organization or culture plans pragmatically for the future or attempts to create\nshort-term gains. How far out is strategy considered, and to what degree are longer-term goal incorporated into company strategy?\nIndulgence vs. Restraint: This pertains to the amount (and ease) of spending and fulfillment of needs. For example, a restrained culture\nmay have strict rules and regulations for tapping company resources.\nEdgar Schein's Cultural Model\nEdgar Schein's model underlines three types of culture within an organization, which, as a simpler model than Hofstede's, is somewhat\nmore generalized. Schein focuses on artifacts, values, and assumptions:\nSchein's model: Diagram of Schein's\norganizational behavior model, which\ndepicts the three central components\nof an organization's culture: artifacts\n(visual symbols such as office dress\ncode), values (company goals and\nstandards), and assumptions (implicit,\nunacknowledged standards or biases).\nArtifacts: The simplest perspective on culture is provided by the tangible artifacts that reveal specific cultural predispositions. How desks\nare situated, how people dress, how offices are decorated, etc., are examples of organizational artifacts.\nValues: Values pertain largely to the ethics embedded in an organization. What does the organization stand for? This is usually openly\ncommunicated with the public and demonstrated internally by employees. An example might be a non-profit organization trying to\nmitigate poverty. The values of charity, understanding, empowerment, and empathy would be deeply ingrained within the organization.\nAssumptions: The final type of culture, according to Schein, is much more difficult to deduce through observation alone. These are tacit\nassumptions that infect the way in which communication occurs and individuals behave. They are often unconscious, yet hugely\nimportant. In many ways, this correlates with Hofstede's cultural dimensions. For example, a culture of avoiding risk wherever possible\nmay be an assumption which employees act upon without realizing it, and without receiving any directives to do so. High power distance\ncould be another, where employees intuit that they should show a high degree of deference to their superiors without being specifically\ntold to do so.\nCharles Handy's Four Types of Culture\nCharles Handy put forward a framework of four different types of culture that remains relevant today. His four types include:\nPower culture: In this type of culture, there is usually a head honcho who makes rapid decisions and controls the organizational direction.\nThis is most appropriate in smaller organizations, and require a strong sense of deference to the leader.\nRole culture: Structure is defined and operations are predictable. Usually this creates a functional structure, where individuals know their\njob, report to their superiors (who have a similar skill set), and value efficiency and accuracy above all.\nTask culture: Teams are formed to solve particular problems. Power is derived from membership in teams that have the expertise to\nexecute a task. Due to the importance of given tasks, and the number of small teams in play, a matrix structure is common.\nPerson culture: In this type of culture, horizontal structures are most applicable. Each individual is seen as valuable and more important\nthan the organization itself. This can be difficult to sustain, as the organization may suffer due to competing people and priorities.\nWhile there are many other ways to divide and define culture, these three offer a good window into the literature surrounding cultural\ntypes.\nCore Culture\nCore culture is the underlying value that defines organizational identity through observable culture.\nLearning Objectives\nIdentify the general definition and characteristics of a healthy core culture, alongside how this translates into observable culture.\nKey Takeaways\nKey Points\nCore and observable culture are two facets of the same organizational culture, with core culture being inward-facing and intrinsic and\nobservable culture being more external and tangible (outward-facing).\nIn essence, core culture defines the values and assumptions of an organization, as described by Edgar Schein's Model of Organizational\nCulture.\nCore culture is made up of the intangible values and ethos that define an organization's cultural framework. Observable culture is the\nexternal reflection of this cultural perspective.\nManagement is tasked with both the creation and consistent application of core culture at the organizational level.\nKey Terms\nCore Culture: The underlying value that defines the organization's identity through observable culture.\nCore Culture and Observable Culture\nCore and observable culture are two facets of the same organizational culture, with core culture being inward-facing and intrinsic and\nobservable culture being more external and tangible (outward-facing). Core culture, as the name denotes, is the root of what observable\nculture will communicate to stakeholders. Core culture is more ideological and strategic, representing concepts such as vision (long-term\nagenda and values), while observable culture is more of a communications channel (i.e., stories, logos, symbols, branding, mission\nstatement, and office environment).\nEdgar Schein and Core Culture\nOne useful theoretical framework to consider when differentiating between core and observable culture is Edgar Schein's Organizational\nCulture Model. This mode simply and efficiently illustrates the cultural facets of a given organization as an upside-down triangle.\nSchein's model of organizational\nculture: Diagram of Schein's\norganizational behavior model, which\ndepicts the three central components of\nan organization's culture: artifacts (visual\nsymbols such as office dress code), values\n(company goals and standards), and\nassumptions (implicit, unacknowledged\nstandards or biases).\nThe broader base at the top of the inverted pyramid represents artifacts, the simplest and most physical (i.e., observable) elements of a\ngiven culture. This includes the way desks are situated in an office (collaborative or individualistic?), the colors and shapes used in the\nlogo, the general dress code, etc.\nThe next level is values, which bridges the gap between observable and core culture. Values are explicitly and observably stated in\norganizational literature (i.e., the employee handbook and mission statement), but also implicitly executed in individual behaviors. While it\nis observable when the CEO makes a public statement for shareholders or when the promotional team writes a press release, it is also\nderived directly from discussions of what the core culture is. This is where observable culture begins to transform into core culture.\nThe final component identified by Schein is parallel with the concept of core culture: assumptions. The assumptions made by the\nindividuals within an organization are so intimately tied to the core organizational culture that they are virtually unrecognizable. In many\nways, one could equate core culture with an individual's subconscious. While our subconscious so often drives our conscious behavior, we\nrarely realize it. Core culture has the same relationship with observable culture: core culture is created first, and ultimately drives the\nvisible cultural aspects of the organization.\nCreating Core Culture\nOrganizational culture, both observable and core, is created first at the managerial level. Leaders must define not only what it is they are\nworking towards, but also how the organization will come to define itself during the process. The core culture created by leadership sets\nthe tone for employee behavior and assumptions in the future.\nUpper management must decide which values and ethos will constitute the core of the organizational culture, and then instill this\ninternally, in their employees, and communicate it externally, to stakeholders (via observable culture). Management is tasked with both\nthe creation and consistent application of core culture at the organizational level.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}