{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nCommon Types of Corporate Strategies\nGrowth Strategy\nGrowth platforms are specifically named initiatives selected by a business organization to fuel revenue and earnings growth.\nLearning Objectives\nDistinguish between the varying integrations and diversifications that allow businesses to pursue strategic growth\nKey Takeaways\nKey Points\nStrategic growth platforms are long-term initiatives for high-scale revenue increases. Generic examples of commonly selected strategic-\ngrowth platforms include pursuing specific and new product areas or entering new distribution channels.\nDiversification is a form of corporate strategy that seeks to increase profitability through greater sales volume obtained from new\nproducts or new markets.\nMarket development strategy entails expanding the current incumbent market through new users or new uses.\nMarket penetration occurs when a company penetrates a market in which current products already exist, enabling the business to\ncompete head to head with incumbents in the market.\nNew product development (NPD) is the internal process of bringing a new product to market.\nIntegration, either horizontal or vertical, is a merger or acquisition process of entering new, related industries (for example, acquiring a\nsupplier or a competitor in a related industry).\nKey Terms\ndiversification: A corporate strategy in which a company acquires or establishes a business other than that of its current product.\nhorizontal integration: The merger or acquisition of new business operations.\nvertical integration: The integrating of successive stages in the production and marketing process under the ownership or control of a\nsingle management organization.\nGrowth platforms are specifically named initiatives selected by a business organization to fuel revenue and earnings growth. Growth\nplatforms may be strategic or tactical. Strategic growth platforms are longer-term initiatives for high-scale revenue increases. Generic\nexamples of commonly selected strategic growth platforms include pursuit of specific and new product areas, entry into new distribution\nchannels, vertical or horizontal integration, and new product development. Illustrative examples of growth platforms include:\nApple Computer's targeting of \"personal music systems\" to accelerate growth faster than with its personal computer business alone.\nIBM's coining of the term \"e-business,\" and its subsequent use as the organizing theme for all that the company did in the late 1990s.\nGoogle's entry into the operating system and laptop realms.\nWikipedia growth goals and projections: These graphs show goals\nand projections for growth for Wikipedia visitors and contributors\nfrom The Bridgespan Group for Strategy Development. The graph in\nthe left panel shows the target growth trajectory in number of\nvisitors, from less than 500 million to over 600 million. The graph in\nthe right panel shows an overall increase in the number of\ncontributors across all Wikipedias, with more growth indicated for\nthe already higher-traffic Wikipedias.\nTypes of Strategies\nThere are a number of different growth strategies, but the most common are:\nHorizontal integration – The merger or acquisition of new business operations. An example of horizontal integration would be Apple\nentering the search-engine market or a new industry related to laptops and smartphones.\nVertical integration – Integrating successive stages in the production and marketing process under the ownership or control of a single\nmanagement organization. An example might include a gas-station company acquiring a oil refinery.\nDiversification – A corporate strategy in which a company acquires or establishes a business other than that of its current product.\nDiversification can occur either at the business-unit level or at the corporate level. At the business-unit level, diversification is most likely\nto involve expansion into a new segment of an industry in which the business already competes. At the corporate level, it generally means\nentrance into a promising business outside the scope of the existing business unit.\nOther Product / Market Growth Types\nMarket Penetration\nMarket penetration occurs when a company penetrates a market in which current products already exist. This strategy generally requires\ngreat competitive strength, a strong brand, or both, as most market penetrations demand actively taking market share from current\nincumbents. It is an aggressive and often risky approach to growth.\nMarket Development Strategy\nMarket development strategy entails expanding the potential market through new users or new uses for a product. The strategy is best\naccomplished through identifying unique niche needs in a specific type of user and filling those needs. Market research is critical in\ndevelopment strategies. New users can be defined as new geographic segments, new demographic segments, new institutional segments,\nor new psychographic segments.\nNew Product Development\nIn business and engineering, new product development (NPD) is the process of developing, researching, and bringing a new product to\nmarket. A product is a set of benefits offered for exchange and can be tangible (that is, something physical you can touch) or intangible\n(for example, a service, experience, or belief). Identifying new needs or new ways of filling them and developing a new process or product\nthat accomplishes this aim are the goal of this growth strategy. NPD requires investment in research and development, usually over the\nlong term, and extensive trial and error.\nConsolidation Strategy\nIn business, consolidation refers to the mergers and acquisitions of many smaller companies into much larger ones for economic benefit.\nLearning Objectives\nExplain the relevance of consolidation from a strategic management perspective\nKey Takeaways\nKey Points\nMergers and acquisitions (M&A) is an aspect of corporate strategy dealing with the buying, selling, dividing, and combining of different\ncompanies and similar entities that can help an enterprise grow rapidly in its sector or location, or acquire new sectors or locations.\nConsolidation occurs when two companies combine to form a new enterprise altogether, eliminating competition and creating broader\neconomies of scale or scope.\nGenerally speaking, a merger is a combination of organizations which each abandons its previous brand and business models, creating a\nnew organization with the combined capacities of each.\nIn an acquisition, one organization buys out another, with the acquired business usually placing its processes under the brand name of\nthe acquirer.\nThe dominant rationale used to explain M&A activity is that acquiring firms seek improved financial performance. However, on average\nand across most commonly studied variables, M&A activity does necessarily not improve financial performance.\nBecause of the costs involved, consolidation is a very high-level strategic decision. All stakeholders on both ends should be consulted, and\nagreements will often take many months or years to conclude.\nKey Terms\nmerger: The legal union of two or more corporations into a single entity, with assets and liabilities typically assumed by the buying party.\nconsolidation: The act or process of consolidating, making firm, or uniting; the state of being consolidated; solidification; combination.\nacquisition: The act or process of acquiring.\nConsolidation (or amalgamation) is the act of merging two or more organizations into one. In strategic management, it often refers to the\nmergers and acquisitions of many smaller companies into much larger ones. Consolidation occurs when two companies combine to form\na new enterprise altogether; neither of the previous companies survives independently. The logic driving consolidation is the creation of\neconomies of scale, economies of scope, new locations, new technology, or some other form of increased competitive capacity.\nMergers and Acquisitions\nMergers and acquisitions (M&A) are aspects of corporate strategy, corporate finance, and management that deal with the buying, selling,\ndividing, and combining of different companies and similar entities. This activity can help an enterprise grow rapidly in its sector or\nlocation of origin or expand into a new field or new location. M&A is different from joint ventures and other forms of strategic alliance, as\nmergers or acquisitions aim to create a single organization.\nThe distinction between a \"merger\" and an \"acquisition\" has become increasingly blurred in various respects (particularly in terms of the\nultimate economic outcome), although it has not completely disappeared. Generally speaking, a merger is a combination of organizations\nin which each abandons its previous brand and business models, creating a new organization with the combined capacities of each one.\nIn an acquisition, one organization buys out another, with the acquired company usually placing its processes under the brand name of\nthe acquirer.\nGrowers Bank and\nTrust\nSoC u Cti h oti e rz pe rn on rs G ta e ion o nd rgia Repu Cb oli rc pB .ank\n1956 a\n1985 1987\nC& CS a o rof lS ino auth Interfirst Corp.\nArlington Trust Co. Hartfo Crd o N rpa .tional BaT nh ke aC no dn Tn re uc sti tc Cut o. Suburban Bank Comm Ber ac ne k Union NC ao tim onm ae l r Bc aia nl k\n1957\n1988 1988 1985 Citi Nze an tis o n& a S l Bo au nth kern 1990 1986 1987 American Trust Co. First C R oe rpp ou rb al tic io B nank ComA mm ee rcri ic aa l n Bank F Ni ars tit o A nm ale 1 B 9r 9i ac 9na kn M (a M 1g 9i 8n s 9sa o B ua rin )k Ame 1ri 9t 9r 1ust Corp. Union Ban 1k 996\nShawmut Bank Norstar Bank Ba En nk g o laf nN dew W suBe Nbas sn at im c td io oii an r nrps ay,t l e oar f Centerre Bank First Florida Bank Sovra Cn oF ri pn .ancial 1988 1960 BanA cm orS po ou rath tion 2006 2004Union B P anla knters NP au tg ioe nt aS l o Bu an nd k 1992 1994Society Corp. 1st Virgi In nia c. Banks 2, 003 19S 95outhe Crn o rN p.ational Bank of California First Charter Bank 2008 20O 01ld Ke Cnt o F rpin .ancial\n1995 1987 1991 1989 1992 N No ar tt ih o nC aa l r Bo alin na k Reg Cio on rps oF ri an ta ion ncial Keycorp BB&T Corp. Un Cio an li fB oa rnn ik a of Fifth Third Bank\n1996\n1991 Public National\nFlee Gt F roin ua pncial Standa Br ad n F kederal Maryla Bnd a nN kational Americ Ba an n S kecurity BB ao na ct sm he an re's s Barnett Banks, Inc. C&S/Sovran Corp. Bank & Trust Co.\nBankBoston Corp.1999 Summit Bancorp The Arizona Bank Rainie Br aN na ktional The Hibernia Bank N Be av na cd oa rp N oa rati to ion nal Mich20 ig01 a Bn a nN kational 1993 1993 1997 1998 Co Tn rutin ste Cnt oa .l oB fa Nn Yk & BaN na kt i &o n T Na rl u Y S sta Cfe oty . of BC ao nr kn &E x Tc ruh sa tn Cge o. New York Trust Co. B Ca en nk tr eo f T R ruo sc tk Cvi olle . Fi ors f t M N oa ut nio tn Va el rB na on nk NaB te io Bn n rs oao ol n B kh la yu n nrs kt of Securi Bty a N nkational F Hirs ot l dN ina gti so ,n Iw ni cd .e Ban1 k95 e5 rs Trust\nNat oio fn Na el wC i Yty o B rkank 1951 1954 1963 1964 Travelers Group 1998 1999\n1986 1987 1988 NationsBank Corp. 1955 1948 1959 11 99 76 54 1998 Deutsche Bank AG\n2001 1989 1998 Manu Bf aa nct kurers First o N f Nat eio wn Ya ol B rkank Chemic Cal o N rpe .w York Citicorp Go Bld ae nn c oS rt pate\nFiF nl ae ne ctB iao l s Cto on rp. Seafirst Bank Co Nn atin tioe nn ata l l B Il ali nn kois MBNA Corporation Secu Crit oy r pP .acific CU o. rS p. o T raru tis ot n Merrill Lynch LaSalle Bank BankAmerica Corp. 1992 1987 2002\n2004 1983 1994 2007 2008 2007 Comerica First N Bat aio nn kal City Texas C Bo am nkmerce Citigroup VizB ca an yc ao A B rgil eb na to aria\n2005 1992 2007\nBank Cof o A rpm .erica Chemic Ca ol rB p.anking BC ano cm sp ha as res s\n1992 FP ina art nn ce iars l GTr ru os ut p Bradford Bank Wilmington Trust Allfirst Bank Prov Mid ae rn yt l aB na dnk of\nDeerbank Corp. INB Financial Corp. M Haa Cnn oou mvfa e pc r at u T nr r ye ur ss t 2007 2009 2011 2003 2009 BBVA Compass\nM&T Bank\nIrving Trust\nCompany 1995 1992First Chicago Bank\nStar Banc Corp. Citizens Banking\n1995 Corporation\nCredit Suiss 1e 988 Girard Bank 1988 NBD Ban 1k 9 9C 1orp. Bank of CM oa .nh 1a 9t 5t 5an Chemica 1l 9 B 96ank Firsta1 Cr9 9 H o8 ro pld .ings BanM ce or r Ic npa con .rt ail te ion, Cent Dra el n B va en rk of Colorad Bo a nN kational Repub2 l0 i0 c7 Bancorp\nTh Ce oF ri prs ot r aB to ios nton 1983 Ba 2n 00k 7 of New York Summcorp Chase B aN na ktional Interstate Trust Co. N TS a rutt ia sot tne Can l o I B .s oala fnn Nkd Y& Cl Cin oto mn p T ar nu yst Lincoln First Bank Equitab ole f NTr Yust Co. Cha Cs oe r pM oa ran th ioa nttan Firstar Corporation 1999 Dow an ne dy L S oa av nings Pe Wop aBle sas hn iN nk g a o tt ofio nnal Firs1 t 9 B88 an Ink c S .ystem1 ,993 Citize Bn as n R coe rp public\n(laC te FS r i rF C si trr es Bdt o iB t s o tS os u nt io )sn se Mellon Financial First Chicago NBD Th Be a V na k ll oe fy A N ria zotio nn aal First USA 1930 1957 1959 1984 1930 Guaran oty f NTr Yust Co. 2001 2008 1987 1997\nU.S. Bancorp\nBank Mof e N lloe nw York NBD Bank 1998 1993 1997 Chase B M aa nn khattan 1961 Hibern Bia a N nkational North Fork Bank\n2000 Ma Tn ru uf sa tc Ctu or .ers 2005 2006\nBanc One Corp. J.P. Morgan & Co. 1961 C Fa ip ni ata nl c O ian le\nCorporation\nRep Cub ol ri pc o N rae tw io nYork 1999 Hang 1 9S 65eng Bank 2002 InteH rno au ts ioe nh ao ll ,d Inc. 1998 First C Co om rpm .erce G Cre F oa i rn pt a oW n race i ts a iot le nrn H.F. Ahm Coa .nson & Bank United Corp. Dime Bancorp, Inc. Hanover Bank ING Dire2 c0 t1 1 USA TD Banknor 2t 0h 08\nHSBC M Haa nn ou vfa ec rt u Br ae nrs k C Bom anm ce or rc pe\nCoreStates Bank J.P. Morgan Chase 1997 1998 2000 Cit (i Lze an us re B l, a Mn Dco )rp Capital One\n1990 2004 2002 TD Bank\nUn Bi ao nn c T or ru pst Secur City o N rpa .tional Madiso Bn a N nkational Pionee Cr oF ri pn .ancial The Fidelity Bank Meridian In B c.ancorp, First Pe Bn an ns kylvania First N Ba at nio knwide Bank One Bear Stearns Washington Mutual Trust G C eo om rgp ia any of 1996\n1985 Si C1 g9 n o86 e rpt oB ra an tioki nng1991 A1 B9 t9 ala4 nn kt ic o fN Fa loti ro idn aal Florid Ba aN na ktional Sou Cth oe ra ps ot r aB ta ion nking Dominion Bank Fir Bst a A nm kce or ri pcan First F19 id87 elity Bank Ce Cn ote rr p oF rin aa tion ncial 1996 FinC ao nre ciS at la Cte os rp. Califo1 r9 n B9 i7 aa n F kederal JPMorgan2 0 C08 hase 2008 SunBan1 k9 s8 ,5 Inc. T Chi ord rp N ora ati to ion nal C FN o im na at mio nen cr ia acl le Cresta Cr oF ri pn .ancial Inve Cs oSto re prs r ov rF ic ai en tis oa nncial\n1 19 98 97 71990 1991 1993 1993 1996 1996 1998 Sun19 T8 r5 ust Banks2004 1998 First o 9B 9f 7a A nm kerica CS ot2 a r0 t p0 e7 o S rat tr ie oe nt\n1\nFirst Union Corp. The N aS to iou nth a l 0C 0B 1a ar no klina S 19o 91uthTrust WachoW ve ias 2t 0c 0o 6rp Inc. CrocG k2o F B0l i rd an Ne 2na 0n kn 8c tW ii oa ne l ast 6rW blo cfr ll ad sB aa BS rn aaa pk v lai cn g 1s U Nn oit rDe wd e n sB v t1a e Cn 9r ok ro pf PainH eR o ah Ws to iop ed ni be ta I l es T rla r aun nsd kt 1B 98a 5yBanks, Inc B. nColonial Bank South Shore B Ta hn ok RBC Bank PR Ni SCg eg rs iB ca0a en0n ck National City Corp.\n2 2004 2006 0 e 7 a 0 l B 19a 8sC B uc aa ra l si y io d r i y n si y ,n o k f o f 988 F 1i 9r 9s 6t BIn ate nr kstat 2e 000 F 1ir 9s 9t 8 Security Corp. e 9 1 . N a b l B a19 n96 k C o of rB po .s19 t8 o5 1993 e fT Nru es wt C Jo em rsp ea yny SN ave iw ng H Ss aa MB vv a ie an2nn ng0k c0 s4 h B ea sn tek r of Cornerstone Bank Quaker City Bank 2012 F vi n 2 s5 ial 2008\nWells Fargo Corp.\n2000 2004 2006 2004\nUBS AG BancN oo rprt oh r aF to ior nk Inc. NewAlliance Bank Banco Popular\nMergers and acquisitions of U.S. Banks: This diagram of bank mergers in the\nUnited States shows how extensive the consolidation of various companies has\nbeen. What start as more than 50 distinct companies have eventually consolidated\ninto fewer than 20.\nMerger Dynamics\nIn the pure sense of the term, a merger happens when two firms, often about the same size, agree to go forward as a single new company\nrather than remain separately owned and operated. This kind of action is more precisely referred to as a \"merger of equals.\" Both\ncompanies' stocks are surrendered and new company stock is issued in its place. For example, in the 1999 merger of Glaxo Wellcome and\nSmithKline Beecham, both firms ceased to exist independently; a new company, GlaxoSmithKline, was created.\nThe classic example of consolidation is the merger of Bell Atlantic with GTE, out of which resulted Verizon Communications. Not every\nmerger with a new name is successful. By consolidating into YRC Worldwide, the combined company lost the considerable value of both\nYellow Freight and Roadway Corp.\nRationale\nThe dominant rationale used to explain M&A activity is that acquiring firms seek improved financial performance. The following motives\nare considered to improve financial performance: economy of scale, economy of scope, increased revenue or market share, cross-selling,\nsynergy, taxation, geographical or other diversification, resource transfer, vertical integration, and hiring.\nHowever, on average and across the most commonly studied variables, acquiring firms' financial performance does not positively change\nas a function of their acquisition activity (King, D. R.; Dalton, D. R.; Daily, C. M.; Covin, J. G. 2004. \"Meta-analyses of Post-acquisition\nPerformance: Indications of Unidentified Moderators.\" Strategic Management Journal 25 (2): 187–200. doi:10.1002/smj.371). Other motives\nfor merger and acquisition that may not add shareholder value include diversification, manager overconfidence, empire-building, and\nmanagement compensation.\nManagerial Implications\nBecause of the costs involved, consolidation is a very high-level strategic decision. All stakeholders in both organizations should be\nconsulted, and agreements will often take many months or years to conclude. Cultural conflicts between two different organizations are\nnot uncommon, as the mission, vision, and values of the individuals and groups within them are likely to differ. Managing this type of\nchange strategically is complex and rife with conflict. Mismanagement during these processes can minimize the potential synergistic gains\nand reduce the efficacy of the new strategic plan.\nGlobal Strategy\nGlobal strategy, as defined in business terms, is an organization's strategic guide to pursuing various geographic markets.\nLearning Objectives\nExplain the concept of global strategy within the context of international business and a globalized economy\nKey Takeaways\nKey Points\nA global strategy may be appropriate in industries where firms face strong pressures to reduce costs but weak pressures for local\nresponsiveness, allowing these firms to sell a standardized product worldwide.\nCompanies using a global strategy may achieve economies of scale to improve margins or low price points.\nGlobalization is not limited to cost leadership. Differentiation strategies also enable economies of scope, either fulfilling different needs in\ndifferent markets with a similar series of products, or developing new products based upon the needs and consumption habits of a new\nmarket.\nOther primary strategic reasons for globalization are to build supplier relationships, to improve access to raw materials (unique to a given\nregion), and to cut costs by relying on other regions' specializations.\nWith global markets in mind, strategic managers must expand their perspective and use varied models to generate different strategies for\ndifferent places.\nKey Terms\nfixed costs: A cost of business which does not vary with output or sales; overheads.\ncentralized: Having power concentrated in a single, central authority.\nmultinational: Operating, or having subsidiary companies in multiple countries (especially more than two).\nGlobal strategy, as defined in business terms, is an organization 's strategic guide to pursuing various geographic markets. A global\nstrategy should address the following questions: What should be the extent of an organization's market presence in the world's major\nmarkets? How can the organization build the necessary global presence? What are the optimal locations around the world for the various\nvalue-chain activities? How can the organization turn a global presence into global competitive advantage?\nWhen to Go Global\nCost Leadership\nA global strategy may be appropriate in industries where firms face strong pressures to reduce costs but weak pressures to respond\nlocally; globalization therefore allows these firms to sell a standardized product worldwide. By expanding to a broader consumer base,\nthese firms can take advantage of scale economies (cost advantages that an enterprise obtains due to expansion) and learning-curve\neffects because they are able to mass-produce a standard product that can be exported (providing that demand is greater than the costs\ninvolved).\nMarket Expansion\nGlobalization is not limited to cost leadership, however. Differentiation strategies also enable economies of scope, either fulfilling different\nneeds in different markets with a similar series of products, or developing new products based upon the needs and consumption habits of\na new market. Differentiation as part of a global strategy will often require localization, as organizations must adapt to consumer tastes\nbetter to compete in the new country. For example, Coca Cola tastes different depending on the country where it is bought because of\ndifferences in local preferences.\nSourcing\nOther popular and primary strategic reasons for globalization include building supplier relationships, improving access to raw materials\n(unique to a given region), and cutting costs by using other regions' specializations. Starbucks sources coffee beans from all over the\nworld, as climate dramatically affects the type and quality of the bean. The globalization strategy of Starbucks—while it includes selling in\nmany countries—is hugely depending on global sourcing, and strategic managers must carefully monitor this process for costs and\nbenefits.\nGlobal strategies require firms to coordinate tightly their product and pricing strategies across international markets and locations;\ntherefore, firms that pursue a global strategy are typically highly centralized.\nCorporate Strategy Implications\nWith global markets in mind, strategic managers must expand their perspective and use varied models to generate different strategies for\ndifferent places. For example, companies must now conduct a PESTEL analysis for each region in which they operate and recognize\nexpense and competition deviations between regions. For example, tariffs in country A may be much higher than country B, but country B\nhas fewer individuals willing to pay a high price for the good the organization is selling. Managers must conduct a cost/benefit analysis to\nidentify which country actually offers the best profit potential. These analyses are how strategists incorporate global concerns into\nstrategic management.\nGross domestic product (GDP) worldwide: The map identifies GDP (nominal)\nin different countries;countries with higher GDPs offer high consumer spending\nopportunities for multinational enterprises. The U.S. and China have the highest\nGDPs.\nCooperative Strategy\nA strategic alliance is a cooperation where each member expects the benefit from cooperation will outweigh the cost of individual efforts.\nLearning Objectives\nIdentify the steps involved in forming a strategic alliance to employ cooperative strategies\nKey Takeaways\nKey Points\nA strategic alliance is a relationship between two or more parties to pursue a set of agreed-upon goals or to meet a critical business need\nwhile remaining independent organizations. This form of cooperation lies between mergers and acquisitions and organic growth.\nPartners may provide the strategic alliance with resources such as products, distribution channels, manufacturing capability, project\nfunding, capital equipment, knowledge, expertise, or intellectual property.\nUpper management is tasked with the complex process of identifying good partners and generating agreements of mutual benefit.\nStrategic alliances can be high-cost, complex strategic components.\nStrategic alliances allow each partner to concentrate on its own best capabilities, learn and develop other competences, and assure\nadequate suitability of resources and competencies.\nKey Terms\nalliance: The state of being allied; the act of allying or uniting; a union or connection of interests between families, states, parties, etc.\nA strategic alliance is a relationship between two or more parties to pursue a set of agreed-upon goals or to meet a critical business need\nwhile remaining independent organizations. This form of cooperation lies between mergers and acquisitions (M&A) and organic growth.\nReasons for Strategic Alliance\nThe alliance is a cooperation or collaboration that aims for a synergy where each partner hopes that the benefits from the alliance will be\ngreater than those from individual efforts. Partners may provide the strategic alliance with resources such as products, distribution\nchannels, manufacturing capability, project funding, capital equipment, knowledge, expertise, or intellectual property.\nThe alliance often involves technology transfer (access to knowledge and expertise), economic specialization (David C. Mowery, Joanne E.\nOxley, Brian S. Silverman. Strategic Alliances and Interfirm Knowledge Transfer. Winter 1996. Strategic Management Journal, Vol. 17, Special\nIssue: Knowledge and the Firm, pp. 77-91), shared expenses, and shared risk.\nU.S. patents from 1790-2010: The above chart highlights the total\npatents granted over time in the U.S. Because the number of patents has\nincreased in recent years, technology transfers in strategic alliances have\nbecome more common.\nCooperative sourcing is a collaboration or negotiation between different companies with similar business processes. To save costs, the\ncompetitor with the best production capability can insource the business process of the other competitors. This practice is especially\ncommon in IT-oriented industries as a result of low to no variable costs, e.g. banking. Since all of the negotiating parties can be\noutsourcers or insourcers, the main challenge in this collaboration is to find a stable coalition and the company with the best production\nfunction. High switching costs, costs for searching potential cooperative sourcers, and negotiating may result in inefficient solutions.\nForming a Strategic Alliance\nUpper management is tasked with the developing complex interactive strategies when entering a strategic alliance. Aligning stakeholders\nfrom different businesses and ensuring the costs do not outweigh the benefits requires careful managerial consideration. The following\nsteps highlight key aspects of the strategic alliance process:\nStrategy development involves studying the alliance's feasibility, objectives, and rationale; it also entails focusing on the major issues and\nchallenges and development of resource strategies for production, technology, and people. It requires aligning alliance objectives with\nthe overall corporate strategy.\nPartner assessment involves analyzing a potential partner's strengths and weaknesses; creating strategies to accommodate all partners'\nmanagement styles; preparing appropriate partner selection criteria; understanding a partner's motives for joining the alliance; and\naddressing resource capability gaps that may exist for a partner.\nContract negotiation involves determining whether all parties have realistic objectives; forming high-caliber negotiating teams; defining\neach partner's contributions and rewards as well as protecting any proprietary information; addressing termination clauses and penalties\nfor poor performance; and highlighting the degree to which arbitration procedures are clearly stated and understood.\nAlliance operations comprise addressing senior management 's commitment; finding the caliber of resources devoted to the alliance;\nlinking budgets and resources to strategic priorities; measuring and rewarding alliance performance; and assessing the performance and\nresults of the alliance.\nAlliance termination entails winding down the alliance—for instance, when its objectives have been met or cannot be met or when a\npartner adjusts priorities or reallocates resources elsewhere.\nPotential Benefits of Strategic Alliances\nBenefits of strategic alliances vary according to each business's strengths and objectives and may include:\nPooling expensive resources and share development or R & D costs on new products\nLocking in supply chains\nBuilding credibility with customers (\"Our strategic partners include...\")\nAllowing each partner to concentrate on activities that best match its capabilities\nLearning from partners and developing competencies that may be more widely exploited elsewhere\nCreating adequate suitability of resources and competencies for an organization to survive\nE-Business Strategy\nIn the emerging global economy, e-business has become an increasingly necessary component of business strategy.\nLearning Objectives\nDefine and explain the general value chain of an e-business strategy and its advantages\nKey Takeaways\nKey Points\nThe integration of information and communications technology (ICT) has revolutionized relationships within organizations and among\norganizations and individuals. It has also enhanced productivity, encouraged greater customer participation, enabled mass customization,\nand reduced costs.\nCompanies use ICT to enhance e-business, which includes any process that a business organization (either a for-profit, governmental, or\nnon-profit entity) conducts over a computer-mediated network.\nE-business enhances three primary processes: those related to production, customer focus, and internal management.\nKey Terms\ne-commerce: Commercial activity conducted via the Internet.\ne-learning: An online platform for training modules, whether internal or external to an organization.\ne-business: A business that operates partially or primarily over the Internet, usually providing services to other businesses.\nThe term electronic business (commonly referred to as E-business or e-business) is sometimes used interchangeably with e-commerce. In\nfact, e-business encompasses a broader definition that includes not only e-commerce, but customer relationship management (CRM),\nbusiness partnerships, e-learning, and electronic transactions within an organization.\nAutomated online assistant: In\ne-commerce, electronic (i.e.,\nonline) purchasing and ordering\ncan be enhanced by the use of\nautomated online assistants like\nthis. This greatly reduces the\nburden on the company's\ncustomer service team, allowing\nthem to deal with only the most\nhighly escalated cases.\nElectronic-business methods enable companies to link their internal and external data-processing systems more efficiently and flexibly, to\nwork more closely with suppliers and partners, and to better satisfy the needs and expectations of customers. In practice, e-business is\nmore than just e-commerce. While e-business refers to a strategic focus with an emphasis on the functions that occur using electronic\ncapabilities, e-commerce is a subset of an overall e-business strategy.\nE-Business Process\nE-business involves business processes that span the entire value chain: electronic purchasing and supply-chain management, electronic\norder processing, customer service, and business partner collaboration. Special technical standards for e-business facilitate the exchange\nof data between companies. E-business software allows the integration of intrafirm and interfirm business processes. E-business can be\nconducted using the Internet, intranets, extranets, or some combination of these.\nIn the emerging global economy, e-commerce and e-business have become increasingly necessary components of business strategy and\nstrong catalysts for economic development. The integration of information and communications technology (ICT) in business has\nrevolutionized relationships within organizations and those among organizations and individuals. Specifically, the use of ICT in business\nhas enhanced productivity, encouraged greater customer participation, and enabled mass customization.\nAdvantages of E-Commerce\nE-business enhances three primary processes:\nProduction processes including procurement, ordering and replenishment of stocks; processing of payments; electronic access to suppliers;\nand production control processes\nCustomer-focused processes including promotional and marketing efforts, Internet sales, customer purchase orders and payments, and\ncustomer support\nInternal management processes including employee services, training, internal information-sharing, videoconferencing, and recruiting.\nElectronic applications enhance information flow between production and sales forces to improve sales-force productivity. ICT improves\nthe efficiency of work-group communications and electronic publishing of internal business information.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}