{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nTypes of Plans\nOverview of Types of Strategic Plans\nThe broader overview of strategic plans, as well as the five subgroups within strategic planning, provide businesses with direction.\nLearning Objectives\nDifferentiate between the five general planning frames and recognize considerations that must be made prior to planning\nKey Takeaways\nKey Points\nStrategic plans are what communicate the corporate strategy, direction, and resource allocation. There are generally five subgroups of\nstrategic plans.\nShort-range plans generally constitute a specific time frame in which a specific series of operations will be carried out, assessed, and\nmeasured.\nLong-range plans are arguably the most crucial to the continued success of a business, ultimately highlighting the way in which\noperations interact to achieve long-term profitability and returns on investment.\nOperational plans comprise the most specific subgroup of strategic planning, describing the specific objectives and milestones a business\nshould consider in executing each particular operation. Operational plans are often used by control professionals.\nStanding plans are based on the operations that must be repeated indefinitely within a business or corporation.\nAs opposed to standing plans, single-use plans cover a specific operation or process that is an outlier to normal operations.\nKey Terms\nstrategic planning: An organization's process of defining its direction and making decisions on allocating resources to pursue that\ndirection.\nstanding plan: A strategy for achieving an objective that can be continually used or modified.\nsingle-use plans: A strategy for achieving an objective that can only be used in one situation.\nStrategic management is primarily concerned with the planning and execution processes that lead to the effective operations of a\nbusiness. Strategic management leverages strategic planning in order to design and execute a variety of plans specifically created to\napproach various facets of the business and competitive environment. It is worth analyzing the broader overview of strategic plans, as well\nas the five subgroups within strategic planning that provide businesses with an outline of their strategic direction.\nStrategic plans are what communicate the corporate strategy, direction, and resource allocation.\nFactors of a strategic plan: This illustration summarizes the various factors\nthat must be considered in constructing a corporation's strategic plan. At\nthe pinnacle of the pyramid is the most important element of any strategic\nplan—the vision. Under that, in descending order, are accountability,\nstakeholder involvement, tools and skills, enabling behavior, and measures\nand processes.\nSpecific Types of Plans\nFollowing the generation of a vision and mission statement, and the subsequent operations that will allow these to be achieved, smaller\nfacets of the planning process begin to come into play. These include five general planning frames, which can be applied to different\naspects of the operational process:\nShort-range plans: Short-range plans generally apply to a specific time frame in which a specific series of operations will be carried out,\nassessed, and measured. The standard short-range plan will represent annual or semiannual operations with a short-term deliverable.\nThese short-term plans cover the specifics of each day-to-day operation.\nLong-range plans:Long-range plans are arguably the most crucial to the continued success of a business, ultimately highlighting the way\nin which operations interact to achieve long-term profitability and returns on investment. As corporations grow in size and complexity, so\ndo the long-range plans that constitute the interaction of individual processes. Long-range plans are those most closely related to the\noverall strategic-planning process.\nOperational plans:Operational plans are the most specific subset of strategic planning, describing the specific objectives and milestones a\nbusiness should consider in executing each particular operation. Operational plans establish both the budgetary resources necessary for\nexecution and the tangible and easily assessed objectives that can define the success of any given project.\nStanding plans:Standing plans are based on the operations that must be repeated indefinitely within a business or corporation. Standing\nplans govern the processes that occur regularly, providing an overview for consistent activities.\nSingle-use plans:As opposed to standing plans, single-use plans cover a specific operation or process that is an outlier to normal\noperations. In all likelihood, a single-use plan will never need to be repeated and will simply cover the content involved in one\ncircumstance.\nBy combining all of these plans—often a few of each subgroup, depending on the scale and complexity of a business—a general strategic\noverview can be obtained. The interaction of all of these plans constitute the overall strategic trajectory of a business, measuring\nprofitability and efficiency as the company executes operations.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}