{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nManaging Change for Employees\nPhases of Organizational Change: Lewin\nKurt Lewin's phases of change (unfreezing, change, and freezing) describe how people react and adapt to change.\nLearning Objectives\nExplain Kurt Lewin's Phases of Changes model, a three-stage process allowing for organizational change\nKey Takeaways\nKey Points\nKurt Lewin described change as a three-stage process that includes unfreezing, change, and freezing. Lewin emphasizes that change is\nnot a series of individual processes but rather one that flows from one process to the next.\nThe first stage (unfreezing) involves overcoming inertia and dismantling the existing \"mind set.\" This involves getting over the initial\ndefense mechanisms that people exhibit to avoid making a change.\nIn the second stage, the actual change occurs. This is typically a period of confusion and transition in which people are unsure about the\nchange and what may happen in the future.\nIn the third stage (freezing), the new mindset of the change begins to become the standard, and people's comfort levels return to normal.\nAlthough some managers still use Lewin's model, its most important contribution is the idea that change should be thought of as a\nprocess instead of as individual stages.\nKey Terms\nOrganizational Psychology: The scientific study of employees, workplaces, and organizations.\nDefense Mechanisms: Psychological strategies (such as denial, repression, or rationalization) that are brought into play to avoid or adjust\nto uncomfortable situations.\nChange is a fundamental component of any organization looking to continuously improve and evolve. A few researchers and academics\nhave determined how to best model and present methods of change for managing employees. Kurt Lewin was one of these academics\nand was known as one of the leaders of organizational psychology.\nKurt Lewin: Lewin was\nan influential behavioral\nand organizational\npsychologist who\nproposed the Phases of\nChange Model.\nThe Three Phases of Change\nThis early model developed by Lewin describes change as a three-stage process of unfreezing, change, and freezing. In this Phases of\nChange Model, Lewin emphasizes that change is not a series of individual processes but rather one that flows from one process to the\nnext.\nThe first stage (unfreezing) involves overcoming inertia and dismantling the existing mind set. It involves getting over the initial defense\nmechanisms that people exhibit to avoid making a change. People eventually realize that change is necessary and urgent, and this\nrealization allows them to move on to the next stage.\nIn the second stage, the actual change occurs. This is typically a period of confusion and transition in which people are unsure about the\nchange and what may happen in the future. People are aware that the old ways are being challenged, but they do not yet have a clear\npicture as to what these ways will be replaced with. During this stage, an organization's leaders need to focus on clearly communicating\nto employees the reasons for change and the steps needed to achieve it.\nLewin labeled the third and final stage freezing, though it may be useful to think of this stage as \"refreezing.\" During this stage, the new\nmindset of the change begins to become the standard, and people's comfort levels return to normal. Many people criticize this\ncomponent of Lewin's model, arguing that there is never time for people to comfortably adapt to change in the fast-paced world of\ntoday.\nAlthough some managers still use Lewin's model, its most important contribution is the idea that change should be thought of as a\nprocess instead of individual stages. This is important for understanding how employees may react to change in the workplace and why\nsome may adapt more quickly to change than others.\nStrategies for Successful Organizational Change\nTo implement a successful change, managers should focus on communication, training, monitoring, and counseling for the workforce.\nLearning Objectives\nEvaluate differing strategies for enabling changes within an organizational culture while mitigating resistance and issues\nKey Takeaways\nKey Points\nOrganizational change often elicits concern and discomfort among employees. Change is a human effort as much as it is a strategic one.\nDuring an organizational change, it is essential for managers to communicate the reasons for the change as well as the process needed to\nmake the change. This should include clear objectives and strategic implications.\nEffective education and training is essential for employees to understand and adapt to a change in the workforce.\nOne of the most important steps in managing a successful change is to monitor how the change is playing out in the organization.\nQuantitative tools can be used to measure and assess effectiveness.\nKey Terms\nproactive change: The shifting or transitioning of individuals, teams, and organizations from a current state to a desired future state\nbefore being incited by an event.\nreactive change: The shifting or transitioning of individuals, teams, and organizations from a current state to a desired future state in\nresponse to an event.\nUnderstanding Change Management\nWhen change is implemented in an organization, there is often resistance. This resistance often stems from people's fear—of change in\nthe work itself, of change in the process of completing work, or of the possibility that the change may result in the loss of their job. As a\nresult, managers and organizational leaders should have a strategic approach to enabling change that ensures it is maximally effective in\nthe organization.\nChange management is the study of how to integrate changes without damaging the organizational culture or efficiency. At its core,\nchange management is about knowing strategically what to change and how to manage the human element of this process. Change\nmanagement is broken into 4 elements:\nRecognize the changes in the broader business environment\nDevelop the necessary adjustments for the company's needs\nTrain employees on the appropriate changes\nWin the support of employees\nNote that a central themes of change management revolve around training and supporting employees. This is a critical managerial\nresponsibility for enabling change.\nKey Enablers to Change\nTransparency and Effective Communication\nDuring an organizational change, it is essential for managers to communicate the reasons for the change as well as the process needed to\nmake the change. For example, if management wants to implement a procedure that will help to improve the production of the\nworkforce, but they require a lot of initial labor to get the new procedure up and running, they should communicate why the change in\nprocedure is necessary. If staff understands why the change is taking place, they will be more likely to agree with the implementation and\nsee the benefit.\nEffective Education and Training\nEducation and training is essential for employees to understand and adapt to a change in the workforce. When a new process is put into\nplace, employees will likely be unfamiliar with the process and how it will fit into their daily workflow. Training in this situation is necessary\nto help employees become familiar with the change and better adapt to it.\nPersonal Counseling\nWhen a major change happens in the workplace, some employees may feel very uncomfortable about the change—especially the\nemployees most affected by the change. For these employees it may be useful to have a program, most likely through human resources,\nthat will help them adapt to the change.\nMonitoring the Implementation\nOne of the most important steps in managing a successful change is to monitor how the change is playing out in the organization. This\ncan be done by looking at historical data and examining how employees are performing with the change compared to how they were\nperforming in the past. Additionally, management will want to monitor how the change is affecting the overall production process. If the\nchange is not improving the process after the initial implementation, management may want to fine-tune the process to make sure that\nthe change is successful.\nGeneric strategy: Maintaining focus on learning and\ngrowth (e.g., employee training), internal business\nprocesses (e.g., establishing partnerships), customer-\noriented processes (e.g., inspiring loyalty), and financial\nconcerns (e.g., maximizing shareholder value) is integral to\nsuccessful change management.\nSteps to Smooth Organizational Change: Kotter\nKotter's model details a process where managers may initiate, direct, implement, and foster organizational change via employee\nengagement.\nLearning Objectives\nEmploy John Paul Kotter's eight step model to outline steps toward smooth and efficient change in an organization\nKey Takeaways\nKey Points\nJohn Paul Kotter is a former professor at the Harvard Business School and is regarded as an authority on leadership and change.\nThe eight stages of Kotter's change model include: increase urgency, build the guiding team, get the vision right, communicate for buy-in,\nempower action, create short-term wins, don't let up, and make change stick.\nBy following Kotter's eight steps, managers can implement change and make it an integral part of the organization 's culture. This is\naccomplished by making sure that change sticks with the culture and becomes an expected part of the continued development of the\norganization.\nKey Terms\nvision: A clear, distinctive, and specific vision of the future, usually connected with a leader's strategic advances for the organization.\nBuy-in: Support; agreement; approval; blessing (in a secular sense). A sense of believability in the potential outcomes achieved through\ngroup process.\nJohn Paul Kotter\nJohn Paul Kotter (born 1947) is a former professor at the Harvard Business School, an acclaimed author, and Chief Innovation Officer at\nKotter International. He is regarded as an authority on leadership and change. Kotter created the Eights Steps to Change Model that is\ncurrently the most widely-used framework for managing organizational change. In his observations, Kotter concluded that the\norganizations that are the most successful in implementing change go through the following series of eight steps.\nThe Eight Steps\n1. Increase urgency: Managers must inspire people to move, make objectives real and relevant, and further their desire to make change\nhappen. Getting momentum for change is key.\n2. Build the guiding team: The company must get the right people in place as leaders with the right emotional commitment and\nunderstanding and the right mix of skills and levels.\n3. Get the vision right: Managers must get the team to establish a simple vision and strategy and then focus on the emotional and creative\naspects necessary to drive service and efficiency.\n4. Communicate for buy-in: Involving as many people as possible, managers must communicate the essentials and appeal and respond to\npeople's needs. Additionally, they must remove clutter and streamline technological communications, making it efficient rather than\noverwhelming for employees.\n5. Empower action: This step removes obstacles wherever possible, enables constructive feedback, and garners support from leaders—\ncomplete with motivational rewards that recognize progress and achievements.\n6. Create short-term wins: Managers must set aims that are easy to achieve in manageable chunks. They must also manage the number of\ninitiatives taking place at once and finish current stages before starting new ones.\nShort-term wins: A step in Kotter's model of\nchange is to celebrate short-term wins while\nworking toward an overall goal of change.\n7. Don't let up: Managers must foster and encourage determination, persistence, and ongoing progress reporting. This can be done by\nhighlighting achieved and future milestones.\n8. Make change stick: This step reinforces the value of successful change via recruitment, promotion, and new change leaders. The\ncompany should change a fundamental part of the culture during this step so people do not consider it as foreign.\nBy following these eight steps to successful change, managers can work to mitigate the risks associated with changes that employees do\nnot like. In order to reduce potential organizational obstacles, managers have to make sure that all of their employees are on board with\nthe change and are willing to assist with it.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}