{
    "text": "Search... Home Subjects\nBoundless Management\nGroups, Teams, and Teamwork\nTypes of Teams\nTask Forces\nA task force is a temporary team created to address a single piece of work, a problem, or a goal.\nLearning Objectives\nKey Takeaways\nKey Points\nThe term \"task force\" originated in the United States Navy. A naval task force was designed to provide flexibility in operations since it\ncould be formed without the reorganization or repurposing of the fleet.\nToday, many organizations use task forces to bring together experts to assess, make recommendations, or take other actions to address a\nsingle issue or topic.\nKey Terms\nentrant: A participant.\nsubstitute: A replacement or stand-in for something that achieves a similar result or purpose.\n\"Task force\" is a phrase that originated in the United States Navy during World War II. At the time, naval operations were performed by\nformal groupings such as fleets or squadrons, but the war created new challenges for the U.S. Navy that demanded flexibility in how\nresources were used. Formation of a task force allowed officers and equipment that formally belonged to different groups to come\ntogether for a single specific purpose, without reassigning responsibility for those assets or requiring the reorganization or repurposing of\nthe fleet. Task forces were temporary and easily disbanded after their work was complete.\nToday, in government, business, and other arenas, task forces are special ad-hoc committees created especially to deal with single\nproblems or issues. For example, the U.S. Preventive Services Task Force (USPSTF) comprises independent national experts in prevention\nthat use evidence-based and clinical preventative techniques to improve health outcomes for Americans. Examples of this kind of care\nwould be routine screenings for disease, such as mammograms. As in the USPSTF, members of a task force are typically experts, and the\ngroup operates with a specific charge and within a specific time frame. The task force usually begins by assessing the factors that relate to\nits work. Next, the team typically identifies and analyzes possible solutions and develops recommendations and plans for implementing\nthem.\nGenerally, a task force will not have responsibility for implementing its recommendations once they are made, although individual team\nmembers may have a role in doing so. Task forces do not have the power to compel others to accept their recommendations. Indeed, the\nresults of their work may be accepted in part, rejected in part, or even ignored altogether.\nA team created by political parties to deal with campaign finance reform is an example of a task force. The task force is expected to study\nthe issue, assess possible actions to be taken, and then make its recommendations in the form of a report. The results of the task force's\nefforts then might be used by legislators to draft laws that would redefine acceptable practices for funding political campaigns.\nCross-Functional Teams\nA cross-functional team comprises people from different departments and with special areas of expertise working to achieve a common\ngoal.\nLearning Objectives\nExplain the purpose and benefit of cross-functional teams\nKey Takeaways\nKey Points\nCross- functional teams combine people with different areas of expertise from separate departments such as finance, human resources,\nand marketing.\nThe range of knowledge on cross-functional teams creates a broader perspective that can lead to new ideas and better solutions and also\navert risks and poor outcomes.\nThe diversity of cross-functional teams can create challenges to effective communication and collaboration.\nCross-functional teams include members who bring different types of knowledge and experience from areas such as finance, engineering,\nhuman resources, and marketing. These teams occasionally may draw on subject-matter expertise from outside the organization by\ninviting external consultants or customers to join a team. By combining people with diverse task-related backgrounds, cross-functional\nteams can take a broader approach to addressing a problem or completing a set of activities. This can lead to new ideas and more\ncreative solutions. It can also make a team's efforts more efficient and effective by including information that can help avert risks or poor\noutcomes.\nTeam: Cross-functional teams combine people with\ndifferent knowledge and perspectives.\nExample of a Cross-Functional Team\nMany business activities require cross-functional collaboration to achieve successful outcomes. A common example is service\nimprovement. To better meet customer expectations and achieve higher satisfaction rates, a company first needs to understand what\ncustomers are looking for. The marketing department is responsible for gathering that type of customer data. Operations staff members\nhave expertise in how to design the process for delivering a service, so they would need to be involved in making any changes to that\nsystem. The human resources department oversees training, and employees may need new skills to succeed with the new process. If any\ninformation technology is involved in supporting the service improvement, then people from that department should be on the team.\nFinally, accountants may be needed to identify any new costs and additional savings. In this example, the team brings together people\nfrom five different functional areas.\nChallenges of Cross-Functional Teams\nEven though diversity of knowledge and perspective is the big advantage of cross-functional teams, it can also be a source of problems.\nPeople who work in the same discipline or area have a common understanding and a terminology for their work that is unknown to\nothers. Shorthand expressions or common acronyms that are familiar to one person may be confusing to others. This can make\ncommunication between members of a cross-functional team difficult and subject to misunderstanding.\nCross-functional teams may be more likely than less complex teams to have members with divergent perspectives on how work gets\ndone. For instance, engineers value precision and attention to detail, while those who come from more creative areas such as marketing\nmay prefer a less rigid approach. These differences in styles may also be reflected in the personalities of team members. It can take extra\neffort to collaborate when you have to take into account the preferences and styles of widely dissimilar individuals.\nIn some organizations certain departments have more status than others. A common distinction is between those in areas that contribute\ndirectly to revenue, such as sales and manufacturing, and those that do not, including support departments like purchasing and IT.\nPerceived differences in relative importance or credibility can undermine the effectiveness of cross-functional collaboration.\nVirtual Teams\nA virtual team is a temporary group created to accomplish specific tasks by using technology to collaborate remotely.\nLearning Objectives\nDifferentiate among the six most common types of virtual teams and discuss the challenges they face\nKey Takeaways\nKey Points\nVirtual teams rely upon computing and communications technology, especially Internet access.\nVirtual teams are prevalent in today's workforce, as they can be cost- effective and take advantage of technology and the availability of\ndistributed employees.\nIn order to function properly, virtual teams demand effective coordination in the form of project management.\nThere are six common types of virtual teams: networked teams, parallel teams, project development teams, functional teams, service\nteams, and offshore information-systems development teams.\nKey Terms\nTask processes: The various ways that the virtual team accomplishes work: communication, coordination of work efforts, and a fit\nbetween the technology and the task at hand.\nA virtual team is a group of individuals in different geographic locations who use technology to collaborate on work tasks and activities.\nThe use of this kind of team has become prevalent in organizations due to the reduced costs of technology, the increased availability of\ncollaborative technologies, the shift toward globalization in business, and greater use of outsourcing and temporary workers. Virtual\nteams require effective project management to facilitate communication and coordinate member activities.\nTypes of Virtual Teams\nThere are six common types of virtual teams.\nNetworked teams are loosely organized; they are usually formed to address a short-term objective and are dissolved after they\naccomplish that objective. Similar to task forces and cross-functional teams, networked teams frequently bring together people with\ndifferent expertise to bring broad perspectives to discussing an issue or problem.\nParallel teams are highly task-focused and draw on individuals from different functional areas and locations. While they generally\ncomplete their work on a defined schedule, parallel teams may not be disbanded but may instead remain to take on a subsequent set of\ntasks.\nProject development teams work on complex sets of activities over a long time period. They may be formed to develop new products,\ndeliver a new technology system, or redesign operational processes.\nFunctional teams are comprised of people from the same department or area who collaborate on regular and ongoing activities,\nexamples of which include providing training, executing marketing initiatives, and conducting research and development.\nService teams work with customers to address their purchasing and post-purchase needs. These teams enable a company to provide\nconsistent service, often 24/7, to support customers wherever they are.\nFinally, information systems development (ISD) teams make use of lower-cost labor, typically offshore, to develop software. They are\ntypically created by dividing up the work of larger projects and assigning specific pieces to independent contractors or teams of\ndevelopers.\nChallenges of Virtual Teams\nThe geographic dispersion of team members and the lack of regular face-to-face meetings present three challenges to the success of\nvirtual teams.\nCoordination of tasks: A virtual team needs a clear set of objectives and a plan for how to achieve them in order to focus and direct\ncollaboration among team members. They need clear guidelines and norms for how individuals will accomplish their work. Even more\nthan traditional teams where individuals work in the same location and time zone, virtual teams require effective project management to\nfacilitate communication and coordination of tasks among members.\nTeam-member skills: Beyond their functional expertise and experience, virtual team members need to be effective users of technologies\nsuch as video conferencing and other collaboration tools. They must learn to communicate well in writing to avoid misinterpretations that\nmight be more easily avoided in a face-t0-face conversation. When virtual teams cross national boundaries, differences in language and\nculture require the ability to negotiate barriers to communication and collaboration.\nRelationships: Virtual team members need to build relationships with colleagues through the use of technology, which can often seem\nimpersonal. Distance and lack of regular personal interaction can make it difficult for trust and group cohesion to develop. When these\nare missing, team members can lose focus and collaboration can suffer, leading to delays, conflict, and other performance issues.\nSelf-Managing Teams\nA self-managing team is a group of employees working together who are accountable for all or most aspects of their task.\nLearning Objectives\nCompare the advantages and disadvantages of self-managing teams.\nKey Takeaways\nKey Points\nSelf-managing teams share work tasks and supportive or managerial tasks.\nBecause they are both responsible for their outcomes and in control of their decision -making process, members of the self-managing\nteam may be more motivated and productive than traditional teams.\nSelf-managing teams are different from self-directed teams. Self-managing teams work toward goals that are set for them by outside\nleadership, whereas self-directed teams work toward a common goal that they define.\nKey Terms\nself-managing team: A group with a common purpose in which tasks and responsibilities are determined by the members.\nA self-managing team is a group of employees working together who are accountable for most or all aspects of their task. A self-\nmanaging team has considerable discretion over how its work gets done. This means the majority of key decisions about activities are\nmade by people with direct knowledge of, and who are most affected by, those choices. Self-managing teams are distinct from self-\ndirected teams. While the latter define their own goals, the scope of a self-managing team's authority is limited by goals that are\nestablished by others.\nSelf-management: This diagram illustrates the idea that virtual,\nmanagement, and work teams can be empowered by being\nallowed to self-manage and monitor the quality of their own\noutput.\nAdvantages of Self-Managing Teams\nOrganizations in various fields use self-managing teams to boost productivity and motivate employees. Members of self-managing teams\nplan, coordinate, direct, and control their activities. For example, they set the work schedule and assign tasks. In this way they share both\nthe managerial and technical tasks. Team members also share responsibility for their output as a whole, which can inspire pride in their\naccomplishments. Because they eliminate a level of management, the use of self-managing teams can better allocate resources and even\nlower costs.\nDisadvantages of Self-Managing Teams\nThere are also potential drawbacks to self-managing teams. The lack of hierarchical authority means that personal relationships can\noverwhelm good judgment. It can also lead to conformity, which can inhibit creativity or make it difficult for team members to be critical\nof each other. Self-management adds a layer of responsibility that can be time-consuming and require skills that some team members\nmay not have. Members of a self-managing team often need training to assist them in succeeding at jobs that have a broad scope of\nduties.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}