{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nMotivating an Organization\nThe Importance of Motivation\nMotivating employees can lead to increased productivity and allow an organization to achieve higher levels of output.\nLearning Objectives\nIdentify the importance of generating high levels of motivation in employees within an organizational behavior framework\nKey Takeaways\nKey Points\nMotivation is generally what energizes, maintains, and controls behavior.\nThe role of motivation in the workplace is straightforward theoretically but is difficult to actually measure.\nSalary is often enough motivation to keep employees working for an organization, but it's not always enough to push them to fulfill their\nfull potential.\nMotivated employees will retain a high level of innovation while producing higher- quality work at a higher level of efficiency.\nThe opportunity cost in motivating employees is essentially zero.\nKey Terms\nproductivity: The rate at which products and services are generated relative to a particular workforce.\nOpportunity cost: The value of investing in the next best alternative; the value forfeited by taking a particular route.\ninnovation: The introduction of something new; the development of an original idea.\nMotivation in the Workplace\nGenerally speaking, motivation is what energizes, maintains, and controls behavior. As such, it is clear why it plays an important role in the\nworkplace. But empirically measuring that role is another matter; it is challenging to capture an individual's drive in quantitative metrics in\norder to ascertain the degree to which higher motivation is responsible for higher productivity. However, it is widely accepted that\nmotivated employees generate higher value and lead to more substantial levels of achievement. The management of motivation is\ntherefore a critical element of success in any business; with an increase in productivity, an organization can achieve higher levels of\noutput.\nResearch has shown that motivated employees will:\nAlways look for a \"better\" way to complete a task\nBe more quality-oriented\nWork with higher productivity and efficiency\nIn summary, motivated employees will retain a high level of innovation while producing higher-quality work more efficiently. There is no\ndownside—i.e., the opportunity cost of motivating employees is essentially zero, assuming it does not require additional capital to coach\nmanagers to act as effective motivators.\nInternal and External Motivation\nSalary is often enough to keep employees working for an organization, but it's not always necessarily enough to push them to fulfill their\nfull potential. Herzberg's theory emphasizes that while salary is enough to avoid dissatisfaction, it is not necessarily enough to propel\nemployees to increase their productivity and achievement. In fact, the output of employees whose motivation comes solely from salary\nand benefits tends to decline over time. To increase employees' efficiency and work quality, managers must turn to understanding and\nresponding to individuals' internal and external motivations. External motives include work environment (e.g., cramped cubicle vs. airy,\nopen office); internal motivations include thoughts and emotions (e.g., boredom with performing the same task over and over vs.\nexcitement at being given a wide variety of project types).\nInternal and external motives: There are four\nsources of motivation. The three internal motives are\nneeds, cognitions, and emotions. The fourth source\nconsists of external motives.\nPerspectives on Motivation\nMotivation in the workplace is primarily concerned with improving employees' focus through the use of incentives.\nLearning Objectives\nCompare and contrast the organizational behavior theories regarding analyzing and improving motivation in the workplace\nKey Takeaways\nKey Points\nGenerally, motivation in the workplace can be thought of through one of four specific theoretical frameworks: needs-oriented, cognition-\noriented, behavior -oriented, and job-oriented.\nIn needs-oriented theories, motivation is achieved through fulfilling a particular employee's needs, with anything from salary to a sense of\nfulfillment.\nIn cognition-oriented theories, motivation is achieved through fulfilling employees' rational expectation that they be compensated based\ndirectly on the amount of value they provide.\nIn behavior-oriented theories, motivation is achieved through conditioning ( reinforcement and punishment). Conditioning is the\nimplementation of positive incentives to promote desirable behaviors and negative consequences to discourage undesirable behaviors.\nIn job-oriented theories, motivation is achieved when employees feel fulfilled and interested in their work; financial compensation is only\nenough to avoid dissatisfaction.\nKey Terms\nconditioning: A technique of behavior modification, developed by B.F. Skinner, that utilizes positive and negative reinforcement and\npositive and negative punishment to alter behavior.\nincentive: A reward used to motivate employees to perform better.\nFrom a managerial perspective, very few ideas are more important than the dynamics of motivation. Understanding what moves\nemployees toward efficiency and fulfillment is at the core of any manager's responsibilities. Motivation in the workplace is primarily\nconcerned with improving employees' focus, often through pursuing positive incentives and avoiding negative ones.\nTheories of motivation are of course rooted in psychology. An individual must direct their attention toward a task, generate the necessary\neffort to achieve that task, and persist in working toward it despite potential distractions. Various theories have attempted to identify the\nfactors that contribute to effective employee motivation, most of which are easily divided into four broad categories:\nNeeds-oriented theories\nCognition-oriented theories\nBehavior-oriented theories\nJob-oriented theories\nNeeds-Oriented Theories\nAt its most basic, motivation can be defined as the fulfillment of various human needs. These needs can encompass a range of human\ndesires, from basic, tangible needs of survival to complex, emotional needs surrounding an individual's psychological well-being.\nHierarchy of Needs\nThe most well-known example of a needs-oriented theory of motivation is Maslow's Hierarchy of Needs. Maslow postulated that needs\nshould be fulfilled in a particular scaffolded order, with food, water, and shelter in the bottom, most fundamental two tiers and intangible\nneeds such as fulfillment, self-esteem, and a sense of belonging in the upper three tiers. While this framework makes a certain amount of\nlogical sense, critics have noted that there have been minimal data that suggest employees strive to satisfy needs in the workplace in\naccordance with this hierarchical framework. But the fundamental idea behind Maslow's model is that individuals have various tangible\nand intangible desires that can be leveraged in the use of motivational incentives.\nMaslow's Hierarchy of Needs: Maslow's Hierarchy of Needs\npostulates that need must be fulfilled in a hierarchical order, from\nbasic needs such as food and water to more intangible needs such\nas self-esteem and a sense of belonging.\nNeed for Achievement Theory\nAtkinson and McClelland proposed the Need for Achievement Theory, which highlights three particular needs in the context of the\nworkplace: achievement, authority, and affiliation. Atkinson and McClelland hypothesized that every individual has a need for all three of\nthese intangible segments of fulfillment but that most individuals lean more toward one of the three. For example, a salesman with a\nquota to fulfill would be best paired with an achievement-oriented manager, as such a goal-oriented approach toward, for example, a\nspecific number of sales would be highly motivating.\nCognition-Oriented Theories\nCognition-oriented theories generally revolve around expectations and deriving equitable compensation for a given effort or outcome.\nThere are two main cognition-oriented theories: equity theory and expectancy theory.\nEquity Theory\nEquity Theory is based on the basic concept of exchange. It values the culmination of employee experience, skills, and performance\nagainst their respective compensation and advancement opportunities.\nExpectancy Theory\nExpectancy Theory is similarly derived, but it states this relationship through an equation: Motivation = Expectation (Σ Instrumentality ×\nValence ). Instrumentality simply refers to the belief that a level of performance will result in a level of outcome; valence refers to the value\nof that outcome.\nEssentially, Expectation Theory and Equity Theory demonstrate the value of rewarding an employee's investment of time and effort with\nappropriate compensation.\nBehavior-Oriented Theories\nThe underlying concept of behavioral approaches to motivation is rooted in theories of \"conditioning,\" particularly the work of\npsychologist B.F. Skinner. Behaviorism stipulates that an employer should promote positive behavior and deter negative behavior,\ngenerally through a basic rewards system. Variable compensation, as found in many sales jobs, is a prime example of this concept. When\nan employee makes a sale, the employer provides a certain portion of income to the employee that executed that sale. This positive\nreinforcement serves as a behavior modifier, motivating the employee to repeat this behavior and make more sales.\nJob-Oriented Theories\nJob-oriented theories adhere to the view that employees are motivated to complete tasks effectively because of an innate desire to be\nfulfilled or to contribute and that compensation and other forms of incentives are less important to them.\nTwo-Factor Theory\nFrederick Herzberg's Two-Factor Theory is the most well known of the job-oriented theories, despite the fact that it has not been\nsupported by empirical evidence. Herzberg states that salary, benefits, status, and other tangible benefits for employees can only reduce\ndissatisfaction and that intangibles—such as autonomy, natural interest, recognition, and the responsibility of the work itself—are the true\nbasis of motivation.\nWork Engagement Theory\nOther theories, such as Work Engagement Theory, similarly propose that intellectually fulfilling and emotionally immersive work is the\nfoundation of a motivated workforce.\nClearly, our understanding of workplace motivation could benefit from further research and empirical analysis. But the variety of theories\nalso highlights the fact that people can be motivated by different things in different circumstances. Effective organizational management\nrequires an understanding of these theories as well as of their possible limitations.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}