{
    "text": "BUSINESS ADMINISTRATION\nStudy Material\nCLASS XII Curriculum - Business Administration\nTopics Topics to be covered Marks allocated\nConcept of Business Meaning of terms “Business” and Administration 8\n“Administration”\nLegal Framework/obligations of Forms of Business organizations\nIntroducing Business Interest\nLobby organizations – e.g. Chambers of Commerce and how to use\nthem\nPractice Session: In Groups, To understand the concepts and\nintegration of Business and Administration, concept of People\nManagement – Leadership/ Motivation needs to be brought in Place.\nA brief overview needs to be shared to set the base for the next\nmodule.\nThis module should include- Concept of Human Resources (Meaning.\nManagement, Relevance) that ultimately run the business.\nConcept of People Role of Leadership 8\nManagement\nMotivation\nConflict Management\nInterpersonal Relations (Johari Window Concepts)\nIn continuation with the last module, this module should focus on\ntheory as well as practical implications of these principles.\nThe pedagogy should be such that it focuses on cases, activities,\nsimulations & role plays to understand the behavior of people at\nwork.\nConcept of Business Innovation in form of Entrepreneurship needs to be taught 8\nPlan\nVarious ingredients of Business Plan\nConcept of performance and Profit\nBudget and their monitoring\nTools of Budget Analysis/Corrective Action Introduction to Vouchering Accounting 8\nBusiness\nPrimary and secondary Books of accounts\nComputerized Accounts\nAnalysing Accounts for performance Improvements\nPLA, Balance sheet, Debit , Credit, Primary Accounting\nBusiness Principles of Business Correspondence 5\nCorrespondence\nForms of Common Business letters\nPractice in Business writing\nBusiness Rules of Good Business Communication 8\nCommunication\nCommunication and Teamwork\nCommitment to Business organization\nIn continuation with the module of “Workplace environment” this\nneeds to be covered from the holistic point of view.\nTopics like – Motivation, Leadership and Organization Commitment\nto be covered in detail\nAnother logical topic is Organization Citizenship Behavior. This is\nagain in tune with the current demand of businesses.\nBusiness and Concept of Responsible Corporate Citizen 5\nEnvironment\nCorporate Social Responsibility\nTechnology in How I.T. has changed Business 5\nBusiness\nBusiness and Social Networking\nDangers in business through I.T.\nE-commerce Do’s and don’ts. And integration of other related\ntechnology aspects could be covered.\nIntegration of This Module is of extreme relevance so as to enable the students 5\nDifferent Branches understand different branches of management that are linked with\nof Management Business.\nOverview of Production Management\nOverview of Financial Management Overview of Supply Chain Management\nOverview of IT Management\nOverview of Human Resources Management\nOverview of Marketing Management\nAll these topics have been discussed in some point or the other in the\ncurriculum\nOnly a quick recap and understanding needs to be reiterated in the\nsystem so as to set the base for the next level of specialization for the\nstudents.\nThis would also add value to the students in terms of understanding\nthe technical nature of businesses. 1.1 BUSINESS ADMINISTRATION - CONCEPT, OBJECTIVES, IMPORTANCE\nCONCEPT OF BUSINESS\nLiterally, the word “business” means the state of being busy. Generally, the term\nbusiness includes all human activities concerned with earning money. In other words,\nbusiness is an activity in which various persons regularly produce or exchange goods\nand services for mutual gain or profit. The goods and services produced or purchased\nfor personal use are not included in “business”.\nDEFINITION\n1.According to L. H. Haney\n“Business may be defined as human activities directed toward providing or acquiring\nwealth through buying and selling of goods.”\n2.James Stephenson says that:\n“Every human activity which is engaged in for the sake of earning profit may be called\nbusiness.”\n3.In the words of B. W. Wheeler\n“An institution organized and operated to provide goods and services to the society,\nunder the incentive of private gain” is business.\nBusiness administration in simple terms, is everything that encompasses a business. The\nadministration of a business includes managing and monitoring absolutely everything to\ndo with a business, from marketing, advertising, to the hiring and the management of staff. To explore business administration in great detail, we will explore each of your\nquestions separately.\n THE CONCEPT OF BUSINESS ADMINISTRATION:\nThe concept of business administration is the process of managing every\ndifferent angle of a business so it can run, expand, grow and succeed. Without\nbusiness administration, all areas of the business would go unmonitored and\nwould eventually break down.\nIn a business, there is usually a team or department of business administrators\nand their job is to monitor and manage every aspect of the business to ensure the\nbusiness has its best chance of succeeding. In short, the concept of business\nadministration is to over see the running of the company and working to ensure\nthe business is working, running to its best ability.\n THE IMPORTANCE OF BUSINESS ADMINISTRATION:\nThe importance of business administration is of course very high. In order for a\nbusiness to run properly and to be successful, every aspect of the business needs\nto work. In order for this to take place, business administrators should monitor,\nmanage and assess each element of the business, keeping records and analyzing\neach department's information on a regular basis to ensure everything is running\naccording to plan.\nBusiness administrators usually are the ones to make large important business decisions, too, which is of course again, exceptionally important. In short, a\nbusiness would very likely fail without a good business administration team.\n THE PROCESS OF BUSINESS ADMINISTRATION:\nThe process of business administration is the overseeing and controlling of a\nbusiness. This includes keeping a lot of records, monitoring and overseeing every\ndepartment and staffing and managing teams of employees.\n1.2 Business Administration functions - planning, organizing, staffing, directing\nand controlling\nBusiness Administration Management has been described as a social process involving\nresponsibility for economical and effective planning & regulation of operation of an enterprise in the fulfillment of given purposes. It is a dynamic process consisting of\nvarious elements and activities. These activities are different from operative functions\nlike marketing, finance, purchase etc. Rather these activities are common to each and\nevery manger irrespective of his level or status.\nDifferent experts have classified functions of Business Administration. According\ntoGeorge & Jerry, “There are four fundamental functions of Business Administration i.e.\nplanning, organizing, actuating and controlling”. According to Henry Fayol, “To manage\nis to forecast and plan, to organize, to command, & to control”. Whereas Luther Gullick\nhas given a keyword ’POSDCORB’ where P stands for Planning, O for Organizing, S for\nStaffing, D for Directing, Co for Co-ordination, R for reporting & B for Budgeting.\ni.e. PLANNING, ORGANIZING, STAFFING, DIRECTING AND CONTROLLING.\nFor theoretical purposes, it may be convenient to separate the function of management\nbut practically these functions are overlapping in nature i.e. they are highly inseparable\nEach function blends into the other & each affects the performance of others.\n1. Planning It is the basic function of management. It deals with chalking out a future course\nof action & deciding in advance the most appropriate course of actions for\nachievement of pre-determined goals. According to KOONTZ, “Planning is\ndeciding in advance - what to do, when to do & how to do. It bridges the gap from\nwhere we are & where we want to be”. A plan is a future course of actions. It is an\nexercise in problem solving & decision making. Planning is determination of\ncourses of action to achieve desired goals. Thus, planning is a systematic thinking\nabout ways & means for accomplishment of pre-determined goals. Planning is\nnecessary to ensure proper utilization of human & non-human resources. It is all\npervasive, it is an intellectual activity and it also helps in avoiding confusion,\nuncertainties, risks, wastages etc.\n2. Organizing\nIt is the process of bringing together physical, financial and human resources and\ndeveloping productive relationship amongst them for achievement of\norganizational goals. According to Henry Fayol, “To organize a business is to\nprovide it with everything useful or its functioning i.e. raw material, tools, capital\nand personnel’s”. To organize a business involves determining & providing\nhuman and non-human resources to the organizational structure. Organizing as a\nprocess involves:\n Identification of activities.\n Classification of grouping of activities.\n Assignment of duties.\n Delegation of authority and creation of responsibility.\n Coordinating authority and responsibility relationships.\n3. Staffing\nIt is the function of manning the organization structure and keeping it manned.\nStaffing has assumed greater importance in the recent years due to advancement\nof technology, increase in size of business, complexity of human behavior etc. The\nmain purpose o staffing is to put right man on right job i.e. square pegs in square holes and round pegs in round holes. According to Kootz & O’Donell, “Managerial\nfunction of staffing involves manning the organization structure through proper\nand effective selection, appraisal & development of personnel to fill the roles\ndesigned un the structure”. Staffing involves:\n Manpower Planning (estimating man power in terms of searching, choose\nthe person and giving the right place).\n Recruitment, Selection & Placement.\n Training & Development.\n Remuneration.\n Performance Appraisal.\n Promotions & Transfer.\n4. Directing\nIt is that part of managerial function which actuates the organizational methods\nto work efficiently for achievement of organizational purposes. It is considered\nlife-spark of the enterprise which sets it in motion the action of people because\nplanning, organizing and staffing are the mere preparations for doing the work.\nDirection is that inert-personnel aspect of management which deals directly with\ninfluencing, guiding, supervising, motivating sub-ordinate for the achievement of\norganizational goals. Direction has following elements:\n Supervision\n Motivation\n Leadership\n Communication Supervision- implies overseeing the work of subordinates by their superiors. It\nis the act of watching & directing work & workers.\nMotivation- means inspiring, stimulating or encouraging the sub-ordinates with\nzeal to work. Positive, negative, monetary, non-monetary incentives may be used\nfor this purpose.\nLeadership- may be defined as a process by which manager guides and\ninfluences the work of subordinates in desired direction.\nCommunications- is the process of passing information, experience, opinion etc\nfrom one person to another. It is a bridge of understanding.\n5. Controlling\nIt implies measurement of accomplishment against the standards and correction\nof deviation if any to ensure achievement of organizational goals. The purpose of\ncontrolling is to ensure that everything occurs in conformities with the\nstandards. An efficient system of control helps to predict deviations before they\nactually occur. According to Theo Haimann, “Controlling is the process of\nchecking whether or not proper progress is being made towards the objectives\nand goals and acting if necessary, to correct any deviation”. According to Koontz\n& O’Donell “Controlling is the measurement & correction of performance\nactivities of subordinates in order to make sure that the enterprise objectives and\nplans desired to obtain them as being accomplished”. Therefore controlling has\nfollowing steps:\na. Establishment of standard performance.\nb. Measurement of actual performance.\nc. Comparison of actual performance with the standards and finding out\ndeviation if any.\nd. Corrective action. 1.3 COORDINATION - CHARACTERISTICS AND IMPORTANCE\nAccording to management experts, co-ordination is necessary because :-\n \"Co-ordination is the Essence of Management.\" i.e. co-ordination effects all the\nfunctions of management, viz., Planning, Organising, Staffing, etc.\n Co-ordination is a function of management.\n Co-ordination is a principle of management, and all other principles are included\nin this one principle, i.e. co-ordination is the \"Mother Principle\".\n According to Mary Parker Follett, Co-ordination is the \"Plus value of the group\".\nThat is, if there is good Co-ordination then the combined group achievement will\nbe greater than the total of the individual achievement, i.e. 2+2=5. This is\nimpossible in the physical world, but it is possible in human affairs through co-\nordination.\n Coordination is a process to establish harmony among the different activities of\nan organisation, so that the desired objectives can be achieved. Definitions of\ncoordination present the following facts about its characteristics:\nCHARACTERISTICS OF COORDINATION\n(1) Coordination Integrates Group Effort:\n The need for coordination is felt when group effort is needed for the\naccomplishment of an objective. In short, it can be said that coordination is\nrelated to group effort and not individual effort. The question of coordination\ndoes not arise, if the job is done by one person only.\n(2) Coordination Ensures Unity of Action:  The nature of coordination is of creating unity in action. It means during\ncoordinating process an effort is made to create unity among the various\nactivities of an organisation. For example, the purchase and sales departments\nhave to coordinate their efforts so that supply of goods takes place according to\npurchase orders.\n(3) Coordination is a Continuous Process:\n It is not a job which can be performed once and for all, but its need is felt at every\nstep. Many activities are performed in a business. Sometimes or the other, if any\none of the activities goes on fluctuating either for more or less than required, the\nwhole organisational balance is disrupted. Thus, a close watch has to be kept on\nall the activities to maintain the balance.\n(4) Coordination is an All-pervasive Function:\n Pervasiveness refers to that truth which is applicable to all spheres (business and\nnon-business organisations) and places uniformly. The nature of coordination is\npervasive. Like making of timetable in an educational institution is an apt\nexample of establishing coordination.\n In the game of cricket, the placement of players at pre-determined positions is\nnothing but coordination. In the same manner, to synchronise the activities of\ndifferent departments, like purchase, sales, production, finance, etc. in a business\norganisation is coordination.\n(5) Coordination is the Responsibility of All Managers:\n Coordination is needed at all the three, i.e., top, middle and lower managerial\nlevels. Different activities performed at all the levels are equally important. Thus it is the responsibility of all the managers that they make efforts to establish\ncoordination. That is why, it could not be said that coordination is of more\nimportance to any one particular managerial level or a manager.\n(6) Coordination is a Deliberate Function:\n Coordination is never established by itself but it is a deliberate effort. Only\ncooperation does not suffice but coordination is also needed. For example, a\nteacher aspires to teach effectively (this is cooperation) but the timetable is not\nprepared in the school (this is lack of coordination).\n In this situation, classes cannot be arranged for. Here, the effort made by the\nteacher is meniangless, in the absence of coordination. On the other hand, in the\nabsence of cooperation, coordination dissatisfies the employees. Thus, both are\nrequired at a given point of time.\nIMPORTANCE OF COORDINATION\nThe need and importance of coordination can be judged from points below :-\n1. Coordination encourages team spirit\nThere exist many conflicts and rivalries between individuals, departments,\nbetween a line and staff, etc. Similarly, conflicts are also between individual\nobjectives and organisational objectives. Coordination arranges the work and the\nobjectives in such a way that there are minimum conflicts and rivalries. It encourages the employees to work as a team and achieve the common objectives\nof the organisation. This increases the team spirit of the employees.\n2. Coordination gives proper direction\nThere are many departments in the organisation. Each department performs\ndifferent activities. Coordination integrates (bring together) these activities for\nachieving the common goals or objectives of the organisation. Thus, coordination\ngives proper direction to all the departments of the organisation.\n3. Coordination facilitates motivation\nCoordination gives complete freedom to the employees. It encourages the\nemployees to show initiative. It also gives them many financial and non-financial\nincentives. Therefore, the employees get job satisfaction, and they are motivated\nto perform better.\n4. Coordination makes optimum utilisation of resources\nCoordination helps to bring together the human and materials resources of the\norganisation. It helps to make optimum utilisation of resources. These resources\nare used to achieve the objectives of the organisation. Coordination also minimise\nthe wastage of resources in the organisation.\n5. Coordination helps to achieve objectives quickly\nCoordination helps to minimise the conflicts, rivalries, wastages, delays and other\norganisational problems. It ensures smooth working of the organisation. Therefore, with the help of coordination an organisation can achieve its\nobjectives easily and quickly.\n6. Coordination improves relations in the organisation\nThe Top Level Managers co-ordinates the activities of the Middle Level Managers\nand develops good relations with them. Similarly, the Middle Level Managers co-\nordinates the activities of the Lower Level Managers and develops good relations\nwith them. Also, the Lower Level Managers co-ordinates the activities of the\nworkers and develops good relations with them. Thus, coordination overall\nimproves the relations in the organisation.\n7. Coordination leads to higher efficiency\nEfficiency is the relationship between Returns and Cost. There will be higher\nefficiency when the returns are more and the cost is less. Since coordination leads\nto optimum utilisation of resources it results in more returns and low cost. Thus,\ncoordination leads to higher efficiency.\n8. Coordination improves goodwill of the organisation Coordination helps an organisation to sell high quality goods and services at\nlower prices. This improves the goodwill of the organisation and helps it earn a\ngood name and image in the market and corporate world. CHAPTER- 2 CONCEPT OF PEOPLE MANAGEMENT\nPRINCIPLES OF BUSINESS ADMINISTRATION\nImplicit in the preceding discussion are a number of fundamental principles that must be hon-\nored in order to deliver business results to customers and to satisfy the needs of the organiza-\ntion's other stakeholders. These principles underlie the methods of business operation and\nchange. Understanding and living according to these principles will get managers and practi-\ntioners alike through some tough debates about managing processes. Without the principles,\nteams can easily get lost and distracted from the intent of the journey.\nThe 10 principles are\n1. Business change must be performance driven.\n2. Business change must be stakeholder based.\n3. Business change decisions must be traceable to the stakeholder criteria.\n4. The business must be segmented along business process lines to synchronize\nchange.\n5. Business processes must be managed holistically.\n6. Process renewal initiatives must inspire shared insight.\n7. Process renewal initiatives must be conducted from the outside in.\n8. Process renewal initiatives must be conducted in an iterative, time-boxed approach.\n9. Business change is all about people.\n10. Business change is a journey, not a destination.\nPrinciple 1: Business Change Must Be Performance Driven\nThis principle deals with the question, \"How can we evaluate what we are doing and how well\nwe are doing it?\"\nAll change must be based on business performance measurement. All the things we do, we\nshould do for a reason, and measurement allows us to know if we are acting consistently with\nthe reason. This principle in no way says what the right measurement indicators should be. Every industry is different, and every company has its own strategy for which a variety of indi-\ncators are possible. Nonetheless, it's vital that each organization choose wisely; the old adage,\n\"You get what you measure,\" seems true for all organizations.\nClearly, profit and market share will be important performance indicators for automobile com-\npanies; customer satisfaction and retention for services firms; share price and staff loyalty for\ndot-coms. Government will have different drivers than the private sector, and monopolies will\nhave different drivers than free-market firms. All, however, must know their aim in life and set a\nscorecard to evaluate how they're doing.\nPART I\nTraditionally, competitive organizations have used physical asset-based measures or investor-\nbased measures, which I have likened to hearing last night's final score without seeing the\nfootball game. Although we know that all teams go out to win and, in the long term, a team must\nwin or its management and coaches will be fired, just having the final score after the fact does\nlittle to help our understanding of the whole game. We don' t know if it was a good game for our\nteam or not. We don' t know if it was exciting and if our fans were happy, or perhaps not\nbecause we should have done better. We don' t know if our strategy worked, or if it was\nabandoned part way through. We don' t know what the team should probably do differently in\nthe next game. We only know the result.\nSimilarly, in business, most of us need other feedback to know what's working. A high stock\nprice or good return on assets is nice, but how can we contribute to it with what we do every\nday? Earlier, I talked about evaluating human resources and intellectual capital as measured by\nreturn on management. However, this too can disconnect us from what we must do as far as\nmany of our staff are concerned. As in sports, we need predictive measures, not just after-the-\nfact reports, to see the total picture. Constructing a connected measurement system is critical\nfor us to break down overall targets into what people do every day. A popular response to this has been the \"balanced scorecard\" approach, which tries to put in\nplace a set of measures that aren't oriented just to the financial bottom line. Measures of all\nmajor components of success are required, including customer satisfaction and loyalty, innova-\ntion, knowledge and people, customers, suppliers, processes, as well as the financial side of the\norganization. From this perspective, the measurement-oriented approach doesn't have to be just\nfinancial numbers but can also include outsider perceptions. This means that all organizations,\nregardless of business mission, can find their own set of performance metrics from which all\ndecisions regarding processes can be derived and linked to each other.\nThis concept is normally referred to as traceability. Traceability simply means that everything\nwe do, and every decision we make under ideal circumstances, relates through a set of linked\nperformance measures to the organization's scorecard.\nAfter performance measurement factors are determined, the organization sets some perfor-\nmance targets. There may be inherent conflict among the targets. Meeting targeted measures\nassociated with customer acquisition, such as achieving rapid market share growth, could be in\ndirect opposition to the requirement to delight our customers. Attaining good satisfaction levels\nand delivering higher profits by reducing costs may be fundamentally at odds, especially if we\nalso are striving for no headcount growth at the same time. Likewise, improving speed may fly\nin the face of our quality improvement initiative. Cost reduction can also be a killer of customer\nsatisfaction, depending how it's done. Management must send clear messages on strategy and\npriority and not rely just on wishes and targets. Remember, hope is not a strategy. Both hope\nand business strategies are needed.\nThe bottom line for any business improvement is that well-thought-out,\ntargeted measurements will inspire and track progress and ensure that we allocate our scarce human and financial resources to things that matter most.\nPRINCIPLE 2: BUSINESS CHANGE MUST BE STAKEHOLDER BASED\nThis principle asks, \"Who cares about what we are doing and how well we are doing it?\nWhat do they care about?\"\nThis principle continues the thought process surrounding traceability started in the\nfirst principle, but from the perspective of those other organizations and people that\nsurround the organization in focus—its stakeholders. A stakeholder is anyone or any\ngroup that's affected by, has a vested interest in, or can influence the organization's\nperformance in some way.\nClearly some stakeholders are more important than others when it comes to the\norganization's success, and this will change over time. This principle recognizes that\nthe organization doesn't exist only for its own purposes—it must serve a larger\ncommunity than itself. Stakeholders provide context for the business—its own\necosystem.\nStakeholder needs and expectations are the prime drivers of the balanced scorecard\nand also help determine what that scorecard should be.\nStakeholders can be classified into a number of broad and deep types. Typical generic\ncategories are\n• Customers and consumers\n• Owners\n• Staff\n• Suppliers\n• Community\n• The enterprise itself These categories will vary wildly for different companies and significantly from\nindustry to industry.\nOften, significant overlaps in classification result in confusion. For example, many\norganizations have customers or suppliers who are also their competitors. How\nshould the competitor be classified? Also, what's good for the customer might be not\nso good for the staff or might violate legal and regulatory community rules. Again, a\nbalance must be struck.\nIn most organizations, one level of stakeholder type is insufficient, especially when we\nlook at what certain parts of the organization do and whom they deal with. Customer\nsegmentation is a well-developed function in many sales-oriented companies. It's the\nbasis for marketing. PART I\ncampaigns, sales organization design, and incentive schemes. Segmentation is used less,\nhowever, as a driver and organizer of business change initiatives and process\nmanagement, an area where it holds great potential. Likewise, we can segment or\nstructure the other stakeholder types, such as staff or suppliers, into hierarchical\ncategories, from general types to more specific sub-types.\nTypes should be segmented according to their different requirements and the difference\nin the way that they are to be treated. For example, telecommunications companies\ntreat residential customers differently from multinational business customers. If there's\nno difference in treatment required, further segmentation might not be required.\nTo analyze a stakeholder segment, we should know the current state of our relationship\nwith that segment and what would we want it to be in the future. The gap between these\ntwo states will drive our needs for change. The future state view will provide a set of\nevaluation criteria for change from the current reality.\nFrom the current state, we should determine where we are with each type and sub-type\nthat warrants distinction. This evaluation includes knowing the following about each\nstakeholdertype:\n• Our principles and values as they affect the type\n• Key performance indicators (KPIs) and actual performance\nmeasurements\n• Interactions from and to the stakeholder\ntype including Business events/outcomes Flows of work, material, data, knowledge, and\ncommitments Health of current interactions\n• Health of the overall relationship\nFor the future state, we should know where we need to be at the end of the\nplanning horizon with each type and sub-type that warrants distinction. This\nprojection should cover\n• Principles and values\n• Expectations and relationship vision\n• Key performance indicators (KPIs) and performance targets\n• Interactions from and to the stakeholder\ntype including Business events/outcomes\nFlows of work, material, data, knowledge, and commitments\n• Critical success factors\nThe stakeholder criteria will depend on the stakeholders' actual needs, but\nthis will be balanced with the organization's desires.\nThe degree of importance placed on each stakeholder type will also depend on the\nvalue proposition that the organization chooses for itself. If the organization sees\nitself first and foremost as a customer/consumer service excellence company, it\nwill focus heavily on the customer segmentation and customer criteria. If it sees\nitself as primarily an excellent manufacturer, it will focus more on suppliers and\ndistributors, and its customer orientation will be toward quality of product more\nthan service at all costs. If it sees itself as an innovator above all else, the\norganization will have a different mix of staff and community stakeholders than\nthe others and might depend on channel partners to get products and services to\nmarket.\nAnother factor in the stakeholder analysis will be the organization's philosophy\ntoward its prime mission. This is especially a key factor in today's drive toward e-businesses. Many organizations have come and gone—\nsome by design and others, not. Organizations that see themselves as built to last\nwill have a totally different perspective from those that plan to take advantage of\ntheir intellectual property or capability in the short term and flip the firm to\nothers purely for immediate financial gain.\nExecutives with an incentive to haul in lots of stock options in the short term\nmight de-emphasize staff criteria for market share or growth. In any case, the\norganization must come up with a set of criteria based on balancing the\noutsiders' needs and expectations that can be measured to make decisions now\nand to prioritize later. These stakeholder evaluation criteria reflect the value\nadded by their relationship with the organization.\nPrinciple 3: Business Change Decisions Must Be Traceable to the\nStakeholder Criteria\nPrinciple 3 tackles with the question, \"Why should we make the choices we\nmake?\"\nThis principle is almost self-evident and doesn't require a lot of explanation.\nHowever, that doesn' t mean it's common practice. As a matter of fact, it's often\nignored or abused. Personal and political agendas more often form the basis for\nproposals, recommendations, and approvals of courses of actions than criteria\nderived from outcomes of value to our stakeholders. The key question is, \"What's\nthe reason or justification for a particular decision? Is it business or personal?\"\nThe challenge is to obtain accepted criteria before we enter into choosing among\nbusiness options, even small ones, and to use those criteria instead of the\npersonal drivers of powerful players. Conflicting personal, political drivers\namong decision makers can devastate a sound decision-making process. When those drivers are also misaligned to the organization's mission, vision, and values\nand to its stakeholders' expectations, we cannot expect to optimize results,\nPART I\nAgain, insist on agreement to the future state stakeholder criteria that will\ndetermine your course of action; then and only then, select that course.\nThis simple philosophy of tracing business change decisions to stakeholder\ncriteria is consistent with many popular strategies for personal and professional\nsuccess. Stephen Covey's second habit of highly successful people states, \"Begin\nwith the end in mind.\"1 Sports psychologist Terry Orlick2 claims that the first\nthing any competitive athlete must have is a clear picture of what success is.\nVisualization of that end state drives the behavior to get there. If you don' t\nknow or care about where you are going, any behavior will suffice.\nTo actually put this principle into practice, management must consciously and\nvisibly agree on the criteria first and then publish them. Management must also\nempower those working on change to work creatively within those parameters.\nAn example is the up-front agreement necessary in the process-renewal projects\nI have handled for various businesses. I always fight hard to get the commitment\nthat we will use the stakeholder criteria to reach a solution. We all agree not to\ndiscuss or even try to think about any organizational structure already in place.\nThis is hard to manage, but, if I don't get this commitment, it usually means that managers are thinking more about the drivers of direct relevance to them\npersonally and currently. These current personal drivers seldom align within\nthe team or with the best interests of external stakeholders.\nPrinciple 3 should be practiced in numerous situations. In deciding on design\noptions for every aspect of the process management hexagon (refer to Figure\n3.2), we should use the stakeholder criteria. In making scoping decisions, in\nselecting among alternatives in business cases, in allocating resources to work\nrequirements, in communication and human change management, and many\nother business practices, it will serve you well.\nPrinciple 4: The Business Must Be Segmented Along Business Process\nLines to Synchronize Change\nBased on the earlier discussion in this chapter, it's natural to view process as the\nprime segmentation strategy internal to organizations and—more and more\nfrequently—among organizations. As business cycles of products and services\nshrink timewise, management structures with overly\nrigid organizational boundaries and planning mechanisms are too slow to\nrespond. They don' t anticipate changes well enough to lead the market.Also, a\ncustomer or supplier clicks on a mouse while on a Web site, with the\nexpectation of quick, efficient, and effective results.\nIn both scenarios, seamless cross-functional integration is mandatory.\nRestructuring functional units alone won' t do it. Focusing on people skills and\nempowerment also won' t do it by itself; such approaches are aimless. A\ntechnological basis for organizing the delivery of results is likewise misdirected because technology will automate only what we want it to. Despite\nwider-focusing technologies, such as enterprise resource planning and customer\nrelationship management, businesses require results-oriented structures.\nOnly process can stake the claim of achieving enterprise-wide integration\nbecause, by definition, a process starts with the first triggering event that\ninitiates action and doesn' t end until the results of value are delivered to the\nappropriate stakeholders. This event/outcome pairing defines the processes that\nwe have. All other structures should be put in place solely to serve the event-to-\noutcome process and therefore to deliver added value to stakeholders.\nThis strategy implies that in deciding how to invest in change, prioritizing along\nprocess lines is requisite. In this way, processes organize strategy and become a\nkey link in the traceability chain between business/stakeholder criteria and the\nday-to-day actions of all the people in the value chain.\nAggregated around events for stakeholders, process definitions become more\nstable. The first event will define the start of the process, and the last outcome, its\nend. Other events and outcomes can appear in the interim, but they are still part\nof the same process. For example, when a customer clicks on a Web site to order\na product, he launches the \"Fulfill order process.\" The process isn' t complete\nuntil satisfactory delivery has occurred, and payment has been received. Other\nevents along the way can include receipt of an inquiry regarding status of\nshipment, invoicing, receipt of payment, and so on. Other types of events to\nconsider include\n• Arrival events, such as \"Order phone rings\"\n• Scheduled events, such as \"Invoice creation at 6:00AM every day\"\n• Conditional events, such as an alert warning \"Out of stock condition\" Each event will or should generate an appropriate business response. Process\nanalysis doesn't rest until all actions are complete. In event/outcome analysis,\nthe organization is treated as a black box, and we don't look inside. Looking\ninternally in the process will only confuse us— we' ll get to that later. In order for\nyou to manage processes, they must be defined as independent activities.\nHowever, in their performance, it's clear that they are interdependent. PART I\nIn identifying processes that need to be renewed to resolve a problem,\nstart with those event/outcome pairings that involve the customers and\nconsumers affected by the problem. These processes are referred to as\ncore processes. Look at the customer/consumer life cycle, which starts with\nthe first interaction or awareness that this stakeholder has with the\norganization and proceeds to the last interaction in that relationship. This\nwould span everything from marketing through to, in worst case, losing\nthe customer, or, in best case, delivery of the completed product or service.\nFrom the core processes, we can derive the processes that deliver guidance\nto them (guiding processes) and those that deliver reusable enablers to\nthem (enabling processes). These processes should themselves be defined,\ntaking into account events and outcomes but from the perspective of other\nstakeholders.\nEspecially important is the need to see the core processes as customers of\nthe guiding and enabling processes. In this way, value creation can be\ntraced from the processes traditionally seen as overhead. Processes such\nas hiring staff, developing systems and guidelines, and so forth exist only to\nsupport the business objectives that are the target of the core processes.\nThey should be measured primarily by the impact they have on the core\nprocesses, such as their impact on operational capacity. Their internal\nmeasures of efficiency, such as headcount and expense, are irrelevant in\nthis situation.\nBy segmenting the business along process-value added lines, we have a\nclear framework for organizing and prioritizing change and for measuring\nthe impact of our efforts in terms that the business executives can\nunderstand Principle 5: Business Processes Must Be Managed Holistically\nOne traditional pitfall associated with business change is an inability to deliver\nand sustain benefits. In process-oriented change, the problem can be exacerbated\nif the proponents of change can' t find appropriate champions. These sponsors\nmust take a full-process perspective—that is, one that delivers on behalf of\nexternal stakeholders, and not just for internal functional managers.\nTypically, anyone in a position to act is also typically responsible for only a\nportion of the day-to-day process and might not have the interest, knowledge, or\nmotivation to take the whole process into account. This person seldom has the\nauthority to act on behalf of the full process. Consequently, it's becoming more\nand more prevalent to appoint a full process owner, sometimes referred to as a\nprocess steward, for each process of the organization.\nThe process owner acts as advocate on behalf of the process, taking\nresponsibility for the process's performance for stakeholders. The process owner\nworks not only to deliver improvements in process projects but also to remain in\nthe role subsequent to completion of these projects. This means staying on top of\nprocess and stakeholder performance metrics and reviewing\ncurrent performance against the best in the business. It also means assessing the\nwork methods and other guides and enablers for the process, as defined in the\nprocess hexagon (refer to Figure 3.2). The process owner is always looking for an\nedge and evaluating the risk of not adapting. He ensures that feedback\nmechanisms exist to gather lessons learned and that knowledge from the latest experience and practices i s\ndistributed.\nPrimarily, the process owner makes certain that the process continues to\nperform to requirements for its stakeholders, and he takes corrective or\nanticipatory action as needed to either continuously improve or to introduce\nradical change. The objective is similar to that of total quality management,\nalthough the process owner's focus is wider and spans organizational control\nboundaries. Process owners must be effective even though they might have no\ndirect control over the resources involved in the execution and management of\nthe daily work being performed.\nThere are several structural approaches to achieve the goals of process\nmanagement. One is full-process organization, in which all workers in the\nprocess report to the process owner, who controls all staff and is accountable for\nall results. This avoids the problem of internal organizational behavior and\nincentives that are misaligned with desired outcomes. This is the utopia for\nprocess ownership and results-oriented performance management.\nIn this model, well-designed natural organizational units send finished products\nand services to one another. Process teams manage all work from business event\nthrough to business outcome. This approach upholds a very strong \"customer\"\norientation and accountability for results. Feedback and information are shared broadly. The model is fully traceable, both\nprocess-wise and people-wise.\nIt' s can be very hard to transition from other models of hierarchical management\nto a process-organized approach because multiple processes might have to move\nsimultaneously. Such a change clearly requires incredibly strong top\nmanagement leadership. One way of making this happen is to implement a single\npoint-of-contact for service to stakeholders. This one-stop-shopping approach\nwidens the point of contact's job to be fully aligned with the activities in the\nprocess; the individual's performance measurement is simply tied to stakeholder\nvalue added. Clearly, this also has a significant organizational impact.\nAnother organizational option is a mixed function-and-process approach wherein\nday-to-day control rests with functional line management, but monitoring and\nimprovement responsibility goes to process owners. These might be dedicated\nprocess owners who have a very small staff and rely on advocacy and influence.\nThey might also be line managers who also are responsible for certain processes.\nProcess owners, then, can have a cross-functional responsibility without the\ndirect ability to change what people do. In this case, their success lies in their\nability to influence those who do have direct control. These could be the line\nmanagers or the managers of the line managers. PART I\nThe critical mechanism that must be in place for ongoing process management to\nbe effective is a forum within which processes are discussed their performance\nvetted, and the incentive for process outcomes shared among all involved\nmanagers. Typically, every senior manager not only has a line but also has at least\none process to report against in the forum and to act on. The managers' personal\nevaluations must rest on their reports and their success, and they must take\nreporting and follow-up seriously. Top management must also be decisive about\nthe consequences of not supporting the approach.\nStaff involved in the day-to-day process also must see feedback on the ultimate\nresults of the process. They must have incentives to support overall stakeholder\nvalue creation and not to do just what's convenient for themselves.\nPrinciple 6: Process Renewal Initiatives Must Inspire Shared Insight\nProcess renewal relies heavily on gathering information, gaining understanding,\nand arriving at innovative approaches and designs for change. In many\norganizations, approaches to change have mirrored the now classic debate in any\nknowledge management discussion group: What form of knowledge is most\nappropriate to understand and communicate the nature of change needed? Should\nthis be done explicitly through documents and models or tacitly through low-tech\nmeetings and discussions? Experience has shown that using either approach\nexclusively is risky.\nIt' s hard to argue against the fact that one learns best by being in the work\nenvironment itself. This type of knowledge allows one to internalize the subtleties\nof \"being there.\" It's also true that working closely with \"knowers\" rapidly\naccelerates the learning curve. In small areas of an organization, this type of\nlearning is manageable because everyone can identify the area's knowers and trusts them as credible sources of process information. This type of knowledge is\nhard to steal but sometimes hard to change.\nAs its organizational focus grows, a business requires more formal approaches to\nidentify, connect, and share what's known as well as to realize the identities and\ntrustworthiness of its knowers. It's also usually impractical to learn everything\nrequired first hand in the timeframes required by modern change. Hence,\naccessible knowledge artifacts, often in the form of explicit documents, hold great\nimportance to help bridge the knowledge chasm between \"knower\" and \"solution\nstakeholder.\"\nThe quantum jumps in knowledge experienced by society and the associated\nhistorical leaps in quality of life can be traced to the availability of breakthrough\ndistribution mechanisms and media associated with explicit knowledge artifacts.\nThe advent of language, writing, paper, scribes, printing presses, copy machines,\nand electronic media have all provided a great acceleration in the amount of both\ntacit and explicit knowledge available to members of society. PART I\nIn doing this work, it' s important to be cautious about too much emphasis on the\nmodels themselves. They are only one aspect of the deliverable. The other is\narrival at a common understanding of the situation and its potential for\nimprovement.\nNOTE\nModels and documentation are only abstractions of the real world and not\ncomprehensive in their reach. Not everything can be explicitly modeled or\ndocumented in pictures and words. Some things are tacit and must be explained\nin other terms. Metaphors, scenarios, and verbal examples are often more useful\nthan written, technical reports to assure common learning and validation, which\nare necessary conditions for any change to proceed. If we just focus on models,\nwe will never bring to the surface what we are unaware of.\nRecognition of the value of sharing insight, not just documents, is reflected in the\nmethods discussed later in this book. A number of activities will uncover what\nwe know, so that it can be shared across a group in workshops. These workshops\nwill create artifacts or records of the agreements and ideas, but more\nimportantly they will embody a deeper tacit understanding of what's important\nto allow better decision making and common commitment. In many cases, a\ndiscussion of strengths and weaknesses will be more valuable than the charts\ncreated. Especially regarding strategy and architecture, there are no right\nanswers, only a better sense of how to judge. Not everything can be objective. Don' t leave out activities that embody trust, commitment, and understanding in\nthe participants.\nPrinciple 7: Process Renewal Initiatives Must Be Conducted from the Outside In\nIn any change initiative, it' s easy to become overwhelmed with the daunting task\nto be accomplished. There are myriad concepts to master, all of which are in play\nconcurrently and all of which interact with one another. If we try to deal with too\nmuch at once, we will never finish the job; instead, we will fall prey to \"analysis\nparalysis.\" Each step of the way will require a strong ability to focus on the work\nat hand with the confidence that we will get to the other aspects later when the\ntime is right.\nManaging multiple levels of detail or going to an overly complex level is the\nbiggest risk. It won' t be possible to understand and communicate that\nunderstanding when looking too soon at 500 flow boxes with decision points\nthroughout. Everything we do should be understood and validated at its own\nlevel, starting at the top box and then working down. At each level, the objects\nwe are analyzing must be looked at only with regard to their own context before\nany decomposition occurs. Processes and organizations should employ the black-box approach. For example, we\nwill look at the organization-in-focus and how it interacts with its external stakeholders\nbefore we analyze the processes of that organization. We will then identify each process\nfor that organization and select the priority ones to examine further. We' ll examine\neach chosen\nprocess in turn to see how it works with regard to its external stakeholders and\nother related, internal processes. We will break down each process into its next\nlevel of activities, and each of those will be examined. In this way, we' ll keep\nanalysis and design at an appropriate level of detail. We won' t spend unnecessary\ntime analyzing work that won' t even exist later. We will focus on the key aspects,\nnot all aspects. We will understand the drivers and have the insight needed before\nmoving on. The context will provide meaning at each and every level of detail or\ndecomposition. The details will come if and when they are needed.\nPrinciple 8: Process Renewal Initiatives Must Be Conducted in an\nIterative, Time-Boxed Approach\nThe arguments in Principle 7 call for a top-down approach to conducting change.\nThe arguments in Principle 6 call for a discovery approach that fosters learning.\nPrinciple 8 extends these two ideas into an approach that encourages you to learn,\ncreate something, review it, and plan the next cycle of the same. It assumes that\npeople don' t know everything in advance and that they must create an\nenvironment wherein they can figure things out and articulate them\nincrementally. This iterative approach can be found in knowledge creation\nprocesses, in prototyping of technology, and in research-oriented activities. It\nassumes that you will get it wrong before you get it right and that you will know\nthe result of a\nchange only when you try it. It also assumes that we need to attempt changes first\nat a fairly high level of abstraction before we get too detailed. This concept isn' t new, but, more recently, those applying the concept have\nproven the benefit of doing only a time-fixed amount of work before reviews\noccur. This is often referred to as time boxing.\nTime boxing dictates that the activity schedule is preset and the amount of work\nperformed varies according to what can be done within the timeframe. For example, a\nschedule might say, \"Each Tuesday afternoon from 1:00 to 5:00, we will review what we\nhave learned in the past week with the key participants in the process in order to validate\nour findings.\" Such a statement ensures that the team will not get too deep too soon, too far\noff track without correction, and will be able to gain gradual commitment toward the\ndeliverables from the participants. It also solves one of the biggest problems in process-\noriented and other change situations— that is, scheduling the participants, especially\nmanagement, for key reviews. In this approach, everyone schedules weeks and months of\nreviews and other workshops in advance with no surprises and no excuses.\nEach time-boxed cycle includes major types of activity: knowledge gathering, analysis,\nreconciliation and packaging of findings, and results validation.\nWhen gathering knowledge, the previously described approach of starting at the top and\ndecomposing downward into detail is a key tactic. Of all the components at any level, only\nthe important ones should be investigated. What's important should be determined by the\nimpact of that activity on the desired outcomes of the overall process, by the frequency of\nits execution, by the degree of problems encountered, by the amount of inconsistency in its\nmethods, and so on. Those gathering knowledge should recognize that the 80/20 rule is in\nfull play. This rule suggests that 80% of the effort in a process is consumed in 20% of the\nactivities, that 80% of the problems are caused by 20% of the process, and so on. The\nsession are fixed in time and therefore must be limited in scope. Even if the participants\ngain only 50% of the critical understanding at any level at each iteration, the knowledge\ngained with each iteration will add up quickly, as seen in Table 3.2. TABLE The Value of Timeboxing and Iteration\n3.2\nOutstanding Incremental Cumulative\nIteration Knowledge Knowledge Knowledge\nNumber Gained Gained Gained\n1 50% 50% 50%\n2 50% 25% 75%\n3 50% 12.5% 87.5%\n4 50% 6.25% 93.75%\nIt appears that there' s little value studying things to death when an incremental approach\nwill get us there. Experience bears this out. It also confirms commitment to the findings is\nalso built incrementally. However, it's important that the right knowledge be pursued—\nthat is, relevant knowledge to the task at hand as defined by the stakeholder criteria.\nWhatever is to be dealt with at any level or number of iteration must be prioritized\naccording to those criteria and other factors that tell us where to drill and where to stop.\nIn this way, the analysis and design might be lumpy. In other words, some parts of the\nprocess under review are known in detail because it's important to know at that level,\nwhereas other parts are known at a broader, higher level only (see Figure 3.8). Note that\nalthough there are different levels of detail at different points, the process remains\nconnected without breaks from left to right. This prioritization should occur as part of the\nreview or validation session at the end of each iteration, when we seek consensus on what\nwe got right, what we didn't get right, what we missed, and what priority we should look\nat next. We've found that a simple ABC ranking is sufficient, wherein we can be confident\nthat we will get to the A's by next time but the C's won't be addressed now. (They might\nbecome A's in later iterations.) Process\nA\nSub-Process 2\nFIGURE 3.8\nProcess prioritization and\ndecomposition. Sub- \\ Sub- \\ Sub-\nSub / Sub ( Sub\nProcess Process A Process\n; \\\n2.1 2.2 2.3\nNot all work can be at the lowest level of detail nor needs to be. If four levels of\ndecomposition are pursued and each level has five subprocess components, there\nwould be 5, 25, 125, and 625 chunks of detail to investigate, respectively. To avoid\nthis, prioritization is a must. Certain overly detail-oriented staff should be kept\naway from this type of work. We are analyzing and developing processes, not\nprocedures.\nThis type of rapid-fire work can put tremendous pressure on team members, who\nare now living a series of short-term deadlines. Perfectionists will have a difficult\ntime with this. What's needed are good listeners, who can develop trust and\nrespect, and good presenters who will explain but never defend their findings. They must not take changes personally; they must be comfortable in revealing\ntheir incomplete, incorrect work products and see the changes to them as a\npositive. Likewise, those who tend to dominate or push their own solutions are\ninappropriate for this work.\nPrinciple 9: Business Change Is All About People\nAt a seminar I facilitated a few years ago in Toronto, a participant came up to me and\nsaid that she had found the two days extremely valuable. When I asked her why, she told\nme that she came to find out \"Where do we do human change management?\" She said\nshe was leaving knowing that, \"Human change isn't something you do; it's everything\nyou do.\" That phrasing of the message has stayed with me ever since. It's absolutely true.\nChange initiatives are often used simply as ways of creating a document—a specification\nfor a system, for example. Instead, you must see them as a vehicle of more encompassing\ntransformation. You aren' t just converting technology, data, procedures, or\norganizations; you are converting people into enthusiastic supporters and participants\nwho will provide you with a competitive edge that can' t be matched. This is one reason\nthat you should encourage the analysis of existing processes. This analysis fosters\nunderstanding and communication.\nTo do this, a number of factors become paramount. In addition to your communications\nstrategy, you must support changes with appropriate roles and responsibilities,\norganizational structures, empowerment within accountability, aligned performance\nincentives, and recognition as well as personal growth opportunities. During transition,\nthe staff must feel that an appropriate level of trustworthy communication is happening.\nThey should feel a sense of contribution as a result of their participation. Principle 10: Business Change Is a Journey, Not a Destination\nA major distinguishing feature between process management and the wave of\nbusiness process re-engineering (BPR) efforts that swept past us in the early and\nmid-1990s is their approaches to continuity of effort. BPR emphasized radical\nchange of business processes and everything that touched them in a big-bang,\n\"break-all-the-eggs\" approach but did little to uphold the notion of supporting the\nongoing management of the implemented change or the ongoing implementation\nof change. It assumed that the solution would have stability in a stable market-\nplace. Perhaps for these reasons, as well as human resistance to the inhumane\napproaches sometimes taken, BPR took its share of criticism and failed to deliver\nthe anticipated results more often than not.\nTwo major business factors must be taken into account today:\n• We don't have time to get it right, so whatever we do will have to\nadjust as we learn in the marketplace.\n• Whatever we do, no matter how right, will be short-lived and have\nto change anyway.\nConsequently, classic BPR philosophies won't work. Instead, we must build\nadaptable solutions and keep our eye on what is changing to be able to adapt in\nthe future. This essentially means that we will never arrive at the Nirvana of\nstability but will always be getting there. We must recognize that, at any point in time, our stakeholders will have a set of\nrequirements that are in flux. The balance among these requirements will change\nas each of the stakeholders' contributions to us change. This will make some\nstakeholders more important to us than others. For example, when no one is\nbuying, the customer relationship seems more important, and, when few skilled\nresources can be found, staff relationships become more valued.\nThe ebb and flow of stakeholder and market evolution means that processes\nmust be managed, even when they aren' t undergoing radical change. Without\nprocess ownership, ongoing measurement, benchmarking, and constant attention\nto stakeholders of all types, we will fall behind through attrition. Change is\nrequired even if we simply want to maintain our current position.\nIf change is a journey, it's important to pay attention to all the principles that\nprecede this one all the time. Notice especially that seeking perfection before\naction is suicide. Doing something small now and learning are more valuable than\ngetting a bigger process right later. Whatever we do, we must be prepared to do it\nagain better on the next go around.\nBuilding learning feedback and knowledge distribution into processes is\nmandatory. Constantly gaining tacit insight before designing is key. Designing for\nchange is essential. Acting fast isn't a risk if we are prepared to pay attention to\noutcomes and adjust accordingly. CHAPTER 3: CONCEPT OF BUSINESS PLAN\nCONCEPT, FEATURES, IMPORTANCE, LIMITATIONS OF PLANNING PROCESS\nMeaning of Planning – Deciding about all the aspect is called planning. A\nproblem about taking decision on these matters rises when there are more than\none possible answers.. therefore it can be said to be a process of choosing .\nDefinition of planning :\nAccording ot koontz and O’donnell,” Planning is deciding in advance What to do ,\nhow to do it, when to do it, and who is to do it.”\nCHARACTERISTICS OF PLANNING\n1 Planning focuses on achieving the objectives: Management begins with\nplanning and planning begins with the determining of objectives. In the absence\nof objectives no organization can ever be thought about.\n2 Planning is the primary function of Management: Planning is the first important\nfunction of management. The other functions –organising, staffing, directing and\ncontrolling come later. In the absence of planning no other function of\nmanagement can be performed.\n3 planning is continuous: Planning is the process which begins with the beginning\nof business itself and ends with the ending of the business. It means that as long a\nbusiness exists, the planning process is continuous.\nFor example , a company plans to sell one lakh units in the coming year. Suddenly,\nmany competing companies enter the market. This will naturally affect the\nprevious position of the company and , therefore ,it shall have to revise its\nplanning. 4. Planning is Futuristic: Planning decides the plan of action-What is to be done,\nhow is to be done, when is to be done, by who is to be done, all the questions are\nrelated to future. Under the planning, answer to these questiona is found out.\nWhile an effort is made to find out these answer.\n5. Planning is mental exercise: planning is known as a mental exercise as it is\nrelated to thinking before doing something. A planner has mainly to think about\nthe following questions:\n(1) What to do? , (2) how to do it? , (3)When to do it? , (4) Who is to\ndo it?\nIMPORTANCE OF PLANNING\nPlanning is the first and most important function of the management. It is needed\nat every level of the management. In the absence of planning all the business\nactivities of the organization will become meaningless. The importance of\nplanning has increased all the more in view of the increasing size of organizations\nIn the absence of planning, it may not be impossible but certainly difficult to\nguess the uncertain events of future.\n1 Planning facilitates Decision making: Decision making means the process of\ntaking decision. Under it, a variety of alternatives are discovered and the best\nalternative is chosen. But it is important to determine the objectives before the\ndiscovery of alternatives. Objectives are determined under the process of\nplanning. So. it can be said that planning facilitates decision making.\n2 Planning reduce risk of Uncertainty: planning is always done for future and\nfuture is uncertain. With the help of planning possible changes in future are\nanticipated and various activities are planned in the best possible way. 3. Planning reduces overlapping and wasteful activities: Under planning, future\nactivities are planned in order to achieve objectives. the problems of when, where\n,what and almost decided. This puts an end to disorder. In such situation\ncoordination is established among different activities and departments. It puts an\nend ot overlapping and wasteful activities.\n4. Planning provides Direction: Under the process of planning the objectives of\nthe organization are defined in simple and clear words. The outcome of this is\nthat all the employee’s important role in the attainment of the objectives of the\norganization.\n5 Planning establishes Standards for controlling: By determining the objectives\nthe objectives of the organisation through planning all the people working in the\norganization and all the departments are informed about when, what and how to\ndo things. Standards are laid down about their work, time and cost. Under\ncontrolling ,at the time of completing the work,the actual work done is compared\nwith the standard work and deviations are found out and if the work has been\ndone as desired the person concerned is held responsible.\nLIMITATIONS OF PLANNING\nPlanning is needed both in the business and non business organizations. Some\npeople think that planning is based on the future and nothing can be said\ncertainty about future. Therefore, it is\nfor all the situations before and which now requires immediate decision. In such\nsituation if the useless process. If planning has to be successful and purposeful,\nthe managers should be aware of these difficulties and limitations of\nplanning.Following are the limitations of planning.\n1 Planning does not work in Dynamic Environment: Planning is based in the\nfuture happenings. Since future is uncertain and dynamic. Generally, a longer period of planning makes it less effectives. Therefore, it can be said that planning\ndoes not work in dynamic environment.\n2 Planning reduce creativity: Under the planning\nAll the activities connected with the attainment of objectives of the organization\nare pre-determined. Everybody works as they have been directed to do and it has\nbeen made clear in the plans. it means that they do not think about appropriate\nways of discovering new alternatives.\n3 Planning involves huge costs: Planning is small work but its process is really\nbig. Planning becomes meaningful after a long path. It takes a lot of time to cover\nthis path. During this entire period the managers remain busy in collecting a lot of\ninformation and analyzing it. In this way the organization is bound to face huge\ncosts.\n4 Planning is time consuming process: Planning is blessing in facing a definite\nsituation but because of long process it can not f ace sudden emergencies. Sudden\nemergencies can be in the form of unforeseen problems or some opportunity of\nprofit is and there has been no planning manager thinks of completing the\nplanning process before taking some decision. Thus, planning is time consuming\nprocess.\n5Planning does not guarantee of success: Some times the manager think that\nplanning solves all their problems. Such a think makes them neglect their real\nwork and adverse effect of such an attitude has to be faced by the organization. In\nthis way, planning planning offers the managers a false sense of security and\nmakes them careless. So, we can that mere planning does not ensure\nsuccesss,rather efforts have to be made for it.\nPLANNING PROCESS\nWhen we look at planning in the context of management process, it is called\nactivity , it is being a part of management. But on the other hand, when it is studied separately it is called a process because to complete one has to clear\nmany steps one after the other. So far as the number of steps included in the\nplanning process is concerned it depends on the size of the organization.\nDifferent organization can have different planning process.The following steps\nare generally taken in the business organization during the planning process.\n1 Setting the objectives; Objectives are those end points for whose attainment all\nthe activities are taken. In the planning process objectives are determined and\ndefined first of all so that all the employees concerned can be informed about\nthem to get their complete cooperation. Objectives have a hierarchy of their own\norganizational objectives, departmental objectives, and individual objectives.\n2 Developing the premises: the basis of planning is those factors which influence\nthe possible results of different alternatives. Before taking a final decision about\nany alternative a forecast of this assumption is made. The rate of success of\nplanning will be in direct proportion to the rate of the success of forecasting. The\nassumption of planning is two types:\n(1) Internal premises: capital, labour, raw material, machinery ect.\n(2) External premises; Government polices, business competition, taste of\ncustomer rate of taxes. ect.\n3 Identifying alternative course of action: Generally, there is no work which has\nno alternative method of doing it. On the basis of the objectives of the\norganization and limitations of planning, alternative course of doing a particular\nwork can be discovered.\n4 Evaluating alternative courses: All those alternative courses which are up to the\nexpectations of the minimum preminary criteria are selected for intensive study.\nit will be seen as to what extent a particular alternative course can help in the\nattainment of the objectives of the organizations. There is however, one problem which confronts us while analysing these alternative courses. Every alternatives\ncourse has its merits and demerits.\n5 Selecting an alternative: alternative a careful analysis of different alternatives\nthe best one is selected. Sometimes the analysis yields more than one alternative\ncourse with similar merits.\nKeeping in view the uncertainties of future it is justifiable to select more than one\ngood alternative course One of such alternative is adapted and other is kept in\nreserve.\n6 Implementing the plan: After having decided the chef plan and the subsidiary\nplans, they are to be implemented. After implementing the plans the sequence of\ndifferent activities has to be decided. In other words, it is decided as to who will\ndo a particular job and at what time.\n7. Follow up Action: the process of planning does not end with the\nimplementation of plans. plans are formulated for future which is uncertain. It is\nof great importance that there is a constant review of plans so as to ensure\nsuccess in the uncertain future. The moment there appears to be changes in the\nplans also. In this way we can say planning is Continuously moving process.\nTYPES OF PLANS\nPlanning is a process and plan is its outcome. Plan is a sort of commitment to\naccomplish all the activities needed for the attainment of special results, from this\npoint of view there are many plans. The following study will help in\nunderstanding different kinds of plans.\n1Objectives: objectives are those end points for the attainment of which all the\nactivities are Undertaken.\nFollowing are the examples of objectives: (I )To improve the communication system to hold regular staff meeting and\npublish a newsletter.\n(2)To cross the 20,0 00 crore mark in turnover of soaps.\n(3) To make available the employment to 100 people every year.\n(4) To reduce quality rejects to 3%\n2 Strategies: Strategies refer to those plans which are prepared in view of the\nmove of the competitors and whose objective is to make possible the optimum\nutilization of resources.\n3. Policies; Polcies are those general statements which are decided for the\nguidance of the employees while taking decision. Their purpose is laying down a\nlimit within which a particular work can be done or decision taken. Objectives\ndecide what is to be achieved and the policies tell us how it can be achieved.\n4Procedures : Procedures are those plans which determine the sequence of any\nwork performance. For example, the recovery of money from the debtors can be\ndone in the following order:\n(a) Writing letters, (b) connecting on telephone, (c) Meeting personally,(d0\ntaking legal action.\nThis is the procedure of collecting money from all the debtors. There is a\ndifference between policies and procedures.. There can be two policies of the\norganization regarding the recovery of money from the debtors. (A) Tight\ncollection policy, and (B) Lenient collection policy. Under the first policy an\neffort is made to recover money from debtors is by treating him harshly.\nUnder the second policy the debtors will be given enough time for the\npayment of money while treating him leniently.\n5 Methods: Methods is that plan which determines how different activities of\nthe procedure are completed. Methods is not related to all steps but only to one step of the procedure . it is more detailed than procedure . there may be\nmany methods to do a particular work. After extensive study, a method has to\nbe selected from which a worker feels minimum fatique, increase in\nproductivity and there is reduction in costs.\n6 Rules: Rules till us what is to be done and what is not to be done in\nparticular situation. In the absence of rules there is no need to take any\ndecision. Whatever is said in the rules has to be followed without any\nthinking. For example, the rule “ No smoking in the factory “is applicable to\neverybody and it must be observed. Provision for punishment in case of non-\nobserving of the rule can also be made.\n7Budget: Budgets describe the desired results in numerical terms. A budget is\nthat planning which provides detailers about estimated money, material time\nand other resources for the achievement of pre determined objectives of\nvarious departments. For example, the sales departmen’sbudget gives\nestimated figures about the type of material that will be purchased, its\nquantity, the time of purchase and the amount to be spent on it. Similarly,\nbudget of other departments are also prepared.\n8 Programmers: a programme means a single-use comprehensive plan\nlaying down the what, how who and when of accomplishing a specific job.\nthrough program me the managers are informed in advance about various\nneeds so that there is no problem in future. The programmers can be different\ntypes-production programme, Training programme Sales promotion\nprogramme management developing programme.etc. CONCEPT AND IMPORTANCE, . STEPS IN THE PROCESS OF ORGANIZING.\n\"Organising is the process of defining and grouping the activities of the enterprise\nand establishing the authority relationships among them.\"\nAccording to Louis Allen,\n\"Organising is the process of identifying and grouping the work to be performed,\ndefining and delegating responsibility and authority and establishing\nrelationships for the purpose of enabling people to work most effectively\ntogether in accomplishing objectives.\"\nSTEPS IN THE PROCESS OF ORGANISING\nOrganising is a step-by-step process. At each step, an important task is performed\nby the administrators working at the top-level of management.\nWhile organising, the top managers carry out following important tasks:-\n1. In this general eight-stepped process, the top management first fixes the\ncommon objectives of the organisation.\n2. In the second step, they (top management) identify all the activities (i.e. works\nor jobs) which are required to achieve these predefined objectives.\n3. In the third step, they group similar (related) activities and make their\nindividual departments.\n4. In the fourth step, they define the responsibilities (duties) of all the staff\nmembers (employees and managers).\n5. In the fifth step, they delegate authority to staff members.\n6. In the sixth step, the authority relationships between superiors and\nsubordinates are established. 7. In the seventh step, they provide the staff members with all the essential\nrequirements like money, machines, materials, etc., which are used for achieving\nthe objectives.\n8.In the eighth final step, they co-ordinate the efforts of all staff members and\ndirect it towards achieving the common objectives of the organisation.\nSTRUCTURE OF ORGANIZATION - FUNCTIONAL AND DIVISIONAL.\nWhen businesses get large enough to need an organized company structure, they\ntraditionally segregate personnel by work function. This setup lets people with\nsimilar jobs communicate easily and share resources. A divisional structure,\nmeanwhile, puts employees together to serve a common cause -- a certain\nproduct or service, customer type or geographical location. Both structures are\nvertical, stacking a middle- and upper-management hierarchy atop a base of\nemployees, and having characteristics such as a tendency toward rigidity. The\ntwo structures also have important differences.\nRESPONSIVENESS\nThe marked management hierarchy of vertical structures means an established,\npowerful bureaucracy. Bureaucracies stifle adaptability and responsiveness,\nresulting in rigid, mechanistic companies with tight controls and clear chains of\ncommand. This is most true of the functional structure. The divisional structure is\nless rigid. Being organized around a common market focus increases the\nstructure's responsiveness, with the vertical structure still retaining some of the\nstrong controls evident in the functional structure.\nORGANIZATIONAL FLEXIBILITY\nOrganizing around a common market focus also means each division may be\narranged according to the needs of its particular focus. Once divisions are created, work is often further subdivided by functions, but that isn’t required. A\ndivision may, for instance, group personnel into teams to accomplish work. The\nfunctional structure locks in organization, this stability allowing it to build a\nstrong momentum toward a desired end. This lets companies mass-produce and\nstandardize services and products.\nMANAGEMENT FOCUS\nMiddle management has a chance to shine in the divisional structure. That's because each\ndivision operates as if it were an autonomous business; divisions often are kno wn as\nstrategic business units, or SBUs. Upper management continues to oversee things at the\nparent company, leaving middle managers in charge of the divisions. In effect, managers\nrun SBUs as if they were business owners or CEOs. Divisions thus serve as a training arena\nfor future company executives. This strategic training is lacking in the functional structure,\nwhere upper management holds the reins.\nEFFICIENCY AND COST-EFFECTIVENESS\nSharing expertise and resources within departments makes the functional\nstructure highly efficient and cost-effective. It also allows for job specialization,\nrepetition and assembly line operations. These features give companies the\nopportunity to capitalize on economies of scale that diminish in the divisional\nstructure. That structure must spend to duplicate personnel and resources for\neach division -- workspace, support staff and supplies, for instance.\nCOORDINATION, COOPERATION AND COMMUNICATION\nInterdepartmental communication, cooperation and coordination can become\nproblematic in the functional structure. The segregated workers may not\nunderstand the issues and priorities of other functional areas. The problem isn’t\nas acute within a divisional structure’s SBUs because, regardless of function,\neveryone is devoted to the market or product around which the division is\nformed. The divisional structure doesn’t avoid problems altogether, though.\nCommunication, cooperation and coordination between SBUs may develop problems that are\nexacerbated by distance\nDifference between Functional and Divisional Organisation Structure\nBasis Functional Organisational Divisional Organisational\nStructure Structure\nOrigination Division of activities is made on Division of the activities is\nthe basis of functions. made on the basis of end\nresult like product or\ncustomer.\nResponsibility It is very difficult to fix the It is easy to fix the\nresponsibility of the results. responsibility of the results.\nUnity of It does not follows the principle It follows the principle of\nCommand of unity of command unity of command.\nOverlapping It reduces or avoids the There are more chances of\n/Duplication overlapping or duplication of overlapping/duplication of\nwork work.\nCoordination It is difficult to establish Coordination can be easily\ncoordination. established.\nCost Less cost due to no overlapping More cost due to overlapping\nand duplication of work. and duplication of product.\nSuitability Organisations with one product. Organisations with several\nproducts. FORMAL AND INFORMAL ORGANIZATION\nFormal Organisation is formed when two or more persons come together. They\nhave a common objective or goal. They are willing to work together to achieve\nthis similar objective.\nFormal Organisation has its own rules and regulation. These rules must be\nfollowed by the members (employees and managers). A formal organisation has a\nsystem of co-ordination. It also has a system of authority. It has a clear superior-\nsubordinate relationship. In a formal organisation, the objectives are specific and\nwell-defined. All the members are given specific duties and responsibilities.\nExamples of formal organisation are:- a company, a school, a college, a bank, etc.\nInformal Organisation exists within the formal organisation. An informal\norganisation is a network of personal and social relationships. People working in\na formal organisation meet and interact regularly. They work, travel, and eat\ntogether. Therefore, they become good friends and companions. There are many\ngroups of friends in a formal organisation. These groups are called informal\norganisation.\nAn informal organisation does not have its own rules and regulation. It has no\nsystem of co-ordination and authority. It doesn't have any superior-subordinate\nrelationship nor any specific and well-defined objectives. Here in informal\norganisation, communication is done through the grapevine.\n2. Formed by Whom?\nA formal organisation is formed by the top level management. An informal organisation is formed by social forces within the formal\norganisation. 3. Rules and Regulations\nThe members of a formal organisation have to follow certain rules and\nregulations. These rules are available in writing (documented). They are\nmade by a formal authority (superiors). If the members follow these rules\nproperly, then they will be rewarded. However, if they do not follow these\nrules, they will be punished.\nThe members of an informal organisation do not have to follow any rules and\nregulations.\n4. Duties and Responsibilities\nIn a formal organisation, the duties, responsibilities, authority and accountability\nof each member is well-defined.\nIn an informal organisation, there are no fixed duties, responsibilities, authority,\naccountability, etc. for the members.\n5. Objectives or Goals\nIn a formal organisation, the objectives or goals are specific and well-defined. The\nmain objectives of a formal organisation are productivity, growth, and expansion.\nIn an informal organisation, the objectives are not specific and well-defined. The\nmain objectives of an informal organisation are friendship, security, common\ninterest, individual and group satisfaction, etc. 6. Stability\nA formal organisation is stable.\nAn informal organisation is not stable.\n7. Channels of Communication\nA formal organisation uses formal channels of communication.\nAn informal organisation uses informal channels of communication (i.e.\ngrapevine)\n8. Organisation Chart\nA formal organisation is shown on the organisation chart.\nAn informal organisation is not shown on the organisation chart.\n9. Superior-Subordinate Relationship\nIn a formal organisation, there exist a superior-subordinate relationship.\nIn an informal organisation, there is no such superior-subordinate relationship. 10. Benefits for Members\nThe members of the formal organisation get financial benefits and perks like\nwages or salaries, bonus, travelling allowances, health insurance, etc.\nThe members of informal organisation get social and personal benefits like friend\ncircle, community, groups, etc\nDELEGATION: CONCEPT, ELEMENTS AND IMPORTANCE.\nA manager alone cannot perform all the tasks assigned to him. In order to meet\nthe targets, the manager should delegate authority. Delegation of Authority\nmeans division of authority and powers downwards to the subordinate.\nDelegation is about entrusting someone else to do parts of your job. Delegation of\nauthority can be defined as subdivision and sub-allocation of powers to the\nsubordinates in order to achieve effective results.\nElements of Delegation\nAuthority - in context of a business organization, authority can be defined as the\npower and right of a person to use and allocate the resources efficiently, to take\ndecisions and to give orders so as to achieve the organizational objectives.\nAuthority must be well- defined. All people who have the authority should know\nwhat is the scope of their authority is and they shouldn’t misutilize it. Authority is\nthe right to give commands, orders and get the things done. The top level\nmanagement has greatest authority. Authority always flows from top to bottom.\nIt explains how a superior gets work done from his subordinate by clearly\nexplaining what is expected of him and how he should go about it. Authority\nshould be accompanied with an equal amount of responsibility. Delegating the\nauthority to someone else doesn’t imply escaping from accountability.\nAccountability still rest with the person having the utmost authority. Responsibility - is the duty of the person to complete the task assigned to him. A\nperson who is given the responsibility should ensure that he accomplishes the\ntasks assigned to him. If the tasks for which he was held responsible are not\ncompleted, then he should not give explanations or excuses. Responsibility\nwithout adequate authority leads to discontent and dissatisfaction among the\nperson. Responsibility flows from bottom to top. The middle level and lower level\nmanagement holds more responsibility. The person held responsible for a job is\nanswerable for it. If he performs the tasks assigned as expected, he is bound for\npraises. While if he doesn’t accomplish tasks assigned as expected, then also he is\nanswerable for that.\nAccountability - means giving explanations for any variance in the actual\nperformance from the expectations set. Accountability can not be delegated. For\nexample, if ’A’ is given a task with sufficient authority, and ’A’ delegates this task\nto B and asks him to ensure that task is done well, responsibility rest with ’B’, but\naccountability still rest with ’A’. The top level management is most accountable.\nBeing accountable means being innovative as the person will think beyond his\nscope of job. Accountability, in short, means being answerable for the end result.\nAccountability can’t be escaped. It arises from responsibility.\nFor achieving delegation, a manager has to work in a system and has to perform\nfollowing steps : -\n1. Assignment of tasks and duties\n2. Granting of authority\n3. Creating responsibility and accountability\nDelegation of authority is the base of superior-subordinate relationship, it\ninvolves following steps:- Assignment of Duties - The delegator first tries to define the task and\nduties to the subordinate. He also has to define the result expected from\nthe subordinates. Clarity of duty as well as result expected has to be the first\nstep in delegation.\n1. Granting of authority - Subdivision of authority takes place when a\nsuperior divides and shares his authority with the subordinate. It is for\nthis reason, every subordinate should be given enough independence to\ncarry the task given to him by his superiors. The managers at all levels\ndelegate authority and power which is attached to their job positions. The\nsubdivision of powers is very important to get effective results.\n2. Creating Responsibility and Accountability - The delegation process\ndoes not end once powers are granted to the subordinates. They at the\nsame time have to be obligatory towards the duties assigned to them.\nResponsibility is said to be the factor or obligation of an individual to carry\nout his duties in best of his ability as per the directions of superior.\nResponsibility is very important. Therefore, it is that which gives\neffectiveness to authority. At the same time, responsibility is absolute and\ncannot be shifted. Accountability, on the others hand, is the obligation of\nthe individual to carry out his duties as per the standards of performance.\nTherefore, it is said that authority is delegated, responsibility is created\nand accountability is imposed. Accountability arises out of responsibility\nand responsibility arises out of authority. Therefore, it becomes important\nthat with every authority position an equal and opposite responsibility\nshould be attached.\nTherefore every manager ,i.e.,the delegator has to follow a system to finish up\nthe delegation process. Equally important is the delegatee’s role which means\nhis responsibility and accountability is attached with the authority over to\nhere. Relationship between Authority and Responsibility\nAuthority is the legal right of person or superior to command his subordinates\nwhile accountability is the obligation of individual to carry out his duties as per\nstandards of performance Authority flows from the superiors to subordinates,in\nwhich orders and instructions are given to subordinates to complete the task. It is\nonly through authority, a manager exercises control. In a way through exercising\nthe control the superior is demanding accountability from subordinates. If the\nmarketing manager directs the sales supervisor for 50 units of sale to be\nundertaken in a month. If the above standards are not accomplished, it is the\nmarketing manager who will be accountable to the chief executive officer.\nTherefore, we can say that authority flows from top to bottom and responsibility\nflows from bottom to top. Accountability is a result of responsibility and\nresponsibility is result of authority. Therefore, for every authority an equal\naccountability is attached. DECENTRALIZATION: CONCEPT AND IMPORTANCE\nThe term \"decentralization\" embraces a variety of concepts which must be\ncarefully analyzed in any particular country before determining if projects or\nprograms should support reorganization of financial, administrative, or service\ndelivery systems. Decentralization—the transfer of authority and responsibility\nfor public functions from the central government to subordinate or quasi-\nindependent government organizations and/or the private sector—is a complex\nmultifaceted concept. Different types of decentralization should be distinguished\nbecause they have different characteristics, policy implications, and conditions\nfor success.\nTypes of Decentralization\nTypes of decentralization include political, administrative, fiscal, and market\ndecentralization. Drawing distinctions between these various concepts is useful\nfor highlighting the many dimensions to successful decentralization and the need\nfor coordination among them. Nevertheless, there is clearly overlap in defining\nany of these terms and the precise definitions are not as important as the need\nfor a comprehensive approach. Political, administrative, fiscal and market\ndecentralization can also appear in different forms and combinations across\ncountries, within countries and even within sectors.\nPolitical Decentralization\nPolitical decentralization aims to give citizens or their elected representatives\nmore power in public decision-making. It is often associated with pluralistic\npolitics and representative government, but it can also support democratization\nby giving citizens, or their representatives, more influence in the formulation and\nimplementation of policies. Advocates of political decentralization assume that decisions made with greater participation will be better informed and more\nrelevant to diverse interests in society than those made only by national political authorities. The concept implies that the selection of representatives from local\nelectoral jurisdictions allows citizens to know better their political\nrepresentatives and allows elected officials to know better the needs and desires\nof their constituents.\nPolitical decentralization often requires constitutional or statutory reforms, the\ndevelopment of pluralistic political parties, the strengthening of legislatures,\ncreation of local political units, and the encouragement of effective public interest\ngroups.\nAdministrative Decentralization\nAdministrative decentralization seeks to redistribute authority, responsibility\nand financial resources for providing public services among different levels of\ngovernment. It is the transfer of responsibility for the planning, financing and\nmanagement of certain public functions from the central government and its\nagencies to field units of government agencies, subordinate units or levels of\ngovernment, semi-autonomous public authorities or corporations, or area-wide,\nregional or functional authorities.\nThe three major forms of administrative decentralization -- deconcentration,\ndelegation, and devolution -- each have different characteristics.\nDeconcentration. Deconcentration--which is often considered to be the weakest\nform of decentralization and is used most frequently in unitary states--\nredistributes decision making authority and financial and management\nresponsibilities among different levels of the central government. It can merely\nshift responsibilities from central government officials in the capital city to those\nworking in regions, provinces or districts, or it can create strong field administration or local administrative capacity under the supervision of central\ngovernment ministries. Delegation. Delegation is a more extensive form of decentralization. Through\ndelegation central governments transfer responsibility for decision-making and\nadministration of public functions to semi-autonomous organizations not wholly\ncontrolled by the central government, but ultimately accountable to it.\nGovernments delegate responsibilities when they create public enterprises or\ncorporations, housing authorities, transportation authorities, special service\ndistricts, semi-autonomous school districts, regional development corporations,\nor special project implementation units. Usually these organizations have a great\ndeal of discretion in decision-making. They may be exempt from constraints on\nregular civil service personnel and may be able to charge users directly for\nservices.\nDevolution. A third type of administrative decentralization is devolution. When\ngovernments devolve functions, they transfer authority for decision-making,\nfinance, and management to quasi-autonomous units of local government with\ncorporate status. Devolution usually transfers responsibilities for services to\nmunicipalities that elect their own mayors and councils, raise their own revenues,\nand have independent authority to make investment decisions. In a devolved\nsystem, local governments have clear and legally recognized geographical\nboundaries over which they exercise authority and within which they perform\npublic functions. It is this type of administrative decentralization that underlies\nmost political decentralization.\nFiscal Decentralization\nFinancial responsibility is a core component of decentralization. If local\ngovernments and private organizations are to carry out decentralized functions\neffectively, they must have an adequate level of revenues –either raised locally or transferred from the central government– as well as the authority to make\ndecisions about expenditures. Fiscal decentralization can take many forms, including a) self-financing or cost recovery through user charges, b) co-financing\nor co-production arrangements through which the users participate in providing\nservices and infrastructure through monetary or labor contributions; c)\nexpansion of local revenues through property or sales taxes, or indirect charges;\nd) intergovernmental transfers that shift general revenues from taxes collected\nby the central government to local governments for general or specific uses; and\ne) authorization of municipal borrowing and the mobilization of either national\nor local government resources through loan guarantees. In many developing\ncountries local governments or administrative units possess the legal authority to\nimpose taxes, but the tax base is so weak and the dependence on central\ngovernment subsidies so ingrained that no attempt is made to exercise that\nauthority.\nEconomic or Market Decentralization\nThe most complete forms of decentralization from a government's perspective\nare privatization and deregulation because they shift responsibility for functions\nfrom the public to the private sector. Privatization and deregulation are usually,\nbut not always, accompanied by economic liberalization and market development\npolicies. They allow functions that had been primarily or exclusively the\nresponsibility of government to be carried out by businesses, community groups,\ncooperatives, private voluntary associations, and other non-government\norganizations.\nPrivatization. Privatization can range in scope from leaving the provision of\ngoods and services entirely to the free operation of the market to \"public-private\npartnerships\" in which government and the private sector cooperate to provide\nservices or infrastructure. Privatization can include: 1) allowing private\nenterprises to perform functions that had previously been monopolized by\ngovernment; 2) contracting out the provision or management of public services\nor facilities to commercial enterprises indeed, there is a wide range of possible ways in which function can be organized and many examples of within public\nsector and public-private institutional forms, particularly in infrastructure; 3)\nfinancing public sector programs through the capital market (with adequate\nregulation or measures to prevent situations where the central government bears\nthe risk for this borrowing) and allowing private organizations to participate; and\n4) transferring responsibility for providing services from the public to the private\nsector through the divestiture of state-owned enterprises.\nDeregulation. Deregulation reduces the legal constraints on private\nparticipation in service provision or allows competition among private suppliers\nfor services that in the past had been provided by the government or by regulated\nmonopolies. In recent years privatization and deregulation have become more\nattractive alternatives to governments in developing countries. Local\ngovernments are also privatizing by contracting out service provision or\nadministration.\nChoosing the Most Appropriate Form of Decentralization\nUnder appropriate conditions, all of these forms of decentralization can play\nimportant roles in broadening participation in political, economic and social\nactivities in developing countries. Where it works effectively, decentralization\nhelps alleviate the bottlenecks in decision making that are often caused by central\ngovernment planning and control of important economic and social activities.\nDecentralization can help cut complex bureaucratic procedures and it can\nincrease government officials' sensitivity to local conditions and needs.\nMoreover, decentralization can help national government ministries reach larger\nnumbers of local areas with services; allow greater political representation for\ndiverse political, ethnic, religious, and cultural groups in decision-making; and\nrelieve top managers in central ministries of \"routine\" tasks to concentrate on policy. In some countries, decentralization may create a geographical focus at the\nlocal level for coordinating national, state, provincial, district, and local programs\nmore effectively and can provide better opportunities for participation by local\nresidents in decision making. Decentralization may lead to more creative,\ninnovative and responsive programs by allowing local \"experimentation.\" It can\nalso increase political stability and national unity by allowing citizens to better\ncontrol public programs at the local level.\nBut decentralization is not a panacea, and it does have potential\ndisadvantages. Decentralization may not always be efficient, especially for\nstandardized, routine, network-based services. It can result in the loss of\neconomies of scale and control over scarce financial resources by the central\ngovernment. Weak administrative or technical capacity at local levels may result\nin services being delivered less efficiently and effectively in some areas of the\ncountry. Administrative responsibilities may be transferred to local levels\nwithout adequate financial resources and make equitable distribution or\nprovision of services more difficult. Decentralization can sometimes make\ncoordination of national policies more complex and may allow functions to be\ncaptured by local elites. Also, distrust between public and private sectors may\nundermine cooperation at the local level.\nProject and program planners must be able to assess the strengths and\nweaknesses of public and private sector organizations in performing different\ntypes of functions. Before developing elaborate plans for decentralization, they\nmust assess the lowest organizational level of government at which functions can\nbe carried out efficiently and effectively and -- for functions that do not have to be\nprovided by government -- the most appropriate forms of privatization. Even\nprogram planners who do not see ‘decentralization’ as their primary motive must\ncarefully analyze the types of decentralization already present in a country in\norder to tailor policy plans to existing structures. Centralization and decentralization are not \"either-or\" conditions. In most\ncountries an appropriate balance of centralization and decentralization is\nessential to the effective and efficient functioning of government. Not all\nfunctions can or should be financed and managed in a decentralized fashion. Even\nwhen national governments decentralize responsibilities, they often retain\nimportant policy and supervisory roles. They must create or maintain the\n\"enabling conditions\" that allow local units of administration or non-government\norganizations to take on more responsibilities. Central ministries often have\ncrucial roles in promoting and sustaining decentralization by developing\nappropriate and effective national policies and regulations for decentralization\nand strengthening local institutional capacity to assume responsibility for new\nfunctions. The success of decentralization frequently depends heavily on training\nfor both national and local officials in decentralized administration. Technical\nassistance is often required for local governments, private enterprises and local\nnon-governmental groups in the planning, financing, and management of\ndecentralized functions. CHAPTER 6 – BUSINESS COMMUNICATION\nCONCEPT AND IMPORTANCE OF STAFFING\nMeaning of Staffing:\nThe term ‘Staffing’ relates to the recruitment, selection, development, training\nand compensation of the managerial personnel. Staffing, like all other managerial\nfunctions, is the duty which the apex management performs at all times. In a\nnewly created enterprise, the staffing would come as a. third step—next to\nplanning and organizing—but in a going enterprise the staffing process is\ncontinuous.\nIn order to define and clarify the group of employees included in the staffing\nconcept, it must be stated that the staffing function is concerned with the\nplacement, growth and development of all of those members of the organization\nwhose function it is to get things done through one effort of other individuals.\nThis definition includes all levels of management because those who will occupy\npositions in the top two or three levels of management fifteen or twenty years\nfrom now are likely to be found in the lower levels today.\n“The managerial function of staffing involves manning the organisational\nstructure through effective and proper selection, appraisal, and development of\npersonnel to fill the roles designed into the structure.” — Koontz and O’Donnell\nNature of Staffing:\nStaffing is an integral part of human resource management. It facilitates\nprocurement and placement of right people on the right jobs.\nThe nature of staffing function is discussed below:\n1. People Centred: Staffing is people centred and is relevant in all types of organisations. It is\nconcerned with all categories of personnel from top to bottom of the\norganisation.\nThe broad classification of personnel may be as follows:\n(i) Blue collar workers (i.e., those working on the machines and engaged in\nloading, unloading etc.) and white collar workers (i.e., clerical employees).\n(ii) Managerial and non-managerial personnel.\n(iii) Professionals (such as Chartered Accountant, Company Secretary, Lawyer,\netc.).\n2. Responsibility of Every Manager:\nStaffing is a basic function of management. Every manager is continuously\nengaged in performing the staffing function. He is actively associated with\nrecruitment, selection, training and appraisal of his subordinates. These activities\nare performed by the chief executive, departmental managers and foremen in\nrelation to their subordinates. Thus, staffing is a pervasive function of\nmanagement and is performed by the managers at all levels.\nIt is the duty of every manager to perform the staffing activities such as selection,\ntraining, performance appraisal and counseling of employees. In many\nenterprises. Personnel Department is created to perform these activities.\nBut it does not mean that the managers at different levels are relieved of the\nresponsibility concerned with staffing. The Personnel Department is established\nto provide assistance to the managers in performing their staffing function. Thus,\nevery manager has to share the responsibility of staffing. 3. Human Skills:\nStaffing function is concerned with training and development of human\nresources. Every manager should use human relations skill in providing guidance\nand training to the subordinates. Human relations skills are also required in\nperformance appraisal, transfer and promotion of subordinates. If the staffing\nfunction is performed properly, the human relations in the organisation will be\ncordial.\n4. Continuous Function:\nStaffing function is to be performed continuously. It is equally important in the\nestablished organisations and the new organisations. In a new organisation, there\nhas to be recruitment, selection and training of personnel. In a running\norganisation, every manager is engaged in various staffing activities. He is to\nguide and train the workers and also evaluate their performance on a continuous\nbasis.\nImportance of Staffing:\nIt is of utmost importance for the organisation that right kinds of people are\nemployed. They should be given adequate training so that wastage is minimum.\nThey must also be induced to show higher productivity and quality by offering\nthem incentives.\nIn fact, effective performance of the staff function is necessary to realize the\nfollowing benefits:\n1. Efficient Performance of Other Functions:\nStaffing is the key to the efficient performance of other functions of management.\nIf an organisation does not have competent personnel, it can’t perform planning,\norganisation and control functions properly. 2. Effective Use of Technology and Other Resources:\nIt is the human factor that is instrumental in the effective utilisation of latest\ntechnology, capital, material, etc. the management can ensure right kinds of\npersonnel by performing the staffing function.\n3. Optimum Utilisation of Human Resources:\nThe wage bill of big concerns is quite high. They also spend money on\nrecruitment, selection, training and development of employees. In order to get\nthe optimum output from the personnel, the staffing function should be\nperformed in an efficient manner.\n4. Development of Human Capital:\nThe management is required to determine the manpower requirements well in\nadvance. It has also to train and develop the existing personnel for career\nadvancement. This will meet the requirements of the company in future.\n5. Motivation of Human Resources:\nThe behaviour of individuals is shaped by many factors such as education level,\nneeds, socio-cultural factors, etc. that is why, the human aspect of organisation\nhas become very important. The workers can be motivated through financial and\nnon-financial incentives.\n6. Building Higher Morale:\nRight type of climate should be created for the workers to contribute to the\nachievement of the organisational objectives. By performing the staffing function\neffectively, management can show the significance it attaches to the personnel\nworking in the enterprise. This will increase the morale of the employees. RECRUITMENT - MEANING AND SOURCES\nThe process of finding and hiring the best-qualified candidate (from within or outside of\nan organization) for a job opening, in a timely and cost effective manner. The recruitment\nprocess includes analyzing the requirements of a job, attracting employees to that\njob, screening and selecting applicants, hiring, and integrating the new employee to the\norganization.\nRecruitment is the process of searching the candidates for employment and stimulating them\nto apply for jobs in the organization. It is the process of bringing together those who are\noffering jobs and those who are seeking jobs. Recruitment is a positive process where a pool of\nprospective employees is created and management select the right person for the right job\nfrom this pool. It provides a base for the selection process.\nPROCESS OF RECRUITMENT:\ni) Firstly it identify the different sources of employee supply\nii) To check their validity\niii) Selecting the most suitable source\niv) Inviting the applications from the prospective candidate for the vacancy.\nSources of recruitment:\nBroadly, there are two main sources of recruitment\n1) Internal sources of recruitment which means recruitment from within the organization.\n2)External sources of recruitment means recruitment from outside the organization 1) Internal sources of recruitment which means recruitment from within the\norganization:\ni) Transfer: it means shifting of employees from one job to another. There is no drastic change\nin the pay or status of the employees it generally remains the same.\nii) Promotion: it means shifting the employee to higher position with the change in the pay or\nstatus.\niii) Internal advertisement: it means appointing the employees from within the organization\nthrough advertisement.\niv) Lent services: it means employing the person for newly started plant in the organization.\nv) Extension of services: it is extending the service of employees by recruiting them again.\nvi) Absorption of trainees: those who come in the organization for training employing them.\n2) External sources of recruitment mean recruitment from outside the organization:\ni) Advertisement: it is a way to attract number of employees by giving advertisement in the\nnewspaper.\nii) Casual callers: the good organizations have a list of casual callers also who apply them and\nthe organization instead of giving new advertisement give a call to these casual callers.\niii) Employment exchange: it is a good source of recruitment where the candidates are called\nwith the help of employment exchange.\niv) Educational institutions: here the company’s go to the educational institutions from\nwhere they select the suitable employees for the job.\nv) Labor union: the organization may select the candidate from the labor union of the\ncompany to satisfy the labors also.\nvi) Recommendation of employees: sometimes the employees working in the organization\nalso suggest the name of suitable candidate for the appointment.\nvii) Waiting lists: generally the organization s prepares the waiting lists of the employees.\nSometimes the selected candidates failed to join in that case the waiting list employees are\ncalled.\nThus the above said are the main sources of recruitment of the employees within the\norganization and outside the organization which are used by the organization to employ the\nemployees. CONCEPT AND IMPORTANCE OF DIRECTING\nWhile managing an enterprise, managers have to get things done through people. In order to be able\nto do so, they have to undertake many activities, like guide the people who work under them, inspire\nand lead them to achieve common objectives. An office manager, for instance, has to supervise the\nactivities of his subordinates, i.e., typists, office assistants, dispatchers, accounts clerks, etc. He has to\nissue instructions to them and describe and illustrate the work and related activities. He has to tell\nthem what to do, and how to do it. The office manager can plan, organise and appoint people, but he\ncan not get things done, unless he assigns specific duties to his subordinates and motivates them to\nperform well. All these activities of a manager constitute the directing function.\nThus, directing is concerned with instructing, guiding, supervising and inspiring people in the\norganisation to achieve its objectives. It is the process of telling people what to do and seeing\nthat they do it in the best possible manner. The directing function thus, involves:\n• telling people what is to be done and explaining to them how to do it;\n• issuing instructions and orders to subordinates to carryout their assignments as scheduled;\n• supervising their activities;\n• inspiring them to meet the mangers expectation and contribute towards the achievement\nof organisational objectives; and\n• providing leadership.\nManagers plan and take decisions. They organise to define the work and create suitable\npositions in the enterprise. People are employed to perform the jobs, but the actual work of\ngetting the job done comes under the directing function. Thus, directing is 'management in\naction'. It is through the exercise of this function that managers get things done through\npeople.\nIMPORTANCE OF DIRECTING Plans remain mere plans unless they are put into action. In the absence of direction, subordinates will\nhave no idea as to what to do. They will probably not be inspired to complete the job satisfactorily.\nImplementation of plans is, thus, largely the concern of directing function. As a function of\nmanagement, directing is useful in many ways.\n• It guides and helps the subordinates to complete the given task properly and as per\nschedule.\n• It provides the necessary motivation to subordinates to complete the work\nsatisfactorily and strive to do them best.\n• It helps in maintaining discipline and rewarding those who do well.\n• Directing involves supervision, which is essential to make sure that work is performed\naccording to the orders and instructions.\nIMPORTANT PRINCIPLES OF DIRECTING:\n(1) Principle of Maximum Individual Contribution:\nAccording to this principle, management should adopt that directing policy through which the\nemployees get motivated and give their maximum individual contribution for the achievement\nof organisational objective.\n(2) Principle of Harmony of Objectives:\nAccording to this principle, there must be full coordination between organisational and\nindividual objectives. Employees work in an organisation with an objective to get better\nremuneration, promotion, etc. On the other hand, organisational goal can be to earn more\nprofits and to increase market share.\nSometimes it is seen that there is a conflict between the objectives of both the parties, e.g.,\norganisation wants that it should get a major share of profit whereas employees perceives that\nas they work directly on the job, so more profit must be shared among them in the form of\nbonus. Management here must establish coordination between the objectives of both the\nparties/factors by adopting suitable method of direction.\n(3) Principle of Unity of Command:\nAccording to this principle, a subordinate should get directions from one officer at a time. If the\nsubordinate gets directions from more than one officer, the subordinate will be unable to\npriorities his work.\nAs a result, situation of confusion, conflict and disarrangement is created. By following this\nprinciple, effective direction takes place.\n(4) Principle of Appropriateness of Direction Technique:\nAccording to this principle, appropriate direction techniques should be used, e.g., to supervise\neffectively, to provide able leadership, to adopt free communication and to motivate through\nright medium.\n(5) Principle of Managerial Communication:\nAccording to this principle, it should be monitored by the management that the subordinates\nget the same meaning for what has been said. This simplifies the job of the subordinates and\nthey need not go to the managers repeatedly for enquiring.\n(6) Principle of Use of Informal Organisation:\nAccording to this principle, there must be a free flow of information between the seniors and\nthe subordinates. The success of direction depends upon effective exchange of information to a\ngreat extent.\nInformation should be given both through formal and informal mediums. Special attention\nshould be given to the informal organisation. This strengthens the formal organisation.\n(7) Principle of Leadership: According to this principle, while giving directions to the subordinates a good leadership must\nbe provided by the managers. By this, subordinates get influenced by the managers. In this\nsituation, subordinates act according to the wish of the managers.\n(8) Principle of Follow Through:\nAccording to this principle, it must be monitored by management as to what extent the policies\nframed and issued directions have been enforced. Thus, it must be seen whether the\nemployees are following the management or not.\nIf yes, then to what extent. As per this principle, the job of managers is not to sit idle after\nframing policies or issuing directions but to continuously take feedback. The advantage of this\nwill be that if there is any problem in implementing a policy or a direction it can be removed\nthen and there.\nELEMENT OF DIRECTING\nIt has been made clear in the nature of leading that it is not a single activity but a group of\nfunctions. On the same basis, the following functions are included in its scope: (1) Supervision,\n(2) Communication, (3) Leadership, and (4) Motivation.\n(1) Supervision:\nIt refers to monitor the progress of routine work of one’s subordinates and guiding them\nproperly. Supervision is an important element of the directing function of management.\nSupervision has an important feature that face-to-face contact between the supervisor and his\nsubordinate is a must. (2) Communication:\nIt refers to an art of transferring facts, ideas, feeling, etc. from one person to another and\nmaking him understand them. A manager has to continuously tell his subordinates about what\nto do, how to do, and when to do various things.\nAlso, it is very essential to know their reactions. To do all this it becomes essential to develop\neffective telecommunication facilities. Communication by developing mutual understanding\ninculcates a sense of cooperation which builds an environment of coordination in the\norganisation.\n(3) Leadership:\nIt refers to influence others in a manner to do what the leader wants them to do. Leadership\nplays an important role in directing. Only through this quality, a manager can inculcate trust\nand zeal among his subordinates.\n(4) Motivation:\nIt refers to that process which excites people to work for attainment of the desired objective.\nAmong the various factors of production, it is only the human factor which is dynamic and\nprovides mobility to other physical resources. If the human resource goes static then other resources automatically turn immobile. Thus, it\nbecomes essential to motivate the human resource to keep them dynamic, aware and eager to\nperform their duty. Both the monetary and non-monetary incentives are given to the\nemployees for motivation.\nSUPERVISION - CONCEPT AND ROLE\nA variety of definitions for clinical supervision exist. Differences typically reflect aspects of the\nauthor’s discipline and training focus. Bernard and Goodyear (1998) offer this definition that\nhas come to be accepted within the counseling profession:\nSupervision is an intervention that is provided by a senior member of a profession to a junior\nmember or members of that same profession. This relationship is evaluative, extends over\ntime, and has the simultaneous purposes of enhancing the professional functioning of the\njunior member(s), monitoring the quality of professional services offered to the clients she, he,\nor they see(s), and serving as a gatekeeper of those who are to enter the particular profession.\nWithin the definition, there is mention of several components of supervision:\nSupervision is an intervention\nThere are unique competencies and skills involved in supervision that allow the supervisor to\nhelp the supervisee. Models of supervision exist that provide a framework for the process. In\naddition, supervisors incorporate various modes and interventions to facilitate supervisee\ndevelopment.\nAwareness of these models, modes, and interventions will help the supervisee understand the\nunderlying processes of supervision and therefore, be a more active participant in the\nsupervision process. A dialogue can develop between supervisor and supervisee as a means to\nshare personal styles and preferences for frameworks and interventions to be used in\nsupervision. Supervision is provided by a senior member of a profession\nA clinical supervisor is more advanced, at least in some important ways, than the supervisee.\nDuring fieldwork experiences, supervisors typically include a course instructor and an\nindividual clinical supervisor. Depending on the level of the fieldwork experience and the\nprogram, the clinical instructor may be the course instructor or other professor from the\ntraining program, a doctoral student from the training program, and/or a professional\ncounselor affiliated with the site at which the student is engaged in the fieldwork experience.\nIt is important that the supervisee understand the roles and expectations of each supervisor.\nSupervision is a relationship that extends over time\nThe process of supervision occurs within the relationship established between the supervisor\nand supervisee. It is important to keep in mind that both the supervisor and supervisee\ncontribute to the relationship and have responsibilities within the process. As assumption of\nsupervision is that it will last long enough for some developmental progress of the supervisee.\nSupervision is differentiated from brief interactions (such as workshops), and consultation\nthat, by definition, is time and session limited, although all of these interactions share common\ngoals (e.g., training in a skill, clarification of process, regaining objectivity). The fact that\nsupervision is ongoing allows for the relationship to grow and develop. The importance of the\nsupervisory relationship has received much attention in supervision literature.\nWhile not the sole determinate of the quality of supervision, the quality of the relationship\nbetween the supervisor and supervisee can add or detract from the experience. It is important\nthat the “relationship” aspect of supervision not be overlooked or neglected.\nThe supervisor evaluates, monitors, and serves as a gatekeeper\nIn addition to enhancing the professional functioning of counselors, supervisors have\nan ethical and legal responsibility to monitor the quality of care that is being delivered to the\nsupervisee’s clients. In order to enhance the professional functioning of the supervisee and\nassure quality of care, the supervisor constantly monitors and provides feedback regarding\nsupervisee performance. This formative evaluation forms the basis of the work done in supervision. The supervisor also serves as a gatekeeper for those who want to enter the\ncounseling profession. The supervisor is charged to evaluate the counselor based on work\ndone with current clients, and to assess potential for working with future clients. As part of\nthis role, supervisors formallyevaluate supervisees. These summative evaluations occur after\nthere has been enough supervision to expect a certain degree of competence. For example,\nduring fieldwork experiences, summative evaluations typically occur at the midpoint and end\nof semesters.\nMOTIVATION - CONCEPT, MASLOW’S HIERARCHY OF NEEDS\nMotivation is the driving force which help causes us to achieve goals. Motivation is said to be\nintrinsic or extrinsic. The term is generally used for humans but, theoretically, it can also be\nused to describe the causes for animal behavior as well. This article refers to human\nmotivation. According to various theories, motivation may be rooted in a basic need to\nminimize physical pain and maximize pleasure, or it may include specific needs such as eating\nand resting, or a desired object, goal, state of being, ideal, or it may be attributed to less-\napparent reasons such as altruism, selfishness, morality, or avoiding mortality. Conceptually,\nmotivation should not be confused with either volition or optimism. Motivation is related to,\nbut distinct from, emotion.\nMotivation concepts\nIntrinsic and extrinsic motivation\nIntrinsic motivation refers to motivation that is driven by an interest or enjoyment in the task\nitself, and exists within the individual rather than relying on any external pressure. Intrinsic\nmotivation has been studied by social and educational psychologists since the early 1970s.\nResearch has found that it is usually associated with high educational achievement and\nenjoyment by students. Explanations of intrinsic motivation have been given in the context of\nFritz Heider's attribution theory, Bandura's work on self-efficacy, and Deci and Ryan's cognitive evaluation theory (see self-determination theory). Students are likely to be\nintrinsically motivated if they:\n attribute their educational results to internal factors that they can control (e.g. the\namount of effort they put in),\n believe they can be effective agents in reaching desired goals (i.e. the results are not\ndetermined by luck),\n are interested in mastering a topic, rather than just rote-learning to achieve good\ngrades.\nExtrinsic motivation comes from outside of the individual. Common extrinsic motivations are rewards\nlike money and grades, coercion and threat of punishment. Competition is in general extrinsic because\nit encourages the performer to win and beat others, not to enjoy the intrinsic rewards of the activity.\nA crowd cheering on the individual and trophies are also extrinsic incentives.\nSocial psychological research has indicated that extrinsic rewards can lead to overjustification and a\nsubsequent reduction in intrinsic motivation. In one study demonstrating this effect, children who\nexpected to be (and were) rewarded with a ribbon and a gold star for drawing pictures spent less\ntime playing with the drawing materials in subsequent observations than children who were assigned\nto an unexpected reward condition and to children who received no extrinsic reward.[4]\nSelf-determination theory proposes that extrinsic motivation can be internalised by the individual if\nthe task fits with their values and beliefs and therefore helps to fulfill their basic psychological needs.\nSelf-control\nThe self-control of motivation is increasingly understood as a subset of emotional intelligence; a person may be highly intelligent according to a more conservative definition (as measured by many\nintelligence tests), yet unmotivated to dedicate this intelligence to certain tasks. Yale School of\nManagement professor Victor Vroom's \"expectancy theory\" provides an account of when people will\ndecide whether to exert self control to pursue a particular goal.\nDrives and desires can be described as a deficiency or need that activates behavior that is aimed at a\ngoal or an incentive. These are thought to originate within the individual and may not require\nexternal stimuli to encourage the behavior. Basic drives could be sparked by deficiencies such as\nhunger, which motivates a person to seek food; whereas more subtle drives might be the desire for\npraise and approval, which motivates a person to behave in a manner pleasing to others.\nBy contrast, the role of extrinsic rewards and stimuli can be seen in the example of training animals\nby giving them treats when they perform a trick correctly. The treat motivates the animals to perform\nthe trick consistently, even later when the treat is removed from the process.\nMASLOW’S HIERARCHY OF NEEDS; INCENTIVE AND ITS VARIOUS TYPES\nThe term ’incentive’ is not peculiar to economics alone, it is a general term used in many spheres of\nlife. However, in economics, it is a very important word. In fact you can never study economics\nsuccessfully without understanding what incentives are. One American economist says that\neconomics in its entirety is a study of people’s response to incentives. Whether that statement is\naccurate or not is subject to one’s point of view, but what comes out clearly is the fact that incentives\nare truly central to the study of economics.\ndictionary definition of an incentive is ‘something that motivates you to do something’. In economics\none can say that an incentive is a benefit, reward, or cost that motivates an economic action. Human\nbeings do things deliberately and purposefully, and, naturally, people expect to benefit from their own\ndecisions and actions. Before someone decides to produce something and sell it to people, they should have taken time to think and decide that doing this will help them earn something. Likewise, before a\nconsumer buys anything, they know (or at least they think) that they are going to benefit from the\nproduct. In strict sense, it is more than just the usual concepts or trade and economics, it is about\nhuman nature. No one does something for no reason. Not when they have to spend time and\nresources in doing so.\nTypes of incentives\nIncentives can be grouped into four main categories, or types. These types of incentives apply both to\neconomics and to other spheres of life.\nFinancial incentives\nPerhaps in the modern times, financial incentives are more dominant. Before you get to business, you\nknow that it is always about profit. Employment is all about salary and remuneration. It is true that\nsometimes people do voluntary jobs for some reasons other than financial ones. But ultimately, the\nmain reason why human beings do business or work at all in modern days is money. It is this type of\nincentive that informs the idea of product promotions, where people are told that if they buy a certain\nproduct; they stand a chance of winning a certain amount of money.\nMoral incentives\nMoral incentives motivate people to do things on the basis of right and wrong. People are encouraged\nto do certain action because morally, it is the right thing to do. Aspects of morality today are quite\ndiverse, varying broadly from one society to the next, and it is practically impossible to define morals\nof society in general. Moral incentives therefore generally appeal to an individual’s own conscience.\nNatural incentives\n“What will happen if I do this?” We often ask ourselves. Humans are naturally curious creatures, and\nwe do many things for no reason other than to find out what the consequences are.\nCoercive incentives\nCoercive investments emphasize on the consequences of not doing something, rather than the benefit\nof doing it.A good example is blackmail. You are warned to do something or risk being beaten up, or\nbeing reported to your seniors. That is a coercive incentive. LEADERSHIP - CONCEPT; QUALITIES OF A GOOD LEADER\n“Leadership is the art of leading others to deliberately create a result\nthat wouldn’t have happened otherwise.”\nThe Characteristics of a Good Leader\nWhat makes a good leader? Here are some of their most important characteristics:\nSelf-Awareness. You have an intimate knowledge of your inner emotional state. You know your\nstrengths and your weaknesses. You know when you’re working in flow and you know when you’re\nover worked. You know yourself, including your capabilities and your limitations, which allows you to\npush yourself to your maximum potential.\nSelf-Direction. You’re able to direct yourself effectively and powerfully. You know how to get things\ndone, how to organize tasks and how to avoid procrastination. You know how to generate energy for\nprojects, to calm yourself when angered. You can make decisions quickly when necessary, but can also\nslow to consider all the options on the table.\nVision. You’re working towards a goal that’s greater than yourself. It could be something small, like\nthe success of the team, or a larger vision like world peace. Working towards a vision is far more\ninspiring than working towards personal gain.\nAbility to Motivate. Leaders don’t lead by telling people what they have to do. Instead, leaders cause\npeople to want to help them. A key part of this is cultivating your own desire to help others. When\nothers sense that you want to help them, they in turn want to help you. Social Awareness. Understanding social networks and key influencers in that social network is\nanother key part of leadership. Who in the organization has the most clout, both officially and\nunofficially? Who moves the hearts of the group?\nThese are some of the most important characteristics of good leaders.\nEmotional Intelligence and Leadership\nMost of these traits tie directly into emotional intelligence (EQ). Leaders with high EQ are intrinsically\nmore self-aware. They understand their mental processes and know how to direct themselves.\nThey’re more in touch with what they’re deeply passionate about. They naturally care more for others\nand receive more compassion in return. They’re more socially in tune.\nLeadership is more often than not about “soft skills” rather than hard skills. Yes, a leader who\nunderstands what drives the bottom line is valuable. Yet it’s the leader who can get others to perform\nat their best who ultimately creates winning organizations. CHAPTER 5: CONSUMER PROTECTION\nIMPORTANCE OF CONSUMER PROTECTION , CONSUMER RIGHTS. CONSUMER\nRESPONSIBILITIES\nCONSUMER PROTECTION\nProtection of consumers’ rights is important to all inhabitants, because everybody buys\ncommodities and uses services. That is why it is essential to everyone that his or her rights are\nprotected while making purchases – so that commodities one buys are safe and do not harm one’s\nhealth or danger one’s life, so that information given is complete and real, so that advertisements\nare not misleading, so that there are no unjust provisions of the contracts and so that consumers\ncan exercise their rights.\nConsumer Rights Protection Centre (CRPC) insures operation of Consumer Rights Protection Law,\nAdvertising Law, Law on the Safety of Goods and Services, Law On Information Society Services, as\nwell as other laws and many regulations of Cabinet of Ministers, that regulate consumer rights, in\nLatvia.\nTo insure implementation of functions entrusted to us, CRPC main tasks and directions of activity\nare as follows:\n1) supervising and controlling of the market:\n- supervising commerce of non-food consumer goods (except medical commodities, medicaments,\nveterinary medicaments, cosmetics, veterinary-pharmaceutical products, animal care products,\nhouse-hold use chemical substances and chemical products)\n- Supervising of information about commodities and services, as well as information given by\nmanufacturers, vendors or providers of services, for it to be in compliance with laws and\nregulations.\n- Supervising of correct determination of food and non-food consumer goods’ weight and size,\ncorrect calculation of commodity’s price, as well as supervising of prices’ indication procedure\n- Supervising of services\n- Supervising of e-commerce and e-business – providing of information, fulfillment of contract, etc. - Organization and coordination of cooperation between supervision and control institutions\ninvolved in implementation of state policy about protection of consumer rights and\nnongovernmental organizations of consumer’s rights protection.\n2) Reviewing of consumer complaints about violation of consumer rights, inter alia:\n- Rendering of assistance to consumers in solving of conflicts with manufacturers, vendors and\nproviders of services\n- Requiring of fulfillment of lawful demands of consumers\n- Controlling of procedure how consumer declares claim about commodity or service, which is\nimproper to provision of the contract. Controlling of organization of commodity’s or service’s\nexpertise. To make a decision about fulfillment of lawful demands of consumers.\n- Accordingly to competence of CRPC, to create, to maintain and to update data base of expertise\nperformers\n- Providing legal aid to consumers regarding their rights\n3) Protection of consumers’ economical interests – supervision of advertising and\nsupervising of contracts’ projects and contracts which consumers conclude with\nmanufacturers, vendors and providers of services to comply with consumers rights, inter\nalia:\n- To perform actions planned in laws and regulations, so that manufacturer, vendor or provider of\nservice changed project of the contract or terminated fulfillment of provisions of contract, when\nunjust or unclear provisions are found in project of the contract or in concluded contract\n- To verify the consideration of procedure for undertaking, execution and implementation of\nwarranty obligations\n- To supervise being in compliance with laws and regulations of crediting contracts, distance\ncontracts and other contracts\n- To verify if contracts concluded by consumers include procedure given in laws and regulations for\nannouncement and exploitation of refusal rights\n- To evaluate compliance with laws and regulations of providing of complex tourism services -Protection of consumers’ collective interests\n- Protection of air passengers’ rights\n- Supervising of e-commerce and e-business – providing of information, fulfillment of contract, etc.\n- To evaluate compliance with laws and regulations of advertising and to make according decisions\nNow let‘s discuss importance and need of consumer protection one by one.\n1. Protection from Exploitation\nImportance of the consumer protection is to safeguard the consumer from exploitation. In the\nabsence of consumer protection, consumers were exploited in many ways e.g. sale of unsafe\nproducts, adulteration and hoarding of goods, using wrong weights and measures, charging\nexcessive prices and sale of inferior quality goods, etc. Through various Consumer Protection\nActs; business organizations are under pressure to keep away from exploiting consumers.\n2. Consumer Education\nImportance of consumer protection is to create awareness among consumers about their\nrights and responsibilities by organizing workshops and seminars and gives them confidence\nto take legal action against companies who have defaulted.\n3. Redressal of Complaints\nImportance of Consumer Protection is to present the consumer complaints in appropriate\nconsumer courts and make sure that justice is done to consumers. 4. Bulletins and Periodicals\nImportance of consumer protection organization is to issue various journals and periodicals in\nwhich wide publicity is given to the unfair trade practices adopted by business organisations\nso that they are pressured to give fair treatment to consumers.\n5. Encouraging Honest Businessmen\nImportance of consumer protection is to encourage the honest businessmen. organizations\ngive the credit to the business organizations which aims at consumer satisfaction by publishing\nfavorable reports in their periodical's about them. This helps in building goodwill for such\norganizations.\n6. Connecting Link\nImportance of consumer protection is they play connecting link between the consumer.\nConsumer Protection organizations act as a link between consumers wanting to file complaints\non one side and the business organizations that have defaulted on other sides and make sure\nthat justice is done to final consumers.\n7. Unity\nConsumer Protection aims at bringing unity among consumers to fight collectively against the\nbusiness organisations which indulge in unfair trade practices. Consumers are encouraged to\nform co-operative societies so that the focus is on providing services to members rather than\nearning profit on the cost of customers. 8. Quality life for Consumer\nImportance of Consumer Protection is to aim at redressal of consumer complaints in an\neffective manner but also on giving good-quality life to consumers by business organizations\nwho have defaulted on the other side and make sure that justice is done to final consumers.\n9. Ethical Obligations\nImportance of consumer protection, Today ethics play a prominent role in business. Business\nwithout ethical values is nothing but a criminal activity. Protecting the interests of the\nconsumer includes absence of unfair business practices such as black marketing, profiteering,\ncreating an artificial shortage, using wrong weights and measures, publishing false\nadvertisement, etc. It is necessary for a businessman not to practice such uneven means\nthereby protect the interest of consumers.\n10. Getting Public Support\nImportance of consumer protection does not isolate the business. Financial institutions and\nbanks provide finance to business. Government provides support and incentives. Employees\ncontribute their time, skill and labour. Consumers are ready to pay for value. The businessmen\ncan get the best support of all these parties only when it stops exploiting its customers.\nTo conclude, the importance of Consumer Protection is to safeguard consumers from any kind\nof exploitation from business organizations and ensuring the position of ‘King of Market’ to\nconsumer.\nNEED OF CUSTOMER PROTECTION\nThe necessity of adopting measures to protect the interest of consumers arises mainly due to\nthe helpless position of the consumers. There is no denying fact that the consumers have the\nbasic right to be protected from the loss or injury caused on account of defective goods and\ndeficiency of services. But they hardly use their rights due to lack of awareness, ignorance or\nlethargic attitude. However in view of the prevailing malpractices and their vulnerability there\nto, it is necessary to provide them physical safety, protection of economic interests, access to information, satisfactory product standard, and statutory measures for redressal of their\ngrievances. The other main arguments in favour of consumer protection are as follows:\n(a) Social Responsibility\nThe business must be guided by certain social and ethical norms. It is the moral\nresponsibility of the business to serve the interest of consumers. Keeping in line with this\nprinciple, it is the duty of producers and traders to provide right quality and quantity of\ngoods at fair prices to the consumers.\n(b) increasing Awareness\nThe consumers are becoming more mature and conscious of their rights against the\nmalpractices by the business. There are many consumer organisations and associations\nwho are making efforts to build consumer awareness, taking up their cases at various\nlevels and helping them to enforce their rights.\n(c) Consumer Satisfaction\nFather of the Nation Mahatma Gandhi had once given a call to manufactures and traders to\n\"treat your consumers as god\\ Consumers' satisfaction is the key to success of business.\nHence, the businessmen should take every step to serve the interests of consumers by\nproviding them quality goods and services at reasonable price.\n(d) Principle of Social Justice\nExploitation of consumers is against the directive principles of state policy as laid down in\nthe Constitution of India. Keeping in line with this principle, it is expected from the\nmanufacturers, traders and service providers to refrain from malpractices and take care of\nconsumers' interest.\n(e) Principle of Trusteeship\nAccording to Gandhian philosophy, manufactures and producers are not the real owners\nof the business. Resources are supplied by the society. They are merely the trustees of the\nresources and, therefore, they should use such resources effectively for the benefit of the\nsociety, which includes the consumers. (f) Survival and Growth of Business\nThe business has to serve consumer interests for their own survival and growth. On\naccount of globalisation and increased competition, any business organisation which\nindulges in malpractices or fails to provide improved services to their ultimate consumer\nshall find it difficult to continue. Hence, they must in their own long run interest, become\nconsumer oriented.\nRIGHT TO CUSTOMER\nF, Kennedy, the former USA President, in his message to consumer had given six rights to\nconsumers. These rights are (i) right to safety, (ii) right to be informed, (iii) right to choose,\n(iv) right to be heard, (v) right to redress and (vi) right to represent. These rights had paved\nthe way for organised consumer movement in the USA and later it spread all over the world. In\nIndia, the Consumer Protection Act, 1986 has also provided for the same rights to consumers.\nLet us have a brief idea about these rights of consumers.\n(a) Right to Safety\nIt is the right of the consumers to be protected against goods and services which are\nhazardous to health or life. For example, defective vehicles could lead to serious accidents.\nThe same is true of electrical appliances with sub-standard material. Only recently, there\nwere mass protests and boycott of soft drinks due to presence of hazardous pesticides\nbeyond permissible limits. Thus, right to safety is an important right available to the\nconsumer which ensures that the manufacturers shall not produce and sell sub-standard\nand dangerous products.\n(b) Right to be Informed\nThe right to be informed is an important component of consumer protection. The\nconsumer must be provided with adequate and accurate information about quality,\nquantity, purity, standard and the price of the goods and services. Now-a-days the\nmanufacturers provide detailed information about the contents of the product, its\nquantity, date of manufacturing, date of expiry, maximum retail price, precautions to be taken, etc. on the label and package of the product. Such information helps the consumers\nin their buying decision and use of the product.\n(c) Right to Choose\nThe right to choose provides that the consumer must be assured, whenever possible,\naccess to a variety of goods and services at competitive prices. If the market has enough\nvarieties of products at highly competitive prices, the buyers have an opportunity of wide\nselection. However, incase of monopolies like railways, postal service and electricity\nsupply etc. it implies a right to be assured of satisfactory quality of service at a fair price.\n(d) Right to be Heard\nThe rights to safety, information and choice will be frivolous without the right to be heard.\nThis right has three interpretations. Broadly speaking, this right means that consumers\nhave a right to be consulted by Government and public bodies when decisions and policies\nare made affecting consumer interests. Also, consumers have a right to be heard by\nmanufactures, dealers and advertisers about their opinion on production, marketing\ndecisions and any grievances of the consumers. Now-a-days, most of the top\nmanufacturers and firms have set up consumer service cells to attend to consumers'\ncomplaints and take appropriate steps for their redressal. Thirdly, consumers have the\nright to be heard in legal proceedings in law courts dealing with consumer complaints.\n(e) Right to seek Redressal\nThe consumers have been given the right of redressal of their grievances relating to the\nperformance, grade, quality etc. of the goods and services. If required, the product must be\nrepaired / replaced by the seller/ manufacturer. The Consumer Protection Act has duly\nprovides for a fair settlement of genuine grievances of the consumers. It has also set up a\nproper mechanism for their redressal at district, state and national levels.\n(f) Right to Consumer Education\nIt means the right to receive knowledge and skill to become informed consumer. In this\ndirection the consumer associations, educational institutions and the policy makers can\nplay an important part. They are expected to impart information and knowledge about (i) the relevant laws which are aimed at preventing unfair trade practices, (ii) the ways and\nmeans which dishonest traders and producers may adopt to deceive the consumers, (iii)\ninsistence on a bill or receipt at the time of purchase, and (iv) the procedure to be followed\nby consumers while making complaints. Effective consumer education leads to an\nincreased level of consumer awareness and help them to enforce their rights more\neffectively, and protect themselves against fraudulent, deceitful and grossly misleading\nadvertisement, labeling, etc.\nRESPONSIBILITIES OF CONSUMER\n(a) Be quality conscious\nTo put a stop to adulteration and corrupt practices of the manufacturers and traders, it is\nthe duty of every consumer to be conscious of the quality of product they buy. They should\nlook for the standard quality certification marks like ISI, Agmark, FPO, Woolmark, Eco-\nmark, Hallmark etc. while making the purchases.\n(b) Beware of misleading advertisements\nThe advertisement often exaggerates the quality of products. Hence, the consumers should\nnot rely on the advertisement and carefully check the product or ask the users before\nmaking a purchase. Incase there are discrepancies, the same should be brought to the\nnotice of the sponsors and the appropriate authority, if need be.\n(c) Responsibility to inspect a variety of goods before making selection\nThe consumer should inspect a variety of goods before buying the goods and service. For\nthis purpose he/she should compare their quality, price, durability, after sales service etc.\nThis would enable the consumers to make the best choice within the limit of their own\nresources. (d) Collect proof of transaction\nThe consumer should insist on a valid documentary evidence (cash memo/invoice)\nrelating to purchase of goods or availing of any services and preserve it carefully. Such\nproof of purchase is required for filing a complaint. In case of durable goods the\nmanufactures generally provide the warrantee/guarantee card along with the product. It\nis the duty of consumers to obtain these documents and ensure that these are duly signed,\nstamped and dated. The consumer must preserve them till the warrantee/ guarantee\nperiod is over.\n(e) Consumers must be aware of their rights\nThe consumers must be aware of their rights as stated above and exercise them while\nbuying goods and services. For example, it is the responsibility of a consumer to insist on\ngetting all information about the quality of the product and ensure himself/ herself that it\nis free from any kind of defects.\n(f) Complaint for genuine grievances\nAs a consumer if you are dissatisfied with the product/services, you can ask for redressal\nof your grievances. In this regard, you must file a proper claim with the company first. If\nthe manufacturer/company does not respond, then you can approach the forums. But your\nclaim must state actual loss and the compensation claim must be reasonable. At no cost\nfictitious complaints should be filed otherwise the forum may penalise you.\n(g) Proper use of product/services\nIt is expected from the consumers that they use and handle the product/services properly.\nIt has been noticed that during guarantee period, people tend to reckless use of the\nproduct, thinking that it will be replaced during the guarantee period. This practice should\nbe avoided.\nWAY AND MEANS OF CONSUMER PROTECTION We have enumerated several instances of exploitations and malpractices on the part of\nmanufacturers, traders, dealers and services providers. Now the question arises as to how can\nthese be eliminated. Actually it is very difficult to stop such exploitation by any consumer\nsingle handedly. The consumers have to collectively act against such malpractices and take the\nhelp of consumer organisations and the government agencies. Infact, consumer protection\nessentially needs consumer awareness, education and guidance, and it cannot be assured by\nvoluntary business conduct or self-regulation. The following are the various ways and means\nof consumer protection followed in Indi\nLok Adalat\nLok Adalats are the effective and economical system for quick redressal of the public\ngrievances. The aggrieved party can directly approach the adalats with his grievance, and his\nissues are discussed on the spot and decisions are taken immediately. The consumers may take\nthe advantage of this system to solve their problems. Cases of electricity billing, telephone\nbillings, road accidents etc. can be taken up in Lok Adalat for spot settlement. Infact, Indian\nRailways, Mahanagar Telephone Nigam Limited and Delhi Vidyut Board hold Lok Adalat\nregularly to settle user's grievances on the spot.\nPublic interest Litigation\nPublic Interest Litigation (PIL) is a scheme under which any person can move to the court of\nlaw in the interest of the society. It involves efforts to provide legal remedy to un-represented\ngroups and interests. Such groups may consist of consumers, minorities, poor persons,\nenvironmentalists and others. Any person or organisation, though not a party to the\ngrievances, can approach the court for remedial action in case of any social atrocities.\nRedressal Forums and Consumer Protection Councils Under the Consumer Protection Act 1986, a judicial system has been set up to deal with the\nconsumer grievances and disputes at district level, state level and national level. These are\nknown as District Forum, State Consumer Disputes Redressal Commission (State Commission)\nand National Consumer Disputes Redressal Commission (National Commission). Any\nindividual consumer or association of consumers can lodge a complaint with the District, State\nor National level forum, depending on the value goods and claim for compensation. The main\nobjective of these forums is to provide for a simple, speedy and inexpensive redressal of\nconsumers' grievances. The Act as amended in 2002 also provides for setting up of Consumer\nProtection Council at district, state and national level for promotion and protection of the\nrights of the consumers as laid down in Section 6 of the Act. The councils are required to give\nwide publicity to the rights of consumers, the procedures for filling complaints by them and\nprovide inputs to consumer movement in the country.\nAwareness Programme\nTo increase the level of awareness among the consumers the Government of India has initiated\nvarious publicity measures. It regularly brings out journals, brochures, booklets and various\nposters depicting the rights and responsibilities of consumers, redressal machineries etc. It\nobserves World Consumer Rights Day on 15 March and National Consumer Day on 24\nDecember. Several video programmes on consumer awareness are broadcasted through\ndifferent television channels. Similarly, audio programmes are also broadcasted through All\nIndia Radio and FM channels. The poster and slogan competition on consumer protection are\nalso organised at various level. To encourage the participation of public in the field of\nconsumer protection the Government has also instituted National Awards to the persons who\nhave done outstanding work in this field.\nConsumer Organisations\nConsumer organisations have been active all over the world to promote and protect consumer\ninterests. A number of such organisations have also been set up in recent years in different\nparts of India. It is felt that neither it is possible to discipline all members of the business\ncommunity through moral sanctions and a code of fair business practices nor can administrate\norders and legislative provisions to ensure consumer protection without the active involvement of consumer associations. Now with an increasing number of consumer\norganisations involved in consumer protection, the consumer movement is getting a foothold\nin India and helping individuals to seek quick and adequate redressal of their grievances. Look\nat the box for some of such consumer organisations. CHAPTER-7 - BUSINESS ADMINISTRATION AND BUSINESS ENVIRONMENT\nBusiness environment refers to different forces or surroundings that affect business\noperations. Such forces include customers, competitors, suppliers, distributors, industry\ntrends, substitutes, regulations, government activities, the economy, demographics, and social\nand cultural factors. Others are innovations and technological developments.\nWHAT IS BUSINESS ENVIRONMENT?\nA business organization can not exist a vacuum. It needs living persons, natural\nresources and places and things to exist. The sum of all these factors and forces is called\nthe business environment.\nBusiness environment is of two types-\n(i) Micro environment or the internal environment\n(ii) Macro environment or the external environment\n(i) Micro environment / Internal Environment of Business\nMicro environment comprises of the factors in the immediate environment of the\ncompany that affect the performance of the company. In includes the suppliers,\ncompetitors, Marketing intermediaries, customers, pressure groups and the general\npublic. Supplier form an important factor of the micro environment of business as the\nimportance of reliable sources of supply are obvious. Supplier include the financial labor\ninput. Stock holders, banks and other similar organizations that supply money to the\norganization are also termed as suppliers. Managers always strive to ensure a study flow\nof inputs at the lowest price. Customers are also an important factor in the internal\nenvironment of business. The customers or the clients absorb the output of an\norganization and a business exists to meet the demands of the customers. Customers\ncould be individuals, industries, government and other institutions. Labor force is also an important part of the internal environment of business. Other than these the business\nassociates, competitors, regulatory agencies and the marketing intermediaries are also a\npart of the micro business environment.\nMacro environment / External environment of Business :\nThe forces and institutions out side of the organization that can potentially affect the\nperformance of the organization come under the external environment of Business. The\nmacro environment of business consist of the economic, demographic, natural, cultural and\npolitical forces. The external environment of business is often categorized into the\neconomic environment, political and government environment, socio cultural environment\nand the international environment.Business Market is understanding the environment\nwithin which the business has to operate is very important for running a business unit\nsuccessfully at any place. Because, the environmental factors influence almost every aspect\nof business, be it its nature, its location, the prices of products, the distribution system, or\nthe personnel policies. Hence it is important to learn about the various components of the\nbusiness environment, which consists of the economic aspect, the socio-cultural aspects,\nf J\nLegal ( Factors\nS\nBUSINESS ENVIRONMENT\nthe political framework, the legal aspects and the technological aspects etc. In this chapter,\nwe shall learn about the concept of business environment, its nature and significance and\nthe various components of the environment. In addition, we shall also acquaint ourselves\nwith the concept of social responsibility of business and business ethics. IMPORTANCE OF BUSINESS ENVIRONMENT\nThere is a close and continuous interaction between the business and its environment. This\ninteraction helps in strengthening the business firm and using its resources more effectively.\nAs stated above, the business environment is multifaceted, complex, and dynamic in nature\nand has a far-reaching impact on the survival and growth of the business. To be more specific,\nproper understanding of the social, political, legal and economic environment helps the\nbusiness in the following ways:\n(a) Determining Opportunities and Threats: The interaction between the business and its\nenvironment would identify opportunities for and threats to the business. It helps the\nbusiness enterprises for meeting the challenges successfully.\n(b) Giving Direction for Growth: The interaction with the environment leads to opening up\nnew frontiers of growth for the business firms. It enables the business to identify the areas\nfor growth and expansion of their activities.\n(c) Continuous Learning: Environmental analysis makes the task of managers easier in\ndealing with business challenges. The managers are motivated to continuously update their\nknowledge, understanding and skills to meet the predicted changes in realm of business.\n(d) image Building: Environmental understanding helps the business organisations in\nimproving their image by showing their sensitivity to the environment within which they\nare working. For example, in view of the shortage of power, many companies have set up\nCaptive Power Plants (CPP) in their factories to meet their own requirement of power.\n(e) Meeting Competition: It helps the firms to analyse the competitors' strategies and\nformulate their own strategies accordingly.\n(f) Identifying Firm's Strength and Weakness: Business environment helps to identify the\nindividual strengths and weaknesses in view of the technological and global developments. TYPE OF BUSINESS ENVIRONMENT\nConfining business environment to uncontrollable external factors, it may be classified as (a)\nEconomic environment; and (b) Non-economic environment. The economic environment\nincludes economic conditions, economic policies and economic system of the country. Non-\neconomic environment comprises social, political, legal, technological, demographic and\nnatural environment. All these have a bearing on the strategies adopted by the firms and any\nchange in these areas is likely to have a far-reaching impact on their operations. Let us have a\nbrief idea about each of these areas of business environment.\n3.2.1 ECONOMIC ENVIRONMENT\nThe survival and success of each and every business enterprise depend fully on its economic\nenvironment. The main factors that affect the economic environment are:\n(a) Economic Conditions: The economic conditions of a nation refer to a set of economic\nfactors that have great influence on business organisations and their operations. These\ninclude gross domestic product, per capita income, markets for goods and services,\navailability of capital, foreign exchange reserve, growth of foreign trade, strength of capital\nmarket etc. All these help in improving the pace of economic growth.\n(b) Economic Policies: All business activities and operations are directly influenced by the\neconomic policies framed by the government from time to time. Some of the important\neconomic policies are:\n(i) Industrial policy\n(ii) Fiscal policy\n(iii)Monetary policy\n(iv)Foreign investment policy\n(v) Export -Import policy (Exim policy) RECENT DEVELOPMENT IN INDIAN ECONOMY\nThe economic environment of business in India has been changing at a fast rate mainly due to\nthe changes in the economic policies of the government. At the time of independence, the\nIndian economy was basically agrarian with a weak industrial base. To speed up the industrial\ngrowth and solve various economic problems, the government took several steps like state\nownership on certain categories of industries, economic planning, reduced role of private\nsector, etc. The Government adopted several control measures on the functioning of private\nsector enterprises. All these efforts resulted a mixed response. There was growth in net\nnational product, per capita income and development of capital goods sector and\ninfrastructure. But rate of industrial growth was slow, inflation increased and government\nfaced a serious foreign exchange crisis during eighties. As a result, the government of India\nintroduced a radical change in economic policies in 1991. This policy abolished industrial\nlicensing in most of the cases, allowed private participation in most industries, disinvestment\nwas carried out in many public sector industrial enterprises and opened up the economy\nconsiderably. Foreign Investment Promotion Board was set up to channelise foreign capital\ninvestment in India. Let us discuss the developments under three heads, viz., (a) Liberalisation,\n(b) Privatisation, and (c) Globalisation.\n(A) LIBERALISATION\nLiberalisation refers to the process of eliminating unnecessary controls and restrictions on the\nsmooth functioning of business enterprises. It includes:\n abolishing industrial licensing requirement in most of the industries;\n freedom in deciding the scale of business activities;. (iii) freedom in fixing prices of goods and services;\n(iv)\nsimplifying the procedure for imports and exports;\n(v) reduction in tax rates; and\n(vi) simplified policies to attract foreign capital and technology to India.\nThrough this liberalisation process, Indian Economy has opened up and started\ninteracting with the world in a big way. This has resulted in easy entry of foreign\nbusiness organisations in India. This has further resulted in stiff competition and\nefficiency. Ultimately, liberalisation has helped us in achieving a high growth rate,\neasy availability of goods at competitive rates, a healthy and flourishing stock market, high foreign exchange reserve, low inflation rate, strong rupee,\ngood industrial relations, etc.\n(b) PRIVATISATION\nPrivatisation refers to reducing the role of public sector by involving the\nprivate sectors in most activities. Due to the policy reforms announced in\n1991, the expansion of public sector has literally come to a halt and the\nprivate sector registered fast growth in the post-liberalised period. The\nissues of privatisation include:\nreduction in the number of industries reserved for the public sector\nfrom 17 to 8 (reduced further to 3 later on) and the introduction of\nselective competition in the reserved area; (i) disinvestment of shares of selected public sector industrial\nenterprises in order to raise resources and to encourage wider\nparticipation of general public and workers in the ownership in\nbusiness;\n(ii) improvement in performance through an MOU system by which\nmanagements are to be granted greater autonomy but held accountable\nfor specified results.\nIn India, as a result of these steps, the post liberalisation phase has\nwitnessed a massive expansion of the private sector business in India. You\ncan have an idea of their expansion from the fact that the total capital\nemployed in top 500 private sector companies rose from Rs. 1,39,806\ncrores in 1992-93 to Rs. 2, 34, 751 crores in 1994-95 (an expansion of 68%\nin just two years).\n(c) GLOBALISATION\nGlobalisation means 'integrating' the economy of a country with the world\neconomy. This implies free flow of goods and services, capital, technology\nand labour across national boundaries. To achieve these objectives of\nglobalisation, the government has adopted various measures such as\nreduction in custom duties, removal of quantitative restrictions or quotas\non exports and imports, facilitating foreign investment and encouragement\nof foreign technology. These measures are expected to achieve a higher rate\nof growth, enlargement of employment potential, and reduction of regional\ndisparities  "
}