{
    "text": "Search... Home Subjects\nBoundless Management\nCommunication\nUnderstanding Communication\nDefining Communication\nCommunication is conveying messages by exchanging thoughts and information.\nLearning Objectives\nOutline the inherent dimensions and semiotic rules relevant to basic business communication\nKey Takeaways\nKey Points\nCommunication is conveying of messages by exchanging thoughts or information via speech, visuals, signals, writing, or behavior.\nBusiness communication is the transmission and exchange of information between people in an organization to facilitate business\nactivities.\nCommunication requires a sender, a message, a form and channel, and a recipient.\nCommunication can be described as information transmission governed by three levels of semiotic rules.\nKey Terms\ncommunication: The concept or state of information exchange.\nsemiotic: Of or relating to semantics (words).\nCommunication is the conveying of messages by exchanging thoughts or information via speech, visuals, signals, writing, or behavior.\nCommunication requires a sender, a message, and a recipient, although the receiver may not be present or aware of the sender's intent to\ncommunicate at the time of communication. Communication requires that the communicating parties share some area of commonality.\nThe communication process is complete once the receiver has understood the message of the sender.\nPerhaps the most time-honored form of communication is storytelling. People have told each other stories for ages to help make sense of\nthe world, anticipate the future, and certainly to entertain. The art of storytelling draws on your understanding of yourself, your message,\nand how you communicate it to an audience that is simultaneously communicating back to you. Your anticipation, reaction, and\nadaptation to the process determine how successfully you are able to communicate.\nCommunication involves actions that confer knowledge and experience, give advice and commands, and ask questions. These actions\nmay take many forms depending on the abilities and resources of the individual communicators. Together, content and form make\nmessages that are sent towards a destination. The destination can be oneself, another person, or another entity (such as a corporation or\ngroup of people).\nBusiness Communication Basics\nBusiness communication is the transmission and exchange of information between people in an organization to facilitate business\nactivities. Business communication encompasses marketing, brand management, customer relations, consumer behavior, advertising,\npublic relations, corporate communication, community engagement, reputation management, interpersonal communication, employee\nengagement, and event management. It is closely related to the fields of professional and technical communication.\nBusiness communication takes place within an organization and across organizational boundaries. Many organizations have a\ncommunications director who oversees internal communications and crafts messages sent to employees. It is vital that these internal\ncommunications are clear and managed in a timely way. Poorly crafted or managed communications could misdirect employee effort,\ncause confusion, and even foster distrust or hostility.\nDimensions of Communication\nCommunication has four primary components:\nMessage (the content being communicated)\nSource (who the message comes from)\nForm and channel (through which medium)\nDestination/receiver/target (to whom)\nWilbur Schram, an authority on mass communications, argued that it is important to examine both the desired and the unintentional\nimpact a message may have on its target.\nLevels of Semiotic Rules\nCommunication can be described as information transmission governed by three levels of semiotic rules for making meaning:\nSyntactic (formal properties of signs and symbols such as letters or numbers)\nPragmatic (concerned with the relations between signs/expressions and their users)\nSemantic (relationships between signs and symbols and what their meaning)\nCommunication is social interaction that requires at least two people who share a common set of signs and semiotic rules. Note that this\ndoes not apply to intrapersonal communication such as diaries or self-talk that occurs without interactions with others.\nPeople communicating: Business communication\ntakes place in marketing, brand management,\ncustomer relations, consumer behavior, advertising,\nand public relations.\nExample\nPerhaps the most time-honored form of communication is storytelling. People have told each other stories for ages to help make sense of\nthe world, anticipate the future, and certainly to entertain. The art of storytelling draws on your understanding of yourself, your message,\nand how you communicate it to an audience that is simultaneously communicating back to you. Your anticipation, reaction, and\nadaptation to the process determine how successfully you are able to communicate.\nThe Nature of Effective Communication\nEffective communication avoids distorting messages during the communication processes.\nLearning Objectives\nDefine effective communication in the context of organizational challenges and barriers\nKey Takeaways\nKey Points\nEffective communication generates, maintains, and increases a desired effect.\nBarriers to effective communication distort, obscure, or misrepresent the message and fail to achieve the desired effect.\nBarriers to effective communication can be physical, system or process related, attitudinal, and caused by ambiguity.\nKey Terms\neffective: Having the power to produce a required effect or effects.\nBarriers: A structure that bars passage; an obstacle or impediment; a boundary or limit.\nEffective communication takes place when information is shared accurately between two or more people or groups of people and\nprovokes the desired response. Effective communication should generate and maintain the desired effect, and offer the potential to\nincrease the effect of the message. The goal of communication is usually to generate action, inform, create understanding, or\ncommunicate a certain idea or point of view.\nCommunication: Carefully considering word choice, mode of\nmessage, and the intended audience can eliminate many barriers\nto communication.\nBarriers to Effective Communication\nBarriers to effective communication distort, obscure, or misrepresent the message and and fail to achieve the desired effect. Barriers to\nsuccessful communication include message overload (when a person receives too many messages at the same time) and message\ncomplexity. Another barrier is \"knowledge-appropriate\" communication–using ambiguous legal words or medical jargon with another\nperson who doesn't understand them. Effective communication only happens when the words and symbols used create a common level\nof understanding for both parties.\nOther common barriers to effective communication include the following:\nPhysical barriers like distance, inferior technology, or staff shortages that reduce information processing capacity.\nSystem design faults like ambiguous definition of roles that can lead to confusion about message targets; lack of oral and written\ncommunication skills; and poor information technology infrastructure, including networks and applications.\nAttitudinal barriers presented by individuals. One person may want information compressed to bullet points, another may demand\ngranular detail. Personality conflicts can lead people to delay or refuse to communicate, and dissatisfaction with the style of a message\ncan result in its being ignored or misinterpreted.\nAmbiguous words/phrases that sound the same but have different meanings. Here the communicator must ensure that the receiver\nreceives the intended meaning through careful word choice that avoids the possibility of multiple interpretations.\nIndividual linguistic ability is important to consider: will intended targets understand industry-specific jargon, complex words, or\ncolloquialisms? Using words that recipients can't understand is inappropriate and counter-productive, resulting in confusion and\nalienation.\nPhysiological barriers like ill health, poor eyesight, or hearing difficulties. Even a common cold can impact someone's ability to compose\nor understand a message.\nThe format and delivery of information is important. Communications have to take the potential barriers of an audience into account and\ntailor the message to reach them.\nThe Nature of Efficient Communication\nEfficient communication achieves its desired effect with the least amount of effort and resources.\nLearning Objectives\nAnalyze the key considerations one should keep in mind in the business world to optimize their communicative capacity\nKey Takeaways\nKey Points\nA clear communication strategy and process can make developing and transmitting messages more efficient.\nThere are two approaches to structuring an argument: direct and indirect.\nVisual elements like pictures, charts, and tables can help recipients more easily understand the main ideas being communicated.\nKey Terms\njargon: A technical terminology unique to a particular subject.\nindirect: Roundabout; deceiving; setting a trap; confusing.\ndirect: Straight, constant, without interruption.\nEfficient communication conveys a message and achieves a desired effect using the least possible effort and resources. A key element of\neffective communication is having a clear process for developing and disseminating information. To create effective oral and written\ncommunication one should consider the audience, the format and content, and the channel or mode of transmission. A communication\nstrategy speaks to each of these elements and guides how messages and information are developed and shared.\nClocks: A good communicator does not waste time.\nCommunication Strategy\nGood communicators begin by analyzing a given situation to develop a strategy for delivering their message. They consider the target\naudience and its level of knowledge and awareness. Does the audience have the background information it needs to understand the\nmessage? Which delivery mode is best suited to their understanding (i.e., a visual presentation or a written report)? These are all\nimportant points to consider when crafting a communication strategy.\nNext they consider the purpose of their communication. Are they supposed to inform, persuade, or ask the audience to do something?\nThe purpose informs choices of style and tone such as whether or not to use technical language or industry jargon. An authoritative tone\ndenotes credibility and is more persuasive than tentative language.\nThere are two approaches to structuring a message: direct and indirect. Direct arguments are easier to follow because they present a main\npoint and then offer supporting evidence. Indirect arguments provide the evidence first and then the main point. Both approaches\nsummarize key points and use headers or other types of formatting to make it easier to understand the communication's purpose and\ncontent.\nVisual aids complement strategy and structure in oral or witten communications. Visual aids can clarify difficult points, draw attention to\nimportant ideas, and help the audience absorb information faster and more fully. Visual elements like pictures, charts, and tables can\nmake communication more efficient.\nThe Nature of Persuasive Communications\nPersuasion presents arguments that move, motivate, or change an audience.\nLearning Objectives\nAssess the value and appropriate uses of persuasive communication tactics in an organizational framework\nKey Takeaways\nKey Points\nPersuasion attempts to influence people's beliefs, attitudes, intentions, motivations, or behaviors in relation to an event, idea, object, or\nother person(s).\nPersuasive communication achieves five things: stimulation, convincing, call to action, increasing consideration, and tolerance for\nalternative perspectives.\nDifferent types of calls to action are adoption, discontinuance, deterrence, and continuance.\nKey Terms\nmotivation: Willingness to perform an action, especially a behavior; an incentive or reason for doing something.\nPersuasion attempts to influence people's beliefs, attitudes, intentions, motivations, or behaviors in relation to an event, idea, object, or\nother person(s). Persuasion is achieved through written or spoken communication that conveys information, thoughts, emotions, logic,\nand arguments. Effective business communication often involves persuasion. Salespeople, lawyers, and politicians make their living\nattempting to persuade others, and persuasion is an important part of the work of managers and leaders as well.\nPersuasive communication achieves five things:\nStimulation\nConvincing\nCall to action\nIncrease consideration\nTolerance of alternate perspectives\nStimulation\nPersuasive communication reinforces, intensifies, and prioritizes existing beliefs. The purpose may be to spur action, build group cohesion,\nor develop commitment to a shared set of goals. This approach may begin by acknowledging areas of common ground and then\nintroducing new information that helps the audience value this commonality even more.\nConvincing\nSometimes a message is meant to convince an audience of the rightness of a certain choice or course of action. This often involves\ngetting people to change their minds. The use of evidence and logical reasoning are effective techniques for accomplishing this type of\npersuasion.\nCall to Action\nPersuasive argument is often a call to action. This type of speech is not purely about stimulating interest to reinforce and accentuate\nbeliefs, or convincing an audience of a viewpoint. Its intention is to get people to do something (often to change their behavior). Calls to\naction are commonly part of implementing decisions.\nCall to action: A call to action\noffers its audience a clear choice\nfor their response.\nThere are several types of calls to action: adoption, discontinuance, deterrence, and continuance. Adoption means the speaker wants to\npersuade the audience to accept a new way of thinking or adopt a new idea that influences their behavior. Discontinuance is the opposite:\nit involves the speaker persuading audience members to stop doing something (like quit smoking). Deterrence is a call to action that\nfocuses on persuading the audience not to start something if they haven't already started. Continuance means the speaker wants to\npersuade the audience to continue doing what they have been doing, such as reelect a candidate, keep buying a product, or stay in\nschool to get an education.\nIncrease Consideration\nPersuasive communicators also work to increase audience awareness and willingness to consider their position. Effective persuasion\nrequires a target that is open to persuasion, and often this depends on how a message is framed and delivered. For example, an audience\nthat is unmoved by appeals to emotion may be more willing to listen to rational arguments and facts.\nTolerance for Alternative Perspectives\nThe final key to creating a persuasive argument is helping the audience develop a tolerance for alternative perspectives. Perhaps the\naudience is interested in purchasing a certain type of car; as the lead salesperson on that model, the speaker has to listen and perform\ninformal audience analysis to learn that horsepower and speed are important values to this customer.\nTypes of Communication: Verbal, Written, and Nonverbal\nThere are three main vehicles for communication: verbal, written, and non-verbal.\nLearning Objectives\nRecognize the main ways in which individuals communicate and the pros, cons, and methods associated with each\nKey Takeaways\nKey Points\nTypes of communication include verbal, written, and nonverbal.\nVerbal communication provides immediate feedback and so it is best for conveying emotions and maintaining interpersonal relationships;\nit can involve storytelling and crucial conversations.\nWritten communication requires appropriate use of grammar, word choice, structure, and punctuation to be effective.\nNon-verbal communication is the process of sending and receiving wordless (mostly visual) cues.\nKey Terms\nnonverbal: A form other than written or spoken words, like gestures, facial expressions, or body language.\nThe most common vehicles for communication are oral, non-verbal, written, and electronic.\nOral communication describes the verbal exchange of information, emotions, thoughts, and perceptions. It includes speeches,\npresentations, conversations, and discussions. Body language and tone of voice play a significant role in how oral communication is\nperceived. Since oral communication almost always involves the simultaneous transmission and receipt of a message, feedback from the\naudience is immediate.\nOral communication: Oral communication allows\nimmediate feedback.\nWritten communication includes e-mail, memos, and reports. There is usually a gap of time and space between creation/transmission of a\nwritten message and its receipt. Written communication can include non-verbal elements like handwriting style, spatial arrangement of\nwords, or the format and physical layout of a page that can effect how it is understood. However, the absence of aural cues such as tone\nof voice make careful word choice, grammar, structure, and punctuation essential for effective written communication.\nElectronic communication uses a variety of digital technologies to carry messages between senders and recipients. Both oral and written\ncommunication can be conveyed electronically. For example, telephone and web conferencing are two modes of oral communication,\nwhile e-mail and text messaging are examples of written communication.\nNon-Verbal Communication\nSocial psychologist Michael Argyle said that while spoken language is normally used to communicate information about external events\nthat impact the speakers, non-verbal codes establish and maintain interpersonal relationships. Argyle concluded there are five primary\nfunctions of non-verbal bodily behavior in human communication:\nExpress emotions\nExpress interpersonal attitudes\nWork with speech to manage the cues of interaction between speakers and listeners\nPresent one's personality\nConduct rituals (greetings)\nHumans communicate interpersonal closeness through series of non-verbal actions known as immediacy behaviors. Examples of\nimmediacy behaviors are smiling, touching, open body positions, and eye contact. Cultures that display these immediacy behaviors are\nconsidered high-contact cultures.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}