{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nManaging Change for Organizations\nManagers as Leaders of Change\nLeaders are in the unique role of not only designing change initiatives but also enacting and communicating them.\nLearning Objectives\nReview the strategies leaders must use to lead change effectively\nKey Takeaways\nKey Points\nManaging change requires more than simple planning; the significant human element of change resistance needs to be addressed to\nensure success.\nLeaders must define change strategy and communicate it effectively to shareholders, empower and support employees, and mitigate\nresistance to the change initiative.\nConner identifies six distinct leadership styles related to change: anti-change, rational, panacea, bolt-on, integrated, and continuous. Each\nleadership style represents a unique set of perceptions, attitudes, and behaviors regarding how organizational disruption should be\naddressed.\nConner also posited that the six leadership styles are related to two different types of organizational change: first-order change and\nsecond-order change. Different leadership styles are more effective in different situations.\nKey Terms\nattribute: A characteristic or quality of a thing.\nleading: To conduct or direct with authority.\nManaging change requires strong leadership and an understanding of how organizational change occurs. Leaders are in the unique role\nof not only designing change initiatives but enacting and communicating them to subordinates. Managing change requires more than\nsimple planning: the significant human element of change resistance needs to be addressed to ensure success.\nLeadership Strategies for Change\nSuccessful change management is more likely if leaders:\nCreate a definable strategy - Define measurable stakeholder aims, create a business case for their achievement (and keep it continuously\nupdated), monitor assumptions, risks, dependencies, costs, return on investment, and cultural issues affecting the progress of the\nassociated work.\nCommunicate effectively - Explain to stakeholders why the change is being undertaken, what the benefits of successful implementation\nwill be, and what how the change is being rolled out.\nEmpower employees - Devise an effective education, training, or skills upgrading scheme for the organization.\nCounter resistance - Identify employee issues and align them to the overall strategic direction of the organization. Adapt the change\ninitiative when necessary to mitigate discontentment.\nSupport employees - Provide personal counseling (if required) to alleviate any change-related fears.\nTrack progress - Monitor the implementation and fine-tuning as required.\nThese six components of change are the responsibility of management to create and implement.\nThe reengineering process: Change\nmanagement is often termed a \"re-\nengineering process.\" This flowchart shows\nthe reciprocal relationships involved in each\nstep: the mission defines and is accomplished\nvia work processes, which execute and are\nguided by decisions, which consider and are\nsupported by information, which employs and\nare processed via technology.\nSix Leadership Styles for Change\nConner (1998) identified six distinct leadership styles related to change: anti-change, rational, panacea, bolt-on, integrated, and\ncontinuous. Each leadership style \"represents a unique set of perceptions, attitudes, and behaviors regarding how organizational\ndisruption should be addressed.\" Stopper (1999) characterizes each of Conner's leadership styles in this way:\nThe anti-change leader - A leader embracing this style seeks to avoid change as much as possible. The message is, \"Stay the course. Keep\nadjustments small. No need to change in any major way.\"\nThe rational leader - This leader focuses on how to constrain and control change with logical planning and clearly defined steps.\nThe panacea leader - The panacea leader believes that the way to respond to pressure for change is to communicate and motivate. These\nleaders understand the resilience to change they are likely to encounter as well as the inevitability of change as organizations evolve. They\ntend to focus on fostering enthusiasm for change.\nThe bolt-on leader - This leader strives to regain control of a changing situation by attaching (bolting on) change management\ntechniques to ad-hoc projects that are created in response to pressure for change. This manager is more concerned about helping others\nchange than creating a strategy for the actual change itself.\nThe integrated leader - The integrated leader searches for ways to use the structure and discipline of what Harding and Rouse (2007)\ncalled \"human due diligence\" (the leadership practice of understanding the culture of an organization and the roles, capabilities, and\nattitudes of its people) as individual change projects are created and implemented. The concept is simply to combine, or integrate, human\nand cultural concerns with the strategy itself.\nThe continuous leader - The continuous leader works to create an agile and quick-responding organization that can quickly anticipate\nthreats and seize opportunities as change initiatives are designed and implemented. Continuous leaders believe that to disruption is\ncontinuous, and adaptability a necessary organizational competency.\nConner says that these six leadership styles are related to two different types of organizational change: first-order change and second-\norder change. First-order change is incremental, piecemeal change. According to Conner, second-order change is \"nonlinear in nature\nand reflects movement that is fundamentally different from anything seen before within the existing framework.\"\nConner identifies the first four leadership styles as appropriate for managing first-order change. When an organization is engaging in\ndiscontinuous, transformational change, however, integrated and continuous leadership styles are more appropriate.\nTypes of Organizational Change\nThere are three main categories of change: business process re-engineering, technological change, and incremental change.\nLearning Objectives\nDifferentiate between business process re-engineering, technological change, and incremental change as the three main categories of\norganizational development\nKey Takeaways\nKey Points\nBusiness process re-engineering focuses on the analysis and design of workflows and processes within an organization.\nTechnological change refers to the process of invention, innovation, and diffusion of technology or processes.\nIncremental change means introducing many small, gradual changes to a project instead of a few large, rapid changes.\nKey Terms\nincremental: Occurring over a series of gradual increments, or small steps.\ndevise: To use one's intellect to plan or design something.\nincremental model: A method of product development where the model is designed, implemented, and tested incrementally (a little\nmore is added each time) until the product is finished.\nChange management is an approach to shifting or transitioning individuals, teams, and organizations from their current state to a desired\nfuture state. It is an organizational process aimed at helping stakeholders accept and embrace change in their business environment. In\nsome project management contexts, change management refers to a project management process wherein changes to a project are\nformally introduced and approved.\nKotter defines change management as the utilization of basic structures and tools to control any organizational change effort. Change\nmanagement's goal is to maximize organizational benefit, minimize impacts on workers, and avoid distractions. There are different types\nof change an can organization face.\nBusiness Process Re-Engineering\nBusiness process re-engineering (BPR) is a business management strategy first pioneered in the early 1990s that focuses on the analysis\nand design of workflows and processes within an organization. BPR aims to help organizations fundamentally rethink how they do their\nwork in order to dramatically improve customer service, cut operational costs, and become world-class competitors. In the mid-1990s, as\nmany as 60% of the Fortune 500 companies claimed to have either initiated re-engineering efforts or begun planning for it.\nBPR helps companies radically restructure their organizations by focusing on their business processes from the ground up. A business\nprocess is a set of logically related tasks performed to achieve a defined business outcome. Re-engineering emphasizes a holistic focus on\nbusiness objectives and how processes relate to them, encouraging full-scale recreation of processes rather than iterative optimization of\nsub-processes.\nBusiness process re-engineering is also known as business process redesign, business transformation, and business process change\nmanagement.\nIncremental Change\nIncremental change is a method of introducing many small, gradual (and often unplanned) changes to a project instead of a few large,\nrapid (and extensively planned) changes. Wikipedia illustrates the concept by building an encyclopedia bit by bit. Another good example\nof incremental change is a manufacturing company making hundreds of small components that go into a larger product, like a car.\nImproving the manufacturing process of each of these integral components one at a time to cut costs and improve process efficiency\noverall is incremental change.\nTechnological Change\nTechnological change (TC) describes the overall process of invention, innovation, and diffusion of technology or processes. The term is\nsynonymous with technological development, technological achievement, and technological progress. In essence, TC is the invention of a\ntechnology (or a process), the continuous process of improving a technology (which often makes it cheaper), and its diffusion throughout\nindustry or society. In short, technological change is based on both better and more technology integrated into the framework of existing\noperational processes.\nInside and Outside Forces for Organizational Change\nInside forces include strategic and human resource changes, while outside forces include macroeconomic and technological change.\nLearning Objectives\nIdentify the internal and external pressures for change, which drive organizations to adapt and evolve\nKey Takeaways\nKey Points\nChange management is an approach to shifting individuals, teams, and organizations to a desired future state. Examples of organizational\nchange can include strategic, operational, and technological change that can come from inside or outside the organization.\nOutside forces for change include macroeconomics, technological evolution, globalization, new legislation, and competitive dynamics.\nInside forces for change include intrapreneurship, new management and restructuring.\nThe first step in effective change management is being prepared, in a timely and knowledgeable fashion, for internal and external\npotentialities that may force organizational adaptation.\nKey Terms\nmacroeconomic: Relating to the entire economy, including the growth rate, money and credit, exchange rates, the total amount of goods\nand services produced, etc.\nChange management is an approach to shifting or transitioning individuals, teams, and organizations from their existing state to a desired\nfuture state. Examples of organizational change can include strategic, operational, and technological changes coming from inside or\noutside the organization. Understanding key internal and external change catalysts is critical to successful change management for\norganizational leaders.\nOutside Forces\nWhile there are seemingly endless external considerations that can motivate an organization to change, a few common considerations\nshould be constantly monitored. These include economic factors, competitive dynamics, new technology, globalization, and legislative\nchanges:\nEconomics - The 2008 economic collapse is a strong example of why adaptability is important. As consumers tightened their belts,\norganizations had to either do the same and lower supply to match lowered demand, or come up with new goods to entice them.\nMigrating from one volume to another can financially challenging, and change strategies such as creating new affordable product lines or\nmore efficient operational paradigms are key to changing for success.\nCompetition - Changes in the competitive landscape, such as new incumbents, mergers and acquisitions, new product offerings, and\nbankruptcies, can substantially impact a company's strategy and operations. For example, if a competitor releases a new product that\nthreatens to steal market share, an organization must be ready to change and adapt to retain their customer base.\nTechnology - Technological changes are a constant threat, and embracing new technologies ahead of the competition requires\nadaptability. When media went digital, adaptable companies found ways to evolve their operations to stay competitive. Many companies\nthat could not evolve quickly failed.\nGlobalization - Capturing new global markets requires product, cultural, and communicative adaptability. Catering to new demographics\nand identifying opportunities and threats as they appear in the global market is integral to adapting for optimal value.\nLegislation - New laws and legislation can dramatically change operations. Companies in industries that impact the environment must\nconstantly strive to adapt to cleaner and more socially responsible operating methodologies. Failing to keep pace can result in substantial\nfines and financial detriments, not to mention negative branding.\nInside Forces\nThere are many inside forces to keep in mind as well, ranging from employee changes to cultural reform to operational\nchallenges.Understanding where this change is coming from is the first step to timely and appropriate change management.\nManagement Change - New CEOs or other executive players can significantly impact strategy and corporate culture. Understanding the\nrisks associated with hiring (or promoting for) new upper management is key to making a good decision on best fit.\nOrganizational Restructuring - Organizations may be required to significantly alter their existing structure to adapt to the development of\nnew strategic business units, new product lines, or global expansion. Changing structure means disrupting hierarchies and\ncommunications, which must then be reintegrated. Employees must be trained on the change and the implications it will have for their\neveryday operations.\nIntrapreneurship - New ideas come from inside the organization as well as outside the organization, and capitalizing on a great new idea\nwill likely require some internal reconsideration. Integrating a new idea may require reallocation of resources, new hires and talent\nmanagement, and new branding.\nCommon Targets of Organizational Change\nChange management can be implemented to change an organization's mission, strategy, structure, technology, or culture.\nLearning Objectives\nRecognize and discuss the various components of an organization which may undergo change through the evolution and adaptation of\norganizational strategy and/or objectives\nKey Takeaways\nKey Points\nOrganizational change management should begin with a systematic diagnosis of the current situation in order to determine the\norganization 's need for and ability to change.\nPrior to a cultural change initiative, a needs assessment should examine the current organizational culture and operations. The goal is a\ncareful and objective consideration of what is working and what is not.\nAreas of change include mission, strategy, operations, technology, culture, branding, employees, and work flows.\nChange management should also make use of performance metrics, such as financial results, operational efficiency, leadership\ncommitment, communication effectiveness, and the perceived need for change.\nKey Terms\nchange management: The controlled implementation of required changes to some system; includes version control and planned\nfallback.\norganization: A group of people or other legal entities with an explicit purpose and written rules.\nWhen an organization requires changes to address counterproductive aspects of organizational culture, the process can be daunting.\nCultural change is usually necessary to reduce employee turnover, influence employee behavior, make improvements to the company,\nrefocus the company objectives, rescale the organization, provide better customer service, or achieve specific company goals and results.\nCultural change can be impacted by a number of elements, including the external environment and industry competitors, changes in\nindustry standards, technology changes, the size and nature of the workforce, and the organization's history and management.\nAssessing Change Needs\nPrior to launching a cultural change initiative, a company should carry out a needs assessment to examine the existing organizational\nculture and operations. Careful and objective consideration of what is working and what is not, as well as what is parallel with the broader\norganizational objectives and what is not, are critical to success here.\nAreas that need to change can be identified through interviews, focus groups, observation, and other methods of internal and external\nresearch. A company must clearly identify the existing culture and then design a change process to implement the desired culture.\nCommon Areas of Change\nCommon areas of organizational change include:\nMission\nStrategy\nOperational changes, including structure and hierarchies\nTechnology\nCulture\nEmployees and/or management\nWork flows (particularly relevant in manufacturing)\nBranding\nOrganizational change management should begin with a systematic diagnosis of the existing situation in order to determine the\norganization's need for and ability to change. The objectives, content, and process of change should be specified as part of the change\nmanagement plan.\nChange management processes can benefit from creative marketing to facilitate communication between change audiences and a deep\nsocial understanding of leadership styles and group dynamics. To track transformation projects, organizational change management\nshould align group expectations, communicate, integrate teams, and manage and train people. Change management should also make\nuse of performance metrics including financial results, operational efficiency, leadership commitment, communication effectiveness, and\nthe perceived need for change in order to design appropriate strategies that make the change in organizational culture as smooth and as\nefficient as possible.\nOrganizational Development\nOrganizational development is a deliberately planned effort to increase an organization's relevance and viability.\nLearning Objectives\nExplain the role of organizational development in leadership and organizational change\nKey Takeaways\nKey Points\nOrganizational development (OD) is an ongoing, systematic process of implementing effective organizational change.\nThe purpose of organizational development is to address the evolving needs of successful organizations.\nOrganizational development is often facilitated with the assistance of a \" catalyst \" or \"change agent\" such as an effective or influential\nleader.\nAn important role of a leader is to analyze and assess the effectiveness of this developmental process and motivate the organization to\nachieve developmental targets.\nKey Terms\nviability: The ability to live or to succeed.\ncatalyst: Someone or something that encourages progress or change.\nOrganization development (OD) is a deliberately planned effort to increase an organization's relevance and viability. Vasudevan has\nreferred to OD as a systemic learning and development strategy intended to change the basics of beliefs, attitudes, and relevance of an\norganization's values and structure. This process helps the organization to better absorb disruptive technologies, market opportunities,\nand ensuing challenges and chaos. Essentially, organizational development is the framework for a change process that is designed to\nproduce desirable and positive results for all stakeholders and the environment.\nThe Nature of Organizational Development\nOrganizational development is a lifelong, built-in mechanism to improve an organization internally. This is often done with the assistance\nof a \"change agent\" or \"catalyst\" who enables appropriate theories and techniques from applied behavioral sciences, anthropology,\nsociology, and phenomenology. The terms \"change agent\" and \"catalyst\" suggest a leader who is engaged in transformation leadership\nas opposed to management (management being a more incremental or efficiency-based change methodology).\nA manager providing advice to a team:\nOrganizational development is often facilitated with\nthe assistance of a \"catalyst\" or \"change agent\" such\nas an influential manager.\nAlthough behavioral science provided the basic foundation for the study and practice of OD, new and emerging fields of study have made\ntheir presence felt. Experts in systems thinking and organizational learning have also emerged as OD catalysts. These emergent\nperspectives view the organization as the holistic interplay of a number of systems, all of which impact the processes and outputs of the\nentire organization.\nApplications of Organizational Development\nThe purpose of OD is to address the evolving needs of successful organizations. It represents a concerted collaboration of internal and\nexternal experts in the field to discover the processes an organization can use to become more effective.\nOrganizational development aims to improve an organization's capacity to handle its internal and external functioning and relationships.\nThis includes improving interpersonal and group processes; communication; the organization's ability to cope with problems; decision-\nmaking processes; leadership styles; conflict and trust; and cooperation among organizational members.\nWeisbord\nWeisbord presents a six-box model for understanding—and thereby changing and improving—an organization:\nPurposes: Are employees clear about the organization's mission, purpose, and goals? Do they support the organization's purpose?\nStructure: How is the organization's work divided? Is there an adequate fit between the purpose and the internal structure?\nRelationships: What are the relationships between individuals, units, or departments that perform different tasks? What are the\nrelationships between the people and the requirements of their jobs?\nRewards: For what actions does the organization formally reward or punish its members?\nLeadership: Does leadership watch for \"blips\" among the other areas and maintain balance among them?\nHelpful mechanisms: Do planning, control, budgeting, and other information systems help organization members accomplish their goal?\nLewin\nLewin's description of the process of change involves three steps:\nUnfreezing: Faced with a dilemma or issue, the individual or group becomes aware of a need to change.\nChanging: The situation is diagnosed and new models of behavior are explored and tested.\nRefreezing: Application of new behavior is evaluated, and if it proves to be reinforcing, the behavior is adopted.\nEffectiveness of Organizational Development\nThe efficacy of organizational development is predicated on the adaptability of the organization and the overall successful integration of\nnew ideas and strategies within an existing framework. Resistance to change is a fundamental organizational problem as all organizations\nhave a degree of general inertia. This is further complicated by the difficulty in quantitatively measuring changes in areas that are\ngenerally intangible (i.e., culture).\nTo remedy this, organizations pursuing OD must set clear and measurable objectives prior to committing to a change initiative. An\nimportant role of the leader is to analyze and assess the effectiveness of this developmental process and motivate the organization to\nachieve developmental targets.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}