{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nRational and Nonrational Decision Making\nRational Decision Making\nRational decision making is a multi-step process, from problem identification through solution, for making logically sound decisions.\nLearning Objectives\nExplain the characteristics of the rational decision-making process\nKey Takeaways\nKey Points\nRational decision making favors objective data and a formal process of analysis over subjectivity and intuition.\nThe model of rational decision making assumes that the decision maker has full or perfect information about alternatives; it also assumes\nthey have the time, cognitive ability, and resources to evaluate each choice against the others.\nThis model assumes that people will make choices that will maximize benefits for themselves and minimize any cost.\nKey Terms\nRational decision making: A logical, multi-step model for choosing between alternatives that follows an orderly path from problem\nidentification through solution.\nperfect information: A situation in which all data that is relevant to a particular decision is known and available to the decision maker.\nThe Process of Rational Decision Making\nRational decision making is a multi-step process for making choices between alternatives. The process of rational decision making favors\nlogic, objectivity, and analysis over subjectivity and insight. The word \"rational\" in this context does not mean sane or clear-headed as it\ndoes in the colloquial sense.\nThe approach follows a sequential and formal path of activities. This path includes:\nFormulating a goal(s)\nIdentifying the criteria for making the decision\nIdentifying alternatives\nPerforming analysis\nMaking a final decision.\nRational-decision-making model: This flowchart illustrates the process of\nrational decision making.\nAssumptions of the Rational Decision-Making Model\nThe rational model of decision making assumes that people will make choices that maximize benefits and minimize any costs. The idea of\nrational choice is easy to see in economic theory. For example, most people want to get the most useful products at the lowest price;\nbecause of this, they will judge the benefits of a certain object (for example, how useful is it or how attractive is it) compared to those of\nsimilar objects. They will then compare prices (or costs). In general, people will choose the object that provides the greatest reward at the\nlowest cost.\nThe rational model also assumes:\nAn individual has full and perfect information on which to base a choice.\nMeasurable criteria exist for which data can be collected and analyzed.\nAn individual has the cognitive ability, time, and resources to evaluate each alternative against the others.\nThe rational-decision-making model does not consider factors that cannot be quantified, such as ethical concerns or the value of altruism.\nIt leaves out consideration of personal feelings, loyalties, or sense of obligation. Its objectivity creates a bias toward the preference for\nfacts, data and analysis over intuition or desires.\nProblems with the Rational Decision-Making Model\nCritics of the rational model argue that it makes unrealistic assumptions in order to simplify possible choices and predictions.\nLearning Objectives\nSummarize the inherent flaws and arguments against the rational model of decision-making within a business context\nKey Takeaways\nKey Points\nCritics of the rational decision -making model say that the model makes unrealistic assumptions, particularly about the amount of\ninformation available and an individual's ability to processes this information when making decisions.\nBounded rationality is the idea that an individual's ability to act rationally is constrained by the information they have, the cognitive\nlimitations of their minds, and the finite amount of time and resources they have to make a decision.\nBecause decision-makers lack the ability and resources to arrive at optimal solutions, they often seek a satisfactory solution rather than\nthe optimal one.\nKey Terms\nRational choice theory: A framework for understanding and often formally modeling social and economic behavior.\nbounded rationality: The idea that decision-making is limited by the information available, the decision-maker's cognitive limitations,\nand the finite amount of time available to make a decision.\nsatisficer: One who seeks a satisfactory solution rather than an optimal one.\nCritiques of the Rational Model\nCritics of rational choice theory —or the rational model of decision-making—claim that this model makes unrealistic and over-simplified\nassumptions. Their objections to the rational model include:\nPeople rarely have full (or perfect) information. For example, the information might not be available, the person might not be able to\naccess it, or it might take too much time or too many resources to acquire. More complex models rely on probability in order to describe\noutcomes rather than the assumption that a person will always know all outcomes.\nIndividual rationality is limited by their ability to conduct analysis and think through competing alternatives. The more complex a decision,\nthe greater the limits are to making completely rational choices.\nRather than always seeking to optimize benefits while minimizing costs, people are often willing to choose an acceptable option rather\nthan the optimal one. This is especially true when it is difficult to precisely measure and assess factors among the selection criteria.\nAlternative Theories of Decision-Making\nProspect Theory\nAlternative theories of how people make decisions include Amos Tversky's and Daniel Kahneman's prospect theory. Prospect theory\nreflects the empirical finding that, contrary to rational choice theory, people fear losses more than they value gains, so they weigh the\nprobabilities of negative outcomes more heavily than their actual potential cost. For instance, Tversky's and Kahneman's studies suggest\nthat people would rather accept a deal that offers a 50% probability of gaining $2 over one that has a 50% probability of losing $1.\nBounded Rationality\nOther researchers in the field of behavioral economics have also tried to explain why human behavior often goes against pure economic\nrationality. The theory of bounded rationality holds that an individual's rationality is limited by the information they have, the cognitive\nlimitations of their minds, and the finite amount of time they have to make a decision. This theory was proposed by Herbert A. Simon as a\nmore holistic way of understanding decision-making. Bounded rationality shares the view that decision-making is a fully rational process;\nhowever, it adds the condition that people act on the basis of limited information. Because decision-makers lack the ability and resources\nto arrive at the optimal solution, they instead apply their rationality to a set of choices that have already been narrowed down by the\nabsence of complete information and resources.\nNon-Rational Decision Making\nPeople frequently employ alternative, non-rational techniques in their decision making processes.\nLearning Objectives\nExamine alternative perspectives on decision making, such as that of Herbert Simon and Gerd Gigerenzer, which outline non-rational\ndecision-making factors\nKey Takeaways\nKey Points\nThe rationality of individuals is limited by the information they have, the cognitive limitations of their minds, and the finite amount of time\nthey have to make a decision.\nSimon defined two cognitive styles: maximizers and satisficers. Maximizers try to make an optimal decision, whereas satisficers simply try\nto find a solution that is \"good enough\" for the situation.\nSome research has shown that simple heuristics frequently lead to better decisions than the theoretically optimal procedure.\nEmotion appears to aid the decision-making process; decisions often occur in the face of uncertainty about whether one's choices will\nlead to benefit or harm.\nRobust Decision Making (RDM) is a particular set of methods and tools that is designed to support decision making under conditions of\nuncertainty.\nKey Terms\nrational: Logically sound; not contradictory or otherwise absurd.\nheuristic: An experience-based technique for problem solving, learning, and discovery; examples include using a rule of thumb, an\neducated guess, an intuitive judgment, or common sense.\ncognitive: The part of mental functions that deals with logic, as opposed to affective functions, which deal with emotion.\nThe rational model of decision making holds that people have complete information and can objectively evaluate alternatives to select\nthe optimal choice. The rationality of individuals is limited, however, by the information they have, the cognitive limitations of their minds,\nand the finite amount of time they have to make a decision. To account for these limitations, alternative models of decision making offer\ndifferent views of how people make choices.\nHerbert A. Simon\nAmerican psychology and economics researcher Herbert A. Simon defined two cognitive styles: maximizers and satisficers. Maximizers try\nto make an optimal decision, whereas satisficers simply try to find a solution that is \"good enough.\" Maximizers tend to take longer\nmaking decisions due to the need to maximize performance across all variables and make trade-offs carefully. They also tend to regret\ntheir decisions more often (perhaps because they are more able than satisficers to recognize when a decision has turned out to be sub-\noptimal). On the other hand, satisficers recognize that decision makers lack the ability and resources to arrive at an optimal solution. They\ninstead apply their rationality only after they greatly simplify the choices available. Thus, a satisficer seeks a satisfactory solution rather\nthan an optimal one.\nGerd Gigerenzer\nGerman psychologist Gerd Gigerenzer goes beyond Simon in dismissing the importance of optimization in decision making. He argues\nthat simple heuristics—experience-based techniques for problem-solving—can lead to better decision outcomes than more thorough,\ntheoretically optimal processes that consider vast amounts of information. Where an exhaustive search is impractical, heuristic methods\nare used to speed up the process of finding a satisfactory solution.\nThe Brain's Heuristics for\nEmotions: Emotions appear to\naid the decision-making\nprocess.\nThe Role of Emotion\nEmotion is a factor that is typically left out of the rational model; however, it has been shown to have an influential role in the decision-\nmaking process. Because decisions often involve uncertainty, individual tolerance for risk becomes a factor. Thus, fear of a negative\noutcome might prohibit a choice whose benefits far outweigh the chances of something going wrong.\nRobust Decision Making\nRobust decision making (RDM) is a particular set of methods and tools developed over the last decade—primarily by researchers\nassociated with the RAND Corporation—that is designed to support decision making and policy analysis under conditions of deep\nuncertainty. RDM focuses on helping decision makers identify and develop alternatives through an iterative process. This process takes\ninto account new information and considers multiple scenarios of how the future will evolve.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}