{
    "text": "Search... Home Subjects\nBoundless Management\nIntroduction to Management\nPrinciples of Management\nDefining Management\nManagement is the act of engaging with an organization's human talent and its resources to accomplish desired goals and objectives.\nLearning Objectives\nOutline the theoretical scope and basic function that represent managerial responsibilities within a company\nKey Takeaways\nKey Points\nManagement comprises planning, organizing, staffing, leading /directing, and controlling an organization (a group of one or more people\nor entities) or effort for the purpose of accomplishing a goal.\nIn for-profit work, the primary function of management is meeting the needs of various stakeholders of the organization, such as\ncustomers, debtors, and owners.\nIn the public sector of countries that are representative democracies, voters elect politicians to public office, who then hire managers and\nadministrators to oversee the everyday responsibilities that support those elected to office.\nSince an organization can be viewed as a type of system, managers provide the necessary human action, so the organizational system\nproduces planned outcomes or goals desired by the various stakeholders.\nKey Terms\nstakeholders: Persons or organizations with a legitimate interest in a given situation, action, or enterprise which are directly affected by\nthe organization's actions.\ntheoretical: Of or relating to the underlying principles or methods of a given technical skill, art, etc., as opposed to its practice.\nshareholder: Through owning stock, the real owner of a publicly traded business that is run by management.\nOverview\nManagement is the act of engaging with an organization's human talent and using the physical resources at a manager's disposal to\naccomplish desired goals and objectives efficiently and effectively. Management comprises planning, organizing, staffing, leading,\ndirecting, and controlling an organization (a group of one or more people or entities) or effort for the purpose of accomplishing a goal.\nOne of the most important duties for a manager is effectively using an organization's resources. This duty involves deploying and\nmanipulating human resources (or human capital), as well as efficiently allocating the organization's financial, technological, and natural\nresources.\nSince organizations can be viewed as systems, management can also be defined as human action, such as product design, that enables\nthe system to produce useful outcomes. This view suggests that we must manage ourselves as a prerequisite to attempting to manage\nothers.\nTheoretical Scope\nAt first, management may be considered as a type of function, one which measures financial metrics, adjusts strategic plans, and meets\norganizational goals. This applies even in situations where planning does not take place. From this perspective, Henri Fayol (1841–1925)\nconsiders management to consist of six functions: forecasting, planning, organizing, commanding, coordinating, and controlling. He was\none of the most influential contributors to modern concepts of management.\nIn another way of thinking, Mary Parker Follett (1868–1933) defined management as \"the art of getting things done through people.\" She\ndescribed management as philosophy. Some people, however, find this definition useful but far too narrow. The phrase \"management is\nwhat managers do\" occurs widely, suggesting the difficulty of defining management, the shifting nature of definitions, and the connection\nof managerial practices with the existence of a managerial cadre or class.\nAnother perspective regards management as equivalent to \"business administration\" and thus excludes management in places outside\ncommerce, for example in charities and in the public sector. More realistically, however, every organization must manage its work, people,\nprocesses, technology, etc. to maximize effectiveness and accomplish its goals.\nNature of Managerial Work\nIn the for-profit environment, management is tasked primarily with meeting the needs of a range of stakeholders. This typically involves\nmaking a profit (for the shareholders ), creating valued products at a reasonable cost (for customers), and providing rewarding\nemployment opportunities (for employees). Nonprofit management has the added importance of attracting and retaining donors.\nIn most models of management/governance, shareholders vote for the board of directors, and the board then hires senior management.\nSome organizations have experimented with other methods (such as employee-voting models) of selecting or reviewing managers, but\nthis occurs only very rarely. In the public sector of countries that are representative democracies, voters elect politicians to public office.\nSuch politicians hire managers and administrators.\nSeveral historical shifts in management have occurred throughout the ages. Towards the end of the 20th century, business management\ncame to consist of six separate branches, namely:\nHuman resource management\nOperations management or production management\nStrategic management\nMarketing management\nFinancial management\nInformation technology management (responsible for the management information systems)\nBasic Functions\nMary Parker Follett:\nMary Parker Follett\ndefined management\nas \"the art of getting\nthings done through\npeople.\"\nManagement operates through various functions, such as planning, organizing, staffing, leading/directing, controlling/monitoring, and\nmotivating.\nPlanning: Deciding what needs to happen in the future (today, next week, next month, next year, over the next five years, etc.) and\ngenerating plans for action.\nOrganizing: Implementing a pattern of relationships among workers and making optimum use of the resources required to enable the\nsuccessful carrying out of plans.\nStaffing: Job analysis, recruitment, and hiring of people with the necessary skills for appropriate jobs. Providing or facilitating ongoing\ntraining, if necessary, to keep skills current.\nLeading/directing: Determining what needs to be done in a situation and getting people to do it.\nControlling/monitoring: Checking current outcomes against forecast plans and making adjustments when necessary so that goals are\nachieved.\nMotivating: Motivation is a basic function of management because without motivation, employees may feel disconnected from their work\nand the organization, which can lead to ineffective performance. If managers do not motivate their employees, they may not feel their\nwork is contributing to the overall goals of the organization (which are usually set by top-level management).\nFulfilling the Organizing Function\nManagement organizes by creating patterns of relationships among workers, optimizing use of resources to accomplish business\nobjectives.\nLearning Objectives\nDefine the organizing function within a business framework, specifically the generation of structure and authority\nKey Takeaways\nKey Points\nThe organizing function typically follows the planning stage. Specific organizing duties involve the assignment of tasks, the grouping of\ntasks into departments, the assignment of authority, and the allocation of resources across the organization.\nAuthority is a manager's formal and legitimate right to make decisions, issue orders, and allocate resources to achieve organization's\nobjectives. Types of authority include line, functional, and staff.\nOrganizations will use different structural strategies, which significantly affects the chain of command and decision-making process within\nan organization. These structures include centralized, decentralized, tall, and flat.\nWhen approaching an organization within a company or institution, it is important to understand the implications of different structures\nas they pertain to the strategy and operations of the company.\nKey Terms\ncapital expenditure: Funds spent by a company to acquire or upgrade a long-term asset.\ncontroller: A person who audits and manages the financial affairs of a company or government; a comptroller.\ndelegation: The act of commiting a task to someone, especially a subordinate.\norganizing: To constitute in parts, each having a special function, act, office, or relation.\nManagement and Organization\nManagement operates through various functions, often classified as planning, organizing, staffing, leading/directing,\ncontrolling/monitoring, and motivating. The organizing function creates the pattern of relationships among workers and makes optimal\nuse of resources to enable the accomplishment of business plans and objectives.\nThe organizing function typically follows the planning stage. Specific organizing duties involve the assignment of tasks, the grouping of\ntasks into departments, and the assignment of authority and allocation of resources across the organization.\nThe management process: The management\nprocess involves tasks and goals of planning,\norganizing, directing, and controlling.\nStructure\nStructure is the framework in which the organization defines how tasks are divided, resources are deployed, and departments are\ncoordinated. It is a set of formal tasks assigned to individuals and departments. Formal reporting relationships include lines of authority,\ndecision responsibility, number of hierarchical levels, and span of managers' control. Structure is also the design of systems to ensure\neffective coordination of employees across departments.\nAuthority/Chain of Command\nAuthority is a manager's formal and legitimate right to make decisions, issue orders, and allocate resources to achieve desired outcomes\nfor an organization. Responsibility is an employee's duty to perform assigned tasks or activities. Accountability means that those with\nauthority and responsibility must report and justify task outcomes to those above them in the chain of command.\nThrough delegation, managers transfer authority and responsibility to their subordinates. Organizations today tend to encourage\ndelegation from the highest to lowest possible levels. Delegation can improve flexibility to meet customers' needs and to adapt to\ncompetitive environments. Managers may find delegation difficult, since control over the task assigned (and eventual outcome) is\nrelinquished.\nOne critical risk of command chains is micromanagement, where managers fail to delegate effectively and exercise excessive control over\ntheir subordinates' projects. Micromanagement reduces efficiency and limits autonomy, thus limiting the adaptability of a given\norganization. Effective chains of command must allow for flexibility and efficient delegation.\nTypes of Authority (and Responsibility)\nLine authority: Managers have the formal power to direct and control immediate subordinates executing specific tasks within a chain of\ncommand, usually within a specific department. The superior issues orders and is responsible for the result; the subordinate obeys and is\nresponsible only for executing the order according to instructions.\nFunctional authority: Managers have formal power over a specific subset of activities that include outside departments. For instance, a\nproduction manager may have the line authority to decide whether and when a new machine is needed, but a controller with functional\nauthority requires that a capital expenditure proposal be submitted first, showing that the investment in a new machine will yield a\nminimum return. The legal department may also have functional authority to interfere in any activity that could have legal consequences.\nFor example, a purchase contract for a new machine cannot be approved without a review of the machine's safety standards.\nStaff authority: Staff specialists manage operations in their areas of expertise. Staff authority is not real authority because a staff manager\ndoes not order or instruct but simply advises, recommends, and counsels in the staff specialists' area of expertise; the manager is\nresponsible only for the quality of the advice (in line with the respective professional standards, etc.). Staff authority represents a\ncommunication relationship with management. It has an influence that derives indirectly from line authority at a higher level.\nOrganizational Structure and Control/Decision-Making\nTall structure: A management structure characterized by an overall narrow span of management, a relatively large number of hierarchical\nlevels, tight control, and reduced communication overhead. Decision-making can be quite rapid, if it occurs from the top down.\nFlat structure: A management structure characterized by a wide span of control and relatively few hierarchical levels, loose control, and\nease of delegation. Decision-making is often slower, as it involves a high degree of integration across the company.\nCentralization: The location of decision making authority near top organizational levels. Similar to a tall structure, this expedites decision-\nmaking from the top down.\nDecentralization: The location of decision making authority is relatively evenly dispersed across the company. This works well when\ncreativity and independent operations create value for the organization.\nAs each structure will create a different organizational approach to operations, it is critical to consider how the selection of a structure will\naffect the business process. Enabling creativity and minimizing control often comes at the cost of speed and efficiency, and vice versa.\nFulfilling the Controlling Function\nManagement control can be defined as a systematic effort to compare performance to predetermined standards and address deficiencies.\nLearning Objectives\nOutline the characteristics and elements of the controlling function\nKey Takeaways\nKey Points\nControl is a continuous and forward-looking process designed to objectively benchmark operations with the projected plan or\nprojections.\nThe four basic elements in a control system are: the characteristic or condition to be controlled, the sensor, the comparator, and the\nactivator.\nControl is a continuous process.\nControl is a continuous and forward-looking process designed to benchmark operations with the projected plan or projections.\nKey Terms\nSystematic: Methodical, regular, and orderly.\ncontrol: Influence or authority over.\nhierarchy: An arrangement of items in which the items are represented as being \"above,\" \"below,\" or \"at the same level as\" one another.\nControl\nIn 1916, Henri Fayol formulated one of the first definitions of control as it pertains to management: \"Control consists of verifying whether\neverything occurs in conformity with the plan adopted, the instructions issued, and principles established. It's object is to point out\nweaknesses and errors in order to rectify [them] and prevent recurrence.\"\nManagement control can be defined as a systematic effort by business management to compare performance to predetermined\nstandards, plans, or objectives in order to determine whether performance is in line with these standards. It is also used to determine if\nany remedial action is required to ensure that human and other corporate resources are being used in the most effective and efficient way\npossible to achieve corporate objectives.\nControl can also be defined as \"that function of the system that adjusts operations as needed to achieve the plan, or to maintain\nvariations from system objectives within allowable limits.\" The control subsystem functions in close harmony with the operating system.\nThe degree to which they interact depends on the nature of the operating system and its objectives. Stability concerns a system's ability\nto maintain a pattern of output without wide fluctuations. Rapidity of response pertains to the speed with which a system can correct\nvariations and return to expected output.\nFrom these definitions, the close link between planning and controlling can be seen. Planning is a process by which an organization 's\nobjectives and the methods to achieve the objectives are established, and controlling is a process that measures and directs the actual\nperformance against the planned goals of the organization. Therefore, goals and objectives are often referred to as the siamese twins of\nmanagement: the managerial function of management and the correction of performance in order to ensure that enterprise objectives\nand the goals devised to attain them are being accomplished.\nCharacteristics of Control\nControl has several characteristics. It may be described as being:\nA continuous process.\nA management process.\nEmbedded in each level of organizational hierarchy.\nForward-looking.\nClosely linked with planning.\nA tool for achieving organizational activities.\nAn end process.\nThe Elements of Control\nThe four basic elements in a control system:\nThe characteristic or condition to be controlled - We select a specific characteristic because a correlation exists between it and how the\nsystem is performing. The characteristic may be the output of the system during any stage of processing or it may be a condition that is\nthe result of the system. For example, in an elementary school system, the hours a teacher works or the gain in knowledge demonstrated\nby the students on a national examination are examples of characteristics that may be selected for measurement, or control.\nThe sensor - This is the means for measuring the characteristic or condition. For example, in a home-heating system, this device would be\nthe thermostat; and in a quality -control system, this measurement might be performed by a visual inspection of the product.\nThe comparator - This determines the need for correction by comparing what is occurring with what has been planned. Some deviation\nfrom the plan is usual and expected, but when variations are beyond those considered acceptable, corrective action is required. It involves\na sort of preventative action to indicate that good control is being achieved.\nThe activator - This is the corrective action taken to return the system to expected output. The actual person, device, or method used to\ndirect corrective inputs into the operating system may take a variety of forms. It may be a hydraulic controller positioned by a solenoid or\nelectric motor in response to an electronic error signal, an employee directed to rework the parts that failed to pass quality inspection, or\na school principal who decides to buy additional books to provide for an increased number of students. As long as a plan is performed\nwithin allowable limits, corrective action is not necessary; however, this seldom occurs in practice.\nThese occur in the same sequence and maintain a consistent relationship to each other in every system.\nFulfilling the Leading Function\nManagers lead their organizations and can vary their style and approach to achieve the desired outcome.\nLearning Objectives\nIdentify the key characteristics and considerations of the leadership function within the organizational framework\nKey Takeaways\nKey Points\nLeaders who demonstrate persistence, tenacity, determination, and synergistic communication skills will bring out the same qualities in\ntheir groups.\nLeadership can be viewed as either individualistic or group-based and can be considered \"transactional\" (i.e. procedures, rewards, etc.) or\n\"transformational\" (i.e. charisma, creativity, etc. ).\nA leadership style is often determined by context, whereas the degree of control (autocratic or democratic) may alter based upon the\nsituation or process being managed.\nPositive reinforcement is an example of a leadership technique. This reinforcement occurs when a positive stimulus is presented in\nresponse to a behavior, increasing the likelihood of that behavior in the future.\nKey Terms\nlaissez-faire: In business, an environment in which an organization's employees are free from excessive oversight or management, with\nsufficient control only to ensure organizational goals are met.\nDefining Leadership\nOver the years the philosophical terms \" management \" and \"leadership\" have been used both as synonyms and with clearly differentiated\nmeanings. Debate is fairly common about whether the use of these terms should be restricted and generally reflects an awareness of the\ndistinction made by Burns (1978) between \"transactional\" leadership (characterized by emphasis on procedures, contingent reward,\nmanagement by exception) and \"transformational\" leadership (characterized by charisma, personal relationships, creativity). Management\nis often associated with the former and leadership with the latter.\nLeaders who demonstrate persistence, tenacity, determination, and synergistic communication skills will bring out the same qualities in\ntheir groups. Good leaders use their own inner mentors to energize their team and organizations and lead a team to achieve success.\nGroup Leadership\nIn contrast to individual leadership, some organizations have adopted group leadership. In this situation, more than one person provides\ndirection to the group as a whole. Some organizations have taken this approach in hopes of increasing creativity, reducing costs, or\ndownsizing. Others may see the traditional leadership of a boss as costing too much in team performance. In some situations, the team\nmembers best able to handle any given phase of the project become the temporary leaders. Additionally, staff experiences energy and\nsuccess when each team member has access to elevated levels of empowerment.\nLeadership Styles\nA leadership style is a leader's approach towards providing direction, implementing plans, and motivating people. It is the result of the\nphilosophy, personality, and experience of the leader. Rhetoric specialists have also developed models for understanding leadership\n(Robert Hariman, Political Style; Philippe-Joseph Salazar, L'Hyperpolitique. Technologies politiques De La Domination).\nEngaging Style of Leadership: Different styles of\nleadership can achieve the leading function.\nDifferent situations call for different leadership styles. In an emergency, when there is little time to reach an agreement and where a\ndesignated authority has significantly more experience or expertise than the rest of the team, an autocratic leadership style may be most\neffective. However, in a highly motivated and aligned team, with a homogeneous level of expertise, a more democratic or laissez-faire\nstyle may be more effective. The leadership style adopted should be the one that most effectively achieves the objectives of the group\nwhile balancing the interests of its individual members.\nPositive Reinforcement\nAnyone thinking about managing a team must consider positive reinforcement. B.F. Skinner, the father of behavior modification,\ndeveloped this concept. Positive reinforcement occurs when a positive stimulus is presented in response to a behavior, increasing the\nlikelihood of that behavior in the future.\nThe following is an example of how positive reinforcement can be used in a business setting. Assume praise is a positive reinforcement for\na particular employee. This employee does not show up to work on time every day. The manager of this employee decides to praise the\nemployee for showing up on time when the employee actually does so. As a result, the employee comes to work on time more often\nbecause the employee likes to be praised. In this example, praise (the stimulus) is a positive reinforcement for this employee because the\nemployee arrives at work on time (the behavior) more frequently after being praised for it.\nThe use of positive reinforcement is a successful and growing technique used by leaders to motivate and attain desired behaviors from\nsubordinates. Organizations, such as Frito-Lay, 3M, Goodrich, Michigan Bell, and Emery Air Freight, have all used reinforcement to\nincrease productivity. Empirical research covering the last 20 years suggests that reinforcement theory has a 17% increase in performance.\nAdditionally, many reinforcement techniques, such as the use of praise, are inexpensive and provide higher performance and employee\nsatisfaction for lower costs.\nFulfilling the Planning Function\nPlanning is the process of thinking about and organizing the activities required to achieve strategic objectives.\nLearning Objectives\nIllustrate the primary considerations and influencing factors for organizations when pursuing strategic planning\nKey Takeaways\nKey Points\nPlanning involves the maintenance and organizational approach of achieving strategic objectives.\nTo meet objectives, managers may develop plans such as a business plan or a marketing plan.\nStrategic planning is an organization 's process of defining its strategy or direction and making decisions about how to allocate its\nresources to pursue this strategy.\nWhen pursuing strategic planning, organizations should ask themselves what they do, for whom do they do it, and how they can excel (or\ndifferentiate from) competitors.\nThe execution of the planning function requires a comprehensive understanding (or generation of) a vision, mission, set of values, and\ngeneral strategy.\nKey Terms\nstrategy: A plan of action intended to accomplish a specific goal.\nallocating: The act of distributing a given set of resources according to a plan.\nforecasting: The act of estimating future outcomes.\nPlanning\nPlanning is the process of thinking about and organizing the activities required to achieve a desired goal. Planning involves the creation\nand maintenance of a given organizational operation. This thought process is essential to the refinement of objectives and their\nintegration with other plans. Planning combines forecasting of developments with preparing scenarios for how to react to those\ndevelopments. An important, albeit often ignored, aspect of planning is the relationship it holds with forecasting. Forecasting can be\ndescribed as predicting what the future will look like, whereas planning predicts what the future should look like.\nResearch planning: Planning involves the creation and\nmaintenance of a plan.\nPlanning is also a management process, concerned with defining goals for a company's future direction and determining the missions\nand resources to achieve those targets. To meet objectives, managers may develop plans, such as a business plan or a marketing plan. The\npurpose may be achievement of certain goals or targets. Planning revolves largely around identifying the resources available for a given\nproject and utilizing optimally to achieve best scenario outcomes.\nStrategic Planning\nStrategic planning is an organization's process of defining its strategy or direction and making decisions about allocating its resources to\npursue this strategy. To determine the direction of the organization, it is necessary to understand its current position and the possible\navenues through which it can pursue a particular course of action. Generally, strategic planning deals with at least one of three key\nquestions:\nWhat do we do?\nFor whom do we do it?\nHow do we excel?\nThe key components of strategic planning include an understanding of the firm's vision, mission, values, and strategies. (Often a \"vision\nstatement\" and a \" mission statement \" may encapsulate the vision and mission. )\nVision: This outlines what the organization wants to be or how it wants the world in which it operates to be (an \"idealized\" view of the\nworld). It is a long-term view and concentrates on the future. It can be emotive and is a source of inspiration. For example, a charity\nworking with the poor might have a vision statement that reads \"A World without Poverty.\"\nMission: It defines the fundamental purpose of an organization or an enterprise, succinctly describing why it exists and what it does to\nachieve its vision. For example, the charity above might have a mission statement as \"providing jobs for the homeless and unemployed.\"\nValues: These are beliefs that are shared among the stakeholders of an organization. Values drive an organization's culture and priorities\nand provide a framework in which decisions are made. For example, \"knowledge and skills are the keys to success,\" or \"give a man bread\nand feed him for a day, but teach him to farm and feed him for life.\" These example values place the priorities of self-sufficiency over\nshelter.\nStrategy: Strategy, narrowly defined, means \"the art of the general\"—a combination of the ends (goals) for which the firm is striving and\nthe means (policies) by which it is seeking to get there. A strategy is sometimes called a roadmap, which is the path chosen to move\ntowards the end vision. The most important part of implementing the strategy is ensuring the company is going in the right direction,\nwhich is towards the end vision.\nTools and Approaches\nThere are many approaches to strategic planning, but typically one of the following is used:\nSituation-Target-Proposal: Situation – Evaluate the current situation and how it came about. Target – Define goals and/or objectives\n(sometimes called ideal state). Path/Proposal – Map a possible route to the goals/objectives.\nDraw-See-Think-Plan: Draw – What is the ideal image or the desired end state? See – What is today's situation? What is the gap from\nideal and why? Think – What specific actions must be taken to close the gap between today's situation and the ideal state? Plan – What\nresources are required to execute the activities?\nAmong the most useful tools for strategic planning is a SWOT analysis (Strengths, Weaknesses, Opportunities, and Threats). The main\nobjective of this tool is to analyze internal strategic factors (strengths and weaknesses attributed to the organization) and external factors\nbeyond control of the organization (such as opportunities and threats).\nLicenses and Attributions\nNext\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}