{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nIndividual Perceptions and Behavior\nThe Perceptual Process\nPerception is the organization, identification, and interpretation of sensory information to represent and understand the environment.\nLearning Objectives\nOutline the internal and external factors that influence the perceptual selection process\nKey Takeaways\nKey Points\nThe perceptual process consists of six steps: the presence of objects, observation, selection, organization, interpretation, and response.\nPerceptual selection is driven by internal (personality, motivation ) and external (contrast, repetition) factors.\nPerceptual organization includes factors that influence how a person connects perceptions into wholes or patterns. These include\nproximity, similarity, and constancy, among others.\nKey Terms\nfactor: An integral part.\nPerception: That which is detected by the five senses; that which is detected within consciousness as a thought, intuition, or deduction.\nPerceptual Process\nThe perceptual process is the sequence of psychological steps that a person uses to organize and interpret information from the outside\nworld. The steps are:\nObjects are present in the world.\nA person observes.\nThe person uses perception to select objects.\nThe person organizes the perception of objects.\nThe person interprets the perceptions.\nThe person responds.\nThe selection, organization, and interpretation of perceptions can differ among different people. Therefore, when people react differently\nin a situation, part of their behavior can be explained by examining their perceptual process, and how their perceptions are leading to\ntheir responses.\nMultistability: The Necker cube and Rubin vase can be perceived in\nmore than one way. The vase can be seen as either a vase or two faces.\nPerceptual Selection\nPerceptual selection is driven by internal and external factors.\nInternal factors include:\nPersonality - Personality traits influence how a person selects perceptions. For instance, conscientious people tend to select details and\nexternal stimuli to a greater degree.\nMotivation - People will select perceptions according to what they need in the moment. They will favor selections that they think will help\nthem with their current needs, and be more likely to ignore what is irrelevant to their needs.\nExperience - The patterns of occurrences or associations one has learned in the past affect current perceptions. The person will select\nperceptions in a way that fits with what they found in the past.\nExternal factors include:\nSize - A larger size makes it more likely an object will be selected.\nIntensity - Greater intensity, in brightness, for example, also increases perceptual selection.\nContrast - When a perception stands clearly out against a background, there is a greater likelihood of selection.\nMotion - A moving perception is more likely to be selected.\nRepetition - Repetition increases perceptual selection.\nNovelty and familiarity - Both of these increase selection. When a perception is new, it stands out in a person's experience. When it is\nfamiliar, it is likely to be selected because of this familiarity.\nPerceptual Organization\nAfter certain perceptions are selected, they can be organized differently. The following factors are those that determine perceptual\norganization:\nFigure-ground - Once perceived, objects stand out against their background. This can mean, for instance, that perceptions of something\nas new can stand out against the background of everything of the same type that is old.\nPerceptual grouping - Grouping is when perceptions are brought together into a pattern.\nClosure - This is the tendency to try to create wholes out of perceived parts. Sometimes this can result in error, though, when the\nperceiver fills in unperceived information to complete the whole.\nProximity - Perceptions that are physically close to each other are easier to organize into a pattern or whole.\nSimilarity - Similarity between perceptions promotes a tendency to group them together.\nPerceptual Constancy - This means that if an object is perceived always to be or act a certain way, the person will tend to infer that it\nactually is always that way.\nPerceptual Context - People will tend to organize perceptions in relation to other pertinent perceptions, and create a context out of those\nconnections.\nEach of these factors influence how the person perceives their environment, so responses to their environment can be understood by\ntaking the perceptual process into account.\nCognitive Biases\nPerceptual distortions, such as cognitive bias, can result in poor judgement and irrational courses of action.\nLearning Objectives\nAnalyze the complex cognitive patterns that can complicate employee perception and behavior\nKey Takeaways\nKey Points\nCognitive biases are instances of evolved mental behavior that can cause deviations in judgement that produce negative consequences\nfor an organization.\nUnderstanding how perception can be distorted is particularly relevant for managers because they make many decisions, and deal with\nmany people making assessments and judgments, on a daily basis.\nBias arises from various processes that are sometimes difficult to distinguish. These include information-processing shortcuts ( heuristics ),\nmental noise and the mind's limited information processing capacity, emotional and moral motivations, and social influence.\nA few examples of perceptual distortions include confirmation bias, self-serving bias, causality, framing, and belief bias.\nKey Terms\ncognitive: The area of mental function that deals with logic, as opposed to affective functions which deal with emotion.\nheuristic: Experience-based techniques for problem solving, learning, and discovery. An exhaustive search is impractical, so heuristic\nmethods are used to speed up the process of finding a satisfactory solution.\nA cognitive bias is a pattern of deviation in judgment that occurs in particular situations and can lead to perceptual distortion, inaccurate\njudgment, illogical interpretation, or what is broadly called irrationality. Implicit in the concept of a pattern of deviation is a standard of\ncomparison with what is normative or expected; this may be the judgment of people outside those particular situations, or a set of\nindependently verifiable facts. Essentially, there must be an objective observer to identify cognitive bias in a subjective individual.\nOptical illusion: In this optical illusion all lines are actually\nparallel. Perceptual distortion makes them seem crooked.\nBias arises from various processes that can be difficult to distinguish. Bias is not inherently good or bad--it is pointedly subjective or\ncontrary to reactions or decisions that one might objectively expect. Ways in which biases are derived include:\nInformation-processing shortcuts (heuristics)\nMental noise\nThe mind's limited information processing capacity\nEmotional and moral motivations\nSocial influence\nThe notion of cognitive biases was introduced by Amos Tversky and Daniel Kahneman in 1972 and grew out of their experience of\npeople's innumeracy, or inability to reason intuitively with greater orders of magnitude. They and their colleagues demonstrated several\nreplicable ways in which human judgments and decisions differ from rational choice theory. They explained these differences in terms of\nheuristics, rules which are simple for the brain to compute but which introduce systematic errors.\nPerceptual Distortions and Management\nThe ways in which we distort our perception are particularly relevant for managers because they make many decisions, and deal with\nmany people making assessments an judgments, on a daily basis. Managers must be aware of their own logical and perceptive fallacies\nand the biases of others. This requires a great deal of organizational behavior knowledge. A few useful perceptual distortions managers\nshould be aware of include:\nConfirmation bias - Simply put, humans have a strong tendency to manipulate new information and facts until they match their own\npreconceived notions. This inappropriate confirmation allows for poor decision-making that ignores the true implications of new data.\nSelf-serving bias - Another common bias is the tendency to take credit for success while passing the buck on failure. Managers must\nmonitor this in employees and realize when they are guilty themselves. Being objective about success and failure enables growth and\nensures proper accountability.\nBelief bias - Individuals often make a decision before they have all the facts. In this situation, they believe that their confidence in their\ndecision is founded on a rational and logical assessment of the facts when it is not.\nFraming - It is quite easy to be right about everything if you carefully select the context and perspective on a given issue. Framing enables\npeople to ignore relevant facts by narrowing down what is considered applicable to a given decision.\nCausality - Humans are pattern-matching organisms. People analyze past events to predict future outcomes. Sometimes their analysis is\naccurate, but sometimes it is not. It is easy to see the cause-effect relationship in completely random situations. Statistical confidence\nintervals are useful in mitigating this perceptive distortion.\nImpression Management\nImpression management is a goal-directed conscious or unconscious process in which people attempt to influence the perceptions of\nothers.\nLearning Objectives\nOutline the way in which impressions and impressions management affect management, organizations, and branding\nKey Takeaways\nKey Points\nInfluencing others and gaining rewards, along with other motives, govern impression management from a general perspective.\nImpression management theory states that an individual or organization must establish and maintain impressions that are congruent with\nthe perceptions they want to convey to their stakeholder groups.\nOrganizations use branding and other impressions management strategies to convey a consistent and repeatable image to external and\ninternal audiences.\nManagement must also consider the impressions they make on others, both subordinates and business partners. Every organization has\nan image to maintain—and so does its management.\nKey Terms\nimpression: The overall effect of something, e.g., on a person.\nIn sociology and social psychology, impression management is a goal -directed conscious or unconscious process in which people\nattempt to influence the perceptions of others about a person, object, or event. Impression management is performed by controlling or\nshaping information in social interactions. It is usually synonymous with self-presentation, in which a person tries to influence how others\nperceive their image. Impression management is used by communications and public relations professionals to shape an organization's\npublic image.\nWhile impression management and self-presentation are often used interchangeably, some argue that they are not the same. In\nparticular, Schlenker believed that self-presentation should be used to describe attempts to control \"self-relevant\" images projected in\n\"real or imagined social interactions.\" This was because people manage impressions of entities other than themselves, such as businesses,\ncities, and other individuals.\nApplication to Management\nFrom the managerial and/or organizational frame, the basic premise is the same. Organizations put forward a self-proclaimed (and\nstrategized and refined) organizational perception. This is most commonly referred to as brand image or brand perception. Management\nmust ensure that all aspects of the organization conform to and fulfill the desired brand image, and communicate it to the public.\nManagers must also consider the impressions they make on others, both subordinates and business partners. Managers have to ensure\nthat they too are promoting the company brand image. Maintaining a consistent and reliable impression in a professional context that is\nconducive to the organizational impression is a central communicative skill managers must practice to be successful.\nImpression Management Theory\nImpression management theory states that any individual or organization must establish and maintain impressions that are congruent\nwith the perceptions they want to convey to their stakeholder groups. From both a communications and public relations viewpoint,\nimpression management encompasses ways of communicating congruence between personal or organizational goals and their intended\nactions in order to influence public perception.\nThe idea that perception is reality is the basis for this sociological and social psychology theory. Perception of an individual—a manager\nor employee—fundamentally shapes how the public perceives an organization and its products.\nMotives and Strategies\nThere are several motives that govern impression management. One is instrumental: we want to influence others and gain rewards. Giving\nthe right impression facilitates desired social and material outcomes. Social outcomes can include approval, friendship, assistance, or\npower, and conveying an impression of competency in the workforce. These can trigger positive material rewards like higher salaries or\nbetter working conditions.\nThe second motive of self-presentation is expressive. We construct an image of ourselves to claim personal identity, and present ourselves\nin a manner that is consistent with that image. If people feel that their ability to express themselves is restricted, they react negatively,\noften by becoming defiant. People resist those who seek to curtail self-presentation expressiveness by adopting many different\nimpression management strategies. One of them is ingratiation, the use of flattery or praise to highlight positive characteristics and\nincrease social attractiveness. Another strategy is intimidation, which is aggressively showing anger to get others to hear and obey.\nBasic Factors Governing Impression Management\nThere are a range of factors governing impression management. Impression management occurs in all social situations because people\nare always aware of being observed by others. The unique characteristics of a given social situation are important: cultural norms\ndetermine the appropriateness of particular verbal and nonverbal behaviors in different situations. These behaviors and actions have to be\nappropriate to the culture and the audience in order to positively influence impression management.\nA person's goals are another factor governing impression management. Depending on how they want to influence their audience\nregarding a certain topic, presenting themselves in different ways can shape different impressions and reactions in their audience.\nSelf-efficacy is also important to consider; this describes whether a person is confident that s/he can convey the intended impression\nsuccessfully. If they aren't confident, the audience will be able to tell.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}