{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Structure\nFactors to Consider in Organizational Design\nConsidering the Environment\nConsiderations of the external environment—including uncertainty, competition, and resources—are key in determining organizational\ndesign.\nLearning Objectives\nIdentify the inherent complexities in the external environment that influence the design of an organization's structure\nKey Takeaways\nKey Points\nOrganizational design is dictated by a variety of factors, including the size of the company, the diversity of the organization 's operations,\nand the environment in which it operates.\nAccording to several theories, considerations of the external environment are a key aspect of organizational design. These considerations\ninclude how organizations cope with conditions of uncertainty, procure external resources, and compete with other organizations.\nA company in a highly uncertain environment must prioritize adaptability over a more rigid and functional strategy. In contrast, a\ncompany in a mature market with limited variability and uncertainty should pursue more structure.\nA company with a low-cost strategy relative to its competition may benefit from a more simplistic and fixed structural approach to\noperations, while a company pursuing differentiation must prioritize flexibility and a more diversified structure.\nKey Terms\nstrategy: A plan of action intended to accomplish a specific goal.\ndifferentiation: A strategy focused on creating a unique product for a particular population.\nOverview\nOrganizational design is dictated by a variety of factors, including the size of the company, the diversity of the organization's operations,\nand the environment in which it operates. Considerations of the external environment are a key aspect of organizational design. The\nenvironment in which an organization operates can be defined from a number of different angles, each of which generates different\nstructural and design strategies to remain competitive.\nComplexity\nComplexity theory postulates that organizations must adapt to uncertainty in their environments. The complexity theory treats\norganizations and firms as collections of strategies and structures that interact to achieve the highest efficiency within a given\nenvironment. Therefore, companies in a highly uncertain environment must prioritize adaptability over a more rigid and functional\nstrategy. Alternatively, a fixed and specific approach to organizational design will capture more value in a mature market, where variability\nand uncertainty are limited.\nResource Dependence\nAnother perspective on organizational design is resource dependence theory—the study of how external resources affect the behavior of\nthe organization. Procuring external resources is important in both the strategic and tactical management of any company. Resource-\ndependence theory explores the implications regarding the optimal divisional structure of organizations, recruitment of board members\nand employees, production strategies, contract structure, external organizational links, and many other aspects of organizational strategy.\nCompetition\nAnother environmental factor that shapes organization design is competition. Higher levels of competition require different\norganizational structures to offset competitors' advantages while emphasizing the company's own strengths. A company that\ndemonstrates strength in differentiation relative to the competition benefits from implementing a divisional or matrix strategy, which in\nturn allows the company to manage a wide variety of demographic-specific products or services. Alternatively, a company that\ndemonstrates a low-cost strength (producing products cheaper than the competition) benefits from employing a structural or\nbureaucratic strategy to streamline operations.\nIdentifying External Factors\nIn considering organizational design relative to the environment, managers may find it helpful to employ two specific frameworks to\nidentify external factors and internal strengths and weaknesses:\nSWOT analysis : In this particular model, a company's strengths and weaknesses are assessed in the context of the opportunities and\nthreats in the business environment. A SWOT analysis enables a company to identify the ideal structure to maximize its internal strengths\nwhile capturing external opportunities and avoiding threats.\nPorter's five-forces analysis: This analysis identifies factors of the industry's competitive environment that may substantially influence a\ncompany's strategic design. The five forces include power of buyers, power of suppliers, rivalry (competition), substitutes , and barriers to\nentry (how difficult it is for new firms to enter the industry). Understanding these varying forces gives the company an idea of how\nadaptable or fixed the organizational structure should be to capture value.\nPorter's five-forces model: Porter's five-forces analysis identifies\nfive environmental factors that can influence a company's strategic\ndesign: power of buyers, power of suppliers, competition,\nsubstitutes, and barriers to entry.\nSmaller, more agile companies tend to thrive better in uncertain or constantly changing markets, while larger, more structured companies\nfunction best in consistent, predictable environments. Understanding these tools and frameworks alongside the varying external forces\nthat act upon a business will allow companies to make strategic organizational decisions that optimize their competitive strength.\nConsidering Company Size\nThe size and operational scale of a company is important to consider when identifying the ideal organization structure.\nLearning Objectives\nExplain how the size of a company helps determine the organizational structure that optimizes operational efficiency and managerial\ncapacity\nKey Takeaways\nKey Points\nCompany size plays a substantial role in determining the ideal structure of the company: the larger the company, the greater need for\nincreased complexity and divisions to achieve synergy.\nCompanies may adopt any of six organizational structures based on company size and diversity in scope of operations: pre-bureaucratic,\nbureaucratic, post-bureaucratic, functional, divisional, and matrix.\nSmaller companies function best with pre-bureaucratic or post-bureaucratic structures. Pre-bureaucratic structures are inherently\nadaptable and flexible and therefore particularly effective for small companies aspiring to expand.\nLarger companies usually achieve higher efficiency through functional, bureaucratic, divisional, and matrix structures (depending on the\nscale, scope, and complexity of operations).\nUnderstanding the varying pros and cons of each structure will help companies to plan their organization design and structure in a way\nthat optimizes resources and allows for growth.\nKey Terms\neconomies of scale: Processes in which an increase in quantity will result in a decrease in average cost of production (per unit).\nHomogeneous: Having a uniform makeup; having the same composition throughout.\neconomies of scope: Strategies of incorporating a wider variety of products or services to capture value through the ways in which they\ninteract or overlap.\nCompany Size and Organizational Structure\nOrganizational design can be defined narrowly as the strategic process of shaping the organization's structure and roles to create or\noptimize competitive capabilities in a given market. This definition underscores why it is important for companies to identify the factors of\nthe organization that determine its ideal structure—most specifically the size, scope, and operational initiatives of the company.\nCompany size plays a particularly important role in determining an organization's ideal structure: the larger the company, the greater the\nneed for increased complexity and divisions to achieve synergy. The organizational structure should be designed in ways that specifically\noptimize the effort and input compared to output. Larger companies with a wider range of operational initiatives require careful structural\nconsiderations to achieve this optimization.\nTypes of Organizational Structure\nCompanies may adopt one of six organizational structures based upon company size and diversity of scope of operations.\nPre-bureaucratic\nIdeal for smaller companies, the pre-bureaucratic structure deliberately lacks standardized tasks and strategic division of responsibility.\nInstead, this is an agile framework aimed at leveraging employees in any and all roles to optimize competitiveness.\nBureaucratic\nA bureaucratic framework functions well in large corporations with relatively complex operational initiatives. This structure is rigid and\nmechanical, with strict subordination to ensure consistency across varying business units.\nPost-bureaucratic\nThis structure is a combination of bureaucratic and pre-bureaucratic, where individual contribution and control are coupled with authority\nand structure. In this structure, consensus is the driving force behind decision making and authority. Post-bureaucratic structure is better\nsuited to smaller or medium-sized organizations (such as nonprofits or community organizations) where the importance of the decisions\nmade outweighs the importance of efficiency.\nFunctional\nA functional structure focuses on developing highly efficient and specific divisions which perform specialized tasks. This structure works\nwell for large organizations pursuing economies of scale, usually through production of a large quantity of homogeneous goods at the\nlowest possible cost and highest possible speed. The downside of this structure is that each division is generally autonomous, with limited\ncommunication across business functions.\nDivisional\nA divisional structure is also a framework best leveraged by larger companies; instead of economies of scale, however, they are in pursuit\nof economies of scope. Economies of scope simply means a high variance in product or service. As a result, different divisions will handle\ndifferent products or geographic locations/markets. For example, Disney may have a division for TV shows, a division for movies, a\ndivision for theme parks, and a division for merchandise.\nMatrix\nA matrix structure is used by the largest companies with the highest level of complexity. This structure combines functional and divisional\nconcepts to create a product-specific and division-specific organization. In the Disney example, the theme park division would also\ncontain a functional structure within it (i.e., theme park accounting, theme park sales, theme park customer service, etc.).\nStrategic Organizational Design\nStructure becomes more difficult to change as companies evolve; for this reason, understanding which specific structure will function best\nwithin a given company environment is an important early step for the management team. Smaller companies function best as pre-\nbureaucratic or post-bureaucratic; the inherent adaptability and flexibility of the pre-bureaucratic structure is particularly effective for\nsmall companies aspiring to expand. Larger companies, on the other hand, achieve higher efficiency through functional, bureaucratic,\ndivisional, and matrix structures (depending on the scale, scope, and complexity of operations).\nMcDonald's fast-food restaurants departmentalize varying elements of their operation to optimize efficiency. This structure is divisional,\nmeaning each specific company operation is segmented (for example, operations, finance/accounting, marketing, etc.).\nConsidering Technology\nTechnology impacts organizational design and productivity by enhancing the efficiency of communication and resource flow.\nLearning Objectives\nRecognize the intrinsic structural value of the ever-evolving technological environment\nKey Takeaways\nKey Points\nOrganizations use technological tools to enhance productivity and to initiate new and more efficient structural designs for the\norganization. These uses of technology become potential sources of economic value and competitive advantage.\nAn example of an organizational structure emerging from newer technological trends is what some have called the \"virtual organization,\"\nwhich connects a network of organizations via the internet.\nA network structure is another kind of organizational structure that is heavily reliant upon technology for communication.\nMore traditional organizational structures also benefit greatly from the advance of technology. Managers can communicate and delegate\nmuch more effectively through using technologies such as email, calendars, online presentations, and other virtual tools.\nKey Terms\nsupply chain: A system of organizations, people, technology, activities, information, and resources involved in moving a product or\nservice from the supplier to the customer.\nnetwork: Any interconnected group or system.\nOrganizational design can be defined narrowly as the strategic process of shaping an organization's structure and roles to create or\noptimize capabilities for competition in a given market.\nTechnology is an important factor to consider in organizational design. Modern organizations can be treated as complex and adaptive\nsystems that include a mix of human and technological interactions. Organizations can utilize technological tools to enhance productivity\nand to initiate new and more efficient structural designs for the organization, thereby adding potential sources of economic value and\ncompetitive advantage.\nTechnology: Technology has\nopened doors to incorporating\nnew and advanced forms of\norganizational design. This is\nmost notably seen through\nrapid global communications\nand the ability to constantly\nand economically be in\ncontact.\nTechnological Organizational Structures\nAn example of an organizational structure that has emerged from newer technological trends is what some have called the \"virtual\norganization,\" which connects a network of organizations via the internet. Over the internet, an organization with a small core can still\noperate globally as a market leader in its niche. This can dramatically reduce costs and overhead, remove the necessity for an expensive\noffice building, and enable small, dynamic teams to travel and conduct work wherever they are needed.\nA similar organizational design that is heavily reliant upon technological capabilities is the network structure. While the network structure\nexisted prior to recent technologies (i.e., affordable communications via internet, cell phones, etc.), the existence of complex\ntelecommunications networks and logistics technologies has greatly increased the viability of this structure.\nTechnology and Traditional Structures\nTechnology can also affect other longstanding elements of an organization. For example, information systems allow managers to take a\nmuch more analytic view of their businesses than before the advent of such systems. Managers can communicate and delegate much\nmore effectively through using technologies such as email, calendars, online presentations, and other virtual tools.\nTechnology has also impacted supply chain management —the management of a network of interconnected businesses involved in the\nprovision of product and service packages required by the end customers in a supply chain. Supply chain management now has the\ncapacity to track, forecast, predict, and refine the outbound logistics, contributing to a wide variety of logistical advantages (such as\nminimizing costs from warehousing, fuel, negative environmental impacts, or packaging).\nTechnology simplifies the process of managing reports, collecting communications, and keeping in touch, enabling management in more\nformal structures to take on more workers. Increases in technology have essentially allowed organizations to scale up their companies\nthrough more effective and efficient teams.\nConsidering the Organizational Life Cycle\nThe life cycle of an organization is important to consider when determining its overall design and structure.\nLearning Objectives\nDescribe the way in which life cycles influence an organization's overall design and structure\nKey Takeaways\nKey Points\nFrom an organizational perspective, the \" life cycle \" can refer to various factors such as the age of the organization, the maturation of a\nparticular product or process, or the maturation of the broader industry.\nIn organizational ecology, the idea of age dependence is used to examine how an organization's risk of mortality relates to its age.\nRichard L. Daft outlines different patterns of age dependence in his four stages model.\nThe idea of the Enterprise Life Cycle in enterprise architecture argues for a life cycle concept as an overarching design strategy —a\ndynamic, iterative process of changing the enterprise over time by incorporating, maintaining, and disposing of new and existing\nelements of the enterprise.\nCompanies must understand clearly where they are in their life cycle and what influence this will have on their optimal organizational\nstructure.\nKey Terms\nlife cycle: The useful life of a product or system; the developmental history of an individual, group or entity.\nassessment: An appraisal or evaluation.\nstrategy: A plan of action intended to accomplish a specific goal.\nOrganization design can be defined narrowly as the strategic process of shaping organizational structure and roles to create or optimize\ncapabilities for competition in a given market. The life cycle of an organization, industry, and/or product can be an important factor in\norganization design.\nThe life cycle of a business: Organizations must always be striving to\nsustain their position in a given competitive environment. This often\nrequires structural evolution and rapid iterations in the feedback loop\nof disruption, growth, refinement, and renewal.\nOverview of the Life Cycle\nFrom an organizational perspective, \"life cycle\" can refer to various factors such as the age of the organization itself, the maturation of a\nparticular product or process, or the maturation of the broader industry. In organizational ecology, the idea of age dependence is used to\nexamine how an organization's risk of mortality relates to the age of that organization. Generally speaking, organizations go through the\nfollowing stages:\nBirth\nGrowth\nMaturity\nDecline\nDeath\nThe Enterprise Life Cycle\nThe Enterprise Life Cycle is a model that underlines the way in which organizations remain relevant. The Enterprise Life Cycle is the\ndynamic, iterative process of changing an enterprise over time by incorporating new business processes, technologies, and capabilities, as\nwell as maintaining, using, and disposing of existing elements of the enterprise.\nRichard L. Daft's Four Stages\nRichard L. Daft theorized four stages of the organizational life cycle, each with critical transitions:\nEntrepreneurial stage → Crisis: Need for leadership\nCollectivity stage → Crisis: Need for delegation\nFormalization stage → Crisis: Too much red tape\nElaboration stage → Crisis: Need for revitalization\nStructural Implications of the Life Cycle\nThe life cycle of an organization is important to consider when making decisions about the organization's structure and design. Richard L.\nDaft's model underlines critical problems within each stage of an organization's life cycle that can often be solved through intelligent\nstructural design.\nDaft first notes that the entrepreneurial (or startup) stage of an organization requires leadership. In this situation, decision-making must\nbe enabled and bureaucracy should be minimized. This lends itself well to pre-bureaucratic stuctures in which everyone involved is\nempowered to take the reins and employ their creativity and innovation.\nIn the collectivity stage, momentum has been created and expansion is required. This is where functional or divisional strategies may\nbegin to emerge, enabling managers to build teams and delegate tasks.\nCompanies continue to expand in the formalization stage, requiring increased bureaucracy and more levels of authority to approve a\ngiven decision. In this stage they grow large enough to accommodate functional, divisional, or even matrix structures in order to produce\nat scale. Organizations in this stage must be careful not to fall too strongly into rigid structures that inhibit or disrupt efficiency,\ncommunication, or decision-making.\nThe Enterprise Life Cycle comes strongly into play in the elaboration stage. During this stage the organization must retain its relevance in\nthe industry through reinforcing competitive advantages and/or creating new products to fill changing consumer needs. This requires a\ngreat deal of organized creativity and exploration of new markets, which may justify team or divisional structures within the broader\norganizational structure. Such structures allow small teams to experiment and react quickly as they try new entrepreneurial strategies\nwhile the larger organization maintains operative efficiency in established markets.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}