{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nExternal Inputs to Strategy\nPorter's Five Forces\nMichael Porter, a leading business analyst and professor, identified five critical external factors that affect strategy in any industry.\nLearning Objectives\nApply Porter's Five Forces to the external landscape to derive optimal strategies\nKey Takeaways\nKey Points\nPorter's Five Forces include: threat of new entrants (also know as barriers to entry), threat of substitutes, rivalry, bargaining power of\nsuppliers, and bargaining power of buyers.\nManagers use the Five Forces model to help identify opportunities and threats or to evaluate decisions in the context of their organization\n's environment.\nAttractiveness refers to the overall industry profitability. An \"unattractive\" industry is one in which the combination of the Five Forces\ndrives down overall profitability.\nIn analyzing these five factors, it is useful to rate each category as an external risk factor (i.e., low, medium, or high). Ideal industries have\nlow threats from each of these forces (i.e., low buy power, low rivalry, low risk of new entrants, etc.).\nThis model is a useful for the strategic derivation of managers; it allows them to narrow down their focus on specific key issues within a\ngiven industry.\nKey Terms\nentrant: Participant.\nsubstitute: A replacement or stand-in for something that achieves a similar result or purpose.\nMichael Porter, a leading business analyst and professor at Harvard Business School, has identified five key forces that affect the strategy\nof any industry. His list, Porter's Five Forces, draws upon industrial organization (IO) economics to derive forces that determine the\ncompetitive intensity—and therefore attractiveness—of a market.\nIndustry Attractiveness\nAttractiveness refers to the overall industry profitability. An \"unattractive\" industry is one in which the combination of the Five Forces\ndrives down overall profitability. A very unattractive industry would be one approaching \"pure competition.\" In this state, available profits\nfor all firms are driven to normal profit rates. In analyzing the following five factors, it is useful to rate each category as an external risk\nfactor (i.e., low, medium, or high). Ideal industries will have low threats from each of these forces (i.e., low buy power, low rivalry, low risk\nof new entrants, etc.).\nThe Five Forces\nPorter's Five Forces include:\nThreat of new entrants (or barriers to entry): From the view of current incumbents, profitable markets that yield high returns will attract\nnew firms. This results in many new competitors and eventually decreases profitability for all firms in the industry. Unless the entry of new\nfirms can be blocked by incumbents, the abnormal profit rate will tend toward zero (also known as \"perfect competition\"). From the\nperspective of new entrants, high barriers to entry mean that the capital costs of getting into the industry make it difficult to compete\nwith current incumbents.\nThreat of substitute products or services: The existence of products outside of the realm of the common product boundaries, which fulfill\nthe same need, increases the propensity of customers to switch to alternatives. This should not be confused with competitors' similar\nproducts; it is instead a different product that fills the same need. Take transportation as an example: General Motors (GM) would view\ncity subways as a substitute to someone buying a new car.\nRivalry: For most industries, the intensity of competitive rivalry is the major determinant of the competitiveness of the industry. This\ninvolves how many firms are in the industry and how their competitive dynamics reduce profitability. Airlines have extremely high rivalry,\nfor example.\nBargaining power of buyers: The bargaining power of customers is also described as the market of outputs. It is the ability of customers to\nput the firm under pressure, which also affects the customer's sensitivity to price changes. Picture a supply and demand curve: if the\nsupply greatly outstrips the demand, the buyers have more power than the suppliers.\nBargaining power of suppliers: The bargaining power of suppliers is also described as the market of inputs. When there are few substitutes,\nsuppliers of raw materials, components, labor, and services (such as expertise) to the firm can be a source of power over the firm.\nSuppliers can refuse to work with the firm or charge excessively high prices for unique resources. Similar to power of buyers, this\nbargaining power relies on scarcity and basic economics of supply and demand.\nStrategic Implications\nManagers use the Five Forces model to help identify opportunities or evaluate decisions in the context of the environment. Often, the Five\nForces are mapped against a SWOT analysis to develop a corporate strategy. To complete a Five Forces analysis, it is often best to build a\ngrid on a piece of paper and label each section. Filling in each section to develop a view of the industry can help managers determine if\nthe industry is truly competitive, a monopoly, or an oligopoly. An important question to ask is: \"What will make a company able to\ncompete in this environment? \"\nPorter's Five Forces: This image illustrates the\nimportant factors within Porter's Five Forces model.\nLimitations of the Five-Forces View\nLike most models, Porter's Five Forces has advantages and limitations when applied to strategic planning processes.\nLearning Objectives\nEmploy Porter's Five Forces in a meaningful strategic way, with a thorough understanding of the potential limitations\nKey Takeaways\nKey Points\nStrategy consultants will use Porter's Five Forces framework when making a qualitative evaluation of a firm's strategic position; however, it\nis only one tool of many and is not infallible.\nAccording to Porter, the Five Forces model should be used at the broader level of an entire industry; it is not designed to be used at a\nsmaller group or market level.\nAnother limitation, which Porter's model shares with most competitive frameworks, is that of chronological thinking. Porters model is\ninherently static, representing only aspects of the present day.\nThe purpose of the model is brainstorming: a thinking exercise to demonstrate the subjective attractiveness of a given industry landscape.\nIt is not designed to decide optimal industries with certainty.\nKey Terms\nPorter's Five Forces Model: A business tool to qualitatively measure business framework.\nframework: A basic conceptual structure.\nStrategy consultants will use Porter's Five Forces framework when making a qualitative evaluation of a firm's strategic position; however, it\nis only one tool of many and is not infallible. The framework is only a starting point or checklist. Like most models, Porter's Five Forces has\nadvantages and limitations when applied to strategic planning processes; one must understand how it is designed to be used and\nrecognize its limitations.\nSingle Industry vs. Multiple Industry Operation\nAccording to Porter, the Five Forces model is best used at the broader level of an entire industry. Assessing at the smaller levels of sectors,\ncompetitive groups, or general markets will not yield strategically relevant information. Porter's factors are specifically determined based\non the industry level. Large organizations analyzing markets that are too broad and smaller organizations focusing on specific sectors\nneed to keep this limitation in mind when using this framework.\nSome firms operate in only one industry, while others operate in multiple industries. A firm that competes in a single industry will\nrealistically only need to assess the industry it is in (and perhaps other supporting industries depending upon the situation). For\ndiversified companies, however, the first fundamental issue in corporate strategy is the selection of industries (lines of business) in which\nthe company should focus. Following this, each line of business should develop its own industry-specific Five Forces analysis. The average\nGlobal 1,000 company competes in approximately 52 industries (lines of business). These large firms require a diversified series of\nanalyses.\nAdaptability and Evolution\nAnother limitation—which Porter's model shares with most competitive frameworks—is that of chronological thinking. Porters model is\ninherently static, representing only aspects of the present day (and perhaps those that are easily predicted within the short term). As\nstrategic planning involves long-term objectives and the pursuit of adaptability, Porter's model is too static to be relied upon outside of\nshort- to medium-term objectives.\nUncertainty\nIt has been noted that conclusions from the Five Forces model are highly debatable. This is deliberate, as models are designed to spark\ndiscussion and underline key concerns. However, false conclusions can be reached when models are taken as certain. The purpose of the\nmodel is brainstorming: a thinking exercise to demonstrate the subjective attractiveness of a given industry landscape. It is not designed\nto decide optimal industries with certainty. In short, conclusions should be taken in the context of the broader strategic discussion and\nnot as opposed to a stand-alone recommendation.\nPorter's Five Forces: This diagram represents the\ncomponents of Porter's Five Forces model: (1) threat of\nnew entrants, (2) threat of established rivals, (3) threat of\nsubstitute products, (4) bargaining power of buyers, and\n(5) bargaining power of suppliers.\nThe PESTEL and SCP Frameworks\nPESTEL and SCP frameworks are models for understanding different industry and market factors that impact strategic management.\nLearning Objectives\nApply PESTEL and SCP frameworks to industries in which incumbents operate\nKey Takeaways\nKey Points\nA PESTEL analysis looks at the six most common macro-environmental factors (political, economic, social, technological, environmental,\nand legal) in order to understand their interaction with the organization.\nA PESTEL analysis is a part of the external strategic analysis when conducting market research; it gives an overview of the different macro-\nenvironmental factors that the company has to take into consideration.\nAccording to the structure- conduct - performance (SCP) approach, an industry's performance depends on the conduct of its firm, which\nis dependent on its structure.\nComponents that make up the SCP model for industrial organization include: basic conditions, structure, conduct, performance, and\ngovernment policy.\nWhile the PESTEL and SCP models share many similarities, it is useful for managers to view the industry from both frameworks as they\ndecide upon optimal operating strategies.\nKey Terms\nenvironmental scanning: The study and interpretation of the political, economic, social, and technological events and trends that\ninfluence a business, an industry, or even a total market\nPESTEL Analysis\nA PESTEL analysis looks at the six most common macro-environmental factors to understand their interactions. The acronym stands for\npolitical, economic, social, technological changes, ecology , and legislation. A PESTEL analysis is a useful strategic tool for understanding\nmarket growth or decline, business position, potential, and direction for operations. The basic premise behind this framework, from a\nstrategy perspective, is to identify opportunities and threats in the market.\nPESTEL Factors\nPolitical factors include how, and to what degree, a government intervenes in the economy. Specifically, political factors include areas such\nas tariffs, political instability, and other policy-based obstacles that businesses encounter in a given region.\nEconomic factors include economic growth, interest rates, exchange rates, and the rate of inflation. Economic factors are by far the easiest\nto quantify, and they provide a basic framework for capital exchange and consumer purchasing ability.\nSocial factors include the cultural aspects of the environment, such as health consciousness, population growth rate, age distribution,\ncareer attitudes, and emphasis on safety. Often referred to socio-demographic factors, they largely consist of preferences and attitudes\ndisplayed by different groups of individuals within a given market. Social factors can be very difficult to measure with certainty.\nTechnological factors include research and development (R&D), automation, technology incentives, and the rate of technological change.\nDisruptive innovations can dramatically alter an industry and change who is best poised for competition. Carefully monitoring these\nfactors on a daily basis is crucial to a company's success and has grown in importance over the years.\nEnvironmental factors include ecological and environmental aspects such as weather, climate, and climate change. Industries like tourism,\nfarming, and insurance are especially affected by these factors. Growing awareness of the potential impacts of climate change is affecting\nhow companies operate and the products they offer, both creating new markets and diminishing or destroying existing ones.\nLegal factors include discrimination laws, consumer laws, antitrust laws, employment laws, and health and safety laws. These factors can\naffect how a company operates, its costs, and the demand for its products.\nSCP Analysis\nAccording to the structure-conduct-performance (SCP) approach, an industry's performance (or the success of an industry in producing\nbenefits for the consumer) depends on the conduct of its firm. The conduct of the firm, in turn, is dependent on its structure (or factors\nthat determine the competitiveness of the market).\nThe structure of the industry depends on basic conditions such as technology and demand for a product. This creates a linear relationship\nof sorts, where the structural inputs can impact the conduct and strategy of the firm, leading to better (or worse) performance.\nTaken into account alongside the PESTEL framework, management should carefully consider and define the structure of a given industry.\nThis structure will provide critical inputs for the broader industry, which in turn will impact the conduct of the organization through\nstrategic integration. If this process is accomplished effectively—and management has integrated the external structure with the internal\nconduct strategically—higher performance can then be derived.\nCompetitive Dynamics\nCrafting an effective strategy requires understanding the competitive dynamics of the space in which the business operates.\nLearning Objectives\nIdentify critical competitive components that directly influence strategic development\nKey Takeaways\nKey Points\nCompetitor analysis is an assessment of the strengths and weaknesses of current and potential competitors. This analysis provides both\nan offensive and defensive strategic context in order to identify opportunities and threats.\nCompetitor analysis requires the specific selection of key success factors within an industry; it also requires the qualitative measurement\nof accomplishing these for both the firm and its key competitors.\nCompetitor profiling coalesces all of the relevant sources of competitor analysis into one framework to support efficient and effective\nstrategy formulation, implementation, monitoring, and adjustment.\nBy identifying key competitors and relative strengths and weaknesses, organizations can react more quickly and effectively from a\nstrategic perspective.\nKey Terms\nassessment: An appraisal or evaluation.\ndynamic: Changeable; active; in motion, usually as the result of an external force.\nCompetition in Business\nMerriam-Webster defines competition in business as \"the effort of two or more parties acting independently to secure the business of a\nthird party by offering the most favorable terms.\" The competition is a moving-target, ever-evolving and adapting to better capture\nmarket share and profitability; therefore competition is a critical area of analysis for strategic managers. Observing and predicting\ncompetitive movements and dynamics is a key to success and a primary responsibility of upper management.\nThe Dynamic Model of Competition\nThe dynamic model of the strategy process is a way of understanding how strategic actions occur. It recognizes that strategic planning is\ndynamic; that is, strategy-making involves a complex pattern of actions and reactions. It is partially planned and partially unplanned.\nCompetitive dynamics thus looks at how competitive firms act and react.\nCompetitive Dynamics\nIn marketing and strategic management, competitor analysis is an assessment of the strengths and weaknesses of current and potential\ncompetitors. This analysis provides both an offensive and defensive strategic context in order to identify opportunities and threats.\nCompetitor profiling coalesces all of the relevant sources of competitor analysis into one framework to support efficient and effective\nstrategy formulation, implementation, monitoring, and adjustment.\nComponents of Competitor Analysis\nCompetitor analysis is an essential component of corporate strategy. It is argued that most firms do not conduct this type of analysis\nsystematically enough. Instead, many enterprises operate on conjectures and informal impressions gathered from information received\nabout competitors. As a result, traditional environmental scanning places many firms at risk of dangerous competitive \"blind spots\" due to\na lack of robust competitor analysis.\nExample of Competitor Profiling: The folio plot visualizes\nthe relative market share of a portfolio of products versus\nthe growth of their market. The circles differ in size by their\nsales volume. Note that the highest-selling product,\nDorian, shows the highest market growth and a high\n(though not the highest) market share; the lowest-selling,\nZodial, shows both low market growth and low market\nshare.\nCompetitor analysis requires the specific selection of key success factors within an industry. It also requires the qualitative measurement\nof accomplishing these for both the firm and its key competitors. For example, consider that customer service, quality, and brand\nperception are the key success factors in retail fashion. In this case, Ralph Lauren should identify key competitors (Liz Claiborne, Calvin\nKlein, etc.) and provide a numeric score of their success or failure in each category. Through this competitive analysis, Ralph Lauren can\nimprove its competition.\nCompetitor profiling facilitates this strategic objective in three important ways:\nFirst, profiling can reveal strategic weaknesses in rivals that the firm may exploit.\nSecond, the proactive stance of competitor profiling can allow the firm to anticipate its rivals' strategic response to the firm's planned\nstrategies, the strategies of other competing firms, and changes in the environment.\nThird, this proactive knowledge can give the firm strategic agility. Offensive strategy can be implemented more quickly in order to exploit\nopportunities and capitalize on strengths. Similarly, defensive strategy can be employed more deftly in order to counter the threat of rival\nfirms exploiting the firm's own weaknesses.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}