{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nDecision Making in Management\nDefining Decision Making\nDecision making is the mental process of selecting a course of action from a set of alternatives.\nLearning Objectives\nIdentify the steps and analyze alternatives in a decision-making process\nKey Takeaways\nKey Points\nDecision making is a process of choosing between alternatives.\nProblem solving and decision making are distinct but related activities.\nTime pressure and personal emotions can affect the quality of decision-making outcomes.\nKey Terms\nProblem: A difficulty that has to be resolved or dealt with.\nDecision making is the mental process of choosing from a set of alternatives. Every decision-making process produces an outcome that\nmight be an action, a recommendation, or an opinion. Since doing nothing or remaining neutral is usually among the set of options one\nchooses from, selecting that course is also making a decision.\nDifference Between Problem Analysis and Decision Making\nWhile they are related, problem analysis and decision making are distinct activities. Decisions are commonly focused on a problem or\nchallenge. Decision makers must gather and consider data before making a choice. Problem analysis involves framing the issue by\ndefining its boundaries, establishing criteria with which to select from alternatives, and developing conclusions based on available\ninformation. Analyzing a problem may not result in a decision, although the results are an important ingredient in all decision making.\nSteps in Decision Making\nDecision making comprises a series of sequential activities that together structure the process and facilitate its conclusion. These steps\nare:\nEstablishing objectives\nClassifying and prioritizing objectives\nDeveloping selection criteria\nIdentifying alternatives\nEvaluating alternatives against the selection criteria\nChoosing the alternative that best satisfies the selection criteria\nImplementing the decision\nAnalysis of Alternatives\nMany choices: Too many choices increase the\ndifficulty of making a decision.\nA major part of decision making involves the analysis of a defined set of alternatives against selection criteria. These criteria usually\ninclude costs and benefits, advantages and disadvantages, and alignment with preferences. For example, when choosing a place to\nestablish a new business, the criteria might include rental costs, availability of skilled labor, access to transportation and means of\ndistribution, and proximity to customers. Based on the relative importance of these factors, a business owner makes a decision that best\nmeets the criteria.\nThe decision maker may face a problem when trying to evaluate alternatives in terms of their strengths and weaknesses. This can be\nespecially challenging when there are many factors to consider. Time limits and personal emotions also play a role in the process of\nchoosing between alternatives. Greater deliberation and information gathering often takes additional time, and decision makers often\nmust choose before they feel fully prepared. In addition, the more that is at stake the more emotions are likely to come into play, and this\ncan distort one's judgment.\nDecision-Making Styles\nDecisions are driven by psychological, cognitive, and normative styles, each of which take into account varying influences on the final\ndecision.\nLearning Objectives\nRecognize the various factors which influence a leader's decision-making style\nKey Takeaways\nKey Points\nThe ability to make effective decisions that are rational, informed, and collaborative can greatly reduce opportunity costs while building a\nstrong organizational focus.\nA psychological style to decision-making favors individual values, desires, and needs to determine the best course of action.\nA cognitive style to decision-making is heavily influenced by external factors and repercussions, such as how a given course of action will\nimpact the broader environment in which the organization functions.\nNormative decision-making relies on logic and communicative rationality, aligning people based upon a logical progression from\npremises to conclusion.\nRegardless of the style or perspective, managers, and leaders must create organizational alignment in decision-making through building\nconsensus.\nKey Terms\ncommunicative rationality: A theory or set of theories which describes human rationality as a necessary outcome of successful\ncommunication.\nWhy Decision-making Matters\nDecision-making is a truly fascinating science, incorporating organizational behavior, psychology, sociology, neurology, strategy,\nmanagement, philosophy, and logic. The ability to make effective decisions that are rational, informed, and collaborative can greatly\nreduce opportunity costs while building a strong organizational focus. As a prospective manager, effective decision-making is a central\nskill necessary for success. This requires the capacity to weigh various paths and determine the optimal trajectory of action.\nDecision-making Styles\nThere are countless perspectives and tactics to effective decision-making. However, there are a few key points in decision-making theory\nthat are central to understanding how different styles may impact organizational trajectories. Decision-making styles can be divided into\nthree broad categories:\nPsychological: Decisions derived from the needs, desires, preferences, and/or values of the individual making the decision. This type of\ndecision-making is centered on the individual deciding.\nCognitive: This is an integrated feedback system between the individual/organization making a decision, and the broader environment's\nreactions to those decisions. This type of decision-making process involves iterative cycles and constant assessment of the reactions and\nimpacts of the decision.\nNormative: In many ways, decision making (particularly in groups, such as within an organization) is about communicative rationality. This\nis to say that decisions are derived based on the ability to communicate and share logic, using firms premises and conclusions to drive\nbehavior.\nCognitive Theories\nWhile the above styles give a general sense of the logic that drives choices, it is more useful to recognize that each of these three styles\ncan play a role in any individual's decision-making process. From the cognitive perspective, there are a few specific stylistic models that\nare useful to keep in mind:\nOptimizing vs. Satisficing\nDecision-making is limited to the finite amount of information an individual has access to. With limitations on information, true objectivity\nis impossible. Decisions are therefore intrinsically flawed. A satisficer will recognize this necessary imperfection, and prefer faster but less\nperfect decisions while a maximizer will take a longer time trying to find the optimal choice. This can be viewed as a spectrum, and each\ndecision (depending on the risk of a mistake) can be viewed with varying levels of perfection.\nIntuitive vs. Rational\nDaniel Kahneman puts forward the idea of two separate minds that compete for influence within each of us. One way to describe this is a\nconscious and a subconscious perspective. The subconscious mind (referred to as System 1) is automatic and intuitive, rapidly\nconsolidating data and producing a decision almost immediately. The conscious mind (referred to as System 2) requires more effort and\ninput, utilizing logic and rationale to make an explicit choice.\nCombinatorial vs. Positional\nThis relationship was put forward by Aron Katsenelinboigen based on how the game of chess is played, and an individual's relationship\nwith uncertainty. A combinatorial player has a final outcome, making a series of decisions that try to link the initial position with the final\noutcome in a firm, narrow, and concrete way (i.e. certainty). The positional decision-making approach is 'looser', with a sense of setting up\nfor an uncertain future as opposed to pursuing a concrete object. Each move from this type of player would maximize options as opposed\nto pursue an outcome.\nConsensus Flowchart: Regardless of\nperspective or style, all leaders must\nmake decisions that create consensus.\nThis model underlines how a manager or\nleader can discuss various options within\na group setting, make proposals for\naction, and iterate until agreement is\nreached.\nTypes of Decisions\nThree approaches to decision making are avoiding, problem solving and problem seeking.\nLearning Objectives\nDifferentiate between the three primary decision-making approaches: avoiding, problem solving, and problem seeking\nKey Takeaways\nKey Points\nOne approach to decision making is to not make a choice—that is, to avoid making a decision altogether.\nIdentifying and selecting a solution to a problem is a frequent type of decision outcome.\nSometimes decision making results in the need to restate the purpose and subject of the choice; this is known as problem seeking.\nKey Terms\nproblem seeking: The process of clarifying, understanding, and restating the problem.\nproblem solving: Problem solving involves using generic or ad hoc methods, in an orderly manner, for finding solutions to specific\nproblems.\nEvery decision-making process reaches a conclusion, which can be a choice to act or not to act, a decision on what course of action to\ntake and how, or even an opinion or recommendation. Sometimes decision making leads to redefining the issue or challenge.\nAccordingly, three decision-making processes are known as avoiding, problem solving, and problem seeking.\nAvoiding\nOne decision-making option is to make no choice at all. There are several reasons why the decision maker might do this:\nThere is insufficient information to make a reasoned choice between alternatives.\nThe potential negative consequences of selecting any alternative outweigh the benefits of selecting one.\nNo pressing need for a choice exists and the status quo can continue without harm.\nThe person considering the alternatives does not have the authority to make a decision.\nOne example of avoiding a decision occurs routinely at the Supreme Court of the United States (as well as other appellate courts). The\nSupreme Court will decline to hear a case because, in their judgment, the issues have not been sufficiently considered in lower courts.\nProblem Solving\nMost decisions consists of problem-solving activities that end when a satisfactory solution is reached. In psychology, problem solving\nrefers to the desire to reach a definite goal from a present condition. Problem solving requires problem definition, information analysis\nand evaluation, and alternative selection.\nProblem Seeking\nOn occasion, the process of problem solving brings the focus or scope of the problem itself into question. It may be found to be poorly\ndefined, of too large or small a scope, or missing a key dimension. Decision makers must then step back and reconsider the information\nand analysis they have brought to bear so far. We can regard this activity as problem seeking because decision makers must return to the\nstarting point and respecify the issue or problem they want to address.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}