{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nThe Planning Cycle\nPlanning a Project\nIdentifying stages in a project plan, complete with objectives, implementation, and assessment, is a primary responsibility of strategists.\nLearning Objectives\nOutline the five basic stages in the planning cycle as derived within the field of strategic management\nKey Takeaways\nKey Points\nThe initiation stage includes generating ideas, assessing the feasibility and profitability of the project, conceptualizing the operational\nbenefits and bottom line, and getting approval and resources.\nPlanning and design follows the initiation stage, bringing the project under the microscope to assess the smaller details. Planning predicts\nthe time investment, costs, and specific resources required.\nThe simplest stage in theory, and perhaps the most complicated in practice, is the execution stage. This requires integrating all of the\nidentified inputs from the planning-and-design phase to construct the actual end product or service.\nIn the monitoring and controlling phase, analysis of the efficiency and quality of the project cycle from a strategic perspective allows for\nthe optimization of the operational process itself.\nAt the end of the project-management cycle, the closing phase determines that the project no longer captures value and should be\nharvested or divested.\nThis cycle is iterative, and, unless the project is harvested or divested, should be continuously assessed and altered whenever deemed\nnecessary.\nKey Terms\nfeasibility: The state of being possible.\noptimization: The design and operation of a system or process to make it as good as possible in some defined sense.\nforecast: An estimation of a future condition.\nThe stages of a project within the strategic-planning discipline provide a step-by-step approach to generating and implementing an\neffective strategy, for either a corporation or a strategic business unit (SBU). Implementing a framework for generating a project-planning\ncycle, complete with strategic objectives, implementation methods, and assessment, is a primary responsibility of strategic managers.\nProject-planning cycle: As shown in the figure, there are five basic\nstrategic management steps in the planning cycle.\nThe Steps in Strategic Planning\nInitiation: The initiation stage includes generating the idea, assessing the feasibility and profitability of the project, conceptualizing the\noperational benefits and the bottom line, and getting approval and resources. This stage should determine the scope of the operation.\nPlanning and design: Planning and design brings the project under the microscope by assessing the smaller details. This stage includes\npredicting the time investment, costs, specific resources required, and the necessary inputs to achieve the outputs forecasted in the\ninitiation stage. This stage is the most strategic in nature, mapping out the business processes in sufficient detail to effectively accomplish\nthe required objectives.\nExecuting: The simplest stage in theory, and perhaps the most complicated in practice, is the execution stage. It involves the integration of\nall inputs identified in the planning-and-design stage to construct the actual end product or service. This integration should be in line\nwith the framework established in the first two stages.\nMonitoring and controlling: This can be thought of as the perfecting stage, in which analyzing the efficiency and quality of the project\ncycle from a strategic perspective allows for the optimization of operational processes. Monitoring the operation for ways to increase\nvalue can redirect the strategic-planning cycle back to the planning-and-design stage. This stage allows the process to run internally in a\ncyclical fashion, constantly adding improvements to capture more value.\nClosing: The project-management cycle ends with the determination that the project no longer captures value and should be harvested or\ndivested. This stage is the other possible result from the monitoring and controlling phase—that is, instead of being redirected back to\nthe planning-and-design phase, the assessment shows that value is now being lost and it is no longer profitable to continue the process.\nTherefore, the project cycle is closed.\nThis step-by-step process highlights each feasible stage in the project-management cycle. By appropriately incorporating each stage of\nthe model into the planning process, managers can effectively forecast the deliverable, and they can avoiding losing value by accurately\nassessing the margins that will be produced in a given strategic initiative. This allows for informed and knowledgeable decisions to be\nmade at each relevant point in the operation.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}