{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Theory\nClassical Perspectives\nClassical Versus Behavioral Perspectives\nThe classical perspective focuses on direct inputs to efficiency, while the behavioral perspective examines indirect inputs too.\nLearning Objectives\nCompare and contrast the central concepts that define a classical organizational-theory approach and a behavioral perspective.\nKey Takeaways\nKey Points\nThe classical perspective of management emerged from the Industrial Revolution and focuses on the efficiency, productivity, and output\nof employees as well as of the organization as a whole. It generally does not focus on human or behavioral attributes or variation among\nemployees.\nThe classical perspective of management is often criticized for ignoring human desires and needs in the workplace and does not take into\nconsideration human error in work performance. The classical perspective has strong influences on modern operations and process\nimprovement.\nThe behavioral perspective of management (sometimes called the \"human relations perspective\") takes a much different approach from\nthe classical perspective: it is generally more concerned with employee well-being and encourages management approaches that\nconsider the employee as a motivated worker who genuinely wants to work.\nKey Terms\nmicromanage: To rely on extreme supervision and close monitoring of employee work.\npsychosocial: Related to one's psychological development in, and interaction with, a social environment.\nThe Classical Perspective of Management\nThe classical perspective of management, which emerged from the Industrial Revolution, focuses on improving the efficiency, productivity,\nand output of employees, as well as the business as a whole. However, it generally does not focus on human or behavioral attributes or\nvariances among employees, such as how job satisfaction improves employee efficiency.\nFrederick Winslow Taylor\nScientific management theory, which was first introduced by Frederick Winslow Taylor, focused on production efficiency and productivity\nof employees. By managing production efficiency as a science, Taylor thought that worker productivity could be completely controlled. He\nused the scientific method of measurement to create guidelines for the training and management of employees. This quantitative,\nefficiency-based approach is representative of the classical perspective.\nMax Weber\nClassical Perspective of Management: The classical\nperspective of management focused on improving\nworker productivity.\nAnother leader in the classical perspective of management, Max Weber, created the bureaucracy theory of management, which focuses\non the theme of rationalization, rules, and expertise for an organization as a whole. Weber's theory also focuses on efficiency and clear\nroles in an organization, meaning that management in organizations should run as effectively as possible with as little bureaucracy as\npossible. One example of Weber's management theory is the modern \"flat\" organization, which promotes as few managerial levels as\npossible between management and employees.\nHenri Fayol\nHenri Fayol, another leader in classical management theory, also focused on the efficiency of workers, but he looked at it from a\nmanagerial perspective—i.e., he focused on improving management efficiency rather than on improving each individual employee's\nefficiency. Fayol created six functions of management, which are now taught as the following four essential functions of management:\nplanning, organizing, leading, and controlling.\nThe classical perspective of management theory pulls largely from these three theorists (Taylor, Weber, and Fayol) and focuses on the\nefficiency of employees and on improving an organization's productivity through quantitative (i.e., measurable, data-driven) methods. The\nclassical perspective is often criticized for ignoring human desires and needs in the workplace and typically does not take into\nconsideration human error in work performance. The classical perspective has strong influences on modern operations and process\nimprovement, which uses quantitative metrics to determine how effectively a process is running.\nThe Behavioral Perspective of Management\nThe behavioral perspective of management (sometimes called the \"human relations perspective\") takes a much different approach from\nthe classical perspective. It began in the 1920s with theorists such as Elton Mayo, Abraham Maslow, and Mary Parker Follett.\nThe Hawthorne Studies\nThe Hawthorne studies were an important start to the behavioral perspective of management. These were a series of research studies\nconducted with the workers at the Hawthorne plant of the Western Electric Company. The Hawthorne studies found that workers were\nmore strongly motivated by psychosocial factors than by economic or financial incentives.\nAbraham Maslow\nAround this same time, Abraham Maslow created his hierarchy-of-needs theory, which showed that workers were motivated through a\nseries of lower-level to higher-level needs. This theory has been applied in the workplace to better understand \"soft\" factors of employee\nmotivation, such as goal setting and team involvement, in order to better manage employees.\nDouglas McGregor\nAdditional theories in the behavioral perspective include Douglas McGregor's Theory X and Theory Y, which have to do with the\nperceptions managers have about their employees and how employees react to those perceptions. In Theory X, managers assume\nemployees are inherently lazy and, therefore, micromanage. In Theory Y, managers are more laissez-faire and allow employees more\nfreedom in their work. McGregor's theory of management is an example of how behavior-management theory looks more into the\n\"human\" factors of management and encourages managers to understand how psychological characteristics can improve or hinder\nemployee performance.\nGenerally, the behavioral perspective is much more concerned with employee well-being and encourages management approaches that\nconsider the employee as a motivated worker who wants to work and wants to produce quality work. This theory therefore encourages a\nmanagement approach that is less focused on micromanaging and is more focused on building relationships with employees in order to\nhelp them achieve their workplace goals and work as effectively and efficiently as possible.\nScientific Management: Taylor and the Gilbreths\nScientific management focuses on improving efficiency and output through scientific studies of workers' processes.\nLearning Objectives\nDifferentiate between Taylorism and the Gilbreths' perspective on the one hand and motion studies on scientific management on the\nother\nKey Takeaways\nKey Points\nScientific management, or Taylorism, is a management theory that analyzes work flows to improve economic efficiency, especially labor\nproductivity. This management theory, developed by Frederick Winslow Taylor, was dominant in manufacturing industries in the 1880s\nand 1890s.\nImportant components of scientific management include analysis, synthesis, logic, rationality, empiricism, work ethic, efficiency,\nelimination of waste, and standardized best practices.\nTaylor and the Gilbreths introduced methods of measuring worker productivity, including time studies and motion studies, which are still\nused today in operations and management.\nKey Terms\nMotion Study: Created by Frank and Lillian Gilbreth, these analyzed work motions by filming workers and emphasized areas for efficiency\nimprovement by reducing motion.\nTaylorism: Scientific management; an early 20th-century theory of management that analyzed workflows in order to improve efficiency.\nTime studies: Created by Frederick Winslow Taylor, these break down each job into component parts and time each part to determine\nthe most efficient method of working.\nScientific Management: An early 20th-century theory that analyzed workflows in order to improve efficiency.\nTaylorism\nScientific management, or Taylorism, is a management theory that analyzes work flows to improve economic efficiency, especially labor\nproductivity. This management theory, developed by Frederick Winslow Taylor, was popular in the 1880s and 1890s in manufacturing\nindustries.\nWhile the terms \"scientific management\" and \"Taylorism\" are often treated as synonymous, an alternative view considers Taylorism to be\nthe first form of scientific management. Taylorism is sometimes called the \"classical perspective,\" meaning that it is still observed for its\ninfluence but no longer practiced exclusively. Scientific management was best known from 1910 to 1920, but in the 1920s, competing\nmanagement theories and methods emerged, rendering scientific management largely obsolete by the 1930s. However, many of the\nthemes of scientific management are still seen in industrial engineering and management today.\nFrederick Winslow Taylor:\nFrederick Winslow Taylor is\nconsidered the creator of scientific\nmanagement.\nImportant components of scientific management include analysis, synthesis, logic, rationality, empiricism, work ethic, efficiency,\nelimination of waste, and standardized best practices. All of these components focus on the efficiency of the worker and not on any\nspecific behavioral qualities or variations among workers.\nToday, an example of scientific management would be determining the amount of time it takes workers to complete a specific task and\ndetermining ways to decrease this amount of time by eliminating any potential waste in the workers' process. A significant part of\nTaylorism was time studies. Taylor was concerned with reducing process time and worked with factory managers on scientific time studies.\nAt its most basic level, time studies involve breaking down each job into component parts, timing each element, and rearranging the parts\ninto the most efficient method of working. By counting and calculating, Taylor sought to transform management into a set of calculated\nand written techniques.\nFrank and Lillian Gilbreth\nWhile Taylor was conducting his time studies, Frank and Lillian Gilbreth were completing their own work in motion studies to further\nscientific management. The Gilbreths made use of scientific insights to develop a study method based on the analysis of work motions,\nconsisting in part of filming the details of a worker's activities while recording the time it took to complete those activities. The films\nhelped to create a visual record of how work was completed, and emphasized areas for improvement. Secondly, the films also served the\npurpose of training workers about the best way to perform their work.\nThis method allowed the Gilbreths to build on the best elements of the work flows and create a standardized best practice. Time and\nmotion studies are used together to achieve rational and reasonable results and find the best practice for implementing new work\nmethods. While Taylor's work is often associated with that of the Gilbreths, there is often a clear philosophical divide between the two\nscientific-management theories. Taylor was focused on reducing process time, while the Gilbreths tried to make the overall process more\nefficient by reducing the motions involved. They saw their approach as more concerned with workers' welfare than Taylorism, in which\nworkers were less relevant than profit. This difference led to a personal rift between Taylor and the Gilbreths, which, after Taylor's death,\nturned into a feud between the Gilbreths and Taylor's followers.\nEven though scientific management was considered background in the 1930s, it continues to make significant contributions to\nmanagement theory today. With the advancement of statistical methods used in scientific management, quality assurance and quality\ncontrol began in the 1920s and 1930s. During the 1940s and 1950s, scientific management evolved into operations management,\noperations research, and management cybernetics. In the 1980s, total quality management became widely popular, and in the 1990s \"re-\nengineering\" became increasingly popular. One could validly argue that Taylorism sent the groundwork for these large and influential\nfields we practice today.\nBureaucratic Organizations: Weber\nWeber's bureaucracy focused on creating rules and regulations to simplify complex procedures in societies and workplaces.\nLearning Objectives\nDefine bureaucratic organization, as theorized by the German sociologist Max Weber\nKey Takeaways\nKey Points\nMax Weber was a member of the classical school of management, and his writing contributed to the field's scientific school of thought.\nHe wrote about the importance of bureaucracy in society.\nWeberian bureaucracy is characterized by hierarchical organization, action taken on the basis of (and recorded in) written rules, and\nbureaucratic officials requiring expert training. Career advancement depends on technical qualifications judged by an organization, not\nindividuals.\nWeber's ideas on bureaucracy stemmed from society during the Industrial Revolution. As Weber understood it, society was being driven\nby the passage of rational ideas into culture, which, in turn, transformed society into an increasingly bureaucratic entity.\nKey Terms\nbureaucracy: A complex means of managing life in social institutions that includes rules and regulations, patterns, and procedures that\nare designed to simplify the functioning of complex organizations.\niron cage: Weber's theory that a bureaucratic society would result in a situation in which it would be impossible to avoid bureaucracy and\nthus society would become increasingly more rational.\nbureaucratic control: Setting standards, measuring actual performance, and taking corrective action through administrative or\nhierarchical techniques such as creating policies.\nMax Weber was a German sociologist, political economist, and administrative scholar who contributed to the study of bureaucracy and\nadministrative literature during the late 1800s and early 1900s. Weber was a member of the classical school of management, and his\nwriting contributed to the field's scientific school of thought. Weber's ideas on bureaucracy stemmed from society during the Industrial\nRevolution. As Weber understood it, particularly during the Industrial Revolution of the late nineteenth century, society was being driven\nby the passage of rational ideas into culture, which, in turn, transformed society into an increasingly bureaucratic entity.\nBureaucracy Defined\nBureaucracy is a complex means of managing life in social institutions that includes rules and regulations, patterns, and procedures that\nare designed to simplify the functioning of complex organizations. An example of bureaucracy would be the forms used to pay income\ntaxes. Specific information and procedures are required to fill them out. Included in those forms, however, are countless rules and laws\nthat dictate what can and cannot be included. Bureaucracy simplifies the process of paying taxes by putting the process into a formulaic\nstructure, but simultaneously complicates the process by adding rules and regulations.\nIRS tax form: An IRS tax form is an\nexample of a complex form.\nBureaucracy in the Workplace\nWeber's theories on bureaucracy included topics such as specialization of the work force, the merit system, standardized principles, and\nstructure and hierarchy in the workplace. In his writings, Weber focused on the idea of a bureaucracy, which differs from a traditional\nmanagerial organization because workers are judged by impersonal, rule-based activity and promotion is based on merit and\nperformance rather than on immeasurable qualities. Weberian bureaucracy is also characterized by hierarchical organization, delineated\nlines of authority in a fixed area of activity, action taken on the basis of (and recorded in) written rules, and bureaucratic officials requiring\nexpert training. In a bureaucracy, career advancement depends on technical qualifications judged by an organization, not individuals.\nWeber's studies of bureaucracy contributed to classical management theory by suggesting that clear guidelines and authority need to be\nset in order encourage an effective workplace. Weber did not see any alternative to bureaucracy and predicted that this would lead to an\n\"iron cage,\" or a situation in which people would not be able to avoid bureaucracy, and society would thus become increasingly more\nrational. Weber viewed this as a bleak outcome that would affect individuals' happiness as they would be forced to function in a highly\nrational society with rigid rules and norms without the possibility to change it. Of course, due to the advent of the behavior-management\nmovement in the 1920s, this bleak situation did not come to pass.\nAdministrative Management: Fayol's Principles\nFayol's approach differed from scientific management in that it focused on efficiency through management training and behavioral\ncharacteristics.\nLearning Objectives\nOutline Fayol's effect on administrative management through the recognition of his 14 management principles\nKey Takeaways\nKey Points\nFayol took a top-down approach to management by focusing on managerial practices to increase efficiency in organizations. His writing\nprovided guidance to managers on how to accomplish their managerial duties and on the practices in which they should engage.\nThe major difference between Fayol and Taylor is Fayol's concern with the \"human\" and behavioral characterisitcs of employees and his\nfocus on training management instead of on individual worker efficiency.\nFayol stressed the importance and the practice of forecasting and planning in order to train management and improve workplace\nproductivity.\nFayol is also famous for putting forward 14 principles of management and the five elements that constitute managerial responsibilities.\nKey Terms\ntop-down: Of or relating to a perspective that progresses from a single, large basic unit to multiple, smaller subunits.\nFayolism: An approach that focused on managerial practices that could minimize misunderstandings and increase efficiency in\norganizations.\nHenri Fayol\nFayol was a classical management theorist, widely regarded as the father of modern operational-management theory. His ideas are a\nfundamental part of modern management concepts.\nComparisons with Taylorism\nFayol is often compared to Frederick Winslow Taylor, who developed scientific management. However, Fayol differed from Taylor in his\nfocus and developed his ideas independently. Taylor was concerned with task time and improving worker efficiency, while Fayol was\nconcerned with management and the human and behavioral factors in management.\nAnother major difference between Taylor and Fayol's theories is that Taylor viewed management improvements as happening from the\nbottom up, or starting with the most elemental units of activity and making individual workers more efficient. In contrast, Fayol\nemphasized a more top-down perspective that was focused on educating management on improving processes first and then moving to\nworkers. Fayol believed that by focusing on managerial practices organizations could minimize misunderstandings and increase efficiency.\nHis writings guided managers on how to accomplish their managerial duties and on the practices in which they should engage. In his\nbook \"General and Industrial Management\" Fayol outlined his theory of general management, which he believed could be applied to the\nadministration of myriad industries. As a result of his concern for workers, Fayol was considered one of the early fathers of the human\nrelations movement.\nHenri Fayol: Henri Fayol\npioneered definitions of\ncontrol for management\nscience.\nFayol's 14 Principles of Management\nFayol developed 14 principles of management in order to help managers conduct their affairs more effectively. Today, these principles are\nstill used but are often interpreted differently. The fourteen principles are as follows:\n1. division of work\n2. delegation of authority\n3. discipline\n4. chain of commands\n5. congenial workplace\n6. interrelation between individual interests and common organizational goals\n7. compensation package\n8. centralization\n9. scalar chains\n10. order\n11. equity\n12. job guarantee\n13. initiatives\n14. team spirit\nFayol's Five Elements of Management\nFayol is also famous for his five elements of management, which outline the key responsibilities of good managers:\nPlanning: Managers should draft strategies and objectives to determine the stages of the plan and the technology necessary to\nimplement it.\nOrganizing: Managers must organize and provide the resources necessary to execute said plan, including raw materials, tools, capital, and\nhuman resources.\nCommand (delegation): Managers must utilize authority and a thorough understanding of long-term goals to delegate tasks and make\ndecisions for the betterment of the organization.\nCoordination: High-level managers must work to integrate all activities to facilitate organizational success. Communication is key to\nsuccess in this component.\nMonitoring: Managers must compare the activities of the personnel to the plan of action; this is the evaluation component of\nmanagement.\nFlaws in the Classical Perspectives\nThe classical approach to management is often criticized for viewing a worker as a mere tool to improve efficiency.\nLearning Objectives\nAssess the comprehensive arguments underlining the flaws in utilizing classical organizational theory perspectives, primarily Taylorism and\nthe scientific method\nKey Takeaways\nKey Points\nUnder Taylorism, the work effort of workers increased in intensity, but eventually workers became dissatisfied with the work environment\nand became angry, decreasing overall work ethic and productivity.\nTaylorism's negative effects on worker morale only added fuel to the fire of existing labor- management conflict and inevitably\ncontributed to the strengthening of labor unions.\nThe criticisms of classical management theory opened doors for theorists such as George Elton Mayo and Abraham Maslow, who\nemphasized the human and behavioral aspects of management.\nThe scientific management approach is also lacking when applied to larger, more operationally complex organizations. Managerial\nefficacy and the empowerment of employees are more important to overall productivity when tasks are not simple and homogeneous.\nKey Terms\nTaylorism: Scientific management; a theory of management of the early 20th century that analyzed workflows in order to improve\nefficiency.\nThe Downside of Efficiency\nThe classical view of management tends to focus on the efficiency and productivity of workers rather than on workers' human needs.\nGenerally the classical view is associated with Taylorism and scientific management, which are largely criticized for viewing the worker as\nmore of a gear in the machine than an individual. Under Taylorism the work effort of workers increased in intensity, but eventually workers\nbecame dissatisfied with the work environment and became angry, which affected their overall work ethic. This dissatisfaction undoes the\nvalue captured via increased efficiency.\nTaylorism's negative effects on worker morale only added fuel to the fire of existing labor-management conflict, which frequently raged\nout of control between the mid-19th and mid-20th centuries (when Taylorism was most influential), and thus it inevitably contributed to\nthe strengthening of labor unions. That outcome neutralized most or all of the benefit of any productivity gains that Taylorism had\nachieved. The net benefit to owners and management ended up being small or negative. It would take new efforts, borrowing some ideas\nfrom Taylorism but mixing them with others, to produce more successful formulas.\nFactory workers: Taylorism and classical management styles\nnegatively affected the morale of workers, which created a negative\nrelationship between workers and managers.\nScientific management also led to other pressures tending toward worker unhappiness. Offshoring and automation are two such\npressures that have led to the erosion of employment. Both were made possible by the deskilling of jobs, which arose because of the\nknowledge transfer that scientific management achieved, whereby knowledge was transferred to cheaper workers, as well as from workers\ninto tools.\nThe Human Factor\nTo summarize, the underlying weakness of the classical view of management is the omission of the fact that employees are people first\nand resources second. This criticism opened doors for theorists such as George Elton Mayo and Abraham Maslow, who emphasized the\nhuman and behavioral aspects of management. After all, what value is wealth if the individual loses the sense of self-worth and happiness\nrequired to enjoy it? The behavioral approach to management took an entirely different approach and focused on managing morale,\nleadership, and other behavioral factors to encourage productivity rather than solely managing the time and efficiency of workers.\nCorporate Growth\nAnother disadvantage of the classical perspective arises from the growing size and complexity of the modern organization. Using metrics\nto examine specific employee behavior may be feasible in a smaller organization pursuing homoegeneous tasks, but it becomes more\ndifficult when trying to accomplish this at an organization that has hundreds of employees pursuing various complex functions. In this\nsituation, it may be more beneficial to use tactics that are less focused on the individual employee and more on improving overall\nproductivity. This will involve less micromanaging and more trusting employees to do the right thing while at the workplace. The onus of\nenabling efficiency, therefore, shifts from workers to managers.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}