{
    "text": "Search... Home Subjects\nBoundless Management\nLeadership\nContingency Approach\nLeadership and Situational Context: Fiedler\nThe Fiedler model shows that effective leadership depends on how a leader's traits and the surrounding context interact.\nLearning Objectives\nAssess the value and efficacy of Fred Fiedler's leadership model\nKey Takeaways\nKey Points\nSituational contingency attests that different circumstances require different leadership traits.\nThe Fieldler model uses the Least Preferred Co-worker (LPC) test to measure leadership traits.\nA favorable situation for a leader has three components: good relations between the leader and follower, a highly structured task, and a\npowerful leadership position.\nKey Terms\nFavorable Situation: Leadership contexts with good leader-member relations, high task structure, and high leader-position power.\nSituational Contingency: The theory that different leaders and leadership traits are required for different situations.\nFred Fiedler's model of leadership states that different types of leaders are required for different situations. This situational contingency\nunderstanding of leaderships suggests, for instance, that a leader in a strict, task-oriented workplace would have different qualities than a\nleader in a more open, idea-driven workplace. Fiedler subsequently enhanced his original model to increase the number of leadership\ntraits it analyzed. This later theory, known as Cognitive Resource Theory (CRT), identifies the conditions under which leaders and group\nmembers will use their intellectual resources, skills, and knowledge effectively.\nLeast Preferred Co-Worker (LPC) Test\nThe Fiedler situational contingency model measures leadership traits with a test that provides a leadership score corresponding to the\nworkplace where the leader would be most suited. The Least Preferred Co-worker (LPC) test asks test takers to think of someone they\nleast prefer working with and rate that person from one to eight on a scale of various traits. For example, the taker is asked to rate the co-\nworker from Unfriendly (1) to Friendly (8), or Guarded (1) to Open (8). The ratings are then averaged. Generally, a higher LPC score means\nthe person being rated is more oriented to human relations, while a lower score means the person is more oriented to tasks.\nThe LPC test is not actually about the co-worker; it is a profile of the test taker. Test subjects who are more oriented to human relations\ngenerally rate their least preferred co-workers higher, and the opposite is true for task-oriented test takers. The LPC test reveals how\nrespondents react to those that with whom they do not like working, and thereby reveals leadership contexts best suited to the test\ntakers' personality.\nLeast Preferred Co-worker (LPC) test:\nThe Least Preferred Co-worker (LPC) test\nreveals more about the test-taker than\nabout the co-worker or the type of work\nthe tester and co-worker did together.\nSituational Context\nThe Fiedler model also analyzes the situation in which the leader functions. The situation analysis has three components:\nLeader-member relations – the amount of respect, trust, and confidence between leaders and their followers\nTask structure – the degree to which group tasks, roles, and processes are specified and formalized\nLeader position power – the amount of formal authority leaders have based on their role within the group\nWhen good leader-member relations, a highly structured task, and high leader-position power are in place, the situation is considered a\n\"favorable situation.\" Fiedler found that low-LPC leaders are more effective in extremely favorable or unfavorable situations, whereas\nhigh-LPC leaders perform best in situations with intermediate favorability. Leaders in high positions of power have the ability to distribute\nresources among their members, meaning they can reward and punish their followers. Leaders with low position power cannot control\nresources to the same extent as leaders with high position power, and so lack the same degree of situational control. For example, the\nCEO of a business has high position power, because she is able to increase and reduce the salary that her employees receive. On the other\nhand, an office worker in this same business has low position power, because although he may be the leader on a new business deal, he\ncannot control the situation by rewarding or disciplining colleagues with salary changes.\nCriticism of the Fielder Model\nFiedler's contingency theory has drawn criticism because it implies that the only option for a mismatch of leader orientation and\nunfavorable situation is to change the leader. Some have disputed the model's validity by questioning how accurately it reflects a leader's\npersonality traits. Also, the contingency model does not take into account the percentage of situations that might be somewhat favorable,\ncompletely unfavorable, or even extremely favorable. For this reason, critics of the model suggest that it does not provide a complete\ncomparison between low-LPC leaders and high-LPC leaders.\nLeadership and Followers: Hersey and Blanchard\nHersey and Blanchard's model defines effective leadership based on leadership style and maturity of follower(s).\nLearning Objectives\nCompare and contrast leadership style characteristics with the follower maturity concepts as defined by Hersey and Blanchard\nKey Takeaways\nKey Points\nThe ideal leadership style varies based on what is required of a group and that group's level of development. The Hersey and Blanchard\nmodel measures this by categorizing leadership style and group (follower) maturity.\nLeadership styles are a mix of task behavior and relationship behavior. There are four combinations of high and low task and relationship\nbehaviors that imply different leadership roles.\nGroup maturity describes how confident group members are in the group's ability to complete its tasks.\nKey Terms\nSituational Leadership: The theory that different leadership styles are required for different contexts.\nTask Behavior: The style of leadership that is concerned with instructing followers what actions to take.\nRelationship Behavior: The style of leadership that is concerned with guiding how people interact, instead of the mechanics of how they\ncomplete the task.\nPaul Hersey and Ken Blanchard introduced their theory of situational leadership in the 1969 book Management of Organizational\nBehavior. Situational leadership states that there is no single, ideal approach to leadership because different types of leadership are\nrequired in different contexts. The Hersey and Blanchard model explains effective leadership in terms of two variables: leadership style\nand the maturity of the follower(s).\nTask Behavior and Relationship Behavior\nFor Hersey and Blanchard, leadership style is determined by the mix of task behavior and relationship behavior that the leader shows. Task\nbehavior concerns the actions required of followers and how they should be conducted. Relationship behavior concerns how people\ninteract together to achieve a goal. The various combinations of high and low task and relationship behaviors suggest four leadership\nroles:\nS1 – Telling: The leader's role is to direct the actions of the followers. The leader instructs the followers on how, what, where, and when to\ndo a certain task. This is primarily task behavior.\nS2 – Selling: The leader is still primarily concerned with directing action but now accepts communication from followers. This\ncommunication allows the followers to feel connected to the task and buy into the mission. S2 leading is still primarily task behavior, but\nnow it includes some relationship behavior.\nS3 – Participating: This role is similar to S2, except now the leader welcomes shared decision -making. Participating leadership shifts the\nbalance toward relationship behavior and away from task behavior.\nS4 – Delegating: The leader simply ensures that progress is being made. Decisions involve a lot of input from the followers, and the\nprocess and responsibility now lie with followers. S4 is primarily relationship behavior.\nMaturity\nThe other fundamental concept in the Hersey and Blanchard model is maturity of the group. Group maturity describes how confident\ngroup members are in the group's ability to complete its tasks. This concept, too, is broken into four categories:\nMaturity levels: In Hersey and Blanchard's model, group maturity is\ndivided into four distinct categories based on how able and willing the\ngroup is to complete the job.\nM1: The group does not have the skills to do the job, and is unwilling or unable to take responsibility. This is a very low maturity level.\nM2: The group is willing to work on the job but not yet able to accept responsibility. Imagine a group of volunteers working on a house\nfor Habitat for Humanity: the volunteers are willing to perform the work, but probably not capable of building a house on their own.\nM3: The group has experience but is not confident enough or willing to take responsibility. The main difference between M2 and M3 is\nthat the M3 group has the skills to work effectively on the job.\nM4: The group is willing and able to work on the job. Group members have all of the skills, confidence, and enthusiasm necessary to take\nownership of the task. This is a very high level of maturity.\nBecause maturity level varies based on the group and the task (for example, professional football players are an M4 group on the football\nfield, but an M1 group if asked to play baseball), the leadership style must adapt based on the situation.\nEffective leadership varies not only with the person or group that is being influenced but also depending on the task, job, or function that\nneeds to be accomplished. The Hersey and Blanchard model encourages leaders to be flexible and find the right style for the task and the\ngroup maturity level. The most successful leaders are those who adapt their leadership style to the maturity of the group they are\nattempting to lead or influence and to that group's purpose.\nLeadership and Task/Follower Characteristics: House\nThe Path-Goal theory argues that a leader's role is to help followers achieve both personal and organizational goals.\nLearning Objectives\nIdentify the leadership and task/follower characteristics identified by Robert House in the Path-Goal theory (1971)\nKey Takeaways\nKey Points\nIn the Path- Goal model as defined by House, the role of the leader is to help followers define personal goals, understand organizational\ngoals, and find a path to reach both.\nHouse defined four leadership styles: directive, achievement -oriented, participative, and supportive.\nOutstanding Leadership Theory is an extension of the Path-Goal model that adds leadership behaviors required to channel follower\nmotivations and goals toward the leader's vision.\nKey Terms\nPath-Goal theory: A leadership model outlining the role of the leader as helping followers define personal and organizational goals and\nfind a path to reach those goals.\nOutstanding Leadership Theory: A model that defines ten traits that exceptional leaders possess; an expansion of the Path-Goal model.\nIn 1971, Robert House introduced his version of a contingent theory of leadership known as the Path-Goal theory. According to House's\ntheory, leaders' behavior is contingent upon the satisfaction, motivation, and performance of their subordinates. House argued that the\ngoal of the leader is to help followers identify their personal goals as well understand the organization 's goals and find the path that will\nbest help them achieve both. Because individual motivations and goals differ, leaders must modify their approach to fit the situation.\nLeadership Styles\nHouse defined four different leadership styles and noted that good leaders switch fluidly between them as the situation demands. He\nbelieved that leadership styles do not define types of leaders as much as they do types of behaviors. House's leadership styles include:\nDirective, path-goal clarifying leader: The leader clearly defines what is expected of followers and tells them how to perform their tasks.\nThe theory argues that this behavior has the most positive effect when the subordinates' role and task demands are ambiguous and\nintrinsically satisfying.\nAchievement-oriented leader: The leader sets challenging goals for followers, expects them to perform at their highest level, and shows\nconfidence in their ability to meet this expectation. Occupations in which the achievement motive was most predominant were technical\njobs, salespersons, scientists, engineers, and entrepreneurs.\nParticipative leader: The leader seeks to collaborate with followers and involve them in the decision-making process. This behavior is\ndominant when subordinates are highly personally involved in their work.\nSupportive leader: The main role of the leader is to be responsive to the emotional and psychological needs of followers. This behavior is\nespecially needed in situations in which tasks or relationships are psychologically or physically distressing.\nThe Path-Goal model emphasizes the importance of the leader's ability to interpret follower's needs accurately and to respond flexibly to\nthe requirements of a situation.\nOutstanding Leadership Theory (OLT)\nIn 1994, House published Organizational Behavior: The State of the Science with Philip Podsakoff. House and Podsakoff attempted to\nsummarize the behaviors and approaches of \"outstanding leaders\" that they obtained from some more modern theories and research\nfindings. Using the Path-Goal model as a framework, their Outstanding Leadership Theory (OLT) expanded the list of leadership behaviors\nrequired to channel follower's motivations and goals more effectively toward the leader's vision:\nVision: Leaders are able to communicate a vision that meshes with the values of their followers.\nPassion and self-sacrifice: Leaders believe fully in their vision and are willing to make sacrifices in order to achieve it.\nConfidence, determination, and persistence: Leaders are confident their vision is correct and take whatever action is necessary to reach it.\nImage-building: Leaders are cognizant of how they are perceived by their followers. They strive to ensure followers view them in a positive\nlight.\nRole-modeling: Leaders seek to model qualities such as credibility and trustworthiness that their followers would seek to emulate.\nExternal representation: Leaders are spokespersons for their organizations (for example, Steve Jobs).\nExpectations of and confidence in followers: Leaders trust that their followers can succeed and expect them to do so.\nSelective motive-arousal: Leaders are able to hone in on specific motives in followers and use them to push their followers to reach a goal.\nFrame alignment: Leaders align certain interests, values, actions, etc. between leadership and followers to inspire positive action.\nInspirational communication: Leaders are able to inspire followers to act using verbal and non-verbal communication.\nLeadership and Decision Making: The Vroom-Yetton-Jago Model\nThe Vroom-Yetton-Jago model is a leadership theory of how to make group decisions.\nLearning Objectives\nApply the Vroom-Jago decision-tree model to guide leaders in a decision-making situation\nKey Takeaways\nKey Points\nDifferent tasks and situations require leaders to make different types of decisions.\nThere are five different approaches to making group decisions according to the degree and type of follower participation.\nThe Vroom-Yetton-Jago model employs a decision tree for determining the right mode of decision making under different conditions.\nKey Terms\nContingency Approach: A school of thought on leadership that proposes that there is no single ideal leader or leadership style. Also\nknown as situational leadership.\ndecision tree: A visualization of a complex decision-making situation in which the possible choices and their likely outcomes are\norganized in the form of a graph.\nautocratic : Conducted alone and with sole responsibility.\nThe Vroom-Yetton-Jago model is a contingency approach to group decision making that is designed specifically to help leaders select the\nbest approach to making decisions. The model identifies different ways a decision can be made by considering the degree of follower\nparticipation. It proposes a method for leaders to select the right approach to making a decision in a given set of circumstances.\nDecision Types\nThe Vroom-Yetton-Jago model defines five different decision approaches that a leader can use. In order of participation from least to\nmost, these are:\nAI – Autocratic Type 1: Decisions are made completely by the leader. Leaders make the decision on their own with whatever information is\navailable.\nAII – Autocratic Type 2: The decision is still made by the leader alone, but the leader collects information from the followers. Followers play\nno other role in the decision-making process.\nCI – Consultative Type 1: The leader seeks input from select followers individually based on their relevant knowledge. Followers do not\nmeet each other, and the leader's decision may or may not reflect followers' influence.\nCII – Consultative Type 2: Similar to CI, except the leader shares the problem with relevant followers as a group and seeks their ideas and\nsuggestions. The followers are involved in the decision, but the leader still makes the decision.\nGII – Group-based Type 2: The entire group works through the problem with the leader. A decision is made by the followers in\ncollaboration with the leader. In a GII decision, leaders are not at liberty to make a decision on their own.\nDecision Trees\nThe Vroom-Yetton-Jago model also provides guidance for leaders trying to determine which approach to decision making to use (AI\nthrough GII). The model uses a decision-tree technique to diagnose aspects of the situation methodically. This technique involves\nanswering a series of yes or no questions and following the yes path to the recommended type of decision-making approach.\nDecision tree: This is an example of a decision tree.\nOne decition (go on vacation) leads to further\ndecisions (whether to go to Europe, visit family, or go\ncamping), all of which lead to another tier of decisions.\nThe Vroom-Yetton-Jago model utilizes decision trees\nto determine the best leadership style for a given\nsituation.\nIs there a quality requirement? Is the nature of the solution critical? Are there technical or rational grounds for selecting among possible\nsolutions?\nDo I have sufficient information to make a high-quality decision?\nIs the problem structured? Are the alternative courses of action and methods for their evaluation known?\nIs acceptance of the decision by subordinates critical to its implementation?\nIf I were to make the decision by myself, is it reasonably certain that it would be accepted by my subordinates?\nDo my subordinates share the organizational goals to be met by solving this problem?\nIs conflict among subordinates likely in obtaining the preferred solution?\nBy answering the questions honestly, the decision tree provides the leader with the preferred decision style for the given situation.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}