{
    "text": "Search... Home Subjects\nBoundless Management\nEthics in Business\nCorporate Social Responsibility\nIntroduction to Corporate Social Responsibility\nCorporate social responsibility is a company's sense of obligation towards social and physical environments in which it operates.\nLearning Objectives\nExplain the purpose and types of corporate social responsibility\nKey Takeaways\nKey Points\nCorporate social responsibility (CSR) can be described as embracing responsibility and encouraging a positive impact through the\ncompany's activities related to the environment, consumers, employees, communities, and other stakeholders.\nCorporate social responsibility may include philanthropic efforts, employee volunteering, and core strategies. Companies may benchmark\ntheir CSR performance relative to peers and may also report on CSR policies or undergo social audits.\nProponents of CSR argue that socially responsible practices can have a positive impact on the bottom line and may also argue for the\nrecognition of a \"triple bottom line\" that rewards social, environmental, and financial returns.\nCritics argue that CSR competes with shareholder value maximization and may be prone to \"greenwashing\".\nKey Terms\nbenchmark: A standard by which something is evaluated or measured.\nshareholder: One who owns shares of stock in a business.\nstakeholder: A person or organization with a legitimate interest in a given situation, action, or enterprise.\nCorporate Social Responsibility (CSR), also referred to as corporate citizenship or socially responsible business, is a form of corporate self-\nregulation integrated into a business model. The interest in CSR has grown with the spread of socially responsible investing, the attention\nof nongovernmental organizations (NGOs), and ethics training within organizations. Recent incidents of ethics-based corporate scandals\nhave also increased awareness of CSR. Organizations that embrace CSR hold themselves accountable to others for their actions and seek\nto make a positive impact on the environment, their communities, and the larger society.\nCorporate social responsibility may include philanthropic efforts such as charitable donations or programs that encourage employee\nvolunteerism by providing paid time off for such activities. Many organizations seek to have an even greater impact through CSR\ninitiatives that integrate social values into operational and business strategies. For example, to protect scarce natural resources, a firm may\nmake a commitment to use only recycled materials in its packaging of consumer goods.\nMany organizations promote their CSR efforts as a way of shaping public perceptions, attracting customers, and building good will with\nstakeholders. Public companies often report CSR policies and activities in their annual reports; some create separate documents or use\ntheir websites to describe and publicize their CSR-related efforts. Organizations and interested external third parties assess CSR\nperformance by comparing, or benchmarking, the activities and their results with competitors or other sets of organizations. Measures\ninclude amount of expenditures or investment, degree of executive engagement, impact of implementation, and CSR outcomes relative to\nobjectives.\nGreen building: This company building in the UK\nwas created from green materials.\nThe scale and nature of the benefits of CSR to an organization can be difficult to quantify. Those driven by strategic and operational\nchoices may result in higher or lower costs, but directly linking CSR initiatives to revenue increases is not always possible. Many\norganization use non-financial measures to assess the benefits of CSR. For example, socially responsible practices can improve employee\nrecruitment and retention efforts, be a means of managing risk, and provide brand differentiation. Some business critics of CSR, however,\nargue that too often it competes with a duty to maximize shareholder value. Others cast the CSR efforts of companies as \"greenwashing\"\nefforts to draw attention away from unpopular practices such as polluting the environment or outsourcing jobs overseas.\nArguments for and against Corporate Social Responsibility\nMost arguments both for and against CSR are based on how a company's attempts to be socially responsible affect its bottom line.\nLearning Objectives\nContrast the views in favor of and opposing corporate social responsibility\nKey Takeaways\nKey Points\nProponents of corporate social responsibility (CSR) argue that socially responsible practices can have a positive impact on the bottom line.\nWhile some evidence links CSR to financial performance, its proponents also point to non-financial rewards as well as to benefits to the\nenvironment and social welfare.\nSome critics see CSR as unrelated to the primary aim of the business: making a profit for its shareholders.\nCritics may also see some CSR efforts as attempts at public manipulation or greenwashing.\nKey Terms\nshareholder: One who owns shares of stock in a business.\nbottom line: The final balance; the amount of money or profit left after everything has been tallied.\nCorporate social responsibility, also referred to as CSR, can be described as embracing responsibility for a company's actions and\nencouraging a positive impact through its activities on the environment, consumers, employees, communities, and other stakeholders.\nCorporate social responsibility (CSR): CSR refers to\nthe practice of companies integrating ethical, social,\nenvironmental, and other global issues into their\nbusiness operations and in their interaction with\ntheir stakeholders (employees, customers,\nshareholders, investors, local communities,\ngovernment).\nWhile some evidence links CSR practices to business performance, most organizations point to the non-financial benefits of their efforts.\nProponents of CSR argue that socially responsible practices can have a positive impact on the organization by improving employee\nrecruitment and retention, managing environmental risks by reducing harmful accidents, and differentiating brand to achieve greater\nconsumer loyalty. CSR proponents may also argue for the recognition of a \"triple bottom line\" performance that includes not only\nfinancial returns for owners but also social and environmental benefits for the greater society.\nMilton Friedman and other conservative critics have argued against CSR, stating that a corporation's purpose is to maximize returns to its\nshareholders (or shareholder value) and that it does not have responsibilities to society as a whole. Part of the critics' argument is that\nmanagers should not select social causes on behalf of a diverse set of owners. Rather, CSR opponents believe that corporations benefit\nsociety best by distributing profits to owners, who can then make charitable donations or take other socially responsible actions as they\nsee fit.\nOther critics, rather than targeting the concept of CSR, point to examples of weak CSR programs. For example, the term greenwashing\nrefers to instances where businesses have spent significantly more resources advertising being \"green\" (that is, operating with\nconsideration for the environment) than investing in the environmentally sound practices themselves. Critics view these as misleading,\neven cynical, attempts to shape public perception about a company without its actually having to benefit the environment.\nSocial Responsibility Audits\nSocial responsibility audits are a process of evaluating a corporation's social responsibility performance.\nLearning Objectives\nApply the general concept of auditing to the larger framework of social responsibility within organizations\nKey Takeaways\nKey Points\nSocial responsibility audits rely on a process of accounting known by various names, including social accounting, sustainability\naccounting, corporate social responsibility (CSR) reporting, environmental and social governance (ESG) reporting, and triple-bottom-line\naccounting.\nMost social, environmental, and sustainability reports are produced voluntarily by corporations themselves and are not held to the same\nexternal standards as financial reporting. The practice of hiring independent social responsibility audit firms, however, is growing.\nLittle consensus exists about how to define and use metrics of social performance, making social audits different from financial audits, for\nwhich there are generally accepted standards.\nKey Terms\naudit: An independent review of records and activities to assess system controls, to ensure compliance with established policies and\nprocedures, and to recommend changes in controls, policies, or procedures.\nresponsibility: A duty, obligation, or liability for which someone is held accountable.\nAn audit is a systematic independent examination of data, statements, records, operations, and performance (financial or otherwise) of a\nprocess or enterprise for a stated purpose. The purpose of an audit is to provide third-party assurance to various stakeholders that the\nsubject matter is free from material misstatement and represents a true and accurate depiction of actions and events. Areas of business\nthat are commonly audited include financial performance, internal controls, quality management, project management, water\nmanagement, and energy conservation.\nSocial responsibility audits are a process of reviewing and evaluating a corporation's social responsibility (CSR) performance. As with\nfinancial audits, social responsibility audits involve accounting processes. This type of accounting originated in the early 1990s and is\nknown by various names, including social accounting, sustainability accounting, CSR reporting, environmental and social governance\n(ESG) reporting, and triple-bottom-line accounting (encompassing social and environmental as well as financial reporting). Social\naccounting is the process of communicating the social and environmental effects of an organization 's economic actions to particular\ninterest groups within society—including investors, customers, and NGOs—as well as to society at large.\nIn most countries, existing legislation regulates only a fraction of accounting for socially relevant corporate activity. In consequence, most\nsocial, environmental, and sustainability reports are produced voluntarily by corporations themselves and are not held to the same legal\nstandards as financial reporting, for example. Organizations may also hire external firms to conduct CSR audits; these often have more\ncredibility than an internally generated report. Having third-party groups conduct social audits is one way that corporations are held\naccountable for their CSR performance.\nLittle consensus exists about the definition and use of metrics to evaluate social impact. The lack of clearly defined standards makes social\naudits different from financial audits, for which there are generally accepted standards. Environmental-related accounting might address\npollution emissions, resources used, or wildlife habitats damaged or re-established. Social aspects considered might include worker\nconditions or community investment. An audit for economic and governance responsibilities might look at transparency and the use of\npractices such as independent board members and separation of the roles of CEO and board chairman.\nFactory workers in 1920s: One metric that might be tested in a\nsocial responsibility audit is worker conditions in the company's\nplants.\nTypes of Social Responsibility: Sustainability\nOne type of corporate social responsibility focuses on three key dimensions of sustainability—environmental, social, and economic.\nLearning Objectives\nKey Takeaways\nKey Points\nSustainability generally refers to a company's capacity to endure over the long term through renewal, maintenance, and sustenance. From\nan organizational perspective, it includes stewardship for sustaining not just the organization but also its various stakeholders.\nWhile a universally accepted definition of sustainability remains elusive, according to a common definition, sustainability has three key\ndimensions: environmental, social, and economic.\nTracking sustainability measures can be performed through sustainability accounting, in which a corporation discloses its performance\nwith respect to activities directly affect the social, environmental, and economic performance of an organization.\nEnvironmental aspects can relate to water, land, and atmospheric impact, including energy and chemical use. Social sustainability can\ninclude human and worker rights and community issues. Economic aspects can include financial transparency and accountability and\ncorporate governance.\nKey Terms\nstewardship: The act of caring for or improving with time.\nimpact: A significant or strong influence; an effect.\nMany efforts to show corporate social responsibility, or CSR, focus on environmental, social, and economic sustainability. Sustainability is\nthe capacity to endure over the long term through renewal, maintenance, and sustenance. From an organizational perspective,\nsustainability is a criteria used to make decisions about business conduct and to evaluate outcomes.\nEnvironmental sustainability involves efforts to protect air, water, and land from any harmful effects. It also encompasses stewardship for\nnatural resources, such as trees and wildlife. Sustainable business practices consider not only the use of resources in production, but also\nthe assurance that those resources can be replenished for future use. Energy is another area of interest in environmental sustainability.\nReducing greenhouse gasses harmful to the atmosphere and embracing alternative, renewable fuel sources such as wind and energy are\nexamples of business practices in this area.\nThe social dimension of sustainability addresses concerns such as peace and social justice. Efforts to improve education, to expand worker\nrights, to minimize the use of child labor, and to increase the political empowerment of women, especially in developing countries, are\nexamples of social sustainability practices. Reducing poverty by helping people develop the skills to earn their own livelihoods is another\nexample of social sustainability. Projects that provide access to clean water and sanitation are also aimed at improving social sustainability\nby reducing illness and mortality rates.\nEconomic sustainability refers to business practices that do not diminish the prospects of future persons to enjoy levels of consumption,\nwealth, utility, or welfare comparable to those enjoyed in the present. This means companies' operational practices reduce environmental\ndamage and resource depletion. Efforts to influence business practices toward economic sustainability include pricing mechanisms, such\nas carbon taxes, that pass on the cost of environmental impact to the users of those resources.\nTracking sustainability measures can be performed using sustainability accounting, in which a corporation discloses its performance with\nrespect to activities that have a direct impact on the societal, environmental, and economic performance of an organization. According to\ncommon definitions, sustainability has three key dimensions: environmental, social, and economic. The three pillars—also known as the\n\"triple bottom line\"—have served as a common ground for numerous sustainability standards and certification systems in recent years,\nthough a universally accepted definition of sustainability remains elusive.\nTriple bottom line: Sustainable design of a business can be an aspect\nof corporate social responsibility.\nTypes of Social Responsibility: Philanthropy\nPhilanthropic corporate social responsibility involves donating funds, goods, or services.\nLearning Objectives\nDescribe philanthropy through the lens of corporate social responsibility\nKey Takeaways\nKey Points\nPhilanthropic corporate social responsibility involves donating funds, goods, or services to another organization or cause. For example,\nthe local branch of a bank might donate money to fund the purchase of uniforms for a school sports team, or a health care company\nmight donate to the city opera.\nSome critique organizational philanthropy for not being incorporated directly into an organization's core business plan. Philanthropic\nactivity is not always tracked as part of social accounting, making it difficult for these efforts to be audited or held accountable to external\nbenchmarks.\nCorporations increasingly hold charities accountable for the use of donations and for measuring performance relative to their mission.\nKey Terms\ncore: The most important part of a thing; the essence.\nimpact: A significant or strong influence; an effect.\nA company that practices corporate social responsibility (CSR) embraces responsibility for its actions and, through its activities, positively\naffects the environment, society, consumers, employees, communities, and other stakeholders. One type of CSR is philanthropic giving.\nThe roots of corporate philanthropy in the United States date back to the rise of industry in the 19th and early 20th century, when\npioneering businessmen like Henry Ford and John D. Rockefeller established a number of philanthropic foundations. Today, corporate\nphilanthropy can involve donating funds, goods, or services to another organization or cause. For example, the local branch of a bank\nmight donate money to fund the purchase of uniforms for a school sports team, or a health care company might donate to the city opera.\nCorporate social responsibility: CSR pertains\nto the positive effects a company's operations\nhave on the environment, consumers, and\nsociety at large.\nWhile individual philanthropists use their own resources to change the world for the better according to their interests, corporate\nphilanthropy directs organizational resources to support a worthy cause or address a societal need. The practice is not without its critics;\nsome complain that philanthropic CSR is not directly related to an organization's core business. For instance, many large arts\norganizations receive funding from corporations in completely different industries simply because their executives happen to love music\nand wish to support a local symphony. Although philanthropic CSR may provide public relations or branding advantages to a business,\nthese benefits are difficult to measure and track.\nA business's philanthropic activity does not occur without oversight. Since the early 2000's, corporations have sought to hold charities\naccountable for how they use donations. As a result, many nonprofit groups have adopted business practices for measuring their own\nperformance. In this way, these beneficiaries of philanthropy demonstrate both a responsible use of the funds they have received and\nevidence of their performance relative to their mission. Companies engaging in philanthropic CSR can then use those results to measure\nthe impact of their own efforts to support social causes.\nTypes of Social Responsibility: Ecocentric Management\nAccording to the ecocentric model of CSR, environmental protection and sustainability are more important than economic or social\nbenefits.\nLearning Objectives\nExplain the concept of ecocentric corporate social responsibility and how it relates to other forms of CSR\nKey Takeaways\nKey Points\nEcocentric CSR seeks to protect and improve the quality of the natural environment, regardless of the economic benefits to an\norganization.\nEcocentric CSR reflects an organization's commitment to the environment as the primary core value for conducting business.\nAs a core business activity, ecocentric management may also incorporate life-cycle assessment, a technique aimed at assessing the\nenvironmental impacts associated with all stages of a product's life, from raw material extraction to disposal or recycling.\nKey Terms\necology: The branch of biology dealing with the relationships of organisms with their environment and with each other.\nCorporate social responsibility, also referred to as CSR, can be described as a business's efforts to assume responsibility for its actions and\nto encourage a positive impact through its activities on the environment, consumers, employees, communities, and other stakeholders.\nEcocentric management is one type of CSR that adopts a deeply ecological view of business.\nEmerging Values: Environmentalism\nand Green Energy: Image of an\nenergy plant.\nThe ecocentric model differs from more human-centered interpretations of sustainability or responsibility. \"Deep\" ecology is a form of\nenvironmentalism that seeks to protect and improve the quality of the natural environment. It values environmental good above\neconomic or even social benefits. For this reason, ecocentric CSR activities, more than any other type of CSR efforts, are not expected to\nprovide business benefits. Instead, they reflect an organization's commitment to the environment as the primary core value for\nconducting business.\nEcocentric supporters believe that low-impact technology and self-reliance are more desirable than technological control over nature. As\na result, the ecocentric manager may argue against using ecologically damaging products, such as pesticides and nuclear power, even if\nthese products benefit people. In this way, the ecocentric approach contrasts with that of a more traditional CSR environmental\nsustainability, which seeks to maintain economic performance while reducing the impact of those products or making parallel investments\nin alternatives.\nEcocentric CSR activities are typically integrated with business operations. For example, they may incorporate life-cycle assessment, a\ntechnique aimed at assessing the environmental impacts associated with all the stages of a product's life, from raw material extraction\nthrough materials processing, manufacture, distribution, use, repair and maintenance, and disposal or recycling. The more\nenvironmentally harmful stages can be identified and targeted for improvement so that every part of the value chain demonstrates the\nparamount importance of ecocentric CSR.\nThe Financial Value of Social Responsibility\nCSR provides a financial return in the form of lower costs, higher revenue, and returns to investors.\nLearning Objectives\nDiscuss the argument that the short-term costs of social responsibility generate long-term revenues exceeding those costs\nKey Takeaways\nKey Points\nEvidence links socially responsible business practices to improved financial performance.\nSocially focused investors also see a financial return in socially responsible business practices, pointing to competitive returns for socially\nresponsible indices and to the belief in returns from investing in a company's long-term potential to compete and succeed.\nThe shared value model takes a long-term view on financial return of corporate social responsibility (CSR), maintaining that the\ncompetitiveness of a company and the health of the communities around it are mutually dependent.\nKey Terms\nshared value model: Idea that corporate success and social welfare relate; that a company succeeds and competes in a better society\nbecause it needs a healthy, educated workforce and sustainable resources.\ntriple bottom line: A means of measuring a company's success based on its economic returns, its effect on its environment, and its\nimpact on the community.\nexternalities: Something that indirectly affects something else. In economics, a cost or benefit that is not captured in the price\nmechanism.\nEvidence links socially responsible business practices to improved financial performance. This is attributable to lower costs or increased\nrevenue from customers who want to support business that reflects their personal values. An organization 's CSR practices might also\nincrease employee loyalty, which lowers the cost of turnover; it also helps attract potential employees willing to work for less for a\ncompany whose values they share. Some CSR actions, such as investing in renewable energy, can provide tax benefits or lead to\ntechnology innovations that create competitive advantage.\nHarvard professors Michael Porter and Mark Kramer introduced the notion of \"creating shared value\" (CSV) as a way of thinking about the\nbenefits of corporate social responsibility. CSV is based on an idea that the competitiveness of a company and the health of the\ncommunities around it are mutually dependent. By focusing on creating shared value, an organization helps to shape the context in which\nit competes to its advantage. In this way, the shared value model takes a long-term perspective on the financial benefits of corporate\nsocial responsibility.\nOther financial benefits from CSR accrue directly to shareholders. Socially conscious investors may prefer to own shares of a company that\ndemonstrates good CSR, which can lead to higher share prices. Some mutual funds have portfolios exclusively made up of companies that\nrate highly on independent CSR measures. Proponents of these funds point to competitive returns for socially responsible indices, such as\nthe Domini 400 (now the MSCI KLD 400). Similarly, academic studies have shown that excluding stocks from companies with poor CSR\nrecords does not adversely effect financial returns of a fund.\nCorporate social responsibility: The benefits a\ncompany obtains from having a strong community\nand healthy environment may not generally be\nexpressed in dollars, but these elements do have a\nfinancial impact on a business.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}