{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nEmployee Needs and Motivation\nMaslow's Hierarchy of Needs\nMaslow's Hierarchy of Needs helps managers understand employees' needs in order to further employees' motivation.\nLearning Objectives\nDiagram Maslow's Hierarchy of Needs in the context of organizational motivation and employee behaviors\nKey Takeaways\nKey Points\nMaslow is best known for his theory, the Hierarchy of Needs. Depicted in a pyramid, the theory explains the different levels and\nimportance of human psychological and physical needs. It can be used by business managers to better understand employee motivation.\nThe general needs in Maslow's hierarchy include physiological needs (food and clothing), safety needs (job security), social needs\n(friendship), self- esteem, and self-actualization.\nMaslow's Hierarchy of Needs relates to organizational theory and behavior due to it's exploration of worker motivation, enabling better\nmanagerial practices and higher job satisfaction.\nManagers must be perceptive and empathetic to their employees—they must listen to what their employees' needs are and work to fulfill\nthem.\nKey Terms\nself-actualization: The final level of psychological development, which can be achieved when all basic and mental needs are fulfilled.\nAbraham Maslow was a social psychologist who focused on the entirety of human psychological needs rather than on individual\npsychological problems. Maslow is best known for his theory, the Hierarchy of Needs. Depicted in a pyramid, the theory explains the\ndifferent levels of importance of human psychological and physical needs.\nThe general needs in Maslow's hierarchy include physiological needs (food and clothing), safety needs (job security), social needs\n(friendship), self-esteem, and self-actualization. Maslow's Hierarchy of Needs can be used by managers to better understand employees'\nneeds and motivations, allowing them to best provide for employees' needs and generate high productivity and job satisfaction.\nThe Hierarchy of Needs: Levels of the Pyramid\nMaslow's Hierarchy of Needs: Each level of Maslow's\nhierarchy outlines a specific category of need, each of\nwhich must be accomplished in a bottom-up order.\nManagers should correlate their managerial style with\nthe needs of their employees.\nAt the bottom of the pyramid are the physiological (or basic) needs of a human being: food, water, sleep, and sex. The next level is safety\nneeds: security, order, and stability. These two levels are important to the physical survival of the person. Once individuals have basic\nnutrition, shelter, and safety, they attempt to accomplish more.\nThe third level of need is love and belonging, which are psychological needs; when individuals have taken care of themselves physically,\nthey are ready to share themselves with others, such as with family and friends. The fourth level is achieved when individuals feel\ncomfortable with what they have accomplished. This is the esteem level, which includes the need to feel competent and recognized, such\nas through status and level of success. Then there is the cognitive level, where individuals intellectually stimulate themselves and explore.\nAfter that is the aesthetic level, which includes the need for harmony, order, and beauty.\nAt the top of the pyramid, self-actualization occurs when individuals reach a state of harmony and understanding because they have\nachieved their full potential. Once people have reached the self-actualization stage they focus on themselves and try to build their own\nimage. They may look at this in terms of feelings such as self-confidence, or by accomplishing a set goal.\nHierarchy of Needs and Organizational Theory\nMaslow's Hierarchy of Needs relates to organizational theory and behavior because it explores a worker's motivation. For example, some\npeople are prepared to work just for money, but others like going to work because of the friends they have made there or the fact that\nthey are respected by others and recognized for their good work. One conclusion that can be made from Maslow's Hierarchy of Needs in\nthe workforce is, \"If a lower need is not met, then the higher ones are ignored.\" For example, if employees are worried that they will be\nfired, and have no job security, they will be far more concerned about capital accumulation and ensuring their lower rungs can continue\nto be met (paying rent, paying bills, etc.) than about friendship and respect at work. However, if employees are wealthy enough to fulfill\ntheir basic needs, praise for good work and meaningful group relationships may be a more important motivation.\nIf a need is not met, staff may become very frustrated. For example, if someone works hard for a promotion and does not achieve the\nrecognition they want, they may become demotivated and put in less effort. When a need is met it will no longer motivate the person, but\nthe next need in the hierarchy will become important to that person. Keep in mind that it is not quite as simple in reality as in a model,\nand that individuals may have needs that are more complex or difficult to quantify than the hierarchy suggests. Managers must be\nperceptive and empathetic to their employees, they must listen to what their needs are and work to fulfill them.\nAlderfer's ERG Theory\nAlderfer's ERG theory, based on Maslow's Hierarchy of Needs, outlines three core needs: existence, relatedness, and growth.\nLearning Objectives\nDiscuss Clayton Alderfer's ERG Theory relative to employee needs and motivation within an organization\nKey Takeaways\nKey Points\nERG Theory posits that there are three groups of core needs: existence (E), relatedness (R), and growth (G)—hence the acronym \"ERG\".\nThese groups align with the levels of Maslow's Hierarchy of Needs.\nThe \"existence\" needs describe our basic material requirements for living.\nThe \"relatedness\" needs concern the maintaining of important interpersonal relationships.\nThe \"growth\" needs relate to self-actualization and self-esteem.\nAlderfer also proposed that if an individual's needs in a certain category are not met, then they will redouble their efforts toward fulfilling\nneeds in a lower category.\nKey Terms\nexistence: The state of being or occurring.\nrelatedness: The state of being connected, especially by kinship.\nClayton Paul Alderfer (b. 1940) is an American psychologist who further developed Maslow's Hierarchy of Needs into his own ERG Theory.\nERG Theory posits that there are three groups of core needs: existence (E), relatedness (R), and growth (G)—hence the acronym \"ERG.\"\nThese groups align with the Maslow's levels of physiological needs, social needs, and self-actualization needs, respectively.\nThe \"existence\" needs describe our basic material requirements for living. These include what Maslow categorized as physiological needs\n(such as air, food, water, and shelter) and safety-related needs (such as health and secure employment and property).\nThe \"relatedness\" needs concern the maintaining of important interpersonal relationships. These needs are based in social interactions\nwith others and align with Maslow's levels of love/belonging-related needs (such as friendship, family, and sexual intiamcy) and esteem-\nrelated needs (such as respect of and by others).\nFinally, the \"growth\" needs describe our intrinsic desire for personal development. These needs align with Maslow's levels of esteem-\nrelated needs (such as self-esteem, confidence, and achievement) and self-actualization needs (such as morality, creativity, problem-\nsolving, and acceptance of facts).\nAlderfer proposed that if an individual's needs in a certain category are not met, then they will redouble their efforts toward fulfilling\nneeds in a lower category. For example, if an individual's self-esteem is suffering, they will invest more effort in the relatedness category\nof needs.\nMcClelland's Need Theory\nDavid McClelland describes three central motivational paradigms: achievement, affiliation and power.\nLearning Objectives\nExamine what McClelland's Need Theory proposes regarding motivating employees and fulfilling their needs\nKey Takeaways\nKey Points\nMcClelland's Need Theory, created by psychologist David McClelland, is a motivational model that attempts to explain how the needs for\nachievement, power, and affiliation affect people's actions in a management context.\nPeople who are achievement-motivated are driven by the desire to master tasks and situations.\nPeople who are affiliation-motivated are driven by the desire to create and maintain social relationships. They enjoy belonging to a group\nand want to feel loved and accepted.\nPeople who are power-motivated are driven by the desire to influence, teach, or encourage others.\nEach individual is motivated by varying degrees of each of these three categories of needs.\nKey Terms\nzero-sum: Of any system in which all gains are offset by exactly equal losses.\nachievement: The act of performing, obtaining, or accomplishing.\naffiliation: The relationship that results from combining one thing with another.\nPsychologist David McClelland developed Need Theory, a motivational model that attempts to explain how the needs for achievement,\npower (authority), and affiliation affect people's actions in a management context. Need Theory is commonly often taught in\nmanagement and organizational-behavior classes.\nDavid McClelland: Psychologist David\nMcClelland created Need Theory.\nAchievement\nPeople who are strongly achievement-motivated are driven by the desire for mastery. They prefer working on tasks of moderate difficulty\nin which outcomes are the result of their effort rather than of luck. They value receiving feedback on their work.\nAffiliation\nPeople who are strongly affiliation-motivated are driven by the desire to create and maintain social relationships. They enjoy belonging to\na group and want to feel loved and accepted. They may not make effective managers because they may worry too much about how\nothers will feel about them.\nPower\nPeople who are strongly power-motivated are driven by the desire to influence, teach, or encourage others. They enjoy work and place a\nhigh value on discipline. However, they may take a zero-sum approach to group work—for one person to win, or succeed, another must\nlose, or fail. If channeled appropriately, though, this can positively support group goals and help others in the group feel competent\nabout their work.\nApplication of Need Theory\nNeed Theory does not claim that people can be categorized into one of three types. Rather, it asserts that all people are motivated by all\nof these needs in varying degrees and proportions. An individual's balance of these needs forms a kind of profile that can be useful in\ndetermining a motivational paradigm for them. It is important to note that needs do not necessarily correlate with competencies; it is\npossible for an employee to be strongly affiliation-motivated, for example, but to still be successful in a situation in which his affiliation\nneeds are not met.\nMcClelland proposes that those in top management positions should have a high need for power and a low need for affiliation. He also\nbelieves that although individuals with a need for achievement can make good managers, they are not generally suited to being in top\nmanagement positions.\nHerzberg's Two-Factor Theory\nHerzberg's Two-Factor Theory states that certain factors cause job satisfaction and other factors cause dissatisfaction.\nLearning Objectives\nAnalyze Frederick Herzberg's perspective on motivating employees through his Two-Factor Theory (also known as Motivation-Hygiene\nTheory)\nKey Takeaways\nKey Points\nAccording to Herzberg, intrinsic motivators and extrinsic motivators have an inverse relationship: intrinsic motivators tend to create\nmotivation when they are present, whereas extrinsic motivators tend to reduce motivation when they are absent.\nIntrinsic motivators tend to represent less tangible, more emotional needs, such as challenging work, recognition, relationships, and\ngrowth potential.\nExtrinsic motivators tend to represent more tangible, basic needs, such as status, job security, salary, and fringe benefits.\nExtrinsic motivators are expected and so cause dissatisfaction if they are absent. Intrinsic motivators, on the other hand, can provide extra\nmotivation. Because of this, satisfaction and dissatisfaction are independent; one does not necessarily increase exactly as the other\ndecreases.\nManagement is tasked with differentiating when more job satisfaction is needed (providing intrinsic motivators) and when less job\ndissatisfaction is needed (providing extrinsic motivators).\nKey Terms\nhygiene factors: Elements of life or work that do not increase satisfaction but that can lead to dissatisfaction if they are missing.\nTwo-Factor Theory: A framework, developed by Frederick Herzberg, that suggests there are certain factors in the workplace that can\ncause job satisfaction and a separate set of factors can cause dissatisfaction.\nThe Two Factors: Intrinsic and Extrinsic Motivators\nFrederick Herzberg's Two-Factor Theory, also known as Motivation-Hygiene Theory or intrinsic vs. extrinsic motivation, concludes that\nthere are certain factors in the workplace that can cause job satisfaction and a separate set of factors that can cause dissatisfaction. It is\ncritical to emphasize that this is not a linear relationship: the factors that cause satisfaction do not necessarily negate those that cause\ndissatisfaction; one does not necessarily increase exactly as the other decreases.\nExtrinsic Motivators (Hygiene Factors)\nExtrinsic motivators tend to represent more tangible, basic needs—i.e., the kinds of needs identified in McClelland's \"existence\" category\nof needs in his ERG Theory or in the lower levels of Maslow's Hierarchy of Needs. Extrinsic motivators include status, job security, salary,\nand fringe benefits. Managers must realize that not providing the appropriate and expected extrinsic motivators will sow dissatisfaction\nand unmotivated behavior among employees.\nIntrinsic Motivators (Motivation Factors)\nIntrinsic motivators tend to represent less tangible, more emotional needs—i.e., the kinds of needs identified in McClelland's \"relatedness\"\nand \"growth\" categories of needs in his ERG Theory and in the higher levels of Maslow's Hierarchy of Needs. Intrinsic motivators include\nchallenging work, recognition, relationships, and growth potential. Managers must recognize that while these needs may be outside the\nmore traditional scope of what the workplace should provide, they are absolutely critical in empowering strong individual and team\nperformance.\nHerzberg's Theory in Context\nHerzberg's Two-Factor Theory, McClelland's Need Theory, and Maslow's Hierarchy of Needs all talk about higher-level psychological\nneeds such as achievement, recognition, responsibility, and advancement. The key factor that differentiates Two-Factor Theory is the idea\nof expectation.\nAccording to Herzberg, intrinsic motivators and extrinsic motivators have an inverse relationship. This is to say that intrinsic motivators\ntend to inspire motivation when they are present, while extrinsic motivators tend to reduce motivation when they are absent. This is\nbecause of expectation. Extrinsic motivators (e.g., salary, benefits) are expected and so will not increase motivation when they are in place,\nbut they will cause dissatisfaction when they are missing. Intrinsic motivators (e.g., challenging work), on the other hand, can be a source\nof additional motivation.\nIf management wants to increase employees' job satisfaction, they should be concerned with the nature of the work itself—the\nopportunities it presents employees for gaining status, assuming responsibility, and achieving self-realization. If, on the other hand,\nmanagement wishes to reduce dissatisfaction, then it must focus on the job environment—policies, procedures, supervision, and working\nconditions. To ensure a satisfied and productive workforce, managers must pay attention to both sets of job factors.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}