{
    "text": "Search... Home Subjects\nBoundless Management\nIntroduction to Management\nCore Requirements of Successful Managers\nThe Importance of Accountability\nBeing accountable simply means being responsible for decisions made, actions taken, and assignments completed.\nLearning Objectives\nDiscuss the role accountability plays in driving managerial performance.\nKey Takeaways\nKey Points\nAccountability in business is critical, as the concept enhances the ethics of managers.\nBeing accountable means standing by decisions, actions, and the overall well-being of projects.\nAccountability is also a management process that ensures employees answer to their superior for their actions and that supervisors\nbehave responsibly as well.\nAccountability addresses both the organization 's expectation of the employee and the employee's expectation of the organization.\nAccountable employees help to increase performance of business as a whole and to maintain a positive company culture, vision, and\nethics.\nAccountability on a global scale, particularly in the case of NGOs, is complicated by the fact that different countries have varying\nlegislative perspectives when it comes to accountability.\nKey Terms\naccountability: Being responsible for one's own work and answering for the repercussions of one's own actions.\nparadigmatic: Pertaining to a given template, context or model.\nIntroduction\nIn organizations, accountability is a management control process in which responses are given for a person's actions. These responses can\nbe positive or negative. Depending on the response, the person might need to correct his or her error. In other words, accountability\nrefers to individual responsibility for the work performed and answering to peers and superiors for performance.\nAccountability is often used synonymously with responsibility, blameworthiness, and liability. As an aspect of governance, accountability\nhas been central to discussions related to problems in the public, non-profit, and corporate sectors.\nIn leadership roles, accountability is the acknowledgment and assumption of responsibility for actions, products, decisions, and policies\nincluding the administration, governance, and implementation within the scope of the role or employee position. Accountability also\nencompasses the obligation to report, explain, and answer for resulting consequences. As leaders often make decisions with far-reaching\nconsequences, accountability has a substantial ethical component.\nGovernment accountability: Governing authorities\nhave the obligation to report, explain, and answer for\nresulting consequences of their actions.\nAccountability in Companies\nAccountability also has a strong connection to expectations. Employees who do not meet the expectations of their supervisor are held\naccountable for their actions and must answer for their inability to do so.\nAccountability is crucial to ensuring high performance within an organization. However, managers must clearly communicate their\nexpectations to the person who is responsible for the specified action or task. Clear communication of expectations and well defined\ngoals is a very effective tool to enhancing performance at every level of organization.\nWithout defined goals, employees lack a frame of reference for how they are performing in the workplace. They are unable to rely on\nguidelines or a structure that helps them achieve their performance goals. In many organizations, the management team and board of\ndirectors create goals for themselves and the general manager, while the general manager creates goals for department managers. This\nprocess is replicated throughout the organization, down to the department managers who create goals for entry-level employees.\nBoth subordinates and supervisors should have a clear idea of how their projects should be handled and delivered. A clear expectation\nlevel and the understanding that all employees are accountable for their performance boosts employee morale and productivity in the\nworkplace. However, because different individuals in large organizations contribute in various ways to a company's decisions and policies,\nit is often difficult to identify who should be accountable for the results.\nGlobal Accountability\nRecently, accountability has become an important topic in the discussion about the legitimacy of international institutions. Because there\nis no global, democratically elected body to which organizations must account, global organizations from all sectors' bodies are often\ncriticized as having large accountability gaps.\nOne emblematic problem in the global context is that of institutions such as the World Bank and the International Monetary Fund, which\nare founded and supported by wealthy nations and provide aid in the form of grants and loans to developing nations. The question\npersists as to whether these institutions should be accountable to their founders and investors or to the persons and nations they help.\nIn the debate over global justice and its distributional consequences, those in highly developed, heavily populated areas tend to advocate\ngreater accountability to traditionally marginalized populations and developing nations. On the other hand, those who adopt a more\nnationalistic or provincial view deny the tenets of moral universalism; they argue that beneficiaries of global development initiatives have\nno substantive entitlement to call international institutions to account. The One World Trust Global Accountability Report, published in a\nfirst full cycle from 2006 to 2008, is one attempt to measure the capability of global organizations to be accountable to their stakeholders.\nExamples\nExample 1\nThe United States Department of Organization provides specific guidelines about accountability of managers. Managers are responsible\nfor the quality and timeliness of program performance, increasing productivity, controlling costs and mitigating adverse aspects of agency\noperations, and assuring that programs are managed with integrity and in compliance with applicable law.\nExample 2\nThe situation at Enron is another strong example of accountability - where the actions of a few unethical individuals caused great harm to\nthe broader corporation and all stakeholders. In the case of Enron, the individuals involved in the negative actions are held accountable\nfor the subsequent consequences, which reduces the likelihood similar things will happen again in the future.\nThe Importance of Leverage\nManagement roles are defined by the capacity to motivate and leverage human capital in the organization to achieve efficiency in\noperations.\nLearning Objectives\nDescribe how general managerial functions gain leverage in the workplace and how this relates to motivation\nKey Takeaways\nKey Points\nWhile there are different ways to view the concept of gaining leverage as a manager, the underlying principle should be one of synergy.\nManagers are responsible for planning, organizing, staffing, directing, monitoring, and motivating employees to create leverage in an\noperational system. Leverage primarily revolves around effective delegation and motivation.\nEffective managers must have a thorough understanding of each employee's strengths and weaknesses, as well as their aspirations and\nmotivators, to appropriately carry out essential tasks.\nThrough combining delegation and motivation skills, managers effectively leverage human capital to achieve high levels of efficiency and\nemployee satisfaction.\nKey Terms\nincentives: Ways to promote a desired action.\nleverage: A technique used to multiply gain or loss.\nSynergy: Benefits resulting from combining two different groups, people, objects, or processes.\nWhy Leverage Matters\nManagement roles are defined by the capacity of the manager to motivate and leverage the human resources in the organization to\nachieve efficiency in operations. As a result, effective managers are capable of optimizing the time and effort of employees to attain the\nhighest possible value. This optimization requires a thorough understanding of basic managerial functions and the way in which\nincentives can be applied according to motivational theories in the workplace.\nAlthough there are different ways of understanding the concept of gaining leverage as a manager, the underlying principle should be one\nof synergy. The concept of synergy emphasizes that one additional employee's output is greater than an arithmetic expectation. More\nsimply put, synergy means that 1 + 1 > 2 (a common adage in business for synergy is 1 + 1 = 3). Leverage, therefore, is about getting\nmore out of a system than is put in, resulting in a value-added proposition.\nDesign management: Teams can create solutions through\nintegration, giving the manager the ability to solve problems\nmore complex than one individual can handle.\nManagerial Functions and Leverage\nManagers are responsible for planning, organizing, staffing, directing, monitoring, and motivating employees through the use of highly\ndeveloped decision-making and interpersonal skills.\nDelegation\nPlanning, organizing, and staffing are the preliminary steps to carrying out a project, setting schedules and constructing a team with the\nappropriate skills to execute the project effectively. This half of the managerial responsibilities falls largely within the decision-making\nrealm, which correlates to a manager's ability to organize tasks and delegate these tasks effectively to gain leverage.\nThe concept of delegation enables managers to minimize their own time commitment to specific elements of a process, as well as\nimprove quality and efficiency through the use of specialists (managers are typically generalists). Delegation therefore allows managers to\noptimize team structures and skill-set distributions to allow for synergy in operations. Effective managers are able to juggle a number of\nteams of specialists, empowering their autonomy and controlling the workflow in a way that aligns with organizational objectives.\nDelegation sounds easy on paper, but it requires a number of intrinsic skills such as communication, organization, multitasking, and the\nability to \"zoom out\" and observe the bigger picture (and identify the critical components that enable it).\nMotivation\nPlanning, organizing, and staffing are followed by the more interpersonal elements of management: directing, monitoring, and motivating\nthe staff. At this point, managers face the challenging task of assessing the skills of employees, assigning relevant tasks, monitoring\nprogress, and providing incentives to drive productivity. Managers must have a thorough understanding of each employee's strengths\nand weaknesses, as well as aspirations and motivators, to appropriately carry out these tasks. As a result, understanding motivational\ntheories is at the heart of effectively managing employees.\nMotivating employees to leverage the human resources within an organization is central to a manager's responsibilities; it is achieved by\nunderstanding what drives productivity. Generally, positive incentives far outweigh negative ones in leveraging employees. To gain\nleverage, managers must ascertain what opportunities will drive the highest level of productivity in their work groups.\nBy effectively combining this motivational understanding with the expectations and responsibilities of managing employees, managers\neffectively leverage human capital to achieve high levels of efficiency and employee satisfaction.\nExample\nA business with high liquid capital may invest in information structure to reduce the cost of production and increase automation. These\nchanges will ultimately achieve a higher productivity.\nThe Importance of Performance Targets\nPerformance standards motivate employees and management to use their time efficiently by setting achievable objectives.\nLearning Objectives\nExplain the importance of performance targets in the business framework and the approaches to communicating and achieving them\nKey Takeaways\nKey Points\nA key performance indicator ( KPI ) sets a performance standard for an organization, a business unit, or an employee.\nGoal setting means establishing what a person or an organization wants to achieve. Goals should be specific, measurable, achievable,\nrealistic, and time-targeted ( SMART ).\nMotivation is the key component to effective goal setting. Organizations must consider performance targets within the context of\ncreating motivated employees, who will in turn perform more effectively.\nPerformance targets are particularly useful due to their quantitative nature, which allows the measurement of outcomes and assessment\nof operations.\nKey Terms\nKPI: Key Performance Indicator; a tool to measure performance.\nmotivation: Willingness to perform an action, especially a behavior; an incentive or reason for doing something.\nManagerial effectiveness is often assessed on the ability to achieve performance targets. Three basic concepts are involved in\ncommunicating and achieving targets: key performance indicators, goal setting, and motivation.\nPerformance Indicators\nA key performance indicator is a tool for performance measurement used by organizations. It is used to set a performance standard for an\norganization, a business unit, or an employee. It is also used to evaluate the overall success of the organization and the success of a\nspecific activity in the organization.\nSuccess can be defined as progress towards strategic or operational goals such as zero defects, percentage of customer satisfaction (or\nretention), profitability margins, etc. KPIs are usually understandable, meaningful, and measurable. For the employee to achieve them,\nobjectives should be clear and simple to understand.\nGoal Setting\nGoal setting is an effective tool for progressive organizations, because it provides a sense of direction and purpose. Employees benefit\ngreatly from understanding what is expected of them and how they can measure this success (or lack thereof). A clear concept of\nachievement leads to independent personal development, and goal setting can improve the organization's performance. Challenging\ngoals tend to result in higher performance than easy or no goals.\nGoal setting means establishing what a person or an organization wants to achieve. In setting these objectives, managers must ensure the\ngoals are both understandable and achievable to meet performance targets. The SMART model is a good framework to keep in mind\nwhen generating goals and objectives. It aims to design goals that are specific, measurable, achievable, realistic, and time-targeted\n(SMART).\nSMART criteria: Each component of the SMART model describes an\neffective attribute of a performance objective. Objectives should be\nSpecific, Measurable, Achievable, Relevant, and Time-bound.\nThe SMARTER framework expands upon this model by noting that objectives should be evaluated and reviewed consistently as well.\nMotivation\nMotivation elicits, controls, and sustains certain goal-directed behaviors. There are a number of approaches to motivation: physiological,\nbehavioral, cognitive, and social. Motivated employees are also more quality oriented and more productive.\nFinancial Rewards for Managers\nCareer success and fulfillment hinge on effective human-resource management and empowering employees with the necessary tools and\nskills.\nLearning Objectives\nDescribe how managers and human resource professionals can effectively empower employees to achieve success and fulfillment\nKey Takeaways\nKey Points\nUnderstanding an employee's needs and future objectives is critical in assigning them the responsibilities that align with their goals and\nthat will serve to develop their skill set in a desired direction.\nWhen assigning tasks, managers must keep career success and development in mind. It is beneficial to plan and implement employee\nobjectives based upon career aspirations and skills.\nManagers are also tasked with monitoring and reviewing employee outcomes with an eye for improvement opportunities. Performance\nmonitoring allows for active skill development through constructive feedback.\nManagers may employ numerous tools in developing employees in a meaningful and fulfilling way to ensure their future success. These\ntools include case studies, consultation, mentoring, and technical assistance.\nKey Terms\nempower: To give someone the strength and/or the means to accomplish something.\nConsultation: A conference for the exchange of information and advice.\nFrom a human-resources framework, managers are largely responsible for the well-being of their employees in regards to providing\nopportunities for career development and personal fulfillment.\nUnderstanding an employee's needs and future objectives is critical in assigning them responsibilities that align with their goals and that\nwill serve to develop their skill set in a desired direction. A manager is also a leader, and leadership is a complex facet of the managerial\nprocess. Leading employees in an empowering way and enabling career success and fulfillment are central tasks in improving employee\noutcomes and creating more value for the organization.\nWhen assigning tasks, managers must keep career success and development in mind. A reasonable rule of thumb is the plan-implement-\nmonitor-review model illustrated in the figure below. Planning (based on employee objectives) and implementing (based upon shared\nexpertise) provide a framework to move the employee in the direction of success. Monitoring progress and reviewing it will allow the\nemployee to remain meaningfully engaged, working towards the common goal of success while gaining experience and skills from\nmanagerial expertise.\nFacilitating employee success: By employing these\nsteps, a manager can help their employees be\nsuccessful.\nCombining this model for success with a working understanding of a given employee's objectives and fulfillment needs helps to ensure\nthat employees remain motivated and satisfied with their current roles. Empowering employees in a developmental direction and\nproviding them with challenges that stretch their abilities are substantial motivators. These are important developmental tools companies\ncan use to obtain the highest possible value from their human resource investments.\nStrategies for Promoting Employee Success\nPromoting career success for employees and managers involves the creation of developmental goals that build stronger skills and aim\ntoward fulfillment. Goal creation is generally achieved using varying approaches and experiences. These may include coaching, higher\neducation, mentoring, reflective supervision, technical training, and consultation. When to apply which particular approach is the primary\nresponsibility of a manager, as is assessing employees' progress and trajectory towards the completion of their personal career objectives.\nFollowing are a few tools managers may use to optimize returns on career development:\nCase Study Method – Case studies are an excellent way to drive employee experience in a realistic and meaningful way. These incorporate\nreal-life situations that have happened in the past as a method for practicing decision making and assessing performance. Conclusions\ncan then be applied by the employee or manager by assuming the role of the decision makers.\nConsultation – Consulting assesses employee abilities through observing performance, reflecting upon these observations, and\nsuggesting methods for improvement. This process is an important responsibility of any manager.\nMentoring – Mentoring is an excellent approach to enhance career success in which a manager matches two employees of different\nexperience levels to learn from one another. Mentoring is usually accomplished by allowing an outside observer to evaluate and suggest\nimprovements for newer employees who have had less time to develop in a particular role.\nTechnical Assistance – Helping employees implement new technologies and acquire modern skill sets is a growing field in career\ndevelopment. Technical training is provided to enable employees to be more effective with newer methodologies, tools, and equipment.\nThis approach can be of particularly high importance to career development for older demographics, who may have extensive experience\nin more traditional methods.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}