{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nDecision Making Process\nIdentify and Define the Problem\nIdentifying, defining, and understanding a problem is essential to analyzing and choosing between alternatives.\nLearning Objectives\nExpress the importance of properly framing and defining the problem prior to pursuing a decision\nKey Takeaways\nKey Points\nDecision makers must first make sure that they completely understand the problem.\nIt is a good idea to be able to look at a decision from multiple perspectives. This can be accomplished through selecting a group of\npeople who will look at and define the problem from different perspectives.\nData should be gathered on how the current problem is affecting people now. Some examples of important data to gather include\nefficiency levels, satisfaction levels, and output metrics.\nKey Terms\nOutput metrics: Standards or data points that showm the rate and speed of production over a certain period of time.\nDecision making is a central responsibility of managers and leaders. It requires defining the issue or the problem and identifying the\nfactors related to it. Doing so helps create a clear understanding of what needs to be decided and can influence the choice between\nalternatives.\nAn important aspect of any decision is its purpose, or objective. This is different from identifying a specific decision outcome; rather, it has\nto do with the motivation to make the decision in the first place. For instance, customer complaints can imply the need to change aspects\nof how service is delivered, so decisions must be made to address them. Factors that are not related to service delivery would not be in\nconsideration in that decision.\nThere are a number of ways to define a problem, such as creating a team to tackle it and gathering relevant data by interviewing\nemployees and customers.\nDeveloping a Group to Define the Problem\nIt is a good idea to be able to approach decision definition from different perspectives. Doing so can capture dimensions of the issue that\nmight otherwise have been overlooked. Involving two or more people can bring different information, knowledge, and experience to a\ndecision. This can be accomplished through forming a group to consider and define the problem or issue, and then to frame the decision\nbased on their collective ideas. Having a shared definition and understanding of a decision helps the decision-making process by creating\nfocus for discussions and making them more efficient.\nGathering Data to Define the Decision\nMost decisions require a good understanding of the current state in order to understand all implications of the potential choices. For this\nreason it can be valuable to consider the views of all parties that will be affected by the decision. These may include customers,\nemployees, or suppliers. Data should be gathered on how the current problem is affecting people now. Some examples of important data\nto gather include efficiency levels, satisfaction levels, and output metrics. Interviews, focus groups, or other qualitative methods of data\ncollection can be used to identify existing conditions that may be connected to the decision in question. As much information as possible\nshould be gathered to build confidence that a decision has been accurately and appropriately formulated before additional analysis and\nassessment of alternatives begin.\nGenerate Alternatives\nIdentifying a range of potential choices is essential to any decision-making process.\nLearning Objectives\nDiscuss methods for identifying alternatives and why doing so is an important part of decision making.\nKey Takeaways\nKey Points\nDecision makers should identify the many alternative choices they face before beginning to conduct analysis for a decision.\nA decision tree is a decision support tool that uses a tree-like graph or model of decisions and their possible consequences, including\nchance event outcomes and resource costs. A decision tree can help lay out the alternatives and determine the best ones to consider.\nWhen dealing with information in decision analysis, there are often biases and errors in judgment, such as the fact that people pay more\nattention to information that is easily available.\nIt is important for a decision maker to receive plenty of input from others to avoid any bias.\nKey Terms\ndecision tree: A visualization of a complex decision-making situation in which the possible decisions and their likely outcomes are\norganized in the form of a graph that resembles a tree.\nbias: An inclination towards something; predisposition, partiality, prejudice, preference, predilection.\nOnce a decision has been defined, the next step is to identify the alternatives for decision makers to select from. It is rare for there to be\nonly one alternative; in fact, a goal should be to identify as many different alternatives as possible without making too narrow a\ndistinction between them. The decision maker can then narrow the list based on analysis, resource limitations, or time constraints. Often,\ndoing nothing is an alternative worthy of consideration.\nBrainstorming\nBrainstorming is a good technique for identifying alternatives. Making lists of possible combinations of actions can generate ideas that\ncan be shaped into alternatives. Often this is best done with a small group of people with different perspectives, knowledge, and\nexperience. A formal approach to capturing the results of brainstorming can help make sure options are not overlooked.\nAnother way to evaluate alternatives is through a decision tree.\nDecision Trees\nA decision tree is a decision support tool that uses a structured graphical depiction of alternatives. This method creates a visual depiction\nof choices so decision makers can have a clearer understanding of them. Decision trees help divide larger decisions into smaller ones and\nare useful for uncovering all available options.\nDecision trees have a starting point and then branch out, with each branch representing a different event, action, or outcome. Resource\ncosts, benefits, and probabilities can be recorded by each option.\nApplied decision tree: Decision trees can improve investment decisions\nby optimizing them for maximum payoff.\nDecision trees have three types of nodes at each part of the diagram:\nDecision nodes: these are the alternatives themselves and represent the point where a decision must be made.\nChange nodes: these are points where choices must be made; in their simplest form these may be represented by Yes/No or Go/No Go\noptions.\nConclusion or end nodes: these are the points that appear when there are no more alternatives or choices to be made, and they state the\noutcome of a particular decision branch.\nWhen generating alternatives, decision makers use information gathered by defining the problem. The list of alternatives can then only be\nas good, complete, and accurate as the quality of that data. Overlooking factors or dimensions of an issue or problem can mean missing\nviable alternatives. The alternatives identified become the basis for subsequent analysis and ultimately the decision itself.\nEvaluate Alternatives\nIn order to eliminate bias in a decision, one can use tools such as influence diagrams and decision trees to evaluate alternatives.\nLearning Objectives\nModel potential decision alternatives through utilizing pro/con analysis, influence diagrams, decision trees and Bayesian networks\nKey Takeaways\nKey Points\nThere are a few tools available to decision makers that can be used to help quantify the potential alternatives to and outcomes of a\ndecision. These tools include a simple pro-and-con analysis, an influence diagram, and a decision tree.\nA decision tree is used to lay out the alternatives and then assign a utility, or a relative value of importance, to a particular alternative.\nAnother tool that decision makers can use to quantify a decision is an influence diagram, which is a compact graphical and mathematical\nrepresentation of a decision situation.\nKey Terms\nBayesian network: A probabilistic model that represents a set of random variables and their conditional dependencies (e.g., a Bayesian\nnetwork could calculate the probabilities between symptoms and a disease).\ndecision tree: A visualization of a complex decision-making situation in which the possible decisions and their likely outcomes are\norganized in the form of a graph that resembles a tree.\nWhen a decision maker has successfully and accurately defined the problem and generated alternatives, he or she can then conduct\nanalysis useful to evaluating and assessing each. This typically involves analysis of quantitative data such as costs or revenues. Qualitative\ndata is also used to be sure that considerations such as consistency with strategy, effects on relationships, or ethical implications are taken\ninto account.\nA first step in analysis is identifying all the sources of data needed to understand the various alternatives and their potential outcomes.\nFinding this data often involves research if relevant data do not exist. The results of data analysis are typically gathered, summarized, and\nsynthesized as the basis for discussions and deliberations by decision makers.\nInfluence diagram example: This is a simple\nexample of an influence diagram used to evaluate\nthe alternatives of a decision.\nThere are a few approaches that can be used to help structure the analysis and assessment of potential decision alternatives. These range\nfrom simple tools such as lists of pros and cons to more complex models such as decision trees and influence diagrams, which can\ncapture more variables and include more data.\nA decision tree specifies alternatives visually and creates paths of subdecisions to be made or uncertainties to be considered in order to\nestimate the outcome of a given choice. It includes a value for each alternative, such as a financial outcome, and notes the probabilities\nthat each outcome will occur. Decision trees sometime include the results of financial analysis such as net present value, which determines\nthe present or current value of a stream of incoming cash flows that a project will bring in sometime in the future. One limitation to using\ndecision trees is that they can become highly complicated as decisions become more complex or outcomes involve greater numbers of\nvariables.\nAnother tool that decision makers can use to analyze alternatives is an influence diagram. An influence diagram is a compact graphical\nand mathematical representation of a decision situation. It groups sets of variables into things that are known and factors that are\nuncertain and links them to the choice to be made and the criteria for assessing it. Influence diagrams are directly applicable in group\ndecisions because they allow incomplete sharing of information among team members to be modeled and for estimates to be made\nexplicitly.\nIn the scenario depicted by the influence diagram above, a person is choosing between vacation alternatives. Her goal is a satisfactory\nvacation, which will be influenced by how good the weather is. She cannot have direct knowledge at the time of the decision what the\nweather will be, but she can gather information on the weather forecast or other climate patterns to help her make the choice of vacation\nlocation.\nDetermine a Course\nA good decision maker will always try to eliminate personal biases and understand his personal risk tolerance when determining a course.\nLearning Objectives\nEvaluate the importance of bias and prospect theory in effectively ensuring decision makers arrive at the ideal option\nKey Takeaways\nKey Points\nDecision makers should use clear selection criteria to evaluate and choose among alternatives.\nBias is inherent in making decisions, but decision makers should do their best to identify emotional and other personal factors that may\naffect their judgment and adjust their deliberations to take biases into account.\nProspect theory identifies aversion to loss as a common bias that can cause people to overstate the downside of alternatives.\nKey Terms\nbias: The human tendency to make systematic decisions in certain circumstances based on cognitive factors rather than evidence; an\ninclination or prejudice toward something.\nOnce decision alternatives have been identified and analyzed, the decision maker is ready to make a choice. To do so it is important to\nhave a set of criteria against which to evaluate and even rank the alternatives. Selection criteria might include total cost, time to\nimplement, risk, and the organization 's ability to successfully implement the decision. Categorizing criteria in terms of importance helps\nto differentiate between options that might have similar disadvantages but different advantages, or vice versa. For example, consider two\nalternatives that are equally risky, but one will cost more and the other will take longer to implement. In this case, the decision would\ndepend on whether cost or time is more important. On occasion, decision makers may believe they do not have sufficient information\nabout a particular alternative, so additional analysis may be needed.\nDecision makers should do their best to minimize their biases, or preconceived ideas about which alternative is preferable, until they\ncomplete the analysis. The benefit of using data to support decisions is that when analysis is done correctly it is objective and factual, not\nbased on emotions or subjective preferences. While it is natural to have biases based on experience or feelings, it is important for\nmanagers and leaders to recognize them and take steps to keep them from butting their judgment. People may be unable to eliminate all\nof their biases, especially when it comes to their tolerance for risk. It is therefore important to be explicit about assumptions and biases to\nthe extent possible, so that people involved in making the decision are aware of them and can adjust their deliberations accordingly.\nBias and Prospect Theory\nOne of the best-known theories about bias in decision making is Kahneman and Tversky's prospect theory. Prospect theory is based on\nthe notion that people think about decisions in terms of potential gains and losses and tend to be more averse to losses than they are\nfavorable to gains. This means that decision makers may overstate the downside of an alternative, since they have a greater fear of\nnegative consequences. As a result, people are biased toward less risky decisions, even when the benefits of a different alternative would\noutweigh the risks of the chosen one. Prospect theory also suggests that people consider how others would benefit or be hurt by the\noutcome of their decision. This contradicts traditional economic theory, which states that individuals make decisions based only on their\nown well-being.\nProspect theory and risk aversion: This graph\nrepresents Kahneman and Tversky's theory. The\ndistance between the x-axis and the curve is smaller in\nthe positive direction (i.e., for positive outcomes, or\ngains) than it is in the negative direction (i.e., for\nnegative outcomes, or losses). This means that people's\npositive value of gains is less than people's negative\nvalue of losses. In other words, people are more\nsensitive to possible risk than to possible gain.\nImplement the Course\nImplementing a decision requires the decision maker to make and execute a plan of action.\nLearning Objectives\nDescribe the three central steps to effectively implementing a decision upon the selection of a particular perspective or course\nKey Takeaways\nKey Points\nThree essential actions to implementing a decision include creating an implementation plan, informing stakeholders, and executing the\nplan.\nIt is common to adjust a plan once the work of implementing a decision begins. Throughout the implementation of the decision, there\nmay be situations and issues that the decision maker did not consider initially.\nDuring the implementation phase, decision makers should be aware that they may be persuaded by pressures from stakeholders and\nemployees to change the decision that they have made or to reconsider their decision.\nKey Terms\nstakeholder: A person or group that affects or can be affected by an organization's actions.\nAfter all of the alternatives have been analyzed and one has been selected, it is time to implement the decision. Three essential actions to\nimplementing a decision are: developing a plan, communicating with stakeholders, and executing the plan (which includes assessing\noutcomes and making adjustments as needed).\nDeveloping a Plan\nA decision is reached with a certain objective in mind. Once it is made, managers identify the steps needed to reach that objective. These\ncan include listing necessary actions and activities, considering required financial and other resources, and making a schedule for\ncompleting the work. The more thought that goes into developing a plan, the less likely it is that important factors will be overlooked.\nCommunicating with Stakeholders\nAn implementation plan requires the involvement of different people, and the consequences of decisions affect various stakeholders. For\nthese reasons it is important to have a plan for communicating important information related to the decision and its implementation. This\nusually involves talking with employees, but may also mean letting customers or suppliers know about the decision and any effects it may\nhave on them.\nExecuting the Plan\nAccomplishing the decision's objective requires completing the steps outlined in the implementation plan. Once this work is underway,\nmanagers assess progress and may identify areas for improvement. Circumstances can change or new issues might arise that had not\nbeen thought of during the planning process. These may require additions to, or other changes in, the plan. Because most decisions are\nmade under conditions of uncertainty, as time passes what was once unknown can become known. Where estimates were incorrect or the\nunexpected happens, adjustments need to be made to the implementation plans. If the new facts are significant enough, it can even\nrequire reconsideration of the decision.\nDuring the implementation phase, decision makers should be aware that they may be persuaded by pressures from stakeholders and\nemployees to change their decision, or to reconsider. A few of these pressures include coercive pressures and normative pressures.\nCoercive pressures come from the social sanctions that can be applied if one does not act in socially legitimate ways. Normative pressures\narise from broad social values, and they concern what people think they should do. Both coercive and normative pressures will likely be\nfelt by the decision maker during the implementation of the decision, especially if the decision is an unpopular one. However, the decision\nmaker should fall back on the analyses that originally brought them to the decision and strive not to be swayed by these pressures.\nEvaluate the Results\nDecision makers must evaluate the results of a decision to improve the processes and outcomes of future decisions.\nLearning Objectives\nRecognize the appraisal stage and the development of future insights as the final stage in the decision-making process\nKey Takeaways\nKey Points\nEvaluation is the final step of the formal decision process. Evaluating outcomes may help the decision maker learn lessons that will\nimprove her decision-making abilities.\nSelf-esteem is an important factor in evaluating results because it may lead to decision makers viewing the results of their decision with\nfavorable bias. This can cause people to filter out or discount information that might show the decision in an unfavorable light.\nIt can also be valuable to assess the process by which a decision was made to make future decisions more effective.\nKey Terms\nappraisal: A judgment or assessment—especially a formal one—of the value of something.\ninsight: An extended understanding of a subject resulting from identification of relationships and behaviors within a model, context, or\nscenario.\nAfter a decision has been made and implemented it is important to assess both the outcome of the decision and the process by which the\ndecision was reached. Doing so confirms whether the decision actually led to the desired outcomes and also provides important\ninformation that can benefit future decision making. Learning from experience is important to continuous improvement and effectiveness.\nEvaluating Outcomes\nThe objective of evaluating outcomes is for the decision maker to develop insight into the decision. Many of the lessons developed in this\nstage come out of examining the implications of the decision. Insight can be obtained by referencing key business metrics such as\nincreased revenue, lowered costs, larger market share, or greater consumer awareness. One can also consider whether a decision had the\ndesired effect. For example, a decision to hold additional training seminars may have been intended to make it more convenient for\npeople to learn a new technology. However, if overall attendance did not increase, then the decision may not have addressed the\nunderlying cause of why people did not go to training events. Once the outcome of a decision is known, the results may imply a need to\nrevise the decision and try again.\nWhen decision outcomes are not clearly measurable or have ambiguous results—some parts good, some bad—is not uncommon for\npeople to emphasize the favorable data and discount the negative. Maintaining self-esteem also may cause decision makers to attribute\ngood outcomes to their actions and bad outcomes to factors outside their control. This type of bias can limit an honest assessment of\nwhat went right and what didn't, and thus reduce what can be learned by carefully evaluating outcomes.\nAppraising the Decision Process\nIt can also be valuable for decision makers to step back and examine the process by which a decision was made. Often they can learn\nlessons that will benefit future decisions. If the decision was made by a group, having a conversation with all participants is often\nworthwhile. Whether enough information was gathered and whether its quality was high enough are two questions that should be\nconsidered. How the decision maker dealt with uncertainty or bias can be examined in the face of the results that have transpired. If\nestimates were off, or it becomes clear that emotions played too large a role in making a choice, it is important to learn from those\nmistakes so they won't happen again. Finally, it is important to question whether all the relevant parties contributed information and\nknowledge needed for the decision, and whether everyone who should have been involved was given the chance to participate.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}