{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nIntrapreneurship\nDefining Intrapreneurship\nIntrapreneurship means behaving like an entrepreneur while working within a large organization.\nLearning Objectives\nDefine intrapreneurship as a means of enabling organizational change and the pursuit of an innovative culture\nKey Takeaways\nKey Points\nThe intrapreneur acts as an \"inside entrepreneur \" who focuses on innovation and creativity while operating within the goals and\nenvironment of an organization.\nIntrapreneurs bring their ideas to the firm to generate new products, processes, or services and thereby act as a force for change within\nthe organization. Intrapreneurship adds to the innovation potential of an organization.\nIn many ways, the benefits of intrepreneurship are difficult to forecast and thus difficult to justify. As a result, good managers must be\nlong-term oriented and open-minded to implement entrepreneurship.\nKey Terms\nentrepreneur: A person who organizes and operates a business venture and assumes much of the associated risk.\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nIntrapreneurship means behaving like an entrepreneur while working within a large organization. According to social scientist Joseph\nSchumpeter, introducing new technologies, increasing efficiency and productivity, and generating new products or services are all\nqualities characteristic of intrepreneurs.\nIntrapreneurs and Corporate Management\nIntrapreneurship is now known as the practice of a corporate management style that integrates risk-taking and innovation approaches. It\nalso incorporates the reward and motivational techniques that are traditionally thought of as being the sole province of entrepreneurship.\nThe intrapreneur acts as an \"inside entrepreneur\" who focuses on innovation and creativity while operating within the goals and\nenvironment of an organization. Intrapreneurs bring their ideas to the firm to generate new products, processes, or services and thereby\nact as a force for change within the organization. Capturing a little of the dynamic nature of entrepreneurial management (trying things\nuntil successful, learning from failures, attempting to conserve resources, and so on) adds to the innovation potential of an otherwise\nstatic organization without exposing those employees to the risks or accountability normally associated with entrepreneurship.\nTheory and Practice\nIncorporating entrepreneurial concepts into traditional corporate environments is easy to promote in theory: capturing the innovative\nattitudes of small start-ups within the larger organizational context (i.e., with more resources) seems intuitive. In reality, entrepreneurship\nis often much easier to discuss in a classroom than to integrate into an actual organization. There are many reasons for this that generally\nboil down to simple issues of size and corporate inertia.\nCompanies are built on structures and hierarchies which in turn create a dependable and repeatable operational process. This process\nleads to value creation, and efficiency is always a focal point in operational contexts. When innovation and intrepreneurship enters this\nequation they are often seen as costs without tangible and definite benefits, and as lacking consistency and applicability to the current\nmodel. In many ways, the benefits of intrepreneurship are difficult to forecast and thus difficult to justify. As a result, good managers must\nbe long-term oriented and open-minded in order to capture the benefits of instilling an intrepreneurial spirit.\nBuilding Support for Intrapreneurship\nBuilding internal support for intrepreneurship is a prerequisite to creating meaningful change in an organization.\nLearning Objectives\nJustify the role of the intrapreneur, not only as an innovative thinker but also a strategic communicator capable of initiating change\norganizationally.\nKey Takeaways\nKey Points\nAn intrapreneur is tasked not only with creating a new and innovative concept but also with communicating the concept in a way that\nbuilds support for the new initiative.\nOne useful way to integrate stakeholders and speak the language of upper management is to numerically demonstrate that a new idea is\nfinancially and strategically feasible.\nBuilding support by identifying and communicating with key stakeholders and decision -makers is essential to bringing change to an\norganization.\nIntrapreneurs must also be willing to become change agents: people who act as catalysts for incorporating new ideas within the\norganization. Intrapreneurs, from this perspective, must display strong leadership and communication skills.\nKey Terms\ncomprehensive: Broadly or completely covering; including a large proportion of something.\nBuilding support is important when you are bringing change to the organization. Employees bold enough to be intrepreneurs must\nrecognize the challenge they are taking on from the organizational frame. Organizations have great momentum and are, in most cases,\ninherently resilient to change. This places a great strain on an innovative employee with an interesting idea because s/he is tasked not\nonly with implementing the idea but also with communicating it to key decision-makers to gain approval.\nKey Stakeholders\nIntrapreneurs need to know who the key stakeholders are and how to capture their attention. For starters, upper management is often\nwhere the decision-making power lies. Having access to upper management, and understanding the strategic motivations behind their\ndecisions, plays an integral role in building top-down support organizationally. Customers are also key stakeholders because their needs\nare the primary determinant of organizational trajectory. Recognizing what customers want and learning how to give it to them more\neffectively are integral to successful intrapreneurship.\nOne useful way to integrate stakeholders and speak the language of upper management is to numerically demonstrate that a new idea is\nfinancially and strategically feasible. A net present value (NPV) analysis factors in the total time it will take to initiate a new project, along\nwith costs incurred and value generated over a given timeframe. This enables intrapreneurs a tool to communicate, in today's dollars, how\nmuch a given new venture will cost compared with how much it will bring in (i.e., a profit margin).\nBeing a Change Agent\nA change agent: Marissa Mayer was recruited from\nGoogle to be the Yahoo CEO so she could set and\nexecute the strategy that might turn the company\naround.\nChange agents know how to get people in an organization involved in solving their own problems. A change agent's main strength is a\ncomprehensive knowledge of human behavior supported by a number of intervention techniques. Understanding not only how to\ninnovate but also how to operate as a catalyst for change is a useful characteristic for aspiring intrapreneurs. Building support is largely a\nsocial and behavioral challenge, and change agents understand how to communicate why a proposed change is important and how it is\nattainable.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}