{
    "text": "Search... Home Subjects\nBoundless Management\nIntroduction to Management\nAdditional Roles and Skills of Managers\nMintzberg's Management Roles\nMintzberg defined ten management roles within three categories: interpersonal, informational, and decisional.\nLearning Objectives\nOutline the ten management roles under their three categorical headings, as devised by McGill University professor Henry Mintzberg\nKey Takeaways\nKey Points\nMintzberg characterizes management using three categories and ten roles, each of which exhibits critical managerial skill sets useful for\nbusiness leaders in a variety of contexts.\nInterpersonal roles include: figurehead, leader, and liason.\nInformational roles include: mentor, disseminator, and spokesman.\nDecisional roles include: entrepreneur, disturbance handler, resource allocator, and negotiator.\nIt is important to recognize that no single manager can be all things to all people at once. Good management requires assessing which\nrole is appropriate when and determining if new talent is required to complement a skill set.\nKey Terms\nInformational: Designed or able to impart information.\ndecisional: Having the power or authority to make decisions.\nManagement is incorporated into every aspect of an organization and involves different roles and responsibilities. Henry Mintzberg\n(1973), the Cleghorn Professor of Management Studies at McGill University, defined ten management roles within three categories:\ninterpersonal, informational, and decisional.\nEach of the three categories embraces the different roles.\nInterpersonal\nFigurehead: symbolic head; performs a number of routine duties of a legal or social nature.\nLeader: motivates and activates subordinates; performs staffing, training, and associated duties.\nLiaison: maintains a self-developed network of outside contacts and informers who provide favors and information.\nInformational\nMentor: seeks and receives a wide variety of special information (much of it current) to develop a thorough understanding of the\norganization and environment; emerges as the nerve center of internal and external information for the organization.\nDisseminator: transmits information received from outsiders or from other subordinates to members of the organization. Some\ninformation is factual; some involves interpretation and integration of diverse value positions of organizational influences. Disseminating\nwhat is of value, and how, is a critical informational role.\nSpokesman: transmits information (plans, policies, results, etc.) within and outside of the organization; serves as an expert on the\norganization's industry.\nDecisional\nEntrepreneur: searches the organization and its environment and initiates improvement projects to bring about change; supervises design\nof certain projects as well.\nDisturbance Handler: takes corrective action when the organization faces important, unexpected disturbances.\nResource Allocator: allocates the organization's resources; makes or approves of all significant organizational decisions.\nNegotiator: represents the organization at major negotiations.\nA manager's job is never static; it is always dynamic. At any given time, a manager may carry out some combination of these roles to\nvarying degrees, from none of the time to 100 percent of the time. Throughout an individual's working life, a person may hold various\nmanagement positions that call upon different roles.\nNo one person can be all things to all people. While these ten roles are highly useful in framing organizational leadership, to expect one\nperson to fill each role in a large organization is impractical. Instead, astute hiring managers will hire people with one or two specific roles\nin mind, thereby creating a team of managers capable of handling the wide variety of challenges in the business world today.\nManaging Organizational Priorities\nAgendas help to organize, prioritize, and facilitate discussion about a given set of points in an organizational pursuit.\nLearning Objectives\nExplain the process of pursuing agendas, particularly from the perspective of change management, through the implementation of\nstrategies and policies\nKey Takeaways\nKey Points\nAn agenda, particularly within an organization or business, is loosely defined as an organized approach toward accomplishing a series of\nobjectives or discussing a series of points.\nIn business, an agenda is commonly brought to a meeting to ensure everyone understands what will be discussed.\nPublic companies have an important relationship with agendas, as they are often tasked with keeping meeting minutes, a verbatim\noverview of what was discussed for public viewing and consideration.\nSkilled managers may both construct and implement an agenda in an organizational setting.\nGood managers can balance the various interests, operations, and technical skills of a given team to ensure the objectives and timelines\nset forward by the agenda are carried out.\nKey Terms\nagenda: A temporally organized plan for matters for discussion or tasks to be carried out.\nproject management: The discipline of organizing and handling resources (e.g., people) in such a way that an endeavor is completed\nwithin defined scope, quality, time, and cost constraints.\nDefining Agendas\nAn agenda, particularly from the perspective of an organization or business, is loosely defined as a organized approach toward\naccomplishing a series of objectives or discussing a series of points. Agendas are most commonly used in a short-term setting, such as a\nmeeting or a given week's work plan; however, they can also be used as a longer-term strategic planning component.\nExample of an agenda: An agenda sometimes combines\na process flow and a checklist, where employees and\nmanagement involved in a given operational process\ntrack progress and provide updates. The image above\nillustrates a Gantt chart, which uses a bar graph to show\nprogress toward completion.\nBusiness Application\nIn business, an agenda is commonly brought to a meeting to ensure everyone understands what will be discussed. Agendas should be\ndistributed well before the meeting or discussion to ensure individuals attending have time to prepare their discussion points and to\nfamiliarize themselves with what others will be discussing. Reading the agenda in advance ensures that the overarching goals of a given\nmeeting are clear and understood by all participants prior to the discussion.\nAgendas may also be used as a means of highlighting current progress and projecting future progress. This type of agenda provides a\ntimeline and tracking mechanisms for participants involved in a given project and may or may not require onsite meetings. Agendas\nshowing project progress are often used by contractors and those in the field of project management.\nKeeping Minutes\nAgendas are also used broadly in the political and public domain, where meetings held by public institutions, NGOs, or political groups\nare approached and organized via a given agenda. Public companies have a more important relationship with agendas than private\ncompanies, as they are usually required to record meeting minutes. These minutes are essentially a verbatim record of what was discussed\nand are made available for public viewing and consideration. As these discussions are accessible by any and all stakeholders, the outline\nand preparation of a valid and relevant agenda is of particularly high importance.\nRelevance to Management\nSkilled managers may construct and implement an agenda in an organizational setting. Building an agenda requires broad familiarity with\nall critical components of a given department, project, or organizational objective. Creating a relevant agenda and distributing it to\nconcerned parties in a timely fashion requires organizational ability, communication skills (including the ability to write clearly and\nconcisely), and strategic know-how (knowing what to discuss and in what order). Managers must be skilled in controlling the pace, tone,\nand trajectory of discussions at meetings. Agendas are an excellent tool for organizing thoughts and leading discussion.\nThe pursuit of agendas requires a similar set of managerial skills. Ensuring follow-through and keeping employees on task and on\nschedule requires an ability to multitask—to oversee various aspects of a given operational area simultaneously. Good managers can\nbalance the various interests, operations, and technical skills of a given team to ensure the objectives and timelines set forth in the\nagenda are carried out.\nTechnical Skills of Successful Managers\nSuccessful managers must possess certain technical skills that assist them in optimizing managerial performance.\nLearning Objectives\nOutline the four critical technical skills commonly utilized by successful managers and supervisors in optimizing organizational\nperformance\nKey Takeaways\nKey Points\nRobert Katz identifies three critical skill sets for successful management professionals: technical skills, human skills, and conceptual skills.\nOf the three skill sets identified by Katz, technical skills are the broadest category and the most easily defined. A technical skill is defined\nas a learned capacity in just about any given field of work, study, or even play.\nFront-line managers represent a substantial portion of management; they rely on their technical skills daily.\nOffice environments require a complex set of communicative, technological, and data- organization skills to optimize managerial\nperformance.\nKey Terms\ndelegation: The act of committing a task to someone, especially a subordinate.\ntechnical skill: The learned capacity or ability to carry out predetermined results using tools, machines, techniques, crafts, systems, and\nmethods of organization.\nDefining Technical Skills\nRobert Katz identifies three critical skill sets for successful management professionals: technical skills, human skills, and conceptual skills.\nWhile these three broad skill categories encompass a wide spectrum of capabilities, each category represents a useful bucket for these\nskills to fall into and describes the way in which these skills interact with management at various levels.\nOf the three skill sets identified by Katz, technical skills are the broadest, most easily defined category. A technical skill is defined as a\nlearned capacity in just about any given field of work, study, or even play. For example, the quarterback of a football team must know how\nto plant his feet and how to position his arm for accuracy and distance—both technical skills. A mechanic, meanwhile, needs to be able to\ndeconstruct and reconstruct an engine, to employ various machinery (lifts, computer scanning equipment, etc.), and to install a muffler.\nFront-Line Managers' Technical Skills\nManagers also need a broad range of technical know-how. All industries need management, and management must exist at various\norganizational levels. Front-line managers represent a substantial part of management who must use their technical skills daily. Front-line\nmanagers must communicate up the chain of command while still speaking the language of the workers who are executing the hands-on\ncomponents of the industry. A technical skill for a front-line manager might include a working understanding of a piece of equipment: the\nmanager must be able to coach the employee on its operation, as well as communicate to upper managers the basic functions of the\nmachinery.\nTechnical Skills in Upper Management\nIn addition to front-line managers, managers in other corporate roles and at higher levels require critical technical skills. These can include\noffice-based competencies such as typing, programming, website maintenance, writing, giving presentations, and using software such as\nMicrosoft Office or Adobe. Office environments require a complex set of communicative, technological, and data-organization skills in\norder to optimize managerial performance.\nSuccessful managers in an organization must therefore learn to use the technological assets at their disposal, collecting critical\ninformation and data to communicate upward for strategic planning. An example of information management is a mid-level manager in\nthe automotive industry who is responsible for recognizing global marketing potential. This individual must be capable of realizing the\nlegal, demographic, social, technological, and economic considerations of entering a market; the manager will use effective research and\ndelegation skills and also consolidate the information into a useful presentation using technological and communicative skills.\nKatz postulates that the higher up in the organization an individual rises, the more conceptual skills (and fewer technical skills) are\nnecessary. Senior managers need fewer technical skills because strategic decision-making is inherently more conceptual; mid- and lower-\nlevel skills such as data collection, assessment, and discussion are all more technical. Even so, all disciplines of management require a\nbroad range of skill sets for effective business processes to occur.\nExample\nA technical skill for a front-line manager might include a working understanding of a piece of equipment: the manager must be able to\ncoach the employee on its operation, as well as communicate to upper managers the basic functions of the machinery.\nIntellectual Skills of Successful Managers\nConceptual skills revolve around generating ideas through creative intuitions and a comprehensive understanding of a given context.\nLearning Objectives\nRecognize the inherent value of encouraging cooperation among teams as a management professional\nKey Takeaways\nKey Points\nConceptual skills of management represent one of the three skill sets identified by Robert Katz as critical to managerial success in an\norganization; the other two include technical skills and human skills.\nConceptual thinking is difficult to define but could generally be considered as the ability to formulate ideas or mental abstractions in the\nmind.\nWhile all levels of management benefit from conceptual thinking, upper management spends the most time within this frame of mind.\nConceptual skills include the ability to forecast, think innovatively, and combine seemingly disparate information; they also include the\ncommunicative capacity to discuss and debate in pursuit of a good strategy.\nConceptual skills are important in empowering managers in all levels of an organization to observe the operations of an organization and\nframe them conceptually as an aspect of that organization's strategy, objectives, or policies.\nKey Terms\nconceptual: Pertaining to the ability to apprehend or form an idea in the mind; the ability to create a mental abstraction.\nDefining Conceptual Thinking\nConceptual skills represent one of the three skill sets identified by Robert Katz as critical to managerial success in an organization; the\nother two include technical skills and human skills. While each skill set is useful in different circumstances, conceptual skills tend to be\nmost relevant in upper-level thinking and broad strategic situations (as opposed to lower-level and line management). As a result,\nconceptual skills are often viewed as critical success factors for upper managerial functions.\nConceptual thinking is difficult to define but could generally be considered as the ability to formulate ideas or mental abstractions in the\nmind. Conceptual skills primarily revolve around generating ideas, utilizing a combination of creative intuitions and a comprehensive\nunderstanding of a given context (i.e., incumbent 's industry, organizational mission and objectives, competitive dynamics, etc.). When\ncombined with a variety of information, as well as a degree of creativity, conceptual thinking can result in new ideas, unique strategies,\nand differentiation.\nConceptual Skills in Upper Management\nWhile all levels of management benefit from conceptual thinking, upper management spends the most time within this frame of mind (as\nopposed to thinking more technically—looking at and working with the detailed elements of a given operation or business process).\nUpper management is largely tasked with identifying and drafting a strategy for the broader operational and competitive approach of an\norganization.\nThis strategic planning includes generating organizational values, policies, mission statements, ethics, procedures, and objectives. Creating\nthis complex mix of concepts to use as an organizational foundation requires a great number of conceptual skills—formulating concepts\nand predicting their effects in an organizational setting.\nConceptual Skills in Lower and Middle Management\nWhile upper management may use the conceptual skill set most, middle managers and lower managers must also both understand and\nparticipate in the generation of company objectives and values. Of particular importance are the ability to communicate these critical\nconcepts to subordinates and the ability to gather useful information to convey to upper management so that the concepts can evolve.\nCollecting the results of conceptual thinking represent a feedback loop. Conceptual skills are important in empowering managers in all\nlevels of an organization to observe the operations of an organization and frame them conceptually as an aspect of that organization's\nstrategy, objectives, and policies. Conceptual thinking allows for accurate and timely feedback and organizational adaptability.\nInterpersonal Skills of Successful Managers\nA manager must be both analytical and personable when it comes to managing time, resources, and personnel.\nLearning Objectives\nDemonstrate the integral human skills that enable effective management and leadership capacity in the organizational frame\nKey Takeaways\nKey Points\nAccording to management theorist Robert Katz, management comprises three critical skill sets: technical skills, human skills, and\nconceptual skills.\nHuman skills are broadly perceived as a combination of social, interpersonal, and leadership skills. These skills are increasingly important\nin business and relevant to all levels of management (lower, middle, and upper).\nHuman skills differentiate a manager from a leader. A manager is simply manipulating resources to achieve a given objective, while a\nleader appeals to the human side of employees to generate creativity and motivation.\nInterpersonal skills and communication skills lie at the center of human-based managerial considerations. Good managers understand not\nonly what they are trying to say but also the broader context and implications of saying it.\nKey Terms\nempathy: The intellectual identification of the thoughts, feelings, or state of another person.\ninterpersonal: Between two or more people.\nAccording to management theorist Robert Katz, management comprises three critical skill sets: technical, human, and conceptual. The\ndevelopment of human skills—which could be perceived as a combination of social, interpersonal, and leadership skills—is central to the\nsuccess of a manager.\nLeadership\nOver the years, the common definition of management has become less specific, as managerial functions can include staffing, directing,\nand reporting. Modern companies have fewer layers of management, as these companies instead rely on the delegation of responsibilities\nand authority to achieve goals. As a result, businesses often speak of \" leading,\" or guiding, people rather than giving instructions for\nevery action. Leading people represents a central component of human skills.\nUnder this definition of management, leadership is actually a subcategory of management. Management characterizes the process of\nleading and directing all or part of an organization, often a business, through the deployment and manipulation of resources (human,\nfinancial, material, intellectual or intangible).\nHuman skills differentiate a manager from a leader. A manager is simply manipulating resources to achieve a given objective, while a\nleader appeals to the human side of employees to generate creativity and motivation.\nThese concepts of \"manager\" and \"leader\" can be distinguished within a team setting. A team leader who is unconcerned with team\nmembers' needs or who has a personal agenda that is perceived to be more important than the team's goals may be considered more of\na manager than a leader, with the possible outcome of being estranged from team members. Conversely, team leaders who are admired\nand loyally followed are those who show concern for the team members as individuals with real needs and who place their team above\ntheir own personal agendas.\nCommunication\nRealistically, most organizations need leaders who can view their teams analytically and objectively, evaluating inefficiencies and making\nunpopular choices. However, it is misleading to think that a manager has to be distant from or disliked by subordinates to execute these\nresponsibilities. Creating a healthy environment conducive to development, criticism, and higher degrees of achievement simply requires\nstrong human skills, particularly in the realm of communication.\nThe \"four sides\" communication model: This model provides a\ntheoretical framework for the act of communicating, which lies at the\nheart of effective management. A sender communicating a message\nto a receiver is not simply transmitting factual information; self-image,\ncontext, charisma, and the relationship between the two people also\nimpact the reception of the message.\nInterpersonal skills and communication skills lie at the center of human-based managerial considerations. Good managers understand not\nonly what they are trying to say but also the broader context and implications of saying it. Empathy, self-reflection, situational awareness,\nand charisma all play integral roles in communicating effectively and positively.\nExperiential Learning for Managers\nExperiential learning is the process of making meaning from direct experience.\nLearning Objectives\nDefine the process, role and implementation of experiential learning as it pertains to managerial skill set development\nKey Takeaways\nKey Points\nExperiential learning involves learning through reflection on direct actions and experiences; it is often contrasted with rote or didactic\nlearning.\nExperiential learning does not require a teacher; instead, it relates to the process of making meaning based on individual experience.\nIn this learning technique, a cycle of concrete experience, reflective observation, abstract conceptualization, and active experimentation\ngenerates realistic learning outcomes.\nManagement requires a wide variety of skills that are largely intangible and not easily learned via textbooks, so experiential learning\nserves as a useful focal point for study.\nKey Terms\nExperiential: Of, related to, encountered in, or derived from an activity or event.\ngenuine: Belonging to, or proceeding from the original stock; native; hence, not counterfeit, spurious, false, or adulterated; authentic; real;\nnatural; true; pure.\nDefining Experiential Learning\nAristotle once said, \"For the things we have to learn before we can do them, we learn by doing them.\" Experiential learning is the process\nof making meaning from direct experience. The experience can be staged or left unstructured. David A. Kolb, an American educational\ntheorist, helped to popularize the idea of experiential learning, drawing heavily on the work of John Dewey, Kurt Lewin, and Jean Piaget.\nKolb's work on experiential learning has contributed greatly to expanding the philosophy of experiential education.\nThe Process\nExperiential learning involves learning through reflection on doing; it is often contrasted with rote or didactic learning. Experiential\nlearning is related to—though not fully synonymous with—experiential education, action learning, adventure learning, free-choice\nlearning, cooperative learning, and service learning.\nExperiential learning focuses on the learning process for the individual (unlike experiential education, which focuses on the transaction\nbetween teachers and students). An example of experiential learning is going to the zoo and observing and interacting with the zoo\nenvironment, as opposed to reading about animals in a book. It is the difference between firsthand knowledge and hearing or reading\nabout other people's experiences.\nExperiential learning does not require a teacher; instead, it draws solely upon the process of making meaning based on direct individual\nexperience. According to Kolb, knowledge is continuously gained through both personal and environmental experiences. While gaining\nknowledge is an inherent process that occurs naturally, certain elements must be present for a genuine learning experience to occur. Kolb\nstates that to gain genuine knowledge from an experience requires the following abilities:\nthe learner must be willing to be actively involved in the experience\nthe learner must be able to reflect on the experience\nthe learner must possess and use analytic skills to conceptualize the experience\nthe learner must possess decision-making and problem-solving skills in order to use the new ideas gained from the experience\nExperiential learning: The process of experiential learning is\ncyclical, with no required starting or end point. Learning through\nexperiences requires observation, conceptualization, and\nexperimentation to engage the mind.\nExperiential learning can be a highly effective way to learn new skills, new attitudes, or even entirely new ways of thinking. It engages the\nlearner on a more personal level by addressing the needs and wants of the individual. It requires initiative and the ability to self-evaluate.\nTo be truly effective, it should span goal-setting, experimenting and observing, reviewing, and planning future action.\nRole in Business\nExperiential learning plays an important role in business learning and managerial training. It is an integral component to many training\nprograms, as it engages both the intellect and the senses much more comprehensively than lectures, books, or videos. For example, a\ncomputer simulation of change management can be a useful application of experiential learning, as can a board game simulating\noperational efficiency in a factory.\nBusiness skills are inherently intangible, evading the capture of most textbooks without external materials to create context. Management\nspans a wide variety of personal capabilities and requires different skills based upon the specific role and context, making it a challenging\nsubject to teach. Motivating others and navigating a complex organizational structure are not skills individuals can learn via textbooks;\nexperiential learning in business may therefore serve a useful focal point for study.\nThis principle is particularly noticeable in business programs that utilize a cohort or group-based educational structure for students. These\nprograms enable students to select leaders and actively practice delegation, communication, and multitasking as they work on projects.\nCase studies offer another effective method of capturing these complex managerial skill sets in a real-life setting. Cases place students in\nthe shoes of managers and allow them to experience and apply the variety of skills and considerations necessary for success in a specific\nsituation and industry.\nExample\nA computer simulation of change management can be a useful application of experiential learning, as can a board game simulating\noperational efficiency in a factory.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}