{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Theory\nModern Thinking\nQuantitative and Analytical Management Tools\nQuantitative tools are used by management to determine where a company is doing well or struggling compared to the industry and\ncompetitors.\nLearning Objectives\nGive examples of quantitative and analytical management tools that assist organizations in better understanding workflow, financials and\nemployee efficiency\nKey Takeaways\nKey Points\nMany quantitative and analytic tools are available for managers to better understand workflow processes, financial management, and\nemployee efficiency.\nA decision tree is a decision support tool that uses a tree-like graph or model of decisions and their possible consequences, including\nchance event outcomes, resource costs, and utility.\nSimulation is the imitation of a real-world process or system over time.\nTrend charts are often used in management to display data over time to explore any potential trends, either positive or negative, that\nrequire additional attention by management. It is important to use statistical confidence intervals when utilizing this type of forecast.\nBenchmarking allows a manager to see how different aspects of a business are performing compared to national, regional, and industry\nstandards. It also allows management to explore how the company is performing compared to its competitors.\nFinancial projections and net-present- value (NPV) analyses are also commonplace when deciding upon new operations quantitatively—\nwhere the company predicts profitability in today's dollars.\nKey Terms\ndecision tree: A visualization of a complex decision-making situation in which the possible decisions and their likely outcomes are\norganized in the form of a graph that resembles a tree.\nbenchmarking: A technique that allows a manager to compare metrics, such as quality, time, and cost, across an industry and against\ncompetitors.\nManagers can use many different quantitative and analytic tools to better understand workflow processes, financial management, and\nemployee efficiency. These tools, such as decision tress, simulation, trend charts, benchmarking, and financial projections, help managers\nimprove their decision-making abilities, determine how the business is performing relative to competitors, and discover opportunities for\nimprovement. Using these tools to create quantitative and measurable metrics helps an organization see exactly where it is performing\nwell and where it is performing poorly.\nTypes of Quantitative Tools\nDecision Tree\nA decision tree is a branching graph or model of decisions and their possible consequences, including chance event outcomes, resource\ncosts, and utility. Decision trees are commonly used in operations research (specifically in decision analysis) to help identify a strategy\nmost likely to reach a specified goal. They can also be used to map out a thought process or the possible consequences of a decision. A\nmanager may use this tool when deciding between different projects or investments.\nDecision tree: Decision trees are used to determine the consequences and\npotential outcomes of an investment or a project. This decision tree shows\nthe money lost or gained at each step along multiple potential paths of\naction. The path that results in the highest financial gain by the end is\ngenerally the one that should be chosen.\nSimulation\nSimulation is the imitation of a real-world process or system over time. The act of simulating something first requires that a model be\ndeveloped; this model represents the key characteristics or behaviors of the selected physical or abstract system or process. A simulation\ncould be used to study investment decisions by actively playing out what may happen in certain situations.\nTrend Chart\nTrend charts are often used to display data over time to explore any potential trends (either positive or negative) that require additional\nattention by management. Many metrics are analyzed using trend charts, including employee productivity, financial metrics, operational\nefficiency, and comparisons between competitors. Trends are only ever in the past, however, and utilizing confidence intervals when\nprojected with trends is critical to their effectiveness.\nTrend chart: A trend chart shows changes in spending, prices,\nefficiency, or any other metric that management is interested in\nanalyzing over time. This chart of U.S. defense spending from\n2000–2011 shows that overall spending increased from $300 billion\nto $700 billion due to increases in both the Department of Defense\n(DOD) budget and overseas (war-related) spending.\nBenchmarking\nBenchmarking allows a manager to see how different aspects of a business (usually quality, time, and cost) are performing compared to\nnational, regional, and industry standards. It also allows a manager to explore how the company is performing compared to competitors.\nIn the process of benchmarking, management identifies the best firms in the industry, or in another industry where similar processes exist,\nand compares the results and processes of the target firms to management's own results and processes. In this way, management learns\nhow well the targets perform and, more importantly, the business processes that explain why these firms are successful.\nFinancial Projections\nManagers can also use financial analysis as a management tool. When investing in a project or an acquisition of any kind, a manager will\nalways want to know how quickly the investment will bring in a profit. For example, when a company invests in a new building,\nmanagement will calculate how long it will take for the building to generate enough income to cover the upfront cost of the building and\ntherefore start bringing in profits. This calculation is sometimes called a payback period. Payback period intuitively measures how long\nsomething takes to pay for itself. All else being equal, shorter payback periods are preferable to longer payback periods. This is often\nreferred to as an NPV, or a net present value, where the company calculates the future value of the project in today's dollars. It is critical\nto remember that a dollar today and a dollar tomorrow have a different value.\nOperations-Management Tools\nSix Sigma and Lean are two popular operations-management theories that help managers improve the efficiency of their production\nprocesses.\nLearning Objectives\nGive examples of operations management tools that assist the organization in overseeing, designing and controlling production\nprocesses\nKey Takeaways\nKey Points\nThe main tools of operations management come from two popular theories of organizing business: Six Sigma and Lean.\nSix Sigma relies on particular quality -management methods, such as statistical analytics, and creates a special infrastructure of employees\nwithin an organization (e.g., \"Black Belts,\" \"Green Belts\") who are experts in these methods.\nLean is a production theory that considers the expenditure of resources for any goal other than the creation of value for customers\nwasteful, and thus a good target for elimination.\nBy leveraging operational paradigms constructed to deliberately capture value through maximizing efficiency, managers can lower costs\nfor companies and prices for consumers.\nKey Terms\nSix Sigma: A process-improvement method that focuses on statistical methods to reduce the number of defects in a process.\nLean: Lean is a production strategy focused on eliminating all unnecessary waste in production.\nOperations management is a type of management that oversees, designs, and controls a company's production processes. This type of\nmanagement is also tasked with redesigning business operations in the production of goods and/or services, if that is necessary.\nOperations managers are responsible for ensuring that business operations are efficient, both in terms of conserving resources and in\nterms of meeting customer requirements. They manage the process that converts inputs (materials, labor, and energy) into outputs\n(goods and services). In order to accomplish this task, managers utilize various tools, two of the most influential being Six Sigma and Lean.\nSix Sigma\nSix Sigma is a strategy designed to improve the quality of process outputs. The Six Sigma program accomplishes this by identifying and\nremoving the causes of defects (errors) and by minimizing the variability present in manufacturing and business processes.\nThis strategy relies on particular quality-management methods, such as statistical analytics, and creates a special infrastructure of\nemployees within an organization (e.g., \"Black Belts,\" \"Green Belts\") who are experts in these methods. Each Six Sigma project in an\norganization follows a defined sequence of steps and has quantified financial targets such as reducing costs or increasing profits. Among\nthe tools used in Six Sigma are process mapping, trending charts, calculations of potential defects, ratios, and statistics. Best practices for\nwork within a team are also used.\nSix Sigma: Six Sigma is a tool used by\nmany managers when determining\nhow to reduce the number of defects\ncreated by their processes.\nLean\nLean is similar to Six Sigma, but is slightly less focused on defect rate and more focused on eliminating the amount of waste and excessive\nsteps in an operation. Lean is a production theory that considers the expenditure of resources for any goal other than the creation of\nvalue for the customer wasteful, and thus a target for elimination. Beginning from the perspective of the consumer of a product or\nservice, \"value\" is defined as any action or process that a customer would be willing to pay for. Lean employs tools to evaluate production\nworkflow and determine where there is waste. Examples of this waste would be excess motion, inventory, and overproduction.\nExamples of Six Sigma and Lean\nIn many ways, Lean manufacturing and Six Sigma is reminiscent of Henry Ford and systematic process improvements. The overarching\ntheme is simply to minimize time expenditures on behalf of employees and maximize output with the same amount of input. Toyota (and\nthe concept of kaizen) is a fantastic example of Lean manufacturing and what is called just-in-time (JIT) inventory management. Toyota\nbecame famous in manufacturing for timing every specific element of the manufacturing process to ensure that minimal warehousing was\nrequired, delivering each new add-on component at precisely the time it would be needed and in exactly the location it would be\ninstalled. This created a process flow that minimized space usage (lowering costs), optimized timing, and created widespread consistency\nof operational flow.\nLean and Six Sigma are the two main tools for managers in operations management. Both of these operational strategies offer managers\nan extensive toolbox with which to analyze how efficiently their production is running. These tools analyze workflow, evaluate the\npresence and cause of waste, and decrease defects in products or services, all of which make a company more efficient.\nThe Systems Viewpoint\nSystems thinking is an approach to problem solving that considers the overall system instead of focusing on specific parts of a system.\nLearning Objectives\nDefine the systems view as it applies to business strategies and overall organizational control\nKey Takeaways\nKey Points\nSystems thinking is an approach to problem solving that views problems as part of an overall system. This is opposed to problem-solving\nstrategies that only focus on specific parts or outcomes of a problem.\nSystems thinking approaches problems as a set of habits or practices within a framework. It is based on the belief that the component\nparts of a system are best understood in the context of their relationships with each other rather than in isolation.\nSystems thinking is opposed to fragmented thinking, which involves thinking about specific problems without considering the context,\nenvironment, and effects of similar problems.\nKey Terms\nfragmented thinking: Thinking about problems as isolated events instead of considering problems as resulting from a system as a\nwhole.\nSystems thinking is the process of understanding how people and situations influence one another within a closed system. In nature, air,\nwater, movement, plants, and animals interact with one another and survive or perish in relationship with each other. In business,\nmanagement also involves systems thinking.\nOrganizational Systems\nOrganizational systems consist of people, structures, and processes working together to make an organization healthy or unhealthy. The\nend product of effective systems management is synergy, in which the end product has more value than the individual sum of its parts.\nSystems generally contain the following aspects:\nInputs (e.g., people, time, energy, information)\nProcesses or reactions (e.g., tools, software, analyses)\nOutputs (e.g., products, reports, plans)\nFeedback mechanisms (e.g., information, reports)\nSystems thinking:\nFocus on the\ninteraction of isolated\nproblems with one\nanother: just as\nseparate gears work\nwith each other,\nproblems in one area\ncan effect other areas\nin a system as well.\nProblem Solving\nWhen problem-solving, advocates of systems thinking must consider specific problems within an overall system rather than reacting to\nspecific issues or specific outcomes. In systems thinking, problems are conceptualized as a set of habits or practices that exist within a\nframework. Practitioners of systems thinking believe that the component parts of a system can best be understood, and best analyzed, in\nthe context of their relationships with other parts of a system.\nThis method is opposed to a reductive framework that attempts to focus closely on a single problem. In this type of fragmented thinking,\nproblems are addressed without considering the context, environment, or the impact of similar problems. Fragmented thinking often\nresults in solutions that cannot be applied to multiple situations and are unlikely to remain relevant over time. This means management\nwill be putting out more fires because the root problem is unresolved.\nHere is an example of systems thinking: say that a single department, Human Resources, is beset with problems in workflow and\nefficiency. A manager who uses systems thinking to fix this problem looks at Human Resources in the context of all of the workflow in the\ncompany to see whether the \"Human Resources problem\" could actually be a company-wide issue. Only a systems-thinking approach can\nlead to this realization because systems thinking provides insight into how problems that manifest in a specific location can spring from\ndistant, seemingly unrelated locations. This helps managers get an accurate understanding of the problem and facilitates a superior\nresponse to the problem.\nExample\nHere is an example of systems thinking: say that a single department, Human Resources, is beset with problems in workflow and\nefficiency. A manager who uses systems thinking to fix this problem looks at Human Resources in the context of all of the workflow in the\ncompany to see whether the \"Human Resources problem\" could actually be a company-wide issue. Only a systems-thinking approach can\nlead to this realization because systems thinking provides insight into how problems that manifest in a specific location can spring from\ndistant, seemingly unrelated locations. This helps managers get an accurate understanding of the problem and facilitates a superior\nresponse to the problem.\nThe Contingency Viewpoint\nThe contingency viewpoint of management proposes that there is no standard for management; instead, management depends on the\nsituation.\nLearning Objectives\nRecognize the potential flexibility and value that can be captured through considering contingencies and alternatives from a managerial\nperspective\nKey Takeaways\nKey Points\nThe contingency viewpoint is a more recent development in organizational theory that attempts to integrate a variety of management\napproaches, proposing that there is no one best way to organize a corporation or lead a company.\nDebating which one of the previous approaches to management is the \"best\" approach is irrelevant in contingency theory, since the heart\nof the contingency approach is that there is no \"one best way\" for managing and leading an organization.\nThe contingency viewpoint focuses on management's ability to achieve alignments and good fits between employees and circumstances\nby considering multiple solutions to determine the best one for each particular problem.\nThe focal point, and modern relevance, of this perspective is the concept of adaptability. Technology and globalization evolve the\nbusiness environment so rapidly that adaptable strategies are more appropriate than static ones, making contingencies key to success.\nKey Terms\nContingency Viewpoint: A theory of management that proposes that there is no standard for management practice, instead it should\ndepend on the situation.\nThe contingency viewpoint is a more recent development of organizational theory that attempts to integrate a variety of management\napproaches by proposing that there is no one best way to organize a corporation or lead a company. Instead, the optimal course of\naction is contingent or dependent upon the specific internal and external situation management may find itself in.\nPerspective on Previous Theories\nThe contingency approach claims that past theories, such as Max Weber's bureaucracy theory of management and Taylor's scientific\nmanagement, are no longer practiced because they fail to recognize that management style and organizational structure are influenced\nby various aspects of the environment, known as contingency factors. Debating which one of the previous approaches to management is\nthe \"best\" approach is irrelevant in contingency theory, since the heart of the contingency approach is that there is no \"one best way\" for\nmanaging and leading an organization.\nPossibilities: The basic premise behind contingency theory is\nthat there are limitless possibilities that companies must be\nprepared to adapt to strategically.\nAn Outline of Contingency Theory\nBy its nature, contingency theory avoids static rules. There are, however, common contingencies that businesses must react to, including\ntechnology, competition, governments, unions, consumer interest groups, new markets and consumers, and economic factors. Fred\nFiedler takes this a step further to identify three leadership styles and empirical situation measurements to assess the degree of\nfavorability a given contingency offers:\nThe leader -member relationship, which is the most important variable in determining the situation's favorableness.\nThe degree of task structure, which is the second most important input into the favorableness of the situation.\nThe leader's position power obtained through formal authority : this is the third most important dimension of the situation.\nIn other words, leadership needs to ensure that it is able to assess a situation, determine the task structure, and obtain a position of\nformal authority in order to be able to adequately manage a contingency situation.\nAn example of the contingency viewpoint in action is a manager facing a situation with an employee who regularly shows up late to work.\nA manager could have a written protocol for this situation in which there is only one option: give the employee notice. Under the\ncontingency viewpoint, however, the manager may decide to better understand the situation by talking to the employee about why s/he\nis late to work and then deciding on the most effective and appropriate course of action. The value in this lies in the information the\nmanager acquires about the employee: maybe there are extenuating circumstances that can be relatively easy to work around. In this\ncase, the contingency approach allows the employee to keep her/his job and saves the manager from going through the time and trouble\nto dismiss one employee and hire another.\nA leader's ability to manage under the contingency viewpoint depends largely on the nature of the environment and how the\norganization relates to the environment. Therefore, the organizational structure is a major component of the approach that management\nmay take in resolving problems under contingency theory.\nQuality Control and Assurance\nQuality assurance and quality control are intended to ensure that products are created with the fewest number of defects possible.\nLearning Objectives\nDiscuss quality control (QC) and quality assurance (QA) as integral components of an effective organizational management structure\nKey Takeaways\nKey Points\nQuality assurance (QA) refers to planned and systematic activities implemented in a quality system to fulfill the quality requirements for a\nproduct or service.\nQuality control (QC) is a process by which products are tested to uncover defects and the results are reported to management, which\nmakes the decision to allow or deny product release.\nQuality control and quality assurance work together to make sure that a company's products have the lowest possible error rate.\nAs global markets expand, and as outsourcing becomes common practice, QC and QA are increasingly important strategic initiatives.\nWhen companies do not control their manufacturing process, they must invest in controlling the quality of their vendors.\nKey Terms\nFailure testing: Failure testing involves determining the point of stress level in which a product will fail.\nQuality assurance and quality control are two methods of planning and implementing structured methods in a work process to ensure\nthat products are created with the highest possible quality and with the smallest number of defects and problems.\nQuality Assurance\nQuality assurance (QA) refers to the planned and systematic activities implemented in a quality system to fulfill the quality requirements\nfor a product or service It is a systematic measurement compared to a set standard, with process monitoring used to prevent errors. This\ncan be contrasted with quality control, which is focused on process outputs. Two key principles of QA are:\nFit for purpose: The product should be suitable for its intended purpose.\nRight the first time: Mistakes should be eliminated.\nQA includes managing the quality of raw materials, assemblies, products, components, services related to production, management\nprocesses, production processes, and inspection processes. The critical takeaway here is that QA equates to process observations.\nQuality assurance is measured through failure testing and statistical control. Failure testing determines the stress levels under which a\nproduct will fail by exposing it to unanticipated stresses, like intense vibration, temperature, and humidity. Stress testing uncovers\nproblems that can be fixed with simple changes to improve the product. Statistical controls ensure that an organization is producing\nquality products at the lowest possible defect rate. Many organizations use Six Sigma levels of quality, so the likelihood of an unexpected\nfailure is less than four in one million.\nAssembly line and quality control: Many processes, such as\nassembly lines, help ensure quality assurance and control by\nstreamlining the production process.\nQuality Control\nQuality control (QC) is the process of testing finished products to uncover defects and reporting the results to management, which makes\nthe decision to allow or deny product release. It differs from quality assurance, which attempts to improve and stabilize a product, and\neliminate any flaws, during production.\nControls also include product inspection: every product is examined visually before the product is sold into the external market.\nInspectors are provided with lists and descriptions of unacceptable product defects, such as cracks or surface blemishes. Efficient quality\ncontrol depends on top-notch visual examination of products, employee training, and organizational culture.\nQuality control and quality assurance work together to make sure that companies produce products that have the lowest possible error\nrate, so there will be fewer customer complaints and no need to rework the product in the future.\nOutsourcing\nDue to the high degree of vendor dependency, many corporations find their manufacturing processes are conducted outside of their\norganization. This can lead to difficulties in maintaining process quality. In this situation, a corporation needs to invest in QC professionals\nto maintain organizational standards. The primary takeaway here is that QC is not simply an internal concern for many businesses, but\nalso an external vendor selection criteria.\nEvidence-Based Management\nEvidence-based management emphasizes the importance of managers using the scientific method to make decisions.\nLearning Objectives\nDiscuss the modern organizational theory perspective on utilizing evidence-based strategies, as is common in many science disciplines, to\nmake business decisions\nKey Takeaways\nKey Points\nEvidence-based management is rooted in evidence-based medicine, a movement to apply the scientific method to medical practice.\nEvidence-based management is an emerging movement to explicitly use current best practices in managerial decision -making.\nEvidence-based management bases managerial decisions and organizational practices on the best available scientific evidence.\nWhile there is a rich body of academic literature pertaining to tried-and-true managerial strategies, real-world application of such\nresources is relatively rare.\nPromoting evidence-based management is challenging because it can conflict with traditional definitions and expectations of\nmanagement.\nLittle shared terminology exists between managers of different companies, which makes it difficult for managers to hold discussions on\nevidence-based practices. The adoption of evidence-based practices is likely to be organization -specific instead of happening across\norganizations.\nKey Terms\nterminology: The set of terms actually used in any business, art, science, or the like; nomenclature; technical terms; such as, the\nterminology of chemistry.\nEvidence-based management ( EBMgt or EBM) is an emerging movement that explicitly uses current best practices in managerial\ndecision-making. Evidence-based management is rooted in evidence-based medicine, which is the rigorous statistical and experimental\nprocess that new pharmaceuticals go through prior to being deemed safe to use. This results in treatments that are the maximally\neffective and safe for patients. Applying this to business simply means utilizing the scientific method, which integrates rigorous and\nobjective hypothesis testing, in order to identify best practices.\nResearch and Evidence-Based\nManagement: Evidence-Based\nManagement is modeled after\nEvidence-Based Medicine, which\nemphasizes the importance of\nscientific research in decision-\nmaking.\nThe Scientific Method\nEvidence-based management bases managerial decisions and organizational practices on the best available scientific evidence. Practicing\nEBMgt requires managers to collect data, run tests, generate hypotheses, and objectively interpret the findings to create an accurate\ndepiction of the efficacy of a given managerial style or decision. This is quite challenging, because management is much less tangible and\nmeasurable than many other scientific disciplines.\nAn example of EBMgt in practice could be a group of managers in an organization trying to determine how to improve job satisfaction.\nThey could conduct a comprehensive and objective (therefore blind) survey across a large number of organizations, collecting enough\ndata on the organizational reimbursements for employees, employee satisfaction, and company cultures to determine if a positive\ncompany culture is more relevant than salary to job satisfaction. After collecting n number of responses, this data could be assessed\nstatically for a confidence interval, revealing the conclusion to be either significant or insignificant to future management decisions.\nIntegration with Organizations\nWhile there is a rich body of academic literature pertaining to tested and true managerial strategies, real-world application of such\nresources is relatively rare. MBAs and degree holders in business have some exposure to this literature, but rarely move it from the\ntheoretical realm to actual practice. Motivating real-life applications of these studies for management could prove advantageous for\ncompanies looking to improve their managerial effectiveness.\nAn important component of evidence-based management is helping managers understand the importance of backing up decisions with\nsound scientific reasoning. Unfortunately little shared language or terminology exists between managers, which makes it difficult for\nmanagers to hold discussions of evidence-based practices. For this reason, the adoption of evidence-based practices is likely to be\norganization-specific, where leaders take the initiative to build an evidence-based internal culture.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}