{
    "text": "Search... Home Subjects\nBoundless Management\nGroups, Teams, and Teamwork\nDefining Teams and Teamwork\nDefining a Team\nA team is a group of people who collaborate on related tasks toward a common goal.\nLearning Objectives\nDefine teams, particularly as they pertain to the business environment or organizational workplace\nKey Takeaways\nKey Points\nIn a business setting most work is accomplished by teams of individuals. Because of this, it is important for employees to have the skills\nnecessary to work effectively with others.\nOrganizations use many kinds of teams, some of which are permanent and some of which are temporary.\nTeams are used to accomplish tasks that are too large or complex to be done by an individual or that require a diverse set of skills and\nexpertise.\nKey Terms\nteam: A group of people working toward a common purpose.\nA team is a group of people who work together toward a common goal. Teams have defined membership (which can be either large or\nsmall) and a set of activities to take part in. People on a team collaborate on sets of related tasks that are required to achieve an objective.\nEach member is responsible for contributing to the team, but the group as a whole is responsible for the team's success.\nThe meaning of TEAM: A team is a group of people who work together toward a common goal.\nTeams in the Workplace\nSports teams are a good example of how teams work. For instance, a basketball team has individual players who each contribute toward\nthe goal of winning a game. Similarly, in business settings most work is accomplished by teams of individuals who collaborate on activities\nwith defined outcomes. Because teams are so prevalent in business organizations, it is important for employees to have the skills\nnecessary to work effectively with others.\nOrganizations typically have many teams, and an individual is frequently a member of more than one team. Some teams are permanent\nand are responsible for ongoing activities. For instance, a team of nurses in a maternity ward provides medical services to new mothers.\nWhile patients come and go, the tasks involved in providing care remain stable. In other cases a team is formed for a temporary purpose:\nthese are called project teams and have a defined beginning and end point linked to achieving a particular one-time goal.\nThe Purpose of Teams\nOrganizations form teams to accomplish tasks that are too large or complex for an individual to complete. Teams are also effective for\nwork that requires different types of skills and expertise. For example, the development of new products involves understanding customer\nneeds as well as how to design and build a product that will meet these needs. Accordingly, a new product-development team would\ninclude people with customer knowledge as well as designers and engineers.\nDefining Teamwork\nTeamwork involves a set of interdependent activities performed by individuals who collaborate toward a common goal.\nLearning Objectives\nIdentify the processes and activities by which team work gets done\nKey Takeaways\nKey Points\nTeamwork involves shared responsibility and collaboration toward a common outcome.\nTeamwork processes can be divided into three categories: the transition process, action processes, and interpersonal processes.\nFive characteristics of effective teamwork are shared values, mutual trust, inspiring vision, skills, and rewards.\nKey Terms\nteamwork: The cooperative effort of a group of people seeking a common end.\nconflict resolution: Working to resolve different opinions in a team environment.\nconflict: Friction, disagreement, or discord arising between individuals or groups.\nTeamwork involves a set of tasks and activities performed by individuals who collaborate with each other to achieve a common objective.\nThat objective can be creating a product, delivering a service, writing a report, or making a decision. Teamwork differs from individual\nwork in that it involves shared responsibility for a final outcome.\nTeamwork: Human skill involves the\nability to work effectively as a member of\na group and to build cooperative effort in\na team.\nTeamwork Processes\nWhile the substance of the tasks involved in teamwork may vary from team to team, there are three processes that are common to how\nteamwork gets done: the transition process, action processes, and interpersonal processes. During each of these processes, specific sets of\nactivities occur.\n1. The transition process is the phase during which a team is formed. Activities include:\nMission analysis: establishing an understanding of the overall objective\nGoal specification: identifying and prioritizing the tasks and activities needed to achieve the mission\nStrategy formulation: developing a course of action to reach the goals and achieve the mission\n2. Action processes comprise the phase during which a team performs its work. Activities include:\nMonitoring milestones and goals: tracking progress toward completion of tasks and activities\nMonitoring systems: tracking the use of resources such as people, technology, and information\nCoordination: organizing and managing the flow of team activities and tasks\nTeam monitoring and support: assisting individuals with their tasks by, for example, providing feedback and coaching\n3. Interpersonal processes include activities that occur during both the transition and action processes. These include:\nConflict management: establishing conditions to avoid disagreement and resolving conflict when it occurs\nMotivation and confidence building: generating the willingness and ability of individuals to work together to achieve the mission\nAffect management: helping team members to regulate their emotions as they work together\nCharacteristics of Effective Teamwork\nAn effective team accomplishes its goals in a way that meets the standards set by those who evaluate its performance. For instance, a\nteam may have a goal of delivering a new product within six months on a budget of $100,000. Even if the team finishes the project on\ntime, it can be considered effective only if it stayed within its expected budget.\nEffective teamwork requires certain conditions to be in place that will increase the likelihood that each member's contributions—and the\neffort of the group as a whole—will lead to success. Effective teams share five characteristics:\nShared values:a common set of beliefs and principles about how and why the team members will work together\nMutual trust: confidence between team members that each puts the best interest of the team ahead of individual priorities\nInspiring vision:a clear direction that motivates commitment to a collective effort\nSkill/talent:the combined abilities and expertise to accomplish the required tasks and work productively with others\nRewards:recognition of achievement toward objectives and reinforcement of behavior that supports the team's work\nEffective teamwork requires that people work as a cohesive unit. These five characteristics can help individuals collaborate with others by\nfocusing their efforts in a common direction and achieving an outcome that can only be reached by working together.\nThe Role of Teams in Organizations\nBy combining various employees into strategic groups, a team-based organization can create synergies through team processes.\nLearning Objectives\nRecognize the role of a team in an organization, and illustrate the team process.\nKey Takeaways\nKey Points\nDue to global and technological factors, the importance of combining competencies and building strong teams is increasing.\nBy combining resources (both across management levels and functional disciplines), organizations can create unique synergies and core\ncompetencies.\nCross-functional teams utilize a wide variety of unique skill sets to build teams capable of achieving complex objectives.\nWhen carrying out a process in a team, it's important to set objectives and strategy, carry out objectives, and build strong interpersonal\nefficiency.\nKey Terms\nsynergy: The ability for a group to accomplish more together than they could accomplish individually.\ncross-functional teams: Teams with members that have diverse skill sets, enabling synergy across core competencies.\nThe Modern Organization\nTeams are increasingly common and relevant from an organizational perspective, as globalization and technology continue to expand\norganizational scope and strategy. In organizations, teams can be constructed both vertically (varying levels of management) and\nhorizontally (across functional disciplines). In order to maintain synergy between employees and organize resources, teams are\nincreasingly common across industries and organizational types.\nThe Role of Teams\nThe primary role of a team is to combine resources, competencies, skills, and bandwidth to achieve organizational objectives. The\nunderlying assumption of a well-functioning team is one of synergy, which is to say that the output of a team will be greater than the sum\nof each individual's contribution without a team architecture in place. As a result, teams are usually highly focused groups of employees,\nwith the role of achieving specific tasks to support organizational success.\nCross-Functional Teams\nSome organizations have a need for strong cross-functional teams that enable various functional competencies to align on shared\nobjectives. This is particularly common at technology companies, where a number of specific disciplines are combined to produce\ncomplex products and/or services.\nTeam Processes\nWhen considering the role of a team, it's important to understand the various processes that teams will carry out over time. At the\nbeginning of a team set up (or when redirecting the efforts of a team), a transitional process is carried out. Once the team has set\nstrategic goals, they can begin progressing towards the completion of those goals operationally. The final team process is one of\ninterpersonal efficiency, or refining the team dynamic for efficiency and success.\nMore specifically, these processes can be described as follows:\nTransitional Process\nMission analysis\nGoal specification\nStrategy formulation\nAction Process\nMonitoring progress toward goals\nSystems monitoring\nTeam monitoring and backup behavior\nCoordination\nInterpersonal Process\nConflict management\nMotivation and confidence building\nAffect management\nThe Impact of Team Building: This chart allows you to visualize data\nfrom a study on team-building, and its impact on team performance.\nBuilding a strong organizational culture for successful teams requires\ncommitment to team processes.\nTypes of Teams\nDepending on its needs and goals, a company can use a project team, a virtual team, or a cross-functional team.\nLearning Objectives\nRecognize the differences between types of teams and their uses\nKey Takeaways\nKey Points\nAn organization may use different types of teams depending on the work that needs to be accomplished to meet its goals.\nCommon teams include project teams, virtual teams, and cross- functional teams.\nProject teams are created for a defined period of time to achieve a specific goal.\nVirtual teams have members who work in separate locations that are often geographically dispersed.\nCross-functional teams bring together people with diverse expertise and knowledge from different departments or specialties.\nKey Terms\ncross-functional team: A group of people from different departments in an organization working toward a common goal.\nDepending on its needs and goals, a company may use different types of teams. Some efforts are limited in duration and have a well-\ndefined outcome. Other work requires the participation of people from different locations. Still other projects depend on people with a\nbroad and diverse range of knowledge and expertise.\nDifferent Kinds of Teams\nTeams may be permanent or temporary, and team members may come from the same department or different ones. Common types of\nteams found in organizations include project teams, virtual teams, and cross-functional teams.\nProject teams are created for a defined period of time to achieve a specific goal. Members of a project team often belong to different\nfunctional groups and are chosen to participate in the team based on specific skills they can contribute to the project. Software\ndevelopment is most commonly done by project teams.\nVirtual teams have members located in different places, often geographically dispersed, who come together to achieve a specific purpose.\nAcademic researchers often work on virtual teams with colleagues at other institutions.\nCross-functional teams combine people from different areas, such as marketing and engineering, to solve a problem or achieve a goal.\nHealthcare services are frequently delivered by interdisciplinary teams of nurses, doctors, and other medical specialists.\nIt is common for an organization to have many teams, including teams of several types. Effective teamwork depends on choosing the type\nof team best suited to the work that needs to be accomplished.\nAdvantages of Teamwork\nThe benefits of teamwork include increased efficiency, the ability to focus different minds on the same problem, and mutual support.\nLearning Objectives\nIdentify the sources of benefits teamwork creates\nKey Takeaways\nKey Points\nWhen a team works well together as a unit they are able to accomplish more than the individual members can do alone.\nTeamwork creates higher quality outcomes that are more efficient, thoughtful, and effective, as well as faster.\nIndividuals benefit from teamwork through mutual support and a great sense of accomplishment.\nKey Terms\ndiverse: Consisting of many different elements; various.\nefficiency: The extent to which a resource, such as electricity, is used for the intended purpose; the ratio of useful work to energy\nexpended.\nThe primary benefit of teamwork is that it allows an organization to achieve something that an individual working alone cannot. This\nadvantage arises from several factors, each of which accounts for a different aspect of the overall benefit of teams.\nHigher Quality Outcomes\nTeamwork creates outcomes that make better use of resources and produce richer ideas.\nHigher efficiency: Since teams combine the efforts of individuals, they can accomplish more than an individual working alone.\nFaster speed: Because teams draw on the efforts of many contributors, they can often complete tasks and activities in less time.\nMore thoughtful ideas: Each person who works on a problem or set of tasks may bring different information and knowledge to bear,\nwhich can result in solutions and approaches an individual would not have identified.\nGreater effectiveness: When people coordinate their efforts, they can divide up roles and tasks to more thoroughly address an issue. For\nexample, in hospital settings teamwork has been found to increase patient safety more than when only individual efforts are made to\navoid mishaps.\nBetter Context for Individuals\nThe social aspect of teamwork provides a superior work experience for team members, which can motivate higher performance.\nMutual support: Because team members can rely on other people with shared goals, they can receive assistance and encouragement as\nthey work on tasks. Such support can encourage people to achieve goals they may not have had the confidence to have reached on their\nown.\nGreater sense of accomplishment: When members of a team collaborate and take collective responsibility for outcomes, they can feel a\ngreater sense of accomplishment when they achieve a goal they could not have achieved if they had worked by themselves.\nThe total value created by teamwork depends on the overall effectiveness of the team effort. While we might consider simply achieving a\ngoal a benefit of teamwork, by taking advantage of what teamwork has to offer, an organization can gain a broader set of benefits.\nHazards of Teamwork\nTeams face challenges to effective collaboration and achieving their goals.\nLearning Objectives\nIdentify the common pitfalls teams can encounter that limit their performance\nKey Takeaways\nKey Points\nThe social aspect of collaborative work makes teams vulnerable to pitfalls that can hurt performance.\nCommon pitfalls involve poor group dynamics such as weak norms, lack of trust, and interpersonal conflict.\nPoor team-design choices such as size, skill sets, and assignment of roles can negatively affect a team's ability to complete tasks.\nKey Terms\ngroupthink: A process of reasoning or decision making by a group, especially one characterized by uncritical acceptance of or conformity\nto a perceived majority view.\nThe collaborative nature of teams means they are subject to pitfalls that individuals working alone do not face. Team members may not\nalways work well together, and focusing the efforts of individuals on shared goals presents challenges to completing tasks as efficiently\nand effectively as possible. The following pitfalls can lead to team dysfunction and failure to achieve important organizational objectives.\nIndividuals Shirking Their Duties\nSince team members share responsibility for outcomes, some individuals may need to do additional work to make up for those not\ncontributing their share of effort. This can breed resentment and foster other negative feelings that can make the team less effective. One\ncause of this is the failure of the team to establish clear norms of accountability for individual contributions to the group effort.\nSkewed Influence over Decisions\nSometimes an individual or small number of team members can come to dominate the rest of the group. This could be due to strong\npersonalities, greater abilities, or differences in status among members. When individuals either do not feel listened to or believe their\nideas are not welcome, they may reduce their efforts.\nLack of Trust\nEffective collaboration requires team members to have confidence that everyone shares a set of goals. When that belief is missing, some\nindividuals may not feel comfortable sharing their ideas with the group. Lack of trust can also lead to miscommunication and\nmisunderstandings, which can undermine the group's efforts.\nConflicts Hamper Progress\nWhile conflicts are a common aspect of working together and can even be beneficial to a team, they can also negatively affect team\nperformance. For instance, conflict can delay progress on tasks or create other inefficiencies in getting work done.\nLack of Teaming Skills\nWhen team members do not have the collaboration skills needed to work well with others, the overall ability of the team to function can\nbe limited. As a result, conflicts may be more likely to arise and more difficult to resolve.\nMissing Task Skills\nA team that does not have the expertise and knowledge needed to complete all its tasks and activities will have trouble achieving its\ngoals. Poor team composition can lead to delays, higher costs, and increased risk.\nStuck in Formation\nSometimes the group cannot move from defining goals and outlining tasks to executing its work plan. This may be due to poor\nspecification of roles, tasks, and priorities.\nToo Many Members\nThe size of the team can sometimes affect its ability to function effectively. Coordination and communication are more complex in a\nlarger team than in a smaller one. This complexity can mean that decisions must take into account greater amounts of information,\nmeetings are more challenging to schedule, and tasks can take longer to complete.\nGroupthink\nOutcomes can suffer if team members value conflict avoidance and consensus over making the best decisions. People can feel\nuncomfortable challenging the group's direction or otherwise speaking up for fear of breaking a team norm. This phenomenon is known\nas \"groupthink.\" Groupthink can limit creativity, lead to poor choices, or result in mistakes that might otherwise have been avoidable.\nWhile teams offer many benefits, their effectiveness rests on how well members can avoid common pitfalls or minimize their negative\nconsequences when they occur.\nDifferences Between Groups and Teams\nAll teams are groups of individuals, but not all groups are teams.\nLearning Objectives\nDifferentiate between a group and a team\nKey Takeaways\nKey Points\nA group is two or more individuals who share common interests or characteristics and whose members identify with each other due to\nsimilar traits.\nTeams and groups differ in five key ways: task orientation, purpose, interdependence, formal structure, and familiarity among members.\nKey Terms\nteam: Any group of people involved in the same activity, especially referring to sports and work.\ngroup: A number of things or persons that have some relationship to one another. A subset of a culture or of a society.\nWhile all teams are groups of individuals, not all groups are teams. Team members work together toward a common goal and share\nresponsibility for the team's success. A group is comprised of two or more individuals that share common interests or characteristics, and\nits members identify with each other due to similar traits. Groups can range greatly in size and scope. For example, members of the\nmillennial generation are a group, but so is a small book club formed by neighbors who enjoy reading.\nGroups differ from teams in several ways:\nTask orientation: Teams require coordination of tasks and activities to achieve a shared aim. Groups do not need to focus on specific\noutcomes or a common purpose.\nDegree of interdependence: Team members are interdependent since they bring to bear a set of resources to produce a common\noutcome. Individuals in a group can be entirely disconnected from one another and not rely on fellow members at all.\nPurpose: Teams are formed for a particular reason and can be short- or long-lived. Groups can exist as a matter of fact; for example, a\ngroup can be comprised of people of the same race or ethnic background.\nDegree of formal structure: Team members' individual roles and duties are specified and their ways of working together are defined.\nGroups are generally much more informal; roles do not need to be assigned and norms of behavior do not need to develop.\nFamiliarity among members: Team members are aware of the set of people they collaborate with, since they interact to complete tasks\nand activities. Members of a group may have personal relationships or they may have little knowledge of each other and no interactions\nwhatsoever.\nSometimes it is difficult to draw a distinction between a team and a group. For instance, a set of coworkers might meet on occasion to\ndiscuss an issue or provide input on a decision. While such meetings typically have an agenda and thus a purpose and some structure, we\nwould not necessarily think of those in attendance as a team. The activity scope and duration is just too small to involve the amount of\ncoordination of resources and effort that teamwork requires.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}