{
    "text": "Search... Home Subjects\nBoundless Management\nEntrepreneurship and Management\nThe Small Business\nThe Prevalence of Small Businesses\nIndustries with high concentrations of small and medium businesses generally do not require enormous capital investment up front.\nLearning Objectives\nDescribe the characteristics of industries that are represented largely by SMBs (SMEs)\nKey Takeaways\nKey Points\nIf you're going to start a business, it's important to realize that there are specific forces acting upon each industry that affect profit.\nIndustries with high concentrations of small and medium-sized businesses (SMBs) generally do not require an enormous amount of up-\nfront capital investment (i.e., they have lower barriers to entry ).\nGoods producers make and sell some sort of physical product or material, while service providers don't make tangible goods. The service\nindustry tends to be more SMB-friendly, as it (generally) requires fewer assets.\nManufacturing goods competitively involves being able to do so in high volumes in order to remain cost efficient. This requires a large\ninitial investment of capital and access. As a result, manufacturing is more commonly for larger enterprises.\nKey Terms\nservice provider: An organization that operates in areas such as finance, real estate, or buying products from a wholesaler and reselling\nthem to consumers, but does not make tangible goods.\ngoods-producers: An company that makes and sells some sort of physical product or material.\nBarriers to Entry\nIf you're going to start a business, it's important to realize that there are specific forces acting upon each industry that affect profit.\nIndustries with a high concentration of small and medium-sized businesses (SMBs) generally do not require an enormous amount of\ncapital investment up front. The point here is that barriers to entry are central factors in determining the feasibility of the average\nbusiness owner entering a given industry.\nFor example, it is not likely that you would start a company to build airplanes, as that would take a large investment of capital for\nproperty, plant, equipment, and labor. Many restaurants and bars, however, require simple premises and easy to find, local ingredients.\nThis is a smaller barrier to entry, thus there are more SMBs in the restaurant industry than in the aerospace industry.\nGoods or Services?\nWhen thinking about businesses, it can be helpful to divide them into two sections: goods producers and service providers. Goods\nproducers make and sell some sort of physical product or material, while service providers don't make tangible goods. The service\nindustry tends to be more SMB-friendly, as it (generally) requires fewer assets.\nIn the United States, roughly 20% of SMBs are concentrated in the goods-producing sector. The 80% of SMBs that reside in the service-\nproviding sector is largely a reflection of the overall U.S. economy (services over goods), as well as the greater feasibility of service\nindustries for small-scale entry.\nThe high concentration of SMBs in the service-providing sector also reflects a few realities of business. In a global economy,\nmanufacturing goods competitively involves being able to do so in high volumes in order to remain cost efficient. This requires a large\ninitial investment of capital and access to low-cost labor, which are both tough for SMBs to access domestically. Maintaining quality\nacross hundreds of locations in the service-providing sector is also, as you might imagine, not an easy task.\nSmall-business owner: Small businesses\noften begin in the services sector due to a\nnumber of factors.\nSmall Businesses and U.S. Jobs\nHalf of the U.S. private sector is populated by small businesses and the other half by large businesses.\nLearning Objectives\nDiscuss the growth of small businesses in relation to the U.S. economy\nKey Takeaways\nKey Points\nThe U.S. government often defines small and medium-sized businesses (SMBs, also referred to as small and medium-sized enterprises, or\nSMEs) as firms with fewer than 500 employees.\nWhile business has seen great consolidation in recent years, the share of employment in small firms has been relatively stable over the\npast few decades. Just over half of U.S. employees work for SMBs.\nSmall businesses often serve as seeds for new industries, such as Apple and Google did in their early stages. By addressing a need left\nunmet or innovating more rapidly than large multinational corporations, small businesses are able to carve out new niches for themselves.\nRecent advancements in technology can reduce the amount of capital needed to start a small business and increase opportunities to scale\nup rapidly and cost efficiently.\nThe primary hurdle for most SMBs, particularly when they are starting out, is acquiring funding.\nKey Terms\nemployment: The work or occupation for which one is used, and often paid.\nThe private sector consists of a wide variance in business size, grouped into small, medium, and large organizations. The U.S. government\noften defines small and medium-sized businesses (SMBs, also referred to as small and medium-sized enterprises, or SMEs) as firms with\nfewer than 500 employees. Using this definition, just over one-half of the private sector is populated by small businesses and the other\nhalf by large businesses.\nEmployment\nWhile business has seen great consolidation in recent years, the share of employment in small firms has been relatively stable over the\npast few decades. It has fluctuated slightly in response to economic conditions, declining slightly when the economy is doing well and\nincreasing when the economy struggles. This tracks with the slight decline in the small-business share of employment during the late\n1990s and the leveling off in the 2000s.\nEntrepreneurship\nSmall businesses often serve as seeds for new industries, such as Apple and Google did in their early stages. By addressing a need left\nunmet or innovating more rapidly than large multinational corporations, small businesses are able to carve out new niches for themselves.\nRecent advancements in technology can reduce the amount of capital needed to start a small business and increase opportunities to scale\nup rapidly and cost efficiently.\nSmall businesses' share of employment, 1988–\n2006: The small-business share of employment is\nrelatively stable, as shown in the graph above: the\nbold red line representing all small businesses stays\nat around 50 to 55% of the total share of\nemployment.\nFunding\nThe problem all (or at least most) entrepreneurs face on a daily basis is funding, particularly when first starting up. While different\nindustries display differing degrees of entry barriers, most small businesses must obtain a certain amount of capital to begin operations.\nThis can come from a variety of places, including:\nSelf-financing by the owner through cash, equity, etc.\nLoans from friends or relatives\nGrants from private foundations\nPrivate stock issue\nForming partnerships\nAngel investors (i.e. venture capital)\nBank\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}