{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nCreating Strategy: Common Approaches\nStrategic Management\nStrategic management entails five steps: analysis, formation, goal setting, structure, and feedback.\nLearning Objectives\nIdentify the five general steps that allow businesses to develop a strategic process\nKey Takeaways\nKey Points\nStrategic management analyzes the major initiatives, involving resources and performance in external environments, that a company's top\nmanagement takes on behalf of owners.\nThe first three steps in the strategic management process are part of the strategy formulation phase. These include analysis, strategy\nformulation, and goal setting.\nThe final two steps in strategic management constitute implementation. These steps include creating the structure ( internal environment)\nand obtaining feedback from the process.\nBy integrating these steps into the strategic management process, upper management can ensure resource allocation and processes align\nwith broader organizational purpose and values.\nKey Terms\nobjectives: The goals of an organization.\nimplementation: The process of moving an idea from concept to reality. In business, engineering, and other fields, implementation refers\nto the building process rather than the design process.\nStrategic management analyzes the major initiatives, involving resources and performance in external environments, that a company's top\nmanagement takes on behalf of owners. It entails specifying the organization 's mission, vision, and objectives, as well as developing\npolicies and plans which allocate resources to drive growth and profitability. Strategy, in short, is the overarching methodology behind the\nbusiness operations.\nStrategic management framework: The above model is a summary of\nwhat is involved in each of the five steps of management: 1. analysis\n(internal and external), 2. strategy formation (diagnosis and decision-\nmaking), 3. goal setting (objectives and measurement), 4. structure\n(leadership and initiatives), and 5. control and feedback (budgets and\nincentives).\nFive Steps of Strategic Management\nAs strategic management is a large, complex, and ever-evolving endeavor, it is useful to divide it into a series of concrete steps to\nillustrate the process of strategic management. While many management models pertaining to strategy derivation are in use, most\ngeneral frameworks include five steps embedded in two general stages:\nFormulation\nAnalysis – Strategic analysis is a time-consuming process, involving comprehensive market research on the external and competitive\nenvironments as well as extensive internal assessments. The process involves conducting Porter's Five Forces, SWOT, PESTEL, and value\nchain analyses and gathering experts in each industry relating to the strategy.\nStrategy Formation – Following the analysis phase, the organization selects a generic strategy (for example, low-cost, differentiation, etc.)\nbased upon the value-chain implications for core competence and potential competitive advantage. Risk assessments and contingency\nplans are also developed based upon external forecasting. Brand positioning and image should be solidified.\nGoal Setting – With the defined strategy in mind, management identifies and communicates goals and objectives that correlate to the\npredicted outcomes, strengths, and opportunities. These objectives include quantitative ways to measure the success or failure of the\ngoals, along with corresponding organizational policy. Goal setting is the final phase before implementation begins.\nImplementation\nStructure – The implementation phase begins with the strategy in place, and the business solidifies its organizational structure and\nleadership (making changes if necessary). Leaders allocate resources to specific projects and enact any necessary strategic partnerships.\nFeedback – During the final stage of strategy, all budgetary figures are submitted for evaluation. Financial ratios should be calculated and\nperformance reviews delivered to relevant personnel and departments. This information will be used to restart the planning process, or\nreinforce the success of the previous strategy.\nCombining Internal and External Analyses\nUsing combined external and internal analyses, companies are able to generate strategies in pursuit of competitive advantage.\nLearning Objectives\nApply a comprehensive understanding of internal and external analyses to the effective formation of new strategic initiatives\nKey Takeaways\nKey Points\nOrganizations must carefully consider what internal assets are available that will differentiate them from the competition, within the same\ncompetitive environment.\nSimilarly, organizations must understand the context in which they operate if they aspire to acquire competitive advantage over other\nincumbents.\nBy understanding how internal and external factors relate, companies can piece together the ideal way in which their strengths can\ncapture opportunities while offsetting threats and rectifying weaknesses.\nImplementing strategies that take into account both the internal and external environments will likely achieve competitive advantage and\nimprove an organization's ability to adapt. This is profit-generating strategic thinking.\nKey Terms\ninternal: Concerned with the non-public affairs of a company or other organization.\nexternal: Concerned with the public affairs of a company or other organization.\nOrganizations must carefully consider what internal assets will differentiate them from the competition, within the same competitive\nenvironment. This internal analysis requires careful consideration of the following models and factors:\nCore mission\nOverall strategy\nPorter's competitive strategies\nSWOT analysis\nForecasts\nResource-based view\nSWOT ANALYSIS\nHelpful Harmful\nto achieving the objective to achieving the objective\nnigiro )noitazinagro\nStrengths Weaknesses lanretnI eht\nfo\nsetubirtta(\nnigiro )tnemnorivne\nOpportunities Threats lanretxE\neht\nfo\nsetubirtta(\nSWOT Analysis: Here is an example of\nthe SWOT analysis matrix, which\narranges strengths, weaknesses,\nopportunities, and threats.\nSimilarly, organizations must understand the context in which they operate if they aspire to acquire competitive advantage over other\nincumbents. Models such as the following outline these concerns effectively:\nPorter's five forces (and limitations)\nPESTEL and SCP\nCompetitive dynamics\nMerging Analyses for Competitive Advantage\nThese inputs generally outline each of the specific analyses a company should conduct to understand its internal and external\nenvironments. Combining these two constitutes context analysis, which is a method of analyzing the environment in which a business\noperates. Environmental scanning focuses mainly on the macro-environment of a business. Context analysis considers the entire\nenvironment of a business, both internal and external.\nUsing context analysis, alongside the necessary external and internal inputs, companies are able to generate strategies which actively\ncapitalize on this knowledge in pursuit of competitive advantage. This strategic development requires companies to understand the\nopportunities and threats in the external environment and benchmark these against the strengths and weaknesses of their internal\nenvironment. By understanding how internal and external factors relate, companies can piece together the ideal way in which their\nstrengths can capture opportunities while offsetting threats and rectifying weaknesses.\nThis melding of internal and external factors in pursuit of competitive advantage is an ongoing process, as the company must evolve and\nchange in concert with the environment. As a result, strategic management is the process of constantly assessing both environments to\nensure that the company retains a unique competitive position in which to generate value for stakeholders and customers. This\nimplementation of strategies that take into account both the internal and external environments eventually achieves dynamic capabilities\nfor the companies involved.\nChange is costly, so firms must develop processes to find low pay-off changes. The ability to change depends on the ability to scan the\nenvironment, evaluate markets, and quickly accomplish reconfiguration and transformation ahead of the competition. These actions can\nbe supported by decentralized structures, local autonomy, and strategic alliances.\nImplementing Strategy\nStrategic planning involves managing the implementation process, which translates plans into action.\nLearning Objectives\nDefine the necessary processes involved in executing and implementing a newly created strategy\nKey Takeaways\nKey Points\nThe implementation process requires establishing or modifying the organizational hierarchy, allocation of resources, accountability, and\ncontrol processes.\nDepending on industry and geographic location, implementation often requires integrating an organization with other firms via strategic\npartnerships (suppliers, joint ventures, acquisitions, etc.).\nTo implement a strategy requires moving beyond the theoretical and research-based view. This demands practical pragmatism on the\npart of senior strategists.\nAction plans that describe the way processes are transformed into tangible operations are a critical success factor and often a point of\ndifficulty for conceptual strategists.\nKey Terms\nhierarchy: An arrangement of items in which the items are represented as being \"above,\" \"below,\" or \"at the same level as\" one another.\nimplementation: The process of moving an idea from concept to reality. In business, engineering, and other fields, implementation refers\nto the building process rather than the design process.\nexecute: To carry out; to put into effect.\nThe implementation process requires establishing or modifying an organizational hierarchy so the company can achieve its objectives.\nThe following stages constitute the strategic implementation process:\nAllocating and managing sufficient resources (financial, personnel, operational support, time, technology support)\nEstablishing a chain of command or some alternative structure (such as cross-functional teams)\nAssigning responsibility of specific tasks or processes to specific individuals or groups. Accountability is critical to the action plan process.\nCreating a feedback loop for control processes\nStrategy implementation also involves managing the overall process. Process management comprises monitoring results, measuring\nbenchmarks, following best practices, evaluating the efficacy and efficiency of the process, controlling for variances, and making\nadjustments to the process as necessary. When an organization implements specific programs, it must acquire the requisite resources,\ndevelop the process, train, and perform process testing, documentation, and integration with legacy processes.\nA visual depiction of the strategic management process: The\nstrategic management process never ends. The process restarts after a\nplan ends, when the company reviews the results and re-evaluates its\nposition.\nAdditionally, businesses must consider the exact means of implementing a strategy, which may entail:\nAlliances with other firms to fill capability/technology/resource/legal gaps\nInvestment in internal development\nMergers/acquisitions of products or firms to reduce time to market\nDoing business with protectionist countries such as India and China, which require market entrants to operate via partnerships with local\nfirms\nExecuting a Strategic Plan\nOne of the core goals when drafting a strategic plan is to develop it in a way that is easily translated into action plans. Most strategic\nplans address high-level initiatives and overarching goals but are not always translated into the day-to-day projects and tasks required to\nachieve the plan.\nPoor terminology or word choice and the wrong level of writing are both examples of ways to fail to translate a strategic plan so that it\nmakes sense and is executable. Often, plans are filled with conceptual terms that do not connect to day-to-day realities for the staff that is\nexpected to carry out the plans. Strategists need to be both practical and pragmatic when devising strategy for effective implementation.\nPut simply, walking the talk is easy to say and difficult to accomplish. Strategy formulation must always consider the implementation\nphase as the primary framework. Action plans that describe the way processes are transformed into tangible operations are a critical\nsuccess factor and often a point of difficulty for conceptual strategists.\nMaintaining Control\nControlling requires taking an aerial view of operational processes, identifying gaps and weaknesses to improve efficiency.\nLearning Objectives\nApply the concept of maintaining control to planning and strategy\nKey Takeaways\nKey Points\nDissonance is often present between the way in which the company ideally wants to operate from a strategic perspective and the way it\nactually does.\nPlanning and controlling are closely linked. Planning is the benchmark which controlling uses to outline deviations. In this sense, they are\ntwo sides of the same strategic process of improvement.\nOnce a company designs a strategic plan parallel with the corporate mission and vision, the implementation process requires both control\nand planning to ensure it is appropriately communicated and executed.\nManagers are tasked with ensuring that the organizational processes reflect the mission statement and vision as closely as possible,\ncontrolling aspects of the operations in pursuit of this goal.\nKey Terms\nplanning: The act of formulating a course of action, or of drawing up plans.\ncontrolling: To exercise influence over, to suggest or dictate the behavior of.\nControlling is one of the primary theoretical managerial functions (alongside planning, organizing, staffing, and directing). Maintaining\ncontrol is about identifying deviations from intended results and improving the process to achieve desired outcomes. According to\nmodern concepts, control is a foreseeing action; an earlier concept of control identified it as chiefly detecting errors.\nControl in management means setting standards, measuring actual performance, and taking corrective action. Control thus comprises\nthree main questions: Where are we now? Where did we plan to be? How can we bridge the gap between the two? Control is inherently\ncyclical.\nMonitoring and controlling project activities:\nThese steps are involved in management control\nof project activities.\nRobert J. Mockler on Control\nRobert J. Mockler presented a more comprehensive definition of managerial control. He defined it as a systematic effort by business\nmanagement to compare performance to predetermined standards, plans, or objectives to assess whether performance is in line with\nthese standards and presumably to take any remedial action required. According to Mockler, the purpose of control is to ensure that\nhuman and other corporate resources are being used in the most effective and efficient way possible in achieving corporate objectives.\nRelationship Between Planning and Controlling\nMockler's definition shows the close link between planning and controlling. Planning is a process which establishes an organization 's\nobjectives and the methods to achieve those objectives. Controlling is a process that measures and directs the actual performance against\nthe planned goals of the organization. Thus, goals and objectives are often referred to as Siamese twins of management: managing and\ncorrecting performance to make sure that enterprise objectives and the goals designed to attain them are accomplished.\nApplication to Strategy\nControl, relative to strategy, defines the latter stage of overall strategy. Once a company designs a strategic overview parallel with the\ncorporate mission and vision, the implementation process requires control to ensure that strategy is appropriately communicated and\nexecuted. The direction of organizational control derives from the strategic plan of the organization. Control is an active process that\nevaluates current performance against this strategic backdrop to ascertain how closely the operations represent the desired functioning\nof the company.\nDissonance is often present between the way in which the company ideally wants to operate from a strategic perspective and the way it\nactually does. This is where control comes into play. Managers are tasked with ensuring that the organizational processes reflect the\nmission statement and vision as closely as possible, controlling aspects of the operations in pursuit of this goal. As a result, maintaining\ncontrol is a constant responsibility that keeps the business as close as possible to its core strategies.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}