{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nCompensation and Motivation\nMonetary Employee Compensation\nMonetary compensation can be either guaranteed (base) pay or variable pay and positively correlates with job satisfaction.\nLearning Objectives\nIdentify the different cash compensation models (i.e., guaranteed and variable) and the behavioral implications of using monetary\ncompensation\nKey Takeaways\nKey Points\nThe basic element of guaranteed pay is the base salary, paid on an hourly, daily, weekly, bi-weekly, or monthly rate.\nVariable pay is a monetary (cash) reward, such as a bonus or commission, that is contingent on performance or results achieved.\nFor many years, bonuses have been considered an incentive program that reinforces positive and efficient behavior among employees.\nGenerally speaking, employees who feel that they are underpaid relative to their skill levels do not perform as well as those who feel that\nthey are appropriately compensated.\nKey Terms\ncommission: A fee charged by an agent or broker for carrying out a transaction; for example, a finder's fee.\nVariable Pay: A monetary (cash) reward that is contingent on discretion, performance, or results achieved.\nBase Pay\nMonetary compensation includes both guaranteed (base) and variable pay. The basic element of guaranteed pay is the base salary, paid\non an hourly, daily, weekly, bi-weekly, or monthly rate. Many countries dictate the minimum base salary by defining a minimum wage.\nU.S. Minimum Wage Map, 2007: A map of the United States\ncomparing state minimum wage laws to the federal minimum wage.\nKansas is the only state with a minimum wage rate lower than the\nfederal one.\nIndividual skills and experience levels of employees leave room for differentiation of income levels within the job-based pay structure. In\naddition to base salary, other pay elements are based solely on employee/employer relations, such as salary and seniority allowance.\nSalaries and wages are tied to a job description that lays out the expectations and responsibilities of an employee. Management can refer\nto job descriptions to determine whether employees qualify for raises.\nVariable Pay\nVariable pay is a monetary reward that is contingent on discretion, performance, or results achieved. There are different types of variable\npay plans, such as bonus schemes, sales incentives (commission), overtime pay, and more. Variable pay is common in industries such as\nreal estate or insurance, where pay is based on commission or the amount of sales generated by the employee. In a typical variable pay\nplan, the salesperson might receive 50 percent of every dollar he brings in up to a defined level of revenue, after which pay increases to\n85 percent for every dollar earned.\nBonuses represent another type of variable pay, one based on an employee's performance during a certain period of time. Employees\nwho are performing particularly well during a year may receive an additional bonus that is above their base salary or commission\npercentage.\nMonetary Compensation and Behavior\nFrom a behavioral perspective, bonuses have been studied to ascertain their effectiveness as an employee incentive to improve\nperformance. B.F. Skinner, a behavioral psychologist, studied behavioral reactions to extrinsic environmental consequences such as\nreinforcement or punishment. Drawing on Skinner's perspective, bonuses have served for a number of years as an incentive program to\nreinforce positive, efficient behavior among employees.\nAdditionally, behavioral and organizational psychologists have considered salaries in comparison with skill level to determine how\nemployees perform based on their wage level. The results of these studies show that employees who feel that they are underpaid relative\nto their skill levels will not perform as well as they would if they felt that they were appropriately compensated.\nThe effect of compensation on employee job satisfaction has also been studied. Not surprisingly, employees who are paid more are more\nsatisfied with their jobs and less inclined to leave their employers—up to a certain point (i.e., salary level). While the amount of that exact\npoint is frequently debated, experts generally agree that somewhere beyond the ballpark of a six-figure salary range reflects diminishing\nreturns (i.e., no additional benefit to the organization for paying the individual more).\nNon-Monetary Employee Compensation\nNon-monetary compensations (e.g., benefits) are essential in recruiting skilled employees and maintaining a satisfied workforce.\nLearning Objectives\nDiscuss non-monetary compensation benefits within the larger framework of motivation\nKey Takeaways\nKey Points\nExamples of non-monetary compensation include benefits, flex-time, time off, free or discounted parking, gym membership discounts,\nretirement matching, mentoring programs, tuition assistance, and childcare.\nA benefits plan is designed to address a specific need and is often provided in a non-cash form. Many countries dictate certain minimum\nbenefits, such as paid time off, employer's pension contribution, and sick pay.\nMany skilled laborers will not accept a position without at least a simple benefits package. It is standard practice in U.S. culture to offer a\nbasic amount of non-monetary benefits to full-time, permanent employees.\nKey Terms\nnon-monetary: Payment in the form of benefits, flex-time, time off, free or discounted parking, gym membership discounts, retirement\nplans, mentoring, tuition assistance, child care, or other non-cash option.\nBenefits as Incentives\nNon-monetary benefits are essential to attracting a productive workforce. Many skilled laborers will not accept a position that does not\noffer at least a simple benefits package. It is standard practice in U.S. culture to offer basic non-monetary benefits to full-time, permanent\nemployees. Part-time and contract workers are not always offered these benefits, partly as a result of the high cost to businesses.\nOffering benefits above the expected amount can be an incentive program and used to recruit highly skilled employees to an\norganization. For example, skilled employees may be more likely to join an organization that offers free onsite parking, retirement\nbenefits, and extra paid time off than an organization that does not offer these fringe benefits. Companies also use non-monetary\nbenefits to increase and maintain employee morale and satisfaction.\nBenefits can be a key element in addressing the lowest level of Maslow's needs hierarchy. If employees do not feel that an organization is\ntreating them fairly with respect to basic needs (food, money for retirement, etc.), then they are likely to be less satisfied with their jobs,\nperform at a lower level, or leave. Those who do not feel their basic needs are met may also fail to reach higher levels of motivation.\nBenefit Types\nEmployers have several options with respect to non-monetary compensation. These can include benefits (including medical or other\ninsurance), flex-time, time off, free or discounted parking, gym membership discounts, retirement matching, mentoring programs, tuition\nassistance, and childcare. All of these benefits communicate to employees that their work is valued and promote a positive work-life\nbalance. The idea behind benefits is to build a community and support system, which enables employees to focus on work rather than\nworry about life.\nThe largest category of non-monetary compensation includes benefits. Employee benefits can include paid time off, insurance (life,\nmedical/dental, or disability coverage), and pension plans.\nLegalities and Benefits\nMany countries dictate different minimum benefits, such as paid time off, employer's pension contribution, and sick pay. In the U.S.,\nbenefits may include a health plan to which the company contributes and that sometimes includes vision and dental coverage, along with\nbasic health coverage. Some governments mandate benefits such as retirement savings matching, but organizations can offer additional\nretirement benefits through a matching plan.\nHealth insurance distribution (under 65 years): Health\ninsurance includes employer-sponsored health insurance,\nmilitary health care, Medicaid, Medicare, and non-group health\ninsurance. The largest group of insured Americans consists of\nmiddle- and upper-class employees receiving health insurance\nthrough employers. 16% of Americans remain uninsured.\nFinancial Rewards for Managers\nFinancial rewards are often used as a tool to motivate managers to perform better.\nLearning Objectives\nIdentify the relationship between management and pay-for-performance financial incentives.\nKey Takeaways\nKey Points\nIncentive programs, also known as \"pay for performance,\" provide employees, consumers, or providers with financial rewards as a way of\nmotivating better performance.\nThe view that managers are most responsible for strategic planning and decision making is part of the rationale for financial incentive\nprograms. In this view, financial rewards such as bonuses are a performance-based incentive to improve productivity.\nOne risk of incentive schemes is ethical hazard. Offering incentives to hit specific targets can result in the target becoming the primary\ngoal, rather than the improvement of the company's performance as a whole.\nThe recession of 2008–2010 made it more difficult for businesses to offer managers monetary rewards.\nKey Terms\nincentive: Reward used to motivate employees toward better performance.\nIncentive programs, also known as \"pay for performance,\" provide employees, consumers, or providers with financial rewards as a way of\nmotivating better performance. Various behavioral factors might be considered prior to establishing an incentive program, including the\ntarget audience's motivation, skills, recognition, understanding of the goals, and ability to measure progress. The interest of participants\nplays a vital role in determining an incentive program, as the goal is to motivate their behavior.\nPay-for-Performance Jobs\nPay-for-performance programs are quite common in a number of industries, most notably sales. A sales role often features a contractual\nagreement that stipulates a certain percentage of a given representative's sales contribute to that sales rep's own salary. This motivates\nsales professionals to pursue higher success rates, as their own income will directly correlate with their efficacy.\nOther types of pay-for-performance jobs are found in the manufacturing, restaurant, and financial industries. The basic premise is simple:\nthe more sales or profits generated by the individual, the larger the share of the organization 's profit that individual will receive in return.\nIncentive Programs\nManagerial roles can function similarly to these pay-for-performance jobs, where the success of the company (or department) will directly\naffect the salary of the manager. Managers are often motivated by financial rewards. Like other pay-for-performance programs, the\nincentive programs for managers are designed to increase their performance as well as the overall performance of the company. These\nand other incentive programs are often used to reduce turnover, boost morale and loyalty, improve employee wellness, increase\nretention, and drive performance.\nThe financial rewards of upper management are often the highest in the organization. Such financial incentive programs are based on the\nunderstanding that the top managers within a business are the most responsible for strategic planning and decision making. In this view,\nfinancial rewards like bonuses serve as an incentive for senior management to improve performance.\nCEO pay growth compared to employee salaries, U.S. gross\ndomestic product, and overall U.S. corporate profits: CEOs, as\nprimary examples of upper managerial salary, receive high salaries\nin comparison to other gross income indicators. This contrast may\nbe a result of the differing pay structure often associated with\nupper management.\nA risk of incentive schemes is ethical hazards. Offering incentives to hit specific targets means the targets themselves can become the\nprimary goal, rather than the improvement of the company's performance as a whole. This mindset may cause a reduction in overall\nperformance—even as the rate of hitting targets climbs. In the wake of the global recession of 2008–2010, financial incentive schemes\nreceived greater criticism and oversight, partly for this very reason.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}