{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nTechnology and Innovation\nTechnology as a Driver and Enabler of Innovation\nTechnology is a powerful driver of both the evolution and proliferation of innovation.\nLearning Objectives\nExamine the role of technology as a driver of competitive advantage and innovation in the business framework\nKey Takeaways\nKey Points\nInnovation is a primary source of competitive advantage for companies in essentially all industries and environments and drives efficiency,\nproductivity, and differentiation to fill a higher variety of needs.\nTechnology builds upon itself, enabling innovative approaches within the evolution of technology.\nTechnological hubs such as California's Silicon Valley provide powerful resources that entrepreneurs and businesses can leverage in\npursuing innovation.\nTechnological advances, particularly in communication and transportation, further innovation.\nIndia, China, and the United States are all strong representations of how embracing technology leads to innovation, which in turn leads to\neconomic growth.\nKey Terms\nproliferate: To increase in number or spread rapidly.\ninnovation: The introduction of something new; the development of an original idea.\nScalable: Able to change in size or to scale up.\nInnovation is a primary source of competitive advantage for companies in essentially all industries and environments, and drives forward\nefficiency, higher productivity, and differentiation to fill a wide variety of needs. One particular perspective on economics isolates\ninnovation as a core driving force, alongside knowledge, technology, and entrepreneurship. This theory of innovation economics notes\nthat the neoclassical approach (monetary accumulation driving growth) overlooks the critical aspect of the appropriate knowledge and\ntechnological capabilities.\nScaling Technology\nTechnology in particular is a powerful driving force in innovative capacity, particularly as it pertains to both the evolution of innovations\nand the way they proliferate. Technology is innately scalable, demonstrating a consistent trend toward new innovations as a result of\nimproving upon current ones. Product life cycles shows how economic returns go through a steep exponential growth phase and an\neventual evening out, which motivates businesses to leverage technology to produce new innovations.\nTechnology Hubs\nTechnological Innovation Chart: This\nchart demonstrates the pattern of\ninnovation over time. Note the\noverlapping trajectories of technologies:\none product may dominate the market\nand grow at a high rate; the next\n(\"emerging\") product may start low while\nthe other product is dominant but in turn\ngrow to dominate the market even more\nthoroughly than the first, as technology\nand production are refined and improved.\nThe proliferation of innovation pertains to two important factors of technology driving innovation: the creation of geographic hubs for\ntechnology and empowerment of knowledge exchange through communication and transportation. Places like California's Silicon Valleya\nand Baden-Wurttenberg, Germany are strong examples of the value of technological hubs. The close proximity of various resources and\ncollaborators in each hub stimulates a higher degree of innovative capacity.\nCommunication and cumulative knowledge in these technology hubs allows for these innovations to spread via technology to be\nimplemented across the globe with relative immediacy. This spread of ideas can be built upon quickly and universally, creating the ability\nfor innovation to be further expanded upon by different parties across the globe. Collaboration on a global scale as a result of\ntechnological progress has allowed for exponential levels of innovation.\nCorrelations Between Technology, Innovation, and Growth\nEmpirical evidence generates a positive correlation between technological innovation and economic performance. Between 1981 and\n2004, India and China, developed a National Innovation System designed to invest heavily in R&D with a particular focus on patents and\nhigh-tech and service exports. During this timeframe, both countries experienced extremely high levels of GDP growth by linking the\nscience sector with the business sector, importing technology, and creating incentives for innovation.\nAdditionally, the Council of Foreign Relations asserted that the U.S.' s large share of the global market in the 1970s was likely a result of its\naggressive investment in new technologies. These technological innovations generated are hypothesized to be a central driving force in\nthe steady economic expansion of the U.S., allowing it to maintain it's place as the world's largest economy.\nThe Technology Life Cycle\nThe technology life cycle describes the costs and profits of a product from technological development to market maturity to decline.\nLearning Objectives\nCategorize the four distinct stages in the technology life cycle and apply the five demographic consumer groups in the context of these\nstages\nKey Takeaways\nKey Points\nThe technology life cycle seeks to predict the adoption, acceptance, and eventual decline of new technological innovations.\nUnderstanding and effectively estimating technology life cycle allows for a more accurate reading of whether and when research and\ndevelopment costs will be offset by profits.\nThe technology life cycle has four distinct stages: research and development, ascent, maturity, and decline.\nThe adoption of these technologies also has a life cycle with five chronological demographics: innovators, early adopters, early majority,\nlate majority, and laggards.\nBy leveraging these models, businesses and institutions can exercise some foresight in ascertaining return on investment as their\ntechnologies mature.\nKey Terms\nForesight: The ability to accurately estimate future outcomes.\ndemographic: A characteristic used to identify people within a statistical framework.\ncompetitive advantage: Something that places a company or a person above the competition.\nThe technology life cycle (TLC) describes the costs and profits of a product from technological development phase to market maturity to\neventual decline. Research and development (R&D) costs must be offset by profits once a product comes to market. Varying product\nlifespans mean that businesses must understand and accurately project returns on their R&D investments based on potential product\nlongevity in the market.\nDue to rapidly increasing rates of innovation, products such as electronics and pharmaceuticals in particular are vulnerable to shorter life\ncycles (when considered against such benchmarks as steel or paper). Thus TLC is focused primarily on the time and cost of development\nas it relates to the projected profits. TLC can be described as having four distinct stages:\nTechnology life cycle chart: This chart\nillustrates the stages in the technological life\ncycle.\nResearch and Development - During this stage, risks are taken to invest in technological innovations. By strategically directing R&D\ntowards the most promising projects, companies and research institutions slowly work their way toward beta versions of new\ntechnologies.\nAscent Phase - This phase covers the timeframe from product invention to the point at which out-of-pocket costs are fully recovered. At\nthis junction the goal is to see to the rapid growth and distribution of the invention and leverage the competitive advantage of having the\nnewest and most effective product.\nMaturity Stage - As the new innovation becomes accepted by the general population and competitors enter the market, supply begins to\noutstrip demand. During this stage, returns begin to slow as the concept becomes normalized.\nDecline (or Decay) Phase - The final phase is when the utility and potential value to be captured in producing and selling the product\nbegins dipping. This decline eventually reaches the point of a zero-sum game, where margins are no longer procured.\nProduct development and capitalizing on the new invention covers the business side of these R&D investments in technology. The other\nimportant consideration is the differentiation in consumer adoption of new technological innovations. These have also been distributed\ninto phases which effectively summarize the demographic groups presented during each stage of TLC:\nTechnology adoption life cycle: This adoption chart highlights the\nway in which consumers embrace new products and services.\nInnovators - These are risk-oriented, leading-edge minded individuals who are extremely interested in technological developments (often\nwithin a particular industry). Innovators are a fractional segment of the overall consumer population.\nEarly Adopters - A larger but still relatively small demographic, these individuals are generally risk-oriented and highly adaptable to new\ntechnology. Early adopters follow the innovators in embracing new products, and tend to be young and well-educated.\nEarly Majority - Much larger and more careful than the previous two groups, the early majority are open to new ideas but generally wait\nto see how they are received before investing.\nLate Majority - Slightly conservative and risk-averse, the late majority is a large group of potential customers who need convincing before\ninvesting in something new.\nLaggards - Extremely frugal, conservative, and often technology-averse, laggards are a small population of usually older and uneducated\nindividuals who avoid risks and only invest in new ideas once they are extremely well-established.\nTaking these two models into consideration, a business unit with a new product or service must consider the scale of investment in R&D,\nthe projected life cycle the technology will likely maintain, and the way in which customers will adopt this product. By leveraging these\nmodels, businesses and institutions can exercise some foresight in ascertaining the returns on investment as their technologies mature.\nAssessing an Organization's Technological Needs\nAssessing the internal technological assets and future needs of an organization prepares management for successful technology\nintegration.\nLearning Objectives\nApply the four strategies of information gathering and introspection that allow for effective assessment of technology needs in an\norganization\nKey Takeaways\nKey Points\nCompanies must prioritize their ability to assess their technological needs, particularly as they may relate to achieving optimal efficiency\nand productivity.\nCompanies looking to stay ahead of the competition should gather data internally and externally to facilitate forecasting and the crafting\nof implementation technology strategies.\nIn addition to noting new technological advances, the assessment process is also heavily internal and necessitates that companies isolate\ntheir technological strengths and weaknesses.\nKey Terms\nintrospection: Self-assessment, or an individual or company looking inward to measure certain strengths and weaknesses.\nforecasting: To estimate how a condition will be in the future.\nproductivity: The rate at which products and services are produced relative to a particular workforce.\nRemaining competitive and remaining technologically vigilant are virtually synonymous at this point in business development. Companies\nmust prioritize their ability to assess their technological needs, particularly as they may relate to achieving optimal efficiency and\nproductivity. There are various concepts that are typical of this managerial technology assessment strategy:\nTechnology Strategy - identifying the logic or role of technology within the company.\nTechnology Forecasting - identifying applicable technologies for the company, potentially through scouting.\nTechnology Roadmapping - ascertaining the trajectories of technological advancement and applying business or market needs to this\nassessment.\nTechnology Portfolios - accumulating all technologies relevant to products or operations to determine which are ideal for internal\nimplementation.\nAll four of these strategies revolve both around information gathering and introspection into business operations and processes. All four\ncan be improved upon through technological advances. Integrated planning in pursuit of optimization through new technologies keeps\nefficiency at or above competitive levels. This internal technology assessment also includes noting when and whether it is necessary to\nconstruct employee training programs for new technology.\n100\n75\nMarket\nshare\n50\n%\n25\n0\nInnovators Early Early Late Laggards\n2.5 % Adopters Majority Majority 16 %\n13.5 % 34 % 34 %\nTechnology and Market Share: As successive groups of consumers\nadopt new technology a bell curve emerges - this is referred to as the\ninnovation adoption life cycle (the blue bell curve on the above\ngraphic). The percentages on the x-axis indicate the size of the\npopulations (relative to the entire consumer group for a given good) in\neach segment. By keeping pace with technological innovation, and\noffering products early enough to capture the majority of the market,\nbusinesses can gain competitive advantage. If a business is too late to\nenter a newly emerged technological market, it can be quite difficult to\nattain a high percentage of the market share, as represented on the y-\naxis (which has often been claimed by other incumbents, as the\nintersecting yellow line on the graph indicates).\nUnderstanding Current Trends in Technology\nUnderstanding current technologies and trends allows a company to align and synchronize operations to optimize returns on innovation.\nLearning Objectives\nRecognize the importance of keeping pace with current technologies and trends to retain competitive capacity and identify the four\nspecific dimensions of business technology management (BTM)\nKey Takeaways\nKey Points\nBusiness technology management (BTM) provides a bridge between previously established tools and standards within a business\nenvironment and the newer, more operationally efficient tools and standards technological progress provides.\nAligning technologies with current business initiatives and strategies is the most basic way for a business to remain competitive in the\ncurrent technological climate.\nCompanies that can improve on alignment to synchronize the technological landscape internally (often through researching and\ndeveloping innovations in-house) can achieve foresight and long-term benefits through forecasting future technological necessities.\nBTM has four dimensions: process, organization, information, and technology.\nEffectively employing these four dimensions of BTM provides companies the potential to project technological trends, and synchronize\nthem with their strategies.\nKey Terms\nAlignment: The process of adjusting a mechanism (or business) so that its parts act in concert.\nSynchronization: The process of aligning all inputs to optimize output.\nSBUs: Strategic Business Units; separate elements of a company, organized by similarity of processes and objectives.\nBusinesses are tasked with the ongoing responsibility of keeping up with evolving technology trends to stay competitive. Trends in\ntechnology extend out like the branches of a tree: each new innovation creates the possibility for multiple new innovations. The field of\nbusiness technology management (BTM) arose to provide businesses with the best approaches for assessing and implementing these\nvarying technological advances into their strategies.\nBTM\nAlignment\nBTM provides a bridge between previously established tools and standards within a business environment and newer, more operationally\nefficient tools and standards in technology. BTM does this by creating a set of principles and guidelines for companies to follow as they\npursue alignment. Alignment, in this respect, can be defined as how an institution's technology supports and enables technology while\navoiding constraints in direct relation to company strategies, objectives, and competition. When companies accomplish this in any given\ntechnological environment, they have attained BTM maturity relative to that time frame and industry.\nSynchronization\nAlignment is only the first step: the next step is synchronization. Like alignment, synchronization enables execution, but it also helps\ncompanies develop the capacity to anticipate and adapt future business models and strategies. This is generally accomplished by\ninvesting in research and development and staying ahead of the standard technologies by anticipating or even innovating past them. This\nbusiness technology leadership role is long-term oriented and very effective in maintaining competitive advantages in any given industry,\nbut it is particularly important for industries in the tech sectors.\nCycle of Research and Development: The Cycle of Research and\nDevelopment moves through theorizing, to hypothesizing, to design,\nto implementation, to study, and back to theorizing to begin the\ncycle again.\nCompanies use four specific dimensions of BTM to achieve this understanding of current technologies and trends:\nProcess - Companies must execute a set of fluid and repeatable processes that can be consistently scaled up through evaluation.\nOrganization - Utilizing an organized business structure or corporate framework, often through strategic business units ( SBUs ), provides\nsubstantial value in centralizing processes and assessing needs.\nInformation - Scouting and assessing the current technological environment through extensive research teams is necessary to make the\nappropriate decisions (see \"Sourcing Technology\" and \"Assessing Needs in Technology\" within this Boundless segment).\nTechnology - Finally, improving upon these processes within SBUs via leveraging the appropriate data and information will drive strategic\nacquisition of beneficial technological improvements based upon current trends.\nTaken together, these four dimensions applied to alignment and synchronization of new technology can help businesses keep up with or\never stay ahead of current technologies and trends. Companies can benefit from the intrinsic opportunities technological progress\nprovides while offsetting the intrinsic risks of external technological development.\nSourcing Technology\nTechnology sourcing involves isolating and implementing new innovations within an existing business framework.\nLearning Objectives\nIllustrate the varying cost structures, licensing, and scouting procedures involved with technology sourcing\nKey Takeaways\nKey Points\nSourcing new technology involves the scouting and researching of new technological potential and the eventual transfer of these\ntechnologies to a company.\nTechnology scouting is based around identifying new technologies, organizing and channeling data on these technologies, and assessing\nthe ease and value of implementing them.\nCompanies capitalize on the successful scouting of a new technology by sourcing it from the appropriate party for their own use.\nTech transfer drawbacks primarily involve the cost of licensing patents and training employees to effectively use the new technology.\nSome organizations, such as Sourceforge, Wikipedia, and Boundless, provide knowledge and technology for free in an open source\nstrategy.\nKey Terms\npatent: A legal right to a particular innovation, protecting it from being copied or employed by another without consent or license.\nSourcing: The supply of resources needed by a particular company or individual.\nScouting: The act of seeking or searching.\nTechnology Sourcing Strategies\nTechnology sourcing, or the pursuit of implementing new technologies within a businesses strategic framework, involves isolating and\napplying new technologies to current models. Technology can be developed internally or isolated through technology scouting and then\nimplemented through technology transfer. In deciding which approach is optimal for them, organizations must consider such factors as\nthe advantage of being first to market, research and developments costs and capabilities, and market research and data gathering costs.\nTherefore the strategies behind sourcing technology can be complex, varying by industry, company size, economic strength, and the\navailability of easily implemented technology.\nTechnology Scouting\nStages in technology\ndevelopment: Technology\ndevelops through a series of\nstages: basic technology\nresearch, research to prove\nfeasibility, technology\ndevelopment, technology\ndemonstration,\nsystem/subsystem development,\nand system test, launch &\noperations.\nTechnology scouting is essentially forecasting technological developments through information gathering. Technology scouts can either\nbe internal employees or external consultants specifically designated to the task of researching developments in a particular technological\nfield. This can be loosely referred to as a three-step process:\nIdentify emerging technologies.\nChannel and organize new technological data within an organization.\nProvide a corporate context to support or refute the acquisition of said technology.\nWhen technology scouting isolates new developments that could potentially provide advantages for an incumbent, strategies to acquire\nor source this technology become a focal point. Technology transfer, and the commercialization of technological abilities, is an enormous\nmarket both in the U.S. and abroad. Though governments, universities, and open source websites (such as Sourceforge, Wikipedia, and\nBoundless) often provide knowledge and technological know-how free of charge, most often technology is not free.\nTechnology Sourcing Pros and Cons\nIn the Information Age knowledge is power, and more than ever companies are trying to protect their knowledge from competitors or\nfreeloaders by using patents and trade secrets. Transfer of technology is therefore expensive, from licensing the patented technology to\nrequesting training in new technological advances for staff. Despite the distinct advantages of staying ahead of the curve relative to\ntechnological capabilities, there are some drawbacks to tech transfer. One strong example of the drawbacks in technological transfer and\nsourcing can be illustrated by the image below.\nThe first five levels of innovation, from basic research to technology demonstration, are often where investment begins pouring in,\nalongside the attempt to implement in order to stay competitive. As you may note, this is prior to the testing phases and therefore\ninvestors at this stage must accept the inherent risk of the new technology presenting significant hurdles to optimizing perceived\npotential or effective implementation. Early adopters and innovators suffer the risk of employing a new technology that has not been fully\ndebugged, minimizing what should have been strong returns on investment (ROI). Technology scouts should therefore be highly\ncircumspect and meticulous in their research processes, ensuring that new technological innovations will indeed provide what they\npromise.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}