{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nInternal Analysis Inputs to Strategy\nThe Mission Statement\nA mission statement defines the fundamental purpose of an organization or enterprise.\nLearning Objectives\nOutline the appropriate content necessary to construct a comprehensive mission statement\nKey Takeaways\nKey Points\nA mission statement is generated to retain consistency in overall strategy and to communicate core organizational goals to all\nstakeholders.\nThe business's owners and upper managers develop the mission statement and uphold it as a standard across the organization. It\nprovides a strategic framework by which the organization is expected to abide.\nIn a best-case scenario, an organization conducts internal and external assessments relative to the mission statement to ensure it is being\nupheld.\nA mission statement informs the key market, contribution, and distinction of an organization. It describes what the organization does, why\nit does so, and how it excels.\nKey Terms\nmission: A set of tasks that fulfills a purpose or duty; an assignment set by an employer.\nstakeholder: A person or organization with a legitimate interest in a given situation, action, or enterprise.\nA mission statement defines the purpose of a company or organization. The mission statement guides the organization's actions, spells\nout overall goals, and guides decision making. The mission statement is generated to retain consistency in overall strategy and to\ncommunicate core organizational goals to all stakeholders. The business's owners and upper managers develop the mission statement\nand uphold it as a standard across the organization. It provides a strategic framework by which the organization is expected to abide.\nMission statement: An example of a mission statement,\nwhich includes the organization's aims and stakeholders\nand how it provides value to these stakeholders.\nIn a best-case scenario, an organization conducts internal and external assessments relative to the mission statement. The internal\nassessment should focus on how members inside the organization interpret the mission statement. The external assessment, which\nincludes the business's stakeholders, is valuable since it offers a different perspective. Discrepancies between these two assessments can\nprovide insight into the effectiveness of the organization's mission statement.\nContents\nEffective mission statements start by articulating the organization's purpose. Mission statements often include the following information:\nAim(s) of the organization\nThe organization's primary stakeholders, including clients/customers, shareholders, congregation, etc.\nHow the organization provides value to these stakeholders, that is, by offering specific types of products or services\nA declaration of an organization's core purpose\nAccording to business professor Christopher Bart, the commercial mission statement consists of three essential components:\nKey market – Who is your target client/customer? ( generalize if necessary)\nContribution – What product or service do you provide to that client?\nDistinction – What makes your product or service so unique that the client would choose you?\nAssimilation\nTo be truly effective, an organizational mission statement must be assimilated into the organization's culture (as the theory states).\nLeaders have the responsibility of communicating the vision regularly, creating narratives that illustrate the vision, acting as role-models\nby embodying the vision, creating short-term objectives compatible with the vision, and encouraging employees to craft their own\npersonal vision that is compatible with the organization's overall vision.\nPorter's Competitive Strategies\nMichael Porter classifies competitive strategies as cost leadership, differentiation, or market segmentation.\nLearning Objectives\nDiscuss the value of using Porter's competitive strategies of cost leadership, differentiation, and market segmentation\nKey Takeaways\nKey Points\nMichael Porter defines three strategy types that can attain competitive advantage. These strategies are cost leadership, differentiation,\nand market segmentation (or focus).\nCost leadership is about achieving scale economies and utilizing them to produce high volume at a low cost. Margins may be narrower,\nbut quantity is larger, enabling high revenue streams.\nDifferentiation is creating a unique service or product offering, either through good branding or strong internal skills. This strategy aims at\noffering something difficult to copy and is strongly associated with an organization 's brand.\nMarket segmentation strategy is narrower in scope. Both cost leadership and differentiation are relatively broad in market scope and can\nencompass both strategic advantages on a smaller scale.\nPorter warns that companies who try to accomplish both cost leadership and differentiation may fall into the \"hole in the middle\"; he\nnotes that specializing is the ideal strategic approach.\nKey Terms\ncompetitive advantage: Something that places a company or a person above the competition.\nMarket Share: Percentage of a specific market held by a company.\nMichael Porter described a category scheme consisting of three general types of strategies commonly used by businesses to achieve and\nmaintain competitive advantage. These three strategies are defined along two dimensions: strategic scope and strategic strength.\nStrategic scope is a demand-side dimension and considers the size and composition of the market the business intends to target.\nStrategic strength is a supply-side dimension and looks at the strength or core competency of the firm.\nPorter identifies two competencies as most important: product differentiation and product cost (efficiency). He originally ranked each of\nthe three dimensions (level of differentiation, relative product cost, and scope of target market) as either low, medium, or high and\njuxtaposed them in a three-dimensional matrix. That is, the category scheme was displayed as a 3x3x3 cube; however, most of the twenty-\nseven combinations were not viable.\nCost Leadership, Differentiation, and Market Segmentation\nPorter simplified the scheme by reducing it to the three most effective strategies: cost leadership, differentiation, and market\nsegmentation (or focus). He characterizes each as the following:\nCost leadership pertains to a firm's ability to create economies of scale though extremely efficient operations that produce a large volume.\nCost leaders include organizations like Procter & Gamble, Walmart, McDonald's and other large firms generating a high volume of goods\nthat are distributed at a relatively low cost (compared to the competition).\nDifferentiation is less tangible and easily defined, yet still represents an extremely effective strategy when properly executed.\nDifferentiation refers to a firm's ability to create a good that is difficult to replicate, thereby fulfilling niche needs. This strategy can include\ncreating a powerful brand image, which allows the organization to sell its products or services at a premium. Coach handbags are a good\nexample of differentiation; the company's margins are high due to the markup on each bag (which mostly covers marketing costs, not\nproduction).\nMarket segmentation is narrow in scope (both cost leadership and differentiation are relatively broad in scope) and is a cross between the\ntwo strategies. Segmentation targets finding specific segments of the market which are not otherwise tapped by larger firms.\nPorter's competitive strategies: Porter's\nthree strategies can be defined along two\ndimensions: strategic scope and strategic\nstrength.\nAvoiding the \"Hole in the Middle\"\nEmpirical research on the profit impact of marketing strategy indicates that firms with a high market share are often quite profitable, but\nso are many firms with low market share. The least profitable firms are those with moderate market share. This is sometimes referred to as\nthe \"hole-in-the-middle\" problem. Porter explains that firms with high market share are successful because they pursue a cost-leadership\nstrategy, and firms with low market share are successful because they employ market segmentation or differentiation to focus on a small\nbut profitable market niche. Firms in the middle are less profitable because of the lack of a viable generic strategy.\nSWOT Analysis\nA SWOT analysis allows businesses to assess internal strengths and weaknesses in relation to external opportunities and threats.\nLearning Objectives\nExplain how a SWOT analysis can be used as a tool in strategic decision making\nKey Takeaways\nKey Points\nSWOT analysis is a strategic planning method used to evaluate a business's strengths, weaknesses, opportunities, and threats.\nThe goal of a SWOT analysis is to analyze the business environment to develop a strategic plan of action that captures opportunities\nusing internal strengths (and avoids threats while addressing weaknesses).\nBusinesses set objectives after the SWOT analysis has been performed, which allows the organization to define achievable goals.\nKey Terms\nenvironment: The surroundings of, and influences on, a particular item of interest.\nA method of analyzing the environment in which businesses operate is referred to as a context analysis. One of the most recognized of\nthese is the SWOT (strengths, weaknesses, opportunities, and threats) analysis. Performing a SWOT analysis allows a business to gain\ninsights into its internal strengths and weaknesses and to relate these insights to the external opportunities and threats posed by the\nmarketplace in which the business operates. The main goal of a context analysis, SWOT or otherwise, is to analyze the business\nenvironment in order to develop a strategic plan.\nSWOT and Strategy\nSWOT ANALYSIS\nHelpful Harmful\nto achieving the objective to achieving the objective\nnigiro )noitazinagro\nStrengths Weaknesses lanretnI eht\nfo\nsetubirtta(\nnigiro )tnemnorivne\nOpportunities Threats lanretxE\neht\nfo\nsetubirtta(\nSWOT analysis: The SWOT analysis\nmatrix illustrates where the company's\nstrengths and weaknesses lie relative to\nfactors in the market. Strengths and\nopportunities (the S and O of SWOT) are\nboth helpful toward achieving company\nobjectives, but strengths originate\ninternally while opportunities originate\nexternally. Similarly, weaknesses and\nthreats (the W and T of SWOT) are\nharmful toward achieving objectives, but\nweaknesses originate internally and\nthreats originate externally. Assessing all\nfour points of the SWOT acronym\nensures a thorough evaluation.\nA SWOT analysis is a strategic planning method used to evaluate the strengths, weaknesses, opportunities, and threats related to a project\nor business venture. A SWOT assessment involves specifying the business's objective and then identifying the internal and external factors\nthat are favorable and unfavorable toward the business's ability to achieve its objective. Setting the objective, in terms of moving from\nstrategy planning to strategy implementation, should be done after the SWOT analysis has been performed. Doing so allows the\norganization to set achievable goals and objectives.\nComponents of SWOT\nStrengths: internal characteristics of the business that give it an advantage over competitors\nWeaknesses: internal characteristics that place the business at a disadvantage against competitors\nOpportunities: external chances to improve performance in the overall business environment\nThreats: external elements in the environment that could cause trouble for the business\nIdentifying SWOTs is essential, as subsequent stages of planning can be derived from the analysis. Decision makers first determine\nwhether an objective is attainable, given the SWOTs. If the objective is not attainable, a different objective must be selected, and then the\nprocess can be repeated. Users of SWOT analysis must ask and answer questions that generate meaningful information for each category\nto maximize the benefits of the evaluation and identify the organization's competitive advantages.\nForecasting\nForecasting is the process of making statements about expected future events, based upon evidence, research, and experience.\nLearning Objectives\nDemonstrate the value and role of effective forecasting in the development of successful strategies\nKey Takeaways\nKey Points\nAn important aspect of forecasting is the relationship it holds with planning. Forecasting can be described as predicting what the future\nwill look like, whereas planning predicts what the future should look like.\nAs part of the implementation of policies and strategies, the forecasting method develops a reliable picture of the company's expected\nfuture environment.\nQuantitative forecasting generally employs statistical confidence intervals and historical data to project potential future trends that are\nbased upon the criteria being analyzed.\nQualitative approaches are the opposite: they rely on logical premises, expertise, or past experience to generate estimates of future\ncircumstances.\nForecasting enables a manager to look at the current environment and identify likely scenarios, each of which may require a deviation\nfrom the overall strategy.\nKey Terms\nforecast: An estimation of a future condition.\nscenario: An outline or model of an expected or supposed sequence of events.\nplanning: The act of formulating a course of action or of drawing up plans.\nForecasting is the process of making statements about expected future events based upon evidence, research, and experience. For\nexample, a business might estimate the exchange rate between the U.S. and the EU one year from now to determine the real financial\ncost of a project.\nAn important and often overlooked aspect of forecasting is the relationship it holds with planning. Forecasting can be described as\npredicting what the future will look like, whereas planning predicts what the future should look like. While both are managerial functions,\nforecasting is rife with external uncertainty while planning is hindered by internal uncertainty.\nForecasting Methods\nForecasting can be accomplished in a variety of different ways, some more statistically reliable than others. Following are a few critical\npoints of differentiation and specific strategies to keep in mind when forecasting.\nQuantitative vs. Qualitative\nOne of the simplest points of differentiation between methods is the reliance on numbers for accuracy. Quantitative forecasting generally\nuses statistical confidence intervals and historical data to project potential future trends that are based upon the criteria being analyzed.\nIn this format, results are expressed in certainty intervals (i.e., how confident can we be that this will be the case?) and often rely on\nfinancial data (exchange rates, industry growth, etc.).\nQualitative approaches are the opposite; they rely on logical premises or past experience to generate estimates about future\ncircumstances. The inherent problem with the qualitative approach is simple: subjectivity. While quantitative measure use data to express\nobjective results, qualitative approaches do not have this luxury. Generally this type of forecast will include the opinions of experts, upper\nmanagement, and market research.\nQuantitative vs. qualitative forecasting: This flow chart compares\nquantitative and qualitative forecasting methods. Qualitative\nforecasting relies more on opinions than data and can employ\nmarket research, sales-force input, or a jury of executives. In\ncontrast, quantitative forecasting relies more on objective, numerical\ndata, and can look at chronological trends and statistical regression\nto infer cause-and-effect.\nCausal Forecasting\nAnother method of forecasting, which is likely to be both quantitative and qualitative, is the causal/econometric approach. This strategy\ntasks managers with identifying cause and effect relationships of past instances by defining a series of if/then statements that express the\nlikelihood of the outcome which follows. For example, if consumer spending is down in Q2, then it is likely that gross domestic product\n(GDP) growth will be down in Q3. Whether or not this is true would have to be supported with data, but the forecast is that Q2 consumer\nspending results could forecast Q3 GDP growth.\nImplications of Forecasting\nKeeping these methods in mind, it is important to understand how management uses these forecasts to draw conclusions. Forecasting\nplays a role in the implementation of policies and strategies. The practice helps businesses create plans for different situations, in addition\nto contingency plans for adapting if and when necessary.\nForecasting enables a manager to look at the current environment and identify likely scenarios, each of which may require a deviation\nfrom the overall strategy. As the management team implements the broader strategy, it must continuously monitor the current\nenvironment for deviations and use forecasting to adapt both the primary strategy and contingency plans for potential shifts.\nTo summarize, forecasts enable businesses to prepare new strategies or reinforce the existing strategy, based upon the projections made.\nThe Resource-Based View\nIn the resource-based view (RBV), strategic planning uses organizational resources to generate a viable strategy.\nLearning Objectives\nDescribe the intrinsic competitive advantage defined by the resource-based view strategy\nKey Takeaways\nKey Points\nStrategic approaches are wide and varied, and the resource-based view is a commonly cited strategic approach to attaining competitive\nadvantage.\nTo transform a short-run competitive advantage into a sustained competitive advantage requires that these resources be varied in nature\nand not perfectly mobile. They also must not be easily imitated or substituted without great effort.\nThe RBV theory involves first identifying the firm's potential key resources and deriving a strategy to apply them to create synergy.\nIf key resources are valuable, rare, inimitable, and non-substitutable (VRIN), they may enable a strategy for achieving competitive\nadvantage.\nKey Terms\nheterogeneous: Diverse in kind or nature; composed of diverse parts.\nimitable: Capable of being copied.\nsubstitutable: Capable of being replaced.\nThe resource-based view (RBV) of strategy holds company assets as the primary input for overall strategic planning, emphasizing the way\nin which competitive advantage can be derived via rare resource combinations. To transform a short-run competitive advantage into a\nsustained competitive advantage requires that these resources are heterogeneous in nature and not perfectly mobile. Effectively, this\nprinciple translates into valuable resources that are cannot be either imitated or substituted without great effort. If the firm's strategy\nemphasizes and accomplishes this goal, its resources can help it sustain above-average returns.\nApplicability to Strategy\nIn many ways, business strategy aims to achieve competitive advantage through the proper use of organizational resources. As a result,\nthe resource-based view offers some insight as to what defines strategic resources and furthermore what enables them to generate\nabove-average returns (profit). Upper management must carefully consider what resources are at the company's disposal and how these\nassets may equate to operational value through strategic processes.\nThe VRIN Characteristics\nIn achieving a competitive advantage, the resource-based view defines characteristics which make a competitive process sustainable.\nThese characteristics are described as valuable, rare, inimitable, and non-substitutable, referred to as VRIN:\nValuable – A resource must enable a firm to employ a value-creating strategy by either outperforming its competitors or reducing its own\nweaknesses. The value factor requires that the costs invested in the resource remain lower than the future rents demanded by the value-\ncreating strategy.\nRare – To be of value, a resource must be rare by definition. In a perfectly competitive strategic factor market for a resource, the price of\nthe resource will reflect expected future above-average returns.\nInimitable – If a valuable resource is controlled by only one firm, it can be a source of competitive advantage. This advantage can be\nsustained if competitors are not able to duplicate this strategic asset perfectly. Knowledge-based resources are \"the essence of the\nresource-based perspective.\"\nNon-substitutable – Even if a resource is rare, potentially value-creating and imperfectly imitable, of equal importance is a lack of\nsubstitutability. If competitors are able to counter the firm's value-creating strategy with a substitute, prices are driven down to the point\nthat the price equals the discounted future rents, resulting in zero economic profits.\nA company should care for and protect resources that possess these characteristics, because doing so can improve organizational\nperformance. The VRIN characteristics mentioned are individually necessary, but each is insufficient on its own to sustain competitive\nadvantage. Within the framework of the RBV, the chain is as strong as its weakest link, and therefore requires the resource to display each\nof the four characteristics to be a viable strategy for competitive advantage.\nExample of VRIN resources: Rare earth elements satisfy the\nrequirements of being VRIN, in that they are valuable, rare, largely\ninimitable due to few extraction sites, and difficult to substitute.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}