{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nPlanning Tools\nOverview of Strategic Planning Tools\nStrategists have developed a large array of tools useful in plan formulation, all of which provide unique insights and advantages.\nLearning Objectives\nOutline the wide array of useful tools to improve upon the scope and effectiveness of the planning process within the context of strategic\nmanagement\nKey Takeaways\nKey Points\nForecasting, consisting of the basic concept of projecting future outcomes, is the most common tool in the strategic tool belt.\nScenario planning is where strategists construct various scenarios to test out the potential trajectories of a specific operational plan.\nContingency planning can be simply described as the back-up plan, while participatory planning is the primary plan. If (or, more likely,\nwhen) things do not go according to plan, a contingency plan should be in place.\nManagement by objectives (MBO) is the process of defining, disseminating, and implementing the objectives that an organization has\nidentified as strategic.\nThe SMART model identifies specific goals, measures inputs and outputs, ensures that the goals are attainable and relevant to the mission\nof the company, and constructs a timeline.\nIncorporating concepts such as forecasting and benchmarking in conjunction with larger corporate- strategy frameworks such as SMART\ngoals and MBO will equip strategists with a strong short-term and long-term approach.\nKey Terms\nforecasting: Estimating how a condition will be in the future.\nbenchmark: A standard that allows a manager to compare metrics, such as quality, time, and cost, across an industry and against\ncompetitors.\ncontingency plan: An alternative to be put into operation if needed, especially in case of an emergency or if a primary plan fails.\nStrategists have developed a large array of tools useful in the assessment of strategic planning, all of which provide unique insights into\nthe feasibility and profitability of a given operational project. Identifying these tools, and selecting which are most appropriate for\ndetermining the effectiveness or efficiency of a project, is a central responsibility of a strategic-management team.\nListed below are the main tools available for consideration along with a brief description of how each tool is useful.\nForecasting\nForecasting is the the most common strategic tool and it should be considered whenever projects are being designed. Forecasting, simply\nput, is projecting the future of a project by leveraging all of the available knowledge to generate a likelihood of success. It is useful to\nconstruct pro forma financial statements, which illustrate expected costs and revenues.\nScenario Planning\nScenario planning is an interesting tool with which strategists construct various scenarios to test out the potential trajectories of specific\noperational plans. One popular scenario application is called the zero-sum game, where the costs and revenues are equated to see at\nwhat level of cost or what level of revenue a zero-sum bottom line can be achieved. By benchmarking this situation against reality,\nstrategists can see in which situations value can be captured.\nBenchmarking\nBenchmarking can be done qualitatively or quantitatively, and it is a comparative approach to strategy. Benchmarking usually requires the\nidentification of a close competitor with similar strategic prerogatives so that the strategist can compare and contrast the two companies'\nstrengths and weaknesses, identifying strategies for improvements or competitive advantages.\nParticipatory and Contingency Planning\nContingency planning can be simply described as the back-up plan, while participatory planning is the primary plan. An excellent tool for\nstrategists pursuing a particularly risky venture is to develop the primary objectives and strategy while simultaneously constructing a\ncontingency plan that will limit the negative effects of failure. This offsets risk through finding various ways to achieve value regardless of\nthe success of the overall venture. This requires creativity and a degree of adaptability.\nGoal Setting\nGoal setting, similar to MBO and SMART, is a simple method for strategists to establish and enforce specific goals within the organization\nor strategic business unit (SBU). Goal setting creates incentives for employees by identifying achievable end results, which drives the\ndirection of the company towards commonly established goals. This theory was developed by Edwin A. Locke in the 1960s and is\nconsidered an \"open\" theory, which implies that new thoughts and developments may be layered on top of the original goal-setting\nframework.\nManagement by Objectives\nMBO is the process of defining, disseminating, and implementing the objectives that an organization has identified as strategic.\nObjectives provide factual and achievable strategies that align with employee and manager goals in order to ensure that all participants\nare on the same page. It is also useful to set goals and a timeline to assess progress and ensure that each individual is achieving their\nsegment of the plan.\nSMART Goals\nThe SMART model aims to design goals that are specific, measurable, achievable, realistic, and time-targeted (SMART).\nSMART criteria: Each component of the SMART model describes an\neffective attribute of a performance objective. Objectives will ideally\nconform to these expectations.\nThe SMART model identifies specific goals, measures inputs and outputs, ensures that the goals are attainable and relevant to the mission\nof the company, and constructs a timeline.\nThough there are many other potential tools for strategists, these seven provide a strong framework for further development of strategic\nmethodologies. Incorporating concepts such as forecasting and benchmarking in conjunction with larger corporate strategy frameworks\nsuch as SMART goals and MBO will equip strategists with a strong short-term and long-term approach.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}