{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nReinforcement and Motivation\nReinforcement as a Management Tool\nReinforcement is a process of strengthening desirable behaviors, often through the use of rewards.\nLearning Objectives\nDescribe the role of behavioral reinforcement in organizational management\nKey Takeaways\nKey Points\nReinforcement is a term used in behavioral analysis and in a specific kind of intentional behavior change known as operant conditioning.\nIt is a process of increasing the incidence of a (measurable) desirable behavior.\nReinforcement is a process in which someone is given a reward (i.e., \"positive reinforcement\") or is spared an unpleasant consequence\n(i.e., \" negative reinforcement \") to incentivize a certain desirable behavior.\nIncentive programs (e.g., bonuses, commissions, etc.) are examples of rewards (i.e., positive reinforcers) managers can give their\nemployees to increase desirable results, such as sales.\nKey Terms\nPositive Reinforcement: Giving a desired reward when a behavior is performed to increase how often the person repeats the behavior.\nreinforcement: The process of increasing the incidence of a directly measurable behavior.\nnegative reinforcement: The removal of an unpleasant condition or consequence when a behavior is performed to increase how often\nthe behavior is repeated.\nDefining Reinforcement\nReinforcement is a term used in the context of behavioral analysis and in a specific kind of intentional behavior change known as operant\nconditioning. It is a process of increasing the incidence of a (measurable) behavior. Very basic examples of such behaviors include things\nlike the rate of pulling a lever, the duration of holding down a button, or the speed with which a switch is flipped after a certain noise is\nsounded.\nPositive and Negative Reinforcement\nIn reinforcement, the rate of the target behavior is increased by giving a reward (i.e., \"positive reinforcement\") or by removing an\nunpleasant stimulus (i.e., \"negative reinforcement\") immediately or shortly after each occurrence of the behavior. Giving a monkey a\nbanana for performing a trick is an example of positive reinforcement; quieting a constant unpleasantly loud noise when a rat pushes a\nbutton is an example of negative reinforcement.\nReinforcement as a Management Tool\nIn a management context, reinforcers include salary increases, bonuses, promotions, variable incomes, flexible work hours, and paid\nsabbaticals. One particularly common positive-reinforcement technique is the incentive program, a formal scheme used to promote or\nencourage specific actions, behaviors, or results from employees over a defined period of time. Incentive programs can reduce turnover,\nboost morale and loyalty, improve wellness, increase retention, and drive daily performance among employees. Motivating staff will in\nturn help business outcomes and increase efficiency.\nReinforcing good behavior: This soldier\nreinforces her dog's desirable behavior by\ngiving it a treat.\nManagers are responsible for identifying what behaviors should be promoted and what should be discouraged and must carefully\nconsider organizational objectives in this process. Implementing rewards and punishments that parallel the organization 's goals help to\ncreate a work culture and work environment that embody those goals and objectives.\nExample of an Incentive Program\nLet's take an IT sales team as an example. The team's overarching goal is to sell their new software to businesses. The manager may want\nto emphasize sales to partners of a certain size (i.e., big contracts). To this end, the manager may reward team members who gain clients\nof 5,000 or more employees with a commission of 5% of the overall sales volume for each such partner. This reward of a 5% commission\nreinforces the behavior of closing big contracts, strongly motivating team members to work toward that goal and thus likely increasing\nthe number of big contracts closed.\nFeatures of a Successful Incentive Program\nTo facilitate the creation of a profitable program, every feature of the incentive program must be tailored to the participants' interests. A\nsuccessful incentive program requires clearly defined rules, suitable rewards, efficient communication strategies, and measurable success\nmetrics. By adapting each element of the program to fit the target audience, companies are better able to engage program participants\nand enhance overall program efficacy.\nPunishment as a Management Tool\nPunishment is the imposition of a negative consequence with the goal of reducing or stopping someone's undesirable behavior.\nLearning Objectives\nRecognize the uses of punishment as a motivational tool in the context of organizational behavio\nKey Takeaways\nKey Points\nThe purpose of punishment is to encourage and enforce \"proper\" behavior as defined by a group, an organization, or society through the\nuse of negative consequences.\nPunishment, like reinforcement, is a term used in behavioral analysis and in a specific kind of intentional behavior change known as\noperant conditioning.\nWhereas reinforcement is used to increase desirable behavior, punishment is used to decrease undesirable behavior through the\napplication of a negative consequence (positive punishment) or through the removal of something the person enjoys (negative\npunishment).\nPunishment can be used in a business context to prevent employees from doing something the organization or manager considers\nundesirable or wrong.\nKey Terms\npunishment: The act of imposing a sanction.\nDefining Punishment\nPunishment is a term used in the context of behavioral analysis and in a specific kind of intentional behavior change known as operant\nconditioning. It is a process of decreasing the incidence of a (measurable) behavior. Very basic examples of such behaviors include things\nlike the rate of pulling a lever, the duration of holding down a button, or the speed with which a switch is flipped after a certain noise is\nsounded.\nPositive and Negative Punishment\nIn punishment, the rate of the target behavior is decreased by imposing a negative consequence (i.e., \"positive punishment\") or by\nremoving a pleasant or desired stimulus (i.e., \"negative punishment\") immediately or shortly after each occurrence of the behavior.\nShocking a rat for turning left instead of right in a maze is an example of positive punishment; taking away a child's toy after he hits his\nbrother is an example of negative punishment.\nPunishment as a Management Tool\nThe purpose of punishment is to prevent future occurrences of a given socially unacceptable or undesirable behavior. According to\ndeterrence theory, the awareness of a punishment will prevent people from performing the behavior. This can be accomplished either\nthrough punishing someone immediately after the undesirable behavior so that they are reluctant to perform the behavior again or\nthrough educating people about the punishment preemptively so they are reluctant to perform the behavior at all. In a management\ncontext, punishment tools can include demotions, salary cuts, and terminations (fires).\nIn business organizations, punishment and deterrence theory play a vital role in shaping culture to be in line with operational expectations\nand in avoiding conflicts and negative outcomes both internally and externally. If employees clearly know what they are not supposed to\ndo, they generally try to avoid doing it. Prevention is a much cheaper and easier approach than waiting for something bad to happen, so\npreemptive education regarding rules and penalties for rule violation is common practice.\nPunishment of the Paddle: This is an old form of punishment.\nManagerial Perspectives on Motivation\nManagers can employ motivational theory and reinforcement tools to motivate employees and increase efficiency.\nLearning Objectives\nExplain the managerial importance of understanding motivational theories as they pertain to an organization's employees\nKey Takeaways\nKey Points\nMotivating employees is a primary responsibility of management, as motivational management enables higher outputs and job\nsatisfaction from employees.\nWhile there is a great deal of research on motivation from the perspective of both management and psychology, a few specific\npsychological theories can be applied specifically to employee motivation.\nAccording to psychological theories of motivation, management is in the difficult position of identifying and fulfilling needs for different\nemployees who will, in turn, require distinct motivational assistance.\nManagers may rely on a few tools to steer the direction of motivation. These include positive and negative reinforcements and positive\nand negative punishment.\nKey Terms\nmotivation: Willingness to perform an action, especially a behavior; an incentive or reason for doing something.\nPsychological Theories and Motivation\nMotivation is the psychological boost that helps people achieve high performance and reach goals. Motivating employees is a primary\nmanagerial responsibility of management, as motivational management enables higher outputs and job satisfaction from employees.\nWhile studies have produced a great deal of research on motivation, from the perspective of both management and psychology, a few\npsychological theories can be applied specifically to employee motivation. Using modern research and understanding what drives\nbehavior are the focal points of organizational behavior study, and managers should actively apply these psychological frameworks to\ntheir everyday management strategies and considerations. These frameworks can be coupled with concepts of reinforcement and\npunishment as tools managers use to emphasize or discourage specific behaviors.\nNeed-based Theories\nNeed-based theories of motivation focus on an employee's drive to satisfy needs by working. Needs range from basic physiological needs\nfor survival to higher-level emotional needs, like belonging and self-actualization.\nFrom the perspective of the manager, Maslow's model (see below image) is highly useful in drawing a few simple yet important\nconclusions. First, if employees are not being paid enough to satisfy the bottom two tiers of the hierarchy (for example, pay rent, buy\nfood, etc.), then they will be unmotivated to create a strong social environment, accomplish goals, or be creative. Salary, therefore, must\nbe high enough to match or exceed a reasonable standard of living. Secondly, without a good culture for social interaction, employees\nwill find it difficult to achieve high levels of creativity and problem-solving. If managers want to capture maximum value from employees,\nthey must supply each component on this list—to the best of their ability—in reimbursements, culture, and goal setting.\nMaslow's Hierarchy of Needs: The hierarchy\nunderscores how management should assess\nemployees' needs. Salary encompasses the bottom two\ntiers (safety-related and physiological needs), while\nsocial and objective-based motivators address the\nhigher needs (love and belonging, esteem, and self-\nactualization).\nEquity Theory\nEquity theory is derived from social-exchange theory. It explains motivation in the workplace as a cognitive process where the employee\nevaluates the balance between inputs (or efforts) in the workplace and the outcomes (or rewards) that are received or anticipated.\nFor management, the implications are similar to those of Maslow's lower-level needs. Employees expect that they will receive an\nequivalent reimbursement for the value they create. Management must assess the value of the job objectively and clearly explain the\nexchange (time and efforts for money/benefits/job satisfaction) to the employee prior to the onset of work. Equity must be maintained for\nproper motivation, and managers are responsible for establishing equity within the organization.\nReinforcement and Punishment\nBased upon the psychological theories of motivation discussed here, management is in the difficult position of identifying and fulfilling\nneeds for different employees (who will in turn require different motivational assistance). To accomplish this need fulfillment, managers\nhave a few tools to employ that allows them to steer the direction of motivation. These include positive and negative reinforcements and\npositive and negative punishments.\nAs noted above in Maslow's hierarchy, employees are motivated in a linear fashion (fulfilling base needs will result in higher needs). As a\nresult, a manager must recognize what level of the hierarchy an employee is on before using reinforcement or punishment. If the\nemployee is more concerned about salary and creating enough capital to live comfortably, a manager could positively reinforce certain\nbehaviors with bonus pay or raises. If an employee is pursuing esteem, managers can apply promotions or employee-achievement\nawards.\nSimilarly, punishments can be effective in emphasizing motivational successes and failures as well. Using equity theory, managers can\nconsider employees' actions in context with desired outcomes. For example, if an employee is often late and misses important meetings,\nresulting in a loss of revenue for the company, equity theory permits that this employee should be punished with lower pay. In this\nsituation, equity theory allows management to motivate through punishing employees who do not create the required returns to pay\ntheir salaries.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}