{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nManaging Group Decision Making\nAdvantages and Disadvantages of Group Decision Making\nGroup decision making can lead to improved outcomes, but only if a variety of conditions pertaining to group chemistry are satisfied.\nLearning Objectives\nAssess the advantages and disadvantages that should be considered in leveraging collaborative decision-making\nKey Takeaways\nKey Points\nGroup decisions involve two or more people, are participatory, and result in choices that are the responsibility of the group rather than\nany individual.\nGroup decision making is subject to social influences that can provide advantages as well as disadvantages in decision outcomes.\nThere are a number of potential advantages in group decision making—chief among them are shared information and more favorable\noutcomes achieved through synergy. Both of these advantages rely on the power of many minds undertaking a single decision.\nDisadvantages of group decision making include diffusion of responsibility and inefficiency.\nKey Terms\ngroupthink: The psychological phenomenon wherein a desire for conformity within a group results in them making an irrational decision;\nby actively suppressing dissenting viewpoints in the interest of minimizing conflict, group members reach a consensus without critically\nevaluating alternative viewpoints.\nHomogeneity: In the context of group decision making, homogeneity refers to a set of consistent and uniform ideas, prejudices, and\nbeliefs held by all members within a group.\nGroup decision making (also known as collaborative decision making) is when individuals collectively make a choice from the alternatives\nbefore them. Such decisions are not attributable to any single individual, but to the group as a whole. By definition, group decisions are\nparticipatory, and often a member's contribution is directly proportional to the degree to which a particular decision would affect him or\nher. Group decisions are subject to factors such as social influence, including peer pressure, and group dynamics. These social elements\ncan affect the process by which decisions are reached and the decision outcomes themselves. A group can make decisions by consensus,\nin which all members come to agreement, or it may take a majority-rules approach and select the alternative favored by most members.\nAdvantages of Group Decision Making\nGroup decision making provides two advantages over decisions made by individuals: synergy and sharing of information. Synergy is the\nidea that the whole is greater than the sum of its parts. When a group makes a decision collectively, its judgment can be keener than that\nof any of its members. Through discussion, questioning, and collaboration, group members can identify more complete and robust\nsolutions and recommendations.\nThe sharing of information among group members is another advantage of the group decision-making process. Group decisions take into\naccount a broader scope of information since each group member may contribute unique information and expertise. Sharing information\ncan increase understanding, clarify issues, and facilitate movement toward a collective decision.\nDisadvantages of Group Decision Making\nDiffusion of Responsibility\nOne possible disadvantage of group decision making is that it can create a diffusion of responsibility that results in a lack of\naccountability for outcomes. In a sense, if everyone is responsible for a decision, then no one is. Moreover, group decisions can make it\neasier for members to deny personal responsibility and blame others for bad decisions.\nLower Efficiency\nGroup decisions can also be less efficient than those made by an individual. Group decisions can take additional time because there is the\nrequirement of participation, discussion, and coordination among group members. Without good facilitation and structure, meetings can\nget bogged down in trivial details that may matter a lot to one person but not to the others.\nGroupthink\nOne of the greatest inhibitors of effective group decision making is groupthink. Groupthink is a psychological phenomenon that occurs\nwithin a group of people in which the desire for harmony or conformity results in an irrational or dysfunctional decision-making outcome.\nBy isolating themselves from outside influences and actively suppressing dissenting viewpoints in the interest of minimizing conflict,\ngroup members reach a consensus decision without critical evaluation of alternative viewpoints.\nLoyalty to the group requires individuals to avoid raising controversial issues or alternative solutions, and there is a loss of individual\ncreativity, uniqueness, and independent thinking. The dysfunctional group dynamics of the in-group produces an illusion of invulnerability\n(an inflated certainty that the right decision has been made). Thus the in-group significantly overrates its own decision-making abilities\nand significantly underrates the abilities of its opponents (the out-group). Furthermore, groupthink can produce dehumanizing actions\nagainst the out-group.\nThe Manager's Role in Group Decisions\nThe manager's role in group decision making is to create a supportive context for the group.\nLearning Objectives\nDescribe the roles managers must play in supporting effective group decision-making\nKey Takeaways\nKey Points\nThe manager's role is to establish the conditions for an effective group - decision outcome.\nManagers can help promote effective decision making by effectively choosing group members, framing the decision, and organizing the\ndecision process.\nProductive steps a manger can take to assist group decision making include the following: define a goal, create positive working\nconditions, establish expectations, provide adequate resources, and give group members ample space and latitude.\nKey Terms\nnorms: Behaviors or standards regarded as typical.\nDecisions are often delegated to groups when members have the experience and information needed to arrive at the appropriate choice.\nManagers and leaders can take actions that support group decision making and lead to good decision outcomes. Managers can help\npromote effective decision making by effectively choosing group members, framing the decision, and organizing the decision process.\nIn order to maximize the potential of a group decision process, managers should take the following important steps:\nEstablish the team goal: By articulating the dimensions of the decision, including its importance, a manager can reduce ambiguity and\nhelp group members focus their analysis, discussions, and deliberations. A clear statement of the question to be resolved can help unify\nthe group and create cohesion that engages members and improves collaboration.\nFacilitate a working environment: After the decision goal is established, the working environment must allow for meaningful, honest, and\nopen communication among group members. The manager can help establish norms about how members will interact with each other to\nfoster constructive discourse.\nSet clear expectations and responsibilities: By setting expectations, managers help team members understand their decision tasks and\nparameters (for example, deadlines). Managers might assign roles to help structure the decision process, establish a sense of\naccountability for parts of the group's work, and clarify responsibilities.\nProvide resources: Managers must be mindful that the group has adequate resources to evaluate alternatives and make its decision.\nNecessary adjustments may include providing additional staff, giving more time, or freeing members from other work assignments so\nthey can fully participate in the decision-making process.\nGet out of the way: After the manager has established the context for the group to make its decision, the best thing to do is step back\nand let the team perform. The most useful role at this point is that of coach, such as if the group needs help managing interpersonal\nrelationships or if additional clarity is needed about an alternative.\nManager and employee communicating: Managers can\nfacilitate group decision making by setting clear expectations.\nEmployee Involvement in Decision Making\nInvolving employees in key decisions gives managers access to unique skills and tells the employees that their contributions are valued.\nLearning Objectives\nDistinguish the importance and inherent value of ensuring employee involvement as much as possible in the decision-making process\nKey Takeaways\nKey Points\nFrom a managerial standpoint, employee involvement is an effective way to leverage human resources and give employees a voice in\nsomething meaningful.\nEmployee participation in decisions can lead to increased job satisfaction, organizational commitment, individual motivation, and job\nperformance.\nTo effectively contribute to group decisions, individuals must have relevant skills and experiences.\nKey Terms\nmotivation: An incentive or reason for doing something.\nGroup decisions can lead to better decision outcomes by bringing to bear a broader range of perspectives. By delegating a decision to a\ngroup, an organization can make effective use of the skills and knowledge of its employees.\nEmployee involvement: Managers use\nemployee involvement in key decision\nmaking not only to leverage employees'\nunique skills, but also to motivate them,\nsignaling that their impact on the company is\nmeaningful.\nAnother of the benefits of group decision making in an organization is its effect on employee motivation. Providing opportunities to\nparticipate in decisions is a way to give employees a voice in something meaningful. Doing so can have positive effects on job\nsatisfaction, organizational commitment, individual motivation, and job performance.\nMost commonly employees are involved in decisions that directly affect how their work is done. For instance, many quality-control\npractices include opportunities for workers to discuss and select ways to improve how they produce goods or deliver services. Self-\nmanaged teams have even broader responsibilities for decisions, such as how their work is organized, scheduled, and assigned.\nTo effectively participate in group decisions, employees must have the necessary skills and experience. Without relevant knowledge,\nparticipants in group decision making may not grasp the issues, know how to analyze alternatives, or be able to determine which option\nto choose. For instance, it would not be reasonable to expect the same level of contribution from a new recruit fresh out of college as\nfrom a more experienced employee familiar with the organization and its business priorities.\nTechniques for Reaching a Group Consensus\nReaching consensus typically requires identifying and addressing the underlying concerns of group members.\nLearning Objectives\nDefine consensus and the varying ways in which it can be achieved in a group dynamic\nKey Takeaways\nKey Points\nConsensus decision making aims to reach agreement through collaboration, cooperation, inclusivity, and participation.\nSeeking consensus is not always ideal, since it can take additional time and result in suboptimal choices.\nTwo approaches to making group decisions by consensus are the Quaker model and the consensus-oriented decision-making (CODM)\nmodel.\nKey Terms\nconsensus: A process of decision-making that seeks widespread agreement among group members.\nConsensus decision making aims to reach agreement through collaboration, cooperation, inclusivity, and participation. Group decisions\nmade by consensus seek resolutions that are satisfactory to all group members and meet all of their concerns. Consensus decision making\nis not adversarial or competitive, but rather seeks to do what is best for the group. Group members treat each other equally and solicit\nthe input of all participants.\nMaking decisions by consensus is not necessarily ideal or even desirable. In an effort to please everyone, the decision may satisfy the least\ncommon denominator but not produce the best outcomes. Developing a consensus can be time consuming, and is thus more difficult to\nachieve when there is urgency, significant time constraints, or resource limitations.\nAnother way to think about consensus is as the absence of objections. In order to arrive at a group consensus, majority opinion holders\nmust overcome any unwillingness of group members to accept a given choice. While group members may be willing to go along with a\nproposal, they do not actually need to favor it above another choice.\nOne approach to consensus building is the Quaker model. It provides a way to structure a decision process that emphasizes listening\namong group members. The Quaker model calls for members to refrain from speaking twice until after all group members have been\nheard from, the effect of which is to neutralize dominating personality types. Another key feature of the Quaker model is that it relies on a\nsingle person to act as the facilitator, or moderator, who makes sure the discussion flows according to an empathetic process. By\narticulating the emerging consensus, members can be clear on the decision as it emerges, and, since their views have been taken into\naccount, will be likely to support it.\nConsensus flow diagram: This\ndiagram shows a process of steps\nthrough which consensus can be\nreached, by starting with concerns\nthat are raised, moving to a\ndiscussion, then a proposal, and then\nfurther testing for consensus.\nAnother formal technique for consensus building comes from the consensus-oriented decision-making (CODM) model. It has seven key\nsteps:\nFraming the topic\nOpen discussion\nIdentifying underlying concerns\nCollaborative proposal building\nChoosing a direction\nSynthesizing a final proposal\nClosure\nThe CODM model outlines a process of how proposals can be collaboratively built with the full participation of all stakeholders. This\nmodel lets groups be flexible enough to make decisions when they need to, while still following a format based on the primary values of\nconsensus decision making.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}