{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nDrivers of Behavior\nDefining Attitude\nAn attitude is generally defined as the way a person responds to his or her environment, either positively or negatively.\nLearning Objectives\nDefine attitude within the context of behavioral norms for employees in an organization\nKey Takeaways\nKey Points\nAn attitude could be generally defined as a way a person responds to his or her environment, either positively or negatively. The precise\ndefinition of attitude is nonetheless a source of some discussion and debate.\nWork environment can affect a person's attitude.\nSome attitudes are a dangerous element in the workplace, one that can spread to those closest to the employee and affect everyone's\nperformance.\nAttitudes are the confluence of an individual and external stimuli, and therefore everyone is in a position of responsibility to improve\nthem (managers, employees, and organizations ).\nA strong work environment is vital for an effective and efficient workplace.\nKey Terms\nattitude: Disposition or state of mind.\nOverview\nAn attitude could be generally defined as the way a person responds to his or her environment, either positively or negatively. The\ndefinition of attitude is nonetheless a source of some discussion and debate.\nWhen defining attitude, it is helpful to bear two useful conflicts in mind. The first is the existence of ambivalence or differences of attitude\ntowards a given person, object, situation etc. from the same person, sometimes at the same time. This ambivalence indicates that attitude\nis inherently more complex than a simple sliding scale of positive and negative, and defining these axes in different ways is integral to\nidentifying the essence of attitude. The second conflict to keep in mind is the degree of implicit versus explicit attitude, which is to say\nsubconscious versus conscious. Indeed, people are often completely ignorant of their implicit attitudes, complicating the ability to study\nand interpret them accurately.\nThe takeaway here is to be specific when discussing attitudes, and define terms carefully. For a manager to say that somebody has\nattitude, or that somebody is being negative or positive about something, is vague and nonconstructive. Instead, a manager's job is to\nobserve and to try to pinpoint the possible causes and effects of a person's perspective on something.\nAttitudes in the Workplace\nEveryone has attitudes about many things; these are not necessarily a bad thing. One aspect of employees' attitude is the impact it can\nhave on the people around them. People with a positive attitude can lift the spirits of their co-workers, while a person with a negative\nattitude can lower their spirits. Sometimes, though, this principle works in reverse, and attitudes are often more complex than positive or\nnegative. Attitudes may affect both the employee's work performance and the performances of co-workers.\nAttitude: A person's attitude can be influenced by his or her\nenvironment, just as a person's attitude affects his or her environment.\nCan Management Change People's Attitudes?\nSome attitudes represent a dangerous element in the workplace that can spread to those closest to the employee and affect everyone's\nperformance. Is it a manager's responsibility to help change the person's attitude? Should the employee alone be responsible? The\nanswer is that attitudes are the confluence of an individual and external stimuli, and therefore everyone is in a position of responsibility.\nStill, a manager may be able to influence a employee's attitude if the root cause relates to work conditions or work environment. For\nexample, employees may develop poor attitudes if they work long hours, if the company is having difficulties, or if they have relationship\nissues with the manager or another employee. Similarly, if employees feel believe there is little chance for advancement or that their\nefforts go unappreciated by the organization, they may develop a negative attitude. To the extent they are able, managers should strive to\nremedy these situations to encourage an effective work environment.\nA strong work environment is vital for an effective and efficient workplace. Employees who are in a positive, encouraging work\nenvironment are more likely to seek solutions and remain loyal, even if the company is having financial difficulties. Even so, employees\nhave some responsibility to alter their own attitudes. If management does everything in its power to create a positive environment and\nthe employee refuses to participate, then managers can do little else to help. At times, attitudes are beyond the reach of the business to\nimprove.\nHow Attitude Influences Behavior\nAttitudes can positively or negatively affect a person's behavior, regardless of whether the individual is aware of the effects.\nLearning Objectives\nExplain how differing attitudes can have a meaningful effect on employee behavior\nKey Takeaways\nKey Points\nAttitudes are infectious and can affect the people that are near the person exhibiting a given attitude, which in turn can influence their\nbehavior as well.\nUnderstanding different types of attitudes and their likely implications is useful in predicting how individuals' attitudes influence their\nbehavior.\nDaniel Katz identifies four categories of attitudes: utilitarian, knowledge, ego-defensive and value -expressive.\nOrganizations can influence a employee's attitudes and behavior by using different management strategies and by creating strong\norganizational environments.\nAs people are affected in different ways by varying influences, an organization may want to implement multiple strategies.\nKey Terms\nbehavior change: Any transformation or modification of human habits or patterns of conduct.\nIndividual Attitudes and Behaviors\nAttitudes can positively or negatively affect a person's behavior. A person may not always be aware of his or her attitude or the effect it is\nhaving on behavior. A person who has positive attitudes towards work and co-workers (such as contentment, friendliness, etc.) can\npositively influence those around them. These positive attitudes are usually manifested in a person's behavior; people with a good\nattitude are active and productive and do what they can to improve the mood of those around them.\nIn much the same way, a person who displays negative attitudes (such as discontentment, boredom, etc.), will behave accordingly. People\nwith these types of attitudes towards work may likewise affect those around them and behave in a manner that reduces efficiency and\neffectiveness.\nAttitudinal Categories\nAttitude and behavior interact differently based upon the attitude in question. Understanding different types of attitudes and their likely\nimplications is useful in predicting how individuals' attitudes may govern their behavior. Daniel Katz uses four attitude classifications:\nUtilitarian: Utilitarian refers to an individual's attitude as derived from self or community interest. An example could be getting a raise. As\na raise means more disposable income, employees will have a positive attitude about getting a raise, which may positively affect their\nbehavior in some circumstances.\nKnowledge: Logic, or rationalizing, is another means by which people form attitudes. When an organization appeals to people's logic and\nexplains why it is assigning tasks or pursuing a strategy, it can generate a more positive disposition towards that task or strategy (and vice\nversa, if the employee does not recognize why a task is logical).\nEgo-defensive: People have a tendency to use attitudes to protect their ego, resulting in a common negative attitude. If a manager\ncriticizes employees' work without offering suggestions for improvement, employees may form a negative attitude and subsequently\ndismiss the manager as foolish in an effort to defend their work. Managers must therefore carefully manage criticism and offer solutions,\nnot simply identify problems.\nValue-expressive: People develop central values over time. These values are not always explicit or simple. Managers should always be\naware of what is important to their employees from a values perspective (that is, what do they stand for? why do they do what they do?).\nHaving such an awareness can management to align organizational vision with individual values, thereby generating passion among the\nworkforce.\nOrganizational Attitudes and Behaviors\nAttitudes can be infectious and can influence the behavior of those around them. Organizations must therefore recognize that it is\npossible to influence a person's attitude and, in turn, his or her behavior. A positive work environment, job satisfaction, a reward system,\nand a code of conduct can all help reinforce specific behaviors.\nOne key to altering an individual's behavior is consistency. Fostering initiatives that influence behavior is not enough; everyone in the\norganization needs to be committed to the success of these initiatives. It is also important to remember that certain activities will be more\neffective with some people than with others. Management may want to outline a few different behavior-change strategies to have the\nbiggest effect across the organization and take into consideration the diversity inherent in any group.\nDefining Values\nValues are guiding principles that determine individual morality and conduct.\nLearning Objectives\nDefine values in the context of organizational ethics and organizational behavior\nKey Takeaways\nKey Points\nPersonal values are people's internal conception of what is good, beneficial, important, useful, beautiful, desirable, constructive, etc.\nValues such as honesty, hard work, and discipline can increase an employee's efficacy in the workplace and help them serve as a positive\nrole model to others.\nEmployees should not impose their own values on their co-workers.\nManagement must take values into consideration when hiring to ensure that employee values align with the company's, as well as those\nof other co-workers.\nKey Terms\nvalues: A collection of guiding principles; what an individual considers to be morally right and desirable in life, especially regarding\npersonal conduct.\nOverview\nPersonal values can be influenced by culture, tradition, and a combination of internal and external factors. Values determine what\nindividuals find important in their daily life and help to shape their behavior in each situation they encounter. Since values often strongly\ninfluence both attitude and behavior, they serve as a kind of personal compass for employee conduct in the workplace. Values help\ndetermine whether an employee is passionate about work and the workplace, which in turn can lead to above-average returns, high\nemployee satisfaction, strong team dynamics, and synergy.\nHow Are Values Formed?\nValues are usually shaped by many different internal and external influences, including family, traditions, culture, and, more recently,\nmedia and the Internet. A person will filter all of these influences and meld them into a unique value set that may differ from the value\nsets of others in the same culture.\nValues are thought to develop in various stages during a person's upbringing, and they remain relatively consistent as children mature\ninto adults. Sociologist Morris Massey outlines three critical development periods for an individual's value system:\nImprint period (birth to age seven): Individuals begin establishing the template for what will become their own values.\nModeling period (ages eight to thirteen): The individual's value template is sculpted and shaped by parents, teachers, and other people\nand experiences in the person's life.\nSocialization period (ages thirteen to twenty-one): An individual fine-tunes values through personal exploration and comparing and\ncontrasting with other people's behavior.\nValues in the Workplace\nValues can strongly influence employee conduct in the workplace. If an employee values honesty, hard work, and discipline, for example,\nhe will likely make an effort to exhibit those traits in the workplace. This person may therefore be a more efficient employee and a more\npositive role model to others than an employee with opposite values.\nHard work: A strong work ethic is a personal value.\nConflict may arise, however, if an employee realizes that her co-workers do not share her values. For example, an employee who values\nhard work may resent co-workers who are lazy or unproductive without being reprimanded. Even so, additional conflicts can result if the\nemployee attempts to force her own values on her co-workers.\nHiring for Values\nIf the managers of a business create a mission statement, they have likely decided what values they want their company to project to the\npublic. The mission statement can help them seek out candidates whose personalities match these values, which can help reduce friction\nin the workplace and foster a positive work environment.\nSkills-based hiring is important for efficiency and is relatively intuitive. However, hiring for values is at least as important. Because\nindividual values have such strong attitudinal and behavioral effects, a company must hire teams of individuals whose values do not\nconflict with either each other's or those of the organization.\nHow Values Influence Behavior\nValues influence behavior because people emulate the conduct they hold valuable.\nLearning Objectives\nDiscuss the positive relationship between meaningful corporate and employee values and behavior in the workplace\nKey Takeaways\nKey Points\nValues are an important element that affects individuals and how they behave towards others.\nCompanies can influence a person's behavior with codes of conduct, ethics and vision statements, ethics committees, and a punishment -\nand-reward system.\nA gap sometimes exists between a person's values and behavior. Organizational strategies, such as a reward system, can close that gap.\nCulture is also largely relevant to how values shape behavior, as a given organizational culture can create camaraderie and social\ninterdependence.\nKey Terms\nbehavior: The way a living creature acts.\nOverview\nValues are defined as perspectives about an appropriate course of action. If a person values honesty, then he or she will strive to be\nhonest. People who value transparency will work hard to be transparent. Values are one important element that affects individual\ncharacter and behavior towards others. The relationship between values and behavior is intimate, as values create a construct for\nappropriate actions.\nValues and Behavior in the Workplace\nA work environment should strive to encourage positive values and discourage negative influences that affect behavior. All individuals\npossess a moral compass, defined via values, which direct how they treat others and conduct themselves. People who lack strong or\nethical values may participate in negative behavior that can hurt the organization. While a company cannot do anything about the\ninfluences that shape a person's values and behavior before hiring, the organization can try to influence employee behavior in the\nworkplace.\nMeans of Encouraging or Discouraging Behavior\nTraining programs, codes of conduct, and ethics committees can inform employees of the types of behavior that the company finds\nacceptable and unacceptable. While these efforts will not necessarily not change an individual's values, they can help them decide not to\nparticipate in unethical behavior while at work. Managers must emphasize not only an employee's responsibilities, but also what the\norganization expects with respect to values and ethics. Ethics statements and vision statements are useful tools in communicating to\nemployees what the company stands for and why.\nA system of punishments and rewards can also help foster the type of values the company wants to see in its employees, essentially\nfiltering behavior through conditioning. If people see that certain behaviors are rewarded, then they may decide to alter their behavior\nand in turn alter their values. In addition, a gap sometimes exists between a person's values and behavior. This gap can stem from a\nconscious decision not to follow a specific value with a corresponding action. This decision can be influenced by how deeply this value\naffects the person's character and by the surrounding environment.\nCulture is also largely relevant to how values shape behavior, as a given organizational culture can create camaraderie and social\ninterdependence. Conforming to the expectations and values of the broader organization is a common outcome of organizations with\nstrong ethos and vision. Such an organization promotes passion and positive behavior in their employees. Of course, a company's culture\ncan work in both directions. Some industries are inherently competitive, valuing individual dominance over other individuals (for example,\nsales, stock trading, etc.). While some may view such a culture as objectively negative, it is subjectively useful for the organization to instill\nand develop these values to create certain behaviors (such as hard work and high motivation).\nDefining Job Satisfaction\nJob satisfaction is the level of contentment employees feel about their work, which can affect performance.\nLearning Objectives\nDefine job satisfaction in the context of the driving forces in organizational behavior\nKey Takeaways\nKey Points\nJob satisfaction can be influenced by a person's ability to complete required tasks, the level of communication in an organization, and the\nway management treats employees.\nMeasuring job satisfaction can be challenging, as the definition of satisfaction can be different for different people.\nIf an organization is concerned about employee job satisfaction, management may conduct surveys to determine what type of strategies\nto implement. This approach helps management define job satisfaction objectively.\nSuperior-subordinate communication, or the relationship between supervisors and their direct report(s), is another important influence on\njob satisfaction in the workplace.\nKey Terms\njob satisfaction: The level of contentment a person feels regarding his or her work.\nWhat Is Job Satisfaction?\nJob satisfaction is the level of contentment a person feels regarding his or her job. This feeling is mainly based on an individual's\nperception of satisfaction. Job satisfaction can be influenced by a person's ability to complete required tasks, the level of communication\nin an organization, and the way management treats employees.\nJob satisfaction falls into two levels: affective job satisfaction and cognitive job satisfaction. Affective job satisfaction is a person's\nemotional feeling about the job as a whole. Cognitive job satisfaction is how satisfied employees feel concerning some aspect of their job,\nsuch as pay, hours, or benefits.\nMeasuring Job Satisfaction\nMany organizations face challenges in accurately measuring job satisfaction, as the definition of satisfaction can differ among various\npeople within an organization. However, most organizations realize that workers' level of job satisfaction can impact their job\nperformance, and thus determining metrics is crucial to creating strong efficiency.\nDespite widespread belief to the contrary, studies have shown that high-performing employees do not feel satisfied with their job simply\nas a result of to high-level titles or increased pay. This lack of correlation is an significant concern for organizations, since studies also\nreveal that the implementation of positive HR practices results in financial gain for the organizations. The cost of employees is quite high,\nand creating satisfaction relevant to the return on this investment is paramount. Simply put: positive work environments and increased\nshareholder value are directly related.\nSome factors of job satisfaction may rank as more important than others, depending on each worker's needs and personal and\nprofessional goals. To create a benchmark for measuring and ultimately creating job satisfaction, managers in an organization can employ\nproven test methods such as the Job Descriptive Index (JDI) or the Minnesota Satisfaction Questionnaire (MSQ). These assessments help\nmanagement define job satisfaction objectively.\nImportant Factors\nTypically, five factors can be used to measure and influence job satisfaction:\n1. Pay or total compensation\n2. The work itself (i.e., job specifics such as projects, responsibilities )\n3. Promotion opportunities (i.e., expanded responsibilities, more prestigious title)\n4. Relationship with supervisor\n5. Interaction and work relationship with coworkers\nManagement and Communication\nIn addition to these five factors, one of the most important aspects of an individual's work in a modern organization concerns\ncommunication demands that the employee encounters on the job. Demands can be characterized as a communication load: \"the rate\nand complexity of communication inputs an individual must process in a particular time frame.\" If an individual receives too many\nmessages simultaneously, does not receive enough input on the job, or is unsuccessful in processing these inputs, the individual is more\nlikely to become dissatisfied, aggravated, and unhappy with work, leading to a low level of job satisfaction.\nSuperior–subordinate communication, or the relationship between supervisors and their direct report(s), is another important influence on\njob satisfaction in the workplace. The way in which subordinates perceive a supervisor's behavior can positively or negatively influence job\nsatisfaction. Communication behavior—such as facial expression, eye contact, vocal expression, and body movement—is crucial to the\nsuperior–subordinate relationship.\nHow Job Satisfaction Influences Behavior\nJob satisfaction can affect a person's level of commitment to the organization, absenteeism, and job turnover.\nLearning Objectives\nDiscuss the way in which job satisfaction reflects upon work behaviors in an organization\nKey Takeaways\nKey Points\nIf people are satisfied with the work they are doing, it feels less like work, thus motivating a more positive attitude and higher levels of\npassion.\nIndividuals who are committed to their job will likely be more willing to work longer hours or take on additional responsibilities without\nan increase in pay.\nSatisfaction can be improved through effective management strategies. Managers are responsible for understanding what motivates\nemployee satisfaction and creating a positive work environment conducive to it.\nKey Terms\njob turnover: The number of employees who leave an organization of their own free will and need to be replaced.\njob description: An outline of the tasks and responsibilities in a post within an organization.\nThe Influence of Job Satisfaction on Behavior\nJob satisfaction can affect a person's level of commitment to the organization, absenteeism, and job turnover rate. It can also affect\nperformance levels, employee willingness to participate in problem-solving activities, and the amount of effort employees put in to\nperform activities outside their job description. When people are satisfied with the work they are doing, then their job feels less like work\nand is a more enjoyable experience. Those who are satisfied in their jobs usually do not find it difficult to get up and go to work.\nJob satisfaction: Job satisfaction can affect\nrelationships.\nJob satisfaction also reduces stress, which can affect job performance, mental well-being, and physical health. Stress can also affect\ndecision-making—possibly leading to unethical or nonstrategic choices. Satisfied employees, on the other hand, maintain a more positive\nand carefree perspective about work. This positive outlook often spreads to co-workers and can have a positive experience on everyone's\nperformance. There are some indications that job satisfaction is directly tied to job performance; nonetheless, feeling less stressed can\npositively affect a person's behavior.\nMethods for Increasing Job Satisfaction\nTo determine if employees are actually satisfied with the work they do, organizations frequently conduct surveys to measure employees'\nlevel of job satisfaction and to identify areas—on-boarding, job training, employee incentive programs, etc.—for improvement and job\nenrichment. Because job satisfaction varies for each individual, management teams employ several different strategies to help the\nmajority of employees within an organization feel satisfied with their place in the company.\nOne proven way to enhance job satisfaction is rewarding employees based on performance and positive behavior. When employees go\nabove and beyond their job description to complete a project or assist a colleague, their actions can be referred to as organizational\ncitizenship behavior or OCB (see Bommer, Miles, and Grover, 2003). Bommer, Miles, and Grover state:\nSocial-information processing is predicated on the notion that people form ideas based on information drawn from their immediate\nenvironment, and the behavior of co-workers is a very salient component of an employee's environment. Therefore, observing frequent\ncitizenship episodes with in a workgroup is likely to lead to attitudes that such OCB is normal and appropriate. Consequently, the\nindividual is likely to replicate this ‘normal' behavior.\nThese positive changes in behavior show that people learn from their environments and that corporate culture plays a large part in\ncreating job satisfaction. Managers are tasked with managing this positive culture and understanding how each employee is affected by\ncultural influences in the workplace. No two people are the same; this is where managers come into play. Managers must be insightful\nand observant, identifying what motivates high levels of job satisfaction in each individual and ensuring employees get what they need. In\nsome ways, a manager's customers are their subordinates. Understanding this dynamic is an important component of the role of\nmanagement.\nHow Emotion and Mood Influence Behavior\nEmotion and mood can affect temperament, personality, disposition, motivation, and initial perspectives and reactions.\nLearning Objectives\nDescribe the importance of employee moods and emotions on overall performance from an organizational perspective\nKey Takeaways\nKey Points\nThe poor decision -making effects of a given mood can hinder a person's job performance and lead to bad decisions that affect the\ncompany.\nEmotion is a subjective lens on an objective world; decision-making should discard emotion whenever possible. This is particularly\nimportant for managers, who make significant decisions on a daily basis.\nAs emotion is largely a chemical balance (or imbalance) in the mind, emotions can quickly cloud judgment and complicate social\ninteractions without the individual being consciously aware that it is happening.\nKey Terms\nmood: A mental or emotional state.\nemotions: Subjective, conscious experiences that are characterized primarily by psycho-physiological expressions, biological reactions,\nand mental states.\nEmotions in the Workplace\nEmotions and mood can affect temperament, personality, disposition, and motivation. They can affect a person's physical well-being,\njudgement, and perception. Emotions play a critical role in how individuals behave and react to external stimuli; they are often\ninternalized enough for people to fail to notice when they are at work. Emotions and mood can cloud judgment and reduce rationality in\ndecision-making.\nMood\nAll moods can affect judgment, perception, and physical and emotional well-being. Long-term exposure to negative moods or stressful\nenvironments can lead to illnesses such as heart disease, diabetes, and ulcers. The decision-making effects of any kind of bad mood can\nhinder a person's job performance and lead to poor decisions that affect the company. In contrast, a positive mood can enhance creativity\nand problem solving. However, positive moods can also create false optimism and negatively influence decision making.\nEmotion\nEmotions are reciprocal with mood, temperament, personality, disposition, and motivation. Emotions can be influenced by hormones and\nneurotransmitters, such as dopamine and seratonin. Dopamine can affect a person's energy level and mood, while seratonin can affect\ncritical-thinking skills. As emotion is largely a chemical balance (or imbalance) in the mind, emotions can quickly cloud judgment and\ncomplicate social interactions without the individual being consciously aware that it is happening.\nPlutchik Wheel: Emotions are complex and move in various\ndirections. Modeling emotional feelings and considering their\nbehavioral implications are useful in preventing emotions from\nhaving a negative effect on the workplace.\nThe implication for behavior is important for both managers and subordinates to understand. Workers must try to identify objectively\nwhen an emotional predisposition is influencing their behavior and judgement and ensure that the repercussions of the emotion are\neither positive or neutralized. Positive emotions can be a great thing, producing extroversion, energy and job satisfaction. However, both\npositive and negative emotions can distort the validity of a decision. Being overconfident, for example, can be just as dangerous as being\nunder-confident.\nOrganizational Implications\nBy encouraging positive employee management relationships and employee dynamics, an organization may be able to balance a person's\nmood and emotions. Improving the level of job satisfaction for employees is another way that a company can influence an employee's\nmood. If a person is satisfied at work, that condition may reduce levels of stress and help influence motivation and disposition. Job\nsatisfaction can affect a person's mood and emotional state. Providing organizational benefits, such as a company gym, meditation\nclasses, or company retreats, can likewise influence a person's emotions. An active lifestyle has been shown to produce an increased level\nof dopamine, which can enhance energy and mood.\nManagers are tasked not only with monitoring and controlling their own moods and emotions, but also with recognizing emotional issues\nin their subordinates. Managers should strive to balance the emotions of their subordinates, ensuring nothing negatively affects their\nmental well-being. This can be a difficult role for management, as many people display their emotions in different ways (and most tend to\nhide them, particularly at work). Managers must be both perceptive and strategic in ensuring a mental balance at work.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}