{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Culture and Innovation\nAdapting and Innovating\nBenefits of Innovation\nInnovation may be linked to positive changes in efficiency, productivity, quality, competitiveness, and market share, among other factors.\nLearning Objectives\nIdentify the organizational benefits derived through enabling internal innovation\nKey Takeaways\nKey Points\nInnovation is the development of customer value through solutions that meet new needs, unarticulated needs, or existing market needs\nin unique ways.\nInnovative employees increase productivity by creating and executing new processes which in turn may increase competitive advantage\nand provide meaningful differentiation.\nManagers who promote an innovative environment can see value through increased employee motivation, creativity, and autonomy;\nstronger teams; and strategic recommendations from the bottom up.\nClarity about and understanding of roles, increased responsibilities, strategic partnerships, senior management support, organizational\nrestructuring, and investment in human resources can all enrich organizational culture and innovation.\nKey Terms\nefficiency: The extent to which a resource, such as electricity, is used for the intended purpose; the ratio of useful work to energy\nexpended.\nproductivity: The rate at which goods or services are produced by a standard population of workers.\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nDefining Innovation\nInnovation is the development of customer value through solutions that meet new, undefined, or existing market needs in unique ways.\nSolutions may include new or more effective products, processes, services, technologies, or ideas that are more readily available to\nmarkets, governments, and society.\nInnovation is easily confused with words like invention or improvement. They are, however, different terms. Innovation refers to coming up\nwith a better idea or method, or integrating a new approach within a contextual model, while invention is more statically about creating\nsomething new. Innovation refers to to finding new ways to do things, while improvement is about doing the same thing more effectively.\nOrganizational Benefits of Innovation\nFrom an organizational perspective, managers encourage innovation because of the value it can capture. Innovative employees increase\nproductivity through by creating and executing new processes, which in turn may increase competitive advantage and provide\nmeaningful differentiation. Innovative organizations are inherently more adaptable to the external environment; this allows them to react\nfaster and more effectively to avoid risk and capture opportunities.\nFrom a managerial perspective, innovative employees tend to be more motivated and involved in the organization. Empowering\nemployees to innovate and improve their work processes provides a sense of autonomy that boosts job satisfaction. From a broader\nperspective, empowering employees to engage in broader organization-wide innovation creates a strong sense of teamwork and\ncommunity and ensures that employees are actively aware of and invested in organizational objectives and strategy. Managers who\npromote an innovative environment can see value through increased employee motivation, creativity, and autonomy; stronger teams; and\nstrategic recommendations from the bottom up.\nManagers can accomplish this through providing top-down support to employees, providing clear roles and responsibilities while\nallowing individuals the freedom to pursue these as they see fit. Supporting the HR and IT departments so that they can provide training\nand tools for higher employee efficiency can contribute substantially to a culture of internal innovation. This requires open-minded and\nmotivational leaders in managerial positions who are capable of steering employee efforts without diminishing employee creativity.\nCharacteristics of Innovative Organizations\nAccording to recent research, companies that make a commitment to innovation are exceptional performers in their respective industries.\nLearning Objectives\nOutline the critical success factors and characteristics of an adaptable and innovative organizational culture\nKey Takeaways\nKey Points\nBeing receptive to new business ideas means being receptive to the idea that mistakes are a necessary part of the process.\nEveryone in the business needs to keep an open mind and develop the capacity to look at things with fresh eyes.\nIt is likely that some successful innovations will result from chance discoveries.\nManagers must understand that employees too mired in routine work and too criticized for trying new methods will inherently fail to\ncreate innovations that may drive organizational growth.\nKey Terms\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nMany business experts argue that companies that make a substantial commitment to innovation and entrench it deeply throughout their\nculture will perform exceptionally well. But how can innovation be facilitated within the organizational framework? The following are some\nexamples of characteristics that lead to successful innovation.\nAccept Mistakes as Part of the Process\nA Minnesota Mining & Manufacturing researcher was looking for ways to improve the adhesives used in 3M tapes that he discovered an\nadhesive that formed itself into tiny spheres. At first, it seemed as though his work was a failure. However, the new adhesive was later\nused on Post-it notes—a great innovation and business success for the company. Being receptive to new business ideas means being\nreceptive to mistakes as a necessary, and sometimes even crucial, part of the process.\nKeep an Open Mind and Think Laterally\nPossibilities for innovation exist everywhere. To realize them, everyone in the business needs to keep an open mind and develop the\ncapacity to look at things with fresh eyes.\nThe classic example of a company that completely transformed itself as a result of lateral thinking is the Finnish company Nokia, whose\noriginal core business was wood pulp and logging. When the collapse of communism opened the Russian market to the west, Nokia's\ncore business was seriously threatened by cheaper imports from Russia's seemingly limitless forests. In the deep recession of the early\n1990s, Nokia's management concluded that the only real competitive advantage they retained was a very efficient communications\nsystem developed in the 1970s that helped them keep in touch with their remote logging operations. That single realization transformed\nthe company into one of the world's most successful vendors of communications equipment.\nNokia cell phone: Nokia successfully transformed itself from a\nlogging company to an electronic-communications company\nthrough innovation.\nManagerial Implications\nAs is usually the case, these principles are easier said than done. Managers must carefully consider what type of work environment they\nproject for their subordinates. Managers must understand that employees too mired in routine work and who are criticized for trying new\nmethods will inherently fail to create innovations that may drive organizational growth. There is therefore a balancing act between\nenabling employees to try new things and take risks vs. ensuring that tasks are completed on time with reasonable success.\nTypes of Innovation\nThere are three main modes of innovation: entrepreneurial value-based, technology-based, and strategic-reflexive.\nLearning Objectives\nOutline a categorical overview of the potential ways in which innovation can be pursued and identified.\nKey Takeaways\nKey Points\nThe entrepreneurial method of innovation is one in which change is initiated by an individual's actions and drive to create a business\nventure of adaptation.\nTechnology-based functional innovation occurs when the development of new technology drives innovation.\nThe strategic -reflexive mode describes innovation that springs from individuals' interactions with their organization 's common values\nand goals.\nOther types of innovation include: incremental, architectural, generational, manufacturing, financial, and cumulative.\nKey Terms\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nIn business and economics, innovation is the catalyst to growth. Fuglsang and Sundbo (2005) suggest that there are three modes of\ninnovation. The first is an entrepreneurial value-based method where change is initiated by an individual's actions. The second is a\ntechnology-based functional mode in which the development of new technology drives innovation. The third is a strategic-reflexive mode\nin which innovation results from individual's interactions with their organization's set of common values and goals. The following graphic\nprovides an example of the innovation process.\nInnovation process: Innovation involves continuous\nimprovement throughout phases of a development\nprogram. Phases can be iterative and recursive\n(meaning that they do not proceed linearly from one\nto the next; rather, earlier phases can be returned to\nfor further improvement as needed). Such phases\ninclude market analysis and consumer research,\nwhich progress to design and prototyping, after\nwhich follow naming and packaging design and\nultimately retail and production support.\nEntrepreneurial Innovation\nThe innovation dimension of entrepreneurship refers to the pursuit of creative or novel solutions to challenges confronting a firm. These\nchallenges can include developing new products and services or new administrative techniques and technologies for performing\norganizational functions (e.g., production, marketing, and sales and distribution).\nTechnological Innovation\nTechnological innovation takes place when companies try to gain a competitive advantage either by reducing costs or by introducing a\nnew technology. Technological innovation has been a hot topic in recent years, particularly when coupled with the concept of disruptive\ninnovation. Disruptive innovation is usually a technological advancement that renders previous products/services (or even entire\nindustries) irrelevant. For example, the smartphone disrupted landlines, Netflix made Blockbuster obsolete, and mp3s have marginalized\nCD players.\nStrategic Innovation\nThe strategic-reflexive mode of innovation is the most effective mode for change and innovation. While technological innovation is clear\nand easy to define, strategic innovation is inherently intangible and organizational in nature. Strategic innovation pertains to processes:\nhow things are done as opposed to what the end product is. Strategic changes can be disruptive but are more often incremental.\nIncremental innovation is the idea that small changes, when effected in large volume, can rapidly transform the broader organization.\nWalmart's \"Hub and Spoke\" distribution model is a classic example of strategic innovation. Walmart succeeded thanks to process\nefficiency enabled via innovative operational paradigms and distribution strategies. By utilizing a maximum efficiency warehousing and\ndistribution model, refined over and over again incrementally for improvement, Walmart has sustained a competitive advantage for\ndecades.\nOther Applications of Innovation\nGenerational innovation involves changes in subsystems linked together with existing linking mechanisms.\nArchitectural innovation involves changes in linkages between existing subsystems.\nIncremental innovations improve price/performance advancement at a rate consistent with the existing technical trajectory. Radical\ninnovations advance the price/performance frontier by much more than the existing rate of progress.\nManufacturing process innovation refers to all the activities required to invent and implement a new manufacturing process.\nCumulative innovation is any instance of something new being created from more than one source. Remixing music is a direct example of\ncumulative innovation.\nFinancial innovation has brought many new financial instruments with pay-offs or values depending on the prices of stocks. Examples\ninclude exchange-traded funds (ETFs) and equity swaps.\nSpeed of Innovation\nCompanies compete to adapt their products and services to incorporate new innovations first.\nLearning Objectives\nRecognize the challenge inherent in adopting new ideas and the subsequent considerations pertaining to the speed of pursuing them.\nKey Takeaways\nKey Points\nSpeed of innovation can pose a major challenge for organizations responding to external change.\nProfits depend on speed of innovation and the ability to attract customers. Big corporations used to dominate, but now industry leaders\nare often small, highly flexible groups that come up with great ideas, build trustworthy branding for themselves and their products, and\nmarket them effectively.\nA first-mover in a given innovation captures the obvious advantage of tapping into a new market before the competition. This can also\nallow the first-mover to capture the new technology for its own brand.\nFirst-movers encounter high fiscal risks in integrating a new product or services into their distribution, and failure often means sunk costs.\nLate-comers to the game can simply observe the success or failure of other competitors and make a more informed (and less risky)\ndecision.\nKey Terms\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nCannibalization: The reduction of sales or market share for one of your own products by introducing another.\nThe best ideas should implemented as quickly as possible—not just by the idea generator but also by others who have a different\nviewpoint. It is imperative that the idea is honed and refined while it is still fresh. For example, an idea for a new product might start out\nas a crude model built from polystyrene, foam, or cardboard that will evolve quickly into a more professional prototype.\nProduct Innovation Approach: Innovation involves continuous\nimprovement throughout phases of a development program. Phases\ncan be iterative and recursive (meaning that they do not proceed\nlinearly from one to the next; rather, earlier phases can be returned to\nfor further improvement as needed). Such phases include market\nanalysis and consumer research, which progress to design and\nprototyping, after which follow naming and packaging design and\nultimately retail and production support.\nRobert Reich observes that profits in the old economy came from economies of scale, i.e., long runs of almost identical products. Thus we\nhad factories, assembly lines, and industries. Today, profits come from speed of innovation and the ability to attract and keep customers.\nTherefore, while the big winners in the old economy were big corporations, today's big winners are often small, highly flexible groups that\ndevise great ideas, develop trustworthy branding for themselves and their products, and market these effectively. The winning\ncompetitors are those who are first at providing lower prices and higher value through intermediaries of trustworthy brands. To keep the\nlead, however, these companies have to keep innovating lest they fall behind the competition.\nThe Benefit of Moving First\nSpeed of innovation poses a major challenge for organizations responding to external change. A high rate of change can be seen in the\nshortening of product life cycles, increased technological change, increased speed of innovation, and increased speed of diffusion of\ninnovations. These are key challenges for organizations, as the profit generation of new ideas must fit into a slimmer chronological\nwindow—thus underlining the great value of being a first-mover.\nA first-mover in a given innovation captures the obvious advantage of tapping into a new market before its competitors. This also\nsometimes allows the first-mover to identify its brand with the new technology (i.e., saying \"Google it\" as shorthand for online search or\ncalling any and all mp3 players an iPod). These branding hurdles must be tackled by any competitor following in the footsteps of the first-\nmover.\nHowever, speed is not everything. First-movers encounter serious disadvantages, the most notable of which are freeloaders. First-movers\nalso encounter high fiscal risks in integrating a new product or services into their distribution, and failure often means sunk costs.\nLatecomers to the game can simply observe the success or failure of other competitors and make more informed (and less risky) decisions\nabout entering the market segment. Similarly, first movers must carefully consider cannibalization—where their new innovative products\nsteal sales from their older products still on store shelves. Speedy innovation and moving first requires great foresight, planning, and\nmanagerial skill to execute effectively to minimize risks.\nSustainability Innovation\nSustainability innovation combines sustainability (endurance through renewal, maintenance, and sustenance) with innovation.\nLearning Objectives\nDescribe how organizational culture adds value by generating an innovative approach to sustainability issues\nKey Takeaways\nKey Points\nSustainopreneurship describes using creative organizing to solve problems related to sustainability to in turn create social and\nenvironmental sustainability as a strategic objective and purpose.\nSolving sustainability-related problems is the be-all and end-all of sustainability entrepreneurship.\nPassively heated houses, solar cells, organic food, fair trade products, hybrid cars, and car sharing are all examples of sustainability\ninnovations.\nKey Terms\nsustainability: Configuring human activity so that societies are able to meet current needs while preserving biodiversity and natural\necosystems for future generations.\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nSustainability is the capacity to endure through renewal, maintenance, and sustenance (or nourishment), which is different than durability\n(the capacity to endure through resistance to change). Innovation is the creation of new value through the use of solutions that meet new,\npreviously unknown, or existing needs in new ways. Innovation should be pursued with sustainability in mind as a critical strategic\nobjective, as the integration of new business ideas with the broader community and environment is central to long-term success.\nSustainability Entrepreneurship\n\"Sustainopreneurship\" describes using creative business organizing to solve problems related to sustainability to create social and\nenvironmental sustainability as a strategic objective and purpose, while at the same time respecting the boundaries set in order to\nmaintain the life support systems of the process. In other words, it is \"business with a cause,\" where the world's problems are turned into\nbusiness opportunities for deploying sustainability innovations. Sustainopreneurship is entrepreneurship and innovation for sustainability.\nThis definition is highlighted by three distinguishing dimensions. The first is oriented towards \"why\" - a company's purpose and motive in\nadopting sustainable entrepreneurship. The second and third reflect two dimensions of \"how\" the process is carried out.\nEntrepreneurship consciously sets out to find or create innovations to solve sustainability-related problems.\nEntrepreneurship moves solutions to market through creative organizing.\nEntrepreneurship adds sustainability value while respecting life support systems.\nSolving sustainability-related problems from the organizational frame is the be-all and end-all of sustainability entrepreneurship. This\nmeans that all three dimensions are simultaneously present in the process.\nAn example to provide context: Interface Global produces modular carpeting. Sustainability is the core operating mission and vision of the\nbroader organization. Through greening their supply chain, minimizing water use, cutting electric costs, reducing fuel costs through better\ndistribution, and a number of other innovative process improvements, Interface Global produces high quality carpets at a lower cost and\nsmaller environmental footprint. The company created a sustainable business strategy through innovative thinking.\nSocial Innovation\nSocial innovation refers to new strategies, concepts, ideas, and organizations that meet societal needs of all kinds.\nLearning Objectives\nDefine social innovation and the potential positive outcomes of employing it within an organizational culture\nKey Takeaways\nKey Points\nSocial innovation can refer to social processes of innovation, such as open source methods and techniques.\nSocial innovation can also refer to innovations that have a social purpose, like microcredit or distance learning, and can be related to\nsocial entrepreneurship.\nSocial innovation can take place within the government sector, the for-profit sector, the nonprofit sector (also known as the third sector),\nor in the spaces between them.\nKey Terms\nsocial: Of or relating to society.\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\nsocial capital: The value created by interpersonal relationships with expected returns in the marketplace.\nSocial innovation refers to new strategies, concepts, ideas, and organizations that extend and strengthen civil society or meet societal\nneeds of all kinds—from working conditions and education to community development and health.\nOrganizations, both for for-profit and nonprofit, benefit enormously from incorporating social innovation into their operations. Giving\nback to to the community and empowering the individuals you work with and sell to (i.e., stakeholders) improves employee morale, grows\nwealth for potential customers, builds a strong brand, and underlines social responsibility and high ethical standards as central to the\norganizational character.\nExample of a social innovation program: A health camp\nconducted for villagers as part of the Social Innovation Program\nat SOIL, in partnership with the Max India Foundation.\nThe term \"social innovation\" has overlapping meanings. Sometimes it refers to social processes of innovation like open-source methods\nand techniques. Other times it refers to innovations that have a social purpose, like microcredit or distance learning. The concept can also\nbe related to social entrepreneurship (entrepreneurship is not necessarily innovative, but it can be a means of innovation). On occasion, it\nalso overlaps with innovation in public policy and governance. Social innovation can take place within the government sector, the for-\nprofit sector, the nonprofit sector (also known as the third sector), or in the spaces between them. Research has focused on the types of\nplatforms needed to facilitate such cross-sector collaborative social innovation.\nThe Process of Social Innovation\nSocial innovation is often an effort of mental creativity that involves fluency and flexibility across a wide range of disciplines. The act of\nsocial innovation in a sector encompasses diverse disciplines within society. The social innovation theory of \"connected difference\"\nemphasizes three key dimensions of social innovation:\nFirst, it usually produces new combinations or hybrids of existing elements, rather than wholly new.\nSecond, it cuts across organizational or disciplinary boundaries.\nLast, it creates compelling new relationships between previously separate individuals and groups. Social innovation is currently gaining\nvisibility within academia.\nExamples of Social Innovation\nThere are many examples of social innovation making a meaningful difference across the globe—from huge organizations like the Bill and\nMelinda Gates Foundation funding multinational initiatives to small groups of community leaders collecting money to help buy new high\nschool textbooks. Some specific examples include:\nThe University of Chicago sought to develop social innovations that would address and ameliorate the immense problems caused by\npoverty in a largely immigrant city around the turn of the 20th century.\nProminent social innovators include Bangladeshi Muhammad Yunus, the founder of Grameen Bank, who pioneered the concept of\nmicrocredit for supporting innovators in multiple developing countries in Asia, Africa, and Latin America.\nStephen Goldsmith, former Indianapolis mayor, engaged the private sector in providing many city services.\nCommercializing Innovative Products\nCommercialization is the process or cycle of introducing a new product or production method into the market.\nLearning Objectives\nExamine the three key aspects of the commercialization process and outline the four key questions that must be answered prior to the\ncommercialization of a new and innovative product\nKey Takeaways\nKey Points\nThe actual launch of a new product is the final stage of new product development. This is when the most money is spent for advertising,\nsales promotion, and other marketing efforts.\nIt is important to emphasize that the commercialization strategy and feasibility should have been considered and approved long before\nthe actual execution of commercialization - as the time, efforts and development costs have already largely been incurred.\nOrganizations must consider who they are selling to and where they are selling when determining the most effective process for\ncommercialization.\nThe primary target consumer group includes innovators, early adopters, heavy users, and opinion leaders. Their buy-in will ensure\nadoption by other consumers in the marketplace during the product growth period.\nKey Terms\ncommercialization: The act of positioning a product to make a profit.\nearly adopter: A person who begins using a product or service at or around the time it becomes available.\nCommercialization is often confused with sales, marketing, or business development. In the context of innovation, commercialization is\nthe process of introducing a new product or service to the public market. Innovations are defined as new products or services that\nimprove upon their predecessors, and the process of integrating them into the current market is a critical component of successfully\nbringing them to market. Great innovations are not always brought to market due to a lack of feasibility or poor planning. Long-term\nplanning is crucial in the commercialization process because this is when the most money will be spent—on advertising, sales promotions,\nand other marketing efforts after the launch of a new product.\nProduct innovation approach: Innovation involves continuous\nimprovement throughout phases of a development program. Phases\ncan be iterative and recursive (meaning that they do not proceed\nlinearly from one to the next; rather, earlier phases can be returned\nto for further improvement as needed). Such phases include market\nanalysis and consumer research, which progress to design and\nprototyping, after which follow naming and packaging design and\nultimately retail and production support.\nThe Commercialization Process\nThe commercialization process has three key aspects:\nCarefully select, based upon comprehensive market research, which products can be sustained financially in which markets for long-term\nsuccess.\nPlanning for various phases and/or stages in the commercialization process is key. Consider geographic distribution, different\ndemographics, etc.\nFinally, identify and involve key stakeholders early, including consumers.\nKey Strategic Questions\nWhen bringing a product to market, a number of key strategic questions need to be answered satisfactorily long before substantial costs\nare incurred for commercialization. These questions are simple to ask but complex to answer, and business analysts and market\nresearchers will spend a considerable amount of time approaching them via research models and careful financial consideration.\nWhen: The company has to time introducing the product perfectly. If there is a risk of cannibalizing the sales of the company's other\nproducts, if the product could benefit from further development, or if the economy is forecasted to improve in the near future, the\nproduct's launch should be delayed. Similarly, many items are seasonal (e.g., fashion) and so should be timed appropriately to maximize\nrevenue.\nWhere: The company has to decide where to launch its products. This can be in a single location, in one or several larger regions, or in a\nnational or international market. This decision will be strongly influenced by the company's resources; larger companies can reach broader\ngeographic audiences. It is important to keep in mind where the early adopters will be and where competitive gaps may exist. In the\nglobal marketplace, this question is increasingly complex.\nTo whom: The primary target consumer group will have been identified earlier through research and test marketing. This primary\nconsumer group will include innovators, early adopters, heavy users, and opinion leaders. Their buy-in will ensure adoption by other\nconsumers in the marketplace during the product growth period.\nHow: The company has to decide on an action plan for introducing the product by implementing these decisions. It has to develop a\nviable marketing mix and create a respective marketing budget.\nWhile these questions are key considerations in the commercialization process, remember that they should have been answered long\nbefore the commercialization stage. After all, if the need is not sufficiently widespread or the market not sufficiently developed, there is\nlittle reason to have pursued a given innovation in the first place.\nFostering Innovation\nOffering employees challenges, freedom, resources, encouragement, and support can help them to innovate.\nLearning Objectives\nOutline how to encourage creativity, participation and innovation through effective management\nKey Takeaways\nKey Points\nPeople perform best when they are driven by inspiration and are encouraged to push their boundaries and think outside the box.\nTeamwork enhances people's strengths and lessens their individual weaknesses.\nOne of the most powerful tools for promoting employee creativity and innovation is recognition.\nUltimately, in developing a culture of innovation you want employees to feel comfortable experimenting and offering suggestions without\nfear of criticism or punishment for mistakes.\nKey Terms\ninnovation: A change in customs; something new and contrary to established customs, manners, or rites.\ncreativity: The quality or ability to create or invent something.\nStrategies capable of producing innovation require resources and energy; it is therefore necessary to discuss in your business plan the\norganizational structures and practices you will put in place to encourage and support innovation. Amabile (1998) points to six general\ncategories of effective management practices that create a learning culture within an organization:\nProviding employees with a challenge\nProviding freedom to innovate\nProviding the resources needed to create new ideas/products\nProviding diversity of perspectives and backgrounds within groups\nProviding supervisor encouragement\nProviding organizational support\nInnovation: Cartoon shows the challenge of translating innovation\n(designers) to economic success.\nCreate a Culture of Innovation\nYou will likely find that you need to generate hundreds of ideas to find ten good ones that will create value for your organization. This is\npart of the creative brainstorming process, and it should be encouraged. It should be the responsibility of every individual in the\norganization to come up with ideas, not just the founder or key staff. Here are some suggestions to encourage the flow of ideas.\nEncourage Creativity\nEncouraging creativity helps keep staff happy. If they think something is important and has the potential to create a financial payoff for\nthe company, let them follow their idea. People perform best when they are driven by inspiration and encouraged to push their\nboundaries and think outside the box. But employees cannot do this when they are being micromanaged. Employees need to feel\nindependent enough to own their innovative thinking and to pursue the ideas they are passionate about. In fact, if management\neffectively fosters a creative and open environment, innovation will happen naturally.\nEncourage Participation\nTeamwork enhances people's strengths and mitigates their individual weaknesses. Effective teamwork also promotes the awareness that it\nis in everyone's best interests to keep the business growing and improving. Creating a participation-based environment means creating\nsmart teams, encouraging open dialogue, and minimizing authority. Criticism is productive and should be encouraged, but it must be\nused constructively.\nProvide Recognition and Rewards\nOne of the most powerful tools for promoting employee creativity and innovation is recognition. People want to be recognized and\nrewarded for their ideas and initiatives, and it is a practice that can have tremendous payoff for the organization. Sometimes the\nrecognition required may be as simple as mentioning a person's effort in a newsletter. If a staff member comes up with a really creative\nidea, mention them in the company newsletter or on the news board even if their idea can't be implemented immediately. Make it clear\nthat compensation and promotions are tied to innovative thinking.\nEnable Employee Innovation\nYou may have an innovative culture in your organization, but you also need to familiarize staff with some of the hallmarks of continuing\ninnovation. For example, you could educate employees at regular training sessions on topics such as creativity, entrepreneurship, and\nteamwork. Each session might conclude with the assignment of an exercise to be performed over the next few working weeks that will\nconsolidate lessons learned. Your aim here is to give employees a taste of innovation so they will embrace the process.\nOther Motivators\nProfit-sharing and bonuses\nDays off\nExtra vacation time\nEncourage employees to take advantage of coffee breaks, lunch breaks, and taxi rides. Often great ideas that can lead to innovation will\nhappen outside the places where we expect them to happen. If it's hard to get staff together for common informal breaks, consider taking\nthem out for an informal meal where you can encourage creative discussion about work. Also be sure to encourage laughter at meetings\nbecause laughter is an effective measure of how comfortable people feel about expressing themselves.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}