{
    "text": "Search... Home Subjects\nBoundless Management\nEthics in Business\nMaintaining Ethical Standards\nEthical Decision Making\nEthical decision making is the process of assessing the moral implications of a course of action.\nLearning Objectives\nIdentify the elements of decision making that are directly affected by ethical considerations and social expectations\nKey Takeaways\nKey Points\nAll business decisions have an ethical or moral dimension because they have an effect on stakeholders.\nEthical decisions cannot be made solely through objective analysis or consideration of data and information, but must rely on judgment\nand interpretation.\nMaking ethical decisions also involves choice about who should be involved in the process and how the decision should be made.\nKey Terms\ncognitive: Of the mental functions that deal with logic, as opposed to affective functions, which deal with emotion.\nethics: The study of principles relating to right and wrong conduct.\ndecision: A choice or judgement.\nEthics are moral principles that guide a person's behavior. These morals are shaped by social norms, cultural practices, and religious\ninfluences. Ethical decision making is the process of assessing the moral implications of a course of action. All decisions have an ethical or\nmoral dimension for a simple reason—they have an effect on others. Managers and leaders need to be aware of their own ethical and\nmoral beliefs so they can draw on them when they face difficult decisions.\nEthical decisions can involve several determinations. The field of ethics, also known as moral philosophy, shows that there are various\nways of systematizing, defending, and recommending concepts of right and wrong conduct. For example, from a consequentialist\nstandpoint, a morally right action is one that produces a good outcome, or consequence. A utilitarian perspective takes the position that\nthe proper course of action is one that maximizes overall happiness.\nMost ethical decisions exist in a gray area where there is no clear-cut or obvious decision that can be determined solely through\nquantitative analysis or consideration of objective data or information. Ethical decision making requires judgment and interpretation, the\napplication of a set of values to a set of perceptions and estimates of the consequences of an action. Sometimes ethical decisions involve\nchoosing not between good and bad, but between good and better or between bad and worse.\nMaking ethical decisions also involves choice about who should be involved in the process and how the decision should be made. For\nexample, if a decision will have a significant impact on the local community, leaders may feel obligated to invite a representative of the\ncommunity to participate in discussions. Similarly, decisions with a significant ethical dimension may benefit from being made by\nconsensus rather than by fiat—to demonstrate that the choice is consistent with an organization 's espoused values.\nTraining Ethical Decision Making\nOrganizations use compliance and ethics programs to demonstrate and reinforce their commitment to ethical practices.\nLearning Objectives\nRecognize the value in ensuring that managers are trained in business ethics and legal standards, particularly in light of the growing\ncomplexity of legal factors\nKey Takeaways\nKey Points\nOrganizations use compliance and ethics programs to clarify and communicate their ethical standards to employees and help develop\ntheir ethical decision -making skills.\nA compliance and ethics program can identify the boundaries of legal and ethical behavior and establish a system to alert management\nwhen the organization is getting close to (or crossing) a boundary or approaching an obstacle that prevents the achievement of a\nbusiness objective.\nEthics training inside corporations is aimed at helping employees address the moral dimension of business decisions.\nKey Terms\nethics: The study of principles relating to right and wrong conduct.\ngovernance: The implementation of policies, processes, and rights.\nMany organizations implement compliance and ethics programs to help guide the decision making and behavior of employees.\nCompliance with regulatory requirements and the organization's own policies are a critical component of effective risk management.\nMonitoring and maintaining compliance is not just to keep the regulators happy—it is one of the most important ways for an\norganization to maintain its ethical health, support its long-term prosperity, and preserve and promote its values.\nEthics are important: In every type of\nbusiness, ethics are needed to keep\nbusiness standards high.\nOn a more practical level, a compliance and ethics program supports the organization's business objectives, identifies the boundaries of\nlegal and ethical behavior, and establishes a system to alert management when the organization is getting close to (or crossing) a legal or\nethical boundary. Once an issue is detected, management must be prepared to respond quickly and appropriately to minimize the impact\non the organization. The presence of compliance and ethics programs demonstrates an organization's commitment to creating a work\nenvironment and corporate culture that values doing what is right, good, and just.\nEthics training inside corporations is aimed at helping employees address the moral dimension of business decisions. Training for ethical\ndecision making can include workshops, guest lectures, and manager/employee discussions. Most ethics training focuses on clarifying\nand communicating an organization's ethical code so employees understand what is expected. Some learning opportunities go beyond\nthis to focus on how to take action when ethics are involved in a decision. Discussions of scenarios and role-playing exercises simulate\nreal decision-making situations and provide practice in how to think through ethical considerations. Some ethics training will also cover\nthe resources available to help employees when they face an ethical dilemma or suspect that someone in the organization has made an\nethical breach.\nWhistleblower Protection\nWhistle-blower protection provides safeguards against retaliation for those who report suspected legal or ethical violations.\nLearning Objectives\nOutline the methods with which the U.S. government seeks to protect whistle-blowers to maintain an equitable workplace\nKey Takeaways\nKey Points\nA whistle-blower is a person who tells the public or someone in authority about alleged misconduct occurring in a government\ndepartment, private company, or organization.\nMany organizations establish internal processes through which employees can come forward if they suspect an ethical or legal violation\nhas occurred.\nIn the United States, several protections are in place for whistle-blowers, such as the Whistleblower Protection Act for government\nworkers and the Dodd-Frank Wall Street Reform and Consumer Protection Act for employees in the securities industry.\nKey Terms\ndisclosure: The act of revealing something.\nA whistle-blower tells the public and/or the authorities about alleged misconduct occurring in a government department, private\ncompany, or organization. The alleged misconduct may take a variety of forms; for example, a violation of a law, rule, or regulation, or a\ndirect threat to public interest, such as fraud, health and safety violations, or corruption. Whistle-blowers may make their allegations\ninternally (to other people within the affected organization) or externally (to regulators, law-enforcement agencies, the media, or groups\nconcerned with the issues).\nMany organizations establish internal processes through which employees can come forward if they suspect an ethical or legal violation\nhas occurred. In some cases the processes allow for anonymity. Some organizations have an ombudsperson who handles such matters on\na confidential basis and advises the employee about their options should they wish to take formal steps to report the breach to the\nappropriate internal or external authorities.\nA whistle: Whistle-blowers are provided some protection\nunder the law.\nLegal Protections for Whistle-Blowers in the United States\nIn the United States several protections are in place for whistle-blowers. The Whistleblower Protection Act safeguards government\nemployees from management retaliation. The No Fear Act prohibits federal managers and supervisors from engaging in unlawful\ndiscrimination and retaliation. The Sarbanes-Oxley Act requires that an individual blow the whistle on an employee who they have\nevidence has violated the law. Securities whistle-blowers are provided expanded incentives and protection by the Dodd-Frank Wall Street\nReform and Consumer Protection Act. This legislation authorizes the Securities and Exchange Commission (SEC) to reward whistle-blowers\n(at companies that are required to report to the SEC) who provide information concerning violations of the federal securities laws. The\nFreedom of Information Act can be used by a whistle-blower to gather evidence that the public's right to know has been violated.\nManagers Role in Ethical Conduct\nManagers are responsible for upholding the ethical code and helping others to do so as well.\nLearning Objectives\nOutline the role managers must play in implementing internal ethical standards and aligning the organization with external standards\nKey Takeaways\nKey Points\nManagers hold positions of authority that make them accountable for the ethical conduct of those who report to them.\nManagers monitor the behavior of employees in accordance with the organization 's expectations of appropriate behavior, and they have\na duty to respond quickly and appropriately to minimize the impact of suspected ethical violations.\nManagers may be responsible for creating and/or implementing changes to the ethical codes or guidelines of an organization.\nManagers may also be subject to a particular code of professional ethics, depending on their position and training. Fiduciary duty is an\nexample that applies to some managerial roles.\nKey Terms\ncompliance: The department of a business that ensures all government regulations are met.\naccountability: The state of being responsible for something.\nfiduciary: One who holds a thing in trust for another; a trustee.\nManagers hold positions of authority that make them accountable for the ethical conduct of those who report to them. They fulfill this\nresponsibility by making sure employees are aware of the organization's ethical code and have the opportunity to ask questions to clarify\ntheir understanding. Managers also monitor the behavior of employees in accordance with the organization's expectations of appropriate\nbehavior. They have a duty to respond quickly and appropriately to minimize the impact of suspected ethical violations. Lastly, managers\nmake themselves available as a resource to counsel and assist employees who face ethical dilemmas or who suspect an ethical breach.\nOf course, managers are responsible for upholding ethical standards in their own actions and decisions. In addition to following the\norganization's ethical code, managers may be obligated to follow a separate professional code of ethics, depending on their role,\nresponsibilities, and training. Fiduciary duty is an example that applies to some managerial roles. A fiduciary must put the interests of\nthose to whom he is accountable ahead of any interests, and must not profit from his position as a fiduciary unless the principal consents.\nMany managers have responsibility for interacting with external stakeholders such as customers, suppliers, government officials, or\ncommunity representatives. In those encounters, managers may be called on to explain a decision or a planned action in terms of ethical\nconsiderations. The stakeholders will be interested to hear how the organization took ethics into account, and in those cases it is the\nmanager's duty to speak on the company's behalf.\nAdditionally, managers may be responsible for creating and/or implementing changes to an organization's ethical codes or guidelines.\nThese changes may be in response to an internal determination based on the experience of employees; for instance, additional\nclarification may be needed about what constitutes nepotism or unfair bias in hiring. Alternatively, new regulations, altered public\nperceptions and concerns, or other external factors may require the organization to make adjustments.\nThe manager's role in ethical conduct: The manager has an\nimportant role in maintaining ethical conduct in a firm, but a\nfirm's ethics cannot simply be based on a \"manager to the\nrescue\" approach.\nCodes of Conduct\nOrganizations adopt codes of conduct to guide employees' actions and decisions.\nLearning Objectives\nState the importance of utilizing a code of conduct to outline and maintain ethical business standards within an organization\nKey Takeaways\nKey Points\nEthical codes are adopted by organizations to assist members in understanding the difference between right and wrong and how to apply\nit to their decisions.\nA code of business ethics may set out general principles about an organization's beliefs on matters such as mission, quality, and the\nenvironment. It may delineate proper procedures to determine whether a violation of the code of ethics has occurred and, if so, what\nremedies should be imposed.\nA code of conduct for employees sets out the procedures that should be used in specific ethical situations. It also delineates the\nprocedures required to determine whether a violation of the code of conduct has occurred and, if so, what remedies should be imposed.\nA code of professional practice discusses common issues and difficult decisions that often arise in a profession, and provides a clear\naccount of what behavior is considered ethical, correct, or right in certain circumstances.\nKey Terms\ncode: Any system of principles, rules or regulations relating to one subject.\nconduct: The manner of guiding or carrying one's self; personal deportment; mode of action; behavior.\nAs part of comprehensive compliance and ethics programs, many companies formulate policies pertaining to the ethical conduct of\nemployees. These policies can be simple exhortations in broad, highly generalized language, or they can be more detailed directives\ncontaining specific behavioral requirements. Ethical codes are adopted by organizations to assist members in understanding the\ndifference between right and wrong and applying that understanding to their decisions and actions. They are generally meant to identify\nthe company's expectations of workers and to offer guidance on handling some of the more common ethical problems that might arise in\nthe course of doing business.\nThere are three types of ethical codes: codes of business ethics, codes of conduct for employees, and codes of professional practice.\nCode of Business Ethics\nA code of business ethics often focuses on social issues. It may set out general principles about an organization's beliefs on matters such\nas mission, quality, privacy, and the environment. It may delineate procedures that should be used to determine whether a violation of the\ncode of ethics has occurred and, if so, what remedies should be pursued. The effectiveness of such codes of ethics depends on the extent\nto which management supports and enforces them.\nCode of Conduct for Employees\nA code of conduct for employees sets out the procedures to be used in specific ethical situations, such as conflicts of interest or the\nacceptance of gifts. It may include specific lists of dos and don'ts, or it may provide questions to ask to help determine the proper course\nof action. Codes of conduct typically delineate the proper procedures for determining whether a violation has occurred and for reporting\nsuspected violations.\nCode of Practice\nA code of practice is adopted to regulate a particular profession. It may be styled as a code of professional responsibility that covers\ncommon scenarios and decisions and provides a guide to what behavior is considered ethical, correct, or right in certain circumstances.\nGuiding conduct: Public signage often contains messages guiding conduct.\nSimilarly, behavior in organizational settings may be guided by\norganizational codes of conduct.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}