{
    "text": "Search... Home Subjects\nBoundless Management\nIntroduction to Management\nCurrent Challenges in Management\nPESTEL: A Framework for Considering Challenges\nThe PESTEL framework highlights six critical factors for management to consider when approaching the general business environment.\nLearning Objectives\nAssess opportunities and threats within the context of external factors using the PESTEL framework\nKey Takeaways\nKey Points\nPolitics play a role in business, as there is a balance between free markets and systems of control.\nEconomic factors are metrics which measure and assess the health of a given economic region or environment.\nSocial factors, or demographic factors, assess the mentality of the individuals/consumers within a given market.\nRecognizing the potential technologies available to optimize internal efficiency, or to avoid letting a product or service become\ntechnologically obsolete, is a large challenge for management.\nConsumers and governments both penalize companies who have a large adverse affect on the environment (or reward those who have a\npositive impact ).\nUnderstanding the varying laws and regulations in a given region of operation is critical to avoiding unnecessary legal costs.\nKey Terms\nanti-trust: A set of laws that ensures no company dominates an industry (i.e. creates a monopoly).\nmacro environment: As pertaining to the macro-environment, these factors are indicative of the entire business environment as a whole.\ngross domestic product: A fiscal measure of an entire region's economic production over a specific time frame.\nOrganizations are faced with a variety of external factors that provide potential opportunities and threats for short-term and long-term\nsuccess in any given environment. Encompassing a macro-environmental perspective, these factors can be effectively summarized with\nthe acronym PESTEL.\nPESTEL Analysis Diagram: This chart illustrates the\nPESTEL factors an organization faces.\nPESTEL stands for the political, economic, social, technological, environmental, and legal influences a businesses encounters as it pursues\nits objectives. Analyzing the entirety of the macro-environment is an extensive and complex task, but understanding the framework of\nbasic influences allows for an organized and strategic approach to isolating each opportunity or threat. It is common to conduct a PESTEL\nassessment before any serious decisions are made or any large projects undertaken. Understanding each of these influencing factors is\nthe first step to addressing them properly.\nPolitical\nPolitics play a role in business, as there is a balance between free markets and systems of control. Political factors affecting business\nspecifically revolve around taxes, import and export tariffs, environmental and labor laws, potential subsidies, and the stability of a given\noperational region. As global economics now supersede domestic economics for many businesses, companies must consider a number of\nopportunities and threats when expanding into new regions or identifying optimal areas for production, sales, or corporate headquarters.\nEconomic\nEconomic factors are metrics that measure and assess the health of a given economic microcosm within the entire global economy. These\nfactors incorporate exchange rates, gross domestic product (GDP), consumer purchasing indices, interest rates, inflation, and a number of\nother indicators of economic health or direction. These indicators are critical to management, as they can reveal a good time to borrow,\nas well as whether an economy will be friendly to an industry where businesses fluctuate substantially with GDP or spending power, etc.\nSocial\nSocial factors could loosely be defined as a demographic analysis, where specific groups display preferences or tendencies that can be\nleveraged or that can threaten a given incumbent. For example, in the United States, consumers are becoming more health-conscious.\nThis trend affords the food industry opportunities to create products that meet this social desire; as a result, candy manufacturers may\nwant want to consider diversification. The social movement of living \"green\" is another example of this kind of macro-environmental\nopportunity or potential threat.\nTechnological\nTechnology plays a larger and larger role each year in business and will continue to do so as research and development drive new\ninnovations. Recognizing the potential technologies available to optimize internal efficiency is a powerful asset in management.\nTechnology also presents a number of threats, as CD-player manufacturers and Blockbuster Video can attest. These companies were hurt\nby \"disruptive innovations\" such as the MP3 player and Netflix. Keeping pace with technology and adapting accordingly are important\nstrategies to sidestep threats and embrace opportunities.\nEnvironmental\nThe impact of business upon the environment is a growing concern, and companies must consider both the social and political segments\nof PESTEL in conjunction with environmental factors. Consumers and governments both penalize companies that adversely affect the\nenvironment. Governments levy enormous fines upon companies that pollute beyond given specifications, and consumers are more than\nwilling to switch brands if they perceive that a business is ignoring its environmental responsibilities. The environment can also be a\nsource of benefit to a company, such as running water for a hydro-power plant.\nLegal\nThe last factor in PESTEL concerns legal elements, which can also be tied to the political framework. Legal issues such as affirmative action,\npatent infringements (a recent example being Apple vs. Samsung), antitrust laws (see Microsoft), health regulations, and safety\nregulations can all significantly affect a company that does not act responsibly. Understanding this legal landscape is important for\nbusinesses that want to avoid legal pitfalls and remain within the confines of established regulations.\nThe Challenge of Globalization\nGlobalization is the international integration of intercultural ideas, perspectives, products/services, culture, and technology.\nLearning Objectives\nAssess the evolution of globalization in the business world and the challenges this has created\nKey Takeaways\nKey Points\nGlobalization is an influential modern topic that highlights the growing interdependence between different countries worldwide,\nnecessitating managers to appropriately incorporate this trend within their strategies.\nThe speed of modern globalization is often attributed to technological developments in communication and transportation, tasking\nmanagers with appropriately leveraging these technologies internally.\nMultinational companies cumulatively employ nearly half of the world's population, creating a need for managers with a strong\ninternational awareness.\nManagers must understand that some processes can be performed universally and internationally, while others must be done in a\nlocalized fashion to adhere to each specific region's tastes and customs.\nCritics of globalization cite the way in which it motivates an international culture over established domestic ones, as well as the negative\nenvironmental effects that result from business expansion.\nBeing mindful of the potential opportunities in a global economy, along with knowledge of how to localize and sidestep the negatives in\nan international marketplace, can capture large value for effective managers.\nKey Terms\nLocalizing: The act of altering a product or service to better acclimate to a local environment.\nIntercultural: Representative of many different cultures simultaneously.\nMultinational Enterprises: Businesses that operate in more than one country.\nGlobalization is a hot topic in the business world today, garnering enormous attention as imports and exports continue to rise with\ncompanies expanding across the global marketplace. Understanding the basic overview of the global economy underlines highly relevant\nmanagerial and business level applications that provide useful insights to modern-day managers.\nIn general terms, globalization is the international integration of intercultural ideas, perspectives, products/services, culture, and\ntechnology. This has resulted in large scale interdependence between countries, as specialization (arguably the root cause of\nglobalization) allows for specific regions to leverage their natural resources and abilities to efficiently produce specific products/services\nwith which to trade for another country's specialization. This allows for a higher standard of living across the globe through higher\nefficiency, lower costs, better quality, and a more innovative and dynamic workforce.\nGrowth of Globalization\nThe ease of modern globalization is often attributed to rapid technological developments in transportation and communication. These\nform the central system of international exchange, allowing businesses to create meaningful relationships worldwide with minimal time\ninvestment and costs. Management is tasked with ensuring these resources are available to employees and properly leveraged to\noptimize the geographic reach of a business's operations. This has led to the existence of many multinational enterprises (MNEs), who\nargue that survival in the newly globalized economy requires sourcing of raw materials, services, production, and labor.\nFrom a managerial perspective, the global workplace implies an enormous amount of diversity management. Estimates of the world labor\npool in 2005 noted that multinational companies employed a stunning 3 billion workers cumulatively, which is nearly half of the entire\nworld population. As a manager, this means developing a globally aware perspective that lends itself well to the specific geographic\nneeds, values, and customs in which the business operates. Developing this global skill set is a powerful managerial skill.\nChallenges of Globalization\nManagers should also be aware of the best way to approach global demographics from a business to consumer perspective, taking an\ninternational product or service and localizing it successfully. This is a significant challenge, necessitating consideration for different tastes\nand branding strategies during the implementation process. This chart illustrates the process of moving from an international product to\na localized product step by step, making note of the element of production that can be universally applied compared to those that need a\nlocalized touch.\nGlobalization Process: This chart illustrates\nthe complementary localizing and\ninternationalizing responsibilities of a\nglobalizing organization. The organization\nmust place an international focus on product\ndesign, development, and QA to ensure its\nbroad relevance while also localizing\nmarketing to tailor its appeal to individual\nmarkets.\nManagers must also be particularly aware of the current criticisms of a highly global society, particularly as it pertains to ethical and\nenvironmental considerations. A global economy is, in many ways, enforcing a global culture. This global culture is often criticized for\ntaking the place of previously established domestic cultures (and motivating consumerism).\nAs a result, managers should carefully consider how to best localize products to retain cultural identity in the regions they operate.\nEnvironmental concerns are of large importance as well, as the constant energy utilization required for this interchange pollutes the\nenvironment and uses high quantities of valuable energy-creating resources. Minimizing the damage done to the environment, and\noffsetting it as best as possible through philanthropic giving, is not only a wise marketing move but also a critical ethical consideration.\nConclusion\nCombining these points, the globalized society presents enormous opportunity for businesses. Intercultural marketplaces allow for\ndiffering demographics, larger market potential, a more diverse customer base (and therefore more diverse product offering) and a highly\nvaluable human resource potential. On the other end of the bargain, managers are tasked with localizing products and services effectively\nin a way that minimizes the adverse cultural and environmental effects caused by this rapid global expansion to maintain an ethical\noperation.\nThe Challenge of Ethics and Governance\nEthics is at the core of corporate governance, and management must reflect accountability for their actions on a global community scale.\nLearning Objectives\nExplain the role of management in setting strategic governance policies that conform to ethical and legal standards\nKey Takeaways\nKey Points\nBusiness itself cannot be ethical: only the managers and corporate strategists can implement ethics within the framework of the business\nstrategy.\nCorporate ethics and shareholder desires for profitability are not always aligned, and it is the responsibility of executive management to\nensure ethics supersede profitability.\nIn its simplest form, corporate ethics is a legal matter. Abiding by laws protecting workers' rights and appropriate compensation is a top\npriority for management.\nCorporate governance and ethics become more difficult with the indirect implications of particular practices, making it important to\nassess the way in which certain operations may adversely affect the community at large.\nManagers are the primary decision makers, and therefore must hold themselves accountable for the way in which a business operates and\naffects stakeholders, shareholders, employees, and the community at large.\nKey Terms\nprofitability: The capacity to generate capital.\naccountability: Individuals' responsibility for their own work and acceptance of the repercussions of their actions.\nAccountability\nFirst and foremost in corporate governance is the strict adherence to business ethics on a professional level. The figure highlights the\nprimary responsibilities of corporate managers; the upper left corner—accountability—is of particular significance. Understanding the\nrules and regulations in place, along with societal and personal expectations of ethical actions, is an absolutely critical and fundamental\nconcern for all managers. The complexities and responsibilities of running a business and managing employees is the first priority for\nmanagers, as it holds the highest repercussions, both personal and fiscal, for all parties involved.\nEconomist Milton Friedman makes an insightful observation when he states \"...the only entities who can have responsibilities are\nindividuals...A business cannot have responsibilities.\" Though this sounds like common sense, it is a fact often overlooked that the only\nparties capable of acting ethically are those in charge. Furthermore, ethics often contrasts with the basic premise of capitalism and the\ndemands of shareholders: profitability. Therefore, the most difficult decisions in corporate governance—those at the ethical level—must\nbe made through the more complex assessment of societal, corporate, and personal values.\nLegal Foundations\nAt its most basic, ethical behavior can first be derived via the laws, rules, and regulations of the country in which a business operates. In\nthe United States, workers are imbued with very specific rights regarding the risks they take, the hours they work, the breaks they deserve,\nand the benefits they are provided. Managers are the responsible parties in ensuring these are delivered to the employees in an equitable\nand legal way. When working over 40 hours a week, hourly employees are entitled to overtime pay. When working long shifts, employees\nare entitled to breaks. When working in dangerous conditions, employees are entitled to protective gear and training.\nAt their core, these regulations approach the fundamental dissonance alluded to above: profit-maximizing behavior as it contrasts with\nnon-economic concerns. This dissonance is exacerbated by the global economy, which sees businesses operating within communities\ntowards which they have no dependence or direct sensitivity. As a result, to ask the question, \"What does this practice mean for the\npeople in the area in which we operate?\" is crucial in ensuring adherence to a community-first action plan.\nThe 2008 Financial Collapse\nComplexities begin to arise as the the ethical implications within an economic system become more subtle. The 2008 financial collapse is\na wonderful yet terrifying example of exactly what can go wrong and why corporate governance and ethics is of such importance to both\na business and the society in which it operates. Leading up to the mortgage-backed security fallout of 2008, banks and investors began to\nprioritize profitability over ethics. Banks eliminated certain rules and regulations (though the government did as well), allowing employees\nto sell mortgages that were unlikely to be repaid. Following this, upper management deemed it fit to package these risky securities into\nbundles and sell them as safe investments (though they were in fact risky derivatives), in order to capture yet more value. Though this is\nonly a simplified and small analysis of a complicated issue, it succinctly describes how corporate management saw each echelon of\nleadership ignore the core responsibility of ensuring ethical standards in lieu of capital gains. Management is at fault for this oversight; it\nwas a failure in corporate governance.\nThe 2008 collapse is a powerful reminder that managers must keep in mind that their primary goal for shareholders is to maximize profits,\nwhile their primary goal to the community at large is to provide products without adverse effects on that community. Managing\nemployees responsibly and putting their well-being first is an important step in this process, as is considering the wider implications of\nopening a new factory that pollutes or selling a highly unhealthy food product. Managers must be responsible because businesses as a\nwhole cannot, and this responsibility towards integrity lies at the heart of management.\nThe Challenge of Diversity\nGlobalization demands a diverse workforce, and assimilating varying cultures, genders, ages, and dispositions is of high value.\nLearning Objectives\nExplain the inherent value diversity generates in the competitive landscape and the challenges globalization presents\nKey Takeaways\nKey Points\nIn the 1960s, the U.S. begin identifying trends in workplace diversity and addressed them with legislation. This evolved into a societal\nchange that embraces diversity as both valuable and ethical.\nDiversity poses various challenges in communication, from differences in language to differences in culture. Understanding these cultural\ndifferences and what they may accidentally communicate is critical to effective communication.\nMajority cultures have a tendency to create a homogeneous environment, possibly limiting the potential diverse opinions can provide.\nGroupthink is a threat of which managers must be aware, particularly in meetings where dominant opinions steal most of the spotlight.\nDifferent perspectives are where the highest value can be captured in diverse environments.\nThe ability to manage diversity, as well as refine actions to communicate accurately and intentionally, are valuable and necessary aspects\nof effective management.\nKey Terms\nHegemony: The dominance of one social group over another.\ngroupthink: Decision making that is often characterized by a high degree of conformity.\nThe Value of Diversity\nGlobalization has resulted in enormous cross-cultural relationships, along with high percentages of domestic diversity. As globalization\ncreates higher potential value in approaching diverse markets and demographics, understanding how to manage a diverse community\ninternally is a priority for management.\nThrough creating a more international community and increasing variety among workforces, companies stand to benefit enormously from\nmeaningful diversity in opinions and perspectives. This opportunity, if not properly utilized, becomes a threat as the competition grows\nmore effective at leveraging diversity to create synergy. Therefore, staying competitive requires the creation of an effectively diverse\nworkplace.\nEthnic diversity map: This map illustrates the level of diversity\nworldwide. Areas like sub-Saharan Africa tend to be more\nheterogenous than, for instance, states in Europe.\nStemming from various legislative initiatives in the 1960s, the concept of equality and a fair distribution of opportunity became a\ndomestic focus in the United States. As the decades passed, this focus shifted from a legal requirement to a social expectation. Finally the\nidea of equality became a societal norm that recognizes both the importance and the value of diversity. This evolving outlook on a diverse\nworkplace has ultimately resulted in the recognition and implementation of diversity management and intercultural understandings\nwithin organizations, creating stronger and more ethical business practices.\nChallenges of Diversity\nDespite this successful trajectory, challenges to diversity naturally occur as a result of communication (languages and values), majority\nhegemony, and groupthink.\nCommunication\nCommunication is at the heart of diversity management, but not necessarily for obvious reasons. Linguistic differences, while certainly a\nchallenge, are tangible and straightforward. Learning new languages or translating materials is a reasonably effective approach to\naddressing these difficulties.\nThe more difficult challenge is the intangibles in communication that arise not from literal words but from cultural expectations. Different\ncultures not only speak different languages but adhere to different values, draw different assumptions, and define different actions as\nappropriate or inappropriate. Overlooking these cultural differences can result in miscommunication that may go unrecognized. For\nexample, in China it is quite important to understand the concept of guanxi (face), particularly as it pertains to paying respect to guests or\nsuperiors. Overlooking these customs sends unintentional messages that can do irreversible damage.\nMajority Hegemony\nMajorities in businesses creating a homogeneous culture is also a substantial threat, as company culture is a direct product of the\nparticipants (employees). This can result in a business that creates and promotes a particular culture over other minority cultures, usually\nunintentionally as a result of numbers. This hegemony can create tension between different groups, ultimately resulting in the smaller\ngroups moving towards the culture of the larger ones to close the dissonance, a practice called assimilation. Assimilation should be a\nshared responsibility, not simply assumed by those in the minority group.\nGroupthink\nThe most substantial threat these communicative barriers and homogeneous tendencies create could loosely be defined as groupthink.\nGroupthink is when many people within the same organization begin to adopt similar perspectives, usually to simplify meetings and\nminimize discord. On the surface, this consensus sounds like a good thing. However, as the global economy requires businesses to\nunderstand varying perspectives, it also necessitates the cultivation of these diverse perspectives internally. Groupthink will often result in\nthe assimilation of dissenting perspectives. The opportunity cost is precisely these different viewpoints. Without differences in perspective,\ncompanies have little room to expand into new demographics or innovate new solutions.\nThe Role of Management\nDifferent cultural norms offer an interesting study in diversity management. Etiquette for receiving a business card in China requires\naccepting it with both hands and taking a full moment to read it. Following this, recipients place the card face up on the table in front of\nthem during the meeting, referring to it when necessary. In the U.S., a strong handshake and self-introduction is a polite start to a\nmeeting. Conversely, in Japan, it is appropriate to wait to be introduced and then bow following the greeting.\nManagers must be not only aware of diversity in the workplace but also open-minded and empathetic to perspectives other than their\nown. Effective managers in diverse situations have a highly developed degree of cultural competence that empowers them to use careful\nobservation skills to determine what gestures, phrases, customs and values would be most appropriate in a given circumstance. Adroit\nmanagement must also work actively against groupthink, empowering everyone not only to speak but to be brave enough to go against\nthe majority opinion. The goal for management is to ensure everyone is working to assimilate to everyone else in a balanced and effective\nmanner that harvests differences rather than smoothing them over.\nExample\nDifferent cultural norms offer an interesting study in diversity management. Etiquette for receiving a business card in China requires\naccepting it with both hands and taking a full moment to read it. Following this, recipients place the card face up on the table in front of\nthem during the meeting, referring to it when necessary. In the U.S., a strong handshake and self-introduction is a polite start to a\nmeeting. Conversely, in Japan, it is appropriate to wait to be introduced and then bow following the greeting.\nThe Challenge of Technology\nTechnology management is crucial in offsetting the risks of new technology while acquiring the operational benefits it provides.\nLearning Objectives\nRecognize the opportunities and threats inherent in the technological landscape from a business perspective, and how to manage these\nKey Takeaways\nKey Points\nManaging new technology requires a thorough understanding of business technology management, which consists of four general parts.\nManagers must understand how to achieve internal efficiency by applying new technology to operational processes.\nBusinesses should create strategic business units focused solely upon managing a company's technological strategy.\nKeeping pace technologically requires extensive research and strategic analysis of the potential value of acquiring innovations.\nImplementing new technology requires retraining staff and eliminating the natural friction that results from making operational changes.\nManagers should be aware of the value in research, development, and forecasting future technological innovations to keep ahead of the\ncompetition.\nKey Terms\nevolves: Constantly changes and develops.\nSynergy: The concept that a whole can derive more value than the combination of the individual parts.\ncompetitive advantage: Something that places a company or a person ahead of a competing business.\nTechnology and Management\nManaging technology is an intrinsic part of managing a business, and effectively balancing resources to optimize efficiency is an\nimportant operational objective for all managers. Varying perspectives and strategies in technology management abound, all revolving\naround a few simple needs being filled to move the business towards a competitive advantage. The reason behind the prioritization of\ntechnology management is that new, disruptive technology constantly threatens to result in higher efficiency of competitors. On the other\nhand, effectively managed technology affords businesses the opportunity to outpace the competition (see figure below).\nDisruptive technology: This graph underscores the\nconcept that technology advancement is both a constant\nopportunity and a constant threat.\nBusiness Technology Management (BTM)\nFrom a general standpoint, business technology management focuses on understanding how technology fits into an organization 's\nprocesses and structure. It provides the opportunity to streamline operations and produce higher quantities of quality information. BTM\ncan therefore be divided into four elements:\nProcess: Businesses, whether they provide products or services, always have a set of processes that define how deliverables are generated.\nThese processes need to be assessed for efficiency and effectiveness, particularly as they allow for optimal potential modern technology.\nOrganization: Businesses are constructed under the assumption of synergy. Each of the strategic business units (SBUs), or facets of the\norganization, complements one another to create an ability greater than the sum of its parts. Establishing an information technology (IT)\ndepartment within a business that will function with upper management and throughout the ranks allows for proper implementation of\nBTM.\nInformation:Technology evolves exponentially, often changing faster than businesses can easily monitor. Performing appropriate research\nand analysis of the current technological environment generates the highest return on the (often expensive) investments demanded by\nkeeping pace technologically.\nImplementation: After a business organization has a mature IT department that understands the company processes, the department can\nwork with an understanding of the available technologies to upgrade and implement these innovations. Implementation includes training\nemployees, monitoring the return on investment, maintaining new technology, and eliminating friction from the necessary operational\nchanges. Change is always complicated, and businesses benefit greatly by adopting change-management techniques when integrating\nnew technology.\nKeeping up with Technological Progress\nWhile managers are focused upon these four aspects of BTM, they must also keep future growth and technology scaling in mind. As\ninnovation continues to demand a central role in businesses, research and development will continue to be critical to a healthy\norganization. Appropriately funding research initiatives that not only keep track of new innovation but actively seek out strategic solutions\ncreatively offers companies the best chance of survival in the global marketplace.\nManagers must also realize the importance of acquiring technology talent that can keep pace with the environment. This is important for\ntwo reasons:\nThe potential to uncover new competitive advantages through internal development\nThe capacity to forecast up-and-coming technologies to construct an investment road map that always keeps the competition a\ntechnological step behind\nDeveloping new technologies in-house is particularly relevant to industries on the cutting edge (e.g., semiconductors, green energy\ninitiatives, TVs, etc.), while forecasting is more critical for the users/consumers of these industries on the business level.\nCombining BTM with research and development will ensure managers are properly equipped to tackle the challenges of modern-day\ninnovations, leveraging these capabilities to differentiate from the competition and derive stronger margins. Managers across the board\nmust be aware of the importance of these technological developments, as well as the operational challenges in researching and\nimplementing them.\nThe Challenge of Competition\nManagers must understand a company's competitive advantage and build a strategy that takes into account the competitive landscape.\nLearning Objectives\nDescribe competitive strategies such as low cost, differentiation, and internal competition and the role of the external competitive\nlandscape in developing them\nKey Takeaways\nKey Points\nManagers must know their business's strengths and integrate them into the appropriate strategy to remain competitive.\nLow-cost strategies are when companies sell a product or service at the lowest possible price point to stay competitive.\nDifferentiation is an alternative strategy to low cost in which companies fill a specific need that is not being filled or generate a brand\nimage that increases their value-added proposition.\nHigh quality is the antithesis of low cost; instead of efficiency, the strategy focuses on effectiveness, creating the best possible product to\ncapture market share.\nCompanies also compete internally, either developing naturally competitive products or battling for funding based upon unit success.\nManagers must understand all of these competitive strategies and align them with their perceived strategic advantage to stay\ncompetitive.\nKey Terms\ncompetitive advantage: Something that places a company or a person ahead of competing businesses.\ndifferentiation: A strategy focused on creating a distinct product for a specific population.\nBranding: A business's ability to communicate a specific image, generally one that will entice consumers or add value.\nCompetitive Strategies\nFrom a managerial perspective, competition generally falls into the external environment, though it can also take shape in the internal\nenvironment through rivalry between strategic business units (SBUs). For managers, understanding the external competitive landscape is a\ncritical factor in assessing company strategies and benchmarking appropriately to ensure the competitiveness of the firm. Businesses that\nfail to keep pace with their rivals will eventually be overpowered and often forced to develop an exit strategy.\nAvoiding the risks of competitive factors demands a strong understanding of operational efficiency (low cost), quality production,\ndifferentiation, and competitive advantage —or who you target and whether or not you have a cost or quality advantage (see figure\nbelow).\nCost vs. quality: Companies generally achieve either a cost or a quality\nadvantage (very rarely, both). In panel A, both companies' products have\nthe same cost, but Company I's product has higher value. In panel B,\nboth companies' products have the same value, but Company I's\nproduct has lower cost. In panel C, Company I's product has both higher\nvalue and lower cost (this is the rarest situation).\nLow-Cost and Branding\nThe simplest perspective on competition is in industries where products are homogeneous (or very alike). In such a situation, companies\ncompete directly. For example, bottled-water producers are directly involved in such a framework and thus adopt two basic competitive\nstrategies: low-cost and branding.\nLow-cost suppliers find ways to optimize their production and distribution to offer consumers the lowest possible price on one bottle of\nwater. Low-cost suppliers often benefit largely from economies of scale. Branding, on the other hand, aims to convince the consumer that\na higher price point is worth paying based upon the company's name, reputation, or other distinguishing characteristic. For example,\nDasani brand water costs more than generic store brand water, despite being essentially the same product. Commercials, aesthetic\npresentation, goodwill, and factors other than price may then influence a consumer's purchasing decision.\nDifferentiation\nMost products and services are not homogeneous, however, allowing incumbents in an industry to compete with one another by means\nof various competitive strategies. Differentiation is a competitive tactic wherein companies approach certain niche needs within an\nindustry to capture a segment of the market share.\nAn example of differentiation might be cereal. There are hundreds of different kinds of cereals. The need being filled is sustenance: people\nneed to eat. The producers of these cereals use differentiation to capture a share of the cereal market: some brands focus on their organic\nnature, others their sugary appeal, and still others on being \"cool.\" Branding plays an important role here as well, though assessing niche\nconsumer needs and filling them is the principal focus.\nQuality\nFinally, there is the potential to compete externally based upon quality. Toyota makes both the Corolla and the Lexus, thereby targeting\nboth ordinary automobile drivers and those in the luxury-car consumer bracket. Quality competitive strategies, while related to branding,\nprovide a particular level of quality to capture a specific income or interest demographic. The opportunity cost of efficiency is associated\nwith quality, which generally sees higher price points. Quality is therefore a strong antithesis to the low-cost strategy.\nInternal Competition\nBusinesses also compete internally, an intrinsically complex issue. On the surface, internal competition involves either direct product\nsubstitutes or funding competition (among different business units). An example of internal competition is PepsiCo. Pepsi makes both\ncolas and sports drinks, all of which sit on the shelf next to one another. When a customer sees the sports drink and chooses it over the\ncola, the cola has lost a sale to an internal competitor. Pepsi, however, did not lose a sale; it merely lost one segment of the business while\ngaining another.\nWith these points in mind, managers must thoroughly understand the products they are pitching and which strategy will help them avoid\ngoing toe-to-toe with other businesses with whom they cannot compete. Starting up a car manufacturing business to compete with\nHyundai in the low-cost market is extremely difficult, as Hyundai has economies of scale in place that will almost always beat smaller\ncompetition on a low-cost strategy. This example illustrates an extremely important point in business: rely on strengths. Managers must\nunderstand their own competitive advantage (what they do better than the competition) to adopt the appropriate competitive strategy to\ngain market share and remain profitable.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}