{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nBarriers to Decision Making\nCognitive Biases as a Barrier to Decision Making\nIndividual cognitive biases will influence decision making.\nLearning Objectives\nExamine the complex individual influences central to the way in which decision making is pursued, most notably the cognitive, normative,\nand psychological perspectives\nKey Takeaways\nKey Points\nDecision making is shaped by individual personality and behavioral characteristics.\nSubjective biases can influence decisions by disrupting objective judgments.\nCommon cognitive biases include confirmation, anchoring, halo effect, and overconfidence.\nKey Terms\ndichotomies: Two elements, often mutually exclusive, that stand in juxtaposition to one another.\nDecision making is inherently a cognitive activity, the result of thinking that may be either rational or irrational (i.e., based on assumptions\nnot supported by evidence). Individual characteristics including personality and experience influence how people make decisions. As such,\nan individual's predispositions can either be an obstacle or an enabler to the decision-making process.\nFrom the psychological perspective, decisions are often weighed against a set of needs and augmented by individual preferences.\nAbraham Maslow's work on the needs-based hierarchy is one of the best known and most influential theories on the topic of motivation\n—according to his theory, an individual's most basic needs (e.g., physiological needs such as food and water; a sense of safety) must be\nmet before an individual will strongly desire or be motivated by higher-level needs (e.g., love; self-actualization.\nThe Myers-Briggs Type Indicator (MBTI) is a widely used diagnostic for identifying personality characteristics. By categorizing individuals in\nterms of four dichotomies—thinking and feeling, extroversion and introversion, judging and perception, and sensing and intuition—the\nMBTI provides a map of the individual's orientation toward decision making.\nTypes of Cognitive Bias\nBiases in how we think can be major obstacles in any decision-making process. Biases distort and disrupt objective contemplation of an\nissue by introducing influences into the decision-making process that are separate from the decision itself. We are usually unaware of the\nbiases that can affect our judgment. The most common cognitive biases are confirmation, anchoring, halo effect, and overconfidence.\n1. Confirmation bias: This bias occurs when decision makers seek out evidence that confirms their previously held beliefs, while\ndiscounting or diminishing the impact of evidence in support of differing conclusions.\n2. Anchoring: This is the overreliance on an initial single piece of information or experience to make subsequent judgments. Once an\nanchor is set, other judgments are made by adjusting away from that anchor, which can limit one's ability to accurately interpret new,\npotentially relevant information.\n3. Halo effect: This is an observer's overall impression of a person, company, brand, or product, and it influences the observer's feelings\nand thoughts about that entity's overall character or properties. It is the perception, for example, that if someone does well in a certain\narea, then they will automatically perform well at something else regardless of whether those tasks are related.\n4. Overconfidence bias: This bias occurs when a person overestimates the reliability of their judgments. This can include the certainty one\n[2]\nfeels in her own ability, performance, level of control, or chance of success.\nTime Pressure as a Barrier to Decision Making\nTime pressure forces decision makers to shift from logical processes (ideal) to intuitive processes (sub-ideal).\nLearning Objectives\nExplain the way in which time pressure can influence decision making\nKey Takeaways\nKey Points\nTime pressure can distort decision -making processes and individual judgment and make them less objective and more influenced by\nintuition.\nHeuristics, or mental shortcuts, can deliver workable decisions under time pressure and in the absence of logical decision-making\nprocesses.\nDecision makers who feel as though they have ample time tend to arrive at more logically crafted, higher quality decisions than those\nwho felt as though they had insufficient amounts of time, even if confronted by similar time pressure in real terms.\nWhile generally considered a barrier to decision making, time pressures may also have the opposite effect in terms of creating\norganizational motivation to render decisions and move on. In this way time pressure, real or perceived, may act as a deadline and\nencourage organizational dexterity.\nKey Terms\nheuristic: A \"shortcut\" method of problem solving that makes assumptions based on past experiences. Examples include going by \"rule of\nthumb,\" when you apply your experience of something having happened a certain way enough times that it's likely to continue\nhappening that way. It is not guaranteed to be accurate every single time, but it cuts out processing time by avoiding detailed analysis of\nevery particular situation.\nJust as individual characteristics and cognitive biases can shape decision making, time pressure can also distort how we consider and\nchoose between alternatives. Severe time constraints can make decision processes and individual judgment less objective and more\ninfluenced by intuition as more formal and rigorous approaches are ignored. All decisions are time-bound in the sense that we do not\nhave an infinite amount of time to make a selection. Still, firm and proximate deadlines and limited resources are common causes of time\npressure. Information overload is another. While considering all relevant factors is important to build support for the decision, data\ncollection can eat up time better spent analyzing alternatives and making the decision itself.\nTime pressure: Time\npressure often forces\ndecision makers to look for\nintuitive shortcuts rather\nthan logically processing\nall of the required data.\nThere are some effective approaches to dealing with time pressure. Clearly defining the decision and its parameters early on can reduce\nambiguity and make it easier to hone in on relevant data. Setting clear boundaries on matters such as who will participate and how long\ndiscussions will continue can similarly manage the amount of time given to a decision. In many instances, the use of heuristics can be\napplied to complex decisions to serve as shortcuts in conducting analysis and weighing alternatives.\nThere is evidence that suggests the perception of time pressure may impact decision quality. Decision makers who believe they have\nample time to make a decision tend to arrive at more logically crafted decisions than those who feel as though they have an insufficient\namount of time. While time pressure is generally perceived as being a barrier to effective decision making, it may also have the exact\nopposite effect. A limited time frame can focus mental energy and effort to bring the appropriate resources to bear on a decision more\nquickly and efficiently than otherwise might have been the case.\nGroup Conflict as a Barrier to Decision Making\nGroup dynamics, which involves the influence of social behavior, is the primary determining factor in the success of group outcomes.\nLearning Objectives\nRecognize the value and potential drawbacks of group dynamics in making decisions\nKey Takeaways\nKey Points\nInterpersonal and group dynamics can make it difficult for groups to make decisions effectively.\nThe presence of well-developed group cohesiveness, often achieved through healthy levels of dissent, typically results in preferable\noutcomes, while groupthink can lead to avoiding dissent and thus to premature consensus.\nThe leader 's behavior, group norms, and how the decision-making process is structured can help prevent groupthink.\nKey Terms\nSynergy: Benefits resulting from combining two different groups, people, objects, or processes.\ngroup: A number of things or persons in some relation to one another.\ngroupthink: The psychological phenomenon wherein a desire for conformity within a group results in them making an irrational decision;\nby actively suppressing dissenting viewpoints in the interest of minimizing conflict, group members reach a consensus without critically\nevaluating alternative viewpoints.\nDelegating key decision making to groups, teams, or committees occurs often within organizations. Decisions made by groups can be\nbetter informed by broader perspectives and different sources of information and expertise than those made by an individual decision\nmaker. Along with these advantages, however, interpersonal and group dynamics presents dilemmas that can make it more difficult for\ngroups to make effective choices.\nGroup cohesion, or positive feelings between individuals and productive working relationships, contributes to effective group decision\nmaking. In cohesive groups information is more easily shared, norms of trust mean it is easier to challenge ideas, and common values\nhelp focus decisions around shared goals. Encouraging constructive disagreements and even conflict can result in more-creative ideas or\nmore solutions that are easier to implement.\nGroup dynamics: the New Zealand All Blacks:\nRugby, a game with fifteen players per team, is the\nultimate team game. Group dynamics require all\nfifteen players to work together, often demanding\ntremendous synergy to outlast an opponent. The\nhistoric success of New Zealand's All Blacks has been\nattributed not only to skill, but also to how the team\nachieves ideal group dynamics.\nGroupthink\nOne of the greatest inhibitors of effective group decision making is groupthink. Groupthink is a psychological phenomenon that occurs\nwithin a group of people in which the desire for harmony or conformity results in an irrational or dysfunctional decision-making outcome.\nBy isolating themselves from outside influences and actively suppressing dissenting viewpoints in the interest of minimizing conflict,\ngroup members reach a consensus decision without critical evaluation of alternative viewpoints.\nLoyalty to the group requires individuals to avoid raising controversial issues or alternative solutions, and there is a loss of individual\ncreativity, uniqueness, and independent thinking. The dysfunctional group dynamics of the in-group produces an illusion of invulnerability\n(an inflated certainty that the right decision has been made). Thus the in-group significantly overrates its own decision-making abilities\nand significantly underrates the abilities of its opponents (the out-group). Furthermore, groupthink can produce dehumanizing actions\nagainst the out-group.\nPsychologist Irving Janus, the leading theorist of groupthink, identified ways of preventing it:\nLeaders should assign each member the role of \"critical evaluator.\" This allows each member to freely air objections and doubts.\nLeaders should not express an opinion when assigning a task to a group.\nLeaders should absent themselves from many of the group meetings to avoid excessively influencing the outcome.\nThe organization should set up several independent groups working on the same problem.\nAll effective alternatives should be examined.\nEach member should discuss the group's ideas with trusted people outside of the group.\nThe group should invite outside experts into meetings. Group members should be allowed to discuss with and question the outside\nexperts.\nAt least one group member should be assigned the role of devil's advocate. This should be a different person for each meeting.\n.\nSome \"content adapted from \\\"Decision making,\\\" WikiJob, https://www.wikijob.co.uk/content/interview-advice/competencies/decision-\n↵\nmaking, (May 21, 2018)\"\nSome \"content adapted from \\\"Decision making,\\\" WikiJob, https://www.wikijob.co.uk/content/interview-advice/competencies/decision-\n↵\nmaking, (May 21, 2018)\"\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}