{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Structure\nTrends in Organization\nFlattening Hierarchies\nFlattening hierarchies can benefit smaller organizations by increasing employee empowerment, participation, and efficiency.\nLearning Objectives\nDefine a flattened hierarchy, specifically in which situations where the utilization of this model is appropriate and beneficial for an\norganization\nKey Takeaways\nKey Points\nA hierarchy can link entities either directly or indirectly; it can also link entities either vertically or horizontally. The only direct links in a\nhierarchy are to a person's immediate superior or subordinates.\nThe flat organization model essentially \"flattens\" the hierarchy and promotes employee involvement through a decentralized decision -\nmaking process.\nAccording to the logic behind this model, well-trained workers will be more productive when they are directly involved in the decision-\nmaking process rather than closely supervised by many layers of management.\nFlat organizations are most relevant in specific scenarios—most notably small organizations that are dependent upon creativity, freedom\nof action, and high-powered employees.\nKey Terms\nhierarchy: An arrangement of items in which each item is represented as being above, below, or at the same level as other items.\nLinks within Hierarchies\nHierarchies can be linked in several different ways. A hierarchy can link entities either directly or indirectly; it can also link entities either\nvertically or horizontally. The only direct links in a hierarchy are to a person's immediate superior or subordinates. Parts of the hierarchy\nthat are not linked vertically to one another can be horizontally linked through a path by traveling up the hierarchy; this path eventually\nreaches a common direct or indirect superior and then travels down the hierarchy again. An example of this would be two colleagues who\neach report to a common superior but have the same relative amount of authority in the organization.\nFlat Hierarchies\nFlat (or horizontal) organizational structures have few or no levels of intervening management between staff and managers. This\n\"flattened\" hierarchy promotes employee involvement through a decentralized decision-making process. The idea is that well-trained\nworkers will be more productive when they are directly involved in the decision-making process rather than closely supervised by many\nlayers of management.\nFlat organization chart: This diagram illustrates the structure of a flat\norganization: there is no low- or mid-level management—just one\nmanager and the rest of the staff.\nAdvantages of Flattened Hierarchies\nFlat structures empower each individual within the company to be involved in decision-making processes. This allows for a great deal of\ncreative discussion and operational diversity and tends to create great variance in new ideas. By elevating the level of responsibility of\nbaseline employees and eliminating layers of middle management, comments and feedback can quickly reach all personnel involved in\ndecisions. Response to customer feedback can be carried out more rapidly.\nThis type of structure generally works best in smaller organizations or individual units within larger organizations. Start-up companies,\n\"mom and pop shops,\" and other small independent businesses are the most common examples of a flat structure.\nDisadvantages of Flattened Hierarchies\nFlat organizations are difficult to maintain as companies grow larger and more complex. When organizations reach a critical size, they can\nretain a streamlined structure; however, they cannot keep a completely flat manager-to-staff hierarchy without impacting productivity.\nCertain financial responsibilities may also require a traditional hierarchical structure. While the flat structure can foster employee\nempowerment, involvement, and creativity, it can also create inefficiency in decision-making processes. Some theorize that flat\norganizations become more traditionally hierarchical when they gear themselves more toward productivity.\nBecause the interaction between workers is more frequent, this organizational structure generally depends on a more personal\nrelationship between workers and managers. As a result, the structure can be more time-consuming to build than a traditional hierarchical\nmodel.\nDecentralizing Responsibility\nIn decentralized structures, responsibility for decision making is broadly dispersed down to the lower levels of an organization.\nLearning Objectives\nCompare and contrast centralization and decentralization of responsibility within the organizational hierarchy\nKey Takeaways\nKey Points\nDecentralization is the process of dispersing decision making authority among the people, citizens, employees, or other elements of an\norganization or sector.\nA decentralized organization shows fewer tiers in the organizational structure, a wider span of control, and a bottom-to-top flow of ideas\nand decision making.\nThe bottom-to-top flow of information allows lower-level employees to better inform the officials of the organization during any decision\nmaking processes.\nWhen companies decentralize authority, however, there can be confusion as to how final decisions are made.\nKey Terms\nmechanistic organization: A bureaucratic structure.\ngovernance: Accountability for consistent and cohesive policies, processes, and decision rights.\nauthority: The power to enforce rules or give orders.\nDecentralization is the process of dispersing decision making authority among the people, citizens, employees, or other elements of an\norganization or sector. In decentralized structures, responsibility for decision making and accountability are broadly dispersed down to\nthe lower levels of an organization. This dispersion can be intentional or unintentional. A decentralized organization tends to show fewer\ntiers in its organizational structure (less hierarchy ), a wider span of control, and a bottom-to-top or horizontal flow of decision making\nand ideas.\nDecentralization: The management structure in a decentralized\norganization changes from a top-down approach to more of a peer-\nto-peer approach.\nContrasting Centralized and Decentralized Structures\nIn a centralized organization, decisions are made by top executives on the basis of current policies. These decisions or policies are then\nenforced through several tiers of hierarchy within the organization, gradually broadening the span of control until they reach the bottom\ntier.\nIn a decentralized organization, the top executives delegate much of their decision making authority to lower tiers of the organizational\nstructure. This type of structure tends to be seen in organizations that run on less rigid policies and wider spans of control among each\nofficer of the organization. The wider spans of control also reduce the number of tiers within the organization, giving its structure a flat\nappearance.\nHierarchical chart\nCommunity and Board\nNovember 2012\nChief Executive\nOffice and Communications\nEvents Organiser Fundraiser\nDevelopment Manager Organiser\nContract\nDevelopers\nKey:\nOffice Support Officer\n* = Position is unfilled\nDecentralized organizational chart: This image illustrates a decentralized\n(often referred to as a \"flat\") organizational chart. Note that there are not\nmultiple layers of management; there is one manager and then the rest of\nthe staff. This means that each staff-person necessarily has more\nresponsibility and therefore more autonomy.\nAdvantages of Decentralization\nOne advantage of this structure—if the correct controls are in place—is the bottom-up flow of information. This flow allows lower-level\nemployees to better inform the officials of the organization during any decision making processes. For example, if an experienced\ntechnician at the lowest tier of an organization knows how to increase the efficiency of the production, the bottom-to-top flow of\ninformation can allow this knowledge to pass up to the executive officers.\nDisadvantages of Decentralization\nOn the other side of the argument, when companies decentralize authority there can be confusion as to how final decisions are made. It\ncan be difficult to empower multiple people without certain decisions negatively interacting with other decisions. Decentralized\norganizations must be mindful of the possibility of running in too many different directions at once. Because of this, decentralization is\nmost effective in organizations that have transparent strategies, a strong mission, and a clear vision.\nIncreasing Empowerment\nModern organizations are more aware of the value of empowered employees and actively strive to structurally increase empowerment.\nLearning Objectives\nDiscuss the advantages of empowerment in an organization, and how organizational structure can improve upon the promotion of\nempowered employees\nKey Takeaways\nKey Points\nEmpowerment is a process that enables individuals and groups to fully access their personal and collective power, authority, and\ninfluence, and to employ this power when engaging with other people, other institutions, or society.\nLeaders within an organization can play a strong role in encouraging employees to put empowerment into practice.\nTo enable empowerment, managers can share information, provide employees with autonomy, and migrate to self-managed teams when\npossible.\nThough the idea of empowerment can produce successful results, it is important to understand the risks. More decision -makers means\nmore discussion about how a process should be accomplished and more moving parts within the organization, increasing complexity.\nKey Terms\nempowerment: The accessing and employing of political, social, or economic power by an individual or group.\nDefining Empowerment\nEmpowerment is a process that enables individuals and groups to fully access personal and collective power and employ this power when\nengaging with other people, other institutions, or society. Empowerment does not give people power; rather, it helps to release and\nexpress the power that people already have.\nEmpowerment encourages people to gain the skills and knowledge that allows them to overcome obstacles in life and work. This will\nultimately enable personal development and a deeper sense of professional fulfillment. Empowering people in organizations can\nencourage more confident, capable, and motivated employees. Organizations are increasingly aware that empowerment often leads to\nbetter performance and higher operational efficiency, and there is a general trend toward structuring organizations for empowerment.\nEmpowerment within the Organization\nEmpowering employees in the workplace means providing them with opportunities to make their own decisions related to their tasks.\nThis can be a powerful and positive aspect within an organization that promotes shared power and enables checks and balances in\ndecision-making processes.\nEmpowerment in organizations includes:\nMaking decisions about personal and collective circumstances;\nAccessing information and resources for decision-making;\nConsidering a range of options from which to choose (and understanding the options rather than just deciding yes or no);\nExercising assertiveness in collective decision-making;\nEmploying positive thoughts toward the ability to make change;\nLearning and accessing skills for improving personal and collective circumstances; and\nInforming others' perceptions though exchange, education, and engagement.\nThough the idea of empowerment can produce very successful results, there are certain risks are involved. When turning responsibility\nover to others, it is important to keep in mind that diversifying power creates more voices and therefore potentially more conflict and\ndiscussion. All of these elements can slow down the decision-making process. As organizations move toward higher levels of\nempowerment, protocols should be put in place to mitigate failure and improve decision-making efficiency across the board.\nDecentralization: One key\ntechnique of empowering\nemployees and providing\nautonomy is decentralizing the\norganizational structure. Notice\nhow the diagram of the\ncentralized organization looks\nlike one large asterisk with\nmany spokes, whereas the\ndiagram of the decentralized\norganization looks like many\nsmall interconnected asterisks.\nIncreasing Empowerment\nLeaders within an organization can encourage employees to put empowerment into practice in several ways. If leaders want to tap into\nthe possibilities of an empowerment-based company, they need to have confidence in employees. Employees should also be given\nopportunities to make their own decisions and succeed. For an empowerment-based organization, rules and policies that interfere with\nself-management should be made more lenient. Leaders should also set goals that can inspire people.\nThe following are three key concepts that leaders can use to empower employees throughout an organization:\nShare information with everyone. By sharing information with everyone, leaders gain a clear picture of the company and its current\nsituation. Allowing all employees to view company information helps to build trust between employers and employees. This also provides\ndecision-makers with important perspectives to assess prior to deciding.\nCreate autonomy through boundaries. By opening communication through information sharing, space can be created for feedback and\ndialogue about what holds people back from being empowered. It is critical that leaders minimize micro-management so that employees,\nwho are specialists at the function they are assigned, can set the tone for how a particular task is accomplished.\nReplace the old hierarchy with self-managed teams. By replacing the old hierarchy with self-managed teams, more responsibility is placed\nupon unique and self-managed teams; this can lead to better communication, diversity of strategies, and higher performance.\nThe success of the modern organization relies heavily on understanding the complexity of a diverse global market. Leveraging employee\nknowledge and enabling autonomy is increasingly important in capturing value and attaining competitive advantages in this complex\nbusiness environment.\nIncreasing Adaptation\nIn order to succeed, modern organizations must constantly adapt to evolving technologies and expanding global markets.\nLearning Objectives\nIdentify the importance and inherent value of increasing adaptation within company structures and performance\nKey Takeaways\nKey Points\nTechnological advances, global market expansions, and the potential for constant (sometimes disruptive) innovation all point to the need\nfor organizations to be adaptive.\nBlockbuster and Netflix provide a classic example: in this case, Blockbuster was simply too slow to adapt to the demand for live-streaming\nvideos.\nIf an organization takes on the identity of a growing, adapting, and learning organization, these qualities become part of the fabric of how\nit operates.\nImplementing an adaptable strategy may have effects that ripple across an organization. Minimizing disruption can reduce costs and save\ntime.\nResistance to change is considered a major obstacle to creating effective adaptability in an organization. Integrating changes step by step\nwhile utilizing focus groups and training sessions can improve the efficacy of adaptation.\nKey Terms\nadaptation: Adjustment to extant conditions; modification of a thing or its parts in a way that makes it more fit for existence under the\nconditions of its current environment.\nThe Importance of Adaptation\nOrganizational adaption is becoming increasingly relevant to both strategy and structure as the business environment changes more\nquickly each year. Technological innovations, global market expansions, and the potential for constant (sometimes disruptive) innovation\nall point to the need for organizations to be adaptive.\nThere are a number of examples in which some organizations have adapted to new technologies or global competition, while others have\nfailed to adapt and subsequently gone under. Blockbuster and Netflix provide a classic example: in this case, Blockbuster was simply too\nslow to adapt to the demand for live-streaming videos. Netflix, on the other hand, embraced this technological evolution and pioneered a\nuser-friendly interface, gaining the company enormous value.\nIncreasing Adaptation\nStrategic management largely pertains to adapting an organization to its business environment. The greatest agent for organizational\nchange is the socialization aspect of culture, which can be empowered structurally. If an organization takes on the identity of a growing,\nadapting, and learning organization, these qualities become part of the fabric of how it operates. Knowing how and being able to increase\nthis adaptability is important to organizational success.\nImplementing a strategy of adaptation may have effects that ripple across an organization. Increasing an organization's ability to adapt to\nchange and minimize disruption can reduce costs and save time. One approach for increasing adaptation is to appoint an individual to\nchampion the changes, address and eventually enlist opponents, and proactively identify and mitigate problems.\nChallenges in Adaptation\nResistance to change is considered a major obstacle to creating effective adaptability in an organization. Organizational change can lead\nto loss of stability and—if this instability becomes great enough—loss of organizational effectiveness.\nOrganizational loss of effectiveness (LOE): Organizational change can cause a\nloss of stability and results in the development of a predictable and measurable\nset of symptoms within an organization. When a significant number of these\nsymptoms are present simultaneously, an organizational loss of effectiveness\n(LOE) will occur (Grady, 2005).\nThe following are methods that can be employed to help an organization and its staff to cope with change:\nForm focus groups. Staff from different departments can be selected to form focus groups, where quality data can be collected. In focus\ngroup discussions, staff should be given the chance to freely express their opinions and share their experiences.\nProvide training. Providing training courses to staff on new processes or structures can help to increase staff competence and reduce their\nresistance to change.\nImplement changes step by step. This involves first implementing the system in small groups—such as several departments or sections—\nand then widening the scope of implementation. This step-by-step approach can help by exposing problems raised simultaneously across\nthe small groups and providing management with sufficient time to solve these problems before implementing the system across the\norganization.\nMoving to Flexible Work Schedules\nEmployers can offer flexible working arrangements in the form of flextime and telecommuting work.\nLearning Objectives\nIdentify critical factors of success in creating a \"telework\" organization\nKey Takeaways\nKey Points\nCompanies have begun to recognize how important a healthy work-life balance is to the productivity and creativity of their employees.\nIntegrating new technologies for flexible schedules is a great opportunity to capture this value.\nFlextime and telecommuting (telework) are popular strategies that enable employees to set their own schedules and work from wherever\nis most convenient for them.\nIn addition to supporting the required incremental technologies, a well-functioning telework organization needs a management system\nthat is at least as effective as that of a traditional organization.\nManagement teams face additional issues such as how to supervise employees who are often out of the office, how to monitor staff\nproductivity with less personal interaction, how to build a strong virtual team, and how to maintain relationships between remote\nemployees.\nKey Terms\ntelecommute: To work from home, sometimes for part of a working day or week, using a computer connected to the employer's network\nor via the internet.\nCompanies have begun to recognize how important a healthy work-life balance is to the productivity and creativity of their employees.\nResearch by Kenexa Research Institute in 2007 showed that employees who were more favorable toward their organization's efforts to\nsupport work-life balance also indicated a lower intent to leave the organization, greater pride in their organization, a willingness to\nrecommend the organization as a place to work, and higher overall job satisfaction.\nEmployers can offer a range of different programs and initiatives that support such a work-life balance. Flexible working arrangements\nsuch as flextime and telecommuting work are becoming increasingly popular. More proactive employers can also provide compulsory\nleave, implement strict maximum hours, or foster an environment that encourages employees not to continue working after hours.\nTelecommuting\nTelecommuting (or telework) is a work arrangement in which employees do not commute to a central place of work. A person who\ntelecommutes is known as a \"telecommuter,\" \"teleworker,\" or \"home-sourced employee.\" Many telecommuters work from home while\nothers—sometimes called \"nomad workers\"—use mobile telecommunications technology to work from coffee shops or other locations.\nThis allows employees the flexibility of adapting their work schedule to their living situation.\nThis arrangement is also quite popular in circumstances of sick leave, pregnancy, parenting, and other important life events. In the past\nthese events could have resulted in temporary loss of employment. Being able to work from anywhere with an internet connection is a\nmodern luxury that adaptable companies should be well aware of.\nHome office: This small office is designed for telecommuting.\nFlextime\nFlextime (also called flexitime or flexi-time) is a variable work schedule, unlike traditional work arrangements in which employees work a\nstandard 9 a.m. to 5 p.m. shift. In this arrangement, there is typically a core period of approximately 50% of the total working day when\nemployees are expected to be at work (for example, between 11 a.m. and 3 p.m.). The rest of the working day is \"flextime\" in which\nemployees can choose when they work. Employees are still required to complete the necessary work and achieve total daily, weekly, or\nmonthly hours in the region of what the employer expects.\nA flextime policy allows staff to determine when they will work, and a flexplace policy allows staff to determine where they will work. These\nstrategies allow employees to adapt their work hours based on public transport schedules, child-care responsibilities, rush-hour traffic,\nand other elements.\nEstablishing a Telework Organization\nIn addition to supporting the required incremental technologies, a well-functioning telework organization needs a management system\nthat is at least as effective as that of a traditional organization. Management teams face additional issues such as how to supervise\nemployees who are often out of the office, how to monitor staff productivity with less personal interaction, how to build a strong virtual\nteam, and how to maintain relationships between remote employees.\nSome suggested best practices for maintaining a successful telework organization include:\nDevelop a daily schedule. Setting a standardized daily schedule can help remote teleworkers feel as though they are really at work. It can\nalso make it easier for supervisors to monitor staff activities and can lead to increased productivity.\nEstablish milestone dates. Milestone dates help keep projects on track and make it easier to spot problems while there is still time to\neffectively deal with them.\nEncourage social networking. Employee surveys show that being able to keep in touch and communicate with colleagues despite physical\ndistance can boost employee satisfaction and encourage top talent to stick around.\nAddress problems right away. Respond to problems immediately even if they are reported by email or text message. This will prevent\nteleworkers from feeling isolated.\nDesign key performance indicators ( KPIs ) for remote workers. These KPIs can also be used to measure the effectiveness of in-office staff\nand maintain an equivalence among the distinct employee categories.\nStart workdays by holding a five-minute team video-conference. This helps supervisors to maintain a regular check-in routine; it also\nenables employees to catch up on team work progress and feel connected to the whole organization.\nManage by observation. A successful telework or telecommuting program requires a management style that is results-oriented (as\nopposed to task-oriented). This is referred to as management by objectives as opposed to management by observation.\nIncreasing Coordination\nIncreasing coordination helps organizations to maintain efficient operations through communication and control.\nLearning Objectives\nIdentify the way in which effective coordination across an organization can be increased through effective structure and good\nmanagement\nKey Takeaways\nKey Points\nCoordination is a managerial function in which different activities of the business are properly adjusted and interlinked.\nThe management team must pay special attention to issues related to coordination and governance and be able to improve upon\ncoordination through effective management.\nManagers should strengthen communication across all facets of the organization to increase the level of integration between each\nmoving part.\nIf there is a lack of coordination, there is a risk that responsibility will become dispersed and tasks will be left unclaimed. Organizing\naccountability for every task helps to ensure that efforts are tangibly coordinated.\nKey Terms\ndivision: A section of a large company.\nmargin: A permissible difference; allowing some freedom to move within limits.\ncentralization: The act or process of combining or reducing several parts into a whole.\nDefining Coordination\nCoordination is the act of organizing and enabling different people to work together to achieve an organization's goals. It is a managerial\nfunction in which different activities of the business are properly adjusted and interlinked.\nEmployees within the functional divisions of an organization tend to perform a specialized set of tasks, such as engineering. This leads to\noperational efficiency within that group. However, it can also lead to a lack of communication between various functional groups within\nan organization, rendering the organization slow and inflexible.\nOrganizational structure: This is an example of an organizational\nstructure. At a high level are multiple functional groups, or\n\"modules\"—technical, marketing, and intellectual property. The\nlinked working groups (e.g., data coding workgroup, security\nworkgroup, and audio and video compression workgroup) within the\ntechnical functional group likely have coordinated functions.\nIncreasing Coordination\nCoordination is simply the managerial ability to maintain operations and ensure they are properly integrated with one another; therefore,\nincreasing coordination is closely related to improving managerial skills. The management team must pay special attention to issues\nrelated to coordination and governance and be able to improve upon coordination through effective management.\nIncreasing coordination internally can be accomplished by keeping all moving parts of the organization on the same page. There are a\nnumber of ways to improve upon the coordination of different departments, work groups, teams, or functional specialists. These include\ncreating a well-communicated and accurate mission statement; clearly defining strategic objectives; monitoring and evaluating each\nfunctional group; providing company-wide updates and communications from each department; and, wherever possible, promoting\ncross-departmental meetings and projects. While this list is long and complex, the underlying concept is relatively simple: managers\nshould strengthen communication across all facets of the organization to increase the level of integration between each moving part.\nStructural Implications\nIn practice, coordination involves a delicate balance between centralization and decentralization. However, maintaining coordination does\nnot necessarily imply that decision-making processes are centralized or that actions are carried out without the support of employees. Put\nsimply, it is important to ensure that there is a person or team in place that takes responsibility for general tasks.\nIf there is a lack of coordination, there is a risk that responsibility will become dispersed and tasks will be left unclaimed. Organizing\naccountability for every task helps to ensure that efforts are tangibly coordinated and provides structure to operational expectations.\nStructure is a central determinant of effective coordination across an organization as it enables communications, underlines\nresponsibilities, and provides concrete authority in decision-making.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}