{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Theory\nEvolving Organizations\nKnowledge Management and Behavior Modification\nKnowledge management and behavior modification are tactics employers use to ensure organizational growth and adaptability.\nLearning Objectives\nCompare and contrast the acquisition of knowledge and the modification of behavior as internally evolving organizational components\nKey Takeaways\nKey Points\nKnowledge management is an organizational concept that takes the best knowledge from individual employees and organizes it into a\nfunctional learning and education system that all employees can learn from.\nKnowledge management is usually implemented by a company's information technology department via electronic collection of specific\ncomponents of employee expertise, creation of online learning modules, and redistribution of the modules to the whole company.\nBehavioral modification includes the alteration of an individual's behavior through data collection and positive/ negative reinforcement.\nIn an organization, behavior modification is typically studied to examine how employees perceive their performance in relation to\nrewards. At a high level, it is used to develop strategies for improving performance behavior.\nKey Terms\nKnowledge management: Used in organizations to collect employee's specialized knowledge and organize, redistribute, and share with\nthe company.\nKnowledge management (KM), and the modification of behavior through utilizing organizational knowledge, is central to an\norganization's ability to grow and adapt. The value of knowledge management from the perspective of the organization is its ability to\nhelp employees learn and improve their skills, allowing the organization itself to evolve and achieve higher efficiency. Knowledge is an\nintangible resource which organizations can concretize by documenting experience over time. This helps them to avoid repeating\nmistakes and to improve current strategies.\nKnowledge Management\nKnowledge management is the range of strategies and practices used by an organization to identify, create, represent, distribute, and\nenable the adoption of employee insights and experiences. These insights and experiences constitute the company's \"knowledge,\" either\nembodied in individuals or embedded in organizations as processes or practices. KM includes courses taught in the fields of business\nadministration, information systems, management, and library and information sciences.\nMore recently, other fields have started contributing to KM research, including information and media, computer science, public health,\nand public policy. Knowledge management also focuses on organizational objectives such as improved performance, competitive\nadvantage, innovation, and continuous improvement. KM is similar to organizational learning but distinguishes itself because it focuses\nmore on knowledge as a strategic asset of a company's employees. It encourages the sharing of knowledge to further the company's\nsuccess.\nMany organizations include resources dedicated to internal knowledge management efforts in their business strategy, information\ntechnology, or human resource management departments. Consulting companies are also sometimes hired to provide advice about\nknowledge management. Knowledge management in a company is sometimes seen as an organizational concept that takes the best\nknowledge from individual employees and organizes it into functional learning and education systems that all employees can learn from.\nThe company's information technology department can make this happen by electronically collecting specific components of an\nemployee's knowledge expertise, creating an online learning module, and redistributing it to the company.\nFor example, an employee who is particularly knowledgeable about a certain computer system. This employee may be asked to write a\ntraining manual or presentation about this computer system which is then distributed to the company so that others can also benefit\nfrom that individual's knowledge. Knowledge-sharing is the most important component of knowledge management and is essential to\nhelping an organization evolve and grow.\nB.F. Skinner: B.F. Skinner\nintroduced the study of\nbehavior modification,\nfocusing on how animals\nand humans react to\nreward and punishment.\nHis theories are still used in\nbehavior modification\ntoday.\nBehavior Modification\nBehavior modification was first introduced in psychology as a collection of behavioral change techniques to increase or decrease the\nfrequency of behaviors. In psychology, behavioral modification was made popular by B. F. Skinner, who analyzed the triggers and rewards\nfor certain behaviors in a series of experiments with animals. Behavioral modification includes altering an individual's behavior through\npositive and negative reinforcement.\nBehavior modification in an organization is typically studied to examine how employees perceive their performance in relation to rewards.\nThe process of behavioral modification in the workplace focuses on identifying the frequency of certain performance-related behavior, as\nwell as determining what started or triggered that specific behavior. Once the trigger is identified, management can determine if it wants\nto develop a different trigger to change the employee's performance or if it should sustain the current performance through rewards and\nappraisal.\nBehavioral modification is generally used on a broader scale to determine how best to develop employee performance to move an\norganization in the desired direction. Knowledge management can help with this by providing employees with adequate training and\nskills and making sure that they know that they are valuable members of the organization worth investing in and empowering. Training\nemployees and improving their knowledge, skills, and behavioral approaches to work helps an organization to evolve and improve.\nExample\nAn example of knowledge management would involve an employee who is particularly knowledgeable about a certain computer system.\nThis employee may be asked to write a training manual or presentation about this computer system, which is then distributed to the\ncompany so that others can also benefit from that individual's knowledge.\nAccelerated Change and Adaptation\nChange management facilitates employee adaptation to organizational change.\nLearning Objectives\nIdentify the role of change management with the larger context of organizational theory\nKey Takeaways\nKey Points\nChange is essential to organizational growth and development. But employees can be uncomfortable with change, particularly when it\naffects their work on a daily basis.\nSometimes an organization faces accelerated change, from attempts to change its overall mission, for example, or to implement a\ndisruptive technology. In this situation it is important for employees to be able to adapt quickly.\nQuick adaptation to change is facilitated through change management strategies such as communication, employee alignment with\nexpectations, training, and transparency of management.\nKey Terms\nchange management: Change management attempts to use strategies such as communication and training to help employees become\nmore comfortable with organizational changes.\nManaging Change and Adaptation\nChange is essential to organizational growth and development. But employees don't always embrace change, particularly when it upsets\nroutines and/or the status quo. Employees can view change as a threat if it impacts their daily tasks, training, or possibly their job. Change\nmanagement is an approach to shifting and transitioning individuals, teams, and organizations from a current state to a desired future\nstate. It is an organizational process aimed at helping change stakeholders to accept and embrace changes in their business environment.\nDrivers of rapid adaptation are numerous, but one of the most relevant to modern organizations is the advent of new technology. When\nthe smartphone was introduced and became popular, all companies in the phone industry had to react rapidly to switch their operational\nfocus to smart phones, data plans, app stores, and multiple device integration. Companies that could not react and adapt quickly enough\nto the disruptive technology were left in the dust.\nSometimes an organization faces accelerated change when it is attempting to change its overall mission and refocus its vision. In the\nrecent recession, this occurred within a number of organizations that thought that the best way to survive was to re-brand or reorganize\ntheir business strategy as a whole. Changing a company's brand or overarching strategy (i.e., differentiation to low-cost or vice versa) is a\nmassive overhaul that will undoubtedly upset a number of people internally and externally. Responsible change is a complex process.\nOrganizational Change and Employees\nMajor changes to an organization will force employees to adapt. Employees may not approve of the change, but they will be required to\nadapt to it if they want to keep their jobs. This is likely to create tension between what the employees want and what is occurring in the\norganization. Change management helps employees adapt to accelerated organizational change by attempting to eliminate the tension\nbetween employees' resistance to and suspicions about change and the organization's new direction.\nChange management uses basic structure and tools to control an organizational change effort; these primarily revolve around ensuring\nthat all stakeholders are aware of what's going on and involving them in the strategic process. Managerial transparency about what is\nhappening and why is critical to employee buy-in. Communicating effectively and comprehensively and hearing out employee fears,\ncriticisms, and suggestions are integral to ensuring that everyone is on the same page. When changing the organization is required to\nremain profitable, employees will understand that they must pitch in to maintain the relevancy of their job.\nThe Role of the Manager in an Evolving Organization\nManagers play a number of roles in evolving organizations, including leader, negotiator, figurehead, liaison, and communicator.\nLearning Objectives\nBreak down the various and critical roles a leader must play in the transitional process from an organization perspective\nKey Takeaways\nKey Points\nA manager needs to be a good leader. While a manager organizes and plans, s/he must also inspire employees with a vision for the\norganization.\nA manager needs to be an effective negotiator. When organizations are developing or undergoing change, the manager is often required\nto negotiate with competitors, contractors, suppliers, and employees.\nA manager must be a good figurehead who reinforces the mission and vision of an organization to employees, customers, and other\nstakeholders.\nA manager needs to be an effective communicator and liaison between employees, customers, and other managers of the organization.\nKey Terms\nleader: A leader is thought to differ from a manager in that a leader's intention is to inspire and motivate while a manager's role is\nfocused more on organization and planning.\nManagers play an integral part in an organization's growth and evolution. Organizational growth is a complex process, particularly in\nlarger organizations with more inertia. Organizations are essentially a compilation of moving parts: motivating each individual, with\nher/his unique talents and motivation, to change direction simultaneously (and in the same direction) is extremely challenging, and\nrequires highly effective managers with highly developed communication skills.\nManagers must do more than accept change: they must facilitate the evolutionary process. In these situations, organizations need a\nmanager who can fulfill several roles, including leader, negotiator, figurehead, and communicator. In each of these roles, the manager's\ngoal is to help employees through the change with the least possible number of conflicts and issues.\nThe Role of a Manager during Organizational Change\nLeader\nTo effectively implement change, a manager needs to be a good leader. The manager must organize and plan the change and use\nleadership skills to inspire employees to embrace it. This is a complex and intangible skill, one which incorporates each of the roles listed\nbelow as well. Leadership is a broad term that incorporates communicating and inspiring those around you to embrace a perspective.\nNegotiator\nA negotiator is similar to a leader. When organizations are developing or undergoing change, the manager is often required to negotiate\nclearly and steadfastly with competitors, contractors, suppliers, and employees. A manager needs to be able to negotiate with all of these\nparties in a way that effectively serves the best interests of the organization.\nFigurehead\nA manager also needs to act as a figurehead of the organization. Upper management in particular is responsible for creating and\nreinforcing delivery of the mission and vision of an organization to employees, customers, and other stakeholders. Employees in particular\nmust understand where the organization is headed and what its ultimate goals are. A manager-figurehead can come to symbolize the\norganization as a whole for customers. The manager who builds a positive rapport with both customers and employees creates a positive\nassociation of her/himself with the organization at large.\nLiaison and Communicator\nWhen managers effectively communicate their vision for the organization, employees are more likely to engage with their work and exert\nthemselves to further the organizational mission. Communication is at the core of managing change effectively. Transparency and\nempathy are integral to making employees aware of and comfortable with the changes taking place. Managers in an evolving\norganization must stay in constant contact with their direct reports to ensure that everything is running smoothly and that all\nstakeholders are educated and on board.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}