{
    "text": "Search... Home Subjects\nBoundless Management\nGroups, Teams, and Teamwork\nManaging Conflict\nStyles of Interpersonal Conflict\nTeam conflict is a state of discord between individuals that work together.\nLearning Objectives\nExplain the distinction between substantive and affective conflicts and between intra- and inter-organizational conflict\nKey Takeaways\nKey Points\nConflict is a state of discord between people, or groups of people working together, caused by an actual or perceived opposition of\nneeds, values, and/or interests.\nSubstantive conflicts deal with aspects of performance or tasks and often relate specifically to the project or goals of a team or\norganization.\nAffective conflicts, also known as personal conflicts, revolve around personal disagreements or dislikes between individuals in a team.\nOrganizational conflict may be intra-organizational, meaning it takes place across departments or within teams, or it may be inter-\norganizational, meaning it arises from disagreements between two or more organizations.\nKey Terms\naffective: Relating to, resulting from, or influenced by emotions.\nsubstantive: Of the core essence or essential element of a thing or topic.\nConflict is a feature common to social life. In organizations, conflict is a state of discord caused by the actual or perceived opposition of\nneeds, values, and/or interests between people working together. Conflict on teams takes many forms and can be minor, causing only\nbrief disruption, or major, threatening the team's ability to function and attain its goals. We can distinguish between two type of conflict:\nsubstantive and affective.\nSubstantive and Affective Conflict\nSubstantive conflicts deal with aspects of a team's work. For example, conflicts can arise over questions about an individual's performance,\ndiffering views about the scope of a task or assignment, disparate definitions of acceptable quality, or the nature of a project goal. Other\nsubstantive conflicts involve how team members work together. These process conflicts often involve disagreements over the strategies,\npolicies, and procedures the group should use in order to complete its tasks.\nAffective conflict relates to trouble that develops in interpersonal relationships among team members. While these personal conflicts\nemerge as people work together, they may have their roots in factors separate from the team's purpose and activities. Affective conflicts\nare often based on personality conflicts, differing communication styles, perceptions about level of effort, or personal dislikes based on\nnegative past experiences.\nIntra-Organizational and Inter-Organizational Conflict\nBoth substantive and affective conflicts can be separated into those that happen within an organization and those that happen between\ntwo or more different organizations. Intra-organizational conflicts occur across departments in an organization, within work teams and\nother groups, and between individuals. Inter-organizational conflicts are disagreements between people—business partners, for example,\nor other collaborators, vendors, and distributors—in two or more organizations.\nArguing wolves: These wolves are expressing\ndisagreement over territory or having some other type\nof conflict.\nThe Impact of Interpersonal Conflict on Team Performance\nConflict can have damaging or productive effects on the performance of a team.\nLearning Objectives\nAnalyze the way in which conflict can both help and hurt a team's performance\nKey Takeaways\nKey Points\nConflict is common within teams, especially during the storming phase of team development.\nTeam conflict provides benefits including resolving misunderstandings, improving processes, and changing behaviors.\nTeam conflict can have negative consequences such as reduced group cohesion and lower productivity, and it can even threaten the\nteam's existence.\nKey Terms\ninterdependent: Mutually dependent; reliant on one another.\naffective: Relating to, resulting from, or influenced by emotions.\nConflict occurs often in teamwork, especially during the storming phase of team development. While at first we might think of all conflict\nbetween team members as undesirable and harmful, the process of resolving conflicts can actually provide benefits to team performance.\nWhether a conflict is productive or not can depend on how team members perceive it, as well as how it affects progress toward the\nteam's goals.\nBenefits of Team Conflict\nSubstantive conflicts can affect performance for the better by removing barriers caused by different assumptions or misunderstandings\nabout a team's tasks, strategy, or goals. Conflict can be constructive when it creates broader awareness about how team members are\nexperiencing their work and thus leads to changes that improve members' productivity. Conflict can also lead to process improvements,\nsuch as when it reveals a deficiency in how the team communicates, which can then be corrected. Clashes of ideas can lead to more\ncreative solutions or otherwise provide perspectives that persuade the team to take a different approach that is more likely to lead to\nsuccess.\nAddressing personal conflicts that arise between members can facilitate cooperation by helping individuals adapt their behavior to better\nsuit the needs of others. Although most people find conflict uncomfortable while they are experiencing it, they can come to recognize its\nvalue as the team progresses in its development.\nNegative Consequences of Team Conflict\nWhile sometimes conflict can lead to a solution to a problem, conflicts can also create problems. Discord caused by enmity between\nindividuals can reduce team cohesion and the ability of team members to work together. Conflicts can create distractions that require\ntime and effort to resolve, which can delay completion of tasks and even put a team's goals at risk.\nCommunication can suffer when people withdraw their attention or participation, leading to poor coordination of interdependent tasks.\nTension and heightened emotions can lower team members' satisfaction, increase frustration, and lead to bad judgments. They can even\nprompt individuals to withdraw from the team, requiring the assignment of a new member or creating a resource scarcity that makes it\nmore difficult for the team to fulfill its purpose. In extreme cases, conflict among members, if left unaddressed, can lead to the complete\ninability of the team to function, and thus to its disbandment.\nCommon Causes of Team Conflict\nTeam conflict is caused by factors related to individual behavior as well as disagreements about the team's work.\nLearning Objectives\nIdentify the causes of conflict within an organization as a conflict manager.\nKey Takeaways\nKey Points\nTeam conflict arises from how people perceive the actions of others and from differing views of the team's work and how it should be\naccomplished.\nCommon causes of team conflict include conflicting interests, incompatible work styles, competition over resources, failure to follow\nnorms, poor communication, and performance deficiencies.\nKey Terms\nambiguity: Something liable to more than one interpretation, explanation, or meaning.\naffective: Relating to, resulting from, or influenced by emotions.\nConflict between team members comes from several sources. Some conflicts have their basis in how people behave, while others come\nfrom disagreements about the nature of the team's work and how it is being accomplished.\nCompeting interests: Conflict can arise when people have mutually incompatible desires or needs. For example, two team members with\nsimilar skills may both want a certain assignment, leaving the one who doesn't receive it resentful.\nDifferent behavioral styles or preferences: Individuals may clash over their respective work habits, attention to detail, communication\npractices, or tone of expression. While these can affect coordination of interdependent tasks, they can especially inhibit direct\ncollaboration.\nCompetition over resources: Members may fight over the limited resources available to accomplish the team's tasks. For example, if two\npeople both rely on the action of a third person to meet identical deadlines, disagreements might arise over whose work should receive\nthat person's attention first.\nFailure to follow team norms: A team member creates conflict when she displays attitudes or behaviors that go against the team's\nagreement about how it will function. If a group norm calls for prompt arrival at meetings and prohibits the use of mobile devices during\ndiscussions, ignoring these practices can engender conflict.\nPerformance deficiencies: When some team members are either not contributing their share of effort or not performing at the expected\nlevel of quality, the impositions that result can create friction, which may be heightened when critical or highly visible tasks are involved.\nPoor communication: When team members do not share relevant information with each other, people may make decisions or take actions\nthat others consider inappropriate or even harmful. Blame and questions about motives can result, creating discord among the team.\nAmbiguity about means and ends: Lack of clarity about tasks, strategies, and/or goals can lead people to make assumptions that others\ndo not share or agree with, which can result in conflict.\nCard game argument: Behavioral differences and personality\nclashes can cause conflict even among friends.\nConstructive Team Conflict\nTeams can use conflict as a strategy for enhancing performance.\nLearning Objectives\nExplain how conflict can be used as a strategy for improving team performance\nKey Takeaways\nKey Points\nTeam performance can benefit by using conflict to foster learning and process improvement.\nTeam members can establish guidelines and norms that encourage constructive conflict.\nKey Terms\ninnovation: A change in customs; something new and contrary to established patterns, manners, or rites.\nconflict: A clash or disagreement between two opposing groups or individuals.\nTeams may use conflict as a strategy for continuous improvement and learning. Recognizing the benefits of conflict and using them as\npart of the team's process can enhance team performance. Conflict can uncover barriers to collaboration that changes in behavior can\nremove. It can also foster better decisions because it makes team members consider the perspectives of others and even helps them see\nthings in new and innovative ways.\nAddressing conflict can increase team cohesion by engaging members in discussions about important issues. Team members may feel\nmore valued when they know they are contributing to something vital to the team's success. Conflict can reveal assumptions that may not\napply in the current situation and thus allow the team to agree on a new course. It can also draw attention to norms that have developed\nwithout the explicit agreement of team members and create the opportunity to endorse or discard them.\nGenerating Constructive Conflict\nTeam members and others can follow a few guidelines for encouraging constructive conflict. First, they can start by explicitly calling for it\nas something that will help improve the team's performance. This helps people view conflict as acceptable and can thus free them to\nspeak up.\nTeams can lower the emotional intensity of any conflict be establishing clear guidelines for how to express disagreements and challenge\ncolleagues. One helpful norm is to focus on the task-related element of a conflict rather than criticizing the traits of particular individuals.\nAnother is to emphasize common goals and shared commitments, which can keep conflict in perspective and prevent it from\noverwhelming the team's efforts.\nTeam Conflict Resolution and Management\nSome ways of dealing with conflict seek resolution; others aim to minimize negative effects on the team.\nLearning Objectives\nDifferentiate between conflict resolution and conflict management\nKey Takeaways\nKey Points\nConflict resolution aims to eliminate disagreements and disputes among team members; in contrast, conflict management seeks to\nminimize the negative effects of conflict on team performance.\nThere are three main approaches to conflict resolution: integrative, distributive, and mediating.\nThere are three main conflict-management tactics: smoothing, yielding, and avoiding.\nKey Terms\ndispute: An argument or disagreement.\nresolution: The moment in which a conflict ends and the outcome is clear.\nadversarial: Characteristic of an opponent; combative, hostile.\nThe way a team deals with conflicts that arise among members can influence whether and how those conflicts are resolved and, as a\nresult, the team's subsequent performance. There are several ways to approach managing and resolving team conflict—some leave the\nteam and its members better able to continue their work, while others can undermine its effectiveness as a performing unit.\nConflict Resolution\nTeams use one of three primary approaches to conflict resolution: integrative, distributive, and mediating.\nIntegrative approaches focus on the issue to be solved and aim to find a resolution that meets everyone's needs. Success with this tactic\nrequires the exchange of information, openness to alternatives, and a willingness to consider what is best for the group as a whole rather\nthan for any particular individual.\nDistributive approaches find ways to divide a fixed number of positive outcomes or resources in which one side comes out ahead of the\nother. Since team members have repeated interactions with each other and are committed to shared goals, the expectation of reciprocity\ncan make this solution acceptable since those who don't get their way today may end up \"winning\" tomorrow.\nMediating approaches bring in a third party to facilitate a non-confrontational, non-adversarial discussion with the goal of helping the\nteam reach a consensus about how to resolve the conflict. A mediator from outside the team brings no emotional ties or preconceived\nideas to the conflict and therefore can help the team identify a broader set of solutions that would be satisfactory to all.\nAlthough these three approaches all bring overt conflict to an end, team cohesion can suffer if members perceive the process itself as\nunfair, disrespectful, or overly contentious. The result can be resentment that festers and leads to subsequent additional conflict that a\nmore conciliatory process might have avoided.\nConflict Management\nThe primary aim of conflict management is to promote the positive effects and reduce the negative effects that disputes can have on\nteam performance without necessarily fully resolving the conflict itself. Teams use one of three main tactics to manage conflict:\nsmoothing, yielding, and avoiding.\nThe smoothing approach attempts to minimize the differences among the people who are in conflict with each other. This strategy often\nfocuses on reducing the emotional charge and intensity of how the people speak to each other by emphasizing their shared goals and\ncommitments.\nThe yielding approach describes the choice some team members make to simply give in when others disagree with them rather than\nengage in conflict. This is more common when the stakes are perceived to be small or when the team member's emotional ties to the\nissue at hand are not particularly strong.\nIn the avoiding approach, teams members may choose to simply ignore all but the most contentious disagreements. While this can have\nshort-term benefits and may be the best option when the team is under time pressure, it is the approach least likely to produce a sense of\nharmony among the team.\nWhile conflict can increase the engagement of team members, it can also create distractions and draw attention away from important\ntasks. Because conflict management seeks to contain such disruptions and threats to team performance, conflicts do not disappear so\nmuch as exist alongside the teamwork.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}