{
    "text": "Search... Home Subjects\nBoundless Management\nEthics in Business\nEthics, an Overview\nDefining Ethics\nEthics are the set of moral principles that guide a person's behavior.\nLearning Objectives\nDefine ethics and how it applies to organizations\nKey Takeaways\nKey Points\nEthical behavior is based on written and unwritten codes of principles and values held in society.\nEthics reflect beliefs about what is right, what is wrong, what is just, what is unjust, what is good, and what is bad in terms of human\nbehavior.\nEthical principles and values serve as a guide to behavior on a personal level, within professions, and at the organizational level.\nKey Terms\nbehavior: The way a living creature acts.\nethics: The study of principles relating to right and wrong conduct.\nvalues: A collection of guiding principles; what one deems to be correct, important, and desirable in life, especially regarding personal\nconduct.\nEthics are the set of moral principles that guide a person's behavior. These morals are shaped by social norms, cultural practices, and\nreligious influences. Ethics reflect beliefs about what is right, what is wrong, what is just, what is unjust, what is good, and what is bad in\nterms of human behavior. They serve as a compass to direct how people should behave toward each other, understand and fulfill their\nobligations to society, and live their lives.\nWhile ethical beliefs are held by individuals, they can also be reflected in the values, practices, and policies that shape the choices made\nby decision makers on behalf of their organizations. The phrases business ethics and corporate ethics are often used to describe the\napplication of ethical values to business activities. Ethics applies to all aspects of conduct and is relevant to the actions of individuals,\ngroups, and organizations.\nIn addition to individual ethics and corporate ethics there are professional ethics. Professionals such as managers, lawyers, and\naccountants are individuals who exercise specialized knowledge and skills when providing services to customers or to the public. By virtue\nof their profession, they have obligations to those they serve. For example, lawyers must hold client conversations confidential and\naccountants must display the highest levels of honest and integrity in their record keeping and financial analysis. Professional\norganizations, such as the American Medical Association, and licensing authorities, such as state governments, set and enforce ethical\nstandards.\nExample\nThe concept of corporate social responsibility emphasizes ethical behavior in that it requires organizations to understand, identify, and\neliminate unethical economic, environmental, and social behaviors.\nEthics Training\nMoral reasoning is the process in which an individual tries to determine what is right and what is wrong.\nLearning Objectives\nExplain the role of ethical moral reasoning in the business environment\nKey Takeaways\nKey Points\nThere are four components of moral behavior: moral sensitivity, moral judgment, moral motivation, and moral character.\nTo make moral assessments, one must first know what an action is intended to accomplish and what its possible consequences will be on\nothers.\nStudies have uncovered four skill sets that play a decisive role in the exercise of moral expertise: moral imagination, moral creativity,\nreasonableness, and perseverance.\nKey Terms\ngoodwill: The ability of an individual or business to exert influence within a community, club, market, or another type of group, without\nhaving to resort to the use of an asset (such as money or property).\nethics: The study of principles relating to right and wrong conduct.\nMoral reasoning is the process in which an individual tries to determine the difference between what is right and what is wrong in a\npersonal situation by using logic. To make such an assessment, one must first know what an action is intended to accomplish and what its\npossible consequences will be on others. People use moral reasoning in an attempt to do the right thing. People are frequently faced with\nmoral choices, such as whether to lie to avoid hurting someone's feelings, or whether to take an action that will benefit some while\nharming others. Such judgements are made by considering the objective and the likely consequences of an action. Moral reasoning is the\nconsideration of the factors relevant to making these types of assessments.\nAccording to consultant Lynn W. Swaner, moral behavior has four components:\nMoral sensitivity, which is \"the ability to see an ethical dilemma, including how our actions will affect others.\"\nMoral judgment, which is \"the ability to reason correctly about what 'ought' to be done in a specific situation.\"\nMoral motivation, which is \"a personal commitment to moral action, accepting responsibility for the outcome.\"\nMoral character, which is a \"courageous persistence in spite of fatigue or temptations to take the easy way out.\"\nThe ability to think through moral issues and dilemmas, then, requires an awareness of a set of moral and ethical values; the capacity to\nthink objectively and rationally about what may be an emotional issue; the willingness to take a stand for what is right, even in the face of\nopposition; and the fortitude and resilience to maintain one's ethical and moral standards.\nRealizing good conduct, being an effective moral agent, and bringing values into one's work, all require skills in addition to a moral\ninclination. Studies have uncovered four skill sets that play a decisive role in the exercise of moral expertise.\nMoral imagination: The ability to see the situation through the eyes of others. Moral imagination achieves a balance between becoming\nlost in the perspectives of others and failing to leave one's own perspective. Adam Smith terms this balance \"proportionality,\" which we\ncan achieve in empathy.\nMoral creativity: Moral creativity is closely related to moral imagination, but it centers on the ability to frame a situation in different ways.\nReasonableness: Reasonableness balances openness to the views of others with commitment to moral values and other important goals.\nThat is, a reasonable person is open, but not to the extent where he is willing to believe just anything and/or fails to keep fundamental\ncommitments.\nPerseverance: Perseverance is the ability to decide on a moral plan of action and then to adapt to any barriers that arise in order to\ncontinue working toward that goal.\nExample\nWilliam LeMesseur designed the Citicorp Building in New York. When a student identified a critical design flaw in the building during a\nroutine class exercise, LeMesseur responded not by shooting the messenger but by developing an intricate and effective plan for\ncorrecting the problem before it resulted in drastic real-world consequences.\nCulture and Ethics\nCulture reflects the moral values and ethical norms governing how people should behave and interact with others.\nLearning Objectives\nExplain the role of culture in shaping moral and ethical behavior\nKey Takeaways\nKey Points\nCulture refers to the outlook, attitudes, values, goals, and practices shared by a group, organization, or society.\nInterpretation of what is moral is influenced by cultural norms, and different cultures can have different beliefs about what is right and\nwrong.\nAccording to the theory of cultural relativism, there is no singular truth on which to base ethical or moral behavior, as our interpretations\nof truths are influenced by our own culture.\nKey Terms\nethnocentric: Of the idea or belief that one's own culture is more important than, or superior to, other cultures.\nmoral relativism: Refers to any of several philosophical positions concerned with the differences in moral judgments among different\npeople and across different cultures.\nnorms: Rules or laws that govern a group's or a society's behaviors.\nCulture describes a collective way of life, or way of doing things. It is the sum of attitudes, values, goals, and practices shared by\nindividuals in a group, organization, or society. Cultures vary over time periods, between countries and geographic regions, and among\ngroups and organizations. Culture reflects the moral and ethical beliefs and standards that speak to how people should behave and\ninteract with others.\nCultural map of the world: This diagram attempts to\nplot different countries by the importance of different\ntypes of values. One axis represents traditional values\nto secular-rational values, while the other axis accounts\nfor survival values and self-expression values. Different\ngroups of countries can be grouped into certain\ncategories, such as Catholic Europe, English speaking,\nand Ex-Communist.\nCultural norms are the shared, sanctioned, and integrated systems of beliefs and practices that are passed down through generations and\ncharacterize a cultural group. Norms cultivate reliable guidelines for daily living and contribute to the health and well-being of a culture.\nThey act as prescriptions for correct and moral behavior, lend meaning and coherence to life, and provide a means of achieving a sense of\nintegrity, safety, and belonging. These normative beliefs, together with related cultural values and rituals, impose a sense of order and\ncontrol on aspects of life that might otherwise appear chaotic or unpredictable.\nThis is where culture intersects with ethics. Since interpretations of what is moral are influenced by cultural norms, the possibility exists\nthat what is ethical to one group will not be considered so by someone living in a different culture. According to cultural relativists this\nmeans that there is no singular truth on which to base ethical or moral behavior for all time and geographic space, as our interpretations\nof truths are influenced by our own culture. This approach is in contrast to universalism, which holds the position that moral values are\nthe same for everyone. Cultural relativists consider this to be an ethnocentric view, as the universal set of values proposed by universalists\nare based on their set of values. Cultural relativism is also considered more tolerant than universalism because, if there is no basis for\nmaking moral judgments between cultures, then cultures have to be tolerant of each other.\nExample\nThe French and Americans have different views on whistle-blowing. Compared to the French, American companies consider it to be a\nnatural part of business. So natural, in fact, that they set up anonymous hotlines. The French, on the other hand, tend to view whistle-\nblowing as undermining solidarity among coworkers.\nThe Manager's Role in Ethical Conduct\nEmployees can more easily make ethical decisions that promote a company's values when their personal values match the company's\nnorms.\nLearning Objectives\nExplain the role of personal values in influencing behavior in organizations\nKey Takeaways\nKey Points\nPersonal values provide an internal reference for what is good, beneficial, important, useful, beautiful, desirable, and constructive.\nPersonal values take on greater meaning in adulthood as they are meant to influence how we carry out our responsibilities to others.\nTo make ethical and moral choices, one needs to have a clear understanding of one's personal values.\nKey Terms\nvalue: A standard by which an individual determines what is good or desirable; a measure of relative worth or importance.\nnorms: According to sociologists, social norms are the laws that govern society's behaviors.\nPersonal values provide an internal reference for what is good, beneficial, important, useful, beautiful, desirable, and constructive. Over\ntime, the public expression of personal values has laid the foundations of law, custom, and tradition. Personal values in this way exist in\nrelation to cultural values, either in agreement with or divergent from prevailing norms.\nPersonal values are developed in many different ways:\nThe most important influence on our values comes from the families we grow up with. The family is responsible for teaching children\nwhat is right and wrong long before there are other influences. It is thus said that a child is a reflection of his or her parents.\nTeachers and classmates help shape the values of children during the school years.\nReligion (or a lack thereof) also plays a role in teaching children values.\nPersonal values take on greater meaning in adulthood as they are meant to influence how we carry out our responsibilities to others. This\nis true in the workplace, especially for managers and leaders, who are charged with overseeing resources for the benefit of others.\nBecause of their authority structures, social norms, and cultures, organizations can have a powerful influence on their employees.\nEmployers do their best to hire individuals who match match well with the organization's norms and values. In this way they seek to\npromote their standards of ethical behavior.\nConversely, conflicts can occur between an individual's moral values and what she perceives to be those of others in their organization.\nSince moral judgments are based on the analysis of the consequences of behavior, they involve interpretations and assessments. One\nmight be asked to do something that violates a personal belief but is considered appropriate by others. To make ethical and moral\nchoices, one needs to have a clear understanding of one's personal values. Without that awareness, it can be difficult to justify a decision\non ethical or moral grounds in a way that others would find persuasive.\nExample\nIf you value equal rights for all and you go to work for an organization that treats its managers much better than it does its workers, you\nmay form the attitude that the company is an unfair place to work; consequently, you may not produce well or may even leave the\ncompany. It is likely that if the company had a more egalitarian policy, your attitude and behaviors would have been more positive.\nBlurring Ethical Lines\nEthical decisions involve judgments of facts and situations that are subject to interpretation and other influences.\nLearning Objectives\nAnalyze the gray areas of ethical expectations within the context of corporate decision making and ethical business practice\nKey Takeaways\nKey Points\nIdentifying the ethical choice can be difficult, since many situations are ambiguous and facts are subject to interpretation.\nIn organizations, employees can look to the code of ethics or the statement of values for guidance about how to handle ethical gray\nareas.\nIndividual ethical judgement can be clouded by rationalizations to justify one's actions.\nKey Terms\nbusiness ethics: The branch of ethics that examines questions of moral right and wrong arising in the context of business practice or\ntheory.\nnorms: According to sociologists, social norms are the laws that govern society's behaviors.\nLaw and ethics are not the same thing. Both exist to influence behavior, but complying with the law is mandatory, while adhering to an\nethical code is voluntary. Laws define what is permissible, while ethics speak to what is right, good, and just. Lawyers and judges are\nresponsible for clarifying the meaning of a law when there is ambiguity or when a matter is subject to interpretation. Where ethics are\nconcerned, that responsibility lies with each individual. In organizations, employees can look to the code of ethics or the statement of\nvalues for guidance about how to handle ethical gray areas.\nEven when an individual has a clear sense of right and wrong, or good and bad, it can be difficult to know what is ethical in a given\nsituation. Ethical choices involve judgment because they involve weighing the potential consequences of one's actions for other people.\nOne analyzes ethical issues by asking questions such as: What could happen? How likely is it happen? What might the harm be? Who\nmight be hurt? The answers are not always clear cut.\nIndividual judgments can be influenced, even clouded, by a number of factors. A study by Professor Robert Prentice suggests that self-\nimage can influence an individual's decision -making process, making him or her feel justified in taking shortcuts or doing things that\ncould be seen as ethically questionable. In addition, there are times when people believe that the ends justify the means. In other words, if\nthe result of an action is good, then it is okay if the action itself is unethical.\nThere is a saying that a good person is one who does good deeds when no one is looking. The same goes with ethical decisions. People\nwho are ethical follow their beliefs even when they believe no one will find out about what they have done. In many cases of ethical\nbreaches in organizations, those who acted unethically likely believed that they wouldn't be discovered. Others may have thought that if\nthe issues were discovered, the actions wouldn't be traced back to them. They had the opportunity to be ethical but chose not to be.\nBusiness Ethics Around the Globe\nSocial norms aren't identical in different countries, and ethical standards can vary as well. A business may operate in a country that\npermits actions that would be considered unethical under that business's ethical code. How will employees working in that country handle\nthat situation, especially if something that could be considered unethical in one place is actually thought to be important to business\nsuccess in the other? For instance, in some cultures it is customary for business partners and customers to be invited to weddings, with\nthe expectation that guests will give a cash gift to the bride and groom. A company might consider the gift an unethical bribe in\nexchange for a customer's business, yet it may be essential to enter a new market. Adhering to ethical standards in such instances can be\ndifficult.\nThis way to ethics: Ethical decisions are not always\nclear-cut.\nExample\nAmerican companies are often criticized for the treatment of workers who produce their products in China. However, rules concerning the\nrights of workers are much more relaxed in China than in the United States. Does an American company have the right to order factory\nowners in China to change their way of doing business? That is one example of an ethical gray area in today's globalized economy.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}