{
    "text": "Search... Home Subjects\nBoundless Management\nDecision Making\nConsidering Ethics in Decision Making\nMoral Principles in Management\nBusiness ethics deals with the beliefs and principles that guide management decisions.\nLearning Objectives\nRecognize the importance of ethics in the business environment, particularly how individual managers should employ these principles\nKey Takeaways\nKey Points\nBusiness ethics concerns the duties and obligations an organization has to its stakeholders, including employees, customers, suppliers,\nand communities.\nThe corporate world has taken steps to improve ethical compliance in the workplace after major corporate scandals like WorldCom, Tyco,\nand Enron.\nWhile compliance with laws is coerced trough the threat of sanctions or litigation, ethical behavior is voluntary.\nIt is the duty of all managers to see that their organization maintains ethical practices and behaviors.\nKey Terms\nmoral: Of or relating to principles of right and wrong in behavior, especially for teaching right behavior.\nethics: The study of principles relating to right and wrong conduct.\nMorality (from the Latin moralitas, meaning \"manner, character, proper behavior\") is the differentiation of intentions, decisions, and\nactions between those that are good (or right) and those that are bad (or wrong). Ethics, also known as moral philosophy, is a branch of\nphilosophy that involves systematizing, defending, and recommending concepts of right and wrong conduct.\nBusiness Ethics\nBusiness ethics (also corporate or professional ethics) is a form of applied ethics that examines the principles and moral beliefs that guide\nmanagement decisions. Ethical issues include the obligations a company has to its employees, suppliers, customers and neighbors. In\nparticular, business ethics is concerned with situations when those obligations are inconsistent with economic or strategic choices, or are\nin conflict with each other. Legal obligations are not the same as ethical ones; laws are enforced through the threat or imposition of\npunishment by a government or through civil litigation. All individuals and organizations must follow the law, but complying with ethical\nbeliefs is voluntary, not coerced.\nBusiness ethics applies to all aspects of business conduct by individuals and organizations as a whole. Ethical behavior is conduct that\nfollows one's personal beliefs or shared organizational or institutional values. When individuals take action on behalf of an organization,\nthey represent its ethics to society. Businesses are dependent on their reputations, so it is important for them to have clear and consistent\nexpectations regarding ethical standards to guide employee behavior. Many employees prefer to work for organizations that share their\nown moral beliefs. A company's ethical practices can thus have an effect on the recruitment and retention of employees.\nIn recent decades there has been widespread attention to business ethics due to highly visible cases of corporate malfeasance, such as\nthe WorldCom, Enron, and Tyco scandals. To protect their reputations, companies have begun to form more comprehensive corporate\npolicies concerning ethics. These policies generally offer guidance to employees and state the expectations of the company. Some\ncompanies require that employees sign a contract stating that they will follow the procedures within the handbook.\nTo be viewed by the public as having high moral standards, many companies have created a position called the corporate ethics officer or\nthe corporate compliance officer. This person ensures their organization has statements of ethical principals, clear guideline about\nacceptable and unacceptable practices, and means of reporting ethical breaches. These executives also have the specific responsibility of\nmonitoring ethical behavior and addressing breaches.\nPromoting an Ethical Business Climate\nThere are at least four elements that create an atmosphere conducive to ethical behavior within an organization:\nA written code of ethics and standards\nEthics training for executives, managers, and employees\nAvailability for advice on ethical situations (i.e., advice lines or offices)\nSystems for confidential reporting\nIt is the duty of all managers to see that their organization maintains ethical practices and behaviors. Good leaders strive to create a\nbetter and more ethical organization. Promoting an ethical climate in an organization is critical, since it is a key component in addressing\nmany other issues facing the organization.\nApplying the Ethical Decision Tree\nDecision trees are useful analytic tools for considering the ethical dimensions of a decision.\nLearning Objectives\nDefine the concept of a decision tree as it applies to the ethical dimensions of a decision.\nKey Takeaways\nKey Points\nDecision trees are used to identify alternatives and estimate their likely outcomes.\nManagers can use decision-tree analysis to consider the effect of each alternative on stakeholders such as employees, customers,\nshareholders, and communities.\nDecision-tree analysis can help identify or uncover the potential impacts of alternatives so that a decision maker can select the option that\nis most consistent with her ethical and moral beliefs.\nKey Terms\nethics: The study of principles relating to right and wrong conduct.\ndecision tree: A visualization of a complex decision-making situation in which the possible decisions and their likely outcomes are\norganized in the form of a graph that resembles a tree.\nEthics are moral principles that guide a person's behavior. These morals are shaped by social norms, cultural practices, and religious\ninfluences. All decisions have an ethical or moral dimension for a simple reason—they have an effect on others. Managers and leaders\nneed to be aware of their own ethical and moral beliefs so they can draw on them when they face decisions. They can then effectively\nthink through an ethical issue with the same types of approaches they use for other decisions.\nDecision Trees\nDecision trees are graphical representations of alternatives and possible outcomes. The decisions are represented by the branches of the\ntree. Organizations and individuals often use decision trees as part of their decision-making process because they are a means for adding\nformal structure to information about a decision. Identifying the range of possibilities and their potential consequences helps clarify the\ndecision and facilitates selection of an alternative.\nAdding an article to Wikipedia\nSearch Wikipedia\nIs it Is there a\nNo\nfound? related term?\nNo Yes\nYes\nThink of Create Create\nanother a new a\nterm article redirect\nDecision tree: An example of a decision tree.\nDecision trees can be applied to ethical matters as well. If confronted with an ethical dilemma, creating a decision tree is a useful method\nfor analyzing what the potential outcomes of each action would be, and ultimately, how to proceed. It is a particularly useful tool for\nconsidering stakeholders such as employees, customers, shareholders, and communities. The answers to questions about what\nstakeholders will be affected and what the effects will be help build the case for or against each alternative. Often there will be competing\ninterests, or situations in which two different values are in competition. For instance, a decision to close a coal mine because coal\ncontributes to global warming may be positive for society at large, but it imposes high costs on the employees who will lose their jobs.\nDecision-tree analysis can help identify or uncover the potential impacts of alternatives so that a decision maker can select the one that is\nmost consistent with her ethical and moral beliefs.\nApplying the Decision Tree\nDecision tree analysis can be a useful tool for evaluating ethical decisions.\nLearning Objectives\nExpress decision factors in an organized and structured view, allowing for systematic, ethical, and logical decision making\nKey Takeaways\nKey Points\nDecision tree analysis can be a useful tool for evaluating choices involved in ethical decisions.\nLaying out each consideration, potential action, and potential outcome can be useful in deciding which alternative is most likely to be\nconsistent with your ethical and moral beliefs and values.\nDecision tree analysis should capture both quantitative and qualitative consequences of each alternative.\nKey Terms\nutility: In economics, utility is a representation of preferences over some set of goods and services. Preferences have a utility\nrepresentation so long as they are transitive, complete, and continuous.\ndecision tree: A visualization of a complex decision-making situation in which the possible decisions and their likely outcomes are\norganized in the form of a branched graph.\nDecision tree analysis provides a visual tool to help individuals quantify and weigh options against one another when making a decision.\nA decision tree calculates the expected values of competing alternative. This tells the decision maker which decision has the highest utility\n(i.e., is the most preferred) to the decision maker.\nDecision tree: This example of a decision tree shows\nthe decision maker trying to choose where to go on\nvacation.\nCreating a Decision Tree\nA decision tree consists of 3 types of nodes:\nDecision nodes: These are commonly represented by squares. Decision nodes are used when a decision needs to be made between at\nleast two alternatives.\nChance nodes: These may be represented by circles. Chance nodes represent points on the decision tree where there is uncertainty about\noutcomes (so there must be at least two possible outcomes represented).\nEnd nodes: These may be represented by triangles. An end node is where a decision is made and its value or utility is identified.\nApplications of Decision Trees\nDecision trees can be applied to ethical considerations. Consider an ethical dilemma involving a colleague. You are considering three\noptions: report your colleague to a superior, confront the colleague yourself, or ignore the situation completely. The top box of the\ndecision tree would state \"Colleague Dilemma.\"\nThe next three nodes would then read: \"Report colleague to superiors,\" \"Confront colleague,\" and \"Ignore situation. \" Each of these nodes\nwould then have a \"Yes\" arrow and a \"No\" arrow. For each \"Yes\" and \"No,\" you would list what the outcome would be, realizing that in\nsome cases the nodes may need to continue to account for potential outcomes, some of which may link back to previous options. For\nexample, a \"Yes\" decision arrow for \"Report colleague to superiors\" may result in the situation being taken care of—or, it could result in an\ninvestigation that would impact your standing within the company and with your peers. If you chose to ignore the colleague and his\nunethical behavior is discovered in the future, you could end up in trouble for choosing not to act earlier.\nA decision tree for a tough problem allows the decision maker to visually lay out each scenario and make a detailed consideration.\nDecision trees therefore support the evaluation process and can help clarify often-complex ethical dilemmas.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}