{
    "text": "Search... Home Subjects\nBoundless Management\nStrategic Management\nStrategic Management\nWhat is Strategy?\nA strategy is a plan of action designed to achieve a specific goal or series of goals within an organizational framework.\nLearning Objectives\nDefine strategy within the context of a business and their organizational goals\nKey Takeaways\nKey Points\nStrategic management is the process of building capabilities that allow a firm to create value for customers, shareholders, and society\nwhile operating in competitive markets.\nStrategy entails: specifying the organization 's mission, vision, and objectives; developing policies and plans to execute the vision; and\nallocating resources to implement those policies and plans.\nStrategy is largely about using internal assets to create a value-added proposition. This helps to capture opportunities in the competitive\nenvironment while avoiding threats.\nExperts in the field of strategy define the potential components of strategy and the different forms strategy can take.\nKey Terms\nstrategic management: The art and science of formulating, implementing, and evaluating cross-functional decisions that will enable an\norganization to achieve its objectives.\nbalanced scorecard: A strategic performance management tool used by managers to track the execution of activities within their control\nand monitor the consequences of these actions.\nstrategy: A plan of action intended to accomplish a specific goal.\nStrategy involves the action plan of a company for building competitive advantage and increasing its triple bottom line over the long-\nterm. The action plan relates to achieving the economic, social, and environmental performance objectives; in essence, it helps bridge the\ngap between the long-term vision and short-term decisions.\nStrategic Management\nStrategic management is the process of building capabilities that allow a firm to create value for customers, shareholders, and society\nwhile operating in competitive markets (Nag, Hambrick & Chen 2006). It entails the analysis of internal and external environments of firms\nto maximize the use of resources in relation to objectives (Bracker 1980). Strategic management can depend upon the size of an\norganization and the proclivity to change the organization's business environment.\nThe process of strategic management entails:\nSpecifying the organization's mission, vision, and objectives\nDeveloping policies and plans that are designed to achieve these objectives\nAllocating resources to implement these policies and plans\nAs an example, let's take a company that wants to expand its current operations to producing widgets. The company's strategy may\ninvolve analyzing the widget industry along with other businesses producing widgets. Through this analysis, the company can develop a\ngoal for how to enter the market while differentiating from competitors' products. It could then establish a plan to determine if the\napproach is successful.\nKeeping Score\nA balanced scorecard is a tool sometimes used to evaluate a business's overall performance. From the executive level, the primary starting\npoint will be stakeholder needs and expectations (i.e., financiers, customers, owners, etc.). Following this, inputs such as objectives,\noperations, and internal processes will be developed to achieve these expectations.\nAnother way to keep score of a strategy is to visualize it using a strategy map. Strategy maps help to illustrate how various goals are\nlinked and provide trajectories for achieving these goals.\nStrategy map: This image is an example of a strategy\nmap for a public-sector organization. It shows how\nvarious goals are linked and providing trajectories for\nachieving these goals.\nCommon Approaches to Strategy\nRichard Rumelt\nIn 2011, Professor Richard P. Rumelt described strategy as a type of problem solving. He outlined a perspective on the components of\nstrategy, which include:\nDiagnosis: What is the problem being addressed? How do the mission and objectives imply action?\nGuiding Policy: What framework will be used to approach the operations? (This, in many ways, should be the decision of a given\ncompetitive advantage relative to the competition.)\nAction Plans: What will the operations look like (in detail)? How will the processes be enacted to align with the guiding policy and address\nthe issue in the diagnosis?\nMichael Porter\nIn 1980, Michael Porter wrote that formulation of competitive strategy includes the consideration of four key elements:\nCompany strengths and weaknesses\nPersonal values of the key implementers (i.e., management or the board)\nIndustry opportunities and threats\nBroader societal expectations\nHenry Mintzberg\nHenry Mintzberg stated that there are prescriptive approaches (what should be) and descriptive approaches (what is) to strategic\nmanagement. Prescriptive schools are \"one size fits all\" approaches that designate best practices, while descriptive schools describe how\nstrategy is implemented in specific contexts. No single strategic managerial method dominates, and the choice between managerial styles\nremains a subjective and context-dependent process. As a result, Mintzberg hypothesized five strategic types:\nStrategy as plan: a directed course of action to achieve an intended set of goals; similar to the strategic planning concept\nStrategy as pattern: a consistent pattern of past behavior with a strategy realized over time rather than planned or intended (where the\nrealized pattern was different from the intent, Mintzberg referred to the strategy as emergent)\nStrategy as position: locating brands, products, or companies within the market based on the conceptual framework of consumers or\nother stakeholders; a strategy determined primarily by factors outside the firm\nStrategy as ploy: a specific maneuver intended to outwit a competitor\nStrategy as perspective: executing strategy based on a \"theory of the business\" or a natural extension of the mindset or ideological\nperspective of the organization\nExample\nA company wants to expand its current operations to produce widgets. The company's strategy may involve analyzing the widget industry\nalong with other businesses producing widgets. Through this analysis, the company can develop a goal for how to enter the market while\ndifferentiating from competitors' products. It could then establish a plan to determine if the approach is successful.\nThe Importance of Strategy\nStrategic management is critical to organizational development as it aligns the mission and vision with operations.\nLearning Objectives\nEvaluate the implications of the three key questions defining strategic planning\nKey Takeaways\nKey Points\nStrategic management seeks to coordinate and integrate the activities of the various functional areas of a business in order to achieve\nlong-term organizational objectives.\nThe initial task in strategic management is typically the compilation and dissemination of the vision and the mission statement. This\noutlines, in essence, the purpose of an organization.\nStrategies are usually derived by the top executives of the company and presented to the board of directors in order to ensure they are in\nline with the expectations of the stakeholders.\nThe implications of the selected strategy are highly important. These are illustrated through achieving high levels of strategic alignment\nand consistency relative to both the external and internal environment.\nAll strategic planning deals with at least one of three key questions: \"What do we do?\" \"For whom do we do it?\" and \"How do we excel?\" In\nbusiness strategic planning, the third question refers more to beating or avoiding competition.\nKey Terms\nboard of directors: A group of people elected by stockholders to establish corporate policies and make managerial decisions.\nmission statement: A declaration of the overall goal or purpose of an organization.\nStrategic management is critical to the development and expansion of all organizations. It represents the science of crafting and\nformulating short-term and long-term initiatives directed at optimally achieving organizational objectives. Strategy is inherently linked to\na company's mission statement and vision; these elements constitute the core concepts that allow a company to execute its goals. The\ncompany strategy must constantly be edited and improved to move in conjunction with the demands of the external environment.\nStrategy and Management\nAs a result of its importance to the business or company, strategy is generally perceived as the highest level of managerial responsibility.\nStrategies are usually derived by the top executives of the company and presented to the board of directors in order to ensure they are in\nline with the expectations of company stakeholders. This is particularly true in public companies, where profitability and maximizing\nshareholder value are the company's central mission.\nThe implications of the selected strategy are also highly important. These are illustrated through achieving high levels of strategic\nalignment and consistency relative to both the external and internal environment. In this way, strategy enables the company to maximize\ninternal efficiency while capturing the highest potential of opportunities in the external environment.\nKey Strategic Questions\nThe initial task in strategic management is to compile and disseminate the organization's vision and mission statement. These outline, in\nessence, the purpose of the organization. Additionally, they specify the organization's scope of activities. Strategic planning is the formal\nconsideration of an organization's future course, and all strategic planning deals with at least one of three key questions:\nWhat do we do?\nHow do we do it?\nHow do we excel?\nIn business-related strategic planning, the third question refers more to beating or avoiding competition.\nStrategic management is the art, science, and craft of formulating, implementing, and evaluating cross-functional decisions that will\nenable an organization to achieve its long-term objectives. It involves specifying the organization's mission, vision, and objectives;\ndeveloping policies and plans to achieve these objectives; and then allocating resources to implement the policies and plans. Strategic\nmanagement seeks to coordinate and integrate the activities of a company's various functional areas in order to achieve long-term\norganizational objectives.\nProduct improvement strategies: This strategy map illustrates an\nexample of how product improvements are designed and\nimplemented. Improvements move from the original plan, to\ndesign changes, to production modification, to deployments, to\nupgrades.\nMaking Strategy Effective\nEffective strategies must be suitable, feasible, and acceptable to stakeholders.\nLearning Objectives\nApply the three criteria for strategic efficacy identified by Johnson, Scholes and Whittington and the 11 forces that should be\nincorporated into strategic consideration as argued by Will Mulcaster\nKey Takeaways\nKey Points\nJohnson, Scholes, and Whittington suggest evaluating strategic options based on three key criteria: suitability, feasibility, and\nacceptability.\nSuitability refers to the overall rationale of the strategy and its fit with the organization 's mission.\nFeasibility refers to whether or not the organization has the resources necessary to implement the strategy.\nAcceptability is concerned with stakeholder expectations and the expected outcomes of implementing the strategy.\nWill Mulcaster provides an additional 11 strategic forces which may impact the effectiveness of a given strategy.\nKey Terms\nstrategy: A plan of action intended to accomplish a specific goal.\neffectiveness: The capability of producing a desired result.\nEffectiveness is the capability to produce a desired result. Strategy is considered effective when short-term and long-term objectives are\naccomplished and are in line with the mission, vision, and stakeholder expectations. This requires upper management to recognize how\neach organizational component combines to create a competitive operational process.\nSuitability, Feasibility, and Acceptability\nWith the above framework in mind, a number of academics have proposed perspectives on strategic effectiveness. Johnson, Scholes, and\nWhittington suggest evaluating the potential success of a strategy based on three criteria:\nSuitability deals with the overall rationale of the strategy. One method of assessing suitability is using a strength, weakness, opportunity,\nand threat (SWOT) analysis. A suitable strategy fits the organization's mission, reflects the organization's capabilities, and captures\nopportunities in the external environment while avoiding threats. A suitable strategy should derive competitive advantage(s).\nFeasibility is concerned with whether or not the organization has the resources required to implement the strategy (such as capital,\npeople, time, market access, and expertise). One method of analyzing feasibility is to conduct a break-even analysis, which identifies if\nthere are inputs to generate outputs and consumer demand to cover the costs involved.\nAcceptability is concerned with the expectations of stakeholders (such as shareholders, employees, and customers) and any expected\nfinancial and non-financial outcomes. It is important for stakeholders to accept the strategy based on the risk (such as the probability of\nconsequences) and the potential returns (such as benefits to stakeholders). Employees are particularly likely to have concerns about non-\nfinancial issues such as working conditions and outsourcing. One method of assessing acceptability is through a what-if analysis,\nidentifying best and worst case scenarios.\nSWOT ANALYSIS\nHelpful Harmful\nto achieving the objective to achieving the objective\nnigiro )noitazinagro\nStrengths Weaknesses lanretnI eht\nfo\nsetubirtta(\nnigiro )tnemnorivne\nOpportunities Threats lanretxE\neht\nfo\nsetubirtta(\nSWOT Analysis: Here is an example of\nthe SWOT analysis matrix.\nMulcaster's Managing Forces Framework\nWill Mulcaster argued that while research has been devoted to generating alternative strategies, not enough attention has been paid to\nthe conditions that influence the effectiveness of strategies and strategic decision -making. For instance, it can be seen in retrospect that\nthe financial crisis of 2008 and 2009 could have been avoided if banks had paid more attention to the risky nature of their investments.\nHowever, knowing in hindsight cannot address how banks should change the ways they make future decisions.\nMulcaster's Managing Forces Framework addresses this issue by identifying 11 forces that should be taken into account when making\nstrategic decisions and implementing strategies:\nTime\nOpposing forces\nPolitics\nPerception\nHolistic effects\nAdding value\nIncentives\nLearning capabilities\nOpportunity cost\nRisk\nStyle\nWhile this is quite a bit to consider, the key is to be as circumspect as possible when analyzing a given strategy. In many ways it is similar\nto the potential issues a scientist faces. A scientist must always be objective and conduct experiments without a bias toward a specific\noutcome. Scientists don't prove something to be true; they test hypotheses. Similarly, strategists must not create a strategy to get to an\nend point; they must instead create a series of likely endpoints based on organizational inputs and operational approaches. Uncertainty is\nkey, allowing strategic improvement for higher efficacy.\nExample\nA firm may perform a break-even analysis to determine if a strategy is feasible. The break-even point (BEP) is the point at which costs or\nexpenses and revenue are equal: there is no net loss or gain, so the company has \"broken even.\" For example, if a business sells fewer\nthan 200 tables each month, it will make a loss; if it sells more, it will make a profit. With this information, managers could determine if\nthey expected to be able to make and sell 200 tables per month and then implement a strategy that is in accordance with their\nprojections.\nDifferences Between Strategic Planning at Small Versus Large Firms\nThe effectiveness of a strategy is heavily dependent upon the size of the organization.\nLearning Objectives\nApply the size of a firm to the basic strategic management theories\nKey Takeaways\nKey Points\nSize is highly relevant to organizational strategy and structure, and understanding the influencing factors is important for management to\nelect optimal strategic plans.\nA global or transnational organization may employ a more structured strategic management model due to its size, scope of operations,\nand need to encompass stakeholder views and requirements.\nA small or medium enterprise may employ an entrepreneurial approach due to its comparatively smaller size and scope of operations and\nits limited access to resources.\nSmaller firms also tend to focus more on differentiation due to an inability to achieve scale economies. Similarly, larger firms tend to have\nmore cost-sensitive strategic capabilities.\nNo single strategic managerial method dominates, and the choice of managerial style remains a subjective and context-dependent\nprocess.\nKey Terms\nentrepreneurial: Having the spirit, attitude or qualities of a person who organizes and operates a business venture.\nstructured interview: A quantitative research method commonly employed in survey research where each potential employee is asked\nthe same questions in the same order.\nstructured: The state of being organized.\nStrategic management can depend on the size of an organization and the proclivity of change in its business environment. In the U.S., an\nSME (small and medium enterprise) refers to an organization with 500 employees or less, while an MNE (multinational enterprise) refers\nto a global organization with a much larger operational scope. Size is highly relevant to organizational strategy and structure, and\nunderstanding the influencing factors is important for management to elect optimal strategic plans.\nStrategic Management in Large Organizations\nMNEs (multinational enterprises) may employ a more structured strategic management model due to its size, scope of operations, and\nneed to encompass stakeholder views and requirements. MNEs are tasked with aligning complex and often dramatically different\nprocesses, demographic considerations, employees, legal systems, and stakeholders. Due to the wide variance and high volume of\nbusiness, upper management needs stringent control systems embedded in the managerial strategy to enable predictability and\nconformity to mission, vision, and values.\nFor example, McDonald's operates restaurants all over the globe. They have different menus in China than in France due to differing\nconsumer tastes. They also have different hiring standards, regulations, and sourcing methods. How does management create a strategy\nthat doesn't confine these geographic regions (and lose localization ) yet still maintains each region's alignment with the mission, vision,\nand branding of McDonald's?\nLow-cost Strategy\nIdeally, McDonald's can construct careful strategic models and systems which control the critical components of the operations without\nhindering the localization. From a strategic point of view, this involves creating a system of quality control, reporting, and localization that\nmaintains the competitive advantage of scale economies and strong branding. Large firms such as McDonald's often achieve better scale\neconomies and thus can pursue low-cost strategies. This requires enormous managerial competency with meticulously crafted strategies\nat various levels in the organization (including corporate, functional, and regional).\nStrategic Management in Small Firms\nSMEs (small and medium enterprises) may employ an entrepreneurial approach due to its comparatively smaller size and scope of\noperations and limited access to resources. A smaller organization needs to be agile, adaptable, and flexible enough to develop new\nstrengths and capture niche opportunities within a competitive industry with bigger players. This requires fluidity in strategy while\nsimultaneously maintaining a predetermined vision and mission statement.\nAchieving this requires a great deal of balance; it often requires a strategy that is created to enable multiple paths to the same objectives.\nSmall firm strategies often incorporate flexibility to capture new opportunities as they arise, as opposed to maintaining an already well-\nestablished competitive advantage.\nDifferentiation\nIn most cases, low-cost strategies require substantial economies of scale. Because of this constraint, smaller firms most often use\ndifferentiation strategies that focus on innovation over efficiency. Enabling creativity and innovation is strategically difficult to do as it\nrequires a hands-off approach that empowers autonomy over structure. Innovate ideas are primarily trial and error, and so instilling\ncreativity into a strategic process is also a high-risk approach.\nExample of a strategy map: This image is an example of a\nstrategy map that organizes a firm's stakeholder interests. You\ncan see the firm's three main goals across the top (corporate\ncitizenship, capital efficiency, and network efficiency) and the\ncategories of potential actions down the left (learning innovation,\ninternal action, customer action, and financial action).\nThe Impact of External and Internal Factors on Strategy\nAnalysis of both internal factors and external conditions is central to creating effective strategy.\nLearning Objectives\nExamine the discrepancies between internal proficiency and external factors to capture strategic value\nKey Takeaways\nKey Points\nStrategic management is the managerial responsibility to achieve competitive advantage through optimizing internal resources while\ncapturing external opportunities and avoiding external threats.\nWhile different businesses have different internal conditions, it is easiest to view these potential attributes as generalized categories. A\nvalue chain is a common tool used to accomplish this.\nA value chain identifies the supporting activities (employee skills, technology, infrastructure, etc.) and the primary activities (acquiring\ninputs, operations, distribution, sales, etc.) that can potentially create profit.\nThe external environment is even more diverse and complex than the internal environment, and there are many effective models to\ndiscuss, measure, and analyze it (i.e., Porter's Five Force, SWOT Analysis, PESTEL framework, etc.).\nWith both the internal value chain and external environment in mind, upper management can reasonably derive a set of strategic\nprinciples which internally leverage strengths and externally capture opportunities to create profits.\nKey Terms\nanalysis: The process of breaking down a substance into its constituent parts, or the result of this process.\nStrategic management is the managerial responsibility to achieve competitive advantage through optimizing internal resources while\ncapturing external opportunities and avoiding external threats. This requires carefully crafting a structure, series of objectives, mission,\nvision, and operational plan. Recognizing the way in which internally developed organizational attributes will interact with the external\ncompetitive environment is central to successfully implementing a given strategy —and thus creating profitability.\nInternal Conditions\nThe internal conditions are many and varied depending on the organization (just as the external factors in any given industry will be).\nHowever, management has some strategic control over how these various internal conditions interact. The achievement of synergy in this\nprocess derives competitive advantage. While different businesses have different internal conditions, it is easiest to view these potential\nattributes as generalized categories.\nA value chain is a common tool used to identify each moving part. It is a useful mind map for management to fill in during the derivation\nof internal strengths and weakness. A value chain includes supports activities and primary activities, each with its own components.\nSupports Activities\nFirm infrastructure: the organizational structure, mission, hierarchy and upper management\nHuman resource management: the skills embedded in the organization through human resources\nTechnology: the technological strengths and weaknesses (such as patents, machinery, IT, etc.)\nProcurement: a measure of assets, inventory, and sourcing\nPrimary Activities\nInbound logistics: deriving inputs for operational process\nOperations: running inputs through organizational operations\nOutbound logistics: shipping, warehousing, and inventorying final products\nMarketing and sales: building a brand, selling products, and identifying retail strategies and opportunities\nService: following up with customers to ensure satisfaction, provide and fulfill warranties, etc.\nMichael Porter's value chain: This model, created by\nMichael Porter, demonstrates how support and primary\nactivities add up to potential margins (and potential\ncompetitive advantage). Support activities include HR\nmanagement and technology; primary activities include\noperations, marketing and sales, and service.\nExternal Opportunities and Threats\nThe external environment is even more diverse and complex than the internal environment. There are many effective models to discuss,\nmeasure, and analyze the external environment (such as Porter's Five Force, SWOT Analysis, PESTEL framework, etc.). For the sake of this\ndiscussion, we will focus on the following general strategic concerns as they pertain to opportunities and threats:\nMarkets (customers): Demographic and socio-cultural considerations, such as who the customers are and what they believe, are critical to\ncapturing market share. Understanding the needs and preferences of the markets is essential to providing something that will have a\ndemand.\nCompetition: Knowing who else is competing and how they are strategically poised is also key to success. Consider the size, market share,\nbranding strategy, quality, and strategy of all competitors to ensure a given organization can feasibly enter the market.\nTechnology: Technological trajectories are also highly relevant to success. Does the manufacturing process of the product have new\ntechnologies which are more efficient? Has a disruptive technology filled the need that was currently being filled?\nSupplier markets: Suppliers have great power as they control the necessary inputs to an organization's operational process. For example,\nsmartphones require rare earth materials; if these materials are increasingly scarce, the price points will rise.\nLabor markets: Acquiring key talent and satisfying employees (relative to the competition) is critical to success. This requires an\nunderstanding of unions and labor laws in regions of operation.\nThe economy: Economic recessions and booms can change spending habits drastically, though not always as one might expect. While\nmost industries suffer during recession, some industries thrive. It is important to know which economic factors are opportunities and\nwhich are threats.\nThe regulatory environment: Environmental regulations, import/export tariffs, corporate taxes, and other regulatory concerns can poise\nhigh costs on an organization. Integrating this into a strategy ensures feasibility.\nWhile there are many other external considerations one could take into account during the strategic planning process, this list gives a\ngood outline of what must be considered in order to minimize unexpected threats or missed opportunities.\nStrategic Analysis\nWith both the internal value chain and external environment in mind, upper management can reasonably derive a set of strategic\nprinciples that internally leverage strengths while externally capturing opportunities to create profits—and hopefully advantages over the\ncompetition.\nCompetitive and cooperative forces: This chart diagrams the\nexternal factors that should be considered when analyzing a firm's\nstrategy. Competitive and cooperative forces include rivals, new\nentrants, suppliers, and retailers; business factors include resources\nand capabilities.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}