{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nProcess and Motivation\nEquity Theory\nEquity theory explains the relational satisfaction in terms of fair or unfair distribution of resources within interpersonal relationships.\nLearning Objectives\nDiscuss equity theory and its motivational implications at the organizational level\nKey Takeaways\nKey Points\nEquity theory proposes that individuals who perceive themselves as either under-rewarded or over-rewarded will experience distress, and\nthat this distress leads to efforts to restore equity within the relationship.\nIf an employee feels underpaid, then that employee will experience hostility towards the organization and perhaps co-workers, which may\nresult in the employee's diminished performance.\nWhen individuals find themselves participating in inequitable relationships, they become distressed.\nManagers must monitor their employees' earnings, discuss this with their superiors, assess efficacy, and provide intangible rewards.\nKey Terms\nequitable: Marked by or having equity.\nequity theory: An attempt to explain relational satisfaction in terms of perceptions of fair or unfair distribution of resources within\ninterpersonal relationships.\nMotivated by Equity\nEquity theory attempts to explain relational satisfaction in terms of perceptions of fair or unfair distributions of resources within\ninterpersonal relationships. Regarded as one of many theories of justice, equity theory was first developed in 1963 by John Stacey Adams.\nAdams, a workplace and behavioral psychologist, asserted that employees seek to maintain equity between what they put into a job and\nwhat they receive from it against the perceived inputs and outcomes of others.\nEquity theory posits that people value fair treatment, which motivates them to maintain a similar standard of fairness with their co-\nworkers and the organization. According to the theory, equity structure in the workplace is based on the ratio of inputs (employee\ncontributions) to outcomes (salary and other rewards).\nImbalances\nEquity theory proposes that individuals who perceive themselves as either under-rewarded or over-rewarded will experience distress, and\nthat this distress leads to efforts to restore equity within the relationship. Equity theory focuses on determining whether the distribution\nof resources is fair to both relational partners. Equity is measured by comparing the ratios of contributions and benefits of each person\nwithin the relationship. Partners do not have to receive equal benefits (such as receiving the same amount of love, care, and financial\nsecurity) or make equal contributions (such as investing the same amount of effort, time, and financial resources), as long as the ratio\nbetween these benefits and contributions is similar.\nMuch like other prevalent theories of motivation, such as Maslow's hierarchy of needs, equity theory acknowledges that subtle and\nvariable individual factors affect individuals' assessment and perception of their relationship with their relational partners. According to\nAdams, underpayment inequity induces anger, while overpayment induces guilt. Compensation, whether hourly or salaried, is a central\nconcern for employees and therefore the cause of equity or inequity in most, but not all, cases.\nThe Employee/Organization Relationship\nIn any position, employees wants to feel that their contributions and work performance are being rewarded with fair pay. An employee\nwho feels underpaid may experience feelings of hostility towards the organization and perhaps co-workers. This hostility may lead to the\nemployee under-performing and could cause job dissatisfaction in others.\nSubtle or intangible compensation also plays an important role in feelings about equity. Receiving recognition for strong job performance\nand being thanked can create employee satisfaction, and therefore help the employee feel worthwhile, resulting in better outcomes for\nboth the individual and the organization.\nWhen individuals find themselves participating in inequitable relationships, they become distressed. The more inequitable the\nrelationship, the more distress individuals feel.\nThe Role of Management\nDepending upon the organizational structure and its distribution of authority, the decision to provide monetary compensation for a\nstrong work deliverable is not always in the hands of an employee's direct manager. As a result, managers must monitor their direct\nreports' earnings, discuss this with their superiors, assess efficacy, and provide intangible rewards (such as recommendations, gratitude,\nauthority, new projects, etc.). Creating and maintaining equity is a responsibility of all managers.\nAssessing and Restoring Equity\nThe assessment and restoration of equity helps improve employee performance and organizational behavior.\nLearning Objectives\nDistinguish the core components of equity theory that seek to measure equity accurately and restore equity when appropriate\nKey Takeaways\nKey Points\nEquity theory proposes that individuals who perceive themselves as either under-rewarded or over-rewarded will experience distress, and\nthis distress leads to efforts to restore equity within the relationship.\nIndividuals consider themselves treated fairly if they perceive the ratio of their own inputs to outcomes to be equivalent to those around\nthem.\nIn any position, employees want to feel that their contributions and work performance are being fairly rewarded. If this is not the case,\nmanagement must intervene and either renegotiate or replace dissatisfied individuals.\nKey Terms\norganization: A group of people or other legal entities with an explicit purpose and written rules.\nhuman resources: The personnel department of an organization, dealing with the recruitment, administration, management and training\nof employees.\nOrganizational Behavior\nSimilar to human resources management, organizational behavior management (OBM) is an important aspect of management. OBM\napplies psychological principles of organizational behavior and the experimental analysis of behavior to organizations to improve\nindividual and group performance. The areas of application may include: systems analysis, management, and training and performance\nimprovement. Equity theory plays a role in analyzing organizational behavior.\nDefinition of Equity Theory\nEquity theory suggests that individuals who perceive themselves as either under-rewarded or over-rewarded will experience distress, and\nthat this distress leads to efforts to restore equity within the relationship. The theory focuses on determining whether the distribution of\nresources is fair to both relational partners. Equity is measured by comparing the ratios of contributions and benefits of each person\nwithin the relationship.\nEquity theory: The core concept of equity theory amounts\nto each party's inputs and outcomes equating.\nAssessing Equity\nIndividuals consider themselves treated fairly when they perceive the ratio of their inputs to outcomes to be equivalent to those around\nthem. In practice, all else being equal, this means an employee would find it acceptable for a more senior colleague to receive higher\ncompensation, since the value of the senior employee's experience (and input) is higher. Employee job satisfaction often relies on\ncomparisons with their co-workers.\nIf an employee observes another employee receive more recognition and rewards for contributions—even when both have performed the\nsame amount and quality of work—the employee who receives fewer rewards will experience dissatisfaction. That employee may feel\nunder-appreciated as a consequence. Equity theory proposes that rewards (outcomes) should be directly related to the quality and\nquantity of employees' contributions (inputs). If both employees in this situation receive the same reward, the workforce is more likely to\nrecognize that the organization is fair, observant, and appreciative.\nManagers are tasked with assessing equity: identifying both the quantity and quality of a given individual's inputs and comparing that to\nhis or her overall compensation. Managers are also responsible for discussing this situation with their subordinates, ensuring that they\nfeel their contributions are being matched by their salary and other forms of compensation. While this concern also falls within the human\nresources frame, the manager is more directly involved with employee's actual contributions (and thus more accurate in assessing value).\nRestoring Equity\nIn any position, employees want to feel that their contributions and work performance are being fairly compensated. If this is not the case,\nmanagement must intervene and either renegotiate or replace the dissatisfied individual. Workers have a right to be compensated in a\nmanner that reflects their value; if they are not, then management must restore this equity or risk losing valuable talent.\nOrganizations can ensure collective rewards are maximized through the use of accepted systems for equitably rewarding members.\nSystems of equity will evolve within groups, and members must encourage other members to accept and adhere to these systems. The\nonly way groups can ensure equitable practices are observed is by making it more profitable to behave equitably than inequitably. Thus,\nan organization will generally reward members who treat others equitably and generally punish (increase the cost for) members who treat\nothers inequitably.\nExpectancy Theory\nExpectancy theory deals with mental processes regarding choices and behaviors.\nLearning Objectives\nAnalyze Vroom's expectancy theory to assess the accuracy and effectiveness of motivating based upon expectancy, instrumentality, and\nvalence\nKey Takeaways\nKey Points\nExpectancy theory proposes that individuals decide to act in a certain way because they are motivated to select a behavior over other\nbehaviors based on their expectation of the result.\nThe individual chooses based on estimates of how well the expected results of a given behavior are going to match up with the desired\nresults.\nExpectancy theory explains the behavioral process of why individuals are motivated to choose one behavioral option over another. It also\nexplains how they make decisions to achieve the outcome that they perceive as most valuable.\nKey Terms\ninstrumentality: The quality or condition of serving a purpose, being useful.\nexpectancy theory: A framework that holds that people decide to act in a certain way because they are motivated to select a specific\nbehavior over other behaviors based on the expected result.\nvalence: A one-dimensional value assigned to an object, situation, or state that can usually be positive or negative.\nOverview\nExpectancy theory is about the mental processes involved in making choices. In organizational behavior, expectancy theory embraces\nVictor Vroom's definition of motivation. Vroom proposed that a person decides to behave in a certain way, selecting one behavior over\nother behaviors, based on the expected result of the selected behavior. For example, people will be willing to work harder if they think the\nextra effort will be rewarded.\nIn essence, the motivation behind chosen behavior is determined by the desirability of the expected outcome. At the theory's core is the\ncognitive process of how an individual processes the different motivational elements. Processing is done before an individual makes the\nfinal choice. The expected result, therefore, is not the sole determining factor in the decision of how to behave because the person has to\npredict whether or not the expectation will be fulfilled.\nVroom's Expectancy Theory\nIn 1964, Vroom defined motivation as a process controlled by the individual that governed choices among alternative forms of voluntary\nactivities. Individuals make choices based on estimates of how well the expected results of a given behavior are going to match up with or\neventually lead to the desired results.\nIn Vroom's analysis, the basis for motivation is threefold:\nthe individual's expectancy that effort will lead to the intended performance\nthe instrumentality of this performance in achieving a certain result\nthe desirability of the result (known as valence ) to the individual\nVroom introduces three variables within his expectancy theory: valence (V), expectancy (E), and instrumentality (I). These three elements\nalso have clearly defined relationships: effort-performance expectancy (E>P expectancy), performance-outcome expectancy (P>O\nexpectancy).\nThese three components of expectancy theory (expectancy, instrumentality, and valence) fit together in this fashion:\nExpectancy: Effort → Performance (E→P)\nInstrumentality: Performance → Outcome (P→O)\nValence: V(O)\nEffort → Performance (E→P): Expectancy is the belief that an effort (E) will result in attainment of desired performance (P) goals. Usually,\nthis belief is based on an individual's past experience, self-confidence, and the perceived difficulty of the performance standard or goal.\nFactors associated with the individual's expectancy perception are competence, goal difficulty, and control.\nPerformance → Outcome (P→O): Instrumentality is the belief that a person will receive a desired outcome (O) if the performance\nexpectation is met. This outcome may come in the form of a pay increase, promotion, recognition, or sense of accomplishment.\nInstrumentality is low when the outcome is the same for all possible levels of performance.\nV(O): Valence is the value individuals place on outcomes (O) based on their needs, goals, values, and sources of motivation. Factors\nassociated with the individual's valence are values, needs, goals, preferences, sources of motivation, and the strength of an individual's\npreference for a particular outcome.\nImplications\nExpectancy theory can help managers understand how individuals are motivated to choose among various behavioral alternatives. To\nenhance the connection between performance and outcomes, managers should use systems that tie rewards very closely to performance.\nManagers also need to ensure that the rewards provided are deserved and wanted by the recipients. To improve the connection between\neffort and performance, managers should use training to improve employee capabilities and help employees believe that added effort will\nin fact lead to better performance.\nGoal-Setting Theory\nPeople perform better when they are committed to achieving certain goals, enabling businesses to benefit from employing goal-setting\ntheory.\nLearning Objectives\nApply goal-setting theory to the process and motivation considerations inherent in organizational behavior and business procedure\nKey Takeaways\nKey Points\nStudies of goal -setting suggest that it is an effective tool for making progress, as long as managers ensure that participants are clearly\naware of what is expected from them.\nGoals that are difficult to achieve and specific tend to increase performance more than goals that are not.\nOn a personal level, setting goals helps people work towards their own objectives (most commonly, financial or career-based goals).\nManagers should not constantly drive motivation, or keep track of an employee's work on a continuous basis. Instead, they should use\ngoals, which have the ability to function as a self-regulatory mechanism.\nManagers should also keep track of performance to allow employees to see how effective they have been in attaining their goals.\nKey Terms\nmotivation: Willingness of action, especially in behavior.\nproductivity: The rate at which goods or services are produced by a standard population of workers.\nOverview\nPeople perform better when they are committed to achieving certain goals. Factors that ensure commitment to goals include:\nThe importance of the expected outcomes of goal attainment\nSelf-efficacy, or belief that the goal can be achieved\nPromises or engagements to others, which can strengthen level of commitment\nAim for the goal: Goal-setting is closely tied\nto performance. Those who set realistic but\nchallenging goals are likely to perform better\nthan those who do not.\nGoal-setting is a key component of performance in a business setting, but certain principles apply. Goals that are difficult to achieve and\nspecific tend to increase performance more than goals that are not. A goal can become more specific by attaching a quantity to it (for\nexample, \"increase productivity by 50 percent\") or by defining certain tasks that must be completed.\nGoals in Business (Motivation)\nManagers cannot constantly drive motivation, or keep track of an employee's work on a continuous basis. Goals are therefore an\nimportant tool for managers, because goals have the ability to function as a self-regulatory mechanism that gives an employee a certain\namount of guidance. Shalley, Locke, and Latham have identified four ways goal-setting can affect individual performance:\nGoals focus attention toward goal-relevant activities and away from goal-irrelevant activities.\nGoals serve as an energizer. Higher goals induce greater effort, while low goals induce lesser effort.\nGoals affect persistence.\nGoals activate cognitive knowledge and strategies that help employees cope with the situation at hand.\nLocke et al. examined the behavioral effects of goal-setting, concluding that 90 percent of laboratory and field studies involving specific\nand challenging goals led to higher performance than those involving easy or no goals. While some managers believe it is sufficient to\nurge employees to \"do their best,\" Locke and Latham have a contrasting view. They propose that people who are told to \"do their best\"\ngenerally do not. To elicit some specific form of behavior from another person requires giving the person a clear view of what is expected.\nA goal is therefore vital, as it helps an individual focus his or her efforts in a specific direction.\nHowever, when management merely dictates goals, employee motivation to meet these goals is diminished. To increase motivation,\nemployees should participate in the goal-setting process.\nGoals and Feedback\nManagers should track performance so that employees can see how effective they have been in attaining their goals. Without proper\nfeedback channels, employees find it impossible to adapt or adjust their behavior. Goal-setting and feedback go hand-in-hand. Without\nfeedback, goal-setting is unlikely to work.\nProviding feedback on short-term objectives helps to sustain an employee's motivation and commitment to a goal. When giving\nfeedback, managers should:\nCreate a positive context\nUse constructive and positive language\nFocus on behaviors and strategies\nTailor feedback to the needs of the individual worker\nMake feedback a two-way communication process\nSetting the Right Goals\nPeople perform better when they are committed to achieving certain goals, emphasizing the importance of strategic goal setting.\nLearning Objectives\nExamine the inherent motivational value in setting meaningful goals and objectives in the organizational behavior frame\nKey Takeaways\nKey Points\nSetting goals is a process that requires buy-in from both the management and employee; it is best executed using tools such as goal-\nsetting theory.\nThe SMART model illustrates the goal-setting aims, where objectives are identified and pursued through being specific, measurable,\nachievable, realistic, and time-oriented.\nAccording to Locke and Latham, the effectiveness of goal setting can be explained by two aspects of Temporal Motivation Theory (TMT):\nthe principle of diminishing returns and temporal discounting.\nCombining Locke and Latham's perspective with SMART goal setting, individuals should focus on taking small steps towards larger\nobjectives through specific, measurable, attainable, realistic, and timely goals.\nKey Terms\nquantitatively: Measurable numerically; demonstrated through numbers.\ndiminishing returns: A condition in which additional inputs into an organization, project, or process produce progressively fewer or\nlower-quality outputs and may decrease the total quantity or quality of outputs.\nIntroduction to Goal Setting\nGoal setting involves establishing specific, measurable, achievable, realistic and time-targeted (SMART) goals. Work on the theory of goal-\nsetting suggests that it is an effective tool for progress, primarily through ensuring that participants in a group with a common goal are\nclearly aware of what is expected from them (and able to measure it). On a personal level, setting goals helps people work towards their\nown objectives—most commonly financial or career-based goals.\nGoal setting and achievement: Athletes set goals\nduring the training process. Through choice, effort,\npersistence, and cognition, they can prepare to\ncompete.\nSMART Goals\nSetting goals requires both the foresight to perceive future obstacles and a scale in which to measure and benchmark progress. Setting\neffective goals and identifying the the appropriate way in which to pursue these goals are both important elements of successfully\nimplementing an effective motivational strategy. The SMART method for goal setting effectively summarizes the necessary steps to take\nwhen setting objectives:\nSpecific: Establishing the appropriate scope of goals is difficult, and it is important to be as specific as possible to ensure successful\nimplementation.\nMeasurable: The ability to measure and assess progress quantitatively is useful in goal setting, as it provides motivational checkpoints and\nensures progress stays on track.\nAchievable: Ensuring goals are achievable is important in successfully pursuing goals. People have a natural tendency to challenge\nthemselves, but it is important to stay within the confines of ability.\nRealistic: Similar to achievable, realistic goal setting requires a grounded approach of identifying tangible, results-oriented objectives.\nTime-targeted: Establishing deadlines is essential for goals, particularly from a motivational perspective. Knowing the time frame necessary\nin which to complete the goal is important in ensuring the end product will be useful and relevant to the business.\nDeriving Goal Setting from Temporal Motivation Theory\nLocke and Latham note that goal-setting theory lacks \"the issue of time perspective.\" Taking this into consideration, Steel and Konig use\nTemporal Motivation Theory (TMT) to account for goal-setting's effects and suggest new hypotheses regarding two moderators: goal\ndifficulty and proximity.\nMotivation over Time\nThe idea of time perspective is simpler than it sounds. Take an example of a university student who has 30 days to study for a final exam.\nOn day 1, when the exam is still a month away, the student does not feel the time motivation very strongly. They are much more likely to\nchoose an activity that is more enjoyable than studying. However, as the test approaches, the student will increasingly tend to choose\nstudying due to the time perspective.\nLarger Objectives vs. Series of Smaller Objectives\nWith this example in mind, it seems logical that structuring a project based on a series of smaller goals with closer deadlines rather than\non one faraway end goal is likely to be more motivating. This is also supported by the idea of diminishing returns, which posits that for\neach unit of investment (be it a minute of time or a dollar) into a given process, less output will be produced. Therefore, combining a\nseries of small objectives (processes) will be more motivating, causing less output to be lost to diminishing returns over time. It is related\nto the expression \"the sum of the parts can be greater than the whole.\"\nSMART Goal-Setting and TMT\nTMT (which draws from these two theories of time perspective and diminishing returns) and SMART goal setting together therefore tell us\nthat to maximize motivation and therefore output, managers should divide projects into several more immediate, specific, and realistic\nsub-goals.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}