{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nStress in Organizations\nDefining Stress\nStress is defined in terms of its physical and physiological effects on a person, and can be a mental, physical, or emotional strain.\nLearning Objectives\nDefine stress within the field of organizational behavior and workplace dynamics\nKey Takeaways\nKey Points\nDifferences in individual characteristics, such as personality and coping skills, can be very important predictors of whether certain job\nconditions will result in stress.\nStress-related disorders include a broad array of conditions, including psychological disorders and other types of emotional strain,\nmaladaptive behaviors, cognitive impairment, and various biological reactions – each of which can eventually compromise a person's\nphysical health.\nCategories of work demands that may cause stress include task demands, role demands, interpersonal demands, and physical demands.\nKey Terms\nstress: Mental, physical, or emotional strain caused by a demand that challenges or exceeds the individual's coping ability.\nStress\nStress: A black and white photo of a woman that\ncaptures her high level of stress.\nStress is defined in terms of how it impacts physical and psychological health; it includes mental, physical, and emotional strain. Stress\noccurs when a demand exceeds an individual's coping ability and disrupts his or her psychological equilibrium. Stress occurs in the\nworkplace when an employee perceives a situation to be too strenuous to handle, and therefore threatening to his or her well-being.\nStress at Work\nWhile it is generally agreed that stress occurs at work, views differ on the importance of worker characteristics versus working conditions\nas its primary cause. The differing viewpoints suggest different ways to prevent stress at work. Different individual characteristics, like\npersonality and coping skills, can be very important predictors of whether certain job conditions will result in stress. In other words, what\nis stressful for one person may not be a problem for someone else.\nStress-related disorders encompass a broad array of conditions, including psychological disorders (e.g., depression, anxiety, post-\ntraumatic stress disorder) and other types of emotional strain (e.g., dissatisfaction, fatigue, tension), maladaptive behaviors (e.g.,\naggression, substance abuse), and cognitive impairment (e.g., concentration and memory problems). Job stress is also associated with\nvarious biological reactions that may ultimately lead to compromised physical health, such as cardiovascular disease.\nCategories of Work Stress\nFour categories of stressors underline the different causal circumstances for stress at work:\nTask Demands - This is the sense of not knowing where a job will lead you and whether the activities and tasks will change. This\nuncertainty causes stress that manifests itself in feelings of lack of control, concern about career progress, and time pressures.\nRole Demands - Role conflict happens when an employee is exposed to inconsistent or difficult expectations. Examples include: interole\nconflict (when there are two or more expectations or separate roles for one person), intrarole conflict (varying expectations of one role),\nperson-role conflict (ethics are challenged), and role ambiguity (confusion about their experiences in relation to the expectations of\nothers).\nInterpersonal Demands - Examples include: emotional issues (abrasive personalities, offensive co-workers), sexual harassment (directed\nmostly toward women), and poor leadership (lack of management experience, poor style, cannot handle having power).\nPhysical Demands - Many types of work are physically demanding, including strenuous activity, extreme working conditions, travel,\nexposure to hazardous materials, and working in a tight, loud office.\nCauses of Workplace Stress\nWork stress is caused by demands and pressure from both within and outside of the workplace.\nLearning Objectives\nEvaluate the role of work conditions, economic factors, and organizational social dynamics in the experience of stress in the workplace\nKey Takeaways\nKey Points\nJob stress can result from interactions between the worker and the conditions of the work. This can include factors such as long work\nhours and an employee's status in the organization.\nEconomic factors that employees are facing in the 21st century, such as company layoffs in response to economic conditions, have been\nlinked to increased stress levels.\nUncertainty around the future of one's job, lack of clarity about responsibilities, inconsistent or difficult expectations, interpersonal issues\nbetween workers, and physical demands of the work can also impact stress levels.\nNon-work demands, such as personal or home demands, can also contribute to stress both inside and outside of work.\nKey Terms\nstress: Mental, physical, or emotional strain due to a demand that exceeds an individual's coping ability.\nWork-Related Stress\nProblems caused by stress have become a major concern to both employers and employees. Symptoms of stress can manifest both\nphysiologically and psychologically. Work-related stress is typically caused by demands and pressure from either within or outside of the\nworkplace; it can be derived from uncertainty over where the job will take the employee, inconsistent or difficult expectations,\ninterpersonal issues, or physical demands.\nAlthough the importance of individual differences cannot be ignored, scientific evidence suggests that certain working conditions are\nstressful to most people. Such evidence argues that working conditions are a key source of job stress and job redesign should be used as\na primary prevention strategy.\nStudies of Work-Related Stress\nLarge-scale surveys of working conditions—including conditions recognized as risk factors for job stress—were conducted in member\nstates of the European Union in 1990, 1995, and 2000. Results showed a time-related trend that suggested an increase in work intensity.\nIn 1990, the percentage of workers reporting that they worked at high speeds for at least one-quarter of their working time was 48%; this\nincreased to 54% in 1995 and 56% in 2000. Similarly, 50% of workers reported that they worked against tight deadlines at least one-\nfourth of their working time in 1990; this increased to 56% in 1995 and 60% in 2000. However, no change was noted in the period from\n1995 to 2000 in the percentage of workers reporting sufficient time to complete tasks (data was not collected in 1990 for this category).\nA substantial percentage of Americans work very long hours. By one estimate, more than 26% of men and more than 11% of women\nworked 50 hours or more per week (outside of the home) in 2000. These figures represent a considerable increase over the previous three\ndecades—especially for women. According to the Department of Labor, there has been an upward trend in hours worked among\nemployed women, an increase in work weeks of greater than forty hours by men, and a considerable increase in combined working hours\namong working couples, particularly couples with young children.\nPower and Stress\nA person's status in the workplace can also affect levels of stress. Stress in the workplace has the potential to affect employees of all\ncategories, and managers as well as other kinds of workers are vulnerable to work overload. However, less powerful employees (those\nwho have less control over their jobs) are more likely to experience stress than employees with more power. This indicates that authority\nis an important factor complicating the work stress environment.\nEconomics and Stress\nEconomic factors that employees are facing in the 21st century have been linked to increased stress levels as well. Researchers and social\ncommentators have pointed out that advances in technology and communications have made companies more efficient and more\nproductive than ever before. This increase in productivity has resulted in higher expectations and greater competition, which in turn place\nmore stress on employees.\nThe following economic factors can contribute to workplace stress:\nPressure from investors who can quickly withdraw their money from company stocks\nLack of trade and professional unions in the workplace\nInter-company rivalries caused by global competition\nThe willingness of companies to swiftly lay off workers to cope with changing business environments\nSocial Interactions and Stress\nBullying in the workplace can also contribute to stress. Workplace bullying can involve threats to an employee's professional or personal\nimage or status, deliberate isolation, or giving an employee excess work.\nAnother type of workplace bullying is known as \"destabilization.\" Destabilization can occur when an employee is not given credit for their\nwork or is assigned meaningless tasks. In effect, destabilization can create a hostile work environment for employees, negatively affecting\ntheir work ethic and therefore their contributions to the organization.\nStress Outside of the Workplace\nNon-work demands can create stress both inside and outside of work. Stress is inherently cumulative, and it can be difficult to separate\nour personal and professional stress inducers. Examples of non-work stress that can be carried into the workplace include:\nHome demands: Relationships, children, and family responsibilities can add stress that is hard to leave behind when entering the\nworkplace. The Academy of Management Journal states that this constitutes \"an individual's lack of personal resources needed to fulfill\ncommitments, obligations, or requirements.\"\nPersonal demands: Personal demands are brought on by the person when he or she takes on too many responsibilities, either inside or\noutside of work.\nConsequences of Workplace Stress\nStress can impact an individual mentally and physically and so can decrease employee efficiency and job satisfaction.\nLearning Objectives\nRecognize the potentially severe consequences of work-related stress on an individual, particularly over time\nKey Takeaways\nKey Points\nProblems at work are more strongly associated with health complaints than any other life stressor.\nParticipation problems such as absenteeism, tardiness, strikes, and turnover take a severe toll on a company.\nIndividual distress manifests in three basic forms: psychological disorders, medical illnesses, and behavioral problems.\nWhen individual workers within an organization suffer from a high degree of stress, overall efficiency can substantially decrease. Stressed\nworkers will ultimately foster a negative culture and show reduce operational capabilities.\nKey Terms\nstress: Mental, physical, or emotional strain due to a demand that exceeds an individual's ability to cope.\npsychosomatic: Pertaining to physical diseases or symptoms that have psychological causes.\nStress\nSymptoms of stress: Stress can manifest as\nvarious symptoms affecting one's body,\nmind, behavior, and/or emotions.\nNegative or overwhelming work experiences can cause a person substantial distress. Burnout, depression, and psychosomatic disorders\nare particularly common outcomes of work-related stress. In general, individual distress manifests in three basic forms: psychological\ndisorders, medical illnesses, and behavioral problems.\nPsychological Disorders\nPsychosomatic disorders are a type of psychological disorder. They are physical problems with a psychological cause. For example, a\nperson who is extremely anxious about public speaking might feel extremely nauseated or may find themselves unable to speak at all\nwhen faced with the prospect of presenting in front of a group. Since stress of this type is often difficult to notice, managers would\nbenefit from carefully monitoring employee behavior for indications of discomfort or stress.\nMedical Illnesses\nPhysiological reactions to stress can have a long-term impact on physical health. In fact, stress is one of the leading precursors to long-\nterm health issues. Backaches, stroke, heart disease, and peptic ulcers are just a few physical ailments that can arise when a person is\nunder too much stress.\nBehavioral Problems\nA person can also exhibit behavioral problems when under stress, such as aggression, substance abuse, absenteeism, poor decision\nmaking, lack of creativity, or even sabotage. A stressed worker may neglect their duties, impeding workflows and processes so that the\nbroader organization slows down and loses time and money. Managers should keep an eye out for such behaviors as possible indicators\nof workplace stress.\nOrganizational Effects of Stress\nStress in the workplace can be, so to speak, \"contagious\"—low job satisfaction is often something employees will discuss with one\nanother. If stress is not noted and addressed by management early on, team dynamics can erode, hurting the social and cultural synergies\npresent in the organization. Ultimately, the aggressive mentality will be difficult to remedy.\nManagers are in a unique position when it comes to workplace stress. As they are responsible for setting the pace, assigning tasks, and\nfostering the social customs that govern the work group, management must be aware of the repercussions of mismanaging and inducing\nstress. Managers should consistently discuss job satisfaction and professional and personal health with each of their subordinates one on\none.\nReducing Workplace Stress\nA combination of organizational change and stress management is a productive approach to preventing stress at work.\nLearning Objectives\nExamine the various ways in which job stress can be prevented or reduced in an organization\nKey Takeaways\nKey Points\nStress management refers to a wide spectrum of techniques and therapies that aim to control a person's levels of stress, especially chronic\nstress, to improve everyday functioning.\nTo reduce workplace stress, managers can monitor each employee's workload to ensure it is in line with their capabilities and resources.\nManagers can also be clear and explicit about general expectations and long-term objectives to ensure there is no discrepancy between\nwhat the manager is looking for and what the employee is working toward.\nManagers must keep culture in mind when approaching issues of workplace stress. They must quickly dismantle any negative workplace\nculture that arises, such as bullying or harassment, and replace it with a constructive working environment.\nKey Terms\nstress: Mental, physical, or emotional strain due to a demand that exceeds an individual's ability to cope.\nStress management refers to a wide spectrum of techniques and therapies that aim to control a person's levels of stress, especially chronic\nstress, to improve everyday functioning.\nPreventing Job Stress\nIf employees are experiencing unhealthy levels of stress, a manager can bring in an objective outsider, such as a consultant, to suggest a\nfresh approach. But there are many ways managers can prevent job stress in the first place. A combination of organizational change and\nstress management is often the most effective approach. Among the many different techniques managers can use to effectively prevent\nemployee stress, the main underlying themes are awareness of possibly stressful elements of the workplace and intervention when\nnecessary to mitigate any stress that does arise.\nSpecifically, organizations can prevent employee stress in the following ways:\nIntentional Job Design\nDesign jobs that provide meaning and stimulation for workers as well as opportunities for them to use their skills.\nEstablish work schedules that are compatible with demands and responsibilities outside the job.\nConsider flexible schedules—many organizations allow telecommuting to reduce the pressure of being a certain place at a certain time\n(which enables people to better balance their personal lives).\nMonitor each employee's workload to ensure it is in line with their capabilities and resources.\nClear and Open Communication\nTeach employees about stress awareness and promote an open dialogue.\nAvoid ambiguity at all costs—clearly define workers' roles and responsibilities.\nReduce uncertainty about career development and future employment prospects.\nPositive Workplace Culture\nProvide opportunities for social interaction among workers.\nWatch for signs of dissatisfaction or bullying and work to combat workplace discrimination (based on race, gender, national origin,\nreligion, or language).\nEmployee Accountability\nGive workers opportunities to participate in decisions and actions that affect their jobs.\nIntroduce a participative leadership style and involve as many subordinates as possible in resolving stress-producing problems.\nStress Prevention Programs\nSt. Paul Fire and Marine Insurance Company conducted several studies on the effects of stress prevention programs in a hospital setting.\nProgram activities included educating employees and management about workplace stress, changing hospital policies and procedures to\nreduce organizational sources of stress, and establishing of employee assistance programs. In one study, the frequency of medication\nerrors declined by 50% after prevention activities were implemented in a 700-bed hospital. In a second study, there was a 70% reduction\nin malpractice claims among 22 hospitals that implemented stress prevention activities. In contrast, there was no reduction in claims in a\nmatched group of 22 hospitals that did not implement stress prevention activities.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}