{
    "text": "Search... Home Subjects\nBoundless Management\nOrganizational Behavior\nJob Design and Motivation\nDefining Job Design\nJob design is the systematic and purposeful allocation of tasks to individuals and groups within an organization.\nLearning Objectives\nCompare and contrast the multitude of job-design approaches and perspectives available in the organizational field\nKey Takeaways\nKey Points\nThe key inputs for a strong job design are a task, motivation, resource allocation and a compensation system.\nTaylorism, or scientific management, is the original job-design theory. It stresses standardization of tasks and proper training of workers\nto administer the tasks for which they are responsible.\nThe Socio-Technical Systems Approach is a theory that maps the evolution from individual work to work groups. The organization itself is\nstructured to encourage group autonomy and productivity.\nThe Core Characteristics Model connects job characteristics to the psychological states that the worker brings to the job. It emphasizes\ndesigning jobs so that they lead to desired outcomes.\nTaking into account these various theoretical models, job design is best described as specifying a task with enough context to\ncommunicate clearly and concisely what is expected of a given employee.\nKey Terms\nempower: To give people more confidence or strength to do something, often by enabling them to increase their control over their own\nlife or situation.\nJob Design Overview\nJob design is the allocation of specific work tasks to individuals and groups. Allocating jobs and tasks means specifying the contents,\nmethod, and relationships of jobs to satisfy technological and organizational requirements, as well as the personal needs of jobholders.\nDick and Carey Systems Approach Model (Instructional Design): The\nfigure shows how an instructional system is designed. It represents a\nmodel of a job design with a specific application (instruction).\nKey Elements of Job Design\nTo understand job design, it is helpful to identify some key elements and their relationship with job design processes.\nA task can be best defined as a piece of assigned work expected to be performed within a certain time. Job designers must strictly and\nthoroughly identify tasks that need completion.\nMotivation describes forces within the individual that account for the level, direction, and persistence of effort expended at work.\nIndividuals need to be compelled, excited, and passionate to do their work. Managers should design jobs that motivate employees.\nResource allocation occurs when an organization decides to appropriate or allocate certain resources to specific jobs, tasks, or dilemmas\nfacing the organization. In job design, it is necessary to identify and structure jobs in a way that uses the company's resources efficiently.\nAppropriate resource allocation allows large organizations to foster and develop innovation in their workforce and underscores strategy\nthrough distribution.\nReward systems also play a role in job design. Reward systems include compensation, bonuses, raises, job security, benefits, and various\nother reward methods for employees. An outline or description of reward packages should be established when constructing jobs.\nTheoretical Models of Job Design\nOrganizations may employ various theoretical approaches for job design. These include Taylorism, Socio-Technical Systems Approach,\nCore Characteristics Model, and Psychological Empowerment Theory. Each approach emphasizes different aspects to be considered in\neffective job design.\nTaylorism\nTaylorism, also known as scientific management, is a foundation for systematic job design. Frederick Taylor developed this theory in an\neffort to develop a \"science\" for every job within an organization according to the following principles:\nCreate a standard method for each job.\nSuccessfully select and hire proper workers.\nEffectively train these workers.\nSupport these workers.\nThe Socio-Technical Systems Approach\nThe Socio-Technical Systems Approach is based on the evolution from individual work to work groups. This approach has the following\nguiding principles:\nThe design of the organization must fit its goals.\nEmployees must be actively involved in designing the structure of the organization.\nControl of variances in production or service must be undertaken as close to their source as possible.\nSubsystems must be designed around relatively self-contained and recognizable units of work.\nSupport systems must fit in with the design of the organization.\nThe design should allow for a high-quality working life.\nChanges should continue to be made as necessary to meet changing environmental pressures.\nCore Characteristics Model\nAnother modern job design theory is the Core Characteristics Model, which maintains five important job elements that motivate workers\nand performance:\nSkill variety\nTask identity\nTask significance\nAutonomy\nJob feedback\nThe individual elements are then proposed to lead to positive outcomes through three psychological states:\nExperienced meaningfulness\nExperienced responsibility\nKnowledge of results\nPsychological Empowerment Theory\nPsychological Empowerment Theory posits that there is a distinction between empowering practices and cognitive motivational states.\nWhen individuals are aware of the impact they have, they benefit more than if they cannot attribute positive impact to any of their\nactions.\nOverall Trend\nMany more iterations of job design theory have evolved, but general trends can be identified among them: job design is moving towards\nautonomous work teams and placing added emphasis on the importance of meaning derived from the individual.\nJob Characteristics Theory\nThe Job Characteristics Theory is a framework for identifying how job characteristics affect job outcomes.\nLearning Objectives\nAnalyze the core characteristics, psychological states, and work outcomes in the Job Characteristics Theory, as identified by Hackman and\nOldham\nKey Takeaways\nKey Points\nThe Job Characteristics Theory (JCT), developed by Hackman and Oldham, is widely used as a framework to study how particular job\ncharacteristics affect job outcomes, including job satisfaction.\nThe five job characteristics are skill variety, task variety, task significance, autonomy, and feedback.\nThree different psychological states determine how an employee reacts to job characteristics: experienced meaningfulness, experienced\nresponsibility for outcomes, and knowledge of the actual results.\nJob outcomes, such as satisfaction and motivation, are the synthesis of core characteristics and psychological states.\nKey Terms\ncharacteristic: A distinguishable feature of a person or thing.\njob analysis: The formal process of identifying the content of a position within an organization in terms of activities involved and\nattributes needed to perform the work, as well as major job requirements.\nCore Characteristics\nThe Job Characteristics Theory (JCT), also referred to as Core Characteristics Model and developed by Hackman and Oldham, is widely\nused as a framework to study how particular job characteristics impact job outcomes, including job satisfaction. The theory states that\nthere are five core job characteristics:\nSkill variety\nTask identity\nTask significance\nAutonomy\nFeedback\nEach job has these characteristics to a greater or lesser extent. No one combination of characteristics makes for the ideal job; rather, it is\nthe purpose of job design to adjust the levels of each characteristic to attune the overall job with the worker performing it. This alignment\nis important because the worker brings psychological states to bear upon the job that affect job outcomes when combined with the core\ncharacteristics.\nMotivating potential score: The Job Characteristics Theory uses this\nequation to estimate the overall motivation inherent in a job design based\nupon the five core characteristics.\nPsychological States\nThe core characteristics affect three critical psychological states of the workers doing the job:\nExperienced meaningfulness\nExperienced responsibility for outcomes\nKnowledge of the actual results\nThe job characteristics directly derive the three states. Indeed, the first three characteristics (skill variety, task variety and task significance)\npertain to the meaningfulness of the work. Autonomy directly correlates to responsibility for outcomes, and knowledge of the actual\nresults relates to feedback. Pictured as a process flow, the characteristics and psychological states operate in continuous feedback loop\nthat allows employees to continue to be motivated by thoroughly owning and understanding the work in which they are involved.\nWork Outcomes\nThe combination of core characteristics with psychological states influences work outcomes such as:\nJob satisfaction\nAbsenteeism\nWork motivation\nTherefore, the goal should be to design the job in such a way that the core characteristics complement the psychological states of the\nworker and lead to positive outcomes. The five core job characteristics can be combined to form a motivating potential score for a job\nthat can be used as an index of how likely a job is to affect an employee's attitudes and behaviors. Analyses of studies of the model\nprovide some support for the validity of the Job Characteristics Theory.\nTactics for Improving Fit\nWays of improving job fit include assessing employee activities through various tools to increase employee satisfaction and efficiency.\nLearning Objectives\nDescribe ways in which management and supervisors can improve job design to fit employee and organizational needs\nKey Takeaways\nKey Points\nThe flexibility to tailor job design more precisely for both organizational effectiveness and employee job satisfaction is a significant,\nongoing part of the job design process.\nIf a job is well designed, then its required competencies and responsibilities are explicit and clear.\nTraining is meant to develop in the employee the skills required to improve job fit as the individual enters the workforce.\nAnalyzing the outcomes of a given job within the organization, both from the task perspective and the employee perspective, can assist in\nimproving fit.\nSupervisors can use interviews, surveys, observations, questionnaires, and checklists to observe efficacy of job design and improve fit for\neach employee.\nKey Terms\njob fit: Correlation between a given position's roles, responsibilities, and objectives and the skills and competencies of the individual\nholding that position.\nThe Job Fit Template\nThe basis for improving fit between the employee and the job is striking a balance between job design and individual—crafting the job in\nsuch a way that it complements the employee's individual skills, aspirations, personality, and attributes. Job design is usually completed\nprior to hiring the individual who then performs the identified duties. As a result, flexibility to tailor the job design for both organizational\neffectiveness and employee job satisfaction is a significant, ongoing part of the job design process.\nIf a job is well designed, then the competencies it requires and responsibilities it involves are explicit and clear. This design becomes the\nfoundation for the job description, which is a more exact picture of the job's nature and which comprises the following:\nThe title and duties the job fulfills\nWho supervises the employee holding the job\nExperience and qualifications expected from an applicant\nThe job description outlines the general attributes of the person for whom the job is designed and serves as the basis for improvement\nand modification during the improvement process.\nTraining\nThe first step in improving fit for a given job design is training. Once an individual is hired to perform a specific set of duties, both\nmanagement and human resources should assist in preparing the individual to accomplish these tasks. In this process, the organization is\nresponsible for improving fit by supplying all of the necessary tools, contacts, and information employees will need to accomplish their\nobjectives.\nJob Analysis\nAnalyzing the outcomes of a given job within the organization, both from the task perspective and the employee perspective, can assist in\nimproving fit by ensuring that the employee is both satisfied and accomplishing the desired objective. Job analysis employs a series of\nsteps which enable a supervisor to assess a given employee/job fit and to improve the fit, if necessary. These steps include:\nObservation: The simplest method of assessing how a job and employee fit is observing the employee at work. The manager may find it\nuseful to ask a few questions during this process, but it is important not to make the employee uncomfortable (which would skew the\nresults).\nSurvey/Questionnaire: Providing the employee with a survey is another effective data-collection strategy. A survey should provide\ndimensions of the job and allow the experts in that specific role to weigh the importance of each component. Supervisors can also gather\ndata on what is working and what is not, allowing them to edit and improve task assignments.\nInterviews: One-on-one, formal or informal interviews are also a useful tool in gathering data about the employee, allowing the supervisor\nto obtain more details than a survey provides. In this situation, the supervisor can also customize each discussion to become more familiar\nwith the personality, levels of satisfaction, and perceived efficiency of each employee.\nChecklist: Another method of improving job fit is to create a checklist. Employees or the supervisor can fill these out, identifying what\ntasks are being done early, on-time, or later (they can also note quality and resource efficiency).\nQuestionnaire: Employee questionnaires can be a\nuseful method of assessing job fit.\nLicenses and Attributions\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}