{
    "text": "Search... Home Subjects\nBoundless Management\nEthics in Business\nEthical Responsibilities of Management\nEthical Conflicts\nAn ethical dilemma is a conflict between two moral imperatives.\nLearning Objectives\nDiscuss the innate contradictions that often arise in an ethical dilemma, where two or more different moral imperatives conflict\nKey Takeaways\nKey Points\nAn ethical dilemma is the mental conflict between moral imperatives.\nConflict arises when the need to follow one moral imperative will result in disobedience to another.\nThree principles by which to resolve ethical dilemmas are utilitarianism, justice, and the common good.\nKey Terms\nethical dilemma: A complex situation that often involves an apparent mental conflict between moral imperatives, in which obeying one\nmeans transgressing another.\nA person who must choose between competing moral imperatives faces an ethical dilemma. In such a situation, following the actions\nrequired by one obligation would mean violating a different obligation. For instance, a manager might have a duty to keep an upcoming\nlayoff secret until plans for severance pay and outplacement for those affected can be outlined. Yet at the same time, that manager might\nfeel an obligation to let staff members know they will soon be out of a job, so they can get a head start finding another one.\nMaking a choice in the face of two compelling alternatives requires a principle by which to distinguish between them. Several ideas from\npolitical philosophy can guide managers in resolving an ethical dilemma:\nUtilitarianism: A utilitarian approach seeks to provide the most good or do the least harm. In the example above, a manager might ask if\nthe employees will be better off receiving advance word about the layoffs while facing uncertainty about what benefits they may receive.\nIn other words, the manager would gauge how much harm will waiting to inform the staff cause compared to the benefit of minimizing\nanxiety among employees.\nJustice: Another way to consider an ethical dilemma is by considering the principle that all people should be treated equally. If the\nmanager informs his staff, is that fair to the other employees whose managers did not reveal the information early? Does that manager\nalso have an obligation to those other employees?\nCommon good: Finally, resolving an ethical dilemma might mean considering whether one choice is more in keeping with the long-term\nwelfare of all affected parties. In this example, assume the manager, some of his employees, and their peers will not be part of the layoff.\nWill the manager's ability to be effective in the future be made better or worse by taking one action rather than the other? It it better for\nthose who will remain to withhold the information or to disclose it? Moreover, is one option less consistent with the organization 's values\n? If that option were chosen, would it undermine employees' belief in the company or the company's credibility as it related to its\nespoused ethics?\nBy adopting a principle-based method of weighing the advantages and disadvantages of both alternatives in an ethical dilemma,\nmanagers can face two competing values and reach a decision.\nPrevious Next\nFreshly uploaded management documents\nEthics in Financial Reporting.edited Rubric Topic 2 Becoming and being an effective\nleader Advocacy and Leadership\n(7041HSV3235)\nSOC110 Wk 5 Assessment MANAGEMENT-889-Slides MANAGEMENT-9257-Analysis\nSOC110 Wk 3 Assessment(1) The topic, aims, objectives and research Employee Turnover.edited\nquestions\nSUBJECTS LEGAL COMPANY CONNECT WITH US\nAccounting Copyright Policy Documents Sitemap Facebook\nBusiness Honor Code Study Guides Instagram\nCommunications Terms YouTube\nEconomics Academic Integrity Twitter\nFinance Cookie Policy\nLaw Privacy Policy\nManagement Do Not Sell or Share My Personal\nInfo\nMarketing\nMathematics\nSociology\nStatistics\n© Learneo, Inc. 2023 Course Sidekick is not sponsored or endorsed by any college or university."
}