{
    "text": "Table of Contents\nCHAPTER 8: INTEGER EXPONENTS, SCIENTIFIC NOTATION AND VOLUME (4 WEEKS) .......... 2\n8.0 Anchor Problem: Spiders .......................................................................................................................... 7\nSECTION 8.1: INTEGER EXPONENTS ..................................................................................................................... 8\n8.1a Class Activity: Get Rich Quick ............................................................................................................... 9\n8.1a Homework: Get Rich Quick .................................................................................................................. 12\n8.1b Class Activity: Find, Fix, and Justify and Exponent Properties ........................................................... 14\n8.1b Homework: Product of Powers and Quotient of Powers Properties .................................................... 17\n8.1c Class Activity: Power of a Power, Power of a Product, and Power of a Quotient .............................. 18\n8.1c Homework: Power of a Power, Power of a Product, and Power of a Quotient .................................. 21\n8.1d Class Activity: Find, Fix, and Justify .................................................................................................... 23\n8.1d Homework: Find, Fix , and Justify. ...................................................................................................... 25\n8.1e Class Activity: Zero and Negative Exponents ....................................................................................... 27\n8.1e Homework: Zero Exponent and Negative Exponents ........................................................................... 30\n8.1f Class Activity: Properties of Exponents Game and Mixed Practice ..................................................... 31\n8.1f Homework: Properties of Exponents Mixed Practice ........................................................................... 32\n8.1g Self-Assessment: Section 8.1 ................................................................................................................. 34\nSECTION 8.2: SCIENTIFIC NOTATION .................................................................................................................. 35\n8.2a Class Activity: Place Value and Powers of Ten .................................................................................... 36\n8.2a Homework: Place Value and Powers of Ten ........................................................................................ 41\n8.2b Class Activity: Scientific Notation Part 1 ............................................................................................. 43\n8.2b Homework: Scientific Notation Part 1 .................................................................................................. 46\n8.2c Class Activity: Scientific Notation Part 2 ............................................................................................. 47\n8.2c Homework: Scientific Notation ............................................................................................................. 51\n8.2d Class Activity: Multiplying and Dividing with Scientific Notation ....................................................... 54\n8.2d Homework: Multiplying and Dividing with Scientific Notation ........................................................... 57\n8.2e Class Activity: More Operations with Scientific Notation .................................................................... 59\n8.2e Homework: More Operations in Scientific Notation ............................................................................ 62\n8.2f Class Activity: Matching, Ordering, and Problem Solving with Scientific Notation. .......................... 63\n8.2f Homework: Matching, Ordering, and Problem Solving with Scientific Notation ................................. 65\n8.2g Class Activity: Problem Solving with Scientific Notation ..................................................................... 67\n8.2g Homework: Problem Solving with Scientific Notation ......................................................................... 68\n8.2h Self-Assessment: Section 8.2 ................................................................................................................. 69\nSECTION 8.3: VOLUME OF CYLINDERS, CONES, AND SPHERES ........................................................................... 72\n8.3a Class Activity: Wet or Dry (This activity is optional) ........................................................................... 73\n8.3b Class Activity: Volume of Cylinders ..................................................................................................... 74\n8.3b Homework: Volume of Cylinders .......................................................................................................... 77\n8.3c Class Activity: Volume of Cones ........................................................................................................... 78\n8.3c Homework: Volume of Cones................................................................................................................ 80\n8.3d Class Activity Volume of Spheres ......................................................................................................... 81\n8.3d Homework: Volume of Spheres ............................................................................................................. 83\n8.3e Class Activity: Volume of Cylinders, Cones, and Spheres .................................................................... 84\n8.3e Homework: Volume of Cylinders, Cones, and Spheres ........................................................................ 87\n8.3f Class Activity: Banana Splits ................................................................................................................. 88\n8.3g Self-Assessment: Section 8.3 ................................................................................................................. 90\n8WB8-1 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Chapter 8: Integer Exponents, Scientific Notation\nand Volume (4 weeks)\nUtah Core Standard(s):\n Know and apply the properties of integer exponents to generate equivalent numerical expressions. For\n1 1\nexample, 32×3-5=3-3= = . (8.EE.1)\n33 27\n Use numbers expressed in the form of a single digit times an integer power of 10 to estimate very large\nor very small quantities, and to express how many times as much one is than the other. For example,\nestimate the population of the United States as 3×108and the population of the world as7×109, and\ndetermine that the world population is more than 20 times larger. (8.EE.3)\n Perform operations with numbers expressed in scientific notation, including problems where both\ndecimal and scientific notation are used. Use scientific notation and choose units of appropriate size for\nmeasurement of very large and very small quantities (e.g., use millimeters per year for seafloor\nspreading). Interpret scientific notation that has been generated by technology. (8.EE.4)\n Know the formulas for volumes of cones, cylinders, and spheres and use them to solve real-world and\nmathematical problems. (8.G.9)\nVocabulary: base, cone, cylinder, diameter, estimate, exponent, exponential form, hemisphere, scientific\nnotation, pi, power, powers of ten, radius, scientific notation, slant height, sphere, standard form, volume\nChapter Overview:\nStudents begin this chapter with the study of integer exponents. They represent repeated multiplication in\nexponential form and begin to explore the properties of integer exponents as another method for transforming\nexpressions. Students explore problems and patterns that lead them to properties related to negative exponents\nand an exponent of 0. Through the investigation of these properties they learn to generate equivalent\nexpressions in a quick and efficient way. Their study is then turned to using their knowledge of exponents,\nplace value, and powers of ten to express a number in scientific notation. This notation is used to denote very\nsmall and very large numbers. Students learn to change numbers from standard form to scientific notation and\nvice versa. They also learn to perform operations with numbers in scientific notation. This enables them to\nwork with and analyze real world situations where large and small quantities exist. Finally, students study\nvolume and how exponents play a role in the formulas for the volume of a cylinder, cone, and sphere. They use\nthese formulas to solve a variety of problems related to the volume of these three-dimensional objects.\n8WB8-2 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Connections to Content:\nPrior Knowledge:\nPrior to 8th grade students have explained patterns in the number of zeros of the product when multiplying a\nnumber by a power of ten. They have also analyzed the patterns in the placement of the decimal point when a\ndecimal is multiplied or divided by a power of 10. In addition they have used whole number exponents to\ndenote powers of 10. They extend this knowledge to base numbers other than 10 in 8th grade as they generate\nthe exponent rules. In addition to rewriting numbers as powers of ten to better understand multiplication and\nplace value students have previously rewritten numbers in a variety of ways to perform an indicated skill, i.e.,\n24 as 2223 and 18 as233, to reduce to or to find the LCM of 72 or GCF of 6. Similarly, in 8th\ngrade, students express numbers as decimals or in scientific notation in order to compare and estimate very\nlarge and small quantities. Finally, students must gather their knowledge of area and volume from 6th and 7th\ngrade as they begin their work with volumes of cylinders, cones, and spheres.\nFuture Knowledge:\nA solid foundation with exponent laws and rules will help students significantly as they begin to transform more\ncomplicated expressions in high school mathematics courses. For example, in Secondary II they will extend the\nlaws of exponents to rational exponents. In high school students will explore exponential functions and the\nwork they do in 8th grade begins to familiarize them with how exponents work algebraically and how\nexponential behavior is exhibited. Scientific notation will be used in a variety of contexts in high school\nmathematics and science courses. By studying the volume formulas for cylinders, cones, and spheres in 8th\ngrade, students will be prepared to investigate informal arguments and proofs, specifically Cavalieri’s Principle\nfor the derivation of these formulas in Secondary II.\nMany of the section lessons in this chapter may take more than one day to complete\ndepending on the length of your class period. Think about the needs of your students and pace\nthe lessons and homework assignments according to their needs.\n8WB8-3 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. MATHEMATICAL PRACTICE STANDARDS:\n1. If you fill the hemisphere with water or other filling material, predict\nwhat fraction of the cylinder is filled by the volume of one hemisphere.\n2. Now try it, what fraction of the cylinder is filled by the volume of one\nhemisphere?\nReason 3. Write down the equation for the volume of the cylinder below the\nabstractly and cylinder, be sure to write your height in terms of the radius or r.\nquantitatively. 4. Manipulate the equation for the volume of the cylinder to show the\nvolume of the hemisphere.\n5. Now double your formula to find the formula for the volume of a\nsphere.\nStudents derive the formula for the volume of a sphere by physically comparing\nthe volume of a sphere to that of a cylinder. Based on the physical differences\ndiscovered, students manipulate the formula for the volume of a cylinder in\norder to derive the formula for the volume of a sphere. They use a similar\nprocess to derive the formula for the volume of a cone. They must algebraically\ninterpret these changes as they reason abstractly about the dimensions dealt\nwith. They can then make the appropriate changes as they manipulate the\nformulas.\nDiscuss the multiplication problem(53)(28)with your class. Write your\nthoughts below.\nOf course it most natural to just multiply 15 times 16. But could you rewrite\nthe problem as(52)(38)or(58)(23)? Is the answer the same? Why\ncan you do this?\nLook for and\nRewrite this problem (5.1105)(6.8103)like the problem above (group the\nmake use of\npowers of 10 together). Then solve the problem (use exponent properties)\nstructure.\nand write the solution.\nLooking for structure is a big part of this chapter. The example above is\nshowing how the structure of a number written in scientific notation can aid in\ncompleting basic operations of very large and small numbers in a fast and\nefficient way. The students will also make use of structure when they look at\nhow exponents are used to represent repeated multiplication. This in turn\npoints toward the discovery and understanding of the exponent properties and\nrules.\nAnalyze the pairs of expressions given below; discuss the similarities and\ndifferences between them.\n(4)2 42\nand\n(4)3 43\nand\nStudents might bring up the fact that the only thing that is different about the first\nset of expressions are the parentheses. The parentheses are important because they\nindicate that there are two copies of negative 4. If you expand this expression you\nAttend to get . The expression42 indicates that there is a coefficient of\nprecision.\nnegative 1. Upon expansion, you get 4 2(1)(4)(4)(1)(16)16 . Students\nwill get different answers even though the expressions are similar. They must\nattend to precision. In the second set of expressions they both equal . This is\nbecause of the odd exponent. Throughout the chapter students must attend to\nprecision constantly as they grapple with the notation used with exponents and as\nthey decipher what these special notations are communicating to them.\n8WB8-4 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Complete columns 2 and 3 in the table below by writing each expression in\nexpanded form and in exponential form. As you are simplifying try to\ndiscover a shortcut or rule that you could use to simplify more quickly.\nTest your shortcut in the last column and compare your answers.\nProduct of Powers\nLook for and\nexpress\nregularity in\nrepeated\nreasoning.\nThroughout section 8.1 students will expand expressions repeatedly in\norder to discover the rules and properties of integer exponents.\nYou are asked to enter the following expression into your scientific\ncalculator.\n4\n2\nUse\n \nappropriate 3\ntools Which of the following is not a correct way to enter the expression into a\nstrategically. scientific calculator?\nUsing a calculator appropriately is an important component of this chapter.\nStudents often mistake how to enter exponents into the calculator correctly.\nThey must also learn how to enter and interpret a number expressed in\nscientific notation on a calculator.\nGas’N’ Go Convenience Stores claim that 10% of Utahans fuel up at their\nstores each week. Decide whether their claim is true using the following\ninformation.\n There are about 2.85106people in Utah.\nMake sense of  There are 2.18102Gas’N’Go stores in Utah.\nproblems and\n Each stations serves gasoline to about 1.2103people each\npersevere in\nweek.\nsolving them.\nThere are several questions in this chapter where students are given the\nopportunity to problem solve. In the example above students must find an\nentry point into the problem by determining that they need to figure out\nwhat 10% of the Utah population is. They must analyze what is given to\nthem and how they can use it to reach their intended goal. In addition to\nreaching an outcome they can analyze their solution to see if it makes sense\ngiven the context.\n8WB8-5 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Edward, Pattie, and Mitch were each simplifying the same exponential\nexpression. Their work is shown below. Determine who has simplified the\nexpression correctly. If they did not simplify the expression correctly, identify\nthe mistake, explain it, and fix it.\nConstruct\nviable\narguments and\ncritique the\nreasoning of\nothers.\nIn the problem above students must critique the work of others. As they do so they\nsolidify their understanding of different exponent properties. They also analyze\ncommon misconceptions and mistakes that are made when simplifying expressions\nwith exponents. As they examine two problems that are correct but simplified\ndifferently they see that it is possible to arrive at the same answer in a variety of\nways. This enhances their understanding of the structure of these expressions and\nhow they are composed.\nA silo is a storage bin that is a cylinder with a hemisphere on top. A farmer\nhas a silo with a base radius of 30 feet and a storage height of 100 feet. The\n“storage height” is the part which can be filled with grain - it is just the\ncylinder. A cubic foot of grain weighs 62 lbs.\na. Draw and label a picture of the silo.\nb. How many pounds of grain can the farmer store in the silo?\nc. How high (including the hemispherical top) is the silo?\nd. 1000 square feet of wheat produces 250 pounds of grain. The farmer’s\nModel with wheat field is 3,500 ft by 20,000 ft. Is the silo large enough to hold the\nmathematics. grain? By how much? Explain your answer.\ne. If the farmer decides to fill the silo all the way to the top of the hemisphere\nhow many cubic feet of grain can he store?\nWhile working with volume students use geometry to model a variety of situations. In\nthe problem above, a silo is modeled with a hemisphere and cylinder. Student’s use\nthis geometric model to answer questions about the silo. They use a mathematical\nformula to model the volume of the silo to determine how much grain it will hold and\nthe height of the silo.\n8WB8-6 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.0 Anchor Problem: Spiders\n1. The genetically altered spider that turned Peter Parker into Spider Man with a single bite was about\n0.035 ounces. If Spider Man weighs roughly 185 pounds how many spiders does it take to have the same\nmass as Spider Man?\nIt would take roughly 84,600 spiders in order to equal the mass of Spider Man.\n2. Spider Man fights evil villains in New York City. The size of New York City is roughly 1,214,450,000\nsquare meters. It is estimated that on average there are approximately 1,308 spiders per square meter of\nland. Use this information to determine how many spiders are in New York City?\nThere are approximately 1,589,000,000,000 spiders in New York City.\nBonus: Determine how many spiders there are in your city or even a bedroom in your basement.\nThis task is intended to introduce students to very large and very small numbers. In this chapter\nstudents will learn how to use exponents to express numbers in scientific notation. At this point let\nstudents try to answer the questions using any method they can. After doing section 8.2, where students\nwill learn how to express a number in scientific notation, return to this task and have them answer the\nquestions using scientific notation. They will see how using scientific notation as a tool when\nappropriate can help them to better make sense of and calculate quantities with ease and efficiency.\n8WB8-7 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 8.1: Integer Exponents\nSection Overview:\nThis section begins with an overview of the structure of exponents and how an exponential expression\nrepresents repeated multiplication as opposed to expressions that represent repeated addition. Using the\nstructure of an exponential expression special properties or rules are discovered in this section. These exponent\nproperties and rules aid in simplifying exponential expressions. Students will informally prove why an exponent\n1\nof zero equals one and also look at the definition of negative exponents, that is,x1  . Once students become\nx\nfamiliar with these properties and rules they use them to simplify more complex exponential expressions.\nConcepts and Skills to Master:\nBy the end of this section students should be able to:\n1. Apply the properties of integer exponents to simplify algebraic and numerical expressions.\nBe sure to reference the teacher notes for section 8.1. They will give you important guidelines as to\nhow group and class discussions will aid in the discovery of exponent properties. The “Find, Fix, and\nJustify” activities are meant to help students solidify the properties of exponents by reasoning about\nhow algebraic expressions are expanded and can be simplified through basic algebraic properties. As\nthey look for mistakes i n algebraic reasoning and argue or justify their thinking a deeper\nunderstanding of how the expressions are constructed emerges and solidifies how expanding an\nexpression can lead to a shortcut or rule.\n8WB8-8 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1a Class Activity: Get Rich Quick\nMario and Tony both want you to come and drive Go-Karts for their team. They will pay you in gold coins.\nEach one makes an offer:\nMario: I will give you 3 gold coins on the first day. Then, every day after that, I will pay you 3 times as\nmuch as I paid you the day before.\nTony: I will give you 3 gold coins on the first day. Then, every day after that, I will pay you 3 more coins\nthan I paid you the day before.\n1. Who would you rather work for? Use the table below to help you decide.\nMario’s Deal Daily Wage Tony’s Deal Daily Wage\nMonday 33 Monday 31(3)\nTuesday 93332 Tuesday 6332(3)\nWednesday 2733333 Wednesday 93333(3)\nThursday 81333334 Thursday 1233334(3)\nFriday 243333335 Friday 15333335(3)\nTotal Earnings 3927181243363 Total Earnings 369121545\n2. For whom would you rather work and why?\nMario is the better deal, you will make more money.\n3. Rewrite your earnings for each day as repeated multiplication or repeated addition.\nSee above.\n4. You have used exponents previously to represent whole numbers in expanded form as powers of ten.\nComplete the following table to remind yourself how exponents are used. The first couple of rows have\nbeen done for you.\nwhich is\n101 10 10\nmeans\nequal to\nwhich is\n102 1010 100\nmeans\nequal to\nwhich is\n103 means 101010 1,000\nequal to\nwhich is\n105 means 1010101010 10,000\nequal to\nwhich is\n108 means 1010101010101010 100,000,000\nequal to\nwhich is\n1010 means 10101010101010101010 10,000,000,000\nequal to\n5. Now rewrite your earnings for each day using exponents or multiplication. Be ready to discuss the effect\nthat an exponent has on a number; think about the difference between repeated multiplication and\nrepeated addition. See above.\n8WB8-9 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Lead the following discussion with your class.\nYou know from previous grades that when you add the number 2 to itself 5 times, you can use\nmultiplication to write this in an abbreviated form. 2222252\nYou can use exponents to help you to know how many times you must multiply the base number by itself.\n25 means to multiply the number 2 by itself 5 times.2222225\nIt is important for students to understand the difference between repeated multiplication and repeated\naddition. Show an example such as, x5  xxxxx and 5xxxxxx. Point out how x5 shows\n. “multiply 5 x’s” and how 5x shows “add five x’s.\nAlso review the parts of an exponent. The number that is a power is called the exponent. It indicates how\nmany times the base number is being multiplied. The base number is the number that is being multiplied.\nIn the example given below 2 is the base number and 5 is the exponent.\nExponent\nBase number\nIn general, for any number x, and any whole number n,\nThe expression xnis read x raised to the nth power. In this expression n is the exponent\nand x is the base number.\n6. Write each expression given below in exponential form.\na. 6666665 9 9 9 93 c.\nb.   \n \n7 7 7 7\nd. (2)(2)(2)(2)(2)4 222 23 xxxxxx  x6\ne.  f.\n     \n 3  3  3   3 \n1 1 1 1 1 1 1 17 h. 22333 22 33 i. 111111xx 113x2 1,331x2\ng.       \n \nx x x x x x x  x\nj. xxx y  x3y k. aaabbbcca3b3c2 l.\n7. Examine problem j. above. What exponent does the variable y have? Do you have to write the\nexponent?\nThe exponent for the variable y is 1, you do not have to write the exponent of 1.\nExplain to students that we do not need to write the \"1\" for an exponent of x just like we do\nnot need to write that x has a coefficient of 1. x1x1\n8. Notice the use of parentheses in problems d. and e. above. Why do you think they are they used?\nThe parentheses are used to differentiate between a negative sign and a subtraction sign.\n8WB8-10 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 9. Evaluate each exponential expression by first re-writing it using multiplication.\n(3)2 means (3)(3) which is equal to 9\n(3)3 means (3)(3)(3) which is equal to\n(3)4 means (3)(3)(3)(3) which is equal to 81\n(3)5 means (3)(3)(3)(3)(3) which is equal to\n(3)6 means (3)(3)(3)(3)(3)(3) which is equal to 363\n(3)7 means (3)(3)(3)(3)(3)(3)(3) which is equal to\n10. Describe one pattern that you notice in the table above.\nIf the exponent is even the answer is positive. If the exponent is odd then the answer is negative.\n11. Examine1 the pairs of expressions given below; discuss the similarities and differences between them.\n(4)2 42\nand\nStudents might bring up some of the following ideas. The only thing that is different about these\nexpressions are the parentheses. The parentheses are important because they indicate that there are two\ncopies of negative 4. If you expand this expression you get . The expression42\nindicates that there is a coefficient of negative 1. Upon expansion you get 4 2(1)(4)(4)(1)(16)16.\nYou will get different answers even though the expressions are similar.\n(4)3 43\nand\nEmphasize how students must attend to precision when dealing\nIn this case both expressions equal .\nwith negative numbers and exponents.\nThis is because of the odd exponent.\nMarch Madness, the NCAA basketball tournament, has the form of a single-elimination tournament. In such a\ntournament, we start with a certain number of teams, and we pair them off into games; each team plays a game.\nThis is called the first round. All the losers in the first round are eliminated; in the second round all the winning\nteams are paired off into games, and all the second round losers are eliminated. This process continues until\nonly two teams remain; this is the final round and the winner is the champion of the tournament.\nFor the March Madness problem consider showing students a bracket for the current year’s tournament and explain\nto them the following.\nSince there are two teams in the final round, there had to be four teams in the semifinal round, and thus eight teams\nin the preceding round and so forth. So, for a single elimination tournament to work, with no teams ever idle, that we\nstart with a number of teams that is a power of two, and that exponent is the number of rounds. So, for example, if we\nstart with 16 teams, since , there are 4 rounds and games.\n12. March Madness starts with 64 teams. How many rounds are there?\nSince , there are six rounds.\n13. How many teams are in the second round? In any round?\nEach round eliminates half the remaining teams, so there are 32 teams in the second round, 16 in the\nthird, and so forth.\n14. How many games total are played? There are games. Another way of\ncounting is that there are 63 teams that are NOT champions, and each game produces one non-\nchampion.\n8WB8-11 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1a Homework: Get Rich Quick\n1. Write each expression in exponential form\na. b. (4)(4)(4)(4)(4)4 c. (3.7)(3.7)(3.7)(3.7)3\n5 5 5 5 5 5 56 e. xxxxyy x4y2 f. 3aaaaab3a5b\nd.        \n8 8 8 8 8 8 8\n2. Upon taking a VERY good job, Manuel is given one of the following two options for his retirement\nplan.\nOption A: $10 the first year, then every year after that you will get 10 times as much as the year before.\nOption B: $100,000 the first year and then every year after that you will get $100,000 more than the year\nbefore.\na. What option should he choose? Justify you answer? Use the table to decide.\nIt depends on how long Manuel plans on working for the company. If he plans on working there for 5\nyears or less it would be better to go with Option B. But if he plans on working there for more than 5\nyears it would be smarter for Manuel to choose Option A. This plan is showing exponential growth and\nrepeated multiplication. Even though he initially does not get very much with Option A the money\ngrows very quickly.\nOption A Yearly Retirement Option B Yearly Retirement\nYear 1 10101 Year 1 100,000\nYear 2 1001010102 Year 2 200,000100,000100,000\nYear 3 1,000101010103 Year 3 300,000100,000100,000100,000\nYear 4 10,00010101010104 Year 4\nYear 5 100,0001010101010105 Year 5\nYear 6 1,000,000101010101010106 Year 6\nb. Write each yearly retirement amount as repeated multiplication or repeated addition.\nSee table above.\nc. Write each yearly retirement amount in exponential form for Option A.\nSee table above.\n8WB8-12 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. d. Extension: Write an equation or function that could be used to find the amount of retirement Manuel\nwould receive for any given year for Option A or Option B\nOption A: y 10x, where x is the numbers of years and y is the amount of money given in retirement\nthat year.\nOption B:y100,000x, where x is the numbers of years and y is the amount of money given in\nretirement that year.\n3. Write an exponential expression with as its base that will result in a positive product.\nAnswers will very; the expression must have an even exponent.\n4. Write an exponential expression with as its base that will result in a negative product.\nAnswers will very; the expression must have an odd exponent.\n5. Rewrite each number in exponential form, with the number two as its base.\na. 823 b. 3225 c. 12827\n\\\n6. Pablo wrote(2)5 32. Is he correct; why or why not?\nPablo is correct because,(2) 5(2)(2)(2)(2)(2)32.\n7. Chantal wrote62 36. Is she correct; why or why not?\nChantal is not correct because, 62 (1)62 (1)3636.\nA candy maker is making taffy. He starts with one long piece of taffy and cuts it into 3 pieces. He then takes\neach resulting piece and cuts it into three pieces. He then takes each of these resulting pieces and cuts it into\nthree pieces. He continues this process.\n8. Use exponents to represent the number of pieces of taffy the candy maker has after the first 4 rounds of\ncuts. It is interesting to point out that as the powers of 3 are generated a\npattern emerges among the last digit produced. The numbers\n3,9,7,1 repeat themselves. This is similar to the repetitions that\ntake place when identifying terminating and repeating decimals.\n9. How many pieces of taffy will the ca ndy maker have after 8 rounds of cuts?\n. The candy maker will have 6,561 pieces of taffy after 8 rounds of cuts.\n10. The candy maker gets a special order for 243 pieces of peppermint flavored taffy. How many rounds of\ncuts will he have to make to get this many pieces?\nThe candy maker will have to make 5 rounds of cuts to get 243 pieces of taffy.\n8WB8-13 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1b Class Activity: Find, Fix, and Justify and Exponent Properties\nPart 1: Find, Fix, and Justify\nThe following statements are incorrect. For each of the statements do the following:\n Find the mistake(s) in each statement.\n Fix the mistake.\n Justify your reasoning. You may use pictures if needed.\n1. In the expression below; 4 is 2. 3.\ncalled the base number and 5 and\nis called the exponent. . Since\nThis is true because, then\nThis statement is incorrect .\nbecause 5 is the base number and\nT his is another example\nClear up the misconception shown\n4 is the exponent or power.\nwher e you can discuss the\nin the problem by reviewing with\nExponent students that difference between the\nBase number Point out the exponent and base number.\ndifferences between the two\nReview with students the parts of expressions. Also, point out\nan exponential expression. The similarities means add six\nexponent indicates the number of twos and means multiply six\ntimes that the base is multiplied\ntwos.\nby itself.\n4. 5. 6.\nand or\n, therefore .\nReemphasize the difference between\nDiscuss with students how\nrepeated multiplication and repeated Thus .\nthis example differs from\naddition. Confusion may arise here if\nyou look at this statement as an Be sure to discuss how an number 5. The notation is\nequation to solve rather than an exponent affects a negative important here and they\nidentity. The equation is true if number. Recall how they must attend to precision.\n. If you think of can determine the sign of\nthis geometrically, the first\nthe final outcome by noting\nexpression represents a rectangle\nwhether the exponent is\nwith a length of 3 and a width of x;\nwhereas the second expression even or odd.\nrepresents the volume of a cube with\nside length x.\nAs each problem is discussed with the class, make changes or add notes to your work above if needed. Use the\nspace below to write down important notes about exponents.\nOne way of implementing this lesson in your class is to give students about 5 minutes to work on these six problems. When\nthey are finished have them discuss their answers with a neighbor before moving on to a group discussion. Ask for people to\ncome to the board to show and justify how they fixed the mistake in each statement. Lead a class discussion for each statement,\ndiscuss the multiple representations for these statements such as repeated multiplication and clear up misconceptions.\nYou can add in the optional statement; . This can generate a lot of discussion that you may not want to get into at this\npoint, however it would be good to discuss that this statement is incorrect because a variable with no power listed can be\nassumed to have a power of 1. It is a common mistake for students to assume that it has a power of 0. A discussion around an\nexponent of 0 will come later on in Section 8.1e.\n8WB8-14 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Part 2: Exponent Properties\nYou are going to further investigate expressions with exponents by combining them through multiplication and\ndivision. There are special properties that help to transform exponential expressions with a shortcut; they are\ncalled Exponent Properties or Rules. The problems given below show the special properties that hold true for\nall exponential expressions.\nComplete columns 2 and 3 in the table below by writing each expression in expanded form and in exponential\nform. The first one has been done for you. As you are simplifying try to discover a shortcut or rule that you\ncould use to simplify more quickly. Test your shortcut in the last column and compare your answers.\nProduct of Powers\nColumn 1 Column 1 rewritten in expanded form or as Column 2 Test your shortcut and\nrepeated multiplication. rewritten in compare.\nexponential\nform.\n5352 532 55 3125\nb6 b2 b62 b8\nyyyyyyyyyyyyyyyy y2y10y4  y2104  y16\n3xxy2xxyy 3x2y2x2y2 32x22y12 6x4y3\nExplain how to multiply exponents with the same base without using expanding.\nTo multiply exponents with the same base, add the exponents, keep the base number the same.\nAlgebraic Rule for the Product of Powers (explain your rule using symbols):\nxa xb  xab\nYou can have students work on the tables independently, with a partner, or in a group. Be\nsure to formalize the rules together as a class.\nSimplify each expression:\nDiscuss problem e. below. Some students might find it helpful to get into the habit of\na.\nadding an exponent of 1 to all numbers/variables that do not show an exponent before\nbeginning to simplify the expression. Also talk about the role of the coefficients and how\nb. the commutative property allows you to simply multiply them together.\nRemind students how the parentheses ( ) and the multiplication dot (·) indicate the same\nc.\noperation.\nYou might want to ask “Why do you think this property is called the Product of Powers?”\nd. Make up your own probl em that requires the Product of Powers to simplify.\nSee student answer.\ne. How would you simplify A number that does not show any exponent has an exponent of 1; thus\naa3 a1a3 a13 a4.\nThe specific names of the rules do not need to be emphasized. They\nTry these problems:\nare given to aid in communicating about the rules. More important\nf. = 8a3b6 than the naming of the properties is that students are able to examine\nand interpret the structure of these expressions in order to write an\ng. =8x3y4z equivalent expression.\n8WB8-15 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Quotient of Powers\nColumn 1 rewritten in expanded form or as Column 2 Test your shortcut and\nrepeated multiplication. rewritten in compare.\nexponential\nform.\n33333 333 33 35\n 352 33  27\n33 1 32\na  a  a a a a a4\n  a43  a1  a\na  a  a 1 a3\nb  b  b 1 1 b3\n b35 b2\nb  b  b bb bb b2 b5\n(44444)(x x x xxxx) 444xxx 43x3 64x3 45x7\n  452x74\n(44)(x x x x) 1 42 x4\n 43x3 64x3\nExplain how to divide exponents with the same base without expanding.\nTo divide exponents with the same base subtract the exponents and keep the base number the same.\nStudents may want to talk\nAlgebraic Rule for the Quotient of Powers:\nabout the negative exponent.\nam In example d. you can\n amp\ncertainly start having\nap\nconversations about negative\nexponents and talk about\nhow the expression can also\nSimplify each expression:\n3\nb tre es i tm hap tl i if nie od dto . I et ti rs\na. 6c3 d. 3x2 erx t2\nu r o b u ly\nsimplified the expression\na6b7\nb. 8s12t4u3 should not contain a\nc2 e. 4s2u2 negative exponent but until\n2s10t4u\nnegative exponents are\naddressed in section 8.1e\nc. x5y t eh xe py ec sa sn l ne a wv ie hth ae\nm3n3\nf. r io t negative\n4 exponent.\nAs students write out the expanded form of the expression remind them that when you have the same\nvalue on the top and bottom of the fraction they reduce to one.\nYou may want to ask, “Why do you think that this rule is called the Quotient of Powers Property?”\nEmphasize with students that on problem d. a common mistake is to try and subtract the 6 and 2. Remind\nstudents that these coefficients are not exponents and should be simplified through division and not\nsubtraction.\n8WB8-16 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1b Homework: Product of Powers and Quotient of Powers Properties\n1. For parts a. through c. write each expression in expanded form. Then write the simplified expression in\nexponential form.\nProduct of Powers\n# Expression Expanded Form Exponential Form\na. xxxxxxxxxx x10\nb. aaabbaaabbbbb a6b7\nc. 3abc2aab 6a3b2c\nSimplify each expression.\nd. e. f. g. h.\nx18 y250 a16b25 20a7b7 3x4y2\nIf you do not get through the Quotient of Powers rule in class be selective in the prob lems that you\nassign for homework. You may have to save some of the problems for the following day.\n2. For parts a. through c. write each expression in expanded form. Then write the simplified expression in\nexponential form.\nQuotient of Powers\n# Expression Expanded Form Exponential Form\na. 444 4 41 4\n\n44 1\nb. x x 1 1\n  x4\nx xxxxx x4 x4\nc. a a a abbbbbbb ab ab\n\na a a bbbbbb 1\nSimplify each expression.\nd. e. f. g. h.\nb15 c54 p7r10 s2t4 51a3\n3. Simplify each expression.\nMixed Practice\na. b.\nd.\nc.\n8 x 3 y 3 2 4 r5 x 4 t4\n3\nx2y3\ny3z2\n2\nx2\ne. f. g. h.\n3 x2 a2b4 8y3x\nc5\n8WB8-17 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1c Class Activity: Power of a Power, Power of a Product, and Power of a Quotient\nComplete columns 2 and 3 in the table below by writing each expression in expanded form and in exponential\nform. As you are simplifying try to discover a shortcut or rule that you could use to simplify more quickly. Test\nyour shortcut in the last column and compare your answers.\nPower of a Power\nColumn 1 rewritten in expanded form or as Column 2 Test your shortcut\nrepeated multiplication. rewritten in and compare.\nexponential\nform.\n 33 33 333333 36 332  36\n a2 a2 a2 a2 aaaaaaaa a8 a24  a8\n b32  b32  b3 b3 b3 b3  b12 b322  b12\nbbbbbbbbbbbb\nThis is too long to expand, find a short cut. x4105  x200\nExplain how to find the power of a power without expanding.\nTo find the power of a power multiply the exponents and keep the base number the same.\nAlgebraic Rule for the Power of a Power:\n p\nam  amp\nSimplify each expression:\na. a15\nExplain to your students that there are several\ndifferent expansions for the expressions above. It\nwould be helpful to show multiple expansions to see\nb. b77 that you get the same simplified expression with all\nmethods.\nc. c210\nd60\nd.\ne. Explain the difference between and\nThe expression represents multiplied by itself 3 times. It simplifies to The\nexpression represents times It simplifies to .\nThink of a way to remember when to add the exponents and when to multiply them.\n8WB8-18 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Power of a Product\nColumn 1 rewritten in expanded form or as repeated Column 2 Test your shortcut\nmultiplication. rewritten in and compare.\nexponential\nform.\nabababab  aaaabbbb a4b4 ab4 a14b14\nabcabcabcaaabbbccc a3b3c3 abc3 a13b13c13\n a2b a2b a2b a2 a2 a2 bbb a6b3  a2b3 a23b13 a6b3\n 4xy2 4xy2 4xy2 4xy2 44x4y8 414x14y24 44x4y8\n256x4y8\nThis is too long to expand, find a short cut. 324a104b114 38a40b44\n6,561a40b44\nExplain how to find the power of a product without expanding.\nTo find the power of a product find the power of each factor and multiply.\nAlgebraic Rule for the Power of a Product:\nabm ambm\nSimplify each expression:\na. a5b5\nb. a6b18\nc.\nd.\ne. Create two different expressions that simplify to 46.\n 423 46\nAnswers may include .\n4343 46\nf. Explain the difference between finding and . Use the values and in your\nexplanation. Upon expanding each expression you get and If you\nsubstitute and into each expression you get and\ng. Which value is greater, or ? Explain. They are equal because .\n8WB8-19 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Power of a Quotient\nColumn 1 rewritten in expanded form or as repeated Column 2 Test your shortcut and\nmultiplication. rewritten in compare.\nexponential form.\n ba  ba  ba a b ba  ba ba 33  ba 3 ba 11  33 ba 33\n          \n 5x  5x 5x 5x 5x 22  5x 2 5x 11  22 a 522 2a 52\n         \n x zy  x zy  x zy  x zy xxx z x z y z zyyy x z4y 44  x zy 4 x1 z4 1y 414 x z4y 44\n            \n    \nThis is too long to expand, find a short cut. 10\na3 a310 a30\n   \nb5 b510 b50\n\nExplain how to find the power of a quotient without expanding.\nTo find the power of a quotient, find the power of the numerator and the power of the denominator.\nAlgebraic Rule for the Power of a Quotient:\nam am\n\n \nb bm\nSimplify each expression:\nx6\nOn practice problem d. let students show that there are multiple ways to\na.\ny6 simplify the expression. Tell students that it might be helpful to write\nin an exponent of 1 for variables that do not have exponents. This will\n52 25 remind them to “distribute” the exponent outside of the parentheses to\nb.  every number inside the parentheses. It is also helpful for some\nx8 x8\nstudents to always work from the inside of the parentheses to the\noutside. This means to simplify everything they can inside the\n4096x12\nparentheses and then “distribute” the exponent that is outside the\nc.\ny6 parentheses into the simplified expression.\nYou can talk about how the Power of Power property and the Power of\nd. 16x5y4 a Quotient property really are the same thing.\n243a30\ne.\n32\nYou may not get through this activity in one class period. Assign the problems from the aligned\nhomework assignment based on how many properties you are able to cover in class. Then assign the\nremaining problems the following day. Also be sure to summarize the rules together as a class before\nstarting the homework assignment.\n8WB8-20 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1c Homework: Power of a Power, Power of a Product, and Power of a Quotient\n1. For parts a. through c. write each expression in expanded form. Then write the simplified expression in\nexponential form.\nPower of a Power\n# Expression Expanded Form Exponential Form\na.  x3 x3 x3 x3 x12\nb.  23 23 23 23 23 215 32,768\nc.  a2 a2 a2 a2 a2 a2 a12\n  \nSimplify each expression.\nd. e. f. g. h.\nr40 y200 1,073,741,824 a150 k51\nTake some time to talk about how simplify expressions like\nthe one in part f with the calculator.\n2. For parts a. through c. write each expression in expanded form. Then write the simplified expression in\nexponential form.\nPower of a Product\n# Expression Expanded Form Exponential Form\na.  xy3 xy3 xy3 xy3 x4y12\nb.  x3y4 x3y4 x6y8\nc.  2a3c2 2a3c2 2a3c2 8a9c6\nSimplify each expression.\nd. e. f. g. h.\na42b7 a10b25 64a6b24 1,679,616a16b12 81r26\nIt might be helpful for students to write the following at the top of their homework assignment.\n“When in doubt, write it out!” This means that if they do not know what property to use they\ncan always expand the expression and simplify.\n8WB8-21 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3. For parts a. through d. write each expression in expanded form. Then write the simplified expression in\nexponential form.\nPower of a Quotient\n# Expression Expanded Form Exponential Form\na. 33  9 \n    \n55 25\nb.  c  c  c  c3\n   \nd d d  d3\nc.  x2  x2  x2  x6\n   \n y  y  y  y3\nd. 2x2x2x2x 16x4\n    \n3y3y3y3y 81y4\nSimplify each expression.\ne. f. g. h.\n4096 16b4 s10 8x3y3\na12\nt15\n4. Simplify each expression.\nMixed practice\na. b.\nc.\n24z10y8 81a4b4\n4y2x3r2\nd.\ni. e.\n144a6b14\n8x18 4a6\nb9\nf.\nj.\n7 29 x 6 y 6 z 6 g.\n3a4b3\n108a2b5\n2\n8WB8-22 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1d Class Activity: Find, Fix, and Justify\nThe following statements are incorrect. For each of the statements do the following:\n Find the mistake(s) in each statement.\n Fix the mistake.\n Justify your reasoning. You may use pictures if needed.\n1. 2. 3.\nx2x4 a3b2a4b5 a2b5ab3\n(xx)(xxxx) (aaa)(bb)(aaaa)(bbbbb) (aa)(bbbbb)(a)(bbb)\na7b7\n x6 a3b8\n4. 5. 6.\nx7 x x x xxxx x3 a6 a  a aaaa a4 b3 bbb 1\n   x3   a4  \nx4 x x x x 1 a2 a  a 1 b9 bbbbbbbbb b6\n8. 9.\n7.\n y34  y7 tw3 tw3\n12x6y3\n10x4y\ntwtwtw\n2x2y2  y3y3y3y3\n26 x xxxxx y  y y t3w3\n y3333\n\n2 x x y  y\n y12\n6x4\n 6x4y\n1\nOne way that you can implement this lesson is to give students about 10 minutes to work on these 9\nproblems. Students must use their knowledge about exponential expressions and exponent properties to find\nmistakes. This activity is meant to solidify their understanding of how exponential expressions are\nconstructed. As students analyze the structure of the expression their understanding of the exponent rule\nbecomes more concrete. When they are finished have them discuss their answers with a neighbor before\nmoving onto a group discussion. Ask for people to come to the board to show and justify how they fixed\nthe mistake in each statement.\n8WB8-23 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Some of the following statements are correct and some are incorrect. If the statement is correct justify why it\nis correct by expanding the expression. If the statement is incorrect:\n Find the mistake(s) in each statement.\n Fix the mistake.\n Justify your reasoning.\n10. Correct 11. Correct 12. Not Correct\n y232  a2b32 a4b6  5y33 5y9\n y12\n \n513y33\n2\n y2y2y2\n  53y9\n y2y2y2y2y2y2\n    125y9\n y12\n13. Not Correct 15. Correct\n14. Correct\n  53  2  9 5   dc   3  dc3 3   2 yx z   3  y8 3x z3 3\n32 9\n \n52 25\n18. 32 34 36 Not Correct\n16. Not Correct 17. Correct\n32 34 36\n4\na2 a8 a8 333333\n \n \nb3 b3 b12 98190\n \n19. Write three expressions equivalent to3292 20. Write three exponential expressions equivalent\nAnswers may include to 400. Answers may include\n3399, 32339, 333333 2452, 22102, 4100\n32(32)2, 3234\n \n3a\n21. 32. Find numbers a and b that satisfy the equation. Can you find different numbers for a and b?\n3b\nAnswers will vary. Note that a or b can be positive or negative or even rational numbers.\n22. Consider the equation, xy  yx, where x and y are two different whole numbers. Find the value for x\nand y.\nand or and\n23. You are asked to enter the following expression into your scientific calculator.\nWhich of the following is a correct way to enter the expression into a scientific calculator?\na. 4 5 b. 4 6 c. 4 2 3 d. 4 2 3\n8WB8-24 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1d Homework: Find, Fix , and Justify.\n1. Edward, Pattie, and Mitch were each simplifying the same exponential expression. Their work is shown\nbelow. Determine who has simplified the expression correctly. If they did not simplify the expression\ncorrectly, identify the mistake, explain it, and fix it.\nEdward\n2 2\n 4   4 \n3x 2x\n 2\n3 6\n  =   = 2x = 2x\n 6x   x \nEdward is not correct when he simplified the constants he wrote the 2 in the numerator and not\nthe denominator. He also did not square the 2 in the last step.\nPatti\n2\n 3x4  32 x8 9x8 x6\n  = = =\n62 x2 36x2\n 6x  4\nPatti and Mitch are both correct. They simplified the expression differently but both arrived at\nthe right answer.\nMitch\n2 2 2\n 4   4   3  6\n3x x x x\n  =   =   =\n 6x   2x   2  4\n8WB8-25 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 2. Find the value of 18, 19, 110, and 10. What can you say about the value of any power of 1?\nThey all equal 1. One to any power is 1.\n3. What is the area of a square with a side length of ?\n9a10\n4. What is the area of a rectangle with a length of units and a width of units?\n72x5\nunits\n5. You are asked to enter the following expression into your scientific calculator.\nWhich of the following is not a correct way to enter the expression into a scientific calculator?\na. 5 2 5 b. 5 10 c. 25 5 d. 5 7\n6. You are asked to enter the following expression into your scientific calculator.\n4\n2\n \n3\nWhich of the following not a correct way to enter the expression into a scientific calculator?\na. 2 3 4 b. ( 2 3 ) 4 c. 2 4 3 4\n7. Given the statement, 3a3b 310. Find two numbers for a and b that satisfy the equation. Can you find\ndifferent numbers for a and b?\nAnswers can include any values where\n8. Given the statement,  3ab 330. Find two numbers for a and b that satisfy the equation. Can you find\ndifferent numbers for a and b?\nAnswers can include an values where\n9. Make up your own problem that requires two Properties of Exponents to simplify. Be sure to show your\nanswer.\nAnswers will vary.\n10. Make up your own problem that requires two different properties than the ones you used in number 9.\nBe sure to show your answer.\nAnswers will vary.\n11. On Tuesday, you invited 2 friends to your party. On Wednesday, each of these friends invited 2 other\nfriends. This pattern continued Thursday and Friday. How many people were invited on Friday? Write\nthe answer as a power. How many people were invited in all? Explain your reasoning.\n24\nOn Friday 16 or people were invited to the party. Altogether 30 people were invited.\n8WB8-26 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1e Class Activity: Zero and Negative Exponents\nThe table below lends itself to a lot of discovery and discussion. It will be used to help explain the meaning of negative\nexponent and numbers with a zero exponent. This class activity will most likely take more than one day to complete.\n1. Complete the table below. (Hint: Use the patterns in the Powers of 10 section to help with the Powers of\n2 section.)\nPOWERS of 10 POWERS of 2\nWords Number (as Number (as Number Number Number\ndecimals) Fractions) (with Powers) (with\nPowers)\na. One Million 1,000,000 1,000,000 106 64 26\n1\nb. One Hundred 100,000 100,000 105 32 25\nThousand\n1\nc. Ten Thousand 10,000 10,000 104 16 24\n1\nd. One Thousand 1,000 1,000 103 8 23\n1\ne. One hundred 100 1 00 102 4 22\n1\nf. Ten 10 10 101 2 21\n1\ng. One 1 1 100 1 20\n1\nh. One Tenth .1 1 1 1 21\nor 101\n101 2\n10\ni. One Hundredth .01 1 1 1 22\n102\n100 102 4\nj. One Thousandth .001 1 1 1 23\n103\n1,000 103 8\nk. One ten .0001 1 1 1 24\n104\nthousandth 10,000 104 16\nl. One One Hundredth .00001 1 1 1 25\n105\nThousandth\n100,000 105 32\nm. One Millionth .000001 1 1 1 26\n106\n1,000,000 106 64\n2. Complete this sentence: Any number with a zero exponent is…1\nSee teacher note at the bottom of page 28 for discussion surrounding\n3. Explain what happens to the size of the numbers as you move up the column from 101.\nThey get bigger or you multiply by a factor of 10.\n4. Explain what happens to the size of the numbers as you move down the column from 101.\nThey get smaller or your divide by a factor of 10.\n1 1\n5. Write 52 as a fraction. Writex6 as a fraction.\n52 x6\n8WB8-27 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Zero Exponent Property\nQuotient Expanded Form Simplified Thus… Any fraction that\nhas the same\nnumerator and\ndenominator\n=1\nequals 1.\nQuotient Simplify using Thus… Zero Exponent Property Any number\nthe Quotient to the zero\nRule power\ne Tq hu isa cls l1 w.\nSince\ne l ill\nn sue med to b ize\nSince\nm ar e d\ntogether as a\nSince class.\nAlgebraic Rule for a Zero Exponent:\nSimplify each expression:\na. 1 b. 1\nc. 1 d. 1\nf.\ne.\nThe tables given above may be challenging for your students to complete on their own. Give Honor’s\nstudents the opportunity to grapple with it and see what they come up with. You will want to summarize the\nlearning that takes place here. That is, through the Quotient Rule and the fact that a fraction with the same\nnumerator and denominator simplifies to 1; we can show that .\nThe statement given in number 2 on page 29 presents a problem if we are dealing with Check out the\nlinks below to help you give clarity as you discuss this with your students.\nhttp://www.askamathematician.com/2010/12/q-what-does-00-zero-raised-to-the-zeroth-power-equal-why-\ndo-mathematicians-and-high-school-teachers-disagree/\nhttps://www.math.hmc.edu/funfacts/ffiles/10005.3-5.shtml\n8WB8-28 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Negative Exponent Rule\nQuotient Column 1 rewritten in expanded form or as Column 1 simplified using Compare your\nrepeated multiplication. the Quotient Rule. answers; one written\nas a fraction and the\nother in exponent\nform.\nThis is too long to expand, find a short cut.\nExplain what a negative exponent means:\nanis the reciprocal of an. Likewise an is the reciprocal of an\nAlgebraic Rule for Negative Exponents:\n1 Discuss with students that at this point in order for the expression to be\nan \nan completely simplified it must not contain a negative exponent.\nSimplify each expression:\n1 1 1 1\na.  b. c.\n41 4 x2 x3y4\nb4 1 a2bc3 b5\nd. e. a5 f.\na3 a5 a3b4 ac3\ng. m5n m3  m32 1\nh. i.\nm2n3 n2 m6\nFor expressions f. through i. above point\nout the several different ways to simplify\n1. Simplify each of the following and order them from least to greatest.\neach expression; for example, in part g.\n1\n64 60 64 64 1296, , 1, 1296 they can apply the product rule first and\n1296 add the exponents or they could use the\nnegative exponent rule and move n-2 to\n2. What is the difference between , and\nthe denominator first and then use the\n, and . Quotient Rule to finish simplifying.\nIt might be helpful to tell students that the\n3. What is the difference between and ? sign of the exponent changes as you move\nthe number between the numerator and\nand\ndenominator of the fraction.\nFor number 2 ask students to evaluate\n4. What is the difference between and ? each expression for . Ask; what\nvalue of f would yield the same result\nwhen evaluated?\nand\n8WB8-29 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1e Homework: Zero Exponent and Negative Exponents\nDirections: Simplify each expression. The simplified expression should not include any negative exponents.\n# Expression Expanded Form Simplified Solution\n1. mmmm2m1m1m1 2m\n2. 4r1r1r1r r 4r1 4\nr\n3. c cccd c3\nc dddd d3\n4. 3 w w w 1\n37ww w w w 7w2\n5. x  y  z z z\nx x  y  z x\n6.  4x0 4x0 4x0 4x0 414141414444 256\n7. 4x0 y1y1z1z1z1 1 1\n\n4x y1 xyzzz xyz3\nDirections: Use the properties of exponents to simplify each expression.\n1 9. 1 1\n10.\n8.\nx4 81\n11. 1 4 1\n12. 13.\nx4 16x8\n14. 256 1 1\n15. 16.\n4xy 2\n3 1 1\n17. 18. 19.\nm7 2 4x5\n8WB8-30 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1f Class Activity: Properties of Exponents Game and Mixed Practice\nDirections: Complete each exponent property by filling in the space.\n1.\n2.\n3. 4.\n6.\n5.\nMake a class set of the following puzzle and cut it out; direct students to\nassemble the puzzle so that each expression touches or lines up with its\n7.\nsimplified form. Have fast finishers simplify the expressions on the border\nof the puzzle that do not match up with the simplified expressions.\nOnce you have received the exponent puzzle from your teacher assemble the puzzle so that each expression\ntouches or lines up with its simplified form.\n1\n1\n2\n5\n8WB8-31 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1f Homework: Properties of Exponents Mixed Practice\nDirections: Simplify each expression. Assume that no denominator is equal to zero.\n1. x8 2. a26\n3. 6y10 4. 45j9\n5. x10 6. a18\n7. h12 8. k30\n9. x7y7 10. 16g2z2\n11. 8a12w3y12 12. 3k4m16\n13. d4 14. t6\na3b3\n15. 16. xz\nd\n8WB8-32 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 16 16\n17. 18.\n25 81\nx3 c15\n19. 20.\n27 b15\n1\n21. 22. 3c2\nx4\n6\n23. s7 24.\np4\n25. 1\n1\n26.\n27. 262,144 28. b5c6\n29 ab 3c3\n29. u3v9 30.\n2\nw14\n9a2\n31.\n32.\n4 x2\n8WB8-33 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.1g Self-Assessment: Section 8.1\nThe indicators given in this rubric are sample indicators.\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept.\nSkill/Concept Minimal Partial Sufficient Substantial\nUnderstanding Understanding Understanding Understanding\n1 2 3 4\n1. Apply the properties I can apply the I can apply the I can apply the I can apply the\nof integer exponents properties of properties of properties of properties of\nto simplify algebraic integer exponents integer exponents integer exponents integer exponents\nand numerical to simplify 1 of to simplify 2 of to simplify 3 of to simplify all 4 of\nexpressions. the expressions the expressions the expressions the expressions\ngiven. given. given. given.\nSee sample problem #1\nSample problem #1\nUse the properties of exponents to simplify each expression.\n3 b. (xy3)2(x2y)4 x10y10\na. 3r4\nr4\nc. 9a2b4c2 3b3 d. 1 r22  s0r3 r7\n \n3a5bc4 a3c2 2  4\n8WB8-34 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 8.2: Scientific Notation\nSection Overview:\nThe first lesson in this section is a review of place value and powers of ten. In order to properly access and\nunderstand how scientific notation works students must have a solid foundation of place value and how powers\nof ten show the relationship between digits that are next to each other in a multi-digit number. They will use this\nfoundation to compare numbers written as a single digit times an integer power of ten by a scale factor. After\nreviewing place value students learn to change numbers between standard form and scientific notation in order\nto estimate very large and very small quantities. Students also learn how to operate with numbers in scientific\nnotation so they can compare and express how many times as much one number is to another. As they are\nproblem solving with scientific notation they must choose units of appropriate size for measurements of very\nlarge or very small quantities. Finally, students will use scientific notation to solve in a variety of contexts that\nrequire the use of very large and very small numbers.\nConcepts and Skills to master:\nBy the end of this section students should be able to:\n1. Use numbers expressed in the form of a single digit times an integer power of 10 to estimate very large\nor very small quantities, and to express how many times as much one is than the other.\n2. Convert a number between scientific notation and standard form.\n3. Perform operations with numbers expressed in scientific notation.\n4. Choose units of appropriate size for measurements of very large or very small quantities.\n5. Interpret scientific notation that has been generated by technology.\n6. Use scientific notation to problem solve with really small and really large numbers.\n8WB8-35 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2a Class Activity: Place Value and Powers of Ten\nDo not let students use a calculator with this lesson.\n1. Fill in the top row of the place value chart below with the name of the place value that each number digit\ngiven refers to. See page 27 if you need a reminder.\nB H T M H T T H T O T H T T H\ni l l i o n s u n d r e d M i l l i o e n M i l l i o n s i l l i o n s u n d r e d T h o u s a e n T h o u s a n d s h o u s a n d s u n d r e d s e n s n e s e n t h s d tu hn sd r e h o u s a n d t h s e n T h o u s a n d t h u n d r e d t h T h o u\nn n s s\ns d a\ns n\nd\nt\nh\ns\n1 5 8 8 4 6 3 1 0 8 . 7 3 4 1 1\n109 108 107 106 105 104 103 102 101 100 10-1 10-2 10-3 10-4 10-5\nThe p roblems below are not intended to teach scientific notation. They are meant to access a student’s background\nknowledge of how to write and estimate numbers using powers of ten. See standards 5.NBT 1 and 2 from 5th grade\nmath and standard 8.EE.3.\n2. Fill in the power of ten in the last row in the table above that corresponds with each place value. Some\nof them have been filled in for you.\nSee table above.\n3. What is the value of the 6 in the chart above?\n60,000\n4. What is the value of 7 in the chart above?\n0.7 or seven tenths.\n5. Write each number given below as a single digit times an integer power of 10. The first one has been\ndone for you.\na. b. c.\nd. e. f.\n8WB8-36 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 6. Estimate each number by writing it as a single digit times an integer power of 10.\na. The land area of Canada is b. An adult blue whale can eat c. The distance between Pluto\n499,000,000 square 41,000,000 krill in one day. and Earth is 4,670,000,000\nkilometers. miles.\nd. The diameter of the average e. A sample of sand from a f. The width of the diameter\nhuman body cell is 0.00012 beach has 21,450,000 grains of a piece of fishing line is\nmeters. of sand. 0.000017 meters.\n7. Rearrange all the digits and decimal below to build a number with the given conditions. If needed write\nthese numbers on a separate piece of paper and cut them out to rearrange them.\n3 0 7 8 .\na. Build the largest number\n8730 The purpose of this lesson is to refresh your\nb. Build the smallest number students’ knowledge of place value and\n.0378 powers of 10. This knowledge is a key\nc. Build a number less than 8 component to truly understanding the\nSample answer; 7.308 structure of scientific notation and how it is\ncomprised of powers of 10. A good\nd. Build a different number less than 7\nfoundation in place value will help with\nSample answer; 3.078\nperforming operations in scientific\ne. Build a number between 70 and 80\nnotation.\nSample answer; 70.83\nf. Build a number than rounds to 70\nYou could definitely bring in some base ten\nSample answer; 70.38\nblocks to investigate many of the questions\ng. Build a number that is between 7000 and 8000\nin this section.\nSample answer; 7830\nh. Build a number that is closest to 3\n3.078\ni. Build a number that is between 0.7 and 0.8\nSample answer; 0.7830\n8WB8-37 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8. Fill in the missing entries in the tables below. You may have to find and follow a pattern.\n0.004 × 10 = 0.04 1280 × = 128\n0.04 × 10 = 0.4 128 × = 12.8\n0.4 × 10 = 4 12.8 × = 1.28\n4 × 10 = 40 1.28 × = 0.128\n40 × 10 = 400 0.128 × = 0.0128\n400 × 10 = 4,000 0.0128 × 0.00128\n9. Use the tables above to fill in the missing words in the statement below.\nIn a multi-digit number, a digit in one place represents __ten_________ times as\nmuch as it represents in the place to its right and _____one-tenth _____of what it\nrepresents in the place to its left.\n10. Explain the relationship between the two 3’s in the number 533,271.\nThe 3 in the ten thousands place is ten times as much as the 3 in the thousands place. The 3 in the\nthousands place is one-tenth of the 3 in the ten thousands place.\nThe sta tement in number 9 is Standard 5.NBT.A.1 from 5th grade math. It is a prerequisite standard for\nstudents to fully understand scientific notation which is why we are reviewing it here.\n11. Daxton’s Candy (adapted from an Illustrative Mathematics Task)\na. Daxton has a digital scale. He puts a Marshmallow Peep on the scale and it reads 6.2 grams. How\nmuch would you expect 10 Marshmallow Peeps to weigh? Why?\nTen Marshmallow Peeps will weigh 62 grams. You can move the decimal one space to the right to\nmultiply by ten.\nb. Daxton takes the marshmallows off the scale. He then puts on 10 jellybeans and the scale reads 12.0\ngrams. How much would you expect 1 jellybean to weigh? Why?\nOne jellybean will weigh 1.2 grams. You can move the decimal one place to the left to divide by ten.\nc. Daxton then takes off the jellybeans and puts on 10 cinnamon bunnies. The scale reads 88.2 grams.\nHow much would you expect 1,000 cinnamon bunnies to weigh? Why? One thousand cinnamon\nbunnies will weigh 8820 grams. Since 1,000 is 100 times as much as 10 you want to multiply by\n100. You do this by moving the decimal two places to the right to multiply by 100.\nd. Estimate how many jellybeans equal one cinnamon bunny.\nOne cinnamon bunny equals approximately 7.3 jelly beans\n8WB8-38 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 12. If one package of cereal costs $2.46, then,\na. 10 will cost_______$24.60_______\nb. 100 will cost_______$246________\nc. 1,000 will cost_______$2,460______\nd. 1/10 of the package will cost________ $0.25______\ne. 1/100 of the package will cost_______ $0.03______\n13. Ten thousand is how many times bigger than 100? (Hint: Remember the statement you completed on the\nprevious page.)\n10,000 is 100 times bigger than 100.\nSpend some time investigating this problem. Use the statement on the previous page to help students\nrecognize that every additional digit or place value changes the number by a scale factor of 10. Since\nthere are two additional digits of 0 in 10,000 compared to 100, then the number changes by a factor of\n. Thus 10,000 is 100 times bigger than 100.\n14. Now write 100 and 10,000 as a single digit times an integer power of ten.\nand\nUse the powers of ten to determine how many times bigger 10,000 is than 100.\nThe difference between the powers of ten is so 10,000 is 100 times bigger than 100.\nStudents should answer the remaining problems by using what they know about powers of ten. They are\ntechnically also using scientific notation. However, the focus should be on how additional powers of ten\nincre ase the value of a number by a scale factor of 10. This is addressing standard 8.EE.3 which\nemp hasizes writing numbers as a single digit times an integer power of ten to estimate and make\ncom parisons.\n15. Write each number as a single digit times an integer power of ten to determine how many times bigger\none is compared to the other.\na. 1,000,000 and 100 b. 10,000 and 10 c. 0.0001 and 0.000001\nand and and\n1,000,000 is 10,000 is times 0.0001 is times\ntimes bigger than 100. bigger than 10. bigger than 0.000001.\nd. 0.001 and 0.00000001 e. 10 and 0.01 f. 200,000 and 2,000\nand and and\n0.001 is 10 is times 200,000 is times\ntimes bigger than bigger than 0.01. bigger than 2000.\n0.00000001.\n8WB8-39 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 16. Write each number as a single digit times an integer power of ten to determine how many times bigger\none is compared to the other.\na. 60,000,000 and 30,000 b. 70,000 and 200 c. 0.0004 and 0.0000003\nand and and\n60,000,000 is 700,000 is 0.0004 is\ntimes bigger times bigger than 200. times bigger\nthan 30,000. than 0.0000003.\nd. How many hundreds are in a e. How many thousands are in a f. How many pennies are in\nthousand? million? $100?\nThere are 10 hundreds in a A thousand thousands are in a There are 10,000 pennies in\nthousand. million. $100.\nAgain, the focus here is not to do operations in scientific notation but rather for students to use place\nvalue and powers of ten to make comparisons. For example, on part g. in the table above a student might\nreason that the difference between a place value of and is Also 3 goes into 6 two times.\nThus a scale factor of defines how many times bigger sixty million is than 30,000.\nIf needed estimate each number given in the problems below by writing it in the form of a single digit times an\ninteger power of 10 and use your estimates to approximate each answer.\n17. Company A’s net profit for the year was $323,000. Company B’s net profit for the year was\n$49,500,000. Approximately how many times larger is Company B’s profit than Company A’s profit?\nand ; Company B made more than 200 times as much money as Company A.\n18. A species of bacteria is 0.00013 decimeters long. A virus is 0.000000012 decimeters long.\nApproximately how many times longer is the bacteria than the virus?\nand ; The bacteria is 10,000 times larger than the virus.\n19. The E. coli bacterium is about 0.0000005 meters wide. A hair is about 0.000017 meters wide.\nApproximately how many times longer the hair is than the bacteria?\nand ; The hair is more than 40 times wider than the bacteria.\n20. The mass of the earth is about kilograms. The mass of Mercury is about kilograms.\nApproximately how many times larger is the mass of Earth than the mass of Mercury?\nEarth is about 20 times larger than Mercury.\nP roblems similar to the ones above will be visited later on after students have worked with scientific\nn otation in a variety of ways. They will learn that by changing these numbers into scientific notation\nand dividing they can easily and accurately answer these questions.\n8WB8-40 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2a Homework: Place Value and Powers of Ten\n1. Write each number given below as a single digit times an integer power of 10.\na. b. c.\nd. e. f.\n2. Estimate each number by writing it as a single digit times an integer power of 10.\na. The land area of Australia is b. The cornea of an eye is c. The distance between\n2,967,892 square kilometers. 0.00058 meters thick. Jupiter and Earth is\n365,000,000 miles.\nd. A large earthquake slowed e. An average cell phone has f. The thickness of a piece of\nthe rotation of the Earth, 918,440 germs on it. paper is 0.001076 meters\nmaking the length of a day\n0.00000268 seconds shorter.\n3. Rearrange all the digits and decimal below to build a number with the given conditions. If needed write\nthese numbers on a separate piece of paper and cut them out to rearrange them.\n7 4 0 2 .\na. Build the largest number\n7420\nb. Build the smallest number\n.0247\nc. Build a number less than 7\nSample answer; 4.027\nd. Build a different number less than 6\nSample answer; 2.704\ne. Build a number between 70 and 80\nSample answer; 74.02\nj. Build a number than rounds to 70\nSample answer; 70.42\nk. Build a number that is between 7000 and 8000\nSample answer; 7402\nl. Build a number that is closest to 4\n4.027\nm. Build a number that is between 0.7 and 0.8\nSample answer; 0.724\n8WB8-41 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 4. At the store 4 pounds of salmon cost $48, how much would 40 pounds of the same salmon cost?\n40 pounds of the same salmon will cost ten times as much as 4 pounds of salmon. 48 times 10 is $480.\n5. Fill in the blanks.\na. $12.50 =________10___________ × $1.25\nb. $125=_________100________× $1.25\nc. $1,250=________1,000_________× $1.25\n6. The following problem is given to Miranda:\n23.10100\nShe states that since she is multiplying by 100 she simply must add two zeros to 23.10. Explain the\nerror in Miranda’s thinking and explain how to find the correct answer without using a calculator or long\nmultiplication. Multiplying by 100 indicates moving the decimal two places to the right; this will give\nyou 2,310.\n7. Write each number as a single digit times an integer power of ten to determine how many times bigger\none is compared to the other.\na. 8,000,000 and 300 b. How many ten dollar bills are c. 0.007 and 0.000005\nand in $100,000? and\n8,000,000 is and 0.007 is\ntimes bigger than There are 1,000 ten dollar bills times bigger than 0.000005.\n300. in $100,000\nd. 9,000,000 and 300 e. 70,000 and 200 f. How many millions are in a\nand and trillion?\n9,000,000 is 70,000 is and\ntimes times bigger than 200. A million millions are in a\nbigger than 300. trillion.\nIf needed estimate each number given in the problems below by writing it in the form of a single digit times\nan integer power of 10 and use your estimates to approximate each answer.\n8. Website A gets 5,000,000 hits in one day. Website B gets 4,000 hits in one day. Approximately how\nmany times more hits does Website A get than Website B?\nand ; Website A gets more than 1,000 times more hits than Website B.\n9. Picoplankton can be as small as 0.00002 centimeters. Microplanton can be as small as 0.002\ncentimeters. Approximately how many times larger are Microplankton than Picoplankton?\nand ; The Microplankton is 100 times bigger than the Picoplankton.\n10. The population of the United States is estimated to be 3108while the population of the Earth is\nestimated to be 7109. Approximately how many times larger is the population of the Earth compared\nto the population of the United States.\nand The population of the earth is more than 29 times larger than the population of\nearth\n8WB8-42 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2b Class Activity: Scientific Notation Part 1\nThink about the following question: Why do you text?\nMost of us would agree that texting is a fast and efficient way of communicating. In fact, texting allows us to\nabbreviate many common phrases. Mathematicians and scientists have a way of expressing really large and\nreally small numbers in a fast and efficient way; it is called Scientific Notation. Just like texting allows you to\ncommunicate quickly, scientific notation is a special way of writing a number that would otherwise be tedious\nto write if it were left in standard form. Scientific notation is very similar to writing a number as the product of a single\ndigit and an integer power of ten, a skill they learned in the previous section.\nThe four expressions written below represent the same number. Write the number in Standard Form on a\nsheet of paper or mini-white board.\nYou may need to remind them that a number written in standard form is writing a number using the digits 0-9;\nthis is the form in which they are used to writing numbers.\nDiscussion: What expression did you use to write the number in standard form? Why?\nCheck the other expressions to see if they give you the same number.\nAre all of these expressions written in scientific notation? (It is important to note that all of these expressions are\nwritten in Scientific Notation. However, the expression, , is the only expression written in what is called\n“Normalized Scientific Notation”. This particular way of writing an expression is often the preferred and only\naccepted form of scientific notation.)\nAt this point it is okay that students do not formally know how to change a number from standard form into\nscientific notation. This discussion is meant to help students begin to surface their ideas and background\nknowledge about scientific notation. Encourage students to share what they do know about converting between\nthe two forms.\nWhich of the expressions given below is greater?\nOnce students have decided which expression they think is bigger ask them to discuss their answer\nwith a neighbor. Then move to a group discussion, a common mistake is to ignore the exponents and\nassume that since 6 is twice as big as 3 the first expression is bigger. Or that since the first expression\nhas an exponent of -5 then it is bigger (even though -5 is smaller than -2). Begin to identify patterns.\nAsk them what they know about negative exponents. Tell students to write down key ideas in the\nblank space on this page.\n8WB8-43 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Matching Activity\n(Adapted from a MARS task found at: http://map.mathshell.org/materials/download.php?fileid=1221)\nCut out the cards and arrows given below. Work with a partner to match the number written in standard form\nwith the number given in scientific notation. Do not worry about the Object and Arrow Cards right now. If\nthere appears to be no match then write the corresponding number on the blank card to make a match. Lay your\ncards next to each other on your desk and be ready to defend and discuss your answers.\nStandard Form Scientific Notation Object\n0.0001 m Thickness of a sheet of\npaper\n0.006 m Length of an ant\nBlank Card\n0.15 m m Length of a pencil\n2 m m Height of the average NBA\nBlank Card basketball player\n20 m m Height of a Red Maple tree\n60 m m Wingspan of a Boeing 777\naircraft\n300 m m Length of a cruise ship\n8,000 m m Height of a mountain\n400,000,000 m m Distance to the moon from\nEarth.\n8WB8-44 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. A s students are matching the cards they should begin to formalize some general procedures for converting\nbe tween standard form and scientific notation. After the whole class has finished matching the cards ask\nso meone to explain their procedures, ask them about the cards with a negative exponent. It might be useful\nto draw the positive number line, mark the point 1, and identify points to the left of 1 as having negative\nex ponents, and points to the right as having positive. Do they prefer to go from standard form to scientific\nno tation or vice versa? Does the exponent always indicate the number of zeros in standard form?\nW rite the definition for Scientific Notation together as a class.\nA number that is in Scientific Notation takes on the form a10n where a is called the significant\nfigure and 1a10 and n is an integer. The nu mber after the , or 10n, is called the order of\nmagnitude.\nR efer to the Chapter 8 Mathematical Foundation and look at the discussion on significant figures and order\nof magnitude so you can talk about a context where these terms are applied and important.\nT he cards on the previous page are mixed up in the student version of the workbook so that they will not\nkn ow the answers. Provide students with an envelope or paper clip to store their cards for use in a later\nse ction.\n8WB8-45 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2b Homework: Scientific Notation Part 1\n1. The table below includes numbers written in standard form or scientific notation. Change the numbers\nwritten in scientific notation into standard form and vice versa. Use a calculator if needed.\nS cientific Notation Standard Form Scientific Notation Standard Form\nCalculator Exponent Standard Number Calculator Exponent Standard Number\nNotation Notation Notation Notation\nFollow the Pattern\na. 100 1 2\nb. 101 10 20\nc. 100 200\nd. 10^3 103 1,000 2,000\ne. 10^4 104 10,000 20,000\nWatch for Patterns\nf. 4,000 4. 4,200\ng. 600,000 690,000\nh. 700,000,000 712,000,000\ni. 8,100 81,000\nj. 4,000,000,000\n2. From the table above, write two things you learned about scientific notation.\nSee student answer.\n3. Complete the following statements:\na. In scientific notation, as the exponent power goes up by 1, the standard number’s decimal is…\nmoved one place to the right.\nb. In scientific notation, as the exponent power goes down by 1, the standard number’s decimal is…\nmoved one place to the left.\n8WB8-46 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2c Class Activity: Scientific Notation Part 2\nRecall the definition for scientific notation\nA number that is in Scientific Notation takes on the form a10n where a is called the significant\nfigure and 1a10 and n is an integer. The number after the , or 10n, is called the order of\nmagnitude.\n1. Change these LARGE scientific notation numbers to standard notation and vice versa. Make up a\nnumber for the blank cells.\nScientific Notation Standard Notation Scientific Notation Standard Notation\na. 634500000 e. 5,320\nb. 80400 f. 420,000\nc. 426000 g. 9,040,000,000\nd. See student answer See student answer h. See student answer See student answer\n2. Now try these SMALL numbers. See if you can figure out the method (one example is given). Make up\na number for the blank cells.\nScientific Notation Standard Notation Scientific Notation Standard Notation\nExample: Example:\n0.0032 0.0000054\na. 0.000000042 e. 0.00075\nb. 0.000000812 f. 0.004005\nc. 0.007625 g. 0.00000000092\nd. See student answer See student answer h. See student answer See student answer\n3. Express 4,532,344 in scientific notation with 3 significant figures.\n4. Express 0.00045323 in scientific notation with 2 significant figures.\n5. Type the following into a calculator: 5,555,555,555 multiplied by 5,555,555,555. What does the answer\nsay?\nBe mindful that different calculators display a number in scientific notation in different\n3.086E19\nways. Be sure to address the differences that may arise.\n8WB8-47 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Some calculators can give you answers in scientific notation. Other calculators have different ways of\ndisplaying scientific notation. One way they can display scientific notation is 3.08E19. This means3.081019.\n6. Write this number in standard form.\n30,800,000,000,000,000,000\n7. A calculator gives you an answer of 5.025E , write this number in scientific notation and standard\nform.\n00502\n8. A calculator gives you an answer of 9.22E8. Write this number in scientific notation and standard form.\n922,000,000\n9. Enter the following problems into your calculator, write the answer in scientific notation and standard\nform. Express your answer with three significant figures.\na.  3105  5.45106 b.  3.2102  5.4102 c. (2108)(1.4103)\n5.75106 5.39102 2.80105\n5,750,000 539.968 280,000\n10. Explain why the numbers and are not written in scientific notation.\nIn order for a number to be written in scientific notation the value of the significant figure must be\ngreater than or equal to one and less than 10. In the examples given above the significant figure does not\nfit this criteria.\n11. Observe the numbers given below, if the number is written in scientific notation circle it. If it is not\nwritten in scientific notation change it to scientific notation. You will need to think about how many\nspaces you will have to move the decimal and how that will affect the exponent.\na. 348108 b. 0.004026109 c. 0.00742103\n3.481010 4.026106 7.42106\nd. 45.5106 e. 6.05104 f. 3.03554107\n4.55105\nStudents often struggle with writing numbers in scientific notation if they are not originally in standard\nform. Talk to them about what direction they are moving the decimal point and how it will affect the order\nof magnitude. Students might opt to just change the number to standard form and then into scientific\nnotation.\n8WB8-48 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 12. As of September 2014 Facebook was worth $2,000,000,000. Write this number in scientific notation.\n2109\n13. The diameter of a human hair is 0.000099 meters long. Write this number in scientific notation.\n9.9105\nYou might want to review the metric system before completing the problems below. The metric system is similar\nto scientific notation in that it uses powers of ten to express the same number in many different ways.\n14. A computer at a radio station stores all of the station’s music digitally. The computer can display the\namount of time it will take to play through its entire library of music. The DJ can choose if she wants to\ndisplay this total amount of playing time in seconds, minutes, hours, and years. The radio station has\nabout 7,000 songs on the computer that have an average playing time of 3 minutes for each song.\na. Calculate the total amount of music in minutes that is on the radio station’s computer. Write this\nnumber in scientific notation.\nminutes\nminutes\nb. If the D.J. is planning a playlist for the entire week, should she display the total amount of time in\nseconds, minutes, hours, days, or years? Convert the playing time into your desired unit of time.\nDays would probably be the best unit of time to choose. The total playing time is 14.58 days. The\nD.J. needs to know if she has enough music to cover the seven days in a week.\n15. The mass of a snowflake is approximately 0.000003 kilograms.\na. Write this number in scientific notation.\n3.0106kilograms\nb. If you are only concerned about the mass of one snowflake circle the unit below that would best\nrepresent this quantity. Convert the mass of the snowflake to your chosen unit of measurement.\nMilligrams Grams Kilograms\nThe mass of the snowflake is 3 milligrams.\nc. Suppose there are approximately 1,000,000 snowflakes in one giant snowball. What unit should you\nchoose to represent the weight of the snowball? Find the mass of the snowball with your chosen unit.\nThe snowballs weight 3000 grams.\nd. A snowplow is removing snow from a parking lot and dumping it into a dump truck. What unit of\nmeasurement would be most appropriate to represent the weight of the snow in the truck?\nKilograms would be the best unit of measurement for the weight of the snow in the truck.\n16. A seafloor spreads at a rate of 10 centimeters per year. If you collect data on the spread of the sea floor\neach week what unit of measurement would be most appropriate to use? Convert the rate at which the\nseafloor spreads to your chosen unit of measurement.\nMillimeters Centimeters Meters\nMillimeters per week would be most appropriate because 10 centimeters per year yields .83 centimeters\nper month and about .2 centimeters per week. This is approximately 2 millimeters.\n8WB8-49 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 17. Change each number below to scientific notation then fill in the blank with the best unit of measure from\nthe column to the right.\nmillimeters\na. The E. coli bacteria has a width of 0.0005 __millimeters_____. kilometers\n5104 meters\nmeters/second2\nb. The acceleration of a bullet is 1,700,000 ___meters/second2__________. nanometers/second2\nmiles/second2\n1.7106\nfeet\nc. The thickness of a piece of paper is 0.1 _millimeters____. millimeters\n1101 meters\nnanograms\nd. The mass of a dust particle is 0.753_______nanograms______. grams\n7.53101 decagrams\nnanograms\ne. The consumption of cereal in the United States is centigrams\n1,350,000,000________________kilograms___________. kilograms\n1.35109\npennies\nf. The net worth of the richest person in the United States is dollars\n46,000,000,000 ________dollars_____________. nickels\n4.61010\npounds\ng. The size of a drop of water is .002083 _______ounces_____. ounces\n2.08103 tons\nAsk them to think about what they are measuring and what kind of unit describes this measurement. A\ngreat extension would be to change these numbers to different metric units. For example, in part d ask\nstudents how many grams 0.753 nanograms is equivalent to(7.531013g).\n8WB8-50 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2c Homework: Scientific Notation\n1. Change these LARGE scientific notation numbers to standard notation and vice versa. Make a number\nup for the blank cells.\nScientific Notation Standard Notation Scientific Notation Standard Notation\na. 11012 1,000,000,000,000 e. 4.56103 4,560\nb. 9.3106 9,300,000 f. 1.22106 1,220,000\nc. 7.8321010 78,320,000,000 g. 1.405109 1,405,000,000\nd. See student See student answer h. See student answer See student answer\nanswer\n2. Now try these SMALL numbers. Make a number up for the blank cells.\nScientific Notation Standard Notation Scientific Notation Standard Notation\na. 5104 0.0005 e. 6.5103 0.0065\nb. 6.8107 0.00000068 f. 5.005103 0.005005\nc. 3.065108 0.00000003065 g. 7.09109 0.00000000709\nd. See student answer See student answer h. See student answer See student answer\n3. Change the numbers below into scientific notation.\na. 0.00036 b. 0.00036 c. 36,000 d. 36,000\n3.6104 3.6104 3.6104 3.6104\n4. Express the numbers below in scientific notation with 3 significant figures.\na. 4,651,284 b. 0.0005643411\n4.65106 5.64104\n5. A calculator gives you an answer of 4.02E , write this number in scientific notation and standard\nform.\n00000402\n6. A calculator gives you an answer of 2.21E7, write this number in scientific notation and standard form.\n22,100,000\n8WB8-51 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7. Enter the following problems into your calculator, write the answer in scientific notation and standard\nform. Express your answer with three significant figures.\na.  2104  1.35107 b.  3.2108  5.4109 c. (21011)(1.4103)\n1.35107 2.66108 2.8108\n13,520,000 0.0000000266 280000000\n8. The nucleus of a cell has a diameter of 1 micrometer that is equivalent to 0.000001 meters. Change this\nnumber to scientific notation.\n1106\n9. The length of a DNA nucleotide building block is about 1 nanometer that is 0.000000001 meters.\nChange this number to scientific notation.\n1109\n10. Teenagers spend $13 billion on clothing each year. Change this number to scientific notation. (Go back\nand look at your place value chart if you don’t know how many zeros a billion has.)\n1.31010\n11. A bakery is making cakes for a huge weeklong city celebration. The recipe for each cake calls for 96\ngrams of sugar. Each cake serves 12 people and the city plans on serving 1500 slices of cake per day for\n7 days.\na. How many total cakes does the bakery need to make?\nThe bakery needs to make 875 cakes for the celebration.\nb. If the bakery wants to know how much sugar to purchase for the entire event choose the best unit of\nmeasurement that would be the most appropriate to use. Find the amount of sugar needed based on\nthe measurement you chose.\nGrams Kilograms Tons\nThe bakery needs to purchase 84 kilograms of sugar.\nc. Rosa is very health conscious and wants to know how much sugar is in her piece of cake. Determine\nthe amount of sugar in one piece of cake and label your answer with the appropriate unit of measure.\nEach slice of cake has 8 grams of sugar.\nExtension: The diameter of an electron is kilometers. If you are only concerned about the\ndiameter of one electron circle the unit below that would best represent this quantity. Convert the diameter of\nthe electron to your chosen unit of measurement.\nNanometers Meters Kilometers\nYou should change the unit to nanometers.\n8WB8-52 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 12. Change each number below to scientific notation then fill in the blank with the best unit of appropriate\nsize from the column to the right.\na. The diameter of the Milky Way is feet\n100,000_______light years________. miles\n1105 light years\nb. The wavelength of the shortest electromagnetic waves is meters\n0.01______millimeters__________. decimeters\n1102 millimeters\nc. The speed of a Banana Slug is 0.00023______meters/second__________. meters/second\n2.3104 kilometers/second\nmiles/second\nd. The area of the Antarctic Icecaps is millimeters2\n34,000,000_____kilometers2______________. kilometers2\ninches2\n3.4107\ne. The mass of a train is 72,200,000____kilograms_________. grams\n7.22107 centigrams\nkilograms\nf. The world’s petroleum production is cups\n3,214,000,000,000_____liters______. milliliters\n3.2141012 liters\n8WB8-53 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2d Class Activity: Multiplying and Dividing with Scientific Notation\nIn a previous section you were asked how many millions are in a trillion. Scientific notation can help you\nanswer this question with ease.\n1. Begin by writing these two numbers in standard form and then changing them to scientific notation.\nStandard Form Scientific Notation\nOne Million 1,000,000 1106\nOne Trillion 1,000,000,000,000 11012\n2. What operation should you use if you want to compare these numbers? (Hint: Remember it is asking\nhow many millions are in a trillion.)\nIn order to determine how many times one number fits into another number you must divide.\n3. Write this problem out with the correct operation using scientific notation.\n11012\n11012 1106 \n1106\nWhen numbers are written in scientific notation the problem above can be solved rather quickly. The problems\nbelow will help you practice the skills you will need to do this. You will return to the problem above on the next\npage.\n4. Discuss with a partner what properties of exponents you will use to help simplify the problems below.\nUse these properties to simplify each expression. The Power of a Product and Power of a Quotient\nProperties can be used to simplify the expressions below.\na. 104103 b. 103105 106 d. 104 106102\nc. 103\n107 102 103\n5. Discuss the multiplication problem(53)(28)with your class. Write your thoughts below.\nOf course it most natural to just multiply 15 times 16. But could you rewrite the problem as\n(52)(38)or(58)(23) or even 53223 5324? Is the answer the same? Why can you do\nthis? You can rewrite this expression because of the commutative property of multiplication.\nYou can rewrite the problem because of the commutative property of multiplication.\n6. Rewrite this problem (5.1105)(6.8103)like the problem above (group the powers of 10 together).\nThen solve the problem (use exponent properties) and write the solution.\n(5.1105)(6.8103)(5.16.8)(105103)34.688108\nGive students time to experiment with the problems below. Writing the factors in a different order is not the only method for\nsimplifying these expressions. Let your students change the numbers to standard form and then multiply or divide them. This\nwill let them see how efficient the “re-ordering” method is.\n7. Use the same method to evaluate the problems below.\na. (6.9102)(3.5105) b. Solve the problem: c. Solve the problem:\n(1.9103)(2.4106) (7.2105)\nRewrite the problem:\n 2103\n(6.93.5)(102105) 4.56109 (3.6102)\nProblem solution:\n24.15107 2.415108\n8WB8-54 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8. Find each product or quotient. Write your answer in scientific notation.\n2.3958103 b. (7105)(3.5103) 3.006108\na. 1.21104 c. 4.12104\n1.98107 2.45103 7.3103\nd. What is 3 millionths e.  3.1103 562.1 f. How much is 40% of 140\nmultiplied by 7 ten- million?\n1.743100\nthousandths? 5.6107\n2.1109\n30 h. (5105)(0.4) i. What percent of (1.3106)\ng.\n1.2105\n2105 is (6.5105)?\n2.5104\n50%\nEncourage students to use a calculator as they operate on the decimals. They\ncan then find the power of ten in their head.\n9. Return back to the problem at the beginning of the section. If we want to figure out how many millions\nare in a trillion what operation will help us achieve this? Division\na. Use the method discovered above to perform this operation.\n 11012\n1106 1,000,000. There are one million millions in a trillion.\n 1106\nb. Now try it to find out how many thousands are in a trillion.\n 11012\n1109 1,000,000,000. There are one billion thousands in a trillion.\n 1103\n8WB8-55 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Use scientific notation to answer each question\n10. In the world, approximately 1,146,000,000 people speak Chinese as their first language, while,\n341,000,000 people speak English as their first language. Approximately how many times more people\nspeak Chinese than English as their first language?\n1109\n.333101 3.3\n3108\nThe number of people that speak Chinese as their first language is about 3.3 times as many has the\nnumber of people that speak English as their first language.\nStudents might be interested to note that Hindi(the official language of India and Pakistan) is the\nsecond most common language with 3.66108people speaking it as a first language.\n11. The thickness of a dollar bill is .010922 cm. The thickness of a dime is .135 cm. How many times\nthicker is a dime compare to a dollar bill?\n1.35101\n1.23101 ; A dime is about 12 times thicker than a dollar bill.\n1.0922102\n12. A millipede’s leg is 4.23103cm long.\na. How long is the millipede’s leg in standard form?\n0.00423cm.\nb. Despite its name a millipede does not really have 1000 legs. If it did, what would the length be if\nyou could line up all the legs of a 1,000 leg millipede end to end?\n 4.23103 1103 4.23100 4.23\nThe millipede’s legs lined up end to end will be 4.23 cm.\n13. A cricket weighs 3.88102ounces. How many crickets are in a pound(a pound has 16 ounces)?\n1.6101\n4.12102\n3.88102\nThere are approximately 412 crickets in a pound.\n14. Determine the thickness of one sheet of paper in this book. Show your work and solution using\nscientific notation. Express your answer in units of appropriate size. See student answer.\nThis would be a great problem to do the last five minutes of class on an exit slip.\n8WB8-56 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2d Homework: Multiplying and Dividing with Scientific Notation\n1. Write each number in scientific notation.\na. 0.0006033108 b. 0.000142104 c. 322105 d. 13.5107\n6.033103 1.42108 3.22107 1.35106\n2. Find the product or quotient for the following. Negative exponents are acceptable.\na. 104102 b. 105102 c. 103105 d. 104 102\n102 107 102 106\n3. Find each product or quotient. Write your answer in scientific notation.\na.  7.2104  2.8103 2.35108 c.  8.4106  1.3106\nb.\n4.3103\n2.016106 1.0921013\n5.47104\n3.1748104 e. (5106)(4.5104) 1.005107\nd. f.\n2.07108 2.25103 6.3102\n1.534104 1.6104\ng. What is 4 millionths h.  4.2103 44,462.1 i. How much is 30% of 170\nmultiplied by 5 ten- million?\n1.867102\nthousandths? 5.1107\n2109\n8WB8-57 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3.15108 1.3104 l. 145,000 is what percent of\nj. k.\n4 million?\n6.1102 0.3101\n3.6%\n5.161011 4.33103\n4. In a class action lawsuit, 4,000 claimants were offered an $800 million settlement. How much is that\nper claimant? Change the numbers into scientific notation to calculate.\n8108\n2105 200,000\n4103\nEach claimant will get $200,000.\n5. A cable company earned $125 million in one year. The next year they earned $312.5 million dollars.\nEstimate how many times bigger their profit was the second year compared to the first year.\n3.125108\n2.5100 2.5\n1.25108\nThe cable company made about 2.5 times more money the second year compared to the first year.\n6. There are about 6.0221023atoms of hydrogen in a mole of hydrogen. How many hydrogen atoms are in\n3.5103moles of hydrogen?\n 6.0221023 3.5103 21.0771026 2.10771027\nThere are 2.10771027atoms in 3.5103moles of hydrogen.\n7. During the year 2013 approximately7.07109pennies were minted (made by the U.S. Mint). In the year\n2000 approximately1.431010were minted. Estimate how many times more pennies were minted in the\nyear 2000 compared to the year 2013. Give a possible explanation for the decline.\n1.431010\n0.2101 2\n7.07109\nThere were about twice as many pennies minted in the year 2000 than in 2013. This could possibly be\ndue to the fact that more people pay for things electronically (debit or credit card) now.\n8WB8-58 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2e Class Activity: More Operations with Scientific Notation\n1. Will the method for multiplying and dividing numbers in scientific notation work for adding and\nsubtracting numbers in scientific notation? No, since you are combining the operations of\naddition or subtraction with multiplication the commutative property does not hold.\nLead a discussion with students:\nConsider the numbers 5,000,000 and 2,000,000. If you were to add these numbers you would most likely\nadd 5 + 2, which equals 7. Then, since they both have six zeros you would add six zeros to get\n7,000,000. The same can be done with numbers in scientific notation.\n2. Rewrite 5,000,000 and 2,000,000 in scientific notation.\n5,000,0005106\n2,000,0002106\nL ead a discussion with students:\nN otice that they both have the same exponent. Similarly, if you add these numbers in scientific notation\ny ou can simply add 5+2 to get 7 and keep the 106. You get7106.\n3. Test the method you learned above to see if it works for subtraction. First subtract 2,000,000 from\n5,000,000. Then change the numbers to scientific notation and subtract them using the method above to\nsee if you get the same answer. You may want to give your students a few more examples to experiment with for\n5,000,0002,000,000 them to see the pattern and formulize a method for adding and subtracting\nnumbers with the same power of ten. You can also think about the example\n3,000,000\nabove like adding like terms. You have 5 millions and 2 millions when you add\nthem together to get 7 millions. Just like when you add 5x and 2x you get 7x. Or\n5106 2106 3106\nsimilarly, when you add .\n4. Write in your own words how to add or subtract numbers in scientific notation that have the same\nexponent or order of magnitude.\nSee student answer.\nAfter you have given students an opportunity to write their method in their own\nwords; summarize a method together as a class. Make sure that everyone understands\nthat they can perform the desired operation on the significant digits and keep the\norder of magnitude the same. Of course this will only work when the powers of ten\nare the same. We will discuss what to do if they are not the same shortly.\n5. Find each sum or difference. Write your answer in scientific notation.\n 3.45103  6.11103  8.96107  3.41107  6.43100  4.39100\na. b. c.\n9.56103 5.55107 1.082101\n 1.23104  8.04104  4.51011  3.21011  6.1108  3.2108\nd. e. f.\n9.27104 1.31011 2.9108\n8WB8-59 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 6. You might be wondering what to do if the numbers do not have the same order of magnitude. Write\ndown your ideas of how you might be able to add or subtract these numbers. Be ready to share your\nideas with the class. See student answer.\nTalk about student ideas from number 6 by using an example and leading a discussion. Encourage\nstudents to use the space provided to write the example and their ideas.\n Try adding 4 million and 6 billion. Start by writing these numbers in standard form and adding\nthem with long addition.\n Write these numbers in scientific notation and add them using the method on the previous page to\nsee if it works for addition and subtraction.\n 4106  6109 1010?\n Why does this method not work for the problem above? How could you change your numbers so\nthat this method will work?\nThe numbers must have the same order of magnitude for the method on the previous page to work. You can\nchange the order of magnitude on a number written in scientific notation by moving the decimal in one or\nboth of the numbers so that your powers of ten are the same.\nGive students a problem where the poand ask them if there is any way that they can change their numbers before operating on\nthem so that the pTowo eards dof otern s aurbe ttrhaec sta nmuem. Ebxepresr iimne snct iweinthti tfhiec enxoatmaptiloe nto: gether as a class and discuss to how moving the\nd ecimal in one or both1 o. f tMhe ankuem sbuerrse w thille cyh hanagvee t hthe ep oswamer eo fe txenp.o nent or order of magnitude. If they\ndon’t, move the decimal so they do.\n2. Add or subtract the significant figures and keep the order of magnitude the\nsame.\n3. Write your final answer in scientific notation.\n a10n  b10n (ab)10n\n a10n  b10n (ab)10n\nTry it out with the problems given below.\n7. Find each sum or difference. Write your answer in scientific notation.\n 4.12106  3.94104  4.23103  9.56102  3.4103  4.57102\na. b. c.\n 412104  3.94104  42.3102  9.56102  3.4103  4.57102\n  \n .34102  4.57102\n415.94104 4.1594106 3.274103 \n4.91102\n 3.67103  1.6101  8.41105  7.9106  6.91102  2.4102\nd. e. f.\n 3.67103  1.6101  8.41105  7.9.106  6.91102  2.4102\n  \n 36700101  1.6101 36698.4101  84.1106  7.9106 76.2106  .000691102  2.4102 \n7.62105\n3.66984103 2.401102\n8WB8-60 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Problem Solving (use scientific notation where possible)\n8. The earth is 9.3107miles from the sun. Pluto is 3.67109 miles from the sun. How far is it to Pluto\nfrom Earth? (Hint: Draw and label a picture.)\n 3.67109  9.3107\n\n 367107  9.3107 357.7107\n3.577109\nThe distance from Earth to Pluto is 3.577109miles.\n9. Pretend a new planet has been found in the far reaches of the universe.\na. You know the earth is 9.3107 miles from the sun and the planet you are interested in is 7.31012\nmiles beyond the sun in the opposite direction of the earth. What is the distance to the planet from\nEarth?(Hint: Draw and label a picture)\nThe distance from earth to the new planet is approximately 7.31012miles.\nb. Using the distance you found above and the fact that light travels at 5.881012 miles in one light\nyear. Determine how many light years it will take for light to travel to this planet from Earth. It will\ntake approximately 1.24 light years for light to travel to this planet.\n8WB8-61 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2e Homework: More Operations in Scientific Notation\n1. Find each sum or difference. Write your answer in scientific notation.\n 2.3103  6.2103  9.8102  2.72104 0.456 2.3105\na. b. c.\n8.5103 2.3105\n2.818104\n 7.23107  6.08106  2.3105  2.01106  8.9107  9.6106\nd. e. f.\n6.622107 1.78106 1.049105\ng. What is ten thousand h. What is the difference i.  1.6104  9.6103\nplus 125,000? between 4 hundredths\n1.35105 and 8 ten thousandths?\n9103\n3.9102\n2. The areas of 4 major oceans on the Earth are shown in the table below. Estimate how many square\nmiles the oceans cover all together.\nAll of the oceans cover 1.3014108square miles.\nOcean Area (sq\nmiles)\nArctic 5.44106\nAtlantic 3.18107\nIndian 2.89107\nPacific 6.40107\n3. Estimate how many more square miles the Atlantic Ocean covers than the Arctic Ocean. The Atlantic\nOcean is approximately 2.636107square miles bigger than the Arctic Ocean.\n4. The surface area of the earth is 19.69107 square miles. Find the percentage of Earth that is covered by\nthe oceans listed above.\nApproximately 66% of the Earth is covered by the oceans listed above.\n5. The mass of the Sun is about 1.981030kg. The mass of the Earth is about 5.971024kg. Estimate how\nmany times bigger the mass of the Sun is than the mass of the Earth. The mass of the Sun is\napproximately 3.32105times the mass of the Earth.\n6. A neutron has a mass of 1.671027kg and an electron has a mass of 9.111031kg. Determine how\nmany times smaller the mass of the electron is than the mass of the neutron.The mass of the electron is\napproximately 1.83103times smaller than the neutron.\n8WB8-62 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2f Class Activity: Matching, Ordering, and Problem Solving with Scientific Notation.\nReturn to the cards that you cut out in the matching activity in section 8.2b.\n1. Rematch each Standard Form card with it Scientific Notation card. Don’t worry about the Object and\nArrow Cards right now.\n2. Order your matches on your desk from least to greatest.\n3. Collect all the Object Cards and match each Object Card with its numerical value. Note that a meter is\nabout the length from the tip of your nose to the tip of your finger if you hold out your arm to the side of\nyour body at a right angle. Check to see if the order that you placed your measurement cards in makes\nsense with the heights of each object.\n4. Collect all the Arrow Cards and place them between a pair of measurement/object cards to estimate how\nmuch bigger one object is than the other. Do this for as many pairs as possible.\nExtension: Once you have completed the four tasks above mount your cards on a poster board showing all of\nthe corresponding matches with the arrow cards comparing the objects. Draw a picture next to each object and\ndisplay it in the classroom.\n5. In the table below, sort the numbers given in the first column into the correct cells to help you order the\nnumbers.\nNumbers Positive Numbers Numbers Greater than 1 Greatest\n1.68101 3.78106 3.78106 3.78106\n3.39101\n3.403102 3.39101\n1.68101\n4.53102 1.68101\nNumbers between 0 and 1\n1.68102 3.39101\n7.21102 1.68102\n1.68101\n3.78106 3.403102\n1.68102\n3.39101 Negative Numbers Numbers between 0 and 2.11101\n3.403102 3.403102\n1.68102\n4.53102\n2.11101\n2.11101\n7.21102\n4.53102 Numbers Less than\n2.11101\n7.21102\n4.53102\n7.21102\nLeast\nThere is an interactive website where you can do the above activity on the computer. It is found at\nhttp://www.learnalberta.ca/content/mejhm/index.html?l=0&ID1=AB.MATH.JR.NUMB&ID2=AB.M\nATH.JR.NUMB.EXPO&lesson=html/video_interactives/exponents/exponentsInteractive.html\n8WB8-63 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. For numbers 6 and 7 order the numbers from least to greatest.\n6. 2.3104, 5.6101, 1.6104 7. 4.3103, 1.5104, 7.4104\n2.3104,1.6104,5.6101 4.3103,1.5104,7.4104\nConsider how to structure your class as they work on #9 below. You could split your class into group\nand have them work in pairs within their group. Each pair pick two problems from section 1 and the\nproblem in section 2.\n8. Write one million in as many ways as you can.\n1,000,000\nAnswers may include, but are not limited to 1,000,000 , 106,1106, .\n1\n9. To continue working with very large numbers, problem solve to answer the following questions. Be\nprepared to explain your problem solving process and solution.\nSection 1 Section 2\na. How long is a million days in years? e. At one time, McDonald’s had sold more than a\nbillion hamburgers (far more now). If it were\nA million days is 2.74103years.\npossible to eat a hamburger every minute of\nevery day (day and night) without stopping,\nhow long would it take to eat a billion\nhamburgers? Express your answer in\nappropriate units of time.\nIt will take 1902.58 years to eat a billion\nb. How long is a million days in hours?\nhamburgers.\nA million days in hours is2.4107hours.\nc. How far is a million inches in miles?\nA million inches 15.8 miles.\nd. If you laid a million one-dollar bills end to\nend, how far would they reach?\nThe dollar bills would reach 96.91 miles.\n8WB8-64 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2f Homework: Matching, Ordering, and Problem Solving with Scientific Notation\n1. In the table below, sort the numbers given in the first column into the correct cells to help you order the\nnumbers.\nNumbers Positive Numbers Numbers Greater than 1 Greatest\n4.57102 4.65107 4.65107 4.65107\n7.36102 7.36102 7.36102 7.36102\n3.44102\n1.403103 3.44102\nNumbers between 0 and 1\n3.44103 3.44102\n4.65107 3.44103\n3.44103\n3.44103 1.403103\n5.21102 Negative Numbers Numbers between 0 and -1 1.14101\n1.14101 1.403103\n3.44102\n4.57102\n4.57102\n1.14101\n5.21102\n5.21102 Numbers Less than -1\n1.14101\n1.403103\n4.57102\n5.21102\nLeast\nFor numbers 2 and 3 order the numbers from least to greatest.\n2. 4.3104, 4.2101, 4.6104 3. 1.4104,2.3102,1.5104\n4.3104,4.6104,4.2101 1.5104,2.3102,1.4104\n8WB8-65 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. As you work on the problems below, try to think about how you might use scientific notation to help you. Be\nprepared to explain your methods and solutions.\n4. Calculate the following in relationship to your age on your next birthday. Write your answer in scientific\nnotation. Answers given below are for a 14 year old.\na. How many days have you been alive? b. How many hours have you been alive?\nA fourteen year old had been alive for A fourteen year old has been alive for\n5.11103 days. 1.2264105hours.\nc. How many minutes have you been alive? d. How many seconds have you been alive?\nA fourteen year old has been alive for A fourteen year old has been alive for\napproximately7.36106minutes. approximately 4.42108seconds.\nExtension:\nCounting one number per second how long does it take to count to…\na. …a million in minutes?\nIt takes approximately 1.67104 minutes to count to a million.\nb. …a million in hours?\nIt takes approximately 277hours to count to a million.\nc. …a million in days?\nIt takes approximately 11.5 days to count to a million.\nd. …a million in weeks?\nIt takes approximately 1.6 weeks to count to a million.\nTalk about the fact that a quantitative fact can be expressed in a number of different ways. We choose\nhow we represent something often to meet a specific purpose. For example it's pretty impressive that it\nwould take 11.5 days to count to a million; it makes it seem so much larger. You could also ask-given\nthis information, how many days would it take to count to a billion or even a trillion (1000, or\n1,000,000 times as long as 1,157 or 1,157,000 days).\n8WB8-66 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2g Class Activity: Problem Solving with Scientific Notation\nTask 1: Taxes and the National Debt\nWe read in the newspapers that the United States has a 15 trillion dollar debt. Assume that there are 300 million\nworking people in the United States.\nBe sure to do these problems before class so\nthat you can have an idea of what questions\na. Estimate the national debt per person?\nstudents might have.\nThe national debt per person is about $50,000.\nFor some students you will need to provide\nsome problem solving strategies for them.\nTameka works at a retail store. Assume the following statements app ly to her wages.\n Tameka has a job at which she earns $10 per hour.\n 18% of her pay check goes to federal taxes. Ask them probing questions such as: What\ninformation are you given? What do you need\n All of these taxes go towards paying off the national debt.\nto know? What operation should you use?\n Tameka works 2103 hours a year.\nb. Estimate how many hours will she have to work to pay off her share of the national debt.\nTameka will have to work approximately 27,788 hours to pay for her portion of the national debt.\nc. Estimate how many years will it take Tameka to pay off her portion of the national debt.\nTameka will have to work approximately 13.89 or 14 years to pay of her portion of the national debt.\nTask 2: Computers\nOn the computer a byte is a unit of information. A typical document contains many tens of thousands of bytes,\nand so it is useful to use the words below to describe storage capacity for items related to a computer.\nScientific Notation\n1 kilobyte=1000 bytes 1 kilobyte=1103bytes\n1 megabyte=1000 kilobytes 1 megabyte=1103kilobytes\n1 gigabyte=1000 megabytes\n1 gigabyte=1103megabytes\n1 terabyte=1000 gigabytes\n1 terabyte=1103gigabytes\na. Rewrite each of these terms using scientific notation (use the space given above).\nb. Calculate how many bytes are in each of these terms.Write your answer in scientific notation.\n1 kilobyte=1103bytes 1 gigabyte= 1103 1106 1109bytes\n1 megabyte= 1103 1103 1106bytes 1 terabyte= 1109 1103 11012bytes\nc. My computer has a memory (storage capacity) of 16 gigabytes, how many bytes of memory is this?\nThe computer has 1.61010or 16,000,000,000 bytes of memory.\nd. How many computers like the one above do you need to have in order to get 1 terabyte of memory?\nYou will need approximately 63 computers like the one above to get 1 terabyte of memory.\nRemind students that they will need to have the same units in order to compare the storage of the\ncomputer with the amount of storage that the novel takes up.\ne. An online novel consists of about 250 megabytes. How many novels can I store on my 16 gigabyte\ncomputer? You can store approximately 64 novels on the 16 gigabyte computer.\n8WB8-67 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2g Homework: Problem Solving with Scientific Notation\nTask 1: Gasoline\nGas’N’ Go Convenience Stores claim that 10% of Utahans fuel up at their stores each week. Decide whether\ntheir claim is true using the following information. Explain your answer.\n There are about 2.85106people in Utah.\n There are 2.18102Gas’N’Go stores in Utah.\n Each stations serves gasoline to about 1.2103people each week.\nGas’ N’ Go’s claims are not true, their stores do not serve 10% of the population in Utah. 10% of Utahs\npopulation can be found by finding 10% of 2.85106.\n .10100 2.85106 .285106 285,000\nThus 10% of the population is 285,000. Now we need to see how many people Gas’N’Go serves each week\nby multiplying the number of stores by the number of people each store serves a week.\n 2.18102 1.2103 2.616105 261,600\nSince 261,000 is less 285,000 the claims are not true.\nTask 2: Time\nMany chemical and physical changes happen in extremely small periods of time. For that reason the following\nvocabulary is used.\nScientific Notation\n1 microsecond = 1000 nanoseconds 1 microsecond = 1103nanoseconds\n1 millisecond=1000 microseconds 1 millisecond= 1103microseconds\n1 second=1000 milliseconds\n1 second= 1103milliseconds\na. Rewrite each of these terms using scientific notation (use the space given above).\nOnline conversion calculators\nb. How many nanoseconds are in a millisecond?\nare very easy to find. They are\nThere are  1103 1103 1106nanoseconds in a millisecond. a great tool for students to\ncheck their answers. However,\nc. How many nanoseconds are in second? be sure that they show their\nThere are  1106 1103 1109nanoseconds in a second. work so that you know that they\ndid not just use the conversion\ncalculator to answer each\nd. How many nanoseconds are in a hour?\nquestion.\nThere are nanoseconds in an hour.\nExtension:\ne. I can download a byte of information in a nanosecond. How long will it take to download a typical book\n(250 megabytes)? Express your answer in appropriate measures of time.\nIt will take .25 seconds to download a 250 megabyte book.\nf. How long will it take to download the Library of Congress (containing 35 million books)? Express your\nanswer in appropriate measures of time. It will take approximately 101.3 days to download the library of\ncongress.\n8WB8-68 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.2h Self-Assessment: Section 8.2\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept.\nSkill/Concept Minimal Partial Sufficient Substantial\nUnderstanding Understanding Understanding Understanding\n1 2 3 4\n1. Use numbers\nexpressed in the form\nof a single digit times\nan integer power of\n10 to estimate very\nlarge or very small\nquantities, and to\nexpress how many\ntimes as much one is\nthan the other.\nSee sample problem #1\n2. Convert a number\nbetween scientific\nnotation and standard\nform.\nSee sample problem #2\n3. Perform operations\nwith numbers\nexpressed in\nscientific notation.\nSee sample problem #3\n4. Choose units of\nappropriate size for\nmeasurements of very\nlarge or very small\nquantities.\nSee sample problem #4\n5. Interpret scientific\nnotation that has been\ngenerated by\ntechnology.\nSee sample problem #5\n6. Use scientific\nnotation to problem\nsolve with really\nsmall and really large\nnumbers.\nSee sample problem #6\n8WB8-69 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Sample Problem #1\nEvery day there is an estimated 329,000 smart phones bought in the United States.1 Every day there is an\nestimated 12,000 smart phones lost or stolen in the United States.2 Approximately how many times more smart\nphones are bought than are lost or stolen.\n3105and1104\nThere are approximately 30 times more smart phones bought each day then are lost or stolen.\nSample Problem #2\nChange the numbers below into scientific notation.\na. 3,450,000,0003.45109 b. 0.000000004554.55109\nChange the number given below into standard form.\nc. 6.03108 603,000,000 d. 1.2106 0.0000012\nSample Problem #3\nPerform the indicated operation for each problem below.\na.  3.13108  2.9109 3.213109 b. 2.541043.2105 2.22104\nc. (3106)(5.6108)1.68101 1.0004108\nd. 1.4105\n7.2102\nSample Problem #4\nFill in the blank with a unit of appropriate size from the column to the right.\nkilograms\na. The mass of trash produced by New York City in one day is 1.2107 nanograms\n_______kilograms________. grams\nseconds\nb. The period of the sun’s orbit around the galaxy is2.4108 hours\n______years__________. years\nmillimeters2\nc. The area of the Earth’s land surface is 1.49108_____kilometers2______. meters2\nkilometers2\n1-http://appleinsider.com/articles/14/02/20/apples-iphone-led-2013-us-consumer-smartphone-sales-with-45-share---npd,\nhttp://www.latimes.com/business/technology/la-fi-tn-45-million-smartphones-lost-stolen-2013-20140417-story.html,\nhttp://techcrunch.com/2013/09/19/gartner-102b-app-store-downloads-globally-in-2013-26b-in-sales-17-from-in-app-purchases/\n8WB8-70 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Sample Problem #5\na. A calculator gives you an answer of 3.023E , write this number in scientific notation and standard\nform.\n003023\nb. A calculator give an you answer of , write this number in scientific notation and standard\nform.\n920,000\nSample Problem #6\nIn the year 2013 the U.S. mint produced 2.112109dimes.\na. Estimate the value of this money?\n2.112109\n2.112108 211,200,000. This is approximately 211 million dollars worth of dimes.\n1101\nb. Every second 175 cups of coffee are bought at America’s most popular coffee shop.2 The average cup of\ncoffee at this particular shop costs $1.85. At this rate how long will it take for America to spend the 211\nmillion dollars worth of dimes produced in 2013 on coffee at this shop? Express your answer using\nappropriate units of time.\nIt will take America about 7.54 days or little over a week to spend 211 million dollars on coffee at this\ncoffee shop.\n2-http://www.boston.com/business/articles/2011/09/17/starbucks_looks_for_way_to_encourage_paper_cup_recycling/\n8WB8-71 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 8.3: Volume of Cylinders, Cones, and Spheres\nSection Overview:\nThroughout this section, students are solving real-world and mathematical problems involving volumes of\ncylinders, cones, and spheres. Students begin by deriving the volume of a cylinder, relying on their knowledge\nfrom previous grades that the volume of a right three-dimensional object can be found by taking the area of its\nbase and multiplying it by the height. Students then use the formula for the volume of a cylinder to arrive at the\nformulas for the volumes of a cone and sphere. Using concrete models of these three-dimensional objects,\nstudents physically compare the volume of a cone to the volume of a cylinder. Students then manipulate the\nformula for the volume of a cylinder to reflect these differences, arriving at the formula for the volume of a\ncone. They use a similar process to derive the formula for the volume of a sphere. Once students understand\nwhere these formulas come from, they apply them to solve real-world problems, knowing when and how to use\nthe formulas.\nConcepts and Skills to be mastered:\nBy the end of this section students should be able to:\n1. Find the volume of a cylinder, cone, and sphere given a radius and height.\n2. Find a missing measurement (height, radius, or diameter) for a cylinder, cone, or sphere given the\nvolume.\n3. Use the formulas for the volumes of cylinders, cones, and spheres to solve a variety of real-world\nproblems.\nIt is particularly important to read the Mathematical Foundation for this section. It gives a more\ndetailed and historical discussion of how the formulas for the volume of a cylinder, cone, and sphere\nare derived, specifically, Cavalieri's principle and the packing of three (polyhedral) cones in a cube.\nTher e are so me great tasks found at the following links that are related to the content in this section.\nThe Popcorn task would be a good one to do with cylinders and the Meatball task would be good to do\nwith spheres. You can even use them as an assessment.\nhttp://threeacts.mrmeyer.com/popcornpicker/\nhttp://www.101qs.com/2352-meatballs\n*Both of these tasks were created by Dan Myer\n8WB8-72 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3a Class Activity: Wet or Dry (This activity is optional)\nWe have been discussing exponents throughout this chapter. You have learned how to simplify expressions with\nexponents in them and have looked at how expressing numbers in scientific notation can better help us deal with\nnumbers that are really big and really small. Exponents are also used to find the volume of a three-dimensional\nobject.\n1. Describe what volume is. Compare it to finding perimeter or area.\nAnswer may include that volume describes the amount of space that an object takes up or hold.\nCommon misconceptions might include that volume describes that area.\nTo help us better understand how important it is to know how to find the volume of a three-dimensional object\ndo the following activity.\n2. Choose two different sizes of cylindrical cans to use for this activity. Measure the diameter and the\nheight of each can in centimeters.\nCan 1: Diameter __________________ Height __________________\nCan 2: Diameter ___________________ Height __________________\n3. As a group determine the volume of each can. Show your work below or explain how you found the\nvolume of your cans. Make sure that your units are correct. Once you have found the volume in cubic\ncentimeters change your answer to millimeters. (Hint: One cubic centimeter is the same as one\nmilliliter.)\nCan 1 Can 2\nYo u could provide several different empty soup cans for students to choose from. Be sure to calculate\nthe volume of the can before you do the activity and remove an labels that may state the volume. In\nord er to measure the water you will need a graduated cylinder and a bucket of water, it is best to do\nthi s part of the activity outside. Do not let students use the graduated cylinder to calculate the volume.\nTh is activity is intended for students to start thinking critically about volume and how it is calculated.\nDo not tell the students how to find the volume of a cylinder or provide the formula. It definitely\nbri ngs out the need to attend to precision.\nSelect one of your cans and bring it up to the teacher with your calculation for the volume of the can. Also,\nselect one member of the team to test your calculations.\nThis will be done by having the teacher fill the can with water over a team member’s head. If\nthey calculate too much the water will overflow onto their head and if their calculations are\ntoo low then all the water will get dumped on their head.\n4. Which can did your team choose and why did you choose this can?\nSee student answer.\n5. How close were your calculations to the actual volume of the can?\nSee student answer.\n6. What would you do differently if you could recalculate the volume of your can?\nSee student answer.\n8WB8-73 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3b Class Activity: Volume of Cylinders\n1. Gunner just started his summer job doing swimming pool maintenance. He has a variety of things to do\nfor each pool. For each item below fill in the missing measurement in the space provided for each pool.\na. He needs to build a fence around each of the swimming pools below. If each unit represents one\nmeter determine how much fencing he needs for each pool. Write your answer below each pool in\nthe appropriate spot. See below.\nb. Gunner now has to cover each pool. Determine how much material he will need to cover each pool.\nWrite your answer below each pool in the appropriate spot. See below.\nc. After Gunner has put up a fence and knows how much material he needs to cover the pools he needs\nto fill the pools back up with water. Determine how much water he would need to fill each pool to a\ndepth of one meter. Write your answer below each pool in the appropriate spot. See below.\nd. Now determine of much water he would need to fill each pool to a depth of 2 meters. Continue\nfilling in the chart to 10 meters deep for each pool. See below.\nPool #1 Pool #2\nPerimeter: 10m\nPerimeter: 14m\nArea: 6m2\nArea: 12m2\n1 meter deep volume: 166m3\n1 meter deep volume: 11212m3\n2 meter deep volume: 2612m3\n2 meter deep volume: 21224m3\n3 meter deep volume: 3618m3\n3 meter deep volume: 31236m3\n4 meter deep volume: 4624m3\n4 meter deep volume: 41248m3\n10 meter deep volume: 10660m3\n10 meter deep volume: 1012120m3\n2. Describe how to find the volume of the pool for any given depth. To find the volume of the pool for any\ngiven depth, multiply the area of the pool by the depth of the pool.\nStudents have dealt with the formulas for the volume of prisms and pyramids in previous grades. If you\nfeel that your students basic knowledge of volume is lacking consider using colored linking cubes in\nthis activity. Have your students build the various volumes for Pools 1 and 2. The cubes will allow\nthem to see how volume is composed of the area of the base times the depth or height of the pool.\n8WB8-74 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Be sure to solidify the following before moving on.\nVolume of a right geometric solid is often described by the equation V Bh where V is the volume, B is\nthe area of the base and h is the height. This was solidified in 7th grade, in 6th grade students used V=lwh to\ndescribe the volume of prism. Be sure to point out the relationship between the two forms, why the B is\ncapitalized and the h is not, and how the orientation of the figure does not change its base.\n3. Explain how the formula V=Bh helps you find the volume.\nThe equation V Bhdescribes multiplying the area of the base of the solid by the height.\n4. Gunner has one more pool to work on. Use what you know about the formula above to fill in the missing\ninformation for Pool #3. Recall that each unit represents 1 meter.\nPool #3 Perimeter: C 2r 216.283 m\nArea: Ar2 12 m2\n1 meter deep volume: 13.142 m3\n2 meter deep volume: 26.283 m3\n3 meter deep volume: 39.425 m3\n4 meter deep volume: 412.566 m3\n10 meter deep volume: 1031.416 m3\n5. What type of three-dimensional object is Pool #4?\nThe pool is a cylinder.\n6. Use the picture given below to describe how to find the volume of a Cylinder. Be sure to describe each\npart of the formula and how it relates to the formula V Bh.\nA cylinder is a solid obtained by taking a circle in a plane (called the base) and drawing it\nout in a direction perpendicular to the base for a distance h (called the height).\nh\nr\nThe volume of a cylinder is found by multiplying the area of the base by the height.\nV r2h\nHeight of the cylinder\nArea of the base\nDirections: Find the volume for each cylinder described below. If needed draw and label a picture.\n7. 8.\nV 45in3 V 43.75yd3\n5 in.\nV 141.37 in3 V 137.45 yd3\n3 in.\n2.5 yd 7 yd\n8WB8-75 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 9. Cylinder with a Radius = 21 mm and 10. Cylinder with a Diameter = 8.8 cm and\nHeight = 19 mm. Height = 9 cm.\nV 8,379mm3 V 174.24cm3\nV 26,323.41mm3 V 547.39 cm3\nPoint out that in order to find the exact volume you must write your answer in terms of . Have a\ndiscussion about irrational numbers, talking about how we can see exactly how much is contained, but\nwe cannot write it as a ratio of whole numbers. This is similar to what we did in Chapter 7 when we were\nasked to describe the length of the side of a square. Ask students to show the approximate volume and\nthe exact volume for some of the problems.\nDirections: Find the missing measurement for each cylinder described below.\n11. The volume of a cylinder is 117.1 cubic feet, and 12. The volume of a cylinder is 4,224.8 cubic\nits height is 15 ft. Find the diameter of the base millimeters, it has a diameter of 16.4 mm, find\nof the cylinder. the height of the cylinder.\nd 3.15ft h20mm\nExtension: Find the circumference of the base of the\ncylinder. C 2r 28.251.522mm\nDirections: For each problem given below draw and label a picture that describes each cylinder. Then solve the\nproblem.\n13. An ice cream company wants to package a pint of ice cream in a circular cylinder that is 4 inches high.\nA pint is 16 fluid ounces and 1 fluid ounce is 1.8 cubic inches. What does the radius of the base circle\nhave to be?\nV 16(1.8)28.8in3 thus 28.8r24. Upon solving for r you get\nr 1.51in.\n4 in.\nr\n14. For a science project, Hassan put a can out to collect rainwater. The can was 11 inches tall and had a\ndiameter of 8 inches. If it rained exactly 20 cubic inches each day, how many days did it take to fill the\ncan?\nThe volume of the can is V (4)211552.92in3. Since 552.92 divided by 20 is 27.6, it will take\napproximately 28 days to fill the can.\n11 in\n4 in\n8WB8-76 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3b Homework: Volume of Cylinders\nDirections: Find the volume for each cylinder described below. If needed draw and label a picture.\n1. 2.\nV 196.35cm3 V 24630.086mm3\n14 mm\n10 cm\n40 mm\n2.5 cm\n3. Cylinder with a radius of 2 ft and a height of 7 ft. 4. Cylinder with a diameter of 2.7 m and a height of\n30 m.\nThe volume of the cylinder is88ft3. The volume of the cylinder is171.8m3.\nFind the missing measurement for each cylinder described below.\n5. The volume of a cylinder is 63.6 cubic inches, 6. The volume of a cylinder is 8,685.9 cubic ft, it\nand its height is 9 inches. Find the diameter of has a diameter of 19.2 ft, find the height of the\nthe base of the cylinder. cylinder.\nThe diameter of the base of the cylinder is 3 The height of the cylinder is 30 ft.\ninches.\nExtension: Find the circumference of the base of\nthe cylinder. C 2r 2(0.75)4.71in.\nDirections: For each problem given below draw and label a picture that describes each cylinder. Then solve the\nproblem.\n7. What is the volume of Keisha’s thermos if it has a radius of 2.5 in at the opening and 10 in for a height?\nThe volume of Keisha’s thermos is 196.35in3.\n8. Mr. Riley bought 2 cans of paint to paint his garage. Each can had a radius of 5.5 inches and a height of\n8 inches. How many cubic inches of paint did he buy in all?\nMr. Riley has 1520.53 cubic inches of paint.\n8WB8-77 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3c Class Activity: Volume of Cones\nRecall from seventh grade, that a cone is a three-dimensional figure with a circular base. A curved surface\nconnects the base and the vertex. In order to derive the equations for a cone and sphere you will want\nto use special manipulatives to compare their volumes to a cylinder.\nYou will need a cylinder, cone, and hemisphere that all have the\nsame radius and height. To find the formula for the sphere the height\nof the cylinder needs to be equal to it radius as well as the radius of\nthe hemisphere. You can reference utahmiddleschoolmath.org to find\nwhere to get these resources. Once again, it is highly recommended\nthat you reference the Mathematical Foundation for this section for a\nmore comprehensive explanation of the derivation of these formulas.\nThe cylinder and cone given below have the same height and their bases are congruent.\n1\nV r2h V  r2h\n3\n1. Predict how the volume of the cone compares to the volume of the cylinder.\nSee student answer.\n2. If you fill the cone with water or other filling material, predict how many cones of water will fit into the\ncylinder.\nThe Cube/Tetrahedron construction depicted in the Mathematical Foundation is a\nSee student answer.\ngreat way to see the relationship between the volume of a cone and cylinder.\n3. Now try it. How many cones fit into the cylinder?\nApproximately 3 cones fit into one cylinder of water.\nAsk students to write down the equation for the volume of the cylinder below the cylinder.\n4. About what fraction of the cylinder is filled by the volume of one cone?\nOne third of the cylinder will be filled by the volume of the cone.\n5. Manipulate the equation for the volume of the cylinder to show the volume of the cone.\n1\nThe volume of the cone is equal to one third of the volume of the cylinder. Thus V  r2h\n3\n6. Explain in your own words how the volume of a cone compares to the volume of a cylinder. Describe\nthe parts of the formula for the volume of a cone. Write this formula below the cone in the picture\nabove.\nSee student answer.\n8WB8-78 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Directions: Find the volume for each cone described below. If needed draw and label a picture.\n7. 8.\n20 cm\n8 ft\n15 cm\n5 ft\n200 V 2000cm3\nV  ft3\nThe volume of the cone is\nThe volume of the cone is 3 V 6283.19cm3\nV 209.4ft3\n9. A cone with a radius of 8.4 feet and a height of 10. A cone with a diameter of 9 meters and a height\n5.5 feet. of 4.2 meters.\nThe volume of the cone is approximately The volume of the cylinder approximately\n406.4 ft3. 89.1m3.\nDirections: Find the missing measurement for each cylinder described below. Round your answer to the nearest\ntenth.\n11. The volume of a cone is 122.8 cubic inches, and 12. The volume of a cone is 188.5 cubic ft, it has a\nits height is 4.5 inches. Find the diameter of the diameter of 12 ft, find the height of the cylinder.\nbase of the cone. The height of the cone is 5 ft.\nThe diameter of the base of the cone is 10.2\ninches.\nFor each problem given below draw and label and picture that describes each cylinder. Then solve the problem.\n13. Salt and sand mixtures are often used on icy roads. When the mixture is dumped from a truck into the\nstaging area, it forms a cone-shaped mound with a diameter of 10 feet and a height of 6 feet. What is the\nvolume of the salt-sand mixture?\nThe volume of the salt-sand mixture is 157.08 cubic feet.\n14. A glass in the shape of a cone has a diameter of 8 cm. If the glass has a volume of 200 ml (or 200 cubic\ncentimeters), what is the greatest depth that a liquid can be poured into the glass? Explain.\nThe greatest depth the liquid could be is 11.94 cm.\nThere is a great experiment related to the Towers of Hanoi in the Mathematical Foundation for this\nsection. It would be a good activity to do in an Honors Class.\n8WB8-79 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3c Homework: Volume of Cones\nDirections: Find the volume for each cone described below. If needed draw and label a picture.\n1. 2.\n20 cm\n8 yd\n32\nV  yd3 45 cm\n3\n2 yd V 6000cm3\nV 33.51yd3\nV 18,849.6cm3\nThe volume of the cone is approximately\n18,849.6 cubic centimeters.\n3. A cone with a radius of 40 feet and a height of 4. A cone with a diameter of 4.2 meters and a height\n100 feet. of 5 meters.\n1,600,000 V 7.35m3\nV  ft3\n3 V 23.1m3\nV 1,675,515ft3\nThe volume of the cone is23.1m3.\nDirections: Find the missing measurement for each cone described below.\n5. The volume of a cone is 37.7 cubic inches, and its 6. The volume of a cone is 628.3 cubic ft, it has a\nheight is 4 inches. Find the diameter of the base diameter of 20 ft, find the height of the cone.\nof the cone. The height of the cone is approximately 6 ft.\nThe diameter of the base of the cone is\napproximately 6 inches.\nDirections: For each problem given below draw and label a picture that describes each cylinder. Then solve the\nproblem.\n7. The American Heritage Center at the University of Wyoming is a conical building. If the height is 77\nfeet, and the area of the base is about 38,000 square feet, find the volume of air that the heating and\ncooling systems would have to accommodate.\nThe volume of the air is about 975,333.3 cubic feet.\n8. A stalactite, a geological formation, in the Endless Caverns in Virginia is cone-shaped. It is 4 feet long\nand has a diameter at its base of 1.5 feet.\na. Assuming that the stalactite forms a perfect cone, find the volume of the stalactite.\nThe volume of the stalactite is 2.4 cubic feet.\nb. The stalactite is made of calcium carbonate, which weighs 131 pounds per cubic foot. What is the\nweight of the stalactite? The stalactite weighs 314.4 pounds.\n8WB8-80 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3d Class Activity Volume of Spheres\nRecall that a sphere is a set of points in space that are a distance of r away from a point C, called the center of\nthe sphere.\nC\n4\nV  r3\n3\nJust like you compared the volume of a cone to the volume of a cylinder to find the formula for the volume of a\ncone you are going to compare the volume of a sphere to the volume of a cylinder.\nIn this case it will be easier to deal with a hemisphere and then double the formula. Remember that a\nhemisphere is half of a sphere. If we can find the formula for the volume of a hemisphere we can simply\ndouble all of our numbers to get the volume of a sphere.\nBe sure to use the manipulatives mentioned in the previous section as you do this lesson with your students.\nThe cylinder and hemisphere given below have the same radius and the height of the cylinder is also the same\nas its radius.\nA possible extension\ncould be will the\nvolume of an inscribed\nhemisphere be more or\nless than the inscribed\ncone? Explain your\nanswer.\n2\nV r2r r3 V  r3\n3\n1. Predict how the volume of the hemisphere compares to the volume of the cylinder. Which one holds\nmore volume?\nSee student answer. You can discuss how the hemisphere will have less volume than the cylinder\nbecause if you were to put the hemisphere inside of the cylinder it would fit perfectly except the empty\nspace at the bottom of the hemisphere.\n2. If you fill the hemisphere with water or other filling material, predict what fraction of the cylinder is\nfilled by the volume of one hemisphere.\nSee student answer.\n3. Now try it, what fraction of the cylinder is filled by the volume of one hemisphere?\nUpon experimentation, students will find that roughly of the cylinder is filled will the volume of the\nhemisphere.\nIt may be helpful to mark the cylinder into thirds with a non-\npermanent marker so that students can see the water/material level.\n4. Write down the formula for the volume of the cylinder below the cylinder, be sure to write your height\nin terms of the radius or r. See above. Because the height and the radius are the same in the cylinder we\nuse r to represent the height.\n8WB8-81 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 5. Manipulate the equation for the volume of the cylinder to show the volume of the hemisphere.\n2\nThe volume of the hemisphere is of the cylinder. This is shown in the equation,V  r3.\n3\n6. In number 10 you found the volume for a hemisphere. Adjust this formula to find the volume of a\nsphere.\n2  4\nV  r3 2 r3\n \n3  3\n7. Explain in your own words how the volume of a sphere compares to the volume of a cylinder. Describe\nthe parts of the formula for the volume of a sphere. Write this formula below the sphere in the picture on\nthe previous page. See student answer.\nOnce again refer to the Mathematical Foundation as it illustrates this and other connections between these\nsolids and their volumes. It explains how the volume of a cylinder is the sum of a cone and hemisphere.\nDirections: Find the volume for each sphere described below. If needed draw and label a picture.\n8. 9.\nThe volume of the sphere is 523.6m3 The volume of the sphere is 137.3ft3\n10. A sphere with a radius of 1.3 yds. 11. A sphere with a diameter of 25 inches\nThe volume of the sphere is9.2yd3. The volume of the sphere is8,181.2in3.\nDirections: Find the missing measurement for each sphere described below. Round your answer to the nearest\ntenth.\n12. The volume of a sphere is 6882.3 in3; find the 13. The volume of a sphere is 1436.8 ft3; find the\ndiameter of the sphere. radius of the sphere.\nThe diameter of the sphere is 23.6 inches. The radius of the sphere is 7 ft.\nDirections: For each problem given below draw and label a picture that describes each sphere. Then solve the\nproblem.\n14. If a golf ball has a diameter of 4.3 centimeters and a tennis ball has a diameter of 6.9 centimeters, find\nthe difference between the volumes of the two balls.\nThe volume of a tennis ball is roughly 130.38 cubic centimeters bigger than the volume of the golfball.\n15. Kauri pours the water out of a cylindrical flower vase with a height of 5 inches and a radius of 4 inches\ninto a spherical flower vase. The spherical vase has a radius of 4 inches. Will the water overflow? If so,\nby how much? If not, how much space is left in the spherical vase? The water will not overflow; there\nwill be approximately 16.8 cubic inches of space left in the spherical vase.\n8WB8-82 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3d Homework: Volume of Spheres\nDirections: Find the volume for each sphere described below. If needed draw and label a picture.\n1. 2.\nThe volume of the sphere is approximately The volume of the sphere is 2,572.4mm3\n421.2yd3\n3. A sphere with a radius of 10 yards. 4. A sphere with a diameter of 60 inches\nThe volume of the sphere is4,188.8yd3. The volume of the sphere is113,097.3in3.\nDirections: Find the missing measurement for each sphere described below.\n5. The volume of a sphere is 113.1 cm3; find the 6. The volume of a sphere is 4,188.8 cubic feet; find\ndiameter of the sphere. the radius of the sphere.\nThe diameter of the sphere is 6 cm. The radius of the sphere is 10 ft.\nDirections: For each problem given below draw and label a picture that describes each sphere. Then solve the\nproblem.\n7. The diameter of the moon is 3,476 kilometers. Approximate the volume of the moon.\nThe volume of the moon is approximately2.21010km3.\n8. Find the volume of the empty space in a cylindrical tube of three tennis balls. The diameter of each ball\nis 2.5 inches. The cylinder is 2.5 inches in diameter and is 7.5 inches tall.\nThere is approximately 12. 27 cubic inches of empty space in the cylinder.\n8WB8-83 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3e Class Activity: Volume of Cylinders, Cones, and Spheres\nTask 1: Silos\nA silo is a storage bin that is a cylinder with a hemisphere on top. A farmer has a silo with a base radius of\n30 feet and a storage height of 100 feet. The “storage height” is the part which can be filled with grain - it is\njust the cylinder. A cubic foot of grain weighs 62 lbs.\na. Draw and label a picture of the silo Depending on the needs of your class you may\nSee drawing. decide to do just some of these problems. You\ncould assign different problems to different\ngroups or assign certain groups to become the\n“expert” teacher for a certain problem and have\nthem teach the class as a whole. This gives\nstudents the opportunity to critique the reasoning\nof others.\nb. How many pounds of grain can the farmer store in the silo?\nThe farmer can store approximately 17,530,087 pounds of grain.\nc. How high (including the hemispherical top) is the silo?\nThe height of the silo is 130 feet.\nd. One thousand square feet of wheat produces 250 pounds of grain. The farmer’s wheat field is 3,500\nfeet by 20,000 feet. Is the silo large enough to hold the grain? By how much? Explain your answer.\nThe silo is large enough to hold the wheat by 30,087 lbs.\ne. If the farmer decides to fill the silo all the way to the top of the hemisphere how many cubic feet of\ngrain can he store?\nIf the farmer fills the silo all the way to the top of the hemisphere he can hold 339,292 cubic feet of\ngrain.\n8WB8-84 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Task 2: Snow Cones\nA snow cone consists of a cone filled with flavored shaved ice topped with hemisphere of flavored shaved\nice. The cone is 4 inches long and the top has a diameter of 3 inches.\na. Draw and label a picture of the snowcone. See student answer.\nb. How much shaved ice, in cubic inches, is there altogether?\nThere is approximately 16.5 cubic inches of shaved ice.\nc. If 6 cubic inches of flavored ice is equal to 1 ounce, how many ounces of shaved ice is that?\nThere are 2.75 ounces of shaved ice.\nd. If one ounce of flavored shaved ice is 50 calories, how many calories will you consume if you eat\nthis snow cone?\nIf you eat this serving of shaved ice you will consume 137.5 calories.\n8WB8-85 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Task 3: Pipes\nWhich will carry the most water? Explain your answer.\n Two pipes each 100 cm tall. One with a 3 cm radius and the other with a 4 cm radius\n One pipe that is also 100 cm tall with a 5 cm radius.\nThe two pipes will carry a total of 7854 cubic centimeters of water while the one pipe will also carry 7854\ncubic centimeters of water. Thus they both carry the same amount of water.\nTask 4: Fruit\nA cantaloupe a diameter of 23 centimeters and a Clementine orange has a diameter of 7 centimeters. Predict\nhow many times bigger the cantaloupe is than the orange. Then calculate the volume of each fruit to\ndetermine how many times bigger the cantaloupe is than the orange.\nThe volume of the cantaloupe is approximately 6,370.62 cm3 and the volume of the orange is approximately\n179.59 cm3. The cantaloupe is approximately 35.5 times bigger than the orange.\n8WB8-86 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3e Homework: Volume of Cylinders, Cones, and Spheres\nTask 1: Containers\nA cylindrical glass 7 cm in diameter and 10 cm tall is filled with water to a height of 9 cm. If a ball 5 cm in\ndiameter is dropped into the class and sinks to the bottom, will the water in the glass overflow? If it does\noverflow, how much water will be lost? Explain and justify your response.\nThe volume of the water is 346.4 cubic centimeters. The volume of the sphere is 65.45 cubic centimeters.\nThe total volume of the water and the sphere is 411.8 cubic centimeters. The volume of the cylinder is 384.9\ncentimeters. Since the volume of the water and sphere is greater than the volume of the cylinder that means\nthat the water will overflow by 26.9 cubic centimeters.\nTask 2: Ice Cream\nIzzi’s Ice Cream Shoppe is about to advertise giant spherical scoops of ice cream 8 cm in diameter! Izzi\nwants to be sure there is enough ice cream and wonders how many scoops can be obtained from each\ncylindrical container of ice cream. The containers are 20 cm in diameter and 26 cm tall.\na. Draw and label a picture of the ice cream containers and the scoop of ice cream.\nSee student answer.\nb. Determine the number of scoops of ice cream one container will give her?\nIzzi will be able to get about 30 scoops of ice cream from each container.\nc. Ingrid purchases one of these famous giant scoops of ice cream but does not get to it fast enough\nand the ice cream melts! The radius of the cone and the ice cream (sphere) is 4 cm and the height of\nthe cone is 10 cm. Will all of the melted ice cream fit inside the cone? The volume of the cone is\n167.6 cubic centimeters and the volume of the ice cream sphere is 268 cubic centimeters. Thus the\nice cream will not fit into the cone when melted.\nd. If it does fit, how much more ice cream will fit in the cone? If it doesn’t fit, how many cubic\ncentimeters of ice cream does she need to eat before it melts in order to make it fit?\nIngrid needs to eat100.5 cubic centimeters of ice cream before it melts so that the cone does not\noverflow.\n8WB8-87 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3f Class Activity: Banana Splits\nMaterials: graph paper, string, rulers, pen or pencil, banana, ice cream scoop\nUse any of the materials on your table to approximate the volume of your banana and one scoop of ice cream.\nBe prepared to show and explain all your methods and your results.\n1. What is your estimate for the volume of the peeled banana (include units)? ______________\nShow how you found this volume.\nThere are many ways in which students might go about finding the volume. The most common will\nprobably be cutting the bananas with string into several cylinders and two cones. They can then find the\nvolume of all of the cylinders and cones and add them together.\nBe sure to set a standard unit of measurement for your class; either inches or centimeters. Try to\nget a bunch of bananas that are roughly the same size. If you would like to find the most accurate\nmeasurement for the volume of the banana to compare your students answers to; water\ndisplacement will probably work best. Recall that one cubic centimeter equals 1 milliliter. You\ncould also talk about how the more cylinders they cut their banana into the more accurate they\nwill be on calculating the volume.\n2. What is your estimate for the volume of one scoop of ice cream (include units)? __________\nShow how you found this volume.\nTo find the volume of the scoop of ice cream use the radius of the ice cream scoop to calculate the volume\nof the sphere of ice cream.\nMake sure that the ice cream scoop that you provide is one that is a perfect hemisphere.\n3. Comment on each of the other groups’ methods and results. Compare their strategies and their results to\nyours. See student answer.\n8WB8-88 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 4. How do you think you could have a more accurate approximation for the volume of the banana?\nSee student answer.\n5. How do you think you could have a more accurate approximation for the volume of the scoop of ice\ncream?\nSee student answer.\n6. If you make your banana split sundae with one banana, 3 scoops of ice cream, and 2 Tbsp chocolate\nsyrup, what will be the total volume of your sundae?\n(Hint: 1 Tbsp ≈ 14.8 cm3 and 1 in3 ≈ 16.4 cm3)\nAnswers will vary based off of the size of bananas that you provide your class.\n8WB8-89 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8.3g Self-Assessment: Section 8.3\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept.\nSkill/Concept Minimal Partial Sufficient Substantial\nUnderstanding Understanding Understanding Understanding\n1 2 3 4\n1. Find the volume of a\ncylinder, cone, and\nsphere given a radius\nand height.\nSee sample problem #1\n2. Find a missing\nmeasurement (height,\nradius, or diameter)\nfor a cylinder, cone,\nor sphere given the\nvolume.\nSee sample problem #2\n3. Use the formulas for\nthe volumes of\ncylinders, cones, and\nspheres to solve a\nvariety of real-world\nproblems.\nSee sample problem #3\n8WB8-90 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Sample Problem #1\nFind the volume for each object described below. Find the exact volume and the approximate volume rounded\nto the nearest hundredth.\na. The cylinder pictured below.\n24 cm\n14 cm\nV 4,704cmcm3\nV 14,778.05cm3\nb. A cone with a radius of 3 ft and a height of 10 ft.\nV 30ft3\nV 94.25ft3\nc. A glass tree ornament is a gold sphere. The diameter of the ornament is 4 inches.\n32\nV  in3\n3\nV 33.51in3\nSample Problem #2\nFind the missing measurement for each object desribed below. Draw and label a picture if needed.\na. The volume of a regular can of soda pop is approximatley 23.7 in3. The height of the can is 4.83 inches.\nFind the diameter of the can.\nThe diameter of the can is approximatley 2.5 inches.\nb. The volume of the cone below is approximatley 377 ft3. Find the height of the cone.\nh\n6 ft\nThe height of the cone is approximatley 10 ft.\nc. A sphere has a volume of 113.1 mm3. Find the radius of the sphere.\nThe radius of the sphere is 3 millimeters.\n8WB8-91 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Sample Problem #3\nSuzy is throwing a party and is choosing from the glasses below to serve her punch. Use the information below\nto answer the questions that follow.\n5 cm 4 cm 4 cm\n3 cm\n8 cm 6 cm\n4 cm\nGlass 1 Gla ss 2 Glass 3\n The shape of Glass 1 is a cone with a radius of 5 cm and a height of 8 cm.\n The shape of Glass 2 is a cylinder with a radius of 4 cm and a height of 6 cm.\n The shape of Glass 3 is a hemisphere with radius of 4 cm with a cylinder on top of it with a radius of\n4 cm and a height of 3 cm.\na. Suzy wants to choose the glass that has the smallest volume so that she doesn’t have to use as much\npunch. Find the volume of each glass to determine which glass she should choose.\n200\nV  cm3 V 96cm3\nThe volume of Glass 1 is 3 . The volume of Glass 2 is .\nV 301.59cm3\nV 209.44cm3\n272\nV  cm3\nThe volume of Glass 3 is 3 .\nV 284.83cm3\nSuzy should choose Glass 1 because it has the smallest volume and will hold the least amount of punch.\nb. Suzy really wants to use the cylinder shaped glass. What would the approximate height of the cylinder\nshaped glass need to be to hold the same amount of punch as the cone shaped glass. Would this be\npractical?\nThe height of the cylinder would need to be about 41.1 cm. It would not be practical to have a glass that\nis this tall.\n8WB8-92 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by."
}