{
    "text": "Table of Contents\nCHAPTER 7: RATIONAL AND IRRATIONAL NUMBERS (3 WEEKS) .................................................................................... 2\n7.0 ANCHOR PROBLEM: ZOOMING IN ON THE NUMBER LINE......................................................................................................................... 8\nSECTION 7.1: REPRESENT NUMBERS GEOMETRICALLY ................................................................................................................................ 10\n7.1a Class Activity: Background Knowledge .............................................................................................................................................. 11\n7.1a Homework: Background Knowledge .................................................................................................................................................. 13\n7.1b Class Activity: Squares, Squares, and More Squares .................................................................................................................... 14\n7.1b Homework: Squares, Squares, and More Squares ......................................................................................................................... 19\n7.1c Class Activity: Squares, Squares, and More Squares Cont. ........................................................................................................ 20\n7.1c Homework: Squares, Squares, and More Squares Cont. ............................................................................................................. 22\n7.1d Class Activity: Simplifying Square Roots ........................................................................................................................................... 24\n7.1d Homework: Simplifying Square Roots ................................................................................................................................................ 27\n7.1e Class Activity: Creating Cubes ................................................................................................................................................................. 28\n7.1e Homework: Creating Cubes ..................................................................................................................................................................... 30\n7.1g Self-Assessment: Section 7.1 .................................................................................................................................................................... 31\nSECTION 7.2: SOLUTIONS TO EQUATIONS USING SQUARE AND CUBE ROOTS ........................................................................................... 33\n7.2a Class Activity: Solve Equations using Square and Cube Roots ............................................................................................... 34\n7.2a Homework: Solve Equations using Square and Cube Roots ..................................................................................................... 36\n7.2b Class Activity: Tower Views ..................................................................................................................................................................... 38\n7.2b Homework: Driving, Running, and Basketballs ............................................................................................................................. 40\n7.2c Self-Assessment: Section 7.2 .................................................................................................................................................................... 42\nSECTION 7.3: RATIONAL AND IRRATIONAL NUMBERS................................................................................................................................... 43\n7.3 Anchor: Revisiting the Number Line ...................................................................................................................................................... 44\n7.3a Class Activity: The Rational Number System................................................................................................................................... 46\n7.3a Homework: The Rational Number System ....................................................................................................................................... 49\n7.3b Class Activity: Expressing Decimals as Fractions .......................................................................................................................... 50\n7.3b Homework: Expressing Decimals as Fractions ............................................................................................................................... 54\n7.3c Class Activity: Expanding Our Number System .............................................................................................................................. 56\n7.3c Homework: Expanding Our Number System ................................................................................................................................... 59\n7.3d Class Activity: Approximating the Value of Irrational Numbers ............................................................................................ 61\n7.3d Homework: Approximating the Value of Irrational Numbers ................................................................................................ 67\n7.3e Class Activity: Comparing and Ordering Real Numbers ............................................................................................................. 71\n7.3e Homework: Comparing and Ordering Real Numbers ................................................................................................................. 73\n7.3f Self-Assessment: Section 7.3 ..................................................................................................................................................................... 75\n8WB7 - 1 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Chapter 7: Rational and Irrational Numbers (3\nweeks)\nUtah Core Standard(s):\n Use square root and cube root symbols to represent solutions to equations of the form 𝑥2 = 𝑝 and 𝑥3 =\n𝑝, where p is a positive rational number. Evaluate square roots of small perfect squares and cube roots of\nsmall perfect cubes. Know that √2 is irrational. (8.EE.2)\n Know that numbers that are not rational are called irrational. Understand informally that every number\nhas a decimal expansion; for rational numbers, show that the decimal expansion repeats eventually, and\nconvert a decimal expansion which repeats eventually into a rational number. (8.NS.1)\n Use rational approximations of irrational numbers to compare the size of irrational numbers, locate them\napproximately on a number line diagram, and estimate the value of expressions (e.g.,𝜋2). For example,\nby truncating the decimal expansion of √2, show that √2, is between 1 and 2, then between 1.4 and 1.5,\nand explain how to continue on to get better approximations. (8.NS.2)\nAcademic Vocabulary: square, perfect square, square root, √ , cube, perfect cube, cube root, 3 √ , quadratic\nequation, cubic equation, inverse operation, decimal expansion, repeating decimal, terminating decimal, rational\nnumber, irrational number, truncate, decimal approximation, real number, real number line\nChapter Overview:\nIn 8th grade, students begin to think more carefully about the real line by asking the question, “Is there a\nnumber associated with every point on the line?” Up to this point, students have worked only with rational\nnumbers, numbers they generated from iterations of a whole unit or portions of whole units. Part of their work\nincluded identifying a point on the real line associated with each rational number. Students explore the question\nposed above through an activity that has them constructing the lengths of non-perfect squares, thus introducing\nstudents to irrational numbers.\nThe chapter starts by having students examine the relationship between the area of a square and its side\nlength. This activity introduces students to the idea of what it means to take the square root of a number.\nAdditionally, students begin to surface ideas about the limitations of rational numbers. In the activity, students\nconstruct physical lengths of irrational numbers and begin to realize that we cannot find an exact numerical\nvalue for these numbers. Students then use the knowledge gained from this activity to simplify square roots and\nsolve simple quadratic and cubic equations (i.e. 𝑥2 = 40 and 𝑥3 = 64).\nIn the last section, students deepen their understanding of what an irrational number is and in the process\nsolidify their understanding of rational numbers. They realize that even though they cannot give an exact\nnumerical value for the lengths of non-perfect squares, they can transfer these lengths to a number line to show\nthe exact location of these numbers. Once the numbers are placed on the real line, students can approximate the\nvalue of these irrational numbers and compare their value to rational numbers. At the end of the chapter,\nstudents learn additional methods for approximating the value of irrational numbers to desired degrees of\naccuracy, estimate the value of expressions containing irrational numbers, and compare and order rational and\nirrational numbers.\n8WB7 - 2 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Connections to Content:\nPrior Knowledge: Students have worked a great deal with rational numbers up to this point. They have defined\nand worked with the subsets of rational numbers. They have represented rational numbers on a number line,\nexpressed rational numbers in different but equivalent forms, and operated with rational numbers. Students have\nalso worked a great deal with slope, have an understanding of area, and know how to find the area of polygons\nand irregular shapes which will help them to access the tilted square material.\nFuture Knowledge: Later in this book, students will study exponent rules and deepen their understanding of the\nconnection between taking the square root of a number and squaring a number. In subsequent courses, students\nwill continue to extend their knowledge of the number system even further. For example, students will learn\nabout complex numbers as a way to solve quadratic equations that have a negative discriminant. They will also\ncontinue to work with irrational numbers, learning how to operate on irrational numbers.\n8WB7 - 3 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. MATHEMATICAL PRACTICE STANDARDS:\nA hospital has asked a medical supply company to manufacture\nintravenous tubing (IV tubing) that has a minimum opening of 7 square\nmillimeters and a maximum opening of 7.1 square millimeters for the\nrapid infusion of fluids. The medical design team concludes that the\nradius of the tube opening should be 1.5 mm. Two supervisors review\nthe design team’s plans, each using a different estimation for π.\nSupervisor 1: Uses 3 as an estimation for π\nMake sense of\nproblems and Supervisor 2: Uses 3.1 as an estimation for π\npersevere in\nsolving them. The supervisors tell the design team that their designs will not work.\nThe design team stands by their plans and tells the supervisors they are\nwrong. Who is correct and why? Recall that the formula for the area of a\ncircle is 𝐴 = 𝜋𝑟2.\nIn this problem, students realize the effects of approximating the value\nof irrational numbers. They must decide which estimation of π is\nappropriate for the given situation, appreciating that the precision of\nthe estimation may have profound impact on decisions people make in\nthe real world.\nThe decimal 0.3̅ is a repeating decimal that can be thought of as\n0.33333… where the “…” indicates that the 3s repeat forever. If they\nrepeat forever, how can we write this number as a fraction? Here’s a\nReason\ntrick that will eliminate our repeating 3s.\nabstractly and\nTo solve this problem, students create and solve a system of linear\nquantitatively.\nequations. The skills and knowledge they learned about systems of\nequations become an abstract tool that allows students to write\nrepeating decimals as fractions, proving that they do in fact fit the\ndefinition of a rational number.\nDirections: The table below contains statements about rational and\nirrational numbers. If the statement is true, put a check in the box. If the\nstatement is not true, write a correct statement.\n You can always use a calculator to determine whether a number\nis rational or irrational by looking at its decimal expansion.\n The number 0.256425642564… is rational.\nConstruct viable\n You can build a perfect cube with 36 unit cubes.\narguments and\n If you divide an irrational number by 2, you will still have an\ncritique the\nirrational number.\nreasoning of\nStudents must have a clear understanding of rational and irrational\nothers.\nnumbers to assess whether the statements are true or false. If the\nstatement is flawed, students must identify the flaw, and construct a\nstatement that is true. Due to the fact that there are several possible\nways to change the statements to make them true, students must\ncommunicate their statements to classmates, justify the statements, and\nquestion and respond to the statements made by others.\n8WB7 - 4 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. People often wonder how far they can see when they’re at the top of the\ntallest buildings such as the Empire State Building, The Sears Tower in\nChicago, etc. The farthest distance you can see across flat land is a\nfunction of your height above the ground. If h is the height in meters of\nyour viewing place, then d, the distance in kilometers you can see, can\nbe given by this formula: 𝑑 = 3.532√ℎ\nModel with The CN Tower in Toronto, Canada is 555 meters tall. It is near the shore\nmathematics. of Lake Ontario, about 50 kilometers across the lake from Niagara Falls.\nYour friend states that on a clear day, one can see as far as the falls from\nthe top of the Tower. Are they correct? Explain your answer.\nThe formula shown above is a model for the relationship between the\nheight of a building and the distance one can see. Students use this\nmodel along with their knowledge of square roots to solve problems\narising in everyday life.\nDirections: Show the length of the following numbers on the number\nline below. Use the grid on the following page to construct lengths\nwhere needed and transfer those lengths onto the number line. Then\nanswer the questions that follow. Note: On the grid, a horizontal or\nvertical segment joining two dots has a length of 1. On the number line,\nthe unit length is the same as the unit length on the dot grid.\n𝐴:√25 𝐵:√2 𝐶:√8 𝐷:2√2 𝐸:√5 𝐹:2√5\n0 1 2 3 4 5 6\n1. Use the number line to write a decimal approximation for √2.\n2. Would 1.41 be located to the right or to the left of √2 on the\nnumber line?\n3. Describe and show how you can put −√2 on the number line.\nUse appropriate\nEstimate the value of this expression.\ntools\n4. Describe and show how you can put (2+√2) on the number\nstrategically.\nline. Estimate the value of this expression.\n5. Describe and show how you can put (2−√2) on the number\nline. Estimate the value of this expression.\n6. Describe and show how you can put 2√2 on the number line.\nEstimate the value of this expression.\nTo solve this problem, students use dot paper to construct physical\nlengths of irrational numbers. They can then transfer these segments to\nthe number line using patty (or tracing) paper. Once on the number\nline, students can use these tools (number line, dot paper, patty paper,\nconstructed segments) to approximate the value of given expressions\n(i.e. (2+√2)).\n8WB7 - 5 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Use the following approximations and calculations to answer the\nquestions below. Do not use a calculator.\nApproximation: π is between 3.14 and 3.15\nCalculations:\n3.12 = 9.61\n3.22 = 10.24\n3.162 = 9.9856\n3.172 = 10.0489\nAttend to Put the following numbers in order from least to greatest.\nprecision. √10,3 1 ,3.1̅,𝜋, side length of a square with an area of 9\n10\nFind a number between 3 1 and 3.1̅.\n10\nFind a number between 3.1 and √10.\nThis task demands mastery of the topics learned in the chapter. Students\nmust have a very clear understanding of square roots, repeating\ndecimals, and irrational numbers. They must closely analyze the\ndecimal expansions (approximations) of the numbers as well as the\ncalculations given to be able to compare and order the numbers.\nSquare A shown below has an area of 8 square units. Determine the\nfollowing measures:\na. The area of one of the smaller squares that makes up\nSquare A\nb. The side length of one of the smaller squares that makes\nup Square A\nc. The side length of the large square A (written 2 different\nways)\nA\nLook for and\nB\nmake use of\nstructure.\nC\nThis problem allows students to use structure to understand why √8 is\nthe same as 2√2. They can see the equivalence in the concrete model. A\nsquare with an area of 8 (see Square A) has a side length of √8 units.\nThis side length is comprised of 2 smaller, congruent segments that\n8WB7 - 6 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. each measure √2 units as they are each the side length of a square with\nan area of 2. This concrete representation builds a conceptual\nunderstanding for students as we then move to the algorithm for\nsimplifying square roots.\nChange the following rational numbers into decimals without the use of\na calculator.\n1\n7\nThis problem allows students to understand why the decimal expansion\nLook for and\nof a rational number either always terminates or repeats a pattern.\nexpress\nWorking through this problem, and others, students begin to understand\nregularity in\nthat eventually the pattern must repeat because there are only so many\nrepeated\nways that the algorithm can go. Once a remainder repeats itself in the\nreasoning.\ndivision process, the decimal expansion will start to take on a repeating\npattern. Students should see this when they begin repeating the same\ncalculations over and over again and conclude they have a repeating\ndecimal.\n8WB7 - 7 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.0 Anchor Problem: Zooming in on the Number Line\nT he problems below are a review of skills learned in 6th and 7th grade. In 6th and 7th grade, students used the\nn umber line as a model for thinking about numbers. Students learned how to partition the number line into desired lengths\nin order to associate all rational numbers to a point on the number line. In the last two problems below, students review that\nw e can associate every decimal (a number that can be represented by a fraction whose denominator is a power of\n1 0) to a point on the number line by zooming in on the number line and chopping the intervals into repeated subdivisions of\ntenths.\nIn 8th grade, the question becomes, “Do all points on the real number line correspond to a rational number?” The\nanswer of course is no – there are lengths that cannot be represented by fractions. These numbers are called irrational. In 8th\ngrade, students are exposed to a subset of the irrational numbers, the square roots of non-perfect squares. In the lessons that\nfollow, students will construct lengths of non-perfect squares and understand that even though we cannot give an exact\ndecimal value for these numbers, we can show the location of these numbers on the real number line by copying our\nconstructed lengths to the real number line. Students also approximate the value of irrational numbers to increasing levels of\nac curacy and show the location of their approximations on the number line, zooming in on pieces of the number line until\nth e desired level of accuracy is reached.\nS ample answers are provided.\nA nother optional activity is to have students explore an interactive number line. A zoomable number line with exploration\nactivities is available at http://www.mathsisfun.com/numbers/number-line-zoom.html.\nAdditionally, there are other number line tools available for computers and tablets.\nDirections: Place the following sets of numbers on the number lines provided and label each point. You will\nneed to decide where to place 0 and the measure of the intervals for each problem.\n𝐴:3 𝐵:4 𝐶:3.5 𝐷:−4 𝐸:−5 𝐹:−4.5\n1 3 1\n𝐿: − 𝑀: 𝑁: −1 𝑂: 1.75 𝑃:−2\n4 4 2\n1 3 1 9 10\n𝑉: 𝑊: 𝑋: 𝑌: 𝑍:\n10 10 2 10 10\n𝐻:0.1 𝐼: 0.2 𝐽: 0.15 𝐾: 0.11 𝐿: 0.101\n8WB7 - 8 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 𝐴:3.1 𝐵: 3.2 𝐶: 3.15 𝐷: 3.11 𝐸: 3.105 𝐹: 3.111\nDirections: Refer to the number line above to answer the questions that follow.\nStudents do not need to write out all of the answers to the following problems. Many are there for discussion\npurposes.\n1. Are there other numbers you can place between 3.1 and 3.11? If yes, find a number.\nStudents really narrow in on the piece of the number line from 3.1 to 3.11. Besides 3.105 that we have\nalready graphed, we can consider 3.101, 3.102, 3.103, etc. We can also divide the interval from 3.1 to\n3.11 into thirds, quarters, etc. and name these points. There are many possible answers.\n2. Are there other numbers you can place between 3.11 and 3.111? If yes, find a number.\nMany answers, 3.1101, 3.1102, etc. Students can think about taking this tiny segment, zooming in on it,\nand dividing it into intervals.\n3. How are you coming up with the numbers? Are there others? How do you know?\nListen to student answers as to how they are coming up with numbers. The idea here is that we can\npartition intervals on the number line in any way we choose to show the location of all rational numbers.\nWe can continue this process over and over showing that the number line is a continuum of numbers and\nthat we can repeat this process of partitioning the number line an infinite number of times.\n4. Where would you put 3.1̅ on the number line and why?\nAt this point, students will most likely just be approximating the location of 3.1̅, knowing that it lies to\nthe right of 3.11. You can talk about zooming in on the piece of the number line from 3.11 to 3.12 and\nencourage students to be even more specific and see that say 3.1̅ will lie to the right of 3.111 but to the\nleft of 3.112. This is a good time to review the meaning of the bar to show repeating decimals. Later in\nthe chapter, students will learn how to change repeating decimals into fractions which will allow them to\nbe even more precise in their placement of repeating decimals on the number line.\n5. What can you conclude about the real number line based on this activity?\nListen to what students conclude from this activity. Some possible responses: The number line is a\ncontinuum of numbers. We can partition the number line in any way we wish to show the location of all\nrational numbers on the number line. We can partition segments on the number line an infinite number\nof times.\n8WB7 - 9 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 7.1: Represent Numbers Geometrically\nSection Overview:\nIn this section, students are exposed to a new set of numbers, irrational numbers. This chapter starts with a\nreview of background knowledge – finding the area of polygons and irregular shapes, using ideas of slope to\ncreate segments of equal length, and reviewing the definition of a square. Then students build squares with\ndifferent areas and express the measure of the side length of these squares, gaining an understanding of what it\nmeans to take the square root of a number. Additionally, students start to surface ideas about irrational numbers.\nStudents create squares that are not perfect and realize they cannot find an exact numerical value for the side\nlength of these squares (e.g. a number that when squared results in the area of the square created). Students also\nsimplify square roots, connecting the simplified answer to a physical model. At the end of the section, students\nuse cubes and volume to gain an understanding of what is meant by the cube root of a number.\nConcepts and Skills to Master:\nBy the end of this section, students should be able to:\n1. Understand the relationship between the side length of a square and its area.\n2. Understand the relationship between the side length of a cube and its volume.\n3. Evaluate the square roots of small perfect squares and the cube roots of small perfect cubes.\n4. Simplify square and cube roots.\nIn section 1, the focus is on understanding the relationship between the side length of a square and its\narea. In the process, students construct lengths of irrational numbers and transfer these lengths to the number\nline (by putting the line segment on the number line with one point at 0). They also begin to see that we cannot\nfind an exact numerical value for these numbers. It is in section 3 that we define what an irrational number is, a\nnumber that cannot be expressed as the ratio of an integer to a natural number.\n8WB7 - 10 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1a Class Activity: Background Knowledge\nThe purpose of this exercise is to prepare students for 7.1b, where they\nare finding the area of squares, including tilted squares found in Figure\nI below. Methods may include: combining and counting squares,\nActivity 1: Finding Area of Irregular Shapes decomposing into smaller common shapes, subtraction method, etc.\nDirections: Find the area of the following shapes. On the grid, a horizontal or vertical segment joining two dots\nhas a length of 1. Put your answers on the lines provided below the grid.\nA B C D E F\nArea of\nSquare (16)\n- Area of\nSide\nG H\nTriangles\n(2*4) = 8\nI\nArea of\nLarger\nSquare (9)\n- Area of\nTriangles\nJ K (4*1) = 5\nL\nA: ____1____ B: ___2_____ C: ___4_____ D: ___2_____ E: ___4.5_____ F: ___8______\nG: ____6____ H: ___8_____ I: ____5_____ J: ____10____ K: ____15_____ L: ___16______\nDirections: Use a different method than used above to find the areas of the shapes below.\nD H\nArea of Area of\nSquare (4) Square (9) L\n- Area of - Area of Area of\nTriangle Triangles Large\n(2) = 2 (2*0.5) = Square (25)\n8 - Area of\nSmall\nSquare (9)\nJ\n= 16\nG\nD: ____2____ G: ____6____ H: ____8____ J: ___10_____ L: ____16_____\n8WB7 - 11 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Activity 2: Slopes and Lengths of Segments\n1. Using tracing paper, construct 3 additional segments that are the same length as the segment shown\nbelow. Your segments cannot be parallel to the segment given and must start and end on a dot on the\ngrid. The purpose of this activity is that students use ideas about slope in order to\nconstruct segments that are equal in length (pairs of segments also happen to\nbe perpendicular). This will help students when constructing their tilted\nsquares. This is also a preview of what is to come in chapter 9 with\nreflections and rotations. Note that, with the given conditions, every possible\nanswer has to be parallel to one of the 3 segments in red.\n2. Using the ideas from the previous problem and the one below, write down observations you have about\nthe line segments shown on the grid.\nPossible observations: They are the same length. Make the connection to slope:\nThe slope triangles that make up the segments use the same numbers (1 and 2)\nbut in some cases the 1 is the rise and the 2 is the run and in others the 2 is the\nrise and the 1 is the run. If we imagine this on the coordinate plane, some have\npositive slopes, some are negative. The segments are perpendicular in pairs.\n3. Create a square on the grid below, using the given segment as one of the sides of the square.\n8WB7 - 12 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1a Homework: Background Knowledge\n1. Find the areas of the following shapes. On the grid, a horizontal or vertical segment joining two dots has\na length of 1. Put your answers on the lines provided below the grid.\nC\nA B\nF\nE\nD\nA: ________ B: ____3____ C: ___8_____ D: _______ E: ________ F: _________\n2. Show a second method for finding the area of shape C.\nC\n3. Create a square on the grid below, using the given segment as one of the sides of the square.\n8WB7 - 13 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1b Class Activity: Squares, Squares, and More Squares\n8WB7 - 14 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. On the following pages of dot paper:\n1) Create as many different squares with areas from 1 - 100 as possible. On the grid, a horizontal or vertical\nsegment joining two dots has a length of 1. Each of the vertices of the square must be on a dot.\n2) Find the area of each square you made and label each square with its area.\n3) Complete the table below using the squares you created. The table has been filled in with the area and side\nlengths of some of the squares on the following pages.\nThe activities in 7.1a were intended to provide\nArea Side Length students with the background knowledge and\nskills necessary to access this lesson.\n1 1\nThe following bullets represent the primary\n4 2\nmathematical knowledge students should\nknow and understand from doing this lesson.\n9 3\n If we are given the side length of a square,\ns, then its area is s2.\n25 5\n If we are given the area of a square, A,\n36 6 then its side length is √𝐴.\n To find the square root of a number, find\n2 √2 a number that when multiplied by itself\nequals the given number.\n√8 or\n8  The side length of a perfect square is a\n2√2\nwhole number.\n5 √5  We cannot find an exact value for the side\nlength of a non-perfect square; therefore\n17 √17\nwe represent the side length as √𝐴.\n8WB7 - 15 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 1 2\n25 8\n4\n18\n9\nStudents may use scaling methods to draw squares\nwith different areas. Students may notice that when\nwe double the side length (students can see this on\n36\nthe physical model), we quadruple the area and\nwhen we triple the side length the area is multiplied\nby 9 or 3 squared. Have honors students show why\nthis is the case using the area formula.\n16 The following pattern emerges:\nSlope Triangle 1/1: Area 2 x 1 = 2\nSlope Triangle 2/2: Area 2 x 4 = 8\nSlope Triangle 3/3: Area 2 x 9 = 18\nSlope Triangle 4/4: Area 2 x 16 = 32\nWe can see a different pattern:\nSlope Triangle 1/1: Area 12 + 12 = 2\nSlope Triangle 2/2: Area 22 + 22 = 8\nSlope Triangle 3/3: Area 32 + 32 = 18\nA preview of Pythagorean Theorem\n10 17\n5\nStudents will notice that there are different ways to orient the tilted squares. Both squares to\nthe left have an area of 5. If we refer back to Activity 2 in section 7.1a, we see that we can\nconstruct a square using the different pairs of segments that are perpendicular. The segments\nall have the same length; we just choose to combine different pairs to create our squares.\nStudents can prove these squares have the same area by tracing one and rotating it to see that\nit maps to the second (this will come up again in chapter 9 when we study rigid motion).\n5\nWe also see the following pattern emerge with the triangles above:\nSlope Triangle 1/2: Area 1 + 22 = 5\nSlope Triangle 1/3: Area 1 + 32 = 10\nSlope Triangle 1/4: Area 1 + 42 = 17\nOur pattern can be thought of as:\n12 + 22 = 5 and so on…\nA preview of Pythagorean Theorem which will be explored in detail in Chapter 10\n8WB7 - 16 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 5\n20 45\n29\n13\n8WB7 - 17 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 1. Complete the following table…\nArea Length of Side 2. Find the missing measure.\n(square (units)\nunits) a.\n1 1\nA = s = 11cm\n9 3 121 cm2\n5\n2 √2\nb.\n5 √5\nA = 16 m2 s = 4 m\n13 √13\n√5\n100\n20\nDirections: Complete the following sentences. Provide examples to support your statements.\n3. A perfect square is created when…\nA whole number is raised to the second power. Ex. 42 = 16\n4. To find the area of a square given the side length of the square…\nSquare the side length (examples will vary)\n𝐴 = 𝑠2\n5. To find the side length of a square given the area of the square…\nTake the square root of the area (examples will vary)\n𝑠 = √𝐴\n6. Simplify the following.\na. √36 d. √1 g. √625\n6 25\nb. √121 e. √100 h. √2500\n11 50\nc. √16 f. √49 i. √225\nAgain, we only focus on the positive roots in this chapter. In section 7.2, we will see that there are two\nroots when solving simple quadratics.\n8WB7 - 18 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1b Homework: Squares, Squares, and More Squares\n1. List the first 12 perfect square numbers. The first 3 are 1, 4, 9,\n2. What is the side length of a square with an area of 9 units2? 3\n3. What is the area of a square with a side length of 2 units? 4\n4. Complete the following table. 5. Find the missing measures of the squares:\nArea Length of Side a.\n(square (units)\nunits)\n4 2\nA = 47 ft2 s =\n49\n144\n100 10\nb.\n2 √2 A = s = 5 in\n8\n15 √15\n√41\n1\n9\ns\nA √𝐴\n6. Simplify the following:\na. √9 d. √4 g. √400\n3\nb. √100 e. √144 h. √1600\n40\nc. √64 f. √81 i. √2500\n8\n8WB7 - 19 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1c Class Activity: Squares, Squares, and More Squares Cont.\nIn the previous sections, we have learned how to simplify square roots of perfect squares. For example, we\nknow that √36 = 6. What about the square roots of non-perfect squares? How do we know that they are in\nsimplest form? For example, is √5 in simplest form? How about √8? √147? Let’s take a look.\n1. Determine the lengths of line segments a through f without the use of a ruler. Write your answers in the\nspace provided below each grid.\na\nb\n2\nc\n8 d\n18\n32\ne\nf\n10\n40\nStudents may use a variety of strategies to solve these problems. They may construct the square with the given\nside length, determine the area of the square, and then determine the side length (as shown above). Once they\ndetermine that a) has a side length of √2, they may conclude that b) has a side length of 2√2. The length of the\nsegment in b) is two times longer than a). Put another way, b) is two copies of a). 2 copies of √2 can be\nexpressed as 2√2 . c) is three times longer than a) or 3√2. Students may also call the side lengths √8 and √18\nrespectively. We will explore the equivalence of these numbers later in the lesson.\na. ______√2_________ d. ____√32 or 4√2____________\nb. ______√8 or 2√2___ e. ____√10 ____________\nc. ___√18 or 3√2______ f. ____√40 or 2√10 ____________\n8WB7 - 20 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Directions: Use the squares on the grid below to answer the questions that follow. Each of the large squares A,\nB, and C has been cut into four smaller squares of equal size.\nIn this part of the lesson,\nstudents see a physical\nmodel that shows them that\nA\n√8 and 2√2 are equivalent\nB but that 2√2 is the\nsimplified form of √8. They\nalso see that\nC √32 and 2√8 and 4√2 are\nall equivalent with 4√2\nbeing the simplified form.\nThis leads into the next\nsection in which students\nunderstand what it means to\nsimplify square roots and\nlearn an algorithm for\nsimpli fying square roots.\n2. Square A has an area of 8 square units. Answer the following questions.\na. What is the area of one of the smaller squares that makes up Square A? __2________\nb. What is the side length of one of the smaller squares that makes up Square A? __√2________\nc. What is the side length of the large square A (written 2 different ways)? __√8 or 2√2________\n3. Square B has an area of 40 square units. Answer the following questions.\na. What is the area of one of the smaller squares that makes up Square B? __________\nb. What is the side length of one of the smaller squares that makes up Square B? __________\nc. What is the side length of the large square B (written two different ways)? _____________\n4. Square C has an area of 32 square units. Answer the following questions.\na. What is the area of one of the smaller squares that makes up Square C? ___8_______\nb. What is the side length of one of the smaller squares that makes up Square C?_√8 or 2√2_____\nc. What is the side length of the large square (written three different ways)? __√32 or 2√8 or 4√2\n8WB7 - 21 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1c Homework: Squares, Squares, and More Squares Cont.\n1. Determine the lengths of line segments a through d without the use of a ruler. Write your answers in the\nspace provided below each grid. See class activity #1 for help with this problem.\na\narea = 13\nsquare units\nb\nd\nc\na. _____√13___________ c. ________________\nb. ______________________ d. ________________\nOne way to find the lengths of the segments in #1 above is to construct a square off the given side length as\nshown for a) above. Once you construct the square, you can find the area of the square using the methods\noutlined in 7.1a and 7.2b. Once we know the area of the square, we can determine the side length of the\nsquare (the side length of the square will be the square root of the area of the square).\n2. On the grid above, construct a segment that has a length of √45 = 3√5.\n8WB7 - 22 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3. Use the square on the grid below to answer the questions that follow.\nSee class activity #2 – 4 for help with this problem.\na. What is the area of the larger square? ______________________\nb. What is the area of one of the smaller squares? __________2 units2____________\nc. What is the side length of one of the smaller squares? ____________________________\nd. What is the side length of the larger square (written in two different ways)?\n_____________________________\n4. On the grid below, construct a segment with a length of √13 units. Explain how you know your segment\nmeasures √13 units.\n8WB7 - 23 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1d Class Activity: Simplifying Square Roots\nIn this section we will learn two strategies for simplifying square roots of numbers that are not perfect squares.\nBoth strategies are really doing the same thing, but the methods for each are a little different.\nSimplifying Square Roots\nThink back to the previous lesson. What does it mean to simplify a square root of a non-perfect square? What\nwas the difference between the simplified version of these square roots as opposed to how they looked before\nthey were simplified?\nLet’s look at some example from the previous lesson:\n√8 = 2√2\n√18 = 3√2\n√32 = 4√2\n√40 = 2√10\nWhat observations can you make about the simplified versions of these square roots non-perfect squares? List\nthem here:\nDiscuss the following with students:\nWhen we simplify a square root of a non-perfect square we factor out as many perfect squares as we can,\nwhatever is left has to stay inside the square root symbol and is called a “surd” which can’t be simplified\nfurther. We can factor out perfect squares because when we take the square root of a perfect square we get a\nwhole number. When we try to take the square root of non-perfect square we get a decimal that goes on and on\nwithout any pattern, so instead we leave it inside to keep it simpler. If we were to just enter the square root into\nour calculator we would eventually have to round the answer we would get, which is not as accurate. These are\nthe reasons we simplify: accuracy and simplicity.\n8WB7 - 24 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Two Strategies for Simplifying Square Roots\nStrategy 1: Strategy 2:\n1. Find the greatest perfect square that is a 1. Using the factor tree method, factor the\nfactor of the number inside the square root number inside the square root symbol.\nsymbol. 2. Look for and circle any pairs of numbers\n2. Rewrite the number inside the square root among the factors.\nsymbol as the product of the greatest perfect 3. Put a square around any numbers that are\nsquare and the other factor. not part of a pair. Re-write the numbers as\n3. Take the square root of the perfect square. factors to see that the pairs can be removed,\nRemember: When you take the square root while anything left over must stay under the\nof the perfect square, it is no longer inside square root symbol.\nthe square root symbol. 4. Remove the pairs and leave any leftover\n4. Continue this process until you can no numbers inside the square root symbol.\nlonger find a perfect square other than 1 that Remember that because we are factoring, all\nis a factor of the number inside the square of these numbers are being multiplied, so if\nroot symbol. you end up with multiple numbers outside or\ninside the square root symbol, multiply them\nExamples: together.\n√8\n√8 = √4∙2 = √4∙√2 = 2√2\n√2 √4\n√2 √2\n√2∙2∙2 or √22 ∙√2\n√40 = √4∙10 = √4∙√10 = 2√10\n= 2√2\n√40\n√4 √10\n√32 = √16∙2 = √16∙√2 = 4√2\n√2 √2 √5 √2\n√2∙2∙5∙2 or √22 ∙√10\n= 2√10\n√32 √45\n√45 = √9∙5 = √9∙√5 = 3√5\n√16 √2 √9 √5\n√4 √4 √3 √3\n= 4√2 = 3√5\n8WB7 - 25 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Now you try…\n√50 = √25∙2 = √25∙√2 = 5√2\n4 2\n√\n25 5\n√200 = √100∙2 = √10∙√2 = 10√2\n49 7\n√\n36 6\n√72 = √36∙2 = √36∙√2 = 6√2\n−√36 −6\nFor this problem, find the square root of 36 and then put\nthe negative sign in front. One common error is to think\nthat this problem is the same as √−36. √−36 does not\n√147 7√3\nhave a solution. There is no number that when you\nmultiply it by itself is equal to −36. Another way to\nthink of the problem above is that you are taking the\nopposite of the square root of 36.\n√128 8√2\n−√8 −2√2\n1 1\n√\n4 2\n10√96 = 10∙√16∙6 = 10∙√16∙√6 = 10∙4√6 = 40√6 −5√45 −15√5\nWhat happens when we apply this same method with a perfect square?\n√100 = √25∙4 = √25∙√4 = 5∙2 = 10\n8WB7 - 26 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1d Homework: Simplifying Square Roots\nDirections: Simplify the following square roots.\n1. √4 = __2___\n10. 3√12 = _________\n2. √36 = _____\n1 1\n11. √ = __ ___\n64 8\n3. √125 = _5√5____\n= √25∙5 = √25∙√5 = 5√5\n25\n12. √ = ________\n49\n4. √216 = ________\n13. −√72 = _________\n5. √80 = _______\n14. −√100 = __−10___\n6. √256 = _______\n121\n15. −√ = __________\n144\n7. √28 = ________\n16. √0.16 = ____0.4____\n8. √99 = __3√11___\n9. 2√24 = __4√6___\n17. √0.0025 = ________\n= 2∙√4∙6 = 2∙√4∙√6 = 2∙2√6 = 4√6\n8WB7 - 27 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1e Class Activity: Creating Cubes\nIn the previous lessons, we learned how to find the area of a square given the side length and how to find the\nside length of a square given the area. In this section, we will study how to find the volume of a cube given its\nside length and how to find the side length of a cube given its volume.\n1. Find the volume of the cube to the left. Describe the method(s) you are using.\n2. The cube above is called a perfect cube. A cube is considered a perfect cube if you can arrange smaller\nunit cubes to build a larger cube. In the example above 27 unit cubes were arranged to build the larger\ncube shown. Can you build additional perfect cubes to fill in the table below? The first one has been\ndone for you for the cube shown above.\nDimensions Volume of Cube Volume of Cube Side Length\nExponential Notation (units3) (units)\n(units3)\n3×3×3 33 27 units3 3 units\n2×2×2 23 8 units3 2 units\nIn the previous sections, we learned the following: 𝐴 = 𝑠2\n If we are given the side length of a square, s, then its area is s2.\n If we are given the area of a square, A, then its side length is √𝐴. 𝑠 = √𝐴\nIn this section, we see that:\n If we are given the side length of a cube, s, then its volume is s3.\n𝑉 = 𝑠3\n If we are given the volume of a cube, V, then its side length is 3 √𝑉.\n Explain in your own words what 3 √𝑉 means: 𝑠 = 3 √𝑉\n8WB7 - 28 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3. Find the side length of the cube: ___3 in___ 5. Find the side length of the cube: __3 √30 cm\nV = 27 in3 V = 30 cm3\n4. Find the side length of the cube: ____5 m__ 6. Find the side length of the cube: _3 √100 ft_\nV = 125 m3\nV = 100 ft3\nDirections: Fill in the following blanks.\n7. 3 √27 = __3___ because (__3__)3 = 27 3 1\n13. √ = _______\n1000\n8. 3 √64 = _____ because (____)3 = 64\n3 8 2\n14. √ = __ ____\n125 5\n9. 3 √1 = __1___ because (__1__)3 = 1\n15. 3 √0.001 = ___0.1___\n10. 3 √125 = __5___\n16. 3 √0.027 = ________\n11. 3 √343 = _____\n17. 3 √32 = ____23 √4___\n3 1 1\n12. √ = __ ___\n216 6\n18. 3 √135 = ________\nFor #17 and 18, students can use the strategies used in the previous section to simplify the cube roots.\n8WB7 - 29 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1e Homework: Creating Cubes\n1. Fill in the blanks in the table: 2. Find the missing measurements:\nSide Length Volume\ns =\n1 1\nV = 8 in3\n3 27\n4\n125\n6\nV =\n3 √40 = 23 √5 40\ns = 7 mm\n96\n3 √18 18\n3\n√243\ns =\n1000\nV = 1331 in3\n0.2\n1\n64\n1 1\n5 125\ns 𝑠3\nV\n3. Simplify.\n3 √512 8 3 √27 3 √729\n3 √27 3 √24 23 √3 3 √250\n64\nOne way to simplify 3√24 is to write the prime factorization\nof 24: 3√2∙2∙2∙3. Since 2 appears 3 times, we can pull this\nout and leave the 3 under the radical.\n3 √128 3 √40 3 √192\n8WB7 - 30 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.1g Self-Assessment: Section 7.1\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept. Sample problems for each standard can be found\non the following page(s).\nSkill/Concept Minimal Partial Understanding Sufficient Substantial Mastery\nUnderstanding 2 Mastery 4\n1 3\n1. Understand the\nrelationship between\nthe side length of a\nsquare and its area.\n2. Understand the\nrelationship between\nthe side length of a\ncube and its volume.\n3. Evaluate the square\nroots of small perfect\nsquares and the cube\nroots of small perfect\ncubes.\n4. Simplify square and\ncube roots.\n1. Find the following:\na. The side length of a square with an area of 36 square units.\nb. The side length of a square with an area of 8 square units.\nc. The area of a square with a side length of 5 units.\nd. The area of a square with a side length of √13 units.\ne. Find the length of the segment shown below.\n8WB7 - 31 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 2. Find the following:\na. The side length of a cube with a volume of 125 units3.\nb. The volume of a cube with a side length of 4 units.\n3. Evaluate:\na. √4\ne. 3 √64\nb. √16\nf. 3 √125\nc. √81\ng. 3 √1000\nd. √121\n4. Simplify:\na. √60 d. 3 √81\nb. −√90 e. 3 √48\nc. 2√12 f. −3 √108\n8WB7 - 32 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 7.2: Solutions to Equations Using Square and Cube Roots\nSection Overview:\nIn this section, students will apply their knowledge from the previous section in order to solve simple square\nand cubic equations. Building on student understanding of how to solve simple linear equations using inverse\noperations, students will understand that taking the square root of a number is the inverse of squaring a number\nand taking the cube root is the inverse of cubing a number. Students will express their answers in simplest\nradical form.\nConcepts and Skills to Master:\nBy the end of this section students should be able to:\n1. Solve simple quadratic and cubic equations.\nSection 7.2a Teacher Note:\nLead the following discussion with your class before beginning the class activity\nWrite the equation given below on the board. Then ask the questions that follow.\n𝑥 +4 = 10\n1. What does it mean to solve an equation? (Do not describe how to solve the equation but rather what it\nmeans to solve an equation.)\nAnswer: Find a value for x so that the equation is true.\n2. What is this equation asking us to find? Is there only one solution to this equation?\nAnswer: A number that when added to 4 results in 10, or “What number added to 4 equals 10?”\n3. What is the equation 3𝑥 = 12 asking us to find? Is there only one solution to this equation?\nAnswer: What number multiplied by 3 equals 12? Yes, there is only one solution.\n4. What is the equation 𝑥2 = 36 asking us to find? Is there only one solution to this equation?\nAnswer: What number multiplied by itself equals 36? No there are two solutions, 6 and -6.\n5. How is the equation 𝑥𝑦 = 36 different from the one above? What are the possible solutions to this\nequation?\nAnswer: There are many solutions to this equation (4,9), (9,4),(36,1), (12,3),(6,6). It is different\nbecause now you have two variables that can be different numbers.\n6. What is the equation 𝑥2 = 81 asking us to find? Is there only one solution to this equation?\nAnswers: What number multiplied by itself equals 81? No, there are two solutions, 9 and -9\n8WB7 - 33 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.2a Class Activity: Solve Equations using Square and Cube Roots\nIn the problems below, we review how to solve some basic equations.\n1. Write the inverse operation used to solve each of following equations, then show the steps used to solve the\nequation.\na. 𝑥+3 = 7 b. −3𝑥 = 18 c. 𝑥−6 = −14 d. 𝑥 = 3\n7\nSubtraction Division Addition\nMultiplication\nSol idify the statements: If 𝑥2 =𝑎,𝑡ℎ𝑒𝑛 √𝑥2 =√𝑎 𝑎𝑛𝑑 𝑥 =±√𝑎\nIf 𝑥3 =𝑎,𝑡ℎ𝑒𝑛 3√𝑥3 = 3√𝑎 𝑎𝑛𝑑 𝑥 = 3√𝑎\n2. W hat does an inverse operation do? It will “undo” an operation that is performed on a variable; it must be\ndo ne to both sides.\n3. Write and solve an equation to find the side length of a square with an area of 25 cm2.\n𝑥2 = 25\n𝑥 = 5\nA = 25 cm2\n4. Now consider the equation 𝑥2 = 25 out of context. Is 5 the only solution? In other words, is 5 the only number\nthat makes this equation true when substituted in for x?\nNo, −5 is also a solution.\n5. Write and solve an equation to find the side length of a cube with a volume of 27 in3.\n𝑥3 = 27\n𝑥 = 3\nV = 27 in3\n6. Now consider the equation 𝑥3 = 27 out of context. Is 3 the only solution? In other words, is 3 the only number\nthat makes this equation true when substituted in for x?\nYes, a common mistake is that students will think that −3 is also a solution. Show them why −3 is not a\nsolution: (−3)(−3)(−3) = −27 not positive 27\n8WB7 - 34 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7. State the inverse operation you would use to solve these equations. Solve each equation.\na. 𝑥2 = 100 Square root b. 𝑥2 = 36 Square root c. 𝑥3 = 27 Cube root\n𝑥 = ±√10 𝑥 = ±√6 𝑥 = 3\n8. Solve the equations below. Express your answer in simplest radical form.\na. 𝑥2 = 64 b. 𝑥2 = −64 c. 𝑥3 = 8\n𝑥±8 No solution. To solve this equation, take the\nTo solve this equation, take the square cube root of both sides:\nroot of both sides: There is not a real number that 𝑥3 = 8\n𝑥2 =64\nwhen multiplied by itself 3√𝑥3\n= 8\n√𝑥2 =±√64\nequals −64. A common mistake is\n𝑥 = 2\n𝑥 =±8\nfor students to say the answer is\nThis notation means the answers are\n−8 but remember (−8)(−8) =\npositive 8 and negative 8 – there are two Again, you can check your answer by\nsolutions to this equation. We can check positive 64, not negative 64. substituting it back into the original\nby substituting the answers back into the equation. Why doesn’t this have two\noriginal equation: answers like part a? A common mistake is\nFor x = 8: 𝑥2 →82 →(8)(8)=64 to think that −2 is also an answer;\nFor 𝑥 =−8: 𝑥2 →(−8)2 → however (−2)(−2)(−2)= negative 8,\n(−8)(−8)=64 not positive 8.\nd. 𝑥3 = −8 e. 𝑥3 = 1 f. 𝑥2 = 9\n𝑥 = −2 𝑥 = 1 𝑥 = ±3\ng. 𝑥2 = 5 h. 𝑥2 = 10 i. 𝑥3 = 15\n𝑥 = ±√5\nj. 𝑥2 = −100 k. 𝑥3 = −512 l. 𝑥2 = 8\n𝑥 = −8 𝑥 = ±2√2\nWhy does this have a solution when part\nb) does not? Check the answer:\n(−8)(−8)(−8)=−512\nm. 𝑥2 = 45 n. 𝑥3 = 250 o. 𝑥3 = 128\n53\n𝑥 = ±3√5 𝑥 = √2\nSolve this by taking the square root of both\nsides and then be sure to simplify the\nradical.\np. 𝑎2 = 1 q. 𝑧3 = 1 r. 𝑦2 = 0.16\n36 27 𝑦 = 0.4\n1 1\n𝑎 = ± 𝑧 =\n6 3\ns. 𝑥2 +16 = 25 t. 𝑥2 −5 = 59 u. 10𝑥2 = 1440\n𝑥 = ±3 𝑥 = ±12\nTo solve this, first subtract 16 from both To solve this, first divide both sides of the\nsides of the equation and then take the equation by 10 and then take the square\nsquare root of both sides of the equation. root of both sides.\nv. 2𝑥2 = 16 𝑦3 x. 𝑥2 = 𝑝 where p is a\nw. = 32\n2 positive rational number\n𝑦 = 4\n𝑥 = ±√𝑝\n9. Estimate the solution. Use a calculator to check your estimate.\na. 𝑥2 = 53 b. 𝑎2 = 15 c. 𝑧3 = 29\nStudents should reason that this is Students should reason that this is\nbetween ±7 and ±8 but closer to ±7, between ±3 and ±4 but closer to ±4,\ncalculator estimate 𝑥 ≈±7.28 calculator estimate 𝑥 ≈±3.873\n8WB7 - 35 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.2a Homework: Solve Equations using Square and Cube Roots\n1. Solve the equations below. Express your answer in simplest radical form. See class activity #8 for help.\na. 𝑥2 = 121 b. 𝑥2 = 81 c. 𝑦3 = 125\n𝑥±11 𝑦 = 5\nd. 𝑥3 = 216 e. 𝑥3 = −1 f. 𝑥2 = 18\n𝑥 = ±3√2\ng. 𝑥2 = −36 h. 𝑥2 = 2 i. 𝑦3 = 81\n33\n𝑥 = √3\nDon’t forget to simplify your answer:\n3√81 = 3√3∙3∙3∙3 = 33√3\nj. 𝑥2 +12 = 48 k. 25+𝑥2 = 169 𝑦3\nl. = 25\n5\nm. 𝑎2 = 1 n. 𝑧3 = 1 o. 𝑦2 = 0.25\n144 8\n1\n𝑧 =\n2\np. 𝑎2 = − 1 q. 𝑧3 = −0.027 r. 𝑦3 = 1\n36 𝑧 = −0.3 125\nno solution\ns. 𝑎3 = 100 t. 𝑎2 +576 = 625 u. 64+𝑏2 = 289\n𝑎 = 3 √100\nv. 𝑥3 = 𝑝 where p is a w. Solve for r where A is the x. Solve for r where V is the\npositive rational number area of a circle and r is the volume of a cylinder, r is\nradius: 𝐴 = 𝜋𝑟2 the radius, and h is the\nheight: 𝐴 = 𝜋𝑟2ℎ\n𝐴\n𝑟 = √\n𝜋ℎ\nTo solve this, first divide both sides\nby h and 𝜋, then take the square root\nof both sides.\n2. Estimate the solution. Use a calculator to check your estimate.\na. 𝑥2 = 17\nStudents should reason that this is b. 𝑎2 = 67\nbetween ±4 and ±5 but closer to ±4, c. 𝑧3 = 10\ncalculator estimate 𝑥 ≈±4.12\n8WB7 - 36 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. You are designing a bathroom with the following items in it. Your very odd client has asked that each of these\nitems be a perfect square or cube. Use your knowledge of squares and cubes to write an equation that models\nthe area or volume of each item. Then solve the equation to find the side length of each item. The first one has\nbeen done for you.\n3. Rug 1764 in2 4. Ottoman 3,375 in3\nLet s equal the length of one side of the ottoman.\nLet s equal the length of one side of the rug. s3 3,375\n𝑠2 = 1764\n3 s3  3 3375\n√𝑠2 = √1764\ns 15\n𝑠 = 42\nThe side length of the ottoman is 15 inches\nThe side length of the rug is 42 inches.\n5. Mirror 1024 cm2 6. Bar of Soap 27 cm3\n7. Is it probable to have a negative answer for the objects above? Why or why not?\n8. Your client tells you that they would like to double the dimensions of the rug. What will happen to the area\nof the rug if you double the dimensions? Find this new area. What will happen to the area of rug if you triple\nthe dimensions?\n9. Your client also tells you that they would like to double the dimensions of the bar of soap. What will happen\nto the volume of the soap if you double its dimensions? Find this new volume. What will to the volume of the\nbar of some if you triple the dimensions?\nIf you double the dimensions of the bar of soap the volume will be multiplied by a factor or 23 or 8. This\nwould make the volume of the new bar of soap 216 cm3. If you triple the dimensions the volume would be\nmultiplied by a scale factor of 33 or 27, making the new volume 729 cm3.\n10. Write and solve an equation of your own that has a power of 2 in it.\nAnswers will vary.\n11. Write and solve an equation of your own that has a power of 3 in it. Answers will vary.\n8WB7 - 37 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.2b Class Activity: Tower Views\n1. Use inverse operations to solve the following problems.\na. √𝑥 = 4 b. √𝑎 = 9 c. 2√𝑦 = 4 d. 3 √𝑧+5 = 13\n𝑥 = 16 𝑎 = 81 𝑦 = 4 𝑧 = 512\nTo solve these problems, you must get rid of the square root symbol. This can be achieved by squaring both sides of the equation.\nTaking the square root of a number and squaring it are inverse operations so they “undo” each other. For example, to solve part a:\n√𝑥 =4\n(√𝑥)2 =42\n𝑥 =16\nYou can check your answer by substituting your answer back into the original equation. For part c. divide both sides by 2 and then\nsquare both sides.\nPeople often wonder how far they can see when they’re at the top of really tall buildings such as the\n𝐸𝑚𝑝𝑖𝑟𝑒 𝑆𝑡𝑎𝑡𝑒 𝐵𝑢𝑖𝑙𝑑𝑖𝑛𝑔,𝑇ℎ𝑒 𝑆𝑒𝑎𝑟𝑠 𝑇𝑜𝑤𝑒𝑟 𝑖𝑛 𝐶ℎ𝑖𝑐𝑎𝑔𝑜,𝑒𝑡𝑐.\nThe furthest distance you can see across flat land is a function of your height above the ground.\nIf h is the height in meters of your viewing place, then d, the distance in kilometers you can see, can be given\nby this formula: 𝑑 = 3.532√ℎ\n2. The equation above can be used to find the distance when you know the height. Rewrite the equation to find\nheight when you know the distance.\nd2  d 2\nh or h\n \n12.475 3.532\n3. If you were lying down on top of a building that is 100 meters tall, how far could you see? Write an\nequation to solve this problem. Solve the problem, showing all steps.\nStart with your equation – it makes sense to use the original equation (before you rearranged it in #2) because you are trying to\nfind the distance d you can see. Substitute in what you know and solve for the unknown:\n𝑑 =3.532√ℎ\n𝑑 =3.532√100\n𝑑 =3.532(10)\n𝑑 =35.32\nYou could see approximately 35.32 kilometers from a height of 100 meters.\n4. The CN Tower in Toronto, Canada is 555 meters tall. It is near the shore of Lake Ontario, about 50\nkilometers across the lake from Niagara Falls. Your friend states that on a clear day, one can see as far as\nthe falls from the top of the Tower. Are they correct? Explain your answer.\nYour friend is correct. On a clear day you can see as far as 83 kilometers.\n5. The Washington Monument in Washington D.C. is 170 meters tall. How far can one see from its top? Write\nthe equation you need. Show all steps.\n6. How high must a tower be in order to see at least 60 kilometers? Write the equation you need. Show all\nsteps.\nFor this problem, it makes sense to use the rearranged equation from #2 because you are trying to find the height h. Again,\nsubstitute in what you know and solve for the unknown:\n𝑑2\nℎ =\n12.475\n602\nℎ =\n12.475\n3600\nℎ =\n12.475\nℎ =288.577\nYou must be on a tower that is at least 288.577 meters high to see 60 kilometers.\n8WB7 - 38 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7. Advertising for Queen’s Dominion Amusement Park claims you can see 40 kilometers from the top of its\nobservation tower. How high is the tower? Write the equation you need. Show all steps.\n8. To enhance understanding of the relation between height and viewing distance, first complete the table\nbelow. Express each output value to the nearest whole number; then plot the data points on an appropriately\nlabeled graph. Do not connect the points.\na. Height (m) 0 50 100 150 200 250 300 350 400 450 500\nDistance 0 25 35.2 43.3 50 55.8 61.2 66.1 70.6 74.9 79\n(km)\nb.\nc. What kind of association is shown between height and viewing distance?\nThere is a nonlinear positive association. As the height increases the viewing distance also increases.\nThe relationship between the change in height and change in viewing distance is not constant.\nRather, as the height increases, the change in the viewing distance becomes less and less.\nStudents might want to argue that this is a linear association. Remind them to look at the\nslope of the line. Ask them if they see a constant rate of change.\n8WB7 - 39 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.2b Homework: Driving, Running, and Basketballs\n1. Use inverse operations to solve the following problems.\na. √𝑥 = 5 b. 3 = √𝑎 c. 3√𝑦 = 18 d. √𝑧−3 = 78\n𝑥 = 25\nFor help with these problems, see class activity #1.\nDeven is a civil engineer. He needs to make sure that the design of a curved road ensures the safety of a car\ndriving at the speed limit. The equation 𝑉 = √2.5𝑟 represents the maximum velocity that a car can travel safely\non an unbanked curve. V represents the maximum velocity in miles per hour and r represents the radius of the\nturn in feet.\n2. If a curve in the road has a radius of 1690 ft. what is the maximum velocity that a car can safely travel on the\ncurve? To solve this problem, write down the equation from above, substitute in what you know, and solve for the\nunknown:\n𝑉 = √2.5𝑟\n𝑉 = √2.5∙1690\n𝑉 = √4225\n𝑉 = 65\nA car can safely travel 65 mph on the curve.\n3. The equation above can be used to find the velocity when you know the radius. Rewrite the equation to find\nradius if you know the velocity.\nStart with the original equation:\n𝑉 = √2.5𝑟\n𝑉2 = 2.5𝑟 Square both sides of the equation.\n𝑉2\n= 𝑟 Divide both sides of the equation by 2.5.\n2.5\n4. If a road is designed for a speed limit of 55 miles per hour, what is the radius of the curve?\n5. If a road is designed for a speed limit of 35 miles per hour, what is the radius of the curve?\n6. What type of association exists between the radius of the curve and the maximum velocity that a car can travel\nsafely?\n8WB7 - 40 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 9.8𝑙\nAnnie is on the track team her coach tells her that the function 𝑆 = 𝜋√ can be used to approximate the\n7\nmaximum speed that a person can run based off of the length of their leg. S represents the runner’s speed in\nmeters per second and l represents the length of the runner’s leg in meters.\n7. What is the maximum speed that Annie can run if her leg length is 1.12 meters?\n9.8𝑙\n𝑆 =𝜋√\n7\n9.8(1.12)\n𝑆 =𝜋√\n7\n10.976\n𝑆 =𝜋√\n7\n𝑆 =𝜋√1.568\n𝑆 =𝜋∙1.252\n𝑆 =3.931\nAnnie can run a maximum speed of 3.93 meters per seconds with a leg length of 1.12 meters.\n8. The equation given above can be used to find the speed of the runner given their leg length. Rewrite the\nequation to find the leg length of the runner given their speed.\n2\n s \nl .714\n \n\n9. What is the leg length of a runner if their maximum running speed is 2.6 meters per second? Round your\nanswer to the nearest hundredth.\n10. What kind of association exists between the length of a person’s leg and their maximum running speed?\nPositive, as the leg length increases the maximum running speed also increases.\n11. Is leg length the only thing that affects a runner’s maximum speed? Explain your answer.\nThe surface area of a sphere is found by the equation 𝐴 = 4𝜋𝑟2 where A represents the surface area of the\nsphere and r represents the radius.\n12. A basketball has a radius of 4.7 in, what is its surface area?\n13. The equation given above can be used to find the surface area given the radius. Rewrite the equation so that\nyou can find the radius if you are given the surface area.\n14. The surface area of a dodge ball is 153.9. in2. What is the radius of the dodge ball?\n8WB7 - 41 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.2c Self-Assessment: Section 7.2\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept. Sample problems for each standard can be found\non the following page(s).\nSkill/Concept Minimal Partial Understanding Sufficient Substantial Mastery\nUnderstanding 2 Mastery 4\n1 3\n1. Solve simple\nquadratic and cubic\nequations.\n1. Solve.\na. 𝑥2 = 100\nb. 𝑥3 = 64\nc. 𝑥2 +30 = 91\nd. 𝑥3 −9 = 134\ne. Solve for r. 𝐴 = 1 𝑟2𝑦\n2\n8WB7 - 42 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Section 7.3: Rational and Irrational Numbers\nSection Overview:\nThis section begins with a review of the different sets of rational numbers and why a need arose to distinguish\nthem. Students then explore different ways of representing rational numbers, starting with a review of how to\nchange fractions into decimals. During this process, students are reminded that the decimal expansion of all\nrational numbers either terminates or repeats eventually. From here, students review how to express terminating\ndecimals as fractions and learn how to express repeating decimals as fractions by setting up and solving a\nsystem of equations. This skill allows them to show that all decimals that either terminate or repeat can be\nwritten as a fraction and therefore fit the definition of a rational number. After this work with rational numbers,\nstudents investigate numbers whose decimal expansion does not terminate or repeat: irrational numbers. With\nthis knowledge, students classify numbers as rational and irrational. Students learn different methods for\napproximating the value of irrational numbers, zooming in to get better and better approximations of the\nnumber. They then use these approximations to estimate the value of expressions containing irrational numbers.\nLastly, students compare and order rational and irrational numbers.\nConcepts and Skills to Master:\nBy the end of this section, students should be able to:\n1. Know that real numbers that are not rational are irrational.\n2. Show that rational numbers have decimal expansions that either terminate or repeat eventually.\n3. Convert a repeating decimal into a fraction.\n4. Know that the square root of a non-perfect square is an irrational number.\n5. Understand that the decimal expansions of irrational numbers are approximations.\n6. Show the location (or approximate location) of real numbers on the real number line.\n7. Approximate the value of irrational numbers, zooming in to get better and better approximations.\n8. Estimate the value of expressions containing irrational numbers.\n9. Compare and order rational and irrational numbers.\nAn interesting fact: In case you were wondering where the term rational comes from, it comes from the word\n“ratio”, because rational numbers are those that can be expressed as the ratio of two integers. Irrational, then,\nmeans all numbers that are not rational (and therefore cannot be expressed as the ratio of two integers).\n8WB7 - 43 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3 Anchor: Revisiting the Number Line\nDirections: Show the length of the following numbers on the number line below. Use the grid on the following\npage to construct lengths, using tick marks on an index card or tracing paper, and transfer those lengths onto the\nnumber line. Then answer the questions that follow. Note: On the grid, a horizontal or vertical segment joining\ntwo dots has a length of 1. On the number line, the unit length is the same as the unit length on the dot grid.\n𝐴:√25 𝐵:√2 𝐶:√8 𝐷:2√2 𝐸:√5 𝐹:2√5\nStudents use the dot paper to\nconstruct lengths of irrational\nnumbers as needed and\n0 1 2 3 4 5 6 transfer these lengths to the\nnum ber line. They may realize\nthat in order to construct 2√2\n1. Use the number line to write a decimal approximation for √2. Verify your estimate with a calculator.\nall they need to do is double\nAnswers will vary – possible answer 1.4\nthe length of √2. They may\nalso realize that √8 and 2√2\n2. Would 1.41 be located to the right or to the left of √2 on the number line?\noccupy the same location on\nleft\nthe number line.\n3. Describe and show how you can put −√2 on the number line. Write the decimal approximation for\n−√2.\nTrace the length √2, place the right endpoint of the segment on 0, and trace the segment; -1.4\n4. Describe and show how you can put (2+√2) on the number line. Estimate the value of this expression.\nTrace the length √2, place the left endpoint of the segment on 2, and trace the segment; 3.4\n5. Describe and show how you can put (2−√2) on the number line. Estimate the value of this expression.\nTrace the length √2, place the right endpoint of the segment on 2, and trace the segment; 0.6\n6. Describe and show how you can put 2√2 on the number line. Estimate the value of this expression.\nDouble the length of √2; 2.8\n7. Use the number line to write a decimal approximation for √5.\nAnswers will vary – possible answer 2.2\n8. Would 2.24 be located to the right or to the left of √5 on the number line?\nright\n9. Describe and show how you can put 1+√5 on the number line. Estimate the value of this expression.\nTrace the length √5, place the left endpoint of the segment on 1, and trace the segment; 3.2\n8WB7 - 44 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8WB7 - 45 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3a Class Activity: The Rational Number System\nOur number system has evolved over time. On the following pages, you will review the subsets of numbers that\nare included in the set of rational numbers. The following prompts will lead you through a discussion of a\nstudent’s current understanding which is that of the rational number system. Number lines are provided for you\nto show how each of these numbers can be associated to a point on the number line.\nWhole Numbers: Early on, people needed a way to count objects. We call this set of numbers the whole\nnumbers. Talk about how you can construct a number line by marking a point for 0 and then marking a second\npoint to the right of 0 that represents one unit. We can then continue this process and create segments of equal\nlength to associate every whole number to a point on the line.\nIntegers: We need a way to talk about units that are to the left of 0. For example, how can we use a number to\nrepresent a temperature of 5 degrees below 0 or that someone is in debt $25? To the set of whole numbers we\nadd the set of their opposites and call all these numbers the integers. Whole numbers and their opposites are an\nequal distance from 0. In order to show integers on the number line, we can use our unit length to mark off a\nsuccession of equally spaced points on the line that lie to the left of 0. We can now associate every integer to a\npoint on the line.\nRational Numbers: What if I have $3.25? How would I describe the portion of a pie left if it originally had 8\npieces and 4 of them had been eaten? What if I need a little more than 3 yards of fabric to make a pillow? The\nneed to describe part of a whole gave rise to the set of numbers called rational numbers. To associate each\nrational number to a point on the line, divide the unit interval into q parts. If we append p of these together, we\n𝑝\nget to the point represented by . There are two number lines here so you can show a few different ways of\n𝑞\npartitioning the unit interval (i.e. halves, thirds, fifths, tenths). Show positive and negative rational numbers.\nOver the years, you have expanded your knowledge of the number system, gradually incorporating the sets of\nnumbers mentioned above. These sets of numbers are all part of the rational number system.\n𝑝\nA rational number is any number that can be expressed as a quotient of two integers\n𝑞\nwhere q does not equal 0.\n8WB7 - 46 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 1. Begin to fill out the table below with different subsets, including equivalent forms, of rational numbers\nyou know about so far and give a few examples of each. You will continue to add to this list throughout this\nsection.\nAs you work through this section, help students build the list below. Some of the numbers listed will be\n1\ndifferent representations of the same value (i.e. and 0.5).\n2\nSubsets of the Rational Numbers Examples\nNatural\nWhole\nIntegers\nFractions\nTerminating Decimals\nRepeating Decimals\nPercent\nMixed numbers\n2. Change the following rational numbers into decimals without the use of a calculator.\nStudents changed fractions into decimals in 7th grade (see 7th grade, Chapter 1). The point of these problems is not to\nsee how well students know how to divide. The goal is for them to see that the decimal expansion of a fraction will\neventually either terminate or repeat. It is recommended that you do these problems as a class and without the use of\na calculator. This way students can see that there are only so many remainders you can have for a given problem and\nonce a remainder repeats itself, the quotient will start to take on a repeating pattern. They will also see that any\nfraction with a denominator whose prime factors are only 2 and 5 will always terminate. This is due to the fact that in\nour decimal system, a decimal has a denominator that (although not explicitly given) is understood to be a power of\n10.\n1 9\na. b.\n2 5\n1.8\n0.5\n8WB7 - 47 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3 1\nc. d.\n8 3\n0.375 0.3̅\n4 1\ne. f.\n15 7\n0.26̅ 0.̅1̅4̅̅2̅̅8̅5̅̅7̅\nThis is a great problem for discussing why there\nmust always be a repeating pattern because there\nare only so many ways the division algorithm can\ngo. Before starting the problem, ask students what\nthe possible remainders are when dividing by 7.\n(0 to 6). For this problem, they may already know\nthat 0 is not a possibility based on the discussion\nabove. Therefore, we can have remainders of 1, 2,\n3, 4, 5, and 6. Once one of these reappears, our\nquotient will start repeating a pattern. Work\nthrough the problem with students so that they\ncan see this.\n3. What do you notice about the decimal expansion of any rational number? Why is this true?\nSee discussion above.\nRevisit question #1 on the previous page. Have students add additional representations of rational numbers\n(i.e. terminating and repeating decimals) to their list.\n8WB7 - 48 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3a Homework: The Rational Number System\n1. Change the following rational numbers into decimals without the use of a calculator.\n1 7\na. b.\n5 4\n0.2 1.75\n5 2\nc. d.\n8 3\n0.6̅\n2 3\ne. f.\n9 11\n0.2̅̅̅7̅\n8WB7 - 49 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3b Class Activity: Expressing Decimals as Fractions\nAs we discovered in the previous section, when we converted fractions into decimals, the result was either a\nterminating or repeating decimal.\nIf we are given a terminating or repeating decimal, we need a method for changing them into a fraction in order\nto prove that they fit the definition of a rational number.\nIn 7th grade, you learned how to convert terminating decimals into fractions. Here are a few examples:\n3\n0.3 =\n10\n25 1\n0.25 = =\n100 4\n375 3\n0.375 = =\n1000 8\n6 3 103\n−2.06 = −2 = −2 = −\n100 50 50\nNow you try a few…\n4 ÷22\n0.4 = →\n10 5\nTo simplify these fractions, find the greatest common factor and divide both the numerator and denominator by\nthe greatest common factor.\n5 ÷5 1\n0.05 = →\n100 20\n11\n0.275 =\n40\n3\n1.003 = 1\n1000\nSo, how do we express a repeating decimal as a fraction? For example, how would you convert the repeating\ndecimal 0.4̅̅̅5̅ into a fraction? Try in the space below.\n8WB7 - 50 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. We can use a system of two linear equations to convert a repeating decimal into a fraction. Let’s look at an\nexample:\nExample 1:\nThe decimal 0.3̅ is a repeating decimal that can be thought of as 0.33333… where the “…” indicates that the 3s\nrepeat forever. If they repeat forever, how can we write this number as a fraction? Here’s a trick that will\neliminate our repeating 3s.\nLet a represent our number 𝑎 = 0.3̅.\nMultiply both sides of the equation by 10 which would give us a second equation 10𝑎 = 3.3̅.\nNow we have the following two equations:\n10𝑎 = 3.3̅\n𝑎 = 0.3̅\nLet’s expand these out:\n10𝑎 = 3.333333333333……\n𝑎 = 0.333333333333……\nWhat will happen if we subtract the second equation from the first? Let’s try it (remembering to line up the\ndecimals):\n10𝑎 = 3.333333333333……\n− 𝑎 = 0.333333333333……\n___________________________\n9𝑎 = 3\n3\n𝑎 = (Divide both sides by 9)\n9\n1\n𝑎 = (Simplify the fraction)\n3\nThe mathematical foundation walks through how to use substitution to solve these types of problems if you\nwant to show this method to students as well.\n8WB7 - 51 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Example 2:\nThe decimal 0.5̅̅̅4̅ is a repeating decimal that can be thought of as 0.54545454… where the “…” indicates that\nthe 54 repeats forever. Let’s see how to express this as a fraction.\nLet a represent our number 𝑎 = 0.5̅̅̅4̅.\nMultiply both sides of the equation by 100 this time which would give us a second equation 100𝑎 = 54.5̅̅̅4̅.\nNow we have the following two equations:\n100𝑎 = 54.5̅̅̅4̅\n𝑎 = 0.5̅̅̅4̅\nAgain, let’s expand these out:\n100𝑎 = 54.5454545454……\n𝑎 = 0.5454545454……\nNext, subtract the second equation from the first (again, remembering to line up the decimals):\n100𝑎 = 54.5454545454……\n− 𝑎 = 0.5454545454……\n___________________________\n99𝑎 = 54\n54\n𝑎 = (Divide both sides by 99)\n99\n6\n𝑎 = (Simplify the fraction)\n11\nWhy do you think we multiplied the second example by 100 instead of 10 as we did in the first example? What\nwould have happened if we had multiplied by 10 in example 2? Try it below and see.\nYou are not creating a system that will cause the repeating part of the decimal to cancel out – see below.\n10𝑎 = 5.4545454……\n𝑎 = 0.5454545454……\nDiscuss how you multiply by 10𝑎 where a is the number of digits that are part of the repeating pattern.\nExample 3: Change the decimal 2.4̅ into a fraction\nThe decimal 2.4̅ is a repeating decimal that can be thought of as 2.4444444… where the “…” indicates that the\n4s repeat forever.\nLet a represent our number 𝑎 = 2.4̅.\n22 4\n𝑎 = or 2\n9 9\nTalk with students about how they only have to deal with changing the decimal piece to a fraction and then they\ncan tack the whole number on – it makes the math a little easier.\n8WB7 - 52 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Example 4: Change the decimal 3.12̅ into a fraction.\n11\n3\n90\nExample 5: Change the decimal 0.̅1̅2̅̅3̅ into a fraction.\nIn this problem, we will create our second equation by multiplying both sides of the original equation by 1,000\nbecause there are 3 digits that repeat.\n41\n333\nExample 6: Change the decimal 4.1̅ into a fraction.\n1\n4\n9\nExample 7: Change the decimal 2.01̅̅̅5̅ into a fraction.\nIn this problem, we will create our second equation by multiplying both sides of the original equation by 100\nbecause there are 2 digits that repeat.\n1\n2\n66\n8WB7 - 53 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3b Homework: Expressing Decimals as Fractions\nDirections: Circle whether the decimal is terminating or repeating then change the decimals into fractions.\n3 2. 0.02 Terminating Repeating\n1. 0.6 Terminating Repeating\n5\n3. 1.25 Terminating Repeating 8\n4. −0.064 − Terminating Repeating\n125\n5. 0.5̅ 5 Terminating Repeating 6. 0.4̅̅̅5̅ Terminating Repeating\n9\n7. 0.083̅ Terminating Repeating 8. 5.26̅ 5 4 Terminating Repeating\n15\n9. −0.24 Terminating Repeating 10. 3.65 Terminating Repeating\n8WB7 - 54 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 11. −0.58 Terminating Repeating 12. 1.16̅ Terminating Repeating\n29 7\n−\n50 6\n13. 2.6̅ Terminating Repeating 14. 0.2 Terminating Repeating\n15. 0.2̅̅̅7̅ Terminating Repeating 16. 0.45 Terminating Repeating\n9\n20\n8WB7 - 55 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3c Class Activity: Expanding Our Number System\nOrganize the following candy into the Venn diagram.\nSnickers, Hershey’s Chocolate Bar, Mars Bar, Laffy-Taffy, Starburst\nCandy\nBars\nTaffy-like\nChocolate\nStarburst\nHershey’s\nLaffy-Taffy\nCaramel\nMars Bar\nNuts\nSnickers\nList the sets of numbers we have learned about so far, including equivalent forms.\nWhole numbers, Integers, Fractions, Decimals (repeating and terminating), Natural…….\nSo are all numbers rational numbers? Are there numbers that cannot be written as a quotient of two integers?\nWhat about √2 ? Can you write √2 as a fraction? Why or why not?\nThe evidence is that the decimal expansion is infinitely long and there is no pattern (as far as we know). Refer\nto the mathematical foundation for an informal proof.\nNumbers like √2, which do not have a terminating or repeating decimal expansion are irrational numbers.\nIrrational numbers cannot be expressed as a quotient. Discuss with students how the square roots of all non-\nperfect squares (and the cube roots of all non-perfect cubes) are irrational.\nRational and Irrational numbers together form the set of real numbers. Real numbers can be thought of as\npoints on an infinitely long line called the number line. Just like we organized the candy bars in the Venn\ndiagram above we can organize the real number system.\n8WB7 - 56 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Have students come up with a diagram that represents the real number system and have them compare and\ncontrast diagrams with a neighbor. A sample is shown below. They can also include examples of each set of\nnumbers in their diagrams. Again, re-emphasize that we can show the location of all numbers in the real number\nsystem on the real number line.\nReal Number System\nRational\nNumbers\nIrrational Numbers\nIntegers\nWhole\nNumbers\nDirections: Classify the following numbers and provide a justification.\nJustification\nWhole Rational Irrational\nNumber Integer Real Answers will vary, sample\nnumber number number\njustifications given below\n2\n1. x x Number is a fraction\n3\n2. 0.25\nNumber is negative, can be\n3. −2 x x x\na fraction\n4. √5 x x 5 is not a perfect square\n5. 10\n6. 0 x x x x\n7. √10\n36 is a perfect square so its\n8. √36 x x x x side length is a whole\nnumber\nNumber is a perfect square\n9. −√121 x x x\nand then the opposite\n1\n10. 2\n2\nNumber is a repeating\n11. 0.083̅ x x decimal, number can be\nwritten as a fraction\n8WB7 - 57 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Justification\nWhole Rational Irrational\nNumber Integer Real Answers will vary, sample\nnumber number number\njustifications given below\n10\n12.\n13\n𝜋 is a decimal that never\n13. π x x repeats or terminates(as far\nas we know)\nA multiple of an irrational\n14. -3π x x\nnumber is irrational\n15. 0.265̅̅̅4̅\n16. 3 √27 x x x x 27 is a perfect cube\nThis is a predictable pattern\n17. 1.2122122212222… x x\nbut not a repeating pattern.\n18. 3 √30 x x 30 is not a perfect cube\n√2 is not a perfect square\n19. √2 x x and an irrational number\n2 divided by a number is still\nirrational\n20. The side length of a\nThat would make the side\nsquare with an area of x x\nlength of the square √2\n2\n21. The side length of a\nsquare with an area of x x x x √9 = 3\n9\n22. The number half-way Number can be written as a\nx x\nbetween 3 and 4 fraction\n23. The number that\nrepresents a loss of 5 x x x Number = -5\nyards\n8WB7 - 58 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3c Homework: Expanding Our Number System\nSee class activity for help and sample problems.\nDirections: Classify the following numbers and provide a justification.\nWhole Rational Irrational\nNumber Integer Real Justification\nnumber number number\nNumber is not a\n1. √2 x x\nperfect square\nNumber is a perfect\n2. √1 x x x x\nsquare. √1 = 1\n1\n3.\n3\nNumber is an integer;\n4. −157 x x x therefore it can be\nwritten as a fraction.\n1\n5. 4\n9\n6. −0.375\n7. −√5\nNumber can be written\n8. 0.2̅ x x\nas a fraction\n9. 3 √125\n10. −√81\n11. −2.24̅\n𝜋 multiplied by a\n12. 2𝜋 x x whole number is still\nirrational\n13. The side length of a\nsquare with an area\nof 49\n14. The side length of a\nsquare with an area\nof 1\n15. The side length of Side length = √5\nthe side of a square x x which is not a perfect\nwith an area of 5 square\n16. The side length of a\nsquare with an area\nof 24\n17. The number half-\nway between 0 and -\n1\n18. The number that\nrepresents 7 degrees\nbelow 0.\n8WB7 - 59 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 19. Give your own example of a rational number.\nAnswers will vary, this might be a nice opportunity to discuss with students that 0 is a rational number\n20. Give your own example of an irrational number.\nAnswers will vary\nDirections: The table below contains statements about rational and irrational numbers. If the statement is true,\nput a check in the box. If the statement is not true, write a correct statement.\nThe corrected statements may vary – have students share out and decide whether they agree with the statements\nwritten by their peers. Great way to hit practice standard: Construct viable arguments and critique the reasoning\nof others.\nStatement Check if True or Correct Statement\n21. You can show the exact decimal expansion of False, corrected statements may vary but possible\nthe side length of a square with an area of 5 justifications:\nThe side length of a square with an area of 5 square units is\nsquare units.\n√5. √5 is an irrational number so you cannot show its exact\ndecimal expansion. A possible corrected statement is:\nYou cannot show the exact decimal expansion…\nAnother possible answer is to write in a different area:\nYou can show the exact decimal expansion of the side length\nof a square with an area of 25 square units (the side length of\n1\nthis square is 5 units) or square units (the side length of this\n4\n1\nsquare is units).\n2\n22. You can construct and show the length √5 on a\nnumber line.\n23. Square roots of numbers that are perfect squares\nare rational.\n24. The number 0.256425642564… is rational.\n25. You can always use a calculator to determine\nwhether a number is rational or irrational by\nlooking at its decimal expansion.\n26. The number 0.6̅ is irrational because its False, The number 0.6̅ is rational because all\ndecimal expansion goes on forever. repeating decimals can be written as a fraction.\n27. The number half-way between 3 and 4 is\nrational.\n28. You can build a perfect cube with 36 unit\ncubes.\n29. If you divide an irrational number by 2, you\nwill still have an irrational number.\n30. The side length of a cube made of 64 unit\nblocks is irrational.\nMake up two of your own statements that are true about rational or irrational numbers.\n8WB7 - 60 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3d Class Activity: Approximating the Value of Irrational Numbers\nSo far, we have seen that we can show the location of an irrational number on the number line. We also know\nthat we cannot show the entire decimal expansion of an irrational number because it is infinitely long and there\nis no pattern (as far as we know). However, we can come up with good approximations for the numerical value\nof an irrational number. It is suggested that the students don’t have a calculator but the teacher does any\ncalculations for the class. Also, make sure that students understand what is happening from one number line to\nthe next. We are zooming in on a piece of the number line in order to make better approximations. In the\nprocess, the scale changes.\nThe decimal expansion for π to eight decimal places is 3.14159265… On the number line, we know that π lies\nsomewhere between 3 and 4:\nWe can zoom in on the interval between 3 and 4 and narrow in on where π lies:\nAnd if we zoom in again on the interval from 3.1 to 3.2:\nAnd again:\nWe can imagine continuing this process of zooming in on the location of π on the number line, each time\nnarrowing its possible location by a factor of 10.\nOnce we have an approximation for an irrational number, we can approximate the value of expressions that\ncontain that number.\nFor example, suppose we were interested in the approximate value of 2𝜋? We can use our approximations of π\nfrom above to approximate the value of 2𝜋 to different degrees of accuracy:\nBecause 𝜋 is between 3 and 4, 2𝜋 is between __6___ and __8__.\nBecause 𝜋 is between 3.1 and 3.2, 2𝜋 is between __6.2___ and _6.4____.\nBecause 𝜋 is between 3.14 and 3.15, 2𝜋 is between __6.28___ and __6.30___.\nBecause 𝜋 is between 3.141 and 3.142, 2𝜋 is between __6.282___ and _6.284____.\nCheck the value of 2𝜋 on your calculator. How are we doing with our approximations of 2𝜋?\n8WB7 - 61 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. We can use a method of guess and check to give us an estimate of the numerical value of an irrational number\nthat is correct up to as many decimal points as we need.\nDirections: Approximate the value of the following irrational numbers to the indicated degrees of accuracy.\nYou can use your calculator for the following questions but do not use the square root key.\n1. Between which two integers does √5 lie?\nWe know that √5 lies between the perfect squares √4 and √9 so the decimal expansion of √5 lies\nbetween 2 and 3: √4 √5 √9\n2 3\na. Which integer is it closest to? 2\nb. Show its approximate location on the number line below. When students put these numbers on the\nnumber line, make sure that they understand that they are just approximating its location but in this case,\nwe know that our point should be closer to 2. On the next number line, we are going to divide the segment\nfrom 2 to 3 into 10 equal parts so that we can zoom in further to where our point lives on the interval from\n2 to 3. As you do these problems, make sure students see that we are zooming in on the interval\nfrom 2 to 3 and that the length of our intervals change. The arrows shown below may help to\nillustrate this.\nc. Now find √5 accurate to one decimal place. Show its approximate location on the number line\nbelow. Let’s narrow in on our approximation. Since we know that our number is closer to 2, it makes\nsense for our initial guess to be a number less than 2.5. We may even decide to start with 2.1 as a guess.\nStudents should use a calculator to check 2.12, 2.22, 2.32, etc. Once they find the two numbers that √5 lies\nbetween (2.2 and 2.3), have them approximate its location on the number line below.\nd. Now find √5 accurate to two decimal places. Show its approximate location on the number line\nbelow. Repeat the process to zoom in even further. We are dividing the interval from 2.2 to 2.3 into 10\nequal parts, again narrowing in on the possible location of our point by a factor of 10. √5 lies between\n2.23 and 2.24. We can continue this process until we get as close as we want in our approximation.\ne. Use your work from above to approximate the value of the expression 2+√5 to the nearest\nwhole number. The nearest tenth. The nearest hundredth.\n2+√5 is between 4 and 6 (Students can think of this visually by thinking of taking the segment on the\nfirst number line, picking it up, and shifting it so that its left endpoint is at 2 instead of 0.)\n2+√5 is between 4.2 and 4.3\n2+√5 is between 4.23 and 4.24\n8WB7 - 62 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 2. Between which two integers does √15 lie?\nWe know that √15 lies between the perfect squares √9 and √16 so the decimal expansion of √15 lies\nbetween 3 and 4.\n√9 √15 √16\n3 4\na. Which integer is it closest to? 4\nb. Show its approximate location on the number line below.\nc. Now find √15 accurate to one decimal place. Show its approximate location on the number line\nbelow.\nAgain, narrow in by a factor of 10. Now it makes sense for our initial guess to be greater than 3.5 or\nwe may choose to start with 3.9 as a guess. Students will find that √15 lies between 3.8 and 3.9.\nd. Now find √15 accurate to two decimal places. Show its approximate location on the number line\nbelow.\ne. Use your work from above to approximate the value of the expression 4√15 to the nearest whole\nnumber. To the nearest tenth. To the nearest hundredth.\n4√15 is between 12 and 16\n4√15 is between 15.2 and 15.6\n4√15 is between 15.48 and 15.52\n8WB7 - 63 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3. Repeat the process above to find √52 accurate to two decimal places. Place your numbers on the\nnumber lines provided each time you increase the degree of accuracy of your estimate.\na. To the nearest whole number:\nWe know that √52 lies between the perfect squares √49 and √64 so the decimal expansion of √52 lies\nbetween 7 and 8, and it is closer to 7.\n√49 √52 √64\n7 8\nb. To the nearest tenth: Narrowing in by a factor of 10, we find that √52 lies between 7.2 and 7.3\nc. To the nearest hundredth: Narrowing in by a factor of 10 again, we find that √52 lies between\n7.21 and 7.22\nd. Use your work from above to approximate the value of 3+√52 to the nearest whole number. To\nthe nearest tenth. To the nearest hundredth.\n3+√52 is between 10 and 11\n3+√52 is between 10.2 and 10.3\n3+√52 is between 10.21 and 10.22\ne. Use your work from above to approximate the value of 2√52 to the nearest whole number. To\nthe nearest tenth. To the nearest hundredth.\n2√52 is between 14 and 16\n2√52 is between 14.2 and 14.6\n2√52 is between 14.42 and 14.44\n8WB7 - 64 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. #4 – 8 below utilize a quick, computational method for approximating square roots that was developed by\nNewton and is the method used in calculators to find roots of numbers of all orders. Its general theory forms the\nbasis for most computer algorithms to find solutions of complicated equations. See the mathematical foundation\nfor further discussion and an abstraction of Newton’s Method.\n4. Pick a positive integer between 1 and 100, call it 𝐴 . Find the average of your number (𝐴 ) and\n0 0\n100 100\nand call this number 𝐴 . Take the average of 𝐴 and and call this number 𝐴 . Take the\n1 1 2\nyour number (𝐴0) 𝐴1\n100\naverage of 𝐴 and and call this number 𝐴 . Repeat this process two more times.\n2 3\n𝐴2\nStudents should see that the average stabilizes around 10 (the square root of 100).\n5. Pick a different positive integer between 1 and 100 and repeat the process above. What do you notice?\nRegardless of the number chosen, the average stabilizes around 10.\n6. Pick a positive integer between 1 and 100, call it 𝐴 . Find the average of your number (𝐴 ) and\n0 0\n25 25\nand call this number 𝐴 . Take the average of 𝐴 and and call this number 𝐴 . Take the\n1 1 2\nyour number (𝐴0) 𝐴1\n25\naverage of 𝐴 and and call this number 𝐴 . Repeat this process two more times.\n2 3\n𝐴2\nStudents should see that the average stabilizes around 5 (the square root of 25).\n7. Compare the number you picked for #6 with that of a neighbor. Compare your end results. What do you\nnotice?\nAgain, regardless of the number chosen, the average stabilizes around 5.\n8. Pick a positive integer between 1 and 100, call it 𝐴 . Find the average of your number (𝐴 ) and\n0 0\n5 5\nand call this number 𝐴 . Take the average of 𝐴 and and call this number 𝐴 . Take the\n1 1 2\nyour number (𝐴0) 𝐴1\n5\naverage of 𝐴 and and call this number 𝐴 . Repeat this process two more times. What do you notice?\n2 3\n𝐴2\nStudents should see that the average stabilizes around the square root of 5. Students will notice that for\neach A used, A and 5/A are on opposite sides of sqrt5. Thus it makes sense that the average of A and\n5/A is a better approximation to sqrt5 since it lies between A and 5/A. See the mathematical foundation\nfor a more detailed explanation of why this method works.\n8WB7 - 65 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. Directions: Solve the following problems. Again, do not use the square root key on your calculator.\n9. A hospital has asked a medical supply company to manufacture intravenous tubing (IV tubing) that has a\nminimum opening of 7 square millimeters and a maximum opening of 7.1 square millimeters for the\nrapid infusion of fluids. The medical design team concludes that the radius of the tube opening should be\n1.5 mm. Two supervisors review the design team’s plans, each using a different estimation for π.\nSupervisor 1: Uses 3 as an estimation for π\nSupervisor 2: Uses 3.1 as an estimation for π\nThe supervisors tell the design team that their designs will not work. The design team stands by their\nplans and tells the supervisors they are wrong. Who is correct and why? Recall that the formula for the\narea of a circle is 𝐴 = 𝜋𝑟2.\nThe point of this problem and the one that follows is to help students to see that there are times when we\ndo not need to be very precise in our approximations of irrational numbers and there are others (like the\nexample above) that we need to be very precise in our approximations of irrational numbers.\nWork with students to determine the radius that would have been calculated by each supervisor with the\napproximation they used for π. What do they think the design team used for their approximation?\n10. A square field with an area of 2,000 square ft. is to be enclosed by a fence. Three contractors are\nworking on the project and have decided to purchase slabs of pre-built fencing. The slabs come in pieces\nthat are 5-ft. long.\n Keith knows that √2000 is between 40 and 50. Trying to save as much money as possible, he\nestimates on the low side and concludes that they will need 160 feet of fencing. Therefore, he\nconcludes they should purchase 32 slabs of the material.\n Jose also knows that √2000 is between 40 and 50 but he is afraid that using Keith’s calculations,\nthey will not have enough fencing. He suggests that they should estimate on the high side and\nbuy 200 feet of fencing to be safe. Therefore, he concludes they should purchase 40 slabs of\nmaterial.\nKeith and Jose begin to argue. Sam jumps in and says, “I have a way to make you both happy – we will\npurchase enough material to enclose the entire field and we will minimize the amount of waste.” What\ndo you think Sam’s suggestion is and how many slabs will be purchased using Sam’s rationale?\nThe idea here is – can we do better than the approximations made by Keith and Jose? Encourage students to try\nto get a better approximation for √2000. One possible answer is 45 – this will ensure there is enough material.\nThat would mean that they would need 180 feet of fencing and therefore 36 slabs of material. Discuss why it\ndoes not really make sense to try to zoom in on the approximation to the nearest tenth that will provide enough\nmaterial – 44.8. The slabs are sold in 5-ft increments so it would not make sense to approximate further than the\nnearest whole number in this case.\nDiscuss other circumstances that require calculations with irrational numbers and what level of accuracy is\ndesired in different circumstances.\n8WB7 - 66 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3d Homework: Approximating the Value of Irrational Numbers\n1. Between which two integers does √2 lie?\n1 and 2\na. Which integer is it closest to? 1\nb. Show its approximate location on the number line below.\nc. Now find √2 accurate to one decimal place. Show its approximate location on the number line\nbelow. Between 1.4 and 1.5\nd. Now find √2 accurate to two decimal places. Show its approximate location on the number line\nbelow. Between 1.41 and 1.42\ne. Estimate the value of the expression 2+√2 to the nearest whole number. To the nearest tenth.\nTo the nearest hundredth.\n2+√2 is between 3 and 4 (When going over homework, show students that you can trace the\nsegment √2, pick the segment up, and shift its left endpoint to 2 to estimate the value of this\nexpression.)\n2+√2 is between 3.4 and 3.5\n2+√2 is between 3.41 and 3.42\nf. Estimate the value of the expression 2√2 to the nearest whole number. To the nearest tenth. To\nthe nearest hundredth.\n2√2 is between 2 and 4 (Show students that you can trace the segment and double its length to\nestimate the value of this expression.)\n2√2 is between 2.8 and 3\n2√2 is between 2.82 and 2.84\n8WB7 - 67 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 2. Between which two integers does √40 lie?\na. Which integer is it closest to?\nb. Show its approximate location on the number line below.\nc. Now find √40 accurate to one decimal place. Show its approximate location on the number line\nbelow.\nd. Now find √40 accurate to two decimal places. Show its approximate location on the number line\nbelow.\ne. Estimate the value of the expression 2√40 to the nearest whole number. To the nearest tenth. To\nthe nearest hundredth.\n8WB7 - 68 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 3. Repeat the process above to find √60 accurate to two decimal places. Place your numbers on the\nnumber lines provided each time you increase the degree of accuracy of your estimate.\na. To the nearest whole number:\nb. To the nearest tenth:\nc. To the nearest hundredth:\nd. Use your work from above to approximate the value of √60−5 to the nearest whole number.\nTo the nearest tenth. To the nearest hundredth.\ne. Use your work from above to approximate the value of 1+√60 to the nearest whole number. To\nthe nearest tenth. To the nearest hundredth.\n8WB7 - 69 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 4. Use the approximations of π on page 60 to estimate the value of the following expressions to increasing\nlevels of accuracy. You can use your calculator but don’t use the square key or the π key.\na. 𝜋2\nBetween 9 and 16\nBetween 9.61 and 10.24\nBetween 9.8596 and 9.9225\nb. 10𝜋\nc. 3+𝜋\n8WB7 - 70 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3e Class Activity: Comparing and Ordering Real Numbers\nThese problems may be difficult for students. It is recommended that you do a few as a class to give students\nstrategies for ordering the numbers (i.e. starting by ordering the ones that are easy first and then fitting in the\nmore difficult numbers). Help them to understand how the calculations and estimations can help them. Help\nthem to see how we can view the whole numbers as perfect squares (i.e. in problem 1, we know that 8 and\n√64 are equivalent so we know that √62 is smaller than 8 because √62 < √64.\nDirections: Do not use a calculator for the following problems. Any calculations you may need are given in the\nproblem.\n1. Order the following numbers from least to greatest. Note that 8.52 = 72.25.\n√80,8,9,8.5,√62\n√62,8,8.5,√80,9\n2. Order the following numbers from least to greatest. Note that 3.52 = 12.25.\n−√13,−3,−4,−3.5\nIt may be helpful in this\nproblem to think of −3.5\n−4,−√13,−3.5,−3\nas −√12.25.\n3. Use the following calculations to answer the questions below.\n2.22 = 4.84\n2.32 = 5.29\n2.232 = 4.9729\n2.242 = 5.0176\na. Put the following numbers in order from least to greatest.\n5\n√5, ,2.2, the side length of a square with an area of 4\n2\n5\n2,2.2,√5,\n2\nb. Find a number between 2.2 and √5. Many possibilities, 2.21, 2.22\nc. Find an irrational number that is smaller than all of the numbers in part a. Many possibilities, √2,\n√3,−√5\n4. Use the following calculations to answer the questions below.\n6.482 = 41.9904\n6.52 = 42.25\na. Order the following numbers from least to greatest.\n√50,6,7,6.5,√42\n6,√42,6.5,7,√50\nb. Find a rational number that is smaller than all of the numbers in part a.\nc. Find an irrational number that is smaller than all of the numbers in part a.\nd. Find a number between √42 and 6.5.\n8WB7 - 71 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 5. Use the following calculations to answer the questions below.\n2.442 = 5.9536\n2.452 = 6.0025\n2.4492 = 5.997601\na. Order the following numbers from least to greatest.\n√6,2.44,2.4̅,2.5, the side length of a square with an area of 9\nb. Find an irrational number that is between 0 and the smallest number from part a.\nc. Find a number that is between 2.44 and √6.\n6. Use the approximations of π on page 60 and the calculations given below to answer the questions below.\nπ is between 3 and 4\nπ is between 3.1 and 3.2\nπ is between 3.14 and 3.15\nπ is between 3.141 and 3.142\n3.152 = 9.9225\na. Find a number that is between 3 and 𝜋. Many possibilities, 3.12, 3.01\nb. Find a number that is between 3.14 and 𝜋. Many possibilities, 3.1401\nc. Which is larger and why? (𝜋+5) or 8 Since we know that π is a little more than 3, (𝜋+5) is\ngreater than 8\nd. Which is larger and why? (10−𝜋) or 7 Again, since we know that π is a little more than 3,\n10−𝜋 is going to be smaller than 7\ne. Which is larger and why? 2𝜋 or 6.2 2π\nf. Which is larger and why? 𝜋2 or 10 10, we can see from the calculations that 3.152 is 9.9225.\nSince π is < 3.15, 𝜋2 is < 10.\n8WB7 - 72 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3e Homework: Comparing and Ordering Real Numbers\nDirections: Do not use a calculator for the following problems. Any calculations you may need are given in the\nproblem.\n1. Give an example of a rational number between √9 and √16.\n2. Give an example of an irrational number between 8 and 9. Many answers. It may help to think of 8 as\n√64 and to think of 9 as √81. Possible answers are √65 or √70. Using a calculator, find the decimal\napproximation of your number and verify that it is between 8 and 9.\n3. Use the following calculations to answer the questions below.\n1.412 = 1.9881 Think about this, if 1.412 is smaller than 2 then 1.41 is less than √2.\n1.422 = 2.0164 If 1.422 is larger than 2 then 1.42 is greater than √2. What does this tell you\nabout 1.42̅?\na. Order the following numbers from least to greatest.\n1\n√2,1.41,1.4,1 ,1.42̅\n2\n1\nb. Find a number between 1.4 and 1 .\n2\n4. Use the following approximations and calculations to answer the questions below.\nπ is between 3.14 and 3.15\n3.12 = 9.61\n3.22 = 10.24\n3.162 = 9.9856\n3.172 = 10.0489\na. Order the following numbers from least to greatest.\n√10,3 1 ,3.1̅,𝜋, side length of a square with an area of 9\n10\nb. Find a number between 3 1 and 3.1̅.\n10\nc. Find a number between 3.1 and √10.\n8WB7 - 73 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 5. The number e is an important irrational number. In future math classes as well as science and social\nscience, you will see and use this number quite a bit. Use the approximations of e and the calculations\ngiven below to answer the questions that follow.\ne is between 2 and 3\ne is between 2.7 and 2.8\ne is between 2.71 and 2.72\ne is between 2.718 and 2.719\na. Find a number that is between 2 and e. From the data given above, you know that e is greater\nthan 2.7; therefore any number between 2 and 2.7 will work. One example is 2.1. There are\ninfinite answers that will work.\nb. Find a number that is between e and 2.8.\nc. Which is larger and why? (𝑒+10) or 13 13 We know that e is less than 2.8 so we know that\nadding 10 to e will be less than 13\nd. Which is larger and why? (6−𝑒) or 4\ne. Which is larger and why? 2𝑒 or 5.4\nf. Which is larger and why? 𝑒2 or 9\n6. Order the following numbers from least to greatest. Note that 6.22 = 38.44 and 6.42 = 40.96\n1\n−√40,−7,−6,−6.2,−6.4,−6\n2\n1\n−7,−6 ,−6.4,−√40,−6.2,−6\n2\n8WB7 - 74 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 7.3f Self-Assessment: Section 7.3\nConsider the following skills/concepts. Rate your comfort level with each skill/concept by checking the box that\nbest describes your progress in mastering each skill/concept. Sample problems for each standard can be found\non the following page(s).\nSkill/Concept Minimal Partial Understanding Sufficient Substantial Mastery\nUnderstanding 2 Mastery 4\n1 3\n1. Know that real\nnumbers that are not\nrational are\nirrational.\n2. Show that rational\nnumbers have\ndecimal expansions\nthat either terminate\nor repeat.\n3. Convert a repeating\ndecimal into a\nfraction.\n4. Know that the\nsquare root of a non-\nperfect square is an\nirrational number.\n5. Understand that the\ndecimal expansions\nof irrational\nnumbers are\napproximations.\n6. Show the location\n(or approximate\nlocation) of real\nnumbers on the real\nnumber line.\n7. Approximate the\nvalue of irrational\nnumbers, zooming\nin to get better and\nbetter\napproximations.\n8. Estimate the value\nof expressions\ncontaining irrational\nnumbers.\n9. Compare and order\nrational and\nirrational numbers.\n8WB7 - 75 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 1. Circle the numbers that are rational.\na. −4 e. 1\n2\nb. −0.34\nf. −√11\nc. √7\ng. √81\nd. 0\nh. −3 √27\n2. Change each fraction to a decimal.\n3\na.\n4\n5\nb.\n6\n8\nc.\n3\n3. Change each decimal to a fraction.\na. 0.2̅\nb. 1.3̅̅̅4̅\nc. 2.01̅\n4. Classify the following numbers as rational or irrational and provide a justification.\na. √10\nb. 3 √30\nc. √144\n8WB7 - 76 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 5. Find the decimal approximation of the following numbers to two decimal places without using the square\nroot key on your calculator.\na. √22\nb. √45\nc. √60\n6. Describe how you would plot the following points on the number line shown below.\n2.0, 2.2, 2.24.\nPlot the numbers from above on the three number lines shown below, changing the scale of each number\nline in order to show the location of the points more precisely.\n7. Show the approximate location of the following numbers on the number line below.\n1\n𝐴: √3,𝐵: √10,𝐶:2√5,𝐷:3 ,𝐸:1.5\n10\n8WB7 - 77 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by. 8. Approximate √31 to the…\na. Nearest whole number\nb. Nearest tenth\nc. Nearest hundredth\n9. Approximate the value of the following expressions.\na. 2√2 if √2 ≈ 1.41\nb. 3𝜋 if 𝜋 ≈ 3.14\nc. 4+√2 if √2 ≈ 1.41\n10. Order the following numbers from least to greatest.\n1 4\n1.2,−2𝜋,−3 ,√6, ,−6.28,−√2\n2 3\n8WB7 - 78 2014 University of Utah Middle School Math Project in partnership with the\nUtah State Office of Education. Licensed under Creative Commons, cc-by."
}