{
    "text": "See discussions, stats, and author profiles for this publication at: https://www.researchgate.net/publication/313678763\nEXACT DEFINITION OF MATHEMATICS\nArticle · February 2017\nCITATIONS READS\n24 133,796\n1 author:\nDharmendra Kumar Yadav\nLalit Narayan Mithila University, Darbhanga, Bihar, India\n28 PUBLICATIONS 43 CITATIONS\nSEE PROFILE\nSome of the authors of this publication are also working on these related projects:\nMathematics-what-how View project\nMulti-dimensional Sequence and Series View project\nAll content following this page was uploaded by Dharmendra Kumar Yadav on 17 April 2017.\nThe user has requested enhancement of the downloaded file. International Research Journal of Mathematics, Engineering and IT\nVol. 4, Issue 1, January 2017 Impact Factor- 5.489\nISSN: (2349-0322)\n© Associated Asia Research Foundation (AARF)\nWebsite: www.aarf.asia Email : editor@aarf.asia , editoraarf@gmail.com\nEXACT DEFINITION OF MATHEMATICS\nDharmendra Kumar Yadav\nAssistant Professor, Department of Mathematics\nShivaji College, University of Delhi, Raja Garden, Delhi-27\nABSTRACT\nThe aim of the article is to propound a simplest and exact definition of mathematics in a single\nsentence. It is observed that all mathematical and non-mathematical subjects whether science,\narts, language or commerce, follow the same steps and roots to develop, they all consist of three\nparts: assumptions, properties and applications. These three terms make the exact definition of\nMathematics, which can be applied to all subjects also. Therefore all subjects can be brought\nunder the same umbrella of definition consisting of these three terms. Following this\nmathematics has been defined as the study of assumptions, its properties and applications. Then\ndifferent branches of mathematics have been discussed. A short paragraph has been devoted to\ntechnical teachers and students on engineering mathematics. In last how should we teach\nmathematics has been emphasized? A special focus on the type of assignment has been\nmentioned. This article will be useful for mathematics teachers and its learners, if it is discussed\nin the first few lectures of undergraduate and post graduate level as well as will be more fruitful\nfor technical students as they can understand and apply it better than non-technical students.\nKey Words: Axiom, Theorem, Properties, Conjecture.\nAMS Subject Classification: 97D30, 00A05, 00A06, 03E65, 01A80, 97D20\nIntroduction\nCarl Friedrich Gauss referred mathematics as the queen of science but unfortunately students\nfear from this queen, although the subject is very essential to the growth of many other\ndisciplines. The science of mathematics depends on the mental ability. It is the means to develop\nthe thinking power and reasoning intelligence, which sharps the mind and makes it creative. The\ndevelopment of human beings and their culture depend on the development of mathematics. This\nis why, it is known as the base of human civilization. It is also the language of all material\nscience and the centre of all engineering branches which revolve around it. Therefore it is the\npast, present and future of all sciences. Narlikar has focused on the importance of mathematics\nby mentioning that in 1957 when the Soviet Union launched the first satellite Sputnik, the United\nStates realized that to match it, the teaching of mathematics had to receive boost. After that many\nmajor steps have been taken to improve the quality education of mathematics not only in USA\nbut in the world too.\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n34 | P age Previous Attempt to Define Mathematics\nAlthough the research in mathematics has covered a milestone, a major drawback has been seen\nin the literature of mathematics that it could not be defined properly, so that all mathematical\nsubjects can be combined in short and in a single sentence. No consensus on the definition of\nmathematics prevails, even among professionals. According to Wikipedia, mathematics has no\ngenerally accepted definition and there is not even consensus on whether mathematics is an art\nor science. Gunter M. Ziegler mentions that in German Wikipedia the definition is interesting in\na different way: it stresses that there is no definition of mathematics, or at least no commonly\naccepted one. Even the famous book by Richard Courant and Herbert Robbins entitled “What\nis Mathematics?” (and subtitled “An Elementary Approach to Ideas and Methods”) does not give\na satisfactory answer. He claims that it is impossible to give a good definition in a sentence or\ntwo. A great many professional mathematicians take no interest in a definition of mathematics, or\nconsider it undefinable.\nTraditionally it is defined as the scientific study of quantities, including their relationship,\noperations and measurements expressed by numbers and symbols. In mathematics dictionary by\nJames & James it has been defined as the science of logical study of numbers, shape,\narrangement, quantity, measure and many related concepts. Today it is usually described as a\nscience that investigates abstract structures that it created itself for their properties and patterns”.\nAccording to Wikipedia, „Mathematics is the study of quantity, structure, space. Mathematics\nseeks out patterns and uses them to formulate new conjectures. Aristotle has defined\nmathematics as „The science of quantity?‟. Benjamin Pierce defined it as „Mathematics is the\nscience that draws necessary conclusions‟. Haskell Curry defined mathematics simply as “the\nscience of formal systems”. Albert Einstein stated that “as far as the laws of mathematics refer to\nreality, they are not certain; and as far as they are certain, they do not refer to reality”. More\nrecently, Marcus du Sautoy has called mathematics “the Queen of Science …… the main\ndriving force behind scientific discovery”. Thus although all most all great mathematicians stated\nsomething for it, no generally accepted definition could be produced. A little attempt has been\ndone in this article to define mathematics in a single sentence and exact form, which will be\naccepted for centuries without any counter example.\nBasic Terms of Mathematics\nIn every mathematical subject we find some general terms like axioms, properties, theorem, etc.\nThese are the basics of the subjects whose meanings are given as follows:\nAxioms: James & James stated that the axioms of a subject are the basic propositions from\nwhich all other propositions can be derived. They are accepted as the starting points and are\naccepted true without any proof. With the help of axioms we decide whether a given\nmathematical statement is true or false. It is also known as assumptions or hypothesis or\npostulates or propositions.\nTherefore mathematics can be regarded as a set and study of assumptions, because it starts with\naxiom. But it ends with reality. Here the statement „end with reality‟ means although we start\nwith assumptions, but after its application and in the final result, we reach at the real destination.\nExample: One right angle is equal to 900 is an assumption. It has no proof. Although now there\nare many properties from which it can be proved, but the property from which it will be proved,\nwill also be an assumption.\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n35 | P age Property: Any mathematical statement derived using axioms is known as a property. A straight\nangle is equal to 1800 is a property, which is proved as the sum of two right angles. It can be\nfurther divided in two parts: Theorem and Conjecture.\nTheorem: A general conclusion which can be proved by the help of axioms is called a theorem.\nIn general it is proved logically using assumptions as true.\nExample: The sum of the three angles of a triangle is 1800 is a theorem.\nConjecture: A mathematical statement which has many examples but cannot be proved or yet to\nbe proved is known as conjecture. A well known conjecture is Goldbach’s Conjecture which\nstates that „Every even integer greater than 4 can be written as sum of two odd primes‟. So far\neither a proof or a counter example has not been found.\nApplications: If we apply the assumptions and its properties to solve real life problems, we say\nthat such type of assumptions have applications.\nExample: The sum of the three angles of a triangle is 1800 is an application of the assumption\nthat one right angle is 900 and a straight angle is 1800.\nThus we see that in mathematical subject we have three main terms: assumptions, properties and\napplications. So we can say that every mathematical subject is composed of three terms:\nassumptions, properties and applications. Thus we can define ‘Mathematics is the study of\nassumptions, its related properties and applications‟. In fact every subject is the set of\nassumptions, its properties and applications as has been explained in the analysis below:\nAnalysis of Some Properties\nAnalysis 1: We remember that the sum of the three angles of a triangle is 1800 as shown in fig.-\n1. Fig.-5 shows that one right angle is equal to 900. Fig.-3 and Fig.-4 show that two right angles\nmake one straight angle which is equal to 1800. Fig.-2 shows that the sum of three angles of a\ntriangle is equal to 1800, which is generally derived from the fact that when three angles <A, <B\nand <C are placed on a straight line with their vertices coinciding at one point, makes a straight\nangle which is equal to 1800.\nA\n<A+<B+<C=1800\nB C A B C 1800\nFig.-1 Fig.-2 F ig.-3\n900 900\n900\nFig.-4 Fig.-5\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n36 | P age We know that in geometry angles are measured in terms of right angle. In British System, a\nright angle is divided into 90 equal parts called Degrees, so a right angle makes 900. In French\nSystem, a right angle is divided into 100 equal parts called Grades, so a right angle makes 100g.\n\nWhereas in Circular Measure, a right angle is equal to . Thus the sum of the three angles of\n2\na triangle is 1800 in British system, 200g in French system and 𝜋 radian in Circular measure\nsystem.\nTherefore we first supposed that a right angle is equal to 900. Then we developed the definition\nof a linear pair of angles, for it the sum of two angles is 1800 and then developed a property that\na straight angle is equal to 1800. By the help of this property, we proved that the sum of the three\nangles of a triangle is 1800. What we followed here is that, first we assumed, then developed a\nproperty and finally applied it.\nAnalysis 2: A spherical balloon is pumped at the rate of 10 cubic inches per minute, find the rate\nof increase of its radius when its radius is 15 inches.\ndy\nLet y be the volume and x the radius of the balloon at any time t. Then 10 cubic inches per\ndt\ndx 4\nminute and we have to find when x=15 inches. Since the balloon is spherical, y  r3.\ndt 3\ndy\ndy dx dx dt 10 10 1\n4x2     \ndt dt dt 4x2 4x2 4152 90\n1\nHence rate of increase of the radius when radius is 15 inches is inch/minute. For the\n90\nfunction y=f(x), the differential coefficient of y with respect to x has been denoted and defined\nby\ndy lim f(xx) f(x)\n\ndx x0 x\nprovided that the limit exists. It has been called the measurement of rate of change in y with\ndy\nrespect to x. After that the derivative of y  xn is nxn1, was found with many other\ndx\nelementary functions. Then it was applied in many such problems as discussed above. So it also\nfollowed the three main steps: assumption, properties and applications. Similarly many more\nexamples in mathematics can be analyzed.\nAnalysis 3: Let us consider the shadow formation on a screen by a point source of light. A\nsource of light at S falls on the opaque body AB and makes a shadow A‟B‟ on the screen.\nLet us consider the following:\nd : diameter of the shadow;\nsh\nd : diameter of the body\nb\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n37 | P age S: source of light;\nAB: Opaque Body;\nA‟B‟: shadow of the body on screen\nl : distance between source & opaque body;\nb\nl : distance between opaque body & screen.\nsh\nThe distances between different objects have been indicated in the following figure:\nOpaque Body Screen\nA’ A’\nA\nd d\nb\nd\nSource S C’ d s h d\nsh\nC\nl B B’\nb\nB’\nl\nsh\nNow since triangles SAB and SA‟B‟ are similar, we have\nSC AB l d  l \n  b  b d d 1 sh \nSC' A'B' l l d sh b  l  \nb sh sh b\nFrom this we conclude that the size of the shadow is always greater than the size of the opaque\nbody or object. It will be equal to the size of the object if the screen is in contact with the opaque\nbody. As the screen is moved away from the opaque body the shadow size increases. To find the\nsize of the shadow we used the concepts of similar triangles, which is itself an assumption and its\nproperties.\nAnalysis 4: In language we first learn its alphabets, then words formed using alphabets and\nfinally we make sentences using many words. For example, in English language, we first study\nfrom A to Z. Then we study words like Ram, Eat, Apple, etc having special meanings followed\nby grammar as properties. Finally we make sentence Ram eats an apple. So every language\nfollows the three steps of development: assumption, properties and application. In English 26\nalphabets are assumption, words and grammar are both assumptions and properties, where as a\ncomplete sentence is the application.\nThe same procedures follow in other languages like Hindi, Urdu, Sanskrit, etc. Similarly in\nCommerce, we assume the definitions of GDP, NDP, Income, Development, Growth, etc. and\nthen apply it to study about the status of the society or nations.\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n38 | P age From above examples, analysis and the basic terms of mathematical subjects, we can define\nmathematics in the shortest and compact form as „Mathematics is the study of assumptions, its\nproperties and applications‟, which can be taken as the exact definition of mathematics. In fact\n„all mathematical and non-mathematical subjects are the set and study of assumptions, its\nproperties and applications‟, whether it is science, arts, commerce, literature, etc.\nBranches of Mathematics\nAs far as the branch of mathematics is concerned, it is divided into four fields: Arithmetic,\nAlgebra, Analysis and Geometry. In arithmetic we learn about numbers and basic arithmetical\noperations. When we apply arithmetic in solving real life problems, we get equations and thus\nlead to Algebra. When the basic properties of arithmetic and algebra fail, we need analysis. In\nanalysis we generally study about limits, continuity, etc.\nIn Geometry we study about shapes and size of the figures. It is divided into two parts: Plane (or\nEuclidean) Geometry and Spherical (or Non-Euclidean) Geometry. Spherical geometry is\nfurther divided into two parts: Elliptical (or Riemann) Geometry and Non-elliptical (or\nHyperbolic) Geometry.\nThe basic difference among the above is that, in plane geometry, the sum of the three angles of a\ntriangle if 1800 where as in spherical geometry it is not equal to 1800, but either greater than or\nless than of it. In elliptical geometry it is more than 1800 but in hyperbolic geometry it is less\nthan 1800.\nThe shapes of a triangle in above three geometries are as follows:\nSimilarly other properties and figures can be studied in three geometries.\nPure and Applied Mathematics\nFor the sake of simplicity, mathematics is divided into two branches: Pure and Applied\nMathematics.\nPure Mathematics is concerned with increasing knowledge of the subject rather than using\nknowledge in practical ways, i.e. its study is theoretical. For example, trigonometry, geometry,\nset theory, vector, etc. It is concerned with concepts and ideas that do not necessarily have any\nimmediate practical application. Its importance can be better understood by the well known\nstatement “A pure mathematician makes dreams even beyond the imagination of human\nbeings, and it is the scientists and technologists to apply them.”\nApplied Mathematics is concerned with using knowledge of pure mathematics. It is not\ntheoretical but practical. In it we use the theories and concepts of pure mathematics. For\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n39 | P age example, mechanics, dynamics, statics, physics, etc. It is concerned with the use of mathematical\ntheories and principles as tools to solve problems in any field, whether it is research or problems\nin actuarial science, economics, financial analysis, market research analysis, meteorology,\noceanography, aviation, aerodynamics, robotics, population studies, commercial surveys,\nphysics, chemistry, biology, social sciences, earth sciences, industrial research and development.\nThe study of problems in applied mathematics leads to new developments in pure mathematics\nand theories developed in pure mathematics often find applications later. Work in applied\nmathematics requires a theoretical background, which enables the mathematician to understand\nthe physical dimensions and technicalities of the problem. The study of pure and applied\nmathematics is interdependent. Applied mathematics is like a flowing river having pure\nmathematics on its two banks playing like domain on the boundaries. The two branches are so\ninterrelated and mixed that no sharp (or dividing) line can be drawn between them.\nEngineering Mathematics\nIt is a part of applied mathematics. Kreyszig has mentioned that for the sake of deciding the\ndepth of studying mathematics, while teaching mathematics to the engineering students, we\nshould limit our knowledge of mathematics to the extent as far as the applications of the subject\nare concerned. Technical students need solid knowledge of basic principles, methods, and\nresults, and a clear perception of what engineering mathematics is all about, in all three phases of\nsolving problems related to real and physical world: Modeling, Solving and Interpreting.\nHow To Teach Mathematics?\nRonning has pointed out that mathematics is becoming more and more important in study. More\nand more decisions are made and actions are being taken on the basis of mathematical models.\nSo the problem arises that, what should we emphasize when we teach mathematics? What kind\nof understanding do we want the students to develop? What kind of mathematics, and how much,\ndo all students need to know?\nA simple answer of the question is that every chapter must be divided into three parts:\nassumptions, properties and applications. When we start teaching, we must mention that what are\nthe basic assumptions in the chapter keeping in view that definition of a term is itself an\nassumption. What can we obtain from the assumptions and in last how and where can we apply\nthese concepts? Even students may be allowed to remember the definition as their own\nassumptions and then try to find out some properties related to them and the previous\nmathematical or non-mathematical knowledge they have. In this way the learner will enjoy the\nsubject and they will improve their ability of mathematical power.\nAs far as the engineering mathematics is concerned, Kreyszig states that it would make no sense\nto overload students with all kinds of little things that might be of occasional use. Instead it is\nimportant that students become familiar with ways to think mathematically, recognize the need\nfor applying mathematical methods to engineering problems, realize that mathematics is a\nsystematic science built on relatively few basic concepts and involving powerful unifying\nprinciples, and get a firm grasp for the interrelation between theory, computing and experiment.\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n40 | P age What should be the Format of Assignment?\nAssignments play an important role in learning. In general it has been found that the teacher\ngives some examples as assignments to solve. In this manner students generally do not care\nabout basic assumptions. They apply formula blindly and miss the basic concepts. They miss the\ngame of enjoyment that how properties are developed using assumptions, which finally fails our\naim of increasing mathematical ability in students. In fact the proper format of assignments must\nfollow the three main terms of the subject: assumption, properties and applications.\nIn other words, students must be directed to do assignment in three steps: first they must define\nthe basic terms of the chapter followed by the properties with proof. They must make a table of\nthe formulae and then solve at least five examples on each formulae or properties. In this way\nstudents learn the definition, formulae and understand the basic structure of the chapter, which\nmakes them perfect in application. Thus our motives become more and more successful in\nincreasing the interest of mathematics among students.\nConclusion:\nFinally we conclude the exact definition of mathematics as the study of assumptions, its\nproperties and applications. In teaching we must maintain the order of assumptions, properties,\nand applications. This order must be maintained in assignments to get the desired aim of teaching\nmathematics. Similarly all non-mathematical subjects can be defined as the set of assumptions,\nits properties and applications.\nAcknowledgement\nAuthor acknowledges that the example on the size of the shadow has been taken from a lecture\ndelivered by Late Dr. P. Singh, Professor of Physics, BIT, Patna and the figure of triangles in\nthree geometries has been copied from Google. Some of the definitions have also been taken\ndirectly from the sources mentioned in references.\nReferences\n Boaler J., The elephant in the Classroom: Helping Children Learn & Love Maths,\nChapter-1, Souvenir Press, 2008\n Burton D. M., Elementary Number Theory, 7th Indian Edition, McGraw Hill Education\n(India) Pvt Ltd, New Delhi, 2012, pp. 50-53\n Courant R., Robbins H., What is Mathematics? An elementary approach to Ideas and\nMethods, 2nd Edition, Oxford University Press, New York, 1996\n Gakkhad S. C., Teaching of Mathematic, N. M. Prakashan, Chandigarh, 1991\n James & James, Mathematics Dictionary, 4th Edition, CBS Publishers & Distributors,\nIndia, 2001, pp.23, 169-170, 239, 387\n Kennedy L. M. & Tipps S., Guiding Children‟s Learning of Mathematics, 8th Edition,\nWadsworth Publishing Company An International Thomson Publishing Company, 1997\n Kreyszig E., Advanced Engineering Mathematics, 8th Edition, John Wiley & Sons, 2005\n Loney S. L., Plane Trigonometry, Part-I, Metric Edition, A. K. Publications, Agra, 1990,\npp. 1-17\n Narlikar J. V., Mathematics: The Queen of Sciences, Education Article, Manorama Year\nBook 2013, pp. 480-484\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n41 | P age  Nelson D., The Penguin Dictionary of Mathematics, Penguin Books, 3rd Edition, 2003,\npp. 21, 78, 147, 185-186, 271, 399\n Ronning F., Developing Knowledge in Mathematics by Generalising and Abstracting,\nMathematics Newsletter, Ramanujan Mathematical Society, Vol.17 (4), March 2008,\npp.109-118\n Schleicher D. & Lackmann M., An Invitation to Mathematics From Competition to\nResearch (Preface: What is Mathematics? by Gunter M. Ziegler), Springer, XIV, pp.220,\n2011\n Sinha K. C., A Text Book of Calculus, Students‟ Friends, Patna, 1994, pp. 236-237\n Vygodsky M., Mathematical Handbook: Elementary Mathematics, MIR Publishers,\nMoscow, 1987\n Ziegler G. M. & Loos A., Teaching and Learning “What is Mathematics”,\nwww.google.com\n https://en.wikipedia.org/wiki/Hyperbolic_geometry\n https://en.wikipedia.org/wiki/Elliptic_geometry\n https://en.wikipedia.org/wiki/Definitions_of_mathematics\nA Monthly Double-Blind Peer Reviewed Refereed Open Access International e-Journal - Included in the International Serial Directories.\nInternational Research Journal of Mathematics, Engineering and IT (IRJMEIT)\n42 | P age\nView publication stats"
}