{
    "text": "MT HOOD COMMUNITY COLLEGE BIOLOGY 102  MT HOOD COMMUNITY COLLEGE\nBIOLOGY 102\nGENERAL BIOLOGY II: SURVEY OF MOLECULAR\nLIFE AND GENETICS\nCHRISTINE ANDERSON AND LISA BARTEE\nOpen Oregon Educational Resources Mt Hood Community College Biology 102 by Lisa Bartee and Christine Anderson is licensed under a Creative Commons Attribution\n4.0 International License, except where otherwise noted. Contents\nReference Information\nThe Process of Science\n3. Biological Molecules\n4. Structure of DNA\n5. DNA Replication\n6. Protein Synthesis\n6.1 What are proteins and what do they do? 13\n6.2 What is a gene? 15\n6.3 How do genes direct the production of proteins? 17\n6.4 Transcription: from DNA to mRNA 19\n6.5 Eukaryotic RNA Processing 21\n6.6 Translation 23\n6.7 The Genetic Code 25\nOptional Section - Micropigs 27\n7. Mutations\nHow Gene Mutations Occur 31\nIntro to Genetic Disorders 35\nDo all gene affect health and development? 37\nTypes of Mutations 39\nChanges in Numbers of Genes 41\nChanges in Chromosome Number 43\nComplex Multifactorial Disorders 45\nGenetic Predispositions 47\nGenetics and Statistics 49\nGene Regulation\n8.1 Prokaryotic versus Eukaryotic Gene Expression 53\n8.2 What is the epigenome? 55\n8.3 Alternative RNA splicing 57\nv 9. Biotechnology\n9.1 Manipulating Genetic Material 61\n9.2 Cloning 65\n9.3 Genetic Engineering 69\n9.4 Biotechnology in Medicine and Agriculture 71\n9.5 Genomics and Proteomics 75\n9.6 Applying Genomics 79\n9.7 Proteomics 83\n10. Cell Division - Binary Fission and Mitosis\n10.1 Prokaryotic Cell Division 87\n10.2 Eukaryotic Cell Division 89\n10.3 Control of the Cell Cycle 93\n10.4 Cancer and the Cell Cycle 95\n11. Meiosis\n11.1 Sexual Reproduction 99\n11.2 Overview of Meiosis 101\n11.3 Interphase 105\n11.4 Meiosis I 107\n11.5 Meiosis II 109\n11.6 Comparing Meiosis and Mitosis 111\n11.7 Errors in Meiosis 113\n12. Patterns of Inheritance\n12.1 Mendelian Genetics 121\n12.2 Garden Pea Characteristics Revealed the Basics of Heredity 127\n12.3 Phenotypes and Genotypes 131\n12.4 Monohybrid Cross and the Punnett Square 135\n12.5 Laws of Inheritance 139\n12.6 Extensions of the Laws of Inheritance 145\n12.7 Multiple Alleles 149\n12.8 Sex-Linked Traits 153\n12.9 Linked Genes Violate the Law of Independent Assortment 157\n12.10 Epistasis 161\nGenetics: Dog Coat Color\nIntroduction to Genetics 167\nPedigrees and Punnett Squares 169\nBlack fur color: a dominant trait 173\nYellow fur color: a recessive trait 179\nEpistasis: the relationship between black, brown, and yellow fur 183\nBrindle color: partial dominance and epistasis 185\nIncomplete dominance: when traits blend 187\nWhite spotting: When there's more than two alleles 191\nHemophilia: a sex-linked disorder 193\nOverall phenotypes: putting it all together 197\nvi Additional complexity 201\nIt's not all in the genes 203\nvii  Reference Information\nThe resources provided in this section will enable you to:\nLearning Objectives\n• Select, evaluate and utilize discipline-specific information and literature to research a biological topic.\nDifferentiate between questions that can and cannot be answered using science.\nIdentify appropriate credible sources of information to research a topic.\nEvaluate sources of information for their strengths and weaknesses.\n• Communicate information using appropriate biological terminology in multiple formats.\nUse an appropriate written format to present scientific information.\n• Use evidence to develop informed opinions on contemporary biological issues while considering\ncultural and ethical implications.\nResearch current ethical issues in genetics and biotechnology.\nForm opinions based on published scientific research.  The Process of Science\nLearning Objectives\nCourse Objective for this section: Understand the process of scientific inquiry in order to apply the scientific\nmethod to biological questions by designing experiments and using the resulting data to form a conclusion\n• Design a controlled experiment to answer a biological question.\n• Predict the outcome of an experiment.\n• Collect, manipulate, and analyze quantitative and qualitative data\n• Answer a biological question using data.\nLike geology, physics, and chemistry, biology is a science that gathers knowledge about the natural world. Specifically,\nbiology is the study of life. The discoveries of biology are made by a community of researchers who work individually\nand together using agreed-on methods. In this sense, biology, like all sciences is a social enterprise like politics or the arts.\nThe methods of science include careful observation, record keeping, logical and mathematical reasoning, experimentation,\nand submitting conclusions to the scrutiny of others. Science also requires considerable imagination and creativity; a\nwell-designed experiment is commonly described as elegant, or beautiful. Like politics, science has considerable practical\nimplications and some science is dedicated to practical applications, such as the prevention of disease (see Figure 1.1). Other\nscience proceeds largely motivated by curiosity. Whatever its goal, there is no doubt that science, including biology, has\ntransformed human existence and will continue to do so.\nFigure 1.1 Biologists may choose to study Escherichia coli (E.\ncoli), a bacterium that is a normal resident of our digestive tracts\nbut which is also sometimes responsible for disease outbreaks. In\nthis micrograph, the bacterium is visualized using a scanning\nelectron microscope and digital colorization. (credit: Eric Erbe;\ndigital colorization by Christopher Pooley, USDA-ARS)\nReferences\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:RD6ERYiU@5/The-\nProcess-of-Science.  3. Biological Molecules\nThe large molecules necessary for life that are built from smaller organic molecules are called biological macromolecules.\nThere are four major classes of biological macromolecules (carbohydrates, lipids, proteins, and nucleic acids), and each is an\nimportant component of the cell and performs a wide array of functions. Combined, these molecules make up the majority\nof a cell’s mass. Biological macromolecules are organic, meaning that they contain carbon atoms. In addition, they may\ncontain atoms of hydrogen, oxygen, nitrogen, phosphorus, sulfur, and additional minor elements.\nFFiigguurree 11:: The structure of a macromolecule can be compared to a\nnecklace: both are larger structures that are built out of small\npieces connected together into a chain. (“Beads on a string” by\nDaniel is licensed under CC BY-NC-ND 2.0)\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:QhGQhr4x@6/\nBiological-Molecules  4. Structure of DNA\nLearning Objectives\nBy the end of this section, you will begin to: Discuss and apply biological theories and concepts of the molecular\nand genetic of life, including cell division, inheritance, and gene regulation by showing that you can:\n• Describe the structure of DNA.\nDNA is the genetic material passed from parent to offspring for all life on Earth. The three letters “DNA” have now\nbecome associated with crime solving, paternity testing, human identification, and genetic testing. DNA can be retrieved\nfrom hair, blood, or saliva. With the exception of identical twins, each person’s DNA is unique and it is possible to detect\ndifferences between human beings on the basis of their unique DNA sequence.\nDNA analysis has many practical applications beyond forensics and paternity testing. DNA testing is used for tracing\ngenealogy and identifying pathogens. In the medical field, DNA is used in diagnostics, new vaccine development, and\ncancer therapy. It is now possible to determine predisposition to many diseases by analyzing genes.\nIn the 1950s, Francis Crick and James Watson worked together at the University of Cambridge, England, to determine\nthe structure of DNA. Other scientists, such as Linus Pauling and Maurice Wilkins, were also actively exploring this\nfield. Pauling had discovered the secondary structure of proteins using X-ray crystallography. X-ray crystallography is\na method for investigating molecular structure by observing the patterns formed by X-rays shot through a crystal of\nthe substance. The patterns give important information about the structure of the molecule of interest. In Wilkins’ lab,\nresearcher Rosalind Franklin was using X-ray crystallography to understand the structure of DNA. Watson and Crick were\nable to piece together the puzzle of the DNA molecule using Franklin’s data (Figure 9.2). Watson and Crick also had key\npieces of information available from other researchers such as Chargaff’s rules. Chargaff had shown that of the four kinds of\nmonomers (nucleotides) present in a DNA molecule, two types were always present in equal amounts and the remaining\ntwo types were also always present in equal amounts. This meant they were always paired in some way. In 1962, James\nWatson, Francis Crick, and Maurice Wilkins were awarded the Nobel Prize in Medicine for their work in determining\nthe structure of DNA.\nFFiigguurree 11:: Pioneering scientists (a) James Watson and Francis\nCrick are pictured here with American geneticist Maclyn McCarty.\nScientist Rosalind Franklin discovered (b) the X-ray diffraction\npattern of DNA, which helped to elucidate its double helix\nstructure. (credit a: modification of work by Marjorie McCarty; b:\nmodification of work by NIH) References\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\ns8Hh0oOc@9.10:8v2Xzdco@5/The-Structure-of-DNA 5. DNA Replication\nWhen a cell divides, it is important that each daughter cell receives an identical copy of the DNA. This is accomplished by\nthe process of DNA replication. The replication of DNA occurs before the cell begins to divide into two separate cells.\nThe discovery and characterization of the structure of the double helix provided a hint as to how DNA is copied. Recall\nthat adenine nucleotides pair with thymine nucleotides, and cytosine with guanine. This means that the two strands are\ncomplementary to each other. For example, a strand of DNA with a nucleotide sequence of AGTCATGA will have a\ncomplementary strand with the sequence TCAGTACT (Figure 9.8).\nFFiigguurree 11:: The two strands of DNA are complementary,\nmeaning the sequence of bases in one strand can be used to\ncreate the correct sequence of bases in the other strand.\nBecause of the complementarity of the two strands, having one strand means that it is possible to recreate the other strand.\nThis model for replication suggests that the two strands of the double helix separate during replication, and each strand\nserves as a template from which the new complementary strand is copied (Figure 9.9).\nDuring DNA replication, each of the two strands that make up the double helix serves as a template from which new\nstrands are copied. The new strand will be complementary to the parental or “old” strand. Each new double strand consists\nof one parental strand and one new daughter strand. This is known as semiconservative replication. When two DNA\ncopies are formed, they have an identical sequence of nucleotide bases and are divided equally into two daughter cells.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\ns8Hh0oOc@9.10:2ousESf0@5/DNA-Replication FFiigguurree 22:: The semiconservative\nmodel of DNA replication is\nshown. Gray indicates the\noriginal DNA strands, and blue\nindicates newly synthesized\nDNA. 6. Protein Synthesis\nLearning Objectives\nBy the end of this section, you will be able to:\n• Describe how DNA is used for the process of protein synthesis\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n“What are proteins and what do they do?” by U.S. National Library of Medicine is in the Public Domain\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TkuNUJis@3/\nTranscription\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:FUH9XUkW@6/\nTranslation  6.1 What are proteins and what do they do?\nIn both prokaryotes and eukaryotes, the major purpose of DNA is to provide the information needed to construct the\nproteins necessary for the cell can perform all of its functions. Proteins are large, complex molecules that play many critical\nroles in the body. They do most of the work in cells and are required for the structure, function, and regulation of the\nbody’s tissues and organs.\nProteins are made up of hundreds or thousands of smaller units called amino acids, which are attached to one another in\nlong chains. There are 20 different types of amino acids that can be combined to make a protein. The sequence of amino\nacids determines each protein’s unique 3-dimensional structure and its specific function.\nProteins can be described according to their large range of functions in the body, listed in alphabetical order:\nFunction\nDescription\nAntibody\nAntibodies bind to specific foreign particles, such as viruses and bacteria, to help protect the body.\nEnzyme\nEnzymes carry out almost all of the thousands of chemical reactions that take place in cells. They also assist with the\nformation of new molecules by reading the genetic information stored in DNA.\nMessenger\nMessenger proteins, such as some types of hormones, transmit signals to coordinate biological processes between\ndifferent cells, tissues, and organs.\nStructural\ncomponent\nThese proteins provide structure and support for cells. On a larger scale, they also allow the body to move.\nTransport/\nstorage These proteins bind and carry atoms\nand small molecules within cells and throughout the body.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n“What are proteins and what do they do?” by U.S. National Library of Medicine is in the Public Domain\n13  6.2 What is a gene?\nThe information to make proteins is stored in an organism’s DNA. Each protein is coded for by a specific section of DNA\ncalled a gene. A gene is the section of DNA required to produce one protein. Genes are typically hundreds or thousands\nof base pairs in length because they code for proteins made of hundreds or thousands of amino acids.\nRemember that DNA in eukaryotes is found as long linear molecules called chromosomes. Chromosomes are millions\nof base pairs in length and each contain many, many genes. Some example chromosomes are described in the table below.\nChromosome Size (in base pairs) # of genes\n1 248,956,422 2058\n10 133,797,422 733\n22 50818468 488\nFigure 1: A karyotype showing the sizes of all the human chromosomes. Notice that they decrease in size.\nTo summarize: many base pairs make up one gene, many genes are found on one chromosome, and many chromosomes\ncan be found in one genome.\n15 16 Mt Hood Community College Biology 102\nFigure 2: The arrangement of DNA into chromosomes. Photo\ncredit: Thomas Splettstoesser (www.scistyle.com) 6.3 How do genes direct the production of proteins?\nThe information to make proteins is stored in an organism’s DNA. Each protein is coded for by a specific section of DNA\ncalled a gene. A gene is the section of DNA required to produce one protein. Genes are typically hundreds or thousands\nof base pairs in length because they code for proteins made of hundreds or thousands of amino acids.\nMost genes contain the information needed to make functional molecules called proteins. A few genes produce other\nmolecules that help the cell assemble proteins. The journey from gene to protein is complex and tightly controlled within\neach cell. It consists of two major steps: transcription and translation. Together, transcription and translation are known as\ngene expression.\nDuring the process of transcription, the information stored in a gene’s DNA is transferred to a similar molecule called\nRNA (ribonucleic acid) in the cell nucleus. Both RNA and DNA are made up of a chain of nucleotide bases, but they\nhave slightly different chemical properties. The type of RNA that contains the information for making a protein is called\nmessenger RNA (mRNA) because it carries the information, or message, from the DNA out of the nucleus into the\ncytoplasm.\nTranslation, the second step in getting from a gene to a protein, takes place in the cytoplasm. The mRNA interacts with\na specialized complex called a ribosome, which “reads” the sequence of mRNA bases. Each sequence of three bases, called a\ncodon, usually codes for one particular amino acid. Remember that amino acids are the building blocks of proteins. A type\nof RNA called transfer RNA (tRNA) assembles the protein, one amino acid at a time. Protein assembly continues until the\nribosome encounters a “stop” codon (a sequence of three bases that does not code for an amino acid).\nFFIIgguurree 11:: The Central Dogma – DNA is used to\nmake RNA is used to make protein\nThe flow of information from DNA to RNA to proteins is one of the fundamental principles of molecular biology. It is so\nimportant that it is sometimes called the “central dogma.”\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n“What are proteins and what do they do?” by U.S. National Library of Medicine is in the Public Domain\n17 18 Mt Hood Community College Biology 102\nFFiigguurree 22:: More detail on the central dogma. (“Overview of Protein Synthesis” by Becky Boone is licensed under CC BY-SA 2.0) 6.4 Transcription: from DNA to mRNA\nBoth prokaryotes and eukaryotes perform fundamentally the same process of transcription, with the important difference\nof the membrane-bound nucleus in eukaryotes. With the genes bound in the nucleus, transcription occurs in the nucleus\nof the cell and the mRNA transcript must be transported to the cytoplasm. The prokaryotes, which include bacteria and\narchaea, lack membrane-bound nuclei and other organelles, and transcription occurs in the cytoplasm of the cell.\nTranscription requires the DNA double helix to partially unwind in the region of mRNA synthesis. The DNA sequence\nonto which the proteins and enzymes involved in transcription bind to initiate the process is called a promoter. In most\ncases, promoters exist upstream of the genes they regulate. The specific sequence of a promoter is very important because\nit determines whether the corresponding gene is transcribed all of the time, some of the time, or hardly at all.\nFFiigguurree 22:: The initiation of transcription begins when DNA is\nunwound, forming a transcription bubble. Enzymes and other\nproteins involved in transcription bind at the promoter.\nTranscription always proceeds from one of the two DNA strands, which is called the template strand. The mRNA\nproduct is complementary to the template strand and is almost identical to the other DNA strand, called the non-template\nstrand, with the exception that RNA contains a uracil (U) in place of the thymine (T) found in DNA. An enzyme called\nRNA polymerase proceeds along the DNA template adding nucleotides by base pairing with the DNA template in a\nmanner similar to DNA replication.\nFFiigguurree 33:: During elongation, RNA polymerase tracks along the\nDNA template, synthesizes mRNA in the 5′ to 3′ direction, and\nunwinds then rewinds the DNA as it is read.\nOnce a gene is transcribed, the RNA polymerase needs to be instructed to dissociate from the DNA template and liberate\nthe newly made mRNA.\nIn a prokaryotic cell, by the time transcription ends, the transcript would already have been used to begin making copies\nof the encoded protein because the processes of transcription and translation can occur at the same time since both occur\nin the cytoplasm (Figure 4). In contrast, transcription and translation cannot occur simultaneously in eukaryotic cells since\ntranscription occurs inside the nucleus and translation occurs outside in the cytoplasm.\n19 20 Mt Hood Community College Biology 102\nFFiigguurree 44:: Multiple polymerases can transcribe a single bacterial\ngene while numerous ribosomes concurrently translate the mRNA\ntranscripts into polypeptides. In this way, a specific protein can\nrapidly reach a high concentration in the bacterial cell.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TkuNUJis@3/\nTranscription 6.5 Eukaryotic RNA Processing\nEukaryotic mRNAs must undergo several processing steps before they can be transferred from the nucleus to the cytoplasm\nand translated into a protein. The additional steps involved in eukaryotic mRNA maturation create a molecule that is much\nmore stable than a prokaryotic mRNA. Eukaryotic mRNAs typically last for several hours, whereas the typical prokaryotic\nmRNA lasts no more than five seconds.\nThe mRNA transcript is coated in RNA-stabilizing proteins to prevent it from degrading while it is processed and\nexported out of the nucleus.\nA special nucleotide “cap” is added to one end of the growing transcript, which also helps prevent degradation and helps\nthe cell recognize this molecule as an mRNA that should be translated.\nOnce transcription is complete, an enzyme adds a string of approximately 200 adenine residues to the end of the mRNA,\ncalled the poly-A tail. This modification further protects the pre-mRNA from degradation and signals to cellular factors\nthat the transcript needs to be exported to the cytoplasm.\nEukaryotic genes are composed of protein-coding sequences called exons (ex-on signifies that they are expressed) and\nintervening sequences called introns (int-ron denotes their intervening role; you can also think of them as interrupting\nsequences). Introns are removed from the pre-mRNA during processing. Intron sequences in mRNA do not encode amino\nacids that become part of proteins. It is essential that all of a pre-mRNA’s introns be completely and precisely removed\nbefore protein synthesis so that the exons join together to code for the correct amino acids. If the process errs by even a\nsingle nucleotide, the sequence of the rejoined exons would be shifted, and the resulting protein would be nonfunctional.\nThe process of removing introns and reconnecting exons is called splicing (Figure 5). Introns are removed and degraded\nwhile the pre-mRNA is still in the nucleus.\nFFiigguurree 55:: Eukaryotic mRNA\ncontains introns that must be\nspliced out. A 5′ cap and 3′ tail\nare also added.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TkuNUJis@3/\nTranscription\n21  6.6 Translation\nThe synthesis of proteins is one of a cell’s most energy-consuming metabolic processes. In turn, proteins account for more\nmass than any other component of living organisms (with the exception of water), and proteins perform a wide variety\nof the functions of a cell. The process of translation, or protein synthesis, involves decoding an mRNA message into a\npolypeptide product. Amino acids are covalently strung together in lengths ranging from approximately 50 amino acids to\nmore than 1,000.\nThe Protein Synthesis Machinery\nIn addition to the mRNA template, many other molecules contribute to the process of translation. However, the general\nstructures and functions of the protein synthesis machinery are comparable from bacteria to human cells. Translation\nrequires the input of an mRNA template, ribosomes, tRNAs, and various enzymatic factors (Figure 6).\nFFiigguurree 66:: The protein synthesis\nmachinery includes the large and\nsmall subunits of the ribosome,\nmRNA, and tRNA. (credit:\nmodification of work by\nNIGMS, NIH)\nRibosomes are the part of the cell which reads the information in the mRNA molecule and joins amino acids together in\nthe correct order. In E. coli, there are 200,000 ribosomes present in every cell at any given time. A ribosome is a very large,\ncomplex macromolecule. Ribosomes are located in the cytoplasm in prokaryotes and in the cytoplasm and endoplasmic\nreticulum of eukaryotes. Ribosomes are made up of two subunits that come together for translation, rather like a hamburger\nbun comes together around the meat (the mRNA). The small subunit is responsible for binding the mRNA template,\nwhereas the large subunit sequentially binds tRNAs, a type of RNA molecule that brings amino acids to the growing chain\nof the polypeptide. Each mRNA molecule can be simultaneously translated by many ribosomes, all synthesizing protein in\nthe same direction.\nDepending on the species, 40 to 60 types of tRNA exist in the cytoplasm. Serving as adaptors, specific tRNAs bind to\nsequences on the mRNA template and add the corresponding amino acid to the polypeptide chain. Therefore, tRNAs are\nthe molecules that actually “translate” the language of RNA into the language of proteins. For each tRNA to function, it\nmust have its specific amino acid bonded to it. In the process of tRNA “charging,” each tRNA molecule is bonded to its\ncorrect amino acid.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:FUH9XUkW@6/\nTranslation\n23 24 Mt Hood Community College Biology 102\nFFiigguurree 77:: Translation begins when a tRNA\nanticodon recognizes a codon on the mRNA. The\nlarge ribosomal subunit joins the small subunit,\nand a second tRNA is recruited. As the mRNA\nmoves relative to the ribosome, the polypeptide\nchain is formed. Entry of a release factor into the\nA site terminates translation and the components\ndissociate. 6.7 The Genetic Code\nTo summarize what we know to this point, the cellular process of transcription generates messenger RNA (mRNA), a\nmobile molecular copy of one or more genes with an alphabet of A, C, G, and uracil (U). Translation of the mRNA\ntemplate converts nucleotide-based genetic information into a protein product. Protein sequences consist of 20 commonly\noccurring amino acids; therefore, it can be said that the protein alphabet consists of 20 letters. Each amino acid is defined by\na three-nucleotide sequence called the triplet codon. The relationship between a nucleotide codon and its corresponding\namino acid is called the genetic code.\nGiven the different numbers of “letters” in the mRNA and protein “alphabets,” combinations of nucleotides\ncorresponded to single amino acids. Using a three-nucleotide code means that there are a total of 64 (4 × 4 × 4) possible\ncombinations; therefore, a given amino acid is encoded by more than one nucleotide triplet (Figure 8).\nFFiigguurree 88:: This figure shows the genetic code\nfor translating each nucleotide triplet, or\ncodon, in mRNA into an amino acid or a\ntermination signal in a nascent protein.\n(credit: modification of work by NIH)\nThree of the 64 codons terminate protein synthesis and release the polypeptide from the translation machinery. These\ntriplets are called stop codons. Another codon, AUG, also has a special function. In addition to specifying the amino acid\nmethionine, it also serves as the start codon to initiate translation. The reading frame for translation is set by the AUG\nstart codon near the 5′ end of the mRNA. The genetic code is universal. With a few exceptions, virtually all species use the\nsame genetic code for protein synthesis, which is powerful evidence that all life on Earth shares a common origin.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:FUH9XUkW@6/\nTranslation\n25  Optional Section - Micropigs\nMicropigs are tiny, genetically-edited pigs that have recently been developed by a Chinese genomics institute (Li, 2014).\nThe Chinese scientists used a technique called TALENs to edit the genome of pig cells (Figure 1). Each cell inside a pig\ncontains two copies of the growth hormone receptor gene: one from each of its parents. The TALENs technique was used\nto delete one of the two copies of this gene.\nFigure 1 General overview of the TALEN process. The left and\nright TALEN bind to a specific sequence of genomic DNA inside\nthe nucleus of a cell. When they are correctly bound, nuclease\nenzymes (represented by scissors) cut the genomic DNA. The\nTALEN sequences can be edited by scientists to target different\nDNA sequences in the genome. (Photo credit: Ogletreerd,\nWikimedia.\nGrowth hormone (GH) stimulates the growth of essentially all tissues within the body. GH is a 191 amino acid peptide\n(protein) hormone which is produced from the GH gene. Cells sense the presence of GH protein hormone with the\ngrowth hormone receptor (GHR) protein on the outside of the cell. GHR protein is produced from the GHR gene and is\nfound on the cell membrane on the outside of cells.\nThe GHR protein has three major parts:\n• An extracellular region that sticks out from the outside surface of the cell\n• A transmembrane region that goes through the cell membrane and anchors the receptor to the membrane\n• An intracellular region on the inside of the cell membrane that transmits signals to the interior of the cell.\nThe extracellular region binds (attaches) to GH, fitting together like a lock and its key. The binding of growth hormone\ntransmits signals through the cell membrane to the intracellular region of the receptor (Figure 2). These signals “turn on”\ngenes involved in growth and metabolism so that those genes are made into proteins. These proteins stimulate the growth\nand division of other cells in the organism.\nIf growth hormone is not present, the organism will not grow to full size. In humans, severe GH deficiency can lead to\nan adult height of only 4 feet tall. If growth hormone receptor is not present, the “grow” signal from the GH will not be\ntransmitted inside of cells, so growth will not be stimulated.\nReferences\nLi f, Li Y, Liu H, Zhang H, Liu C, Zhang X, Dou H, Yang W, Du Y. 2014 Sep. Production of GHR double-allelic\nknockout Bama pig by TALENs and handmade cloning. Yi Chuan: 36(9):903-11.\n27 28 Mt Hood Community College Biology 102\nFigure 2 Growth hormone signaling pathway. When GH (growth\nhormone) binds to GHR (growth hormone receptor), a signal is\nsent through the cell membrane and into the nucleus of the cell.\nThis signal turns on genes involved in cell metabolism and growth.\n(Photo credit: Lisa Bartee, 2017) 7. Mutations\nLearning Objectives\nBy the end of this section, you will be able to:\n• Describe how mutations affect protein synthesis and its products.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain  How Gene Mutations Occur\nA gene mutation is a permanent alteration in the DNA sequence that makes up a gene, such that the sequence differs from\nwhat is found in most people. Mutations range in size; they can affect anywhere from a single DNA building block (base\npair) to a large segment of a chromosome that includes multiple genes.\nRecall that the DNA sequence found within a gene controls protein synthesis. If the DNA sequence is altered, this can\nalter the amino acid sequence within a protein.\nFigure : The process of protein synthesis first creates an mRNA\ncopy of a DNA sequence during the process of transcription. This\nmRNA is translated into a sequence of amino acids by the\nribosome. In this way, the information encoded in the sequence of\nbases in the DNA making up a gene is used to produce a protein.\nGene mutations can be classified in two major ways:\n• Hereditary mutations are inherited from a parent and are present throughout a person’s life in virtually every\ncell in the body. These mutations are also called germline mutations because they are present in the parent’s egg\nor sperm cells, which are also called germ cells. When an egg and a sperm cell unite, the resulting fertilized egg\ncell receives DNA from both parents. If this DNA has a mutation, the child that grows from the fertilized egg\nwill have the mutation in each of his or her cells.\n• Acquired (or somatic) mutations occur at some time during a person’s life and are present only in certain cells,\nnot in every cell in the body. These changes can be caused by environmental factors such as ultraviolet radiation\nfrom the sun, or can occur if a mistake is made as DNA copies itself during cell division. Acquired mutations in\nsomatic cells (cells other than sperm and egg cells) cannot be passed on to the next generation.\nGenetic changes that are described as ddee nnoovvoo (new) mutations can be either hereditary or somatic. In some cases, the\nmutation occurs in a person’s egg or sperm cell but is not present in any of the person’s other cells. In other cases, the\nmutation occurs in the fertilized egg shortly after the egg and sperm cells unite. It is often impossible to tell exactly when\na de novo mutation happened. As the fertilized egg divides, each resulting cell in the growing embryo will have the\nmutation. De novo mutations may explain genetic disorders in which an affected child has a mutation in every cell in the\nbody but the parents do not, and there is no family history of the disorder.\nSomatic mutations that happen in a single cell early in embryonic development can lead to a situation called mosaicism.\nThese genetic changes are not present in a parent’s egg or sperm cells, or in the fertilized egg, but happen a bit later when\nthe embryo includes several cells. As all the cells divide during growth and development, cells that arise from the cell with\n31 32 Mt Hood Community College Biology 102\nFFiigguurree:: The red individual has inherited two mutated\nalleles of a gene from their parents. This is an example\nof a hereditary mutation.\nFFiigguurree:: The color variation seen in this tulip is caused by a\nsomatic mutation – one which occurred early in the development\nof this individual flower.\nthe altered gene will have the mutation, while other cells will not. Depending on the mutation and how many cells are\naffected, mosaicism may or may not cause health problems.\nMost disease-causing gene mutations are uncommon in the general population. However, other genetic changes occur\nmore frequently. Genetic alterations that occur in more than 1 percent of the population are called polymorphisms. They\nare common enough to be considered a normal variation in the DNA. Polymorphisms are responsible for many of the\nnormal differences between people such as eye color, hair color, and blood type. Although many polymorphisms have no\nnegative effects on a person’s health, some of these variations may influence the risk of developing certain disorders. How Gene Mutations Occur 33\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain  Intro to Genetic Disorders\nTo function correctly, each cell depends on thousands of proteins to do their jobs in the right places at the right\ntimes. Sometimes, gene mutations prevent one or more of these proteins from working properly. By changing a gene’s\ninstructions for making a protein, a mutation can cause the protein to malfunction or to be missing entirely. When a\nmutation alters a protein that plays a critical role in the body, it can disrupt normal development or cause a medical\ncondition. A condition caused by mutations in one or more genes is called a genetic disorder.\nIn some cases, gene mutations are so severe that they prevent an embryo from surviving until birth. These changes occur\nin genes that are essential for development, and often disrupt the development of an embryo in its earliest stages. Because\nthese mutations have very serious effects, they are incompatible with life.\nIt is important to note that genes themselves do not cause disease—genetic disorders are caused by mutations that make\na gene function improperly. For example, when people say that someone has “the cystic fibrosis gene,” they are usually\nreferring to a mutated version of the CFTR gene, which causes the disease. All people, including those without cystic\nfibrosis, have a version of the CFTR gene.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n35  Do all gene affect health and development?\nNo; only a small percentage of mutations cause genetic disorders—most have no impact on health or development. For\nexample, some mutations alter a gene’s DNA sequence but do not change the function of the protein made by the gene.\nOften, gene mutations that could cause a genetic disorder are repaired by certain enzymes before the gene is expressed\nand an altered protein is produced. Each cell has a number of pathways through which enzymes recognize and repair\nmistakes in DNA. Because DNA can be damaged or mutated in many ways, DNA repair is an important process by which\nthe body protects itself from disease.\nA very small percentage of all mutations actually have a positive effect. These mutations lead to new versions of proteins\nthat help an individual better adapt to changes in his or her environment. For example, a beneficial mutation could result\nin a protein that protects an individual and future generations from a new strain of bacteria.\nBecause a person’s genetic code can have a large number of mutations with no effect on health, diagnosing genetic\nconditions can be difficult. Sometimes, genes thought to be related to a particular genetic condition have mutations, but\nwhether these changes are involved in development of the condition has not been determined; these genetic changes are\nknown as variants of unknown significance (VOUS). Sometimes, no mutations are found in suspected disease- related\ngenes, but mutations are found in other genes whose relationship to a particular genetic condition is unknown. It is difficult\nto know whether these variants are involved in the disease.\nFFiigguurree:: This lobster contains a mutation that causes it to be blue.\nThis is estimated to occur in roughly one in two million lobsters.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n37  Types of Mutations\nThe DNA sequence of a gene can be altered in a number of ways. Gene mutations have varying effects on health,\ndepending on where they occur and whether they alter the function of essential proteins. The types of mutations include:\nMissense mutation: This type of mutation is a change in one DNA base pair that results in the substitution of one\namino acid for another in the protein made by a gene.\nNonsense mutation: A nonsense mutation is also a change in one DNA base pair. Instead of substituting one amino\nacid for another, however, the altered DNA sequence prematurely signals the cell to stop building a protein. This type of\nmutation results in a shortened protein that may function improperly or not at all.\nFigure: Some mutations do not change the sequence of amino\nacids in a protein. Some swap one amino acid for another. Others\nintroduce an early stop codon into the sequence causing the protein\nto be truncated.\nInsertion or Deletion: An insertion changes the number of DNA bases in a gene by adding a piece of DNA. A deletion\nremoves a piece of DNA. Insertions or deletions may be small (one or a few base pairs within a gene) or large (an entire\ngene, several genes, or a large section of a chromosome). In any of these cases, the protein made by the gene may not\nfunction properly.\nDuplication: A duplication consists of a piece of DNA that is abnormally copied one or more times. This type of\nmutation may alter the function of the resulting protein.\nFrameshift mutation: This type of mutation occurs when the addition or loss of DNA bases changes a gene’s reading\nframe. A reading frame consists of groups of 3 bases that each code for one amino acid. A frameshift mutation shifts the\ngrouping of these bases and changes the code for amino acids. The resulting protein is usually nonfunctional. Insertions,\ndeletions, and duplications can all be frameshift mutations.\nRepeat expansion: Nucleotide repeats are short DNA sequences that are repeated a number of times in a row. For\nexample, a trinucleotide repeat is made up of 3-base- pair sequences, and a tetranucleotide repeat is made up of 4-base-pair\nsequences. A repeat expansion is a mutation that increases the number of times that the short DNA sequence is repeated.\nThis type of mutation can cause the resulting protein to function.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n39  Changes in Numbers of Genes\nPeople have two copies of most genes, one copy inherited from each parent. In some cases, however, the number of copies\nvaries—meaning that a person can be born with one, three, or more copies of particular genes. Less commonly, one or\nmore genes may be entirely missing. This type of genetic difference is known as copy number variation (CNV).\nCopy number variation results from insertions, deletions, and duplications of large segments of DNA. These segments\nare big enough to include whole genes. Variation in gene copy number can influence the activity of genes and ultimately\naffect many body functions.\nResearchers were surprised to learn that copy number variation accounts for a significant amount of genetic difference\nbetween people. More than 10 percent of human DNA appears to contain these differences in gene copy number. While\nmuch of this variation does not affect health or development, some differences likely influence a person’s risk of disease and\nresponse to certain drugs. Future research will focus on the consequences of copy number variation in different parts of the\ngenome and study the contribution of these variations to many types of disease.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n41  Changes in Chromosome Number\nHuman cells normally contain 23 pairs of chromosomes, for a total of 46 chromosomes in each cell. A change in the\nnumber of chromosomes can cause problems with growth, development, and function of the body’s systems. These\nchanges can occur during the formation of reproductive cells (eggs and sperm), in early fetal development, or in any cell\nafter birth. A gain or loss of chromosomes from the normal 46 is called aneuploidy.\nA common form of aneuploidy is trisomy, or the presence of an extra chromosome in cells. “Tri-” is Greek for “three”;\npeople with trisomy have three copies of a particular chromosome in cells instead of the normal two copies. Down\nsyndrome is an example of a condition caused by trisomy. People with Down syndrome typically have three copies of\nchromosome 21 in each cell, for a total of 47 chromosomes per cell.\nFFiigguurree:: This karyotype, which is a picture of all the chromosomes\nfrom one individual, is from a person who has Trisomy 13.\nMonosomy, or the loss of one chromosome in cells, is another kind of aneuploidy. “Mono-” is Greek for “one”; people\nwith monosomy have one copy of a particular chromosome in cells instead of the normal two copies. Turner syndrome is\na condition caused by monosomy. Women with Turner syndrome usually have only one copy of the X chromosome in\nevery cell, for a total of 45 chromosomes per cell.\nRarely, some cells end up with complete extra sets of chromosomes. Cells with one additional set of chromosomes, for a\ntotal of 69 chromosomes, are called triploid. Cells with two additional sets of chromosomes, for a total of 92 chromosomes,\nare called tetraploid. A condition in which every cell in the body has an extra set of chromosomes is not compatible with\nlife.\nIn some cases, a change in the number of chromosomes occurs only in certain cells. When an individual has two or more\ncell populations with a different chromosomal makeup, this situation is called chromosomal mosaicism. Chromosomal\nmosaicism occurs from an error in cell division in cells other than eggs and sperm. Most commonly, some cells end up\nwith one extra or missing chromosome (for a total of 45 or 47 chromosomes per cell), while other cells have the usual\n46 chromosomes. Mosaic Turner syndrome is one example of chromosomal mosaicism. In females with this condition,\nsome cells have 45 chromosomes because they are missing one copy of the X chromosome, while other cells have the usual\nnumber of chromosomes.\nMany cancer cells also have changes in their number of chromosomes. These changes are not inherited; they occur in\nsomatic cells (cells other than eggs or sperm) during the formation or progression of a cancerous tumor.\n43 44 Mt Hood Community College Biology 102\nFigure: “Ploid” refers to the number of copies of each\nchromosome found in a somatic cell.\nFigure: Human and other animal cells do not develop if they have\nan entire extra set of chromosomes. In contrast, plants often have\nentire copied sets of chromosomes. This strawberry is an example\nof a plant that is tetraploid.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain Complex Multifactorial Disorders\nResearchers are learning that nearly all conditions and diseases have a genetic component. Some disorders, such as sickle\ncell disease and cystic fibrosis, are caused by mutations in a single gene. The causes of many other disorders, however, are\nmuch more complex. Common medical problems such as heart disease, diabetes, and obesity do not have a single genetic\ncause—they are likely associated with the effects of multiple genes in combination with lifestyle and environmental factors.\nConditions caused by many contributing factors are called complex or multifactorial disorders.\nFigure: The main symptoms of diabetes\nAlthough complex disorders often cluster in families, they do not have a clear- cut pattern of inheritance. This makes it\ndifficult to determine a person’s risk of inheriting or passing on these disorders. Complex disorders are also difficult to study\nand treat because the specific factors that cause most of these disorders have not yet been identified. Researchers continue\nto look for major contributing genes for many common complex disorders.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n45  Genetic Predispositions\nA genetic predisposition (sometimes also called genetic susceptibility) is an increased likelihood of developing a particular\ndisease based on a person’s genetic makeup. A genetic predisposition results from specific genetic variations that are often\ninherited from a parent. These genetic changes contribute to the development of a disease but do not directly cause it.\nSome people with a predisposing genetic variation will never get the disease while others will, even within the same family.\nGenetic variations can have large or small effects on the likelihood of developing a particular disease. For example, certain\nmutations in the BRCA1 or BRCA2 genes greatly increase a person’s risk of developing breast cancer and ovarian cancer.\nVariations in other genes, such as BARD1 and BRIP1, also increase breast cancer risk, but the contribution of these genetic\nchanges to a person’s overall risk appears to be much smaller.\nCurrent research is focused on identifying genetic changes that have a small effect on disease risk but are common in\nthe general population. Although each of these variations only slightly increases a person’s risk, having changes in several\ndifferent genes may combine to increase disease risk significantly. Changes in many genes, each with a small effect, may\nunderlie susceptibility to many common diseases, including cancer, obesity, diabetes, heart disease, and mental illness.\nIn people with a genetic predisposition, the risk of disease can depend on multiple factors in addition to an identified\ngenetic change. These include\nother genetic factors (sometimes called modifiers) as well as lifestyle and environmental factors. Although a person’s genetic\nmakeup cannot be altered, some lifestyle and environmental modifications (such as having more frequent disease screenings\nand maintaining a healthy weight) may be able to reduce disease risk in people with a genetic predisposition.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n47  Genetics and Statistics\nStatistical data can provide general information about how common a condition is, how many people have the condition,\nor how likely it is that a person will develop the condition. Statistics are not personalized, however—they offer estimates\nbased on groups of people. By taking into account a person’s family history, medical history, and other factors, a genetics\nprofessional can help interpret what statistics mean for a particular patient.\nSome statistical terms are commonly used when describing genetic conditions and other disorders. These terms include:\nStatistical\nDescription\nterm\nThe incidence of a gene mutation or\nIncidence a genetic disorder is the number of people who are born with the mutation or disorder in a specified group per year.\nIncidence is often written in the form “1 in [a number]” or as a total number of live births.\nThe prevalence of a gene mutation or a genetic disorder is the total number of people in a specified group at a given\ntime who have\nPrevalence\nthe mutation or disorder. This term includes both newly diagnosed and pre-existing cases in people of any age.\nPrevalence is often written in the form “1 in [a number]” or as a total number of people who have a condition.\nMortality is the number of deaths from a particular disorder occurring in a specified group per year. Mortality is usually\nMortality\nexpressed as a total number of deaths.\nLifetime risk is the average risk of developing a particular disorder at some point during a lifetime. Lifetime risk is often\nLifetime written as a percentage or as “1 in [a number].” It is important to remember that the risk per year or per decade is much\nrisk lower than the lifetime risk. In addition, other factors may increase or decrease a person’s risk as compared with the\naverage.\nUse of Statistics Terms\n• About 1 in 200,000 people in the United States are born with syndrome A each year.\n• An estimated 15,000 infants with syndrome B were born last year worldwide.\n• Approximately 1 in 100,000 people in the United States have syndrome A at the present time.\n• About 100,000 children worldwide currently have syndrome B.\n• An estimated 12,000 people worldwide died from syndrome C in 2002.\n• Approximately 1 percent of people in the United States develop disorder D during their lifetimes.\n• The lifetime risk of developing disorder D is 1 in 100.\nReferences\n“Mutations and Health” by U.S. National Library of Medicine is in the Public Domain\n49  Gene Regulation\nLearning Objectives\nBy the end of this section, you will be able to:\n• Discuss the purpose and mechanisms of gene regulation.\nEach cell expresses, or turns on, only a fraction of its genes. The rest of the genes are repressed, or turned off. The process\nof turning genes on and off is known as gene regulation. Gene regulation is an important part of normal development.\nGenes are turned on and off in different patterns during development to make a brain cell look and act different from a\nliver cell or a muscle cell, for example. Gene regulation also allows cells to react quickly to changes in their environments.\nAlthough we know that the regulation of genes is critical for life, this complex process is not yet fully understood.\nFor a cell to function properly, necessary proteins must be synthesized at the proper time. All organisms and cells control\nor regulate the transcription and translation of their DNA into protein. The process of turning on a gene to produce RNA\nand protein is called gene expression. Whether in a simple unicellular organism or in a complex multicellular organism,\neach cell controls when and how its genes are expressed. For this to occur, there must be a mechanism to control when a\ngene is expressed to make RNA and protein, how much of the protein is made, and when it is time to stop making that\nprotein because it is no longer needed.\nCells in multicellular organisms are specialized; cells in different tissues look very different and perform different\nfunctions. For example, a muscle cell is very different from a liver cell, which is very different from a skin cell. These\ndifferences are a consequence of the expression of different sets of genes in each of these cells. All cells have certain basic\nfunctions they must perform for themselves, such as converting the energy in sugar molecules into energy in ATP. Each\ncell also has many genes that are not expressed, and expresses many that are not expressed by other cells, such that it can\ncarry out its specialized functions. In addition, cells will turn on or off certain genes at different times in response to changes\nin the environment or at different times during the development of the organism. Unicellular organisms, both eukaryotic\nand prokaryotic, also turn on and off genes in response to the demands of their environment so that they can respond to\nspecial conditions.\nThe control of gene expression is extremely complex. Malfunctions in this process are detrimental to the cell and can lead\nto the development of many diseases, including cancer.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\nb3c1e1d2-839c-42b0-a314-e119a8aafbdd@9.10 FFiigguurree 11:: The unique color pattern of this cat’s fur is caused by\neither the orange or the black allele of a gene being randomly\nsilenced (turned off). 8.1 Prokaryotic versus Eukaryotic Gene Expression\nTo understand how gene expression is regulated, we must first understand how a gene becomes a functional protein in a\ncell. The process occurs in both prokaryotic and eukaryotic cells, just in slightly different fashions.\nBecause prokaryotic organisms lack a cell nucleus, the processes of transcription and translation occur almost\nsimultaneously. When the protein is no longer needed, transcription stops. As a result, the primary method to control what\ntype and how much protein is expressed in a prokaryotic cell is through the regulation of DNA transcription into RNA.\nAll the subsequent steps happen automatically. When more protein is required, more transcription occurs. Therefore, in\nprokaryotic cells, the control of gene expression is almost entirely at the transcriptional level.\nEukaryotic cells, in contrast, have intracellular organelles and are much more complex. Recall that in eukaryotic cells,\nthe DNA is contained inside the cell’s nucleus and it is transcribed into mRNA there. The newly synthesized mRNA is\nthen transported out of the nucleus into the cytoplasm, where ribosomes translate the mRNA into protein. The processes\nof transcription and translation are physically separated by the nuclear membrane; transcription occurs only within the\nnucleus, and translation only occurs outside the nucleus in the cytoplasm. The regulation of gene expression can occur at\nall stages of the process (Figure 2):\n• Epigenetic level: regulates how tightly the DNA is wound around histone proteins to package it into\nchromosomes\n• Transcriptional level: regulates how much transcription takes place\n• Post-transcriptional level: regulates aspects of RNA processing (such as splicing) and transport out of the nucleus\n• Translational level: regulates how much of the RNA is translated into protein\n• Post-translational level: regulates how long the protein lasts after it has been made and whether the protein is\nprocessed into an active form\nFFiigguurree 22:: Eukaryotic gene\nexpression is regulated during\ntranscription and RNA processing,\nwhich take place in the nucleus, as\nwell as during protein translation,\nwhich takes place in the cytoplasm.\nFurther regulation may occur\nthrough post-translational\nmodifications of proteins.\n53 54 Mt Hood Community College Biology 102\nThe differences in the regulation of gene expression between prokaryotes and eukaryotes are summarized in Table 1.\nTable 1: Differences in the Regulation of Gene Expression of Prokaryotic and Eukaryotic Organisms\nProkaryotic organisms Eukaryotic organisms\nLack nucleus Contain nucleus\nRNA transcription occurs prior to protein translation, and it takes place in the nucleus.\nRNA transcription and protein translation\nRNA translation to protein occurs in the cytoplasm.\noccur almost simultaneously\nRNA post-processing includes addition of a 5′ cap, poly-A tail, and excision of\nintrons and splicing of exons.\nGene expression is regulated primarily at Gene expression is regulated at many levels (epigenetic, transcriptional, post-\nthe transcriptional level transcriptional, translational, and posttranslational)\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\nb3c1e1d2-839c-42b0-a314-e119a8aafbdd@9.10 8.2 What is the epigenome?\nDNA modifications that do not change the DNA sequence can affect gene activity. Chemical compounds that are added to\nsingle genes can regulate their activity; these modifications are known as epigenetic changes. The epigenome comprises all\nof the chemical compounds that have been added to the entirety of one’s DNA (genome) as a way to regulate the activity\n(expression) of all the genes within the genome. The chemical compounds of the epigenome are not part of the DNA\nsequence, but are on or attached to DNA (“epi-“ means above in Greek). Epigenomic modifications remain as cells divide\nand in some cases can be inherited through the generations. Environmental influences, such as a person’s diet and exposure\nto pollutants, can also impact the epigenome.\nEpigenetic changes can help determine whether genes are turned on or off and can influence the production of proteins\nin certain cells, ensuring that only necessary proteins are produced. For example, proteins that promote bone growth\nare not produced in muscle cells. Patterns of epigenome modification vary among individuals, different tissues within an\nindividual, and even different cells.\nA common type of epigenomic modification is called methylation. Methylation involves attaching small molecules called\nmethyl groups, each consisting of one carbon atom and three hydrogen atoms, to segments of DNA. When methyl groups\nare added to a particular gene, that gene is turned off or silenced, and no protein is produced from that gene.\nFFiigguurree 33:: The difference in chromatin packaging between an active\n(euchromatic) and inactive (heterochromatic) region of DNA.\nBecause errors in the epigenetic process, such as modifying the wrong gene or failing to add a compound to a gene, can\nlead to abnormal gene activity or inactivity, they can cause genetic disorders. Conditions including cancers, metabolic\ndisorders, and degenerative disorders have all been found to be related to epigenetic errors.\nScientists continue to explore the relationship between the genome and the chemical compounds that modify it. In\nparticular, they are studying what effect the modifications have on gene function, protein production, and human health.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\nb3c1e1d2-839c-42b0-a314-e119a8aafbdd@9.10\n55  8.3 Alternative RNA splicing\nIn the 1970s, genes were first observed that exhibited alternative RNA splicing. Alternative RNA splicing is a mechanism\nthat allows different protein products to be produced from one gene when different combinations of introns (and\nsometimes exons) are removed from the transcript (Figure 9.23). This alternative splicing can be haphazard, but more\noften it is controlled and acts as a mechanism of gene regulation, with the frequency of different splicing alternatives\ncontrolled by the cell as a way to control the production of different protein products in different cells, or at different stages\nof development. Alternative splicing is now understood to be a common mechanism of gene regulation in eukaryotes;\naccording to one estimate, 70% of genes in humans are expressed as multiple proteins through alternative splicing.\nFFiigguurree 44:: There are five basic modes of alternative splicing.\nSegments of pre-mRNA with exons shown in blue, red, orange,\nand pink can be spliced to produce a variety of new mature\nmRNA segments.\nHow could alternative splicing evolve? Introns have a beginning and ending recognition sequence, and it is easy to\nimagine the failure of the splicing mechanism to identify the end of an intron and find the end of the next intron, thus\nremoving two introns and the intervening exon. In fact, there are mechanisms in place to prevent such exon skipping,\nbut mutations are likely to lead to their failure. Such “mistakes” would more than likely produce a nonfunctional protein.\nIndeed, the cause of many genetic diseases is alternative splicing rather than mutations in a sequence. However, alternative\nsplicing would create a protein variant without the loss of the original protein, opening up possibilities for adaptation of\nthe new variant to new functions. Gene duplication has played an important role in the evolution of new functions in a\nsimilar way—by providing genes that may evolve without eliminating the original functional protein.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\nb3c1e1d2-839c-42b0-a314-e119a8aafbdd@9.10\n57  9. Biotechnology\nThe latter half of the twentieth century began with the discovery of the structure of DNA, then progressed to the\ndevelopment of the basic tools used to study and manipulate DNA. These advances, as well as advances in our\nunderstanding of and ability to manipulate cells, have led some to refer to the twenty-first century as the biotechnology\ncentury. The rate of discovery and of the development of new applications in medicine, agriculture, and energy is expected\nto accelerate, bringing huge benefits to humankind and perhaps also significant risks. Many of these developments are\nexpected to raise significant ethical and social questions that human societies have not yet had to consider.\nFFiigguurree 11:: (a) A thermal cycler, such as the one shown here, is a\nbasic tool used to study DNA in a process called the polymerase\nchain reaction (PCR). The polymerase enzyme most often used\nwith PCR comes from a strain of bacteria that lives in (b) the hot\nsprings of Yellowstone National Park. (credit a: modification of\nwork by Magnus Manske; credit b: modification of work by Jon\nSullivan)\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Pdu1uR8Y@2/\nIntroduction\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:8CA_YwJq@3/\nCloning-and-Genetic-Engineerin\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:rytx-nDe@3/\nBiotechnology-in-Medicine-and-\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TE1njgbY@4/\nGenomics-and-Proteomics  9.1 Manipulating Genetic Material\nBiotechnology is the use of artificial methods to modify the genetic material of living organisms or cells to produce\nnovel compounds or to perform new functions. Biotechnology has been used for improving livestock and crops since\nthe beginning of agriculture through selective breeding. Since the discovery of the structure of DNA in 1953, and\nparticularly since the development of tools and methods to manipulate DNA in the 1970s, biotechnology has become\nsynonymous with the manipulation of organisms’ DNA at the molecular level. The primary applications of this technology\nare in medicine (for the production of vaccines and antibiotics) and in agriculture (for the genetic modification of crops).\nBiotechnology also has many industrial applications, such as fermentation, the treatment of oil spills, and the production of\nbiofuels, as well as many household applications such as the use of enzymes in laundry detergent.\nTo accomplish the applications described above, biotechnologists must be able to extract, manipulate, and analyze\nnucleic acids.\nReview of Nucleic Acid Structure\nTo understand the basic techniques used to work with nucleic acids, remember that nucleic acids are macromolecules made\nof nucleotides (a sugar, a phosphate, and a nitrogenous base). The phosphate groups on these molecules each have a net\nnegative charge. An entire set of DNA molecules in the nucleus of eukaryotic organisms is called the genome. DNA has\ntwo complementary strands linked by hydrogen bonds between the paired bases.\nUnlike DNA in eukaryotic cells, RNA molecules leave the nucleus. Messenger RNA (mRNA) is analyzed most\nfrequently because it represents the protein-coding genes that are being expressed in the cell.\nIsolation of Nucleic Acids\nTo study or manipulate nucleic acids, the DNA must first be extracted from cells. Various techniques are used to extract\ndifferent types of DNA (Figure 10.2). Most nucleic acid extraction techniques involve steps to break open the cell, and then\nthe use of enzymatic reactions to destroy all undesired macromolecules. Cells are broken open using a detergent solution\ncontaining buffering compounds. To prevent degradation and contamination, macromolecules such as proteins and RNA\nare inactivated using enzymes. The DNA is then brought out of solution using alcohol. The resulting DNA, because it is\nmade up of long polymers, forms a gelatinous mass.\nFFiigguurree 22:: This diagram shows the basic method used for the\nextraction of DNA.\nRNA is studied to understand gene expression patterns in cells. RNA is naturally very unstable because enzymes that\nbreak down RNA are commonly present in nature. Some are even secreted by our own skin and are very difficult to\n61 62 Mt Hood Community College Biology 102\ninactivate. Similar to DNA extraction, RNA extraction involves the use of various buffers and enzymes to inactivate other\nmacromolecules and preserve only the RNA.\nGel Electrophoresis\nBecause nucleic acids are negatively charged ions at neutral or alkaline pH in an aqueous environment, they can be moved\nby an electric field. Gel electrophoresis is a technique used to separate charged molecules on the basis of size and charge.\nThe nucleic acids can be separated as whole chromosomes or as fragments. The nucleic acids are loaded into a slot at one\nend of a gel matrix, an electric current is applied, and negatively charged molecules are pulled toward the opposite end\nof the gel (the end with the positive electrode). Smaller molecules move through the pores in the gel faster than larger\nmolecules; this difference in the rate of migration separates the fragments on the basis of size. The nucleic acids in a gel\nmatrix are invisible until they are stained with a compound that allows them to be seen, such as a dye. Distinct fragments\nof nucleic acids appear as bands at specific distances from the top of the gel (the negative electrode end) that are based on\ntheir size (Figure 10.3). A mixture of many fragments of varying sizes appear as a long smear, whereas uncut genomic\nDNA is usually too large to run through the gel and forms a single large band at the top of the gel.\nFFiigguurree 33:: Shown are DNA fragments from six samples run on a\ngel, stained with a fluorescent dye and viewed under UV light.\n(credit: modification of work by James Jacob, Tompkins Cortland\nCommunity College)\nPolymerase Chain Reaction\nDNA analysis often requires focusing on one or more specific regions of the genome. It also frequently involves situations\nin which only one or a few copies of a DNA molecule are available for further analysis. These amounts are insufficient for\nmost procedures, such as gel electrophoresis. Polymerase chain reaction (PCR) is a technique used to rapidly increase\nthe number of copies of specific regions of DNA for further analyses (Figure 10.4). PCR uses a special form of DNA\npolymerase, the enzyme that replicates DNA, and other short nucleotide sequences called primers that base pair to a specific\nportion of the DNA being replicated. PCR is used for many purposes in laboratories. These include: 1) the identification\nof the owner of a DNA sample left at a crime scene; 2) paternity analysis; 3) the comparison of small amounts of ancient\nDNA with modern organisms; and 4) determining the sequence of nucleotides in a specific region.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. 9.1 Manipulating Genetic Material 63\nFFiigguurree 44:: Polymerase chain reaction, or PCR, is used to\nproduce many copies of a specific sequence of DNA using a\nspecial form of DNA polymerase.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:8CA_YwJq@3/\nCloning-and-Genetic-Engineerin  9.2 Cloning\nIn general, cloning means the creation of a perfect replica. Typically, the word is used to describe the creation of a\ngenetically identical copy. In biology, the re-creation of a whole organism is referred to as “reproductive cloning.” Long\nbefore attempts were made to clone an entire organism, researchers learned how to copy short stretches of DNA—a process\nthat is referred to as molecular cloning.\nMolecular Cloning\nCloning allows for the creation of multiple copies of genes, expression of genes, and study of specific genes. To get the\nDNA fragment into a bacterial cell in a form that will be copied or expressed, the fragment is first inserted into a plasmid.\nA plasmid (also called a vector in this context) is a small circular DNA molecule that replicates independently of the\nchromosomal DNA in bacteria. In cloning, the plasmid molecules can be used to provide a “vehicle” in which to insert\na desired DNA fragment. Modified plasmids are usually reintroduced into a bacterial host for replication. As the bacteria\ndivide, they copy their own DNA (including the plasmids). The inserted DNA fragment is copied along with the rest of\nthe bacterial DNA. In a bacterial cell, the fragment of DNA from the human genome (or another organism that is being\nstudied) is referred to as foreign DNA to differentiate it from the DNA of the bacterium (the host DNA).\nPlasmids occur naturally in bacterial populations (such as Escherichia coli) and have genes that can contribute favorable\ntraits to the organism, such as antibiotic resistance (the ability to be unaffected by antibiotics). Plasmids have been highly\nengineered as vectors for molecular cloning and for the subsequent large-scale production of important molecules, such\nas insulin. A valuable characteristic of plasmid vectors is the ease with which a foreign DNA fragment can be introduced.\nThese plasmid vectors contain many short DNA sequences that can be cut with different commonly available restriction\nenzymes. Restriction enzymes (also called restriction endonucleases) recognize specific DNA sequences and cut them in a\npredictable manner; they are naturally produced by bacteria as a defense mechanism against foreign DNA. Many restriction\nenzymes make staggered cuts in the two strands of DNA, such that the cut ends have a 2- to 4-nucleotide single-stranded\noverhang. The sequence that is recognized by the restriction enzyme is a four- to eight-nucleotide sequence that is a\npalindrome. Like with a word palindrome, this means the sequence reads the same forward and backward. In most cases,\nthe sequence reads the same forward on one strand and backward on the complementary strand. When a staggered cut is\nmade in a sequence like this, the overhangs are complementary (Figure 10.5).\nFFiigguurree 55:: In this (a) six-nucleotide restriction enzyme recognition\nsite, notice that the sequence of six nucleotides reads the same in\nthe 5′ to 3′ direction on one strand as it does in the 5′ to 3′\ndirection on the complementary strand. This is known as a\npalindrome. (b) The restriction enzyme makes breaks in the DNA\nstrands, and (c) the cut in the DNA results in “sticky ends”.\nAnother piece of DNA cut on either end by the same restriction\nenzyme could attach to these sticky ends and be inserted into the\ngap made by this cut.\nBecause these overhangs are capable of coming back together by hydrogen bonding with complementary overhangs on\na piece of DNA cut with the same restriction enzyme, these are called “sticky ends.” The process of forming hydrogen\n65 66 Mt Hood Community College Biology 102\nbonds between complementary sequences on single strands to form doublestranded DNA is called annealing. Addition of\nan enzyme called DNA ligase, which takes part in DNA replication in cells, permanently joins the DNA fragments when\nthe sticky ends come together. In this way, any DNA fragment can be spliced between the two ends of a plasmid DNA\nthat has been cut with the same restriction enzyme (Figure 10.6).\nFFiigguurree 66:: This diagram shows the steps involved in\nmolecular cloning.\nPlasmids with foreign DNA inserted into them are called recombinant DNA molecules because they contain new\ncombinations of genetic material. Proteins that are produced from recombinant DNA molecules are called recombinant\nproteins. Not all recombinant plasmids are capable of expressing genes. Plasmids may also be engineered to express\nproteins only when stimulated by certain environmental factors, so that scientists can control the expression of the\nrecombinant proteins.\nReproductive Cloning\nReproductive cloning is a method used to make a clone or an identical copy of an entire multicellular organism. Most\nmulticellular organisms undergo reproduction by sexual means, which involves the contribution of DNA from two\nindividuals (parents), making it impossible to generate an identical copy or a clone of either parent. Recent advances in\nbiotechnology have made it possible to reproductively clone mammals in the laboratory.\nNatural sexual reproduction involves the union, during fertilization, of a sperm and an egg. Each of these gametes is\nhaploid, meaning they contain one set of chromosomes in their nuclei. The resulting cell, or zygote, is then diploid and\ncontains two sets of chromosomes. This cell divides mitotically to produce a multicellular organism. However, the union\nof just any two cells cannot produce a viable zygote; there are components in the cytoplasm of the egg cell that are\nessential for the early development of the embryo during its first few cell divisions. Without these provisions, there would\nbe no subsequent development. Therefore, to produce a new individual, both a diploid genetic complement and an egg\ncytoplasm are required. The approach to producing an artificially cloned individual is to take the egg cell of one individual\nand to remove the haploid nucleus. Then a diploid nucleus from a body cell of a second individual, the donor, is put into\nthe egg cell. The egg is then stimulated to divide so that development proceeds. This sounds simple, but in fact it takes\nmany attempts before each of the steps is completed successfully.\nThe first cloned agricultural animal was Dolly, a sheep who was born in 1996. The success rate of reproductive cloning\nat the time was very low. Dolly lived for six years and died of a lung tumor (Figure 10.7). There was speculation that 9.2 Cloning 67\nbecause the cell DNA that gave rise to Dolly came from an older individual, the age of the DNA may have affected her life\nexpectancy. Since Dolly, several species of animals (such as horses, bulls, and goats) have been successfully cloned.\nFFiigguurree 77:: The creation of Dolly\nthe sheep\nThere have been attempts at producing cloned human embryos as sources of embryonic stem cells. In the procedure, the\nDNA from an adult human is introduced into a human egg cell, which is then stimulated to divide. The technology is\nsimilar to the technology that was used to produce Dolly, but the embryo is never implanted into a surrogate mother. The\ncells produced are called embryonic stem cells because they have the capacity to develop into many different kinds of cells,\nsuch as muscle or nerve cells. The stem cells could be used to research and ultimately provide therapeutic applications, such\nas replacing damaged tissues. The benefit of cloning in this instance is that the cells used to regenerate new tissues would\nbe a perfect match to the donor of the original DNA. For example, a leukemia patient would not require a sibling with a\ntissue match for a bone-marrow transplant.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:8CA_YwJq@3/\nCloning-and-Genetic-Engineerin  9.3 Genetic Engineering\nUsing recombinant DNA technology to modify an organism’s DNA to achieve desirable traits is called genetic\nengineering. Addition of foreign DNA in the form of recombinant DNA vectors that are generated by molecular\ncloning is the most common method of genetic engineering. An organism that receives the recombinant DNA is called\na genetically modified organism (GMO). If the foreign DNA that is introduced comes from a different species, the\nhost organism is called transgenic. Bacteria, plants, and animals have been genetically modified since the early 1970s for\nacademic, medical, agricultural, and industrial purposes. These applications will be examined in more detail in the next\nmodule.\nAlthough the classic methods of studying the function of genes began with a given phenotype and determined the\ngenetic basis of that phenotype, modern techniques allow researchers to start at the DNA sequence level and ask: “What\ndoes this gene or DNA element do?” This technique, called reverse genetics, has resulted in reversing the classical genetic\nmethodology. One example of this method is analogous to damaging a body part to determine its function. An insect that\nloses a wing cannot fly, which means that the wing’s function is flight. The classic genetic method compares insects that\ncannot fly with insects that can fly, and observes that the non-flying insects have lost wings. Similarly in a reverse genetics\napproach, mutating or deleting genes provides researchers with clues about gene function. Alternately, reverse genetics\ncan be used to cause a gene to overexpress itself to determine what phenotypic effects may occur.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:8CA_YwJq@3/\nCloning-and-Genetic-Engineerin\n69  9.4 Biotechnology in Medicine and Agriculture\nIt is easy to see how biotechnology can be used for medicinal purposes. Knowledge of the genetic makeup of our species,\nthe genetic basis of heritable diseases, and the invention of technology to manipulate and fix mutant genes provides\nmethods to treat diseases. Biotechnology in agriculture can enhance resistance to disease, pests, and environmental stress to\nimprove both crop yield and quality.\nGenetic Diagnosis and Gene Therapy\nThe process of testing for suspected genetic defects before administering treatment is called genetic diagnosis by genetic\ntesting. In some cases in which a genetic disease is present in an individual’s family, family members may be advised to\nundergo genetic testing. For example, mutations in the BRCA genes may increase the likelihood of developing breast\nand ovarian cancers in women and some other cancers in women and men. A woman with breast cancer can be screened\nfor these mutations. If one of the highrisk mutations is found, her female relatives may also wish to be screened for that\nparticular mutation, or simply be more vigilant for the occurrence of cancers. Genetic testing is also offered for fetuses (or\nembryos with in vitro fertilization) to determine the presence or absence of disease-causing genes in families with specific\ndebilitating diseases.\nGene therapy is a genetic engineering technique that may one day be used to cure certain genetic diseases. In its\nsimplest form, it involves the introduction of a non-mutated gene at a random location in the genome to cure a disease\nby replacing a protein that may be absent in these individuals because of a genetic mutation. The non-mutated gene is\nusually introduced into diseased cells as part of a vector transmitted by a virus, such as an adenovirus, that can infect the\nhost cell and deliver the foreign DNA into the genome of the targeted cell (Figure 10.8). To date, gene therapies have\nbeen primarily experimental procedures in humans. A few of these experimental treatments have been successful, but the\nmethods may be important in the future as the factors limiting its success are resolved.\nFFiigguurree 88:: This diagram shows the steps involved in curing disease\nwith gene therapy using an adenovirus vector. (credit: modification\nof work by NIH)\nProduction of Vaccines, Antibiotics, and Hormones\nTraditional vaccination strategies use weakened or inactive forms of microorganisms or viruses to stimulate the immune\nsystem. Modern techniques use specific genes of microorganisms cloned into vectors and mass-produced in bacteria to\nmake large quantities of specific substances to stimulate the immune system. The substance is then used as a vaccine. In\nsome cases, such as the H1N1 flu vaccine, genes cloned from the virus have been used to combat the constantly changing\nstrains of this virus.\n71 72 Mt Hood Community College Biology 102\nAntibiotics kill bacteria and are naturally produced by microorganisms such as fungi; penicillin is perhaps the most well-\nknown example. Antibiotics are produced on a large scale by cultivating and manipulating fungal cells. The fungal cells\nhave typically been genetically modified to improve the yields of the antibiotic compound.\nRecombinant DNA technology was used to produce large-scale quantities of the human hormone insulin in E. coli as\nearly as 1978. Previously, it was only possible to treat diabetes with pig insulin, which caused allergic reactions in many\nhumans because of differences in the insulin molecule. In addition, human growth hormone (HGH) is used to treat growth\ndisorders in children. The HGH gene was cloned from a cDNA (complementary DNA) library and inserted into E. coli\ncells by cloning it into a bacterial vector.\nTransgenic Animals\nAlthough several recombinant proteins used in medicine are successfully produced in bacteria, some proteins need a\neukaryotic animal host for proper processing. For this reason, genes have been cloned and expressed in animals such as\nsheep, goats, chickens, and mice. Animals that have been modified to express recombinant DNA are called transgenic\nanimals (Figure 10.9).\nFFiigguurree 99:: It can be seen that two\nof these mice are transgenic\nbecause they have a gene that\ncauses them to fluoresce under a\nUV light. The non-transgenic\nmouse does not have the gene\nthat causes fluorescence. (credit:\nIngrid Moen et al.)\nSeveral human proteins are expressed in the milk of transgenic sheep and goats. In one commercial example, the FDA has\napproved a blood anticoagulant protein that is produced in the milk of transgenic goats for use in humans. Mice have been\nused extensively for expressing and studying the effects of recombinant genes and mutations.\nTransgenic Plants\nManipulating the DNA of plants (creating genetically modified organisms, or GMOs) has helped to create desirable traits\nsuch as disease resistance, herbicide, and pest resistance, better nutritional value, and better shelf life (Figure 10.10). Plants\nare the most important source of food for the human population. Farmers developed ways to select for plant varieties with\ndesirable traits long before modernday biotechnology practices were established.\nTransgenic plants have received DNA from other species. Because they contain unique combinations of genes and are not\nrestricted to the laboratory, transgenic plants and other GMOs are closely monitored by government agencies to ensure\nthat they are fit for human consumption and do not endanger other plant and animal life. Because foreign genes can spread\nto other species in the environment, particularly in the pollen and seeds of plants, extensive testing is required to ensure\necological stability. Staples like corn, potatoes, and tomatoes were the first crop plants to be genetically engineered. 9.4 Biotechnology in Medicine and Agriculture 73\nFFiigguurree 1100:: Corn, a major\nagricultural crop used to create\nproducts for a variety of\nindustries, is often modified\nthrough plant biotechnology.\n(credit: Keith Weller, USDA)\nTransformation of Plants Using Agrobacterium tumefaciens\nIn plants, tumors caused by the bacterium Agrobacterium tumefaciens occur by transfer of DNA from the bacterium to the\nplant. The artificial introduction of DNA into plant cells is more challenging than in animal cells because of the thick plant\ncell wall. Researchers used the natural transfer of DNA from Agrobacterium to a plant host to introduce DNA fragments\nof their choice into plant hosts. In nature, the disease-causing A. tumefaciens have a set of plasmids that contain genes that\nintegrate into the infected plant cell’s genome. Researchers manipulate the plasmids to carry the desired DNA fragment\nand insert it into the plant genome.\nThe Organic Insecticide Bacillus thuringiensis\nBacillus thuringiensis (Bt) is a bacterium that produces protein crystals that are toxic to many insect species that feed on\nplants. Insects that have eaten Bt toxin stop feeding on the plants within a few hours. After the toxin is activated in the\nintestines of the insects, death occurs within a couple of days. The crystal toxin genes have been cloned from the bacterium\nand introduced into plants, therefore allowing plants to produce their own crystal Bt toxin that acts against insects. Bt toxin\nis safe for the environment and non-toxic to mammals (including humans). As a result, it has been approved for use by\norganic farmers as a natural insecticide. There is some concern, however, that insects may evolve resistance to the Bt toxin\nin the same way that bacteria evolve resistance to antibiotics.\nFlavrSavr Tomato\nThe first GM crop to be introduced into the market was the FlavrSavr Tomato produced in 1994. Molecular genetic\ntechnology was used to slow down the process of softening and rotting caused by fungal infections, which led to increased\nshelf life of the GM tomatoes. Additional genetic modification improved the flavor of this tomato. The FlavrSavr tomato\ndid not successfully stay in the market because of problems maintaining and shipping the crop.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:rytx-nDe@3/\nBiotechnology-in-Medicine-and-  9.5 Genomics and Proteomics\nThe study of nucleic acids began with the discovery of DNA, progressed to the study of genes and small fragments, and\nhas now exploded to the field of genomics. Genomics is the study of entire genomes, including the complete set of genes,\ntheir nucleotide sequence and organization, and their interactions within a species and with other species. The advances\nin genomics have been made possible by DNA sequencing technology. Just as information technology has led to Google\nMaps that enable us to get detailed information about locations around the globe, genomic information is used to create\nsimilar maps of the DNA of different organisms.\nMapping Genomes\nGenome mapping is the process of finding the location of genes on each chromosome. The maps that are created are\ncomparable to the maps that we use to navigate streets. A genetic map is an illustration that lists genes and their location\non a chromosome. Genetic maps provide the big picture (similar to a map of interstate highways) and use genetic markers\n(similar to landmarks). A genetic marker is a gene or sequence on a chromosome that shows genetic linkage with a trait of\ninterest. The genetic marker tends to be inherited with the gene of interest, and one measure of distance between them is\nthe recombination frequency during meiosis. Early geneticists called this linkage analysis.\nPhysical maps get into the intimate details of smaller regions of the chromosomes (similar to a detailed road map)\n(Figure 10.11). A physical map is a representation of the physical distance, in nucleotides, between genes or genetic\nmarkers. Both genetic linkage maps and physical maps are required to build a complete picture of the genome. Having\na complete map of the genome makes it easier for researchers to study individual genes. Human genome maps help\nresearchers in their efforts to identify human disease-causing genes related to illnesses such as cancer, heart disease, and\ncystic fibrosis, to name a few. In addition, genome mapping can be used to help identify organisms with beneficial traits,\nsuch as microbes with the ability to clean up pollutants or even prevent pollution. Research involving plant genome\nmapping may lead to methods that produce higher crop yields or to the development of plants that adapt better to climate\nchange.\nFFiigguurree 1111:: This is a\nphysical map of the human\nX chromosome. (credit:\nmodification of work by\nNCBI, NIH)\n75 76 Mt Hood Community College Biology 102\nGenetic maps provide the outline, and physical maps provide the details. It is easy to understand why both types of\ngenome-mapping techniques are important to show the big picture. Information obtained from each technique is used in\ncombination to study the genome. Genomic mapping is used with different model organisms that are used for research.\nGenome mapping is still an ongoing process, and as more advanced techniques are developed, more advances are expected.\nGenome mapping is similar to completing a complicated puzzle using every piece of available data. Mapping information\ngenerated in laboratories all over the world is entered into central databases, such as the National Center for Biotechnology\nInformation (NCBI). Efforts are made to make the information more easily accessible to researchers and the general public.\nJust as we use global positioning systems instead of paper maps to navigate through roadways, NCBI allows us to use a\ngenome viewer tool to simplify the data mining process.\nWhole Genome Sequencing\nAlthough there have been significant advances in the medical sciences in recent years, doctors are still confounded by\nmany diseases and researchers are using whole genome sequencing to get to the bottom of the problem. Whole genome\nsequencing is a process that determines the DNA sequence of an entire genome. Whole genome sequencing is a brute-\nforce approach to problem solving when there is a genetic basis at the core of a disease. Several laboratories now provide\nservices to sequence, analyze, and interpret entire genomes.\nIn 2010, whole genome sequencing was used to save a young boy whose intestines had multiple mysterious abscesses.\nThe child had several colon operations with no relief. Finally, a whole genome sequence revealed a defect in a pathway\nthat controls apoptosis (programmed cell death). A bone marrow transplant was used to overcome this genetic disorder,\nleading to a cure for the boy. He was the first person to be successfully diagnosed using whole genome sequencing.\nThe first genomes to be sequenced, such as those belonging to viruses, bacteria, and yeast, were smaller in terms of the\nnumber of nucleotides than the genomes of multicellular organisms. The genomes of other model organisms, such as the\nmouse (Mus musculus), the fruit fly (Drosophila melanogaster), and the nematode (Caenorhabditis elegans) are now known. A\ngreat deal of basic research is performed in model organisms because the information can be applied to other organisms.\nA model organism is a species that is studied as a model to understand the biological processes in other species that can\nbe represented by the model organism. For example, fruit flies are able to metabolize alcohol like humans, so the genes\naffecting sensitivity to alcohol have been studied in fruit flies in an effort to understand the variation in sensitivity to alcohol\nin humans. Having entire genomes sequenced helps with the research efforts in these model organisms (Figure 10.12).\nFFiigguurree 1122:: Much basic research is done with model organisms,\nsuch as the mouse, Mus musculus; the fruit fly, Drosophila\nmelanogaster; the nematode Caenorhabditis elegans; the yeast\nSaccharomyces cerevisiae; and the common weed, Arabidopsis\nthaliana. (credit “mouse”: modification of work by Florean\nFortescue; credit “nematodes”: modification of work by\n“snickclunk”/Flickr; credit “common weed”: modification of work\nby Peggy Greb, USDA; scale-bar data from Matt Russell) 9.5 Genomics and Proteomics 77\nThe first human genome sequence was published in 2003. The number of whole genomes that have been sequenced\nsteadily increases and now includes hundreds of species and thousands of individual human genomes.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TE1njgbY@4/\nGenomics-and-Proteomics  9.6 Applying Genomics\nThe introduction of DNA sequencing and whole genome sequencing projects, particularly the Human Genome Project,\nhas expanded the applicability of DNA sequence information. Genomics is now being used in a wide variety of fields, such\nas metagenomics, pharmacogenomics, and mitochondrial genomics. The most commonly known application of genomics\nis to understand and find cures for diseases.\nPredicting Disease Risk at the Individual Level\nPredicting the risk of disease involves screening and identifying currently healthy individuals by genome analysis at the\nindividual level. Intervention with lifestyle changes and drugs can be recommended before disease onset. However, this\napproach is most applicable when the problem arises from a single gene mutation. Such defects only account for about 5\npercent of diseases found in developed countries. Most of the common diseases, such as heart disease, are multifactorial or\npolygenic, which refers to a phenotypic characteristic that is determined by two or more genes, and also environmental\nfactors such as diet. In April 2010, scientists at Stanford University published the genome analysis of a healthy individual\n(Stephen Quake, a scientist at Stanford University, who had his genome sequenced); the analysis predicted his propensity\nto acquire various diseases. A risk assessment was done to analyze Quake’s percentage of risk for 55 different medical\nconditions. A rare genetic mutation was found that showed him to be at risk for sudden heart attack. He was also\npredicted to have a 23 percent risk of developing prostate cancer and a 1.4 percent risk of developing Alzheimer’s disease.\nThe scientists used databases and several publications to analyze the genomic data. Even though genomic sequencing is\nbecoming more affordable and analytical tools are becoming more reliable, ethical issues surrounding genomic analysis at\na population level remain to be addressed. For example, could such data be legitimately used to charge more or less for\ninsurance or to affect credit ratings?\nGenome-wide Association Studies\nSince 2005, it has been possible to conduct a type of study called a genome-wide association study, or GWAS. A GWAS is\na method that identifies differences between individuals in single nucleotide polymorphisms (SNPs) that may be involved\nin causing diseases. The method is particularly suited to diseases that may be affected by one or many genetic changes\nthroughout the genome. It is very difficult to identify the genes involved in such a disease using family history information.\nThe GWAS method relies on a genetic database that has been in development since 2002 called the International HapMap\nProject. The HapMap Project sequenced the genomes of several hundred individuals from around the world and identified\ngroups of SNPs. The groups include SNPs that are located near to each other on chromosomes so they tend to stay together\nthrough recombination. The fact that the group stays together means that identifying one marker SNP is all that is needed\nto identify all the SNPs in the group. There are several million SNPs identified, but identifying them in other individuals\nwho have not had their complete genome sequenced is much easier because only the marker SNPs need to be identified.\nIn a common design for a GWAS, two groups of individuals are chosen; one group has the disease, and the other group\ndoes not. The individuals in each group are matched in other characteristics to reduce the effect of confounding variables\ncausing differences between the two groups. For example, the genotypes may differ because the two groups are mostly\ntaken from different parts of the world. Once the individuals are chosen, and typically their numbers are a thousand or\nmore for the study to work, samples of their DNA are obtained. The DNA is analyzed using automated systems to identify\nlarge differences in the percentage of particular SNPs between the two groups. Often the study examines a million or more\nSNPs in the DNA. The results of GWAS can be used in two ways: the genetic differences may be used as markers for\nsusceptibility to the disease in undiagnosed individuals, and the particular genes identified can be targets for research into\nthe molecular pathway of the disease and potential therapies. An offshoot of the discovery of gene associations with disease\nhas been the formation of companies that provide socalled “personal genomics” that will identify risk levels for various\ndiseases based on an individual’s SNP complement. The science behind these services is controversial.\nBecause GWAS looks for associations between genes and disease, these studies provide data for other research into\ncauses, rather than answering specific questions themselves. An association between a gene difference and a disease does\n79 80 Mt Hood Community College Biology 102\nnot necessarily mean there is a cause-and-effect relationship. However, some studies have provided useful information\nabout the genetic causes of diseases. For example, three different studies in 2005 identified a gene for a protein involved\nin regulating inflammation in the body that is associated with a disease-causing blindness called age-related macular\ndegeneration. This opened up new possibilities for research into the cause of this disease. A large number of genes have\nbeen identified to be associated with Crohn’s disease using GWAS, and some of these have suggested new hypothetical\nmechanisms for the cause of the disease.\nPharmacogenomics\nPharmacogenomics involves evaluating the effectiveness and safety of drugs on the basis of information from an\nindividual’s genomic sequence. Personal genome sequence information can be used to prescribe medications that will\nbe most effective and least toxic on the basis of the individual patient’s genotype. Studying changes in gene expression\ncould provide information about the gene transcription profile in the presence of the drug, which can be used as an early\nindicator of the potential for toxic effects. For example, genes involved in cellular growth and controlled cell death, when\ndisturbed, could lead to the growth of cancerous cells. Genome-wide studies can also help to find new genes involved in\ndrug toxicity. The gene signatures may not be completely accurate, but can be tested further before pathologic symptoms\narise.\nMetagenomics\nTraditionally, microbiology has been taught with the view that microorganisms are best studied under pure culture\nconditions, which involves isolating a single type of cell and culturing it in the laboratory. Because microorganisms can go\nthrough several generations in a matter of hours, their gene expression profiles adapt to the new laboratory environment\nvery quickly. On the other hand, many species resist being cultured in isolation. Most microorganisms do not live as\nisolated entities, but in microbial communities known as biofilms. For all of these reasons, pure culture is not always the\nbest way to study microorganisms. Metagenomics is the study of the collective genomes of multiple species that grow\nand interact in an environmental niche. Metagenomics can be used to identify new species more rapidly and to analyze the\neffect of pollutants on the environment (Figure 10.13). Metagenomics techniques can now also be applied to communities\nof higher eukaryotes, such as fish.\nFFiigguurree 1133:: Metagenomics\ninvolves isolating DNA from\nmultiple species within an\nenvironmental niche. The DNA\nis cut up and sequenced, allowing\nentire genome sequences of\nmultiple species to be\nreconstructed from the sequences\nof overlapping pieces.\nCreation of New Biofuels\nKnowledge of the genomics of microorganisms is being used to find better ways to harness biofuels from algae and\ncyanobacteria. The primary sources of fuel today are coal, oil, wood, and other plant products such as ethanol. Although 9.6 Applying Genomics 81\nplants are renewable resources, there is still a need to find more alternative renewable sources of energy to meet our\npopulation’s energy demands. The microbial world is one of the largest resources for genes that encode new enzymes\nand produce new organic compounds, and it remains largely untapped. This vast genetic resource holds the potential to\nprovide new sources of biofuels (Figure 10.14).\nFFiigguurree 1144:: Renewable fuels were\ntested in Navy ships and aircraft\nat the first Naval Energy Forum.\n(credit: modification of work by\nJohn F Williams, US Navy)\nMitochondrial Genomics\nMitochondria are intracellular organelles that contain their own DNA. Mitochondrial DNA mutates at a rapid rate and is\noften used to study evolutionary relationships. Another feature that makes studying the mitochondrial genome interesting\nis that in most multicellular organisms, the mitochondrial DNA is passed on from the mother during the process of\nfertilization. For this reason, mitochondrial genomics is often used to trace genealogy.\nGenomics in Forensic Analysis\nInformation and clues obtained from DNA samples found at crime scenes have been used as evidence in court cases, and\ngenetic markers have been used in forensic analysis. Genomic analysis has also become useful in this field. In 2001, the\nfirst use of genomics in forensics was published. It was a collaborative effort between academic research institutions and\nthe FBI to solve the mysterious cases of anthrax (Figure 10.15) that was transported by the US Postal Service. Anthrax\nbacteria were made into an infectious powder and mailed to news media and two U.S. Senators. The powder infected the\nadministrative staff and postal workers who opened or handled the letters. Five people died, and 17 were sickened from the\nbacteria. Using microbial genomics, researchers determined that a specific strain of anthrax was used in all the mailings;\neventually, the source was traced to a scientist at a national biodefense laboratory in Maryland.\nGenomics in Agriculture\nGenomics can reduce the trials and failures involved in scientific research to a certain extent, which could improve the\nquality and quantity of crop yields in agriculture (Figure 10.16). Linking traits to genes or gene signatures helps to improve\ncrop breeding to generate hybrids with the most desirable qualities. Scientists use genomic data to identify desirable traits,\nand then transfer those traits to a different organism to create a new genetically modified organism, as described in the\nprevious module. Scientists are discovering how genomics can improve the quality and quantity of agricultural production.\nFor example, scientists could use desirable traits to create a useful product or enhance an existing product, such as making\na drought-sensitive crop more tolerant of the dry season.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TE1njgbY@4/\nGenomics-and-Proteomics 82 Mt Hood Community College Biology 102\nFFiigguurree 1155:: Bacillus anthracis is the organism\nthat causes anthrax. (credit: modification of\nwork by CDC; scale-bar data from Matt\nRussell)\nFFiigguurree 1166:: Transgenic\nagricultural plants can be made\nto resist disease. These transgenic\nplums are resistant to the plum\npox virus. (credit: Scott Bauer,\nUSDA ARS) 9.7 Proteomics\nProteins are the final products of genes that perform the function encoded by the gene. Proteins are composed of amino\nacids and play important roles in the cell. All enzymes (except ribozymes) are proteins and act as catalysts that affect the rate\nof reactions. Proteins are also regulatory molecules, and some are hormones. Transport proteins, such as hemoglobin, help\ntransport oxygen to various organs. Antibodies that defend against foreign particles are also proteins. In the diseased state,\nprotein function can be impaired because of changes at the genetic level or because of direct impact on a specific protein.\nA proteome is the entire set of proteins produced by a cell type. Proteomes can be studied using the knowledge of\ngenomes because genes code for mRNAs, and the mRNAs encode proteins. The study of the function of proteomes is\ncalled proteomics. Proteomics complements genomics and is useful when scientists want to test their hypotheses that were\nbased on genes. Even though all cells in a multicellular organism have the same set of genes, the set of proteins produced in\ndifferent tissues is different and dependent on gene expression. Thus, the genome is constant, but the proteome varies and\nis dynamic within an organism. In addition, RNAs can be alternatively spliced (cut and pasted to create novel combinations\nand novel proteins), and many proteins are modified after translation. Although the genome provides a blueprint, the final\narchitecture depends on several factors that can change the progression of events that generate the proteome.\nGenomes and proteomes of patients suffering from specific diseases are being studied to understand the genetic basis\nof the disease. The most prominent disease being studied with proteomic approaches is cancer (Figure 10.17). Proteomic\napproaches are being used to improve the screening and early detection of cancer; this is achieved by identifying proteins\nwhose expression is affected by the disease process. An individual protein is called a biomarker, whereas a set of proteins\nwith altered expression levels is called a protein signature. For a biomarker or protein signature to be useful as a candidate\nfor early screening and detection of a cancer, it must be secreted in body fluids such as sweat, blood, or urine, so that\nlarge-scale screenings can be performed in a noninvasive fashion. The current problem with using biomarkers for the early\ndetection of cancer is the high rate of false-negative results. A false-negative result is a negative test result that should have\nbeen positive. In other words, many cases of cancer go undetected, which makes biomarkers unreliable. Some examples of\nprotein biomarkers used in cancer detection are CA-125 for ovarian cancer and PSA for prostate cancer. Protein signatures\nmay be more reliable than biomarkers to detect cancer cells. Proteomics is also being used to develop individualized\ntreatment plans, which involves the prediction of whether or not an individual will respond to specific drugs and the side\neffects that the individual may have. Proteomics is also being used to predict the possibility of disease recurrence.\nFFiigguurree 1177:: This machine is\npreparing to do a proteomic\npattern analysis to identify\nspecific cancers so that an\naccurate cancer prognosis can be\nmade. (credit: Dorie Hightower,\nNCI, NIH)\nThe National Cancer Institute has developed programs to improve the detection and treatment of cancer. The Clinical\nProteomic Technologies for Cancer and the Early Detection Research Network are efforts to identify protein signatures\n83 84 Mt Hood Community College Biology 102\nspecific to different types of cancers. The Biomedical Proteomics Program is designed to identify protein signatures and\ndesign effective therapies for cancer patients.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:TE1njgbY@4/\nGenomics-and-Proteomics 10. Cell Division - Binary Fission and Mitosis\nLearning Objectives\nBy the end of this section, you will be able to:\n• Describe the process and consequences of binary fission and mitosis.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Vbi92lHB@9/The-Cell-\nCycle\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:LlKfCy5H@4/\nProkaryotic-Cell-Division  10.1 Prokaryotic Cell Division\nThe cell division process of prokaryotes (such as E. coli bacteria) is called binary fission. For unicellular organisms, cell\ndivision is the only method to produce new individuals. The outcome of this type of cell reproduction is a pair of daughter\ncells that are genetically identical to the parent cell. In unicellular organisms, daughter cells are whole individual organisms.\nThis is a less complicated and much quicker process than cell division in eukaryotes. Because of the speed of bacterial cell\ndivision, populations of bacteria can grow very rapidly.\nFFiigguurree 11:: An E. coli bacteria dividing into two identical daughter\ncells\nTo achieve the outcome of identical daughter cells, there are some essential steps. The genomic DNA must be replicated\n(using DNA replication) and then one copy must be moved into each of the daughter cells. The cytoplasmic contents\nmust also be divided to give both new cells the machinery to sustain life. In bacterial cells, the genome consists of a single,\ncircular DNA chromosome; therefore, the process of cell division is very simple.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Vbi92lHB@9/The-Cell-\nCycle\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:LlKfCy5H@4/\nProkaryotic-Cell-Division\n87 88 Mt Hood Community College Biology 102\nFFiigguurree 22:: Prokaryotic cell\ndivision occurs via a process\ncalled binary fission. 10.2 Eukaryotic Cell Division\nEukaryotes have two major types of cell division: mitosis and meiosis. Mitosis is used to produce new body cells for growth\nand healing, while meiosis is used to produce sex cells (eggs and sperm). Meiosis will be discussed in a later chapter.\nThe cell cycle is an ordered series of events involving cell growth and cell division that produces two new daughter\ncells via mitosis. The length of the cell cycle is highly variable even within the cells of an individual organism. In humans,\nthe frequency of cell turnover ranges from a few hours in early embryonic development to an average of two to five days\nfor epithelial cells, or to an entire human lifetime spent without dividing in specialized cells such as cortical neurons or\ncardiac muscle cells. There is also variation in the time that a cell spends in each phase of the cell cycle. When fast-dividing\nmammalian cells are grown in culture (outside the body under optimal growing conditions), the length of the cycle is\napproximately 24 hours. The timing of events in the cell cycle is controlled by mechanisms that are both internal and\nexternal to the cell.\nCells on the path to cell division proceed through a series of precisely timed and carefully regulated stages of growth,\nDNA replication, and division that produce two genetically identical cells. The cell cycle has two major phases: interphase\nand the mitotic phase (Figure 6.3). During interphase, the cell grows and DNA is replicated. During the mitotic phase,\nthe replicated DNA and cytoplasmic contents are separated and the cell divides.\nFFiigguurree 33:: A cell moves through a series of phases in an orderly\nmanner. During interphase, G1 involves cell growth and protein\nsynthesis, the S phase involves DNA replication and the\nreplication of the centrosome, and G2 involves further growth and\nprotein synthesis. The mitotic phase follows interphase. Mitosis is\nnuclear division during which duplicated chromosomes are\nsegregated and distributed into daughter nuclei. Usually the cell\nwill divide after mitosis in a process called cytokinesis in which\nthe cytoplasm is divided and two daughter cells are formed.\nInterphase\nDuring interphase, the cell undergoes normal processes while also preparing for cell division. For a cell to move from\ninterphase to the mitotic phase, many internal and external conditions must be met.\nThe Mitotic Phase\nTo make two daughter cells, the contents of the nucleus and the cytoplasm must be divided. The mitotic phase is a\nmultistep process during which the duplicated chromosomes are aligned, separated, and moved to opposite poles of the\ncell, and then the cell is divided into two new identical daughter cells. The first portion of the mitotic phase, mitosis, is\ncomposed of five stages, which accomplish nuclear division. The second portion of the mitotic phase, called cytokinesis, is\n89 90 Mt Hood Community College Biology 102\nFFiigguurree 44:: Mitosis in onion root cells. The cells in this image are in\nvarious stages of mitosis. (Credit: Spike Walker. Wellcome Images\nimages@wellcome.ac.uk http://images.wellcome.ac.uk)\nthe physical separation of the cytoplasmic components into two daughter cells. Although the stages of mitosis are similar\nfor most eukaryotes, the process of cytokinesis is quite different for eukaryotes that have cell walls, such as plant cells.\nFFiigguurree 55:: In part (a), a cleavage furrow forms at the former\nmetaphase plate in the animal cell. The plasma membrane is\ndrawn in by a ring of actin fibers contracting just inside the\nmembrane. The cleavage furrow deepens until the cells are\npinched in two. In part (b), Golgi vesicles coalesce at the\nformer metaphase plate in a plant cell. The vesicles fuse and\nform the cell plate. The cell plate grows from the center\ntoward the cell walls. New cell walls are made from the\nvesicle contents.\nG0 Phase\nNot all cells adhere to the classic cell-cycle pattern in which a newly formed daughter cell immediately enters interphase,\nclosely followed by the mitotic phase. Cells in the G0 phase are not actively preparing to divide. The cell is in a quiescent\n(inactive) stage, having exited the cell cycle. Some cells enter G0 temporarily until an external signal triggers the onset\nof G1. Other cells that never or rarely divide, such as mature cardiac muscle and nerve cells, remain in G0 permanently\n(Figure 6.6). 10.2 Eukaryotic Cell Division 91\nFigure 6.6 Cells that are not actively preparing to divide enter an alternate phase called G0. In some cases, this is a\ntemporary condition until triggered to enter G1. In other cases, the cell will remain in G0 permanently.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Vbi92lHB@9/The-Cell-\nCycle\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:LlKfCy5H@4/\nProkaryotic-Cell-Division  10.3 Control of the Cell Cycle\nIt is essential that daughter cells be exact duplicates of the parent cell. Mistakes in the duplication or distribution of the\nchromosomes lead to mutations that may be passed forward to every new cell produced from the abnormal cell. To prevent\na compromised cell from continuing to divide, there are internal control mechanisms that operate at three main cell cycle\ncheckpoints at which the cell cycle can be stopped until conditions are favorable.\nFFiigguurree 66:: The cell cycle is controlled at three checkpoints. Integrity\nof the DNA is assessed at the G1 checkpoint. Proper chromosome\nduplication is assessed at the G2 checkpoint. Attachment of each\nkinetochore to a spindle fiber is assessed at the M checkpoint.\nThe first checkpoint determines whether all conditions are favorable for cell division to proceed. This checkpoint is the\npoint at which the cell irreversibly commits to the cell-division process. In addition to adequate reserves and cell size, there\nis a check for damage to the genomic DNA. A cell that does not meet all the requirements will not be released into the S\nphase.\nThe second checkpoint bars the entry to the mitotic phase if certain conditions are not met. The most important role of\nthis checkpoint is to ensure that all of the chromosomes have been replicated and that the replicated DNA is not damaged.\nThe final checkpoint occurs in the middle of mitosis. This checkpoint determines if all of the copied chromosomes are\narranged appropriately to be separated to opposite sides of the cell. If this doesn’t happen correctly, incorrect numbers of\nchromosomes can be partitioned into each of the daughter cells, which would likely cause them to die.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Vbi92lHB@9/The-Cell-\nCycle\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:LlKfCy5H@4/\nProkaryotic-Cell-Division\n93  10.4 Cancer and the Cell Cycle\nFFiigguurree 77:: Cancer cells in culture from human connective tissue,\nilluminated by darkfield amplified contrast, at a magnification of\n500x.\nCancer is a collective name for many different diseases caused by a common mechanism: uncontrolled cell division.\nDespite the redundancy and overlapping levels of cell-cycle control, errors occur. One of the critical processes monitored\nby the cell-cycle checkpoint surveillance mechanism is the proper replication of DNA. Even when all of the cell-cycle\ncontrols are fully functional, a small percentage of replication errors (mutations) will be passed on to the daughter cells. If\none of these changes to the DNA nucleotide sequence occurs within a gene, a gene mutation results. All cancers begin\nwhen a gene mutation gives rise to a faulty protein that participates in the process of cell reproduction. The change in the\ncell that results from the malformed protein may be minor. Even minor mistakes, however, may allow subsequent mistakes\nto occur more readily. Over and over, small, uncorrected errors are passed from parent cell to daughter cells and accumulate\nas each generation of cells produces more non-functional proteins from uncorrected DNA damage. Eventually, the pace\nof the cell cycle speeds up as the effectiveness of the control and repair mechanisms decreases. Uncontrolled growth of the\nmutated cells outpaces the growth of normal cells in the area, and a tumor can result.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:Vbi92lHB@9/The-Cell-\nCycle\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:LlKfCy5H@4/\nProkaryotic-Cell-Division\n95  11. Meiosis\nFFiigguurree 11:: Each of us, like these other large multicellular\norganisms, begins life as a fertilized egg. After trillions of cell\ndivisions, each of us develops into a complex, multicellular\norganism. (credit a: modification of work by Frank Wouters; credit\nb: modification of work by Ken Cole, USGS; credit\nc: modification of work by Martin Pettitt)\nThe ability to reproduce in kind is a basic characteristic of all living things. In kind means that the offspring of any organism\nclosely resembles its parent or parents. Hippopotamuses give birth to hippopotamus calves; Monterey pine trees produce\nseeds from which Monterey pine seedlings emerge; and adult flamingos lay eggs that hatch into flamingo chicks. In kind\ndoes not generally mean exactly the same. While many single-celled organisms and a few multicellular organisms can\nproduce genetically identical clones of themselves through mitotic cell division, many single-celled organisms and most\nmulticellular organisms reproduce regularly using another method.\nSexual reproduction is the production by parents of sex cells and the fusion of two sex cells to form a single, unique\ncell. In multicellular organisms, this new cell will then undergo mitotic cell divisions to develop into an adult organism.\nA type of cell division called meiosis leads to the cells that are part of the sexual reproductive cycle. Sexual reproduction,\nspecifically meiosis and fertilization, introduces variation into offspring that may account for the evolutionary success of\nsexual reproduction. The vast majority of eukaryotic organisms can or must employ some form of meiosis and fertilization\nto reproduce.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:qOUtHXNY@3/Sexual-\nReproduction\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:6-3MVU-j@4/Errors-in-\nMeiosis  11.1 Sexual Reproduction\nSexual reproduction was an early evolutionary innovation after the appearance of eukaryotic cells. The fact that most\neukaryotes reproduce sexually is evidence of its evolutionary success. In many animals, it is the only mode of reproduction.\nAnd yet, scientists recognize some real disadvantages to sexual reproduction. On the surface, offspring that are genetically\nidentical to the parent may appear to be more advantageous. If the parent organism is successfully occupying a habitat,\noffspring with the same traits would be similarly successful. There is also the obvious benefit to an organism that can\nproduce offspring by asexual budding, fragmentation, or asexual eggs. These methods of reproduction do not require\nanother organism of the opposite sex. There is no need to expend energy finding or attracting a mate. That energy\ncan be spent on producing more offspring. Indeed, some organisms that lead a solitary lifestyle have retained the ability\nto reproduce asexually. In addition, asexual populations only have female individuals, so every individual is capable of\nreproduction. In contrast, the males in sexual populations (half the population) are not producing offspring themselves.\nBecause of this, an asexual population can grow twice as fast as a sexual population in theory. This means that in\ncompetition, the asexual population would have the advantage. All of these advantages to asexual reproduction, which are\nalso disadvantages to sexual reproduction, should mean that the number of species with asexual reproduction should be\nmore common.\nHowever, multicellular organisms that exclusively depend on asexual reproduction are exceedingly rare. Why is sexual\nreproduction so common? This is one of the important questions in biology and has been the focus of much research\nfrom the latter half of the twentieth century until now. A likely explanation is that the variation that sexual reproduction\ncreates among offspring is very important to the survival and reproduction of those offspring. The only source of variation\nin asexual organisms is mutation. This is the ultimate source of variation in sexual organisms. In addition, those different\nmutations are continually reshuffled from one generation to the next when different parents combine their unique\ngenomes, and the genes are mixed into different combinations by the process of meiosis. Meiosis is the division of the\ncontents of the nucleus that divides the chromosomes among gametes. Variation is introduced during meiosis, as well as\nwhen the gametes combine in fertilization.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:qOUtHXNY@3/Sexual-\nReproduction\n99  11.2 Overview of Meiosis\nSexual reproduction requires fertilization, a union of two cells from two individual organisms. If those two cells each\ncontain one set of chromosomes, then the resulting cell contains two sets of chromosomes. The number of sets of\nchromosomes in a cell is called its ploidy level (Figure 1). Haploid cells contain one set of chromosomes. Cells containing\ntwo sets of chromosomes are called diploid. If the reproductive cycle is to continue, the diploid cell must somehow reduce\nits number of chromosome sets before fertilization can occur again, or there will be a continual doubling in the number\nof chromosome sets in every generation. So, in addition to fertilization, sexual reproduction includes a nuclear division,\nknown as meiosis, that reduces the number of chromosome sets.\nFigure 1 Number of chromosomes in a haploid and diploid\ncell. Note that triploid and tetraploid are not normal\nnumbers of chromosomes in humans.\nMost animals and plants are diploid, containing two sets of chromosomes; in each somatic cell (the non-reproductive\ncells of a multicellular organism), the nucleus contains two copies of each chromosome that are referred to as homologous\nchromosomes. Somatic cells are sometimes referred to as “body” cells. Homologous chromosomes are matched pairs\ncontaining genes for the same traits in identical locations along their length (Figure 2). Diploid organisms inherit one copy\nof each homologous chromosome from each parent; all together, they are considered a full set of chromosomes. In animals,\nhaploid cells containing a single copy of each homologous chromosome are found only within gametes. Gametes are the\nsex cells (eggs and sperm) of an organism. One haploid gamete (containing one copy of each chromosome) fuses with\nanother haploid gamete (also containing one copy of each chromosome) to produce a diploid cell (which has two copies\nof each chromosome).\nNearly all animals employ a diploid-dominant life-cycle strategy in which the only haploid cells produced by the organism\nare the gametes. Early in the development of the embryo, specialized diploid cells, called germ cells, are produced within\nthe gonads, such as the testes and ovaries. Germ cells are capable of mitosis to perpetuate the cell line and meiosis to produce\ngametes. Once the haploid gametes are formed, they lose the ability to divide again. There is no multicellular haploid life\nstage. Fertilization occurs with the fusion of two gametes, usually from different individuals, restoring the diploid state\n(Figure 3).\nOnce the two gametes have fused during fertilization, the resulting diploid cell is called a zygote. A zygote is diploid (2\n101 102 Mt Hood Community College Biology 102\nFigure 2 A karyotype displaying all of the\nchromosomes in the human genome. Note that there\nare two copies of each chromosome. These are the\nhomologous chromosomes (one from each parent).\ncopies of each chromosome), just like the original parent organism. In order to grow from a zygote into an adult organism,\nmany more cells must be produced. The zygote goes through a cell division process called mitosis, which produces 2\nidentical somatic (body) cells from one original cell. After many, many rounds of mitosis, the zygote has grown into an\nadult organism. Because all the body cells in the adult organism were produced during the process of mitosis, the DNA\nwithin all of those cells is identical.\nFigure 3 In animals, sexually reproducing adults form haploid gametes from diploid germ cells. Fusion of the gametes gives rise to a fertilized egg cell,\nor zygote. The zygote will undergo multiple rounds of mitosis to produce a multicellular offspring. The germ cells are generated early in the\ndevelopment of the zygote. 11.2 Overview of Meiosis 103\nMitosis is part of a cell reproduction cycle that results in identical daughter nuclei that are also genetically identical to\nthe original parent nucleus. In mitosis, both the parent and the daughter nuclei contain the same number of chromosome\nsets—diploid for most plants and animals. Meiosis employs many of the same mechanisms as mitosis. However, the starting\nnucleus is always diploid and the nuclei that result at the end of a meiotic cell division are haploid. To achieve the reduction\nin chromosome number, meiosis consists of one round of chromosome duplication and two rounds of nuclear division.\nFigure 4 An overview of meiosis. Two sets of homologous\nchromosomes are shown. One set is comprised of a long red and a\nlong blue chromosome. The second set is the two shorter\nchromosomes. During interphase, the chromosomes are duplicated\nso that in the second cell the look like X’s. These two connected\ncopies are called sister chromatids. Photo credit Rdbickel;\nWikimedia.\nBecause the events that occur during each of the division stages are analogous to the events of mitosis, the same stage\nnames are assigned. However, because there are two rounds of division, the stages are designated with a “I” or “II.” Thus,\nmeiosis I is the first round of meiotic division and reduces the number of chromosome sets from two to one (Figure 4).\nThe genetic information is also mixed during this division to create unique recombinant chromosomes. Meiosis II, in\nwhich the second round of meiotic division takes place in a way that is similar to mitosis, separates the sister chromatids\n(the identical copies of each chromosome produced during DNA replication that are attached at the centromere).\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis  11.3 Interphase\nMeiosis is preceded by an interphase which is nearly identical to the interphase preceding mitosis. During interphase, the\nDNA of the chromosomes is replicated. After DNA replication, each chromosome becomes composed of two identical\ncopies (called sister chromatids) that are held together at the centromere until they are pulled apart during meiosis II.\nFFiigguurree 22:: Sister chromatids are identical copies of a chromosome\nthat are held together at the centromere. They are produced during\nDNA replication. (Credit: User:SyntaxError55, from\nWikimedia)\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis\n105  11.4 Meiosis I\nEarly in meiosis I, the chromosomes can be seen clearly microscopically. As the nuclear envelope begins to break down, the\nproteins associated with homologous chromosomes bring the pair close to each other. The tight pairing of the homologous\nchromosomes is called synapsis. In synapsis, the genes on the chromatids of the homologous chromosomes are precisely\naligned with each other. An exchange of chromosome segments between non-sister homologous chromatids occurs and is\ncalled crossing over. The crossover events are the first source of genetic variation produced by meiosis. A single crossover\nevent between homologous non-sister chromatids leads to a reciprocal exchange of equivalent DNA between a maternal\nchromosome and a paternal chromosome. Now, when that sister chromatid is moved into a gamete, it will carry some\nDNA from one parent of the individual and some DNA from the other parent. The recombinant sister chromatid has a\ncombination of maternal and paternal genes that did not exist before the crossover.\nFFiigguurree 33:: In this illustration of the effects of\ncrossing over, the blue chromosome came from\nthe individual’s father and the red chromosome\ncame from the individual’s mother. Crossover\noccurs between non-sister chromatids of\nhomologous chromosomes. The result is an\nexchange of genetic material between\nhomologous chromosomes. The chromosomes\nthat have a mixture of maternal and paternal\nsequence are called recombinant and the\nchromosomes that are completely paternal or\nmaternal are called non-recombinant.\nDuring meiosis I, the homologous chromosomes are arranged in the center of the cell with the kinetochores facing\nopposite poles. The orientation of each pair of homologous chromosomes at the center of the cell is random. This\nrandomness, called independent assortment, is the physical basis for the generation of the second form of genetic variation\nin offspring. Consider that the homologous chromosomes of a sexually reproducing organism are originally inherited\nas two separate sets, one from each parent. Using humans as an example, one set of 23 chromosomes is present in the\negg donated by the mother. The father provides the other set of 23 chromosomes in the sperm that fertilizes the egg. In\nmetaphase I, these pairs line up at the midway point between the two poles of the cell. Because there is an equal chance\nthat a microtubule fiber will encounter a maternally or paternally inherited chromosome, the arrangement of the tetrads\n107 108 Mt Hood Community College Biology 102\nat the metaphase plate is random. Any maternally inherited chromosome may face either pole. Any paternally inherited\nchromosome may also face either pole. The orientation of each tetrad is independent of the orientation of the other 22\ntetrads.\nIn each cell that undergoes meiosis, the arrangement of the tetrads is different. The number of variations depends on the\nnumber of chromosomes making up a set. There are two possibilities for orientation (for each tetrad); thus, the possible\nnumber of alignments equals 2n where n is the number of chromosomes per set. Humans have 23 chromosome pairs,\nwhich results in over eight million (223) possibilities. This number does not include the variability previously created in\nthe sister chromatids by crossover. Given these two mechanisms, it is highly unlikely that any two haploid cells resulting\nfrom meiosis will have the same genetic composition (Figure 4).\nTo summarize the genetic consequences of meiosis I: the maternal and paternal genes are recombined by crossover\nevents occurring on each homologous pair during prophase I; in addition, the random assortment of tetrads at metaphase\nproduces a unique combination of maternal and paternal chromosomes that will make their way into the gametes.\nFFiigguurree 44:: To demonstrate random, independent assortment at\nmetaphase I, consider a cell with n = 2. In this case, there are two\npossible arrangements at the equatorial plane in metaphase I, as\nshown in the upper cell of each panel. These two possible\norientations lead to the production of genetically different gametes.\nWith more chromosomes, the number of possible arrangements\nincreases dramatically.\nCytokinesis, the physical separation of the cytoplasmic components into two daughter cells, occurs without reformation of\nthe nuclei in other organisms. In nearly all species, cytokinesis separates the cell contents by either a cleavage furrow (in\nanimals and some fungi), or a cell plate that will ultimately lead to formation of cell walls that separate the two daughter\ncells (in plants). At each pole, there is just one member of each pair of the homologous chromosomes, so only one full set of\nthe chromosomes is present. This is why the cells are considered haploid—there is only one chromosome set, even though\nthere are duplicate copies of the set because each homolog still consists of two sister chromatids that are still attached to\neach other. However, although the sister chromatids were once duplicates of the same chromosome, they are no longer\nidentical at this stage because of crossovers.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis 11.5 Meiosis II\nIn meiosis II, the connected sister chromatids remaining in the haploid cells from meiosis I will be split to form four haploid\ncells. The two cells produced in meiosis I go through the events of meiosis II in synchrony. Overall, meiosis II resembles\nthe mitotic division of a haploid cell. During meiosis II, the sister chromatids are pulled apart by the spindle fibers and\nmove toward opposite poles.\nFFiigguurree 55:: In prometaphase I, microtubules attach to the fused\nkinetochores of homologous chromosomes. In anaphase I, the\nhomologous chromosomes are separated. In prometaphase II,\nmicrotubules attach to individual kinetochores of sister chromatids.\nIn anaphase II, the sister chromatids are separated.\nNuclear envelopes form around the chromosomes. Cytokinesis separates the two cells into four genetically unique haploid\ncells. At this point, the nuclei in the newly produced cells are both haploid and have only one copy of the single set\nof chromosomes. The cells produced are genetically unique because of the random assortment of paternal and maternal\nhomologs and because of the recombination of maternal and paternal segments of chromosomes—with their sets of\ngenes—that occurs during crossover.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis\n109  11.6 Comparing Meiosis and Mitosis\nMitosis and meiosis, which are both forms of division of the nucleus in eukaryotic cells, share some similarities, but also\nexhibit distinct differences that lead to their very different outcomes. Mitosis is a single nuclear division that results in two\nnuclei, usually partitioned into two new cells. The nuclei resulting from a mitotic division are genetically identical to the\noriginal. They have the same number of sets of chromosomes: one in the case of haploid cells, and two in the case of diploid\ncells. On the other hand, meiosis is two nuclear divisions that result in four nuclei, usually partitioned into four new cells.\nThe nuclei resulting from meiosis are never genetically identical, and they contain one chromosome set only—this is half\nthe number of the original cell, which was diploid (Figure 6).\nThe differences in the outcomes of meiosis and mitosis occur because of differences in the behavior of the chromosomes\nduring each process. Most of these differences in the processes occur in meiosis I, which is a very different nuclear division\nthan mitosis. In meiosis I, the homologous chromosome pairs become associated with each other, are bound together,\nexperience chiasmata and crossover between sister chromatids, and line up along the metaphase plate in tetrads with spindle\nfibers from opposite spindle poles attached to each kinetochore of a homolog in a tetrad. All of these events occur only in\nmeiosis I, never in mitosis.\nHomologous chromosomes move to opposite poles during meiosis I so the number of sets of chromosomes in each\nnucleus-to-be is reduced from two to one. For this reason, meiosis I is referred to as a reduction division. There is no such\nreduction in ploidy level in mitosis.\nMeiosis II is much more analogous to a mitotic division. In this case, duplicated chromosomes (only one set of them) line\nup at the center of the cell with divided kinetochores attached to spindle fibers from opposite poles. During anaphase II, as\nin mitotic anaphase, the kinetochores divide and one sister chromatid is pulled to one pole and the other sister chromatid\nis pulled to the other pole. If it were not for the fact that there had been crossovers, the two products of each meiosis II\ndivision would be identical as in mitosis; instead, they are different because there has always been at least one crossover per\nchromosome. Meiosis II is not a reduction division because, although there are fewer copies of the genome in the resulting\ncells, there is still one set of chromosomes, as there was at the end of meiosis I.\nCells produced by mitosis will function in different parts of the body as a part of growth or replacing dead or damaged\ncells. They may even be involved in asexual reproduction in some organisms. Cells produced by meiosis in a diploid-\ndominant organism such as an animal will only participate in sexual reproduction.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016http://cnx.org/contents/s8Hh0oOc@9.10:1Q8z96mT@4/Meiosis\n111 112 Mt Hood Community College Biology 102\nFFiigguurree 66:: Meiosis and mitosis are both preceded by one round of DNA\nreplication; however, meiosis includes two nuclear divisions. The four\ndaughter cells resulting from meiosis are haploid and genetically distinct.\nThe daughter cells resulting from mitosis are diploid and identical to the\nparent cell. 11.7 Errors in Meiosis\nInherited disorders can arise when chromosomes behave abnormally during meiosis. Chromosome disorders can be divided\ninto two categories: abnormalities in chromosome number and chromosome structural rearrangements. Because even small\nsegments of chromosomes can span many genes, chromosomal disorders are characteristically dramatic and often fatal.\nDisorders in Chromosome Number\nThe isolation and microscopic observation of chromosomes forms the basis of cytogenetics and is the primary method\nby which clinicians detect chromosomal abnormalities in humans. A karyotype is the number and appearance of\nchromosomes, including their length, banding pattern, and centromere position. To obtain a view of an individual’s\nkaryotype, cytologists photograph the chromosomes and then cut and paste each chromosome into a chart, or karyogram\n(Figure 7).\nFFiigguurree 77:: This karyogram shows the chromosomes of a female\nhuman immune cell during mitosis. (Credit: Andreas Bolzer, et\nal)\nBy observing a karyogram, geneticists can actually visualize the chromosomal composition of an individual to confirm or\npredict genetic abnormalities in offspring even before birth.\nNondisjunctions, Duplications, and Deletions\nOf all the chromosomal disorders, abnormalities in chromosome number are the most easily identifiable from a karyogram.\nDisorders of chromosome number include the duplication or loss of entire chromosomes, as well as changes in the\nnumber of complete sets of chromosomes. They are caused by nondisjunction, which occurs when pairs of homologous\nchromosomes or sister chromatids fail to separate during meiosis. The risk of nondisjunction increases with the age of the\nparents.\nNondisjunction can occur during either meiosis I or II, with different results (Figure 7.8). If homologous chromosomes\nfail to separate during meiosis I, the result is two gametes that lack that chromosome and two gametes with two copies of\nthe chromosome. If sister chromatids fail to separate during meiosis II, the result is one gamete that lacks that chromosome,\ntwo normal gametes with one copy of the chromosome, and one gamete with two copies of the chromosome.\nAn individual with the appropriate number of chromosomes for their species is called euploid; in humans, euploidy\ncorresponds to 22 pairs of autosomes and one pair of sex chromosomes. An individual with an error in chromosome\nnumber is described as aneuploid, a term that includes monosomy (loss of one chromosome) or trisomy (gain of an\nextraneous chromosome). Monosomic human zygotes missing any one copy of an autosome invariably fail to develop to\nbirth because they have only one copy of essential genes. Most autosomal trisomies also fail to develop to birth; however,\nduplications of some of the smaller chromosomes (13, 15, 18, 21, or 22) can result in offspring that survive for several weeks\nto many years. Trisomic individuals suffer from a different type of genetic imbalance: an excess in gene dose. Cell functions\nare calibrated to the amount of gene product produced by two copies (doses) of each gene; adding a third copy (dose)\ndisrupts this balance. The most common trisomy is that of chromosome 21, which leads to Down syndrome. Individuals\nwith this inherited disorder have characteristic physical features and developmental delays in growth and cognition. The\n113 114 Mt Hood Community College Biology 102\nFFiigguurree 88:: Following meiosis,\neach gamete has one copy of each\nchromosome. Nondisjunction\noccurs when homologous\nchromosomes (meiosis I) or sister\nchromatids (meiosis II) fail to\nseparate during meiosis.\nincidence of Down syndrome is correlated with maternal age, such that older women are more likely to give birth to\nchildren with Down syndrome (Figure 7.9).\nFFiigguurree 99:: The incidence of\nhaving a fetus with trisomy 21\nincreases dramatically with\nmaternal age.\nHumans display dramatic deleterious effects with autosomal trisomies and monosomies. Therefore, it may seem\ncounterintuitive that human females and males can function normally, despite carrying different numbers of the X\nchromosome. In part, this occurs because of a process called X inactivation. Early in development, when female\nmammalian embryos consist of just a few thousand cells, one X chromosome in each cell inactivates by condensing into a\nstructure called a Barr body. The genes on the inactive X chromosome are not expressed. The particular X chromosome\n(maternally or paternally derived) that is inactivated in each cell is random, but once the inactivation occurs, all cells\ndescended from that cell will have the same inactive X chromosome. By this process, females compensate for their double\ngenetic dose of X chromosome.\nIn so-called “tortoiseshell” cats, X inactivation is observed as coat-color variegation (Figure 10). Females heterozygous\nfor an X-linked coat color gene will express one of two different coat colors over different regions of their body,\ncorresponding to whichever X chromosome is inactivated in the embryonic cell progenitor of that region. When you see\na tortoiseshell cat, you will know that it has to be a female.\nIn an individual carrying an abnormal number of X chromosomes, cellular mechanisms will inactivate all but one X in\neach of her cells. As a result, X-chromosomal abnormalities are typically associated with mild mental and physical defects,\nas well as sterility. If the X chromosome is absent altogether, the individual will not develop.\nSeveral errors in sex chromosome number have been characterized. Individuals with three X chromosomes, called\ntriplo-X, appear female but express developmental delays and reduced fertility. The XXY chromosome complement, 11.7 Errors in Meiosis 115\nFFiigguurree 1100:: Embryonic\ninactivation of one of two\ndifferent X chromosomes\nencoding different coat colors\ngives rise to the tortoiseshell\nphenotype in cats. (credit:\nMichael Bodega)\ncorresponding to one type of Klinefelter syndrome, corresponds to male individuals with small testes, enlarged breasts, and\nreduced body hair. The extra X chromosome undergoes inactivation to compensate for the excess genetic dosage. Turner\nsyndrome, characterized as an X0 chromosome complement (i.e., only a single sex chromosome), corresponds to a female\nindividual with short stature, webbed skin in the neck region, hearing and cardiac impairments, and sterility.\nAn individual with more than the correct number of chromosome sets (two for diploid species) is called polyploid. For\ninstance, fertilization of an abnormal diploid egg with a normal haploid sperm would yield a triploid zygote. Polyploid\nanimals are extremely rare, with only a few examples among the flatworms, crustaceans, amphibians, fish, and lizards.\nTriploid animals are sterile because meiosis cannot proceed normally with an odd number of chromosome sets. In contrast,\npolyploidy is very common in the plant kingdom, and polyploid plants tend to be larger and more robust than euploids of\ntheir species.\nChromosome Structural Rearrangements\nCytologists have characterized numerous structural rearrangements in chromosomes, including partial duplications,\ndeletions, inversions, and translocations. Duplications and deletions often produce offspring that survive but exhibit\nphysical and mental abnormalities. Cri-du-chat (from the French for “cry of the cat”) is a syndrome associated with nervous\nsystem abnormalities and identifiable physical features that results from a deletion of most of the small arm of chromosome\n5 (Figure 7.11). Infants with this genotype emit a characteristic high-pitched cry upon which the disorder’s name is based.\nChromosome inversions and translocations can be identified by observing cells during meiosis because homologous\nchromosomes with a rearrangement in one of the pair must contort to maintain appropriate gene alignment and pair\neffectively during prophase I.\nA chromosome inversion is the detachment, 180° rotation, and reinsertion of part of a chromosome (Figure 7.12).\nUnless they disrupt a gene sequence, inversions only change the orientation of genes and are likely to have more mild\neffects than aneuploid errors.\nA translocation occurs when a segment of a chromosome dissociates and reattaches to a different, nonhomologous\nchromosome. Translocations can be benign or have devastating effects, depending on how the positions of genes are\naltered with respect to regulatory sequences. Notably, specific translocations have been associated with several cancers\nand with schizophrenia. Reciprocal translocations result from the exchange of chromosome segments between two\nnonhomologous chromosomes such that there is no gain or loss of genetic information (Figure 12).\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. 116 Mt Hood Community College Biology 102\nFFiigguurree 1111:: This individual with cri-du-chat\nsyndrome is shown at various ages: (A) age two,\n(B) age four, (C) age nine, and (D) age 12.\n(credit: Paola Cerruti Mainardi)\nFFiigguurree 1122:: An (a) inversion occurs when a chromosome segment\nbreaks from the chromosome, reverses its orientation, and then\nreattaches in the original position. A (b) reciprocal translocation\noccurs between two nonhomologous chromosomes and does not\ncause any genetic information to be lost or duplicated. (credit:\nmodification of work by National Human Genome Research\nInstitute (USA)\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:6-3MVU-j@4/Errors-in-\nMeiosis 12. Patterns of Inheritance\nLearning Objectives\nBy the end of this section, you will be able to:\n• Describe the molecular basis of inheritance.\n• Determine the outcome in crosses involving various types of inheritance.\n• Present and decipher information about trait inheritance using a pedigree.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.  OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:O2lXSTlf@2/Introduction  12.1 Mendelian Genetics\nFigure 1: Experimenting with thousands of garden peas, Mendel\nuncovered the fundamentals of genetics. (credit: modification of\nwork by Jerry Kirkhart)\nGenetics is the study of heredity. Johann Gregor Mendel set the framework for genetics long before chromosomes or\ngenes had been identified, at a time when meiosis was not well understood. Mendel selected a simple biological system\nand conducted methodical, quantitative analyses using large sample sizes. Because of Mendel’s work, the fundamental\nprinciples of heredity were revealed. We now know that genes, carried on chromosomes, are the basic functional units\nof heredity with the ability to be replicated, expressed, or mutated. Today, the postulates put forth by Mendel form the\nbasis of classical, or Mendelian, genetics. Not all genes are transmitted from parents to offspring according to Mendelian\ngenetics, but Mendel’s experiments serve as an excellent starting point for thinking about inheritance.\nMendel’s Experiments\nFFiigguurree 22:: Johann Gregor Mendel\nset the framework for the study\nof genetics.\nJohann Gregor Mendel (1822–1884) (Figure 2) was a lifelong learner, teacher, scientist, and man of faith. As a young\nadult, he joined the Augustinian Abbey of St. Thomas in Brno in what is now the Czech Republic. Supported by the\nmonastery, he taught physics, botany, and natural science courses at the secondary and university levels. In 1856, he began\na decade-long research pursuit involving inheritance patterns in honeybees and plants, ultimately settling on pea plants as\nhis primary model system (a system with convenient characteristics that is used to study a specific biological phenomenon\nto gain understanding to be applied to other systems). In 1865, Mendel presented the results of his experiments with nearly\n30,000 pea plants to the local natural history society. He demonstrated that traits are transmitted faithfully from parents to\noffspring in specific patterns. In 1866, he published his work, Experiments in Plant Hybridization, in the proceedings of the\nNatural History Society of Brünn.\n121 122 Mt Hood Community College Biology 102\nMendel’s work went virtually unnoticed by the scientific community, which incorrectly believed that the process of\ninheritance involved a blending of parental traits that produced an intermediate physical appearance in offspring. This\nhypothetical process appeared to be correct because of what we know now as continuous variation. Continuous variation\nis the range of small differences we see among individuals in a characteristic like human height. It does appear that offspring\nare a “blend” of their parents’ traits when we look at characteristics that exhibit continuous variation. Mendel worked\ninstead with traits that show discontinuous variation. Discontinuous variation is the variation seen among individuals\nwhen each individual shows one of two—or a very few—easily distinguishable traits, such as violet or white flowers.\nMendel’s choice of these kinds of traits allowed him to see experimentally that the traits were not blended in the offspring\nas would have been expected at the time, but that they were inherited as distinct traits. In 1868, Mendel became abbot\nof the monastery and exchanged his scientific pursuits for his pastoral duties. He was not recognized for his extraordinary\nscientific contributions during his lifetime; in fact, it was not until 1900 that his work was rediscovered, reproduced, and\nrevitalized by scientists on the brink of discovering the chromosomal basis of heredity.\nMendel’s Crosses\nMendel’s seminal work was accomplished using the garden pea, Pisum sativum, to study inheritance.\nThis species naturally self-fertilizes, meaning that pollen encounters ova within the same flower. The flower petals\nremain sealed tightly until pollination is completed to prevent the pollination of other plants. The result is highly inbred,\nor “true-breeding,” pea plants. These are plants that always produce offspring that look like the parent. By experimenting\nwith true-breeding pea plants, Mendel avoided the appearance of unexpected traits in offspring that might occur if the\nplants were not true breeding. The garden pea also grows to maturity within one season, meaning that several generations\ncould be evaluated over a relatively short time. Finally, large quantities of garden peas could be cultivated simultaneously,\nallowing Mendel to conclude that his results did not come about simply by chance.\nMendel performed hybridizations, which involve mating two true-breeding individuals that have different traits. In the\npea, which is naturally self-pollinating, this is done by manually transferring pollen from the anther of a mature pea plant\nof one variety to the stigma of a separate mature pea plant of the second variety.\nPlants used in first-generation crosses were called P, or parental generation, plants (Figure 8.3). Mendel collected the\nseeds produced by the P plants that resulted from each cross and grew them the following season. These offspring were\ncalled the F1, or the first filial (filial = daughter or son), generation. Once Mendel examined the characteristics in the\nF1 generation of plants, he allowed them to self-fertilize naturally. He then collected and grew the seeds from the F1\nplants to produce the F2, or second filial, generation. Mendel’s experiments extended beyond the F2 generation to the F3\ngeneration, F4 generation, and so on, but it was the ratio of characteristics in the P, F1, and F2 generations that were the\nmost intriguing and became the basis of Mendel’s postulates.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. 12.1 Mendelian Genetics 123\nFFiigguurree 33:: Mendel’s process for performing\ncrosses included examining flower color.  OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:x4Wo0QTK@7/Mendels-\nExperiments-and-the-La  12.2 Garden Pea Characteristics Revealed the Basics of Heredity\nIn his 1865 publication, Mendel reported the results of his crosses involving seven different characteristics, each with two\ncontrasting traits. A trait is defined as a variation in the physical appearance of a heritable characteristic. The characteristics\nincluded plant height, seed texture, seed color, flower color, pea-pod size, pea-pod color, and flower position. For the\ncharacteristic of flower color, for example, the two contrasting traits were white versus violet. To fully examine each\ncharacteristic, Mendel generated large numbers of F1 and F2 plants and reported results from thousands of F2 plants.\nWhat results did Mendel find in his crosses for flower color? First, Mendel confirmed that he was using plants that bred\ntrue for white or violet flower color. Irrespective of the number of generations that Mendel examined, all self-crossed\noffspring of parents with white flowers had white flowers, and all self-crossed offspring of parents with violet flowers had\nviolet flowers. In addition, Mendel confirmed that, other than flower color, the pea plants were physically identical. This\nwas an important check to make sure that the two varieties of pea plants only differed with respect to one trait, flower\ncolor.\nOnce these validations were complete, Mendel applied the pollen from a plant with violet flowers to the stigma of a plant\nwith white flowers. After gathering and sowing the seeds that resulted from this cross, Mendel found that 100 percent of\nthe F1 hybrid generation had violet flowers. Conventional wisdom at that time would have predicted the hybrid flowers\nto be pale violet or for hybrid plants to have equal numbers of white and violet flowers. In other words, the contrasting\nparental traits were expected to blend in the offspring. Instead, Mendel’s results demonstrated that the white flower trait\nhad completely disappeared in the F1 generation.\nImportantly, Mendel did not stop his experimentation there. He allowed the F1 plants to self-fertilize and found that\n705 plants in the F2 generation had violet flowers and 224 had white flowers. This was a ratio of 3.15 violet flowers to\none white flower, or approximately 3:1. When Mendel transferred pollen from a plant with violet flowers to the stigma\nof a plant with white flowers and vice versa, he obtained approximately the same ratio irrespective of which parent—male\nor female—contributed which trait. This is called a reciprocal cross—a paired cross in which the respective traits of the\nmale and female in one cross become the respective traits of the female and male in the other cross. For the other six\ncharacteristics that Mendel examined, the F1 and F2 generations behaved in the same way that they behaved for flower\ncolor. One of the two traits would disappear completely from the F1 generation, only to reappear in the F2 generation at\na ratio of roughly 3:1 (Figure 4).\nFFiigguurree 44:: Mendel identified seven pea plant characteristics.\nUpon compiling his results for many thousands of plants, Mendel concluded that the characteristics could be divided into\nexpressed and latent traits. He called these dominant and recessive traits, respectively. Dominant traits are those that are\ninherited unchanged in a hybridization. Recessive traits become latent, or disappear in the offspring of a hybridization.\nThe recessive trait does, however, reappear in the progeny of the hybrid offspring. An example of a dominant trait is the\nviolet-colored flower trait. For this same characteristic (flower color), white-colored flowers are a recessive trait. The fact\n127 128 Mt Hood Community College Biology 102\nthat the recessive trait reappeared in the F2 generation meant that the traits remained separate (and were not blended)\nin the plants of the F1 generation. Mendel proposed that this was because the plants possessed two copies of the trait for\nthe flower-color characteristic, and that each parent transmitted one of their two copies to their offspring, where they\ncame together. Moreover, the physical observation of a dominant trait could mean that the genetic composition of the\norganism included two dominant versions of the characteristic, or that it included one dominant and one recessive version.\nConversely, the observation of a recessive trait meant that the organism lacked any dominant versions of this characteristic.\nLaws of Inheritance\nThe seven characteristics that Mendel evaluated in his pea plants were each expressed as one of two versions, or traits.\nMendel deduced from his results that each individual had two discrete copies of the characteristic that are passed\nindividually to offspring. We now call those two copies genes, which are carried on chromosomes. The reason we have\ntwo copies of each gene is that we inherit one from each parent. In fact, it is the chromosomes we inherit and the two\ncopies of each gene are located on paired chromosomes. Recall that in meiosis these chromosomes are separated out into\nhaploid gametes. This separation, or segregation, of the homologous chromosomes means also that only one of the copies\nof the gene gets moved into a gamete. The offspring are formed when that gamete unites with one from another parent\nand the two copies of each gene (and chromosome) are restored.\nFor cases in which a single gene controls a single characteristic, a diploid organism has two genetic copies that may\nor may not encode the same version of that characteristic. For example, one individual may carry a gene that determines\nwhite flower color and a gene that determines violet flower color. Gene variants that arise by mutation and exist at the\nsame relative locations on homologous chromosomes are called alleles. Mendel examined the inheritance of genes with\njust two allele forms, but it is common to encounter more than two alleles for any given gene in a natural population.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:x4Wo0QTK@7/Mendels-\nExperiments-and-the-La  12.3 Phenotypes and Genotypes\nTwo alleles for a given gene in a diploid organism are expressed and interact to produce physical characteristics. The\nobservable traits expressed by an organism are referred to as its phenotype. An organism’s underlying genetic makeup,\nconsisting of both the physically visible and the non-expressed alleles, is called its genotype. Mendel’s hybridization\nexperiments demonstrate the difference between phenotype and genotype. For example, the phenotypes that Mendel\nobserved in his crosses between pea plants with differing traits are connected to the diploid genotypes of the plants in the\nP, F1, and F2 generations. We will use a second trait that Mendel investigated, seed color, as an example. Seed color is\ngoverned by a single gene with two alleles. The yellow-seed allele is dominant and the green-seed allele is recessive. When\ntrue-breeding plants were cross-fertilized, in which one parent had yellow seeds and one had green seeds, all of the F1\nhybrid offspring had yellow seeds. That is, the hybrid offspring were phenotypically identical to the true-breeding parent\nwith yellow seeds. However, we know that the allele donated by the parent with green seeds was not simply lost because\nit reappeared in some of the F2 offspring (Figure 5). Therefore, the F1 plants must have been genotypically different from\nthe parent with yellow seeds.\nThe P plants that Mendel used in his experiments were each homozygous for the trait he was studying. Diploid\norganisms that are homozygous for a gene have two identical alleles, one on each of their homologous chromosomes.\nThe genotype is often written as YY or yy, for which each letter represents one of the two alleles in the genotype. The\ndominant allele is capitalized and the recessive allele is lower case. The letter used for the gene (seed color in this case)\nis usually related to the dominant trait (yellow allele, in this case, or “Y”). Mendel’s parental pea plants always bred true\nbecause both produced gametes carried the same allele. When P plants with contrasting traits were cross-fertilized, all of\nthe offspring were heterozygous for the contrasting trait, meaning their genotype had different alleles for the gene being\nexamined. For example, the F1 yellow plants that received a Y allele from their yellow parent and a y allele from their\ngreen parent had the genotype Yy.\nFFiigguurree 55:: Phenotypes are physical expressions of traits that are\ntransmitted by alleles. Capital letters represent dominant alleles\nand lowercase letters represent recessive alleles. The phenotypic\nratios are the ratios of visible characteristics. The genotypic ratios\nare the ratios of gene combinations in the offspring, and these are\nnot always distinguishable in the phenotypes.\nLaw of Dominance\nOur discussion of homozygous and heterozygous organisms brings us to why the F1 heterozygous offspring were identical\nto one of the parents, rather than expressing both alleles. In all seven peaplant characteristics, one of the two contrasting\nalleles was dominant, and the other was recessive. Mendel called the dominant allele the expressed unit factor; the recessive\nallele was referred to as the latent unit factor. We now know that these so-called unit factors are actually genes on\n131 132 Mt Hood Community College Biology 102\nhomologous chromosomes. For a gene that is expressed in a dominant and recessive pattern, homozygous dominant and\nheterozygous organisms will look identical (that is, they will have different genotypes but the same phenotype), and the\nrecessive allele will only be observed in homozygous recessive individuals (Table 1).\nTable 1: Correspondence between Genotype and Phenotype for a Dominant Recessive Characteristic.\nHomozygous Heterozygous Homozygous\nGenotype YY Yy yy\nPhenotype yellow yellow green\nMendel’s law of dominance states that in a heterozygote, one trait will conceal the presence of another trait for the same\ncharacteristic. For example, when crossing true-breeding violet-flowered plants with true-breeding white-flowered plants,\nall of the offspring were violet-flowered, even though they all had one allele for violet and one allele for white. Rather\nthan both alleles contributing to a phenotype, the dominant allele will be expressed exclusively. The recessive allele will\nremain latent, but will be transmitted to offspring in the same manner as that by which the dominant allele is transmitted.\nThe recessive trait will only be expressed by offspring that have two copies of this allele (Figure 6), and these offspring will\nbreed true when self-crossed.\nFFiigguurree 66:: The allele for albinism,\nexpressed here in humans, is\nrecessive. Both of this child’s\nparents carried the recessive\nallele.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:4qg08nt-@8/\nCharacteristics-and-Traits  12.4 Monohybrid Cross and the Punnett Square\nWhen fertilization occurs between two true-breeding parents that differ by only the characteristic being studied, the\nprocess is called a monohybrid cross, and the resulting offspring are called monohybrids. Mendel performed seven types\nof monohybrid crosses, each involving contrasting traits for different characteristics. Out of these crosses, all of the F1\noffspring had the phenotype of one parent, and the F2 offspring had a 3:1 phenotypic ratio. On the basis of these results,\nMendel postulated that each parent in the monohybrid cross contributed one of two paired unit factors to each offspring,\nand every possible combination of unit factors was equally likely.\nThe results of Mendel’s research can be explained in terms of probabilities, which are mathematical measures of\nlikelihood. The probability of an event is calculated by the number of times the event occurs divided by the total number\nof opportunities for the event to occur. A probability of one (100 percent) for some event indicates that it is guaranteed\nto occur, whereas a probability of zero (0 percent) indicates that it is guaranteed to not occur, and a probability of 0.5 (50\npercent) means it has an equal chance of occurring or not occurring.\nTo demonstrate this with a monohybrid cross, consider the case of true-breeding pea plants with yellow versus green\nseeds. The dominant seed color is yellow; therefore, the parental genotypes were YY for the plants with yellow seeds and\nyy for the plants with green seeds. A Punnett square, devised by the British geneticist Reginald Punnett, is useful for\ndetermining probabilities because it is drawn to predict all possible outcomes of all possible random fertilization events and\ntheir expected frequencies. Figure 7 shows a Punnett square for a cross between a plant with yellow peas and one with\ngreen peas. To prepare a Punnett square, all possible combinations of the parental alleles (the genotypes of the gametes) are\nlisted along the top (for one parent) and side (for the other parent) of a grid. The combinations of egg and sperm gametes\nare then made in the boxes in the table on the basis of which alleles are combining. Each box then represents the diploid\ngenotype of a zygote, or fertilized egg. Because each possibility is equally likely, genotypic ratios can be determined from\na Punnett square. If the pattern of inheritance (dominant and recessive) is known, the phenotypic ratios can be inferred as\nwell. For a monohybrid cross of two true-breeding parents, each parent contributes one type of allele. In this case, only\none genotype is possible in the F1 offspring. All offspring are Yy and have yellow seeds.\nWhen the F1 offspring are crossed with each other, each has an equal probability of contributing either a Y or a y to\nthe F2 offspring. The result is a 1 in 4 (25 percent) probability of both parents contributing a Y, resulting in an offspring\nwith a yellow phenotype; a 25 percent probability of parent A contributing a Y and parent B a y, resulting in offspring\nwith a yellow phenotype; a 25 percent probability of parent A contributing a y and parent B a Y, also resulting in a\nyellow phenotype; and a (25 percent) probability of both parents contributing a y, resulting in a green phenotype. When\ncounting all four possible outcomes, there is a 3 in 4 probability of offspring having the yellow phenotype and a 1 in 4\nprobability of offspring having the green phenotype. This explains why the results of Mendel’s F2 generation occurred in\na 3:1 phenotypic ratio. Using large numbers of crosses, Mendel was able to calculate probabilities, found that they fit the\nmodel of inheritance, and use these to predict the outcomes of other crosses.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n135 136 Mt Hood Community College Biology 102\nFFiigguurree 77:: This Punnett square shows the\ncross between plants with yellow seeds and\ngreen seeds. The cross between the true-\nbreeding P plants produces F1 heterozygotes\nthat can be self-fertilized. The self-cross of\nthe F1 generation can be analyzed with a\nPunnett square to predict the genotypes of\nthe F2 generation. Given an inheritance\npattern of dominant-recessive, the genotypic\nand phenotypic ratios can then be\ndetermined. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:4qg08nt-@8/\nCharacteristics-and-Traits  12.5 Laws of Inheritance\nLaw of Segregation\nObserving that true-breeding pea plants with contrasting traits gave rise to F1 generations that all expressed the dominant\ntrait and F2 generations that expressed the dominant and recessive traits in a 3:1 ratio, Mendel proposed the law of\nsegregation. This law states that paired unit factors (genes) must segregate equally into gametes such that offspring have\nan equal likelihood of inheriting either factor. For the F2 generation of a monohybrid cross, the following three possible\ncombinations of genotypes result: homozygous dominant, heterozygous, or homozygous recessive. Because heterozygotes\ncould arise from two different pathways (receiving one dominant and one recessive allele from either parent), and because\nheterozygotes and homozygous dominant individuals are phenotypically identical, the law supports Mendel’s observed 3:1\nphenotypic ratio. The equal segregation of alleles is the reason we can apply the Punnett square to accurately predict the\noffspring of parents with known genotypes. The physical basis of Mendel’s law of segregation is the first division of meiosis\nin which the homologous chromosomes with their different versions of each gene are segregated into daughter nuclei.\nThis process was not understood by the scientific community during Mendel’s lifetime (Figure 8).\nFFiigguurree 88:: The first division in meiosis is shown.\nTest Cross\nBeyond predicting the offspring of a cross between known homozygous or heterozygous parents, Mendel also developed\na way to determine whether an organism that expressed a dominant trait was a heterozygote or a homozygote. Called the\ntest cross, this technique is still used by plant and animal breeders. In a test cross, the dominant-expressing organism is\ncrossed with an organism that is homozygous recessive for the same characteristic. If the dominant-expressing organism\nis a homozygote, then all F1 offspring will be heterozygotes expressing the dominant trait (Figure 9). Alternatively, if the\ndominant-expressing organism is a heterozygote, the F1 offspring will exhibit a 1:1 ratio of heterozygotes and recessive\nhomozygotes (Figure 9). The test cross further validates Mendel’s postulate that pairs of unit factors segregate equally.\nLaw of Independent Assortment\nMendel’s law of independent assortment states that genes do not influence each other with regard to the sorting of alleles\ninto gametes, and every possible combination of alleles for every gene is equally likely to occur. Independent assortment\nof genes can be illustrated by the dihybrid cross, a cross between two true-breeding parents that express different traits for\ntwo characteristics. Consider the characteristics of seed color and seed texture for two pea plants, one that has wrinkled,\ngreen seeds (rryy) and another that has round, yellow seeds (RRYY). Because each parent is homozygous, the law of\nsegregation indicates that the gametes for the wrinkled–green plant all are ry, and the gametes for the round–yellow plant\nare all RY. Therefore, the F1 generation of offspring all are RrYy (Figure 10).\nThe gametes produced by the F1 individuals must have one allele from each of the two genes. For example, a gamete could\nget an R allele for the seed shape gene and either a Y or a y allele for the seed color gene. It cannot get both an R and an r\nallele; each gamete can have only one allele per gene. The law of independent assortment states that a gamete into which\n139 140 Mt Hood Community College Biology 102\nFFiigguurree 99:: A test cross can be performed to determine\nwhether an organism expressing a dominant trait is a\nhomozygote or a heterozygote.\nFFiigguurree 1100:: A dihybrid cross in pea plants involves the genes for\nseed color and texture. The P cross produces F1 offspring that are\nall heterozygous for both characteristics. The resulting 9:3:3:1 F2\nphenotypic ratio is obtained using a Punnett square.\nan r allele is sorted would be equally likely to contain either a Y or a y allele. Thus, there are four equally likely gametes\nthat can be formed when the RrYy heterozygote is self-crossed, as follows: RY, rY, Ry, and ry. Arranging these gametes\nalong the top and left of a 4 × 4 Punnett square (Figure 10) gives us 16 equally likely genotypic combinations. From these\ngenotypes, we find a phenotypic ratio of 9 round–yellow:3 round–green:3 wrinkled–yellow:1 wrinkled–green (Figure\n10). These are the offspring ratios we would expect, assuming we performed the crosses with a large enough sample size.\nThe physical basis for the law of independent assortment also lies in meiosis I, in which the different homologous pairs\nline up in random orientations. Each gamete can contain any combination of paternal and maternal chromosomes (and\ntherefore the genes on them) because the orientation of tetrads on the metaphase plane is random (Figure 11). 12.5 Laws of Inheritance 141\nFFiigguurree 1111:: The random segregation into daughter nuclei that\nhappens during the first division in meiosis can lead to a variety of\npossible genetic arrangements.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.  OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:cUeevuaC@3/Laws-of-\nInheritance  12.6 Extensions of the Laws of Inheritance\nMendel studied traits with only one mode of inheritance in pea plants. The inheritance of the traits he studied all followed\nthe relatively simple pattern of dominant and recessive alleles for a single characteristic. There are several important modes\nof inheritance, discovered after Mendel’s work, that do not follow the dominant and recessive, single-gene model.\nAlternatives to Dominance and Recessiveness\nMendel’s experiments with pea plants suggested that: 1) two types of “units” or alleles exist for every gene; 2) alleles\nmaintain their integrity in each generation (no blending); and 3) in the presence of the dominant allele, the recessive\nallele is hidden, with no contribution to the phenotype. Therefore, recessive alleles can be “carried” and not expressed\nby individuals. Such heterozygous individuals are sometimes referred to as “carriers.” Since then, genetic studies in other\norganisms have shown that much more complexity exists, but that the fundamental principles of Mendelian genetics still\nhold true. In the sections to follow, we consider some of the extensions of Mendelism.\nIncomplete Dominance\nMendel’s results, demonstrating that traits are inherited as dominant and recessive pairs, contradicted the view at that time\nthat offspring exhibited a blend of their parents’ traits. However, the heterozygote phenotype occasionally does appear to\nbe intermediate between the two parents. For example, in the snapdragon, Antirrhinum majus (Figure 12), a cross between\na homozygous parent with white flowers (CWCW) and a homozygous parent with red flowers (CRCR) will produce\noffspring with pink flowers (CRCW). (Note that different genotypic abbreviations are used for Mendelian extensions to\ndistinguish these patterns from simple dominance and recessiveness.) This pattern of inheritance is described as incomplete\ndominance, meaning that one of the alleles appears in the phenotype in the heterozygote, but not to the exclusion of\nthe other, which can also be seen. The allele for red flowers is incompletely dominant over the allele for white flowers.\nHowever, the results of a heterozygote self-cross can still be predicted, just as with Mendelian dominant and recessive\ncrosses. In this case, the genotypic ratio would be 1 CRCR:2 CRCW:1 CWCW, and the phenotypic ratio would be 1:2:1\nfor red:pink:white. The basis for the intermediate color in the heterozygote is simply that the pigment produced by the\nred allele (anthocyanin) is diluted in the heterozygote and therefore appears pink because of the white background of the\nflower petals.\nFFiigguurree 1122:: These pink flowers of\na heterozygote snapdragon result\nfrom incomplete dominance.\n(credit:\n“storebukkebruse”/Flickr)\nCodominance\nA variation on incomplete dominance is codominance, in which both alleles for the same characteristic are simultaneously\nexpressed in the heterozygote. An example of codominance occurs in the ABO blood groups of humans. The A and B\n145 146 Mt Hood Community College Biology 102\nalleles are expressed in the form of A or B molecules present on the surface of red blood cells. Homozygotes (IAIA and IBIB)\nexpress either the A or the B phenotype, and heterozygotes (IAIB) express both phenotypes equally. The IAIB individual\nhas blood type AB. In a selfcross between heterozygotes expressing a codominant trait, the three possible offspring\ngenotypes are phenotypically distinct. However, the 1:2:1 genotypic ratio characteristic of a Mendelian monohybrid cross\nstill applies (Figure 13).\nFFiigguurree 1133:: This Punnet square\nshows an AB/AB blood type\ncross\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:4qg08nt-@8/\nCharacteristics-and-Traits  12.7 Multiple Alleles\nMendel implied that only two alleles, one dominant and one recessive, could exist for a given gene. We now know that\nthis is an oversimplification. Although individual humans (and all diploid organisms) can only have two alleles for a given\ngene, multiple alleles may exist at the population level, such that many combinations of two alleles are observed. Note\nthat when many alleles exist for the same gene, the convention is to denote the most common phenotype or genotype in\nthe natural population as the wild type (often abbreviated “+”). All other phenotypes or genotypes are considered variants\n(mutants) of this typical form, meaning they deviate from the wild type. The variant may be recessive or dominant to the\nwild-type allele.\nAn example of multiple alleles is the ABO blood-type system in humans. In this case, there are three alleles circulating\nin the population. The IA allele codes for A molecules on the red blood cells, the IB allele codes for B molecules on the\nsurface of red blood cells, and the i allele codes for no molecules on the red blood cells. In this case, the IA and IB alleles\nare codominant with each other and are both dominant over the i allele. Although there are three alleles present in a\npopulation, each individual only gets two of the alleles from their parents. This produces the genotypes and phenotypes\nshown in Figure 14. Notice that instead of three genotypes, there are six different genotypes when there are three alleles.\nThe number of possible phenotypes depends on the dominance relationships between the three alleles.\nFFiigguurree 1144:: Inheritance of the\nABO blood system in humans is\nshown.\nMultiple Alleles Confer Drug Resistance in the Malaria Parasite\nMalaria is a parasitic disease in humans that is transmitted by infected female mosquitoes, including Anopheles gambiae, and\nis characteried by cyclic high fevers, chills, flu-like symptoms, and severe anemia. Plasmodium falciparum and P. vivax are\nthe most common causative agents of malaria, and P. falciparum is the most deadly. When promptly and correctly treated,\nP. falciparum malaria has a mortality rate of 0.1 percent. However, in some parts of the world, the parasite has evolved\nresistance to commonly used malaria treatments, so the most effective malarial treatments can vary by geographic region.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n149  OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:4qg08nt-@8/\nCharacteristics-and-Traits  12.8 Sex-Linked Traits\nIn humans, as well as in many other animals and some plants, the sex of the individual is determined by sex\nchromosomes—one pair of non-homologous chromosomes. Until now, we have only considered inheritance patterns\namong non-sex chromosomes, or autosomes. In addition to 22 homologous pairs of autosomes, human females have a\nhomologous pair of X chromosomes, whereas human males have an XY chromosome pair. Although the Y chromosome\ncontains a small region of similarity to the X chromosome so that they can pair during meiosis, the Y chromosome is much\nshorter and contains fewer genes. When a gene being examined is present on the X, but not the Y, chromosome, it is\nX-linked.\nEye color in Drosophila, the common fruit fly, was the first X-linked trait to be identified. Thomas Hunt Morgan mapped\nthis trait to the X chromosome in 1910. Like humans, Drosophila males have an XY chromosome pair, and females are XX.\nIn flies the wild-type eye color is red (XW) and is dominant to white eye color (Xw) (Figure 15). Because of the location\nof the eye-color gene, reciprocal crosses do not produce the same offspring ratios. Males are said to be hemizygous, in that\nthey have only one allele for any X-linked characteristic. Hemizygosity makes descriptions of dominance and recessiveness\nirrelevant for XY males. Drosophila males lack the white gene on the Y chromosome; that is, their genotype can only be\nXWY or XwY. In contrast, females have two allele copies of this gene and can be XWXW, XWXw, or XwXw.\nFFiigguurree 1155:: In Drosophila, the\ngene for eye color is located on\nthe X chromosome. Red eye\ncolor is wild-type and is\ndominant to white eye color.\nIn an X-linked cross, the genotypes of F1 and F2 offspring depend on whether the recessive trait was expressed by the\nmale or the female in the P generation. With respect to Drosophila eye color, when the P male expresses the white-eye\nphenotype and the female is homozygously red-eyed, all members of the F1 generation exhibit red eyes (Figure 16).\nThe F1 females are heterozygous (XWXw), and the males are all XWY, having received their X chromosome from the\nhomozygous dominant P female and their Y chromosome from the P male. A subsequent cross between the XWXw female\nand the XWY male would produce only red-eyed females (with XWXW or XWXw genotypes) and both red- and white-\neyed males (with XWY or XwY genotypes). Now, consider a cross between a homozygous white-eyed female and a male\nwith red eyes. The F1 generation would exhibit only heterozygous red-eyed females (XWXw) and only white-eyed males\n(XwY). Half of the F2 females would be red-eyed (XWXw) and half would be white-eyed (XwXw). Similarly, half of the\nF2 males would be red-eyed (XWY) and half would be whiteeyed (XwY).\nDiscoveries in fruit fly genetics can be applied to human genetics. When a female parent is homozygous for a recessive\nX-linked trait, she will pass the trait on to 100 percent of her male offspring, because the males will receive the Y\nchromosome from the male parent. In humans, the alleles for certain conditions (some color-blindness, hemophilia, and\nmuscular dystrophy) are X-linked. Females who are heterozygous for these diseases are said to be carriers and may not\nexhibit any phenotypic effects. These females will pass the disease to half of their sons and will pass carrier status to half of\ntheir daughters; therefore, X-linked traits appear more frequently in males than females.\n153 154 Mt Hood Community College Biology 102\nFFiigguurree 1166:: Crosses involving sex-linked traits often give rise to\ndifferent phenotypes for the different sexes of offspring, as in the\ncase for this cross involving red and white eye color in Drosophila.\nIn the diagram, w is the white-eye mutant allele and W is the\nwild-type, red-eye allele.\nIn some groups of organisms with sex chromosomes, the sex with the non-homologous sex chromosomes is the female\nrather than the male. This is the case for all birds. In this case, sex-linked traits will be more likely to appear in the female,\nin whom they are hemizygous.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:4qg08nt-@8/\nCharacteristics-and-Traits  12.9 Linked Genes Violate the Law of Independent Assortment\nAlthough all of Mendel’s pea plant characteristics behaved according to the law of independent assortment, we now know\nthat some allele combinations are not inherited independently of each other. Genes that are located on separate, non-\nhomologous chromosomes will always sort independently. However, each chromosome contains hundreds or thousands of\ngenes, organized linearly on chromosomes like beads on a string. The segregation of alleles into gametes can be influenced\nby linkage, in which genes that are located physically close to each other on the same chromosome are more likely to be\ninherited as a pair. However, because of the process of recombination, or “crossover,” it is possible for two genes on the\nsame chromosome to behave independently, or as if they are not linked. To understand this, let us consider the biological\nbasis of gene linkage and recombination.\nHomologous chromosomes possess the same genes in the same order, though the specific alleles of the gene can\nbe different on each of the two chromosomes. Recall that during interphase and prophase I of meiosis, homologous\nchromosomes first replicate and then synapse, with like genes on the homologs aligning with each other. At this stage,\nsegments of homologous chromosomes exchange linear segments of genetic material (Figure 17). This process is called\nrecombination, or crossover, and it is a common genetic process. Because the genes are aligned during recombination,\nthe gene order is not altered. Instead, the result of recombination is that maternal and paternal alleles are combined onto\nthe same chromosome. Across a given chromosome, several recombination events may occur, causing extensive shuffling\nof alleles.\nFFiigguurree 1177:: The process of crossover, or recombination, occurs when\ntwo homologous chromosomes align and exchange a segment of\ngenetic material.\nWhen two genes are located on the same chromosome, they are considered linked, and their alleles tend to be transmitted\nthrough meiosis together. To exemplify this, imagine a dihybrid cross involving flower color and plant height in which\nthe genes are next to each other on the chromosome. If one homologous chromosome has alleles for tall plants and red\nflowers, and the other chromosome has genes for short plants and yellow flowers, then when the gametes are formed, the\ntall and red alleles will tend to go together into a gamete and the short and yellow alleles will go into other gametes. These\nare called the parental genotypes because they have been inherited intact from the parents of the individual producing\ngametes. But unlike if the genes were on different chromosomes, there will be no gametes with tall and yellow alleles and\nno gametes with short and red alleles. If you create a Punnett square with these gametes, you will see that the classical\nMendelian prediction of a 9:3:3:1 outcome of a dihybrid cross would not apply. As the distance between two genes\nincreases, the probability of one or more crossovers between them increases and the genes behave more like they are on\nseparate chromosomes. Geneticists have used the proportion of recombinant gametes (the ones not like the parents) as a\nmeasure of how far apart genes are on a chromosome. Using this information, they have constructed linkage maps of genes\non chromosomes for well-studied organisms, including humans.\nMendel’s seminal publication makes no mention of linkage, and many researchers have questioned whether he\nencountered linkage but chose not to publish those crosses out of concern that they would invalidate his independent\nassortment postulate. The garden pea has seven chromosomes, and some have suggested that his choice of seven\n157 158 Mt Hood Community College Biology 102\ncharacteristics was not a coincidence. However, even if the genes he examined were not located on separate chromosomes,\nit is possible that he simply did not observe linkage because of the extensive shuffling effects of recombination.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:cUeevuaC@3/Laws-of-\nInheritance  12.10 Epistasis\nMendel’s studies in pea plants implied that the sum of an individual’s phenotype was controlled by genes (or as he called\nthem, unit factors), such that every characteristic was distinctly and completely controlled by a single gene. In fact, single\nobservable characteristics are almost always under the influence of multiple genes (each with two or more alleles) acting in\nunison. For example, at least eight genes contribute to eye color in humans.\nIn some cases, several genes can contribute to aspects of a common phenotype without their gene products ever directly\ninteracting. In the case of organ development, for instance, genes may be expressed sequentially, with each gene adding to\nthe complexity and specificity of the organ. Genes may function in complementary or synergistic fashions, such that two or\nmore genes expressed simultaneously affect a phenotype. An apparent example of this occurs with human skin color, which\nappears to involve the action of at least three (and probably more) genes. Cases in which inheritance for a characteristic\nlike skin color or human height depend on the combined effects of numerous genes are called polygenic inheritance.\nGenes may also oppose each other, with one gene suppressing the expression of another. In epistasis, the interaction\nbetween genes is antagonistic, such that one gene masks or interferes with the expression of another. “Epistasis” is a word\ncomposed of Greek roots meaning “standing upon.” The alleles that are being masked or silenced are said to be hypostatic\nto the epistatic alleles that are doing the masking. Often the biochemical basis of epistasis is a gene pathway in which\nexpression of one gene is dependent on the function of a gene that precedes or follows it in the pathway.\nAn example of epistasis is pigmentation in mice. The wild-type coat color, agouti (AA) is dominant to solid-colored\nfur (aa). However, a separate gene C, when present as the recessive homozygote (cc), negates any expression of pigment\nfrom the A gene and results in an albino mouse (Figure 18). Therefore, the genotypes AAcc, Aacc, and aacc all produce\nthe same albino phenotype. A cross between heterozygotes for both genes (AaCc x AaCc) would generate offspring with a\nphenotypic ratio of 9 agouti:3 black:4 albino (Figure 18). In this case, the C gene is epistatic to the A gene.\nFFiigguurree 1188:: In this example of epistasis, one gene (C)\nmasks the expression of another (A) for coat color.\nWhen the C allele is present, coat color is expressed;\nwhen it is absent (cc), no coat color is expressed. Coat\ncolor depends on the A gene, which shows dominance,\nwith the recessive homozygote showing a different\nphenotype than the heterozygote or dominant\nhomozygote.\n161 162 Mt Hood Community College Biology 102\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. OpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/GFy_h8cu@10.57:cUeevuaC@3/Laws-of-\nInheritance  Genetics: Dog Coat Color\nLearning Objectives\nBy the end of this section, you will be able to:\n• Describe the molecular basis of inheritance.\n• Determine the outcome in crosses involving complete dominance.\n• Present and decipher information about inheritance using a pedigree.\nFFiigguurree 11:: Experimenting with thousands of garden peas, Johann\nGregor Mendel uncovered the fundamentals of genetics. (credit:\nmodification of work by Jerry Kirkhart)\nRemember that a trait is an aspect of the physical appearance of an organism that can vary. Organisms get their traits\nfrom proteins; proteins are produced using the information found in the organism’s DNA. Variation in the DNA between\ndifferent organisms causes the production of proteins that contain differing orders of amino acids. These proteins can have\ndifferent shapes and therefore different functions. When proteins function differently, this leads to differences in traits.\nRecall that diploid organisms have two copies of each chromosome: a pair of homologous chromosomes. The reason\nthat they have two copies is because they inherited one copy of each chromosome from each parent. Each parent donates\none haploid gamete (egg or sperm) to the reproductive process. A haploid gamete contains one copy of each chromosome\nbecause during meiosis the number of chromosomes is cut in half: the DNA is copied once and then divided twice. This\nseparation of the homologous chromosomes means that only one of the copies of the gene gets moved into a gamete.\nThe offspring are formed when that gamete unites with one from another parent and the two copies of each gene (and\nchromosome) are restored.\nA diploid organism has two copies of a given gene. The two copies may or may not encode the same version of that\ncharacteristic. For example, one individual pea plant (such as those studied by Mendel) would have two copies of the gene\nthat controls flower color. That individual could carry one version of the gene that leads to white flower color and a second\ndifferent version of that same gene that leads to violet flower color. The interaction between these two different versions\nof the same gene will lead to the visible flower color in the pea plant. Gene variations that arise by mutation and exist at the FFiigguurree 22:: A karyogram is a picture of all the chromosomes in a\ncell, organized into homologous pairs. This is a human karyogram\nwhich shows the 46 chromosomes present in diploid human\nsomatic cells.\nsame relative locations on homologous chromosomes are called alleles. Mendel examined the inheritance of genes with\njust two allele forms, but it is common to encounter more than two alleles for many genes in a natural population.\nEach individual (assuming it is a diploid organism) will have two alleles for a specific gene: one from each of its two\nparents. These two alleles are expressed and interact to produce physical characteristics. The observable traits expressed by\nan organism are referred to as its phenotype. An organism’s underlying genetic makeup, consisting of both the physically\nvisible and the non-expressed alleles, is called its genotype.\nDiploid organisms that are homozygous for a gene have two identical alleles, one on each of their homologous\nchromosomes. If the organism has two different alleles, this is referred to as heterozygous.\nThis chapter will address a simple type of inheritance: complete dominance. In this type of inheritance, there are two\nalleles: dominant and recessive. A dominant allele will completely cover up a recessive allele. This means that if one\ndominant allele is present, the organism will have the trait conferred by that allele. In order for the recessive phenotype to\nbe seen, the organism must have two recessive alleles. Just because an allele is dominant does not automatically make it\nbetter than a recessive trait. It also does not make it more common than the recessive trait. All it means for an allele to be\ndominant is that it is able to cover up the recessive allele.\nWe typically abbreviate the genotype of an organism by using single letters. The letter chosen is often the first letter\nof the dominant trait. A homozygous dominant genotype would be written AA, a heterozygous genotype as Aa, and a\nhomozygous recessive genotype as aa. Introduction to Genetics\n“Genetics” is the study of how traits are inherited.A trait is defined as a variation in the physical appearance of a heritable\ncharacteristic. It seeks to understand how traits are passed from generation to generation. Before you start learning about\nthe details of inheritance, let’s review some topics that are important in order to understand genetics.\nRecall that genes are segments of DNA that are typically several hundred or thousand bases long. Each gene directs the\nproduction of a protein through the process of protein synthesis: DNA gets transcribed to produce an mRNA; mRNA\nprovides to code for a ribosome to produce a chain of amino acids. Read this section of the book if you need to review this\ntopic: How do genes direct the production of proteins?\nThe Central Dogma – DNA is used to make RNA\nis used to make protein\nRecall that eukaryotic genes are found on chromosomes and that each eukaryotic chromosome typically contains hundreds\nor thousands of genes. In most eukaryotes, including humans and other animals, each cell contains two copies of each\nchromosome. The reason we have two copies of each gene is that we inherit one from each parent.\nIn contrast to eukaryotes, prokaryotes have one circular chromosome. This means they have one copy of each gene.\nRead this section of the book if you need to review this topic: How DNA is arranged in the cell\nThere are 23 pairs of chromosomes in a female\nhuman body cell. These chromosomes are viewed\nwithin the nucleus (top), removed from a cell during\ncell division (right), and arranged according to length\n(left) in an arrangement called a karyotype. In this\nimage, the chromosomes were exposed to fluorescent\nstains to distinguish them. (credit: “718\nBot”/Wikimedia Commons, National Human\nGenome Research)\n167 168 Mt Hood Community College Biology 102\nChromosomes are inherited by the offspring from the parents via the egg or sperm. Inside one egg or one sperm is one\ncopy of each chronometer (so 23 total in humans). When an egg is fertilized by a sperm, the resulting zygote (fertilized\negg) will contain two copies of each chromosome, just like each of its parents.\nMeiosis is the process that produces eggs and sperm. Eggs and sperm are also known as gametes. During meiosis,\none copy of each paired chromosome is moved into the gamete. Cells with one copy of each chromosome are known\nas “haploid“. This separation, or segregation, of the homologous (paired) chromosomes means also that only one of the\ncopies of the gene gets moved into a gamete.\nThe offspring are formed when that gamete unites with one from another parent and the two copies of each gene (and\nchromosome) are restored. Read this section of the book if you need more information on this topic: Overview of Meiosis\nDuring meiosis, the DNA is copied once, then the cell divides\ntwice. This produces cells with half as much genetic information as\nthe original cell (1 copy of each chromosome). These cells become\nthe sex cells (eggs or sperm). When two sex cells unite during\nfertilization, the original number of chromosomes (2 copies of each\none) is restored.\nThe offspring will receive two copies of each gene (one from each parent), but the copies are not necessarily identical.\nYou already knew this – you don’t get identical information from your mother and your father because they have different\nDNA (which gives them different traits). The different versions of one specific gene are known as alleles. As you learn\nabout genetics, you will learn about how the information from both alleles of a specific gene interact to give an individual\ntheir trait. The genetic information that an individual has is called their genotype. The genotype of an individual produces\nthe individual’s phenotype, or physical traits.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Concepts of Biology. OpenStax CNX. May 18, 2016 http://cnx.org/contents/\ns8Hh0oOc@9.10:8v2Xzdco@5/The-Structure-of-DNA Pedigrees and Punnett Squares\nPedigrees\nInheritance of a trait through generations can be shown visually using a pedigree, such as is pictured in Figure 3. Square\nshapes represent males; circles represent females. Filled-in shapes are individuals that have whatever trait is being shown in\nthe pedigree. Two individuals connected together with a horizontal line between them are the parents of the individuals\nthat are connected by vertical lines below them. Siblings are typically shown in birth order with the oldest sibling to the\nleft.\nFFiigguurree 33:: A simple pedigree. In this pedigree, the parents (at the\ntop) have produced three children: a male and two females. The\nfirst female has the condition being shown in the pedigree.\nPunnett Squares\nAs discussed above, diploid individuals have two copies of each chromosome: one from their male parent, one from their\nfemale parent. This means they have two copies of each gene. They can have two of the same alleles (homozygous) or\ntwo different alleles (heterozygous). Regardless of their genotype, they will pass one copy of each chromosome to their\noffspring. This is because meiosis produces haploid gametes that contain one copy of each chromosome. Since genes are\npresent on chromosomes, this means they will pass one copy of each gene to their offspring. That means that an offspring\ninherits one allele of each gene from each of its two parents. This is illustrated in Figure 4.\nAn easy, organized way of illustrating the offspring that can result from two specific parents is to use a Punnett square. The\ngametes that can be generated by each parent are represented above the rows and next to the columns of the square. Each\ngamete is haploid for the “A gene”, meaning it only contains one copy of that gene. In the Punnett square seen in Figure\n5, haploid eggs are above each column and haploid sperm are next to each row. When a haploid sperm and a haploid egg\n(each with 1 copy of the “A gene”) combine during the process of fertilization, a diploid offspring (with 2 copies of the A\ngene) is the result.\nA Punnett square shows the probability of an offspring with a given genotype resulting from a cross. It does not show\nactual offspring. For example, the Punnett square in Figure 5 shows that there is a 25% chance that a homozygous recessive\noffspring will result from the cross Aa x Aa. It does not mean that these parents must have 4 offspring and that they will\nhave the ratio 1 AA : 2 Aa : 1 aa. It’s just like flipping a coin: you expect 50% heads, but you wouldn’t be too surprised\n169 170 Mt Hood Community College Biology 102\nFFiigguurree 44:: Two parents who are heterozygous each pass\none chromosome / gene / allele to each offspring. Each\nresulting offspring has two of each chromosome / gene.\nThe individual can have two of the same or two\ndifferent alleles.\nFFiigguurree 55:: A Punnett square showing a cross between two\nindividuals who are both heterozygous for A.\nto see 7 heads out of 10 coin flips. Additionally, the probability does not change for successive offspring. The probability\nthat the first offspring will have the genotype “aa” is 25% and the probability of the second offspring having the genotype\n“aa” is still 25%. Again, it’s just like flipping a coin: if you flip heads the first time, that doesn’t change the probability of\ngetting heads on the next flip.\nOrganisms don’t just inherit one trait at a time, though. They inherit all their traits at once. Sometimes, we want to\ndetermine the probability of an individual inheriting two different traits. The easiest way to do this is to determine the\nprobability of the individual inheriting each trait separately, then multiply those probabilities together. An example of this\ncan be seen in Figure 6.\nAnother way of determining the probability of getting two different traits is to use a dihybrid Punnett square. Figure 7 Pedigrees and Punnett Squares 171\nFFiigguurree 66:: These two Punnett square show the cross between two\nindividuals who are both heterozygous for two different genes:\nBbAa x BbAa. We can determine the probability of an offspring\nhaving the recessive trait for “B” and the dominant trait for “A”.\nThe probability of the offspring having the recessive phenotype for\n“B” is 1/4. The probability of the offspring having the dominant\nphenotype for “A” is 3/4. 1/4 x 3/4 = 3/16.\nshows three generations of the inheritance of pea seed color and shape. Peas can be either yellow or green, and they can\nbe either round or wrinkled. These are two of the traits that Mendel studied in his work with peas. In the first generation\n(the “P” generation), two true-breeding (homozygous) individuals are crossed. Their offspring will get one allele of the\nY gene and one allele of the R gene from each parent. This means that all their offspring (the “F1” generation) will be\nheterozygous for both genes. The results (the “F2” generation) from crossing two heterozygous individuals can be seen in\nthe 4×4 Punnett square in Figure 7.\nFFiigguurree 77:: This dihybrid cross shows the expected offspring from\nthe F2 generation after crossing YYRR x yyrr. Compare the\nresults from this Punnett square to the results seen in the previous\nfigure. They match!\nThe gametes produced by the F1 individuals must have one allele from each of the two genes. For example, a gamete could\nget an R allele for the seed shape gene and either a Y or a y allele for the seed color gene. It cannot get both an R and an r\nallele; each gamete can have only one allele per gene. The law of independent assortment states that a gamete into which\nan r allele is sorted would be equally likely to contain either a Y or a y allele. Thus, there are four equally likely gametes\nthat can be formed when the RrYy heterozygote is self-crossed, as follows: RY, rY, Ry, and ry. Arranging these gametes\nalong the top and left of a 4 × 4 Punnett square (Figure 7) gives us 16 equally likely genotypic combinations. From these\ngenotypes, we find a phenotypic ratio of 9 round–yellow:3 round–green:3 wrinkled–yellow:1 wrinkled–green (Figure 7).\nThese are the offspring ratios we would expect, assuming we performed the crosses with a large enough sample size. 172 Mt Hood Community College Biology 102\nWe can look for individuals who have the recessive phenotype for Y and the dominant phenotype for R. These\nindividuals must have two little y’s and at least one big R. The possible genotypes are yyRR or yyRr. Examining the\nPunnett square in Figure 7, we can find 3 individuals with these genotypes (they are round and green). If you compare\nthe results from Figure 6 and Figure 7, you’ll see that we have arrived at the same value: 3/16! Black fur color: a dominant trait\nBlack fur color is dominant over brown\nFigure 8: This chocolate lab has two recessive alleles of the\nTYRP1 gene. (Credit: Rob Hanson; photo from Wikimedia.)\nMost of us are familiar with the labrador retriever dog breed, such as the chocolate lab seen in Figure 8. But have you\never thought about what makes this dog brown? The difference between brown and black coat color in dogs is caused by\na mutation in the TYRP1 gene. The TYRP1 gene provides instructions for making an enzyme called tyrosinase-related\nprotein 1. This enzyme is required to produce a pigment called eumelanin. Eumelanin is a dark colored pigment.\nThe TYRP1 gene is located on chromosome 11 in dogs (Parker, 2001).\nA group of scientists who were interested in determining what caused the difference between black and brown coats\nsequenced the DNA within the protein-coding region of the TYRP1 gene (Schmutz, 2002). They identified three\nvariations in the DNA making up the TYRP1 gene between brown dogs and black dogs. These variations in DNA\nsequence are examples of different alleles of the TYRP1 gene.\nTable 1: Variations in the TYRP1 allele that lead to brown color in dogs. Data from Schmutz, 2002.\nBrown\nBlack DNA\nLocation DNA Effect on protein\nsequence\nsequence\nexon 2 TGT CGT changes a cysteine amino acid to a serine\nintroduces a premature stop codon which results in 330 amino\nexon 5 CAG TAG\nacids instead of 512 amino acids in the protein\nexon 5 CCT — (deleted) deletion of a proline amino acid\nAll of these variations in the DNA sequence are predicted to cause a change in the amino acid sequence of the TYRP1\nprotein. These changes affect the production of eumelanin pigment, which is black in color. When eumelanin is not being\nproduced correctly, the dog appears brown instead of black.\nLike other diploid organisms, dogs all have two copies of the TYRP1 gene (one from their male parent, one from their\nfemale parent). Dogs that are homozygous for the black allele (dogs that have two copies of the black allele) are obviously\ngoing to be black in color. Dogs that are homozygous for the brown allele are obviously going to be brown. Dogs that\nare heterozygous (dogs that have one black allele and one brown allele) appear black. The black and brown colors do not\nblend together: the black allele covers up the brown allele. This means that the black allele is dominant over the brown\nallele. Remember that dominant alleles cover up recessive alleles. If there is one dominant allele present, the dog will appear\n173 174 Mt Hood Community College Biology 102\nblack. The brown allele is recessive to the black allele. There must be two copies of the recessive brown allele present in\norder for the dog to appear brown.\nFFiigguurree 99:: Black and brown phenotypes in labrador retrievers.\n(Credit: demealiffe; from Wikimedia)\nRemember that genotypes can be abbreviated with a single letter and that the letter which is chosen is typically the first\nletter of the dominant trait. In this case, the letter “B” is used to represent the dominant black allele, while “b” represents\na recessive brown allele.\nThe reason that the black allele is dominant over the brown allele in this specific situation is because the black allele\nproduces functional TYRP1 protein, while the brown allele does not. The presence of one functional allele produces\nenough TYRP1 protein allows the cells to produce eumelanin and appear black.\nRemember: dominant does not mean “better” or “more normal”. Black color does not confer any special\nadvantages on dogs compared to brown color. It’s just a difference.\nFFiigguurree 1100:: What alleles of TYRP1 does this black lab puppy\nhave? We can’t tell by looking at it. The puppy could be\nhomozygous (BB) or heterozygous (Bb). Since black is completely\ndominant over brown, both options would be black. (Credit: Alice\nBirkin)\nLet’s visualize the inheritance of black and brown using a pedigree. The pedigree in Figure 11 shows a litter of puppies.\nThe shaded symbol shows a brown puppy, while open symbols are black individuals.\nTo interpret this pedigree, let’s start with information that we already know:\n• Brown is recessive, which means brown individuals must have the genotype bb. In this pedigree, brown\nindividuals are filled in. Black fur color: a dominant trait 175\nFFiigguurree 1111:: An example litter of puppies. The filled-in symbol\nshows a brown individual.\n• Black is dominant, which means black individuals must have at least one B allele. Their genotype could be\neither BB or Bb. In this pedigree, black individuals are not filled in.\nFigure 12 shows the same pedigree, but with information about the individual’s genotypes filled in.\n1. The shaded individual, who is a brown female puppy, must have the genotype bb. If she had any B alleles,\nshe would be black because the black allele is dominant over the brown allele.\n2. In order for the brown puppy to have the genotype bb, she must have gotten two “b” alleles: one from each\nof her parents. We know that her parents are both black (because they are unshaded), which means they must\nhave a least one “B” allele. This means that both parents must be heterozygous: Bb.\n3. The three black puppies must have at least one “B” allele in order for them to be black in color. However, we\ncan’t tell whether they are homozygous dominant (BB) or heterozygous (Bb) since both of those genotypes\nwould result in black color. One way to represent this on a pedigree is B-, meaning that the second allele could\nbe either B or b.\nFFiigguurree 1122:: Genotypes of the individuals in this pedigree.\nWe can also show the cross between these parents as a Punnett square (Figure 13). We would expect 1/4 of the offspring\nto have the genotype bb, and that is what we see in the pedigree above. 176 Mt Hood Community College Biology 102\nFFiigguurree 1133:: The information from the pedigree shown in Figure\ncan also be shown as a Punnett square.\nHuman Connection\nA small number of mutations in the TYRP1 gene have been found to cause oculocutaneous albinism type 3. This\ncondition includes a form of albinism called rufous oculocutaneous albinism, which has been described primarily\nin dark-skinned people from southern Africa. Affected individuals have reddish-brown skin, ginger or red hair,\nand hazel or brown irises. Two TYRP1 mutations are known to cause this form of albinism in individuals from\nAfrica. One mutation replaces a protein building block (amino acid) in tyrosine-related protein 1 with a signal\nthat prematurely stops protein production. This mutation, written as Ser166Ter or S166X, affects the amino\nacid serine at protein position 166. The other mutation, written as 368delA, deletes a single DNA building\nblock from the TYRP1gene. Other alterations in this gene have been reported in a few affected people of non-\nAfrican heritage. Most TYRP1 mutations lead to the production of an abnormally short, nonfunctional version of\ntyrosinase-related protein 1. Because this enzyme plays a role in normal pigmentation, its loss leads to the changes\nin skin, hair, and eye coloration that are characteristic of oculocutaneous albinism.\nPhoto credit: Muntuwandi; from Wikipedia.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. Black fur color: a dominant trait 177\nParker HG, Yuhua X, Mellersh CS, Khan S, Shibuya H, Johnson GS, Ostrander EA. Sept 2001. Meiotic linkage mapping\nof 52 genes onto the canine map does not identify significant levels of microrearrangement. Mamm Genome. 12(9):713-8.\nSchmutz SM, Berryere TG, Goldfinch AD. 2002. TYRP1 and MC1R genotypes and their effects on coat color in dogs.\nMammalian Genome 13, 380-387.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:FtsD6vMd@3/Mendels-\nExperiments\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:sbdXt0s3@4/Laws-of-\nInheritance\nInformation about TYRP1 and oculocutaneous albinism type 3: “Tyrp1” by Genetics Home Reference: Your Guide\nto Understanding Genetic Conditions, National Institutes of Health: U.S> National Library of Medicine is in the Public\nDomain  Yellow fur color: a recessive trait\nYellow color in dogs\nLabrador retrievers don’t only come in brown and black, they also come in yellow. Yellow color in labs is caused by\nvariations in a different gene: MC1R. This gene controls the production of the melanocortin 1 receptor protein. MC1R is\nlocated on chromosome 5 in dogs (Schmutz, 2001).\nFFiigguurree 1144:: This yellow lab is producing light-colored\npheomelanin instead of dark-colored eumelanin. (Credit:\nDjmirko; from Wikimedia)\nMelanocytes make two forms of melanin, eumelanin and pheomelanin. The relative amounts of these two pigments help\ndetermine the color of an individual’s hair and skin. Individuals who produce mostly eumelanin tend to have brown or\nblack hair and dark skin that tans easily (in humans). Eumelanin also protects skin from damage caused by ultraviolet\n(UV) radiation in sunlight. Individuals who produce mostly pheomelanin tend to have red or blond hair, freckles, and\nlight-colored skin that tans poorly. Because pheomelanin does not protect skin from UV radiation, people with more\npheomelanin have an increased risk of skin damage caused by sun exposure.\nThe melanocortin 1 receptor controls which type of melanin is produced by melanocytes. When the receptor is\nactivated, it triggers a series of chemical reactions inside melanocytes that stimulate these cells to make eumelanin. If the\nreceptor is not activated or is blocked, melanocytes make pheomelanin instead of eumelanin. This means that if the receptor\nis working correctly and is turned on, dark pigment will be produced. If the receptor is not functional or is not turned on,\nlight pigment will be produced.\nSchmutz et. al. (2002) determined the DNA sequence for the MC1R gene from dogs of various colors. They determined\nthat black and brown dogs all have one allele of MC1R, while yellow and red dogs have a different allele. The allele that\nleads to yellow or red color has a premature stop codon which results in a shorter-than-normal protein. This protein would\nbe predicted to not function correctly. Remember that when the melanocortin 1 receptor is not functioning correctly,\nlight pheomelanin pigment is produced and not dark eumelanin.\nDogs that are homozygous for the functioning allele of MC1R (which would cause eumelanin to be produced) are dark\nin color. Dogs that are homozygous for the non-functioning allele (which would cause pheomelanin to be produced) are\nlight in color. Dogs that are heterozygous are dark in color. What does this tell you about which allele is dominant? If\nyou said “the dark allele is dominant because it covers up the light allele”, you’re correct. We will use “E” to represent\nthe genotype at MC1R because the dominant phenotype in this case is the production of eumelanin. Dogs that have the\n179 180 Mt Hood Community College Biology 102\nFFiigguurree 1144:: The three recognized colors of labs are\ndue to black eumelanin, brown eumelanin,\nor pheomelanin. (Credit: Erikeltic, from\nWikimedia)\ngenotype EE or Ee will produce eumelanin and be dark. Dogs that have the genotype “ee” will produce pheomelanin and\nbe light.\nFFiigguurree 1155:: In this pedigree, the shaded individual is yellow. She\ntherefore has the genotype ee and produces pheomelanin. We can’t\ntell the genotype of her mate by looking (he could be Ee or EE),\nbut since all of their puppies were dark in color, we would predict\nthat his genotype was EE. In this cross: EE x ee, 100% of the\npuppies would have the genotype Ee, so 100% of the puppies\nwould produce eumelanin instead of pheomelanin.\nThe cross shown in Figure 15 can also be shown as a Punnett square. Since we are unsure whether the male dog has the\ngenotype “EE” or “Ee”, we have to make two Punnett squares. Since all of the puppies resulting from this cross were black,\nwe would predict that the first Punnett square shows the cross. However, it is possible that the second Punnett square is\ncorrect. There are only 4 puppies, so it’s not hard to imagine that they could all be black even though the Punnett square\npredicts only 50% black. It would be comparable to flipping a coin 4 times and getting 4 heads in a row. Getting 4 heads\nin a row is less likely, but definitely possible. Yellow fur color: a recessive trait 181\nFFiigguurree 1166:: Cross from FFiigguurree 1155 shown as Punnett squares\nIt is very important to note here that yellow dogs still have the TYRP1 gene, even though they are not black or brown!\nHuman Connection\nCommon variations (polymorphisms) in the MC1R gene are associated with normal differences in skin and hair\ncolor. Certain genetic variations are most common in people with red hair, fair skin, freckles, and an increased\nsensitivity to sun exposure. These MC1R polymorphisms reduce the ability of the melanocortin 1 receptor to\nstimulate eumelanin production, causing melanocytes to make mostly pheomelanin. Although MC1R is a key gene\nin normal human pigmentation, researchers believe that the effects of other genes also contribute to a person’s hair\nand skin coloring.\nThe melanocortin 1 receptor is also active in cells other than melanocytes, including cells involved in the body’s\nimmune and inflammatory responses. The receptor’s function in these cells is unknown.\nPhoto credit: dusdin on flickr; from Wikipedia.\nResources\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:FtsD6vMd@3/Mendels-\nExperiments\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:sbdXt0s3@4/Laws-of-\nInheritance\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:zLLYW2hj@5/\nExtensions-of-the-Laws-of-Inhe 182 Mt Hood Community College Biology 102\nHuman Connection – information about MC1R: “MC1R” by Genetics Home Reference: Your Guide to Understanding\nGenetic Conditions, National Institutes of Health: U.S> National Library of Medicine is in the Public Domain\nSchmutz SM, Moker JS, Berryere TG, Christison KM, Dolf G. 2001. An SNP is used to map MC1R to dog chromosome\n5. Anim Genet. 32(1):43-4.\nSchmutz SM, Berryere TG, Goldfinch AD. 2002. TYRP1 and MC1R genotypes and their effects on coat color in dogs.\nMammalian Genome 13, 380-387. Epistasis: the relationship between black, brown, and yellow fur\nEpistasis\nDogs don’t have either the TYRP1 gene or the MC1R gene – they have both. In fact, every dog will have two copies of\nthe TYRP1 gene and two copies of the MC1R gene. Since both genes control aspects of coat color, it makes sense that\nthey interact. In fact, TYRP1 and MC1R have what is called an epistatic relationship: the action of one gene controls the\nexpression of a second gene. Another way to phrase this relationship is that the effect of one gene is dependent on another\ngene.\nRemember that TYRP1 is required for the production of eumelanin. The dominant allele of TYRP1 (B) produces black\neumelanin, while the recessive allele (b) produces brown eumelanin. However, if a dog is homozygous recessive for MC1R\n(ee), they lack the ability to produce eumelanin at all. If no eumelanin is being produced, it doesn’t matter whether it would\nhave been black or brown: there is none. This means that any dog that is homozygous recessive for MC1R will appear\nyellow regardless of its genotype at TYRP1. These two genes are epistatic: the action of MC1R controls the expression of\nTYRP1. The effect of TYRP1 is dependent on MC1R.\nIf a dog has at least one dominant functioning allele of MC1R, then its genotype at TYRP1 can be seen. If the dog has\nat least one dominant allele of TYRP1, it will appear black. If it has two recessive alleles, it will appear brown.\nFFiigguurree 1177:: Genotypes for TYRP1 (B) and MC1R (E) that lead\nto the three recognized colors of labs. (Credit EArellano, from\nWikimedia)\nA pedigree can be used to show the inheritance of two different genes such as TYRP1 and MC1R.\nFFiigguurree 1188:: In this pedigree, a cross between an individual who is\nheterozygous for both MC1R and TYRP1 and an individual\nwho has the genotype “Bbee”is shown. Black individuals are\nshaded black, yellow individuals are shaded yellow, and brown\nindividuals are shaded grey. The 6 different possible genotypes are\neach shown as one offspring. This does not give you any\ninformation about the probability of getting a certain genotype of\noffspring – it gives you the actual number of offspring observed\nand their traits.\n183 184 Mt Hood Community College Biology 102\nPunnett squares can also be used to show this cross. If the probability of inheriting one trait is multiplied by the probability\nof inheriting the second trait, the overall probability of getting any given offspring can be determined.\nFFiigguurree 1199:: These two Punnett squares can be used to determine the results of a cross between\nthese individuals: Bbee x BbEe. If you wanted to determine the probability of getting a brown\ndog, you would multiply the probability of getting bb by the probability of having at least one\ndominant E. That would equal 1/4 x 1/2 = 1/8. This gives you the probability of getting a\nbrown dog, but doesn’t tell you anything about the number of brown dogs actually observed.\nHuman Connection\nIndividuals who have albinism lack the ability to produce any pigment. If no pigment is being produced, the color\nthat the pigment would have been is unimportant. The effect of the pigment genes is controlled by the gene that\nallows pigment to be produced. This is an example of epistasis.\nAlbinism can occur in humans (see the section on TYRP1) as well as other animals, such as the squirrel seen\nbelow.\nPhoto credit: Stephenkniatt from Wikipedia.\nReferences:\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:zLLYW2hj@5/\nExtensions-of-the-Laws-of-Inhe\nSchmutz SM, Berryere TG, Goldfinch AD. 2002. TYRP1 and MC1R genotypes and their effects on coat color in dogs.\nMammalian Genome 13, 380-387. Brindle color: partial dominance and epistasis\nBrindle coloration is caused by different alleles at the “K locus”, which is probably a gene called ASIP that controls pigment\nswitching (Ciampolini, 2013). There are three alleles of the K locus: KB, kbr, and ky (Kerns, 2007). The KB allele is\ndominant over the other two alleles and produces solid black color. kbr produces the brindle color pattern and is dominant\nover the ky allele. This means that dogs with the genotype kbrkbr or kbrky will have the brindle color pattern. Dogs with\nthe genotype kyky are yellow in color.\nFFiigguurree :: This boxer shows the brindle color pattern, which looks\nsort of like tiger stripes. (Credit: Steve Henderson Location:\nMemphis, TN)\nThe K locus and MC1R (which controls the difference between dark eumelanin and light pheomelanin production) have\nan epistatic relationship. If a dog has two recessive alleles for MC1R and is therefore unable to make eumelanin, the dog\nwill appear yellow regardless of its genotype at the K locus.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nCiampolini R, Cecchi F, Spaterna A, Bramante A, Bardet SM, Oulmouden A. 2013. Characterization of different\n5′-untranslated exons of the ASIP gene in black-and-tan Doberman Pinscher and brindle Boxer dogs. Anim Genet.\n44(1):114-7.\nKerns JA, Cargill EJ, Clark LA, Candille SI, Berryere TG, Olivier M, Lust G, Todhunter RJ, Schmutz SM, Murphy\nKE, Barsh GS. 2007. Linkage and segregation analysis of black and brindle coat color in domestic dogs. Genetics.\n176(3):1679-89.\n185  Incomplete dominance: when traits blend\nFlower color in snapdragons\nMendel’s results in crossing peas, black vs brown fur color, and eumelanin production vs pheomelanin production all\ndemonstrate traits are inherited as dominant and recessive. This contradicts the historical view that offspring always\nexhibited a blend of their parents’ traits. However, sometimes heterozygote phenotype is intermediate between the two\nparents. For example, in the snapdragon, Antirrhinum majus (Figure 20), a cross between a homozygous parent with white\nflowers (CW CW) and a homozygous parent with red flowers (CR CR) will produce offspring with pink flowers (CR CW)\n(Figure 21).\nFFiigguurree 2200:: These pink flowers of a\nheterozygote snapdragon result from\nincomplete dominance. (credit:\n“storebukkebruse”/Flickr)\nNote that different genotypic abbreviations are used to distinguish these patterns from simple dominance and recessiveness.\nW\nThe abbreviation C can be read as “at the flower color gene (C), the white allele is present.”\nThis pattern of inheritance is described as incomplete dominance, meaning that neither of the alleles is completely\ndominant over the other: both alleles can be seen at the same time. The allele for red flowers is incompletely dominant\nover the allele for white flowers. Red + white = pink. The results of a cross where the alleles are incompletely dominant\ncan still be predicted, just as with complete dominant and recessive crosses. Figure 22 shows the results from a cross\nbetween two heterozygous individuals: CR CW x CR CW . The expected offspring would have the genotypic ratio 1\nCR CR:2 CR CW:1 CW CW, and the phenotypic ratio would be 1:2:1 for red:pink:white. The basis for the intermediate color\nin the heterozygote is simply that the pigment produced by the red allele (anthocyanin) is diluted in the heterozygote and\ntherefore appears pink because of the white background of the flower petals.\nStraight, curly, and wavy hair in dogs\nAnother example of incomplete dominance is the inheritance of straight, wavy, and curly hair in dogs. The KRT71 gene is\nused to synthesize the keratin 71 protein. Genes in the KRT family provide instructions for making proteins called keratins.\nKeratins are a group of tough, fibrous proteins that form the structural framework of epithelial cells, which are cells that\n187 188 Mt Hood Community College Biology 102\nFFiigguurree 2211:: A cross between a red and white snapdragon will yield\n100% pink offspring.\nFFiigguurree 2222:: The results of crossing two pink snapdragons.\nFFiigguurree 2233:: The wavy hair on this labradoodle is caused by\nincomplete dominance. (Credit: Localpups, Flickr) Incomplete dominance: when traits blend 189\nline the surfaces and cavities of the body. Epithelial cells make up tissues such as the hair, skin, and nails. These cells also\nline the internal organs and are an important part of many glands.\nKeratins are best known for providing strength and resilience to cells that form the hair, skin, and nails. These proteins\nallow tissues to resist damage from friction and minor trauma, such as rubbing and scratching. Keratins are also involved in\nseveral other critical cell functions, including cell movement (migration), regulation of cell size, cell growth and division\n(proliferation), wound healing, and transport of materials within cells. Different combinations of keratin proteins are found\nin different tissues.\nThe mutation which causes curly hair in dogs, such as the labradoodle seen in Figure 23, is in exon 2 of the gene and\nis predicted to substantially disrupt the structure of the keratin 71 protein (Cadieu, 2009). This change in protein shape\nprevents the keratin proteins from interacting together correctly within the hair, altering the structure of the hair and\nresulting in a curly coat (Runkel, 2006).\nWhen a dog has two curly alleles (KCKC), it has a very curly coat, such as on the poodle in Figure 24. A dog with two\nstraight alleles (K+K+) has a straight coat. Dogs that are heterozygous (K+KC) have an intermediate or wavy coat like the\nlabradoodle in Figure 23.\nFFiigguurree 2244:: This poodle has two copies of the curly\nC C\nallele of the KRT71 gene (K K ). Compare his\ncurly hair to the wavy hair of the labradoodle in\n+ C\nFigure 23. The labradoodle is heterozygous (K K ).\n(Credit B. Schoener; From Wikimedia)\nHuman Connection – Blood Type\nBlood is classified into different groups according to the presence or absence of molecules called antigens on the\nsurface of every red blood cell in a person’s body. Antigens determine blood type and can either be proteins or\ncomplexes of sugar molecules (polysaccharides). The genes in the blood group antigen family provide instructions\nfor making antigen proteins. Blood group antigen proteins serve a variety of functions within the cell membrane\nof red blood cells. These protein functions include transporting other proteins and molecules into and out of the\ncell, maintaining cell structure, attaching to other cells and molecules, and participating in chemical reactions.\nThere are 29 recognized blood groups, most involving only one gene. Variations (polymorphisms) within the\ngenes that determine blood group give rise to the different antigens for a particular blood group protein. For\nexample, changes in a few DNA building blocks (nucleotides) in the ABO gene give rise to the A, B, and O blood 190 Mt Hood Community College Biology 102\ntypes of the ABO blood group. The changes that occur in the genes that determine blood group typically affect\nonly blood type and are not associated with adverse health conditions, although exceptions do occur.\nThe A and B alleles are codominant, which is similar to incomplete dominance in that heterozygotes have an\nintermediate phenotype. If both the A and B alleles are present, both will be seen in the phenotype. The O allele is\nrecessive to both A and B.\nPhoto credit: InvictaHOG, from Wikipedia.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nCadieu E, Neff MW, Quignon P, Walsh K, Chase K, Parker HG, Vonholdt BM, Rhue A, Boyko A, Byers A, Wong\nA, Mosher DS, Elkahloun AG, Spady TC, André C, Lark KG, Cargill M, Bustamante CD, Wayne RK, Ostrander EA.\n2009. Coat variation in the domestic dog is governed by variants in three genes. Science. 326(5949):150-3.\nRunkel F, Klaften M, Koch K, Böhnert V, Büssow H, Fuchs H, Franz T, Hrabé de Angelis M. 2006. Morphologic\nand molecular characterization of two novel Krt71 (Krt2-6g) mutations: Krt71rco12 and Krt71rco13. Mamm Genome.\n17(12):1172-82.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:zLLYW2hj@5/\nExtensions-of-the-Laws-of-Inhe\n“Blood Group Antigens” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National\nInstitutes of Health: U.S> National Library of Medicine is in the Public Domain\n“Keratins” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National Institutes of\nHealth: U.S> National Library of Medicine is in the Public Domain White spotting: When there's more than two alleles\nSo far, we have discussed genes which have only two alleles. However, that is not always the case: there can be more than\ntwo alleles for a given gene. One example is the MITF gene, which is the major gene that controls white spotting in\ndogs. This protein is required for the migration and survival of melanocytes into the skin during development. If it is not\nfunctional, it impairs the ability of the skin to make pigment, thus “covering up” the effect of other color genes. There are\nthought to be at least four alleles that can contribute (Karlsson, 2007). Depending on which alleles are present in a dog, the\namount of white can vary from none (a solid-colored dog) to mostly white (Table 2 and Figure 24).\nTable 2: Combinations of different alleles for MITF result in different amounts of white present in the coat.\nAlleles Amount of white\nSS None (solid colored)\nSsi Small amounts of white possible on chin, chest, feet, and tail tip\nSsp Pied markings where the coat is more than 50% colored, with white on the face, chest, feet, collar, underbelly, and tail tip\nsisp Approximately even amounts of color and white\nsise More than 50% white with irregular splashes of color\nsese Mostly white with only minimal areas of color, perhaps on one or both ears, an eye patch, or a spot near the tail\nFFiigguurree 2244:: These dogs have different combinations of alleles of the\nMITF gene. The first dog probably has the genotype “SS”; the\np\ndog in the center is likely “Ss “; the dog on the right is likely\nee\n“ss“. (Credits: Funny black dog by X posid from\nPublicdomainpictures. A black and white dog by Petr Kratochvil\nfrom Free stock photos. White dog with black ears by RetyiRetyi\nfrom Pixabay.)\nHuman Connection – Blood Type\nHuman blood type was discussed in the previous section. You may remember that there are three alleles for the\nABO gene: A, B, and O. A and B are codominant, meaning that if both alleles are present, both will be seen in the\nphenotype. A person with type AB blood has one A allele and one B allele.\nO is recessive to A and B. A person with the genotype AO will have Type A blood. A person with the genotype\nBO will have type B blood. Type O blood results from two O alleles.\n191 192 Mt Hood Community College Biology 102\nPhoto credit: Kalaiarasy, from Wikipedia.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nKarlsson EK, Baranowska I, Wade CM, Salmon Hillbertz NH, Zody MC, Anderson N, Biagi TM, Patterson N,\nPielberg GR, Kulbokas EJ 3rd, Comstock KE, Keller ET, Mesirov JP, von Euler H, Kämpe O, Hedhammar A, Lander ES,\nAndersson G, Andersson L, Lindblad-Toh K. 2007. Efficient mapping of mendelian traits in dogs through genome-wide\nassociation. Nat Genet. 39(11):1321-8. Hemophilia: a sex-linked disorder\nSo far, all the genes we have discussed have had two copies present in all individuals. This is because the individual inherited\none from the male parent’s haploid gamete and one from the female parent’s haploid gamete. The two gametes came\ntogether during fertilization to produce a diploid individual. There is, however, one exception to this: genes which are\npresent on the sex chromosomes.\nIn humans, as well as in many other animals and some plants, the sex of the individual is determined by sex\nchromosomes – one pair of non-homologous chromosomes. Until now, we have only considered inheritance patterns\namong non-sex chromosomes, or autosomes. In addition to 22 homologous pairs of autosomes, human females have a\nhomologous pair of X chromosomes, whereas human males have an XY chromosome pair. Although the Y chromosome\ncontains a small region of similarity to the X chromosome so that they can pair during meiosis, the Y chromosome is much\nshorter and contains fewer genes. When a gene being examined is present on the X, but not the Y, chromosome, it is\nX-linked.\nThe X chromosome is one of two sex chromosomes. Humans and most mammals have two sex chromosomes, the X\nand Y. Females have two X chromosomes in their cells, while males have X and Y chromosomes in their cells. Egg cells\nall contain an X chromosome, while sperm cells contain an X or a Y chromosome. This arrangement means that during\nfertilization, it is the male that determines the sex of the offspring since the female can only give an X chromosome to the\noffspring.\nFFiigguurree 2244:: A diagram showing the autosomal and sex\nchromosomes. Remember that in a diploid cell, there would be two\ncopies of each autosomal chromosome present. (Credit: Darryl\nLega, NHGRI)\nMost sex-linked genes are present on the X chromosome simply because it is much larger than the Y chromosome. The\nX chromosome spans about 155 million DNA base pairs and represents approximately 5 percent of the total DNA in\ncells. The X chromosome likely contains 800 to 900 genes. In contrast, the Y chromosome has approximately 59 million\nbase pairs and only 50-60 genes. Sex is determined by the SRY gene, which is located on the Y chromosome and is\nresponsible for the development of a fetus into a male. This means that the presence of a Y chromosome is what causes a\nfetus to develop as male. Other genes on the Y chromosome are important for male fertility.\nHemophilia is a bleeding disorder that slows the blood clotting process. People with this condition experience prolonged\nbleeding or oozing following an injury, surgery, or having a tooth pulled. In severe cases of hemophilia, continuous\nbleeding occurs after minor trauma or even in the absence of injury (spontaneous bleeding). Serious complications can\nresult from bleeding into the joints, muscles, brain, or other internal organs. Milder forms of hemophilia do not necessarily\ninvolve spontaneous bleeding, and the condition may not become apparent until abnormal bleeding occurs following\nsurgery or a serious injury.\nThe major types of this condition are hemophilia A (also known as classic hemophilia or factor VIII deficiency)\n193 194 Mt Hood Community College Biology 102\nand hemophilia B (also known as Christmas disease or factor IX deficiency). Although the two types have very similar signs\nand symptoms, they are caused by mutations in different genes.\nHemophilia A and hemophilia B are inherited in an X-linked recessive pattern. The genes associated with these\nconditions are located on the X chromosome, which is one of the two sex chromosomes. In males (who have only one X\nchromosome), one altered copy of the gene in each cell is sufficient to cause the condition. In females (who have two X\nchromosomes), a mutation would have to occur in both copies of the gene to cause the disorder. Because it is unlikely that\nfemales will have two altered copies of this gene, it is very rare for females to have hemophilia. A characteristic of X-linked\ninheritance is that fathers cannot pass X-linked traits to their sons.\nFFiigguurree 2255:: X-linked recessive inheritance. (Credit: U.S. National\nLibrary of Medicine)\nFFiigguurree 2255:: If a carrier female and a normal male produce\noffspring, there is a 25% total chance that they will have a child\nwith hemophilia. None of their daughters will have the disease\n(although all will be carriers). Half their sons will be\nhemophiliacs.\nIn X-linked recessive inheritance, a female with one altered copy of the gene in each cell is called a carrier. Carrier\nfemales have about half the usual amount of coagulation factor VIII or coagulation factor IX, which is generally enough\nfor normal blood clotting. However, about 10 percent of carrier females have less than half the normal amount of one of\nthese coagulation factors; these individuals are at risk for abnormal bleeding, particularly after an injury, surgery, or tooth\nextraction.\nColorblindness is another example of a sex-linked trait in humans. The genes that produce the photopigments necessary\nfor color vision are located on the X chromosome. If one of these genes is not functional because it contains a harmful Hemophilia: a sex-linked disorder 195\nmutation, the individual will be colorblind. Men are much more likely than women to be colorblind: up to 100 times more\nmen than women have various types of colorblindness (http://www.colour-blindness.com/general/prevalence/).\nFFiigguurree 2266:: A test image for color-blindness as seen by someone\nwith normal color vision and several types of colorblindness.\n(Credit: Sakurambo)\nReferences:\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOpenStax, Biology. OpenStax CNX. May 27, 2016 http://cnx.org/contents/s8Hh0oOc@9.10:zLLYW2hj@5/\nExtensions-of-the-Laws-of-Inhe\n“X chromosome” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National Institutes\nof Health: U.S> National Library of Medicine is in the Public Domain\n“Y chromosome” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National Institutes\nof Health: U.S> National Library of Medicine is in the Public Domain\n“Hemophilia” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National Institutes of\nHealth: U.S> National Library of Medicine is in the Public Domain  Overall phenotypes: putting it all together\nNone of the genes discussed in these sections occur in isolation: one individual dog would have all the genes for color, hair\nstructure, and hemoglobin (dogs can get hemophilia too). Genes interact together to produce the overall phenotype of the\nindividual.\nExample 1: Sugar\nFor example, look at Sugar in Figure 26. She has short hair that is mostly white. The colored portion of her hair is the\ntiger-striped pattern termed “brindle.”\nFFiigguurree 2266:: Sugar has short hair with colored\nspots. (Credit: Lisa Bartee)\nThe difference between short and long hair in dogs is caused by different alleles of a gene called FGF5. This gene produces\na protein that is important in regulating the hair growth cycle. When the protein doesn’t function correctly, the growth\nphase of the hair cycle is longer, resulting in long hair. Short hair is the dominant trait. Since Sugar has short hair, we\nknow she has at least one dominant allele of FGF5. We can use the letter “S” for short hair. Sugar’s genotype for FGF5 is\ntherefore “S-“, meaning she has one dominant allele and we can’t tell by looking at her what her second allele is.\nSugar’s hair is also straight, which means that she has two straight alleles of KRT71. Her genotype would be K+K+.\nSugar is more than 50% white with irregular splashes of color, which means that her genotype for MITF (the gene that\ncontrols white spotting) is sise.\nThe brindle pattern is caused by the kbr allele at the K locus. Sugar can’t have the KB allele or she would have solid color\ninstead of the brindle pattern because KB is dominant over kbr and ky. She could have either the genotype kbrkbr or kbrky,\nsince the kbr allele is dominant over the yellow allele (ky).\nSugar has black eumelanin pigment in her hair and nose. This means she has the dominant phenotype for TYPR1, so her\ngenotype would be “B-“. Because she has eumelanin and not pheomelanin in her coat, she has the dominant phenotype\nfor MC1R, so her genotype would be “E-“.\nSugar is a female dog who does not have hemophilia. This means that her genotype would be either XHXH or XHXh.\nPutting all these together, we could say that Sugar’s overall coat genotype is S- K+K+ sise B- E- XHX–\nWe could potentially determine some of the unknown alleles in her genotype if we knew anything about her parents,\n197 198 Mt Hood Community College Biology 102\nbut Sugar was adopted from the Multnomah County Animal Shelter after being picked up as a stray. Therefore, her\nancestry is unknown.\nExample 2: Rags\nFFiigguurree 2277:: Rags is similar in color to Sugar, but has a very\ndifferent fur type. (Credit: Lisa Bartee)\nRags has “furnishings”, a term used to describe his beard and mustache. Furnishings are caused by a mutation in the RSPO2\ngene. This gene produces a protein that is involved in establishing hair follicles. The allele that leads to furnishings is\ndominant over the allele for no furnishings. Rags must therefore have the genotype “F-” at RSPO2. This allele also causes\nthe long-ish hair on his legs and tail.\nGene Genotype Phenotype\nRSPO2 FF or Ff has furnishings\nshort fur (his longer fur is caused by the furnishings\nFGF5 SS or Ss\nallele)\nKRT71 K+K+ straight fur\nMITF sise more than 50% white\nKBKB, KBkbr, or\nK locus KBky Solid color, not brindle or yellow.\nTYRP1 BB or Bb Produces black eumelanin, not brown\nMC1R EE or Ee Produces eumelanin instead of pheomelanin\nF8 XHY Male, no hemophilia Overall phenotypes: putting it all together 199\nExample 3: Black poodle\nFigure : Black poodle. (Credit: B. Schoener from\nWikimedia)\nGene Genotype Phenotype\nRSPO2 ff no furnishings\nFGF5 ss long fur\nc c\nKRT71 K K curly fur\nMITF SS entirely solid color\nK locus KBKB, KBkbr, or KBky Solid color, not brindle or yellow.\nTYRP1 BB or Bb Produces black eumelanin, not brown\nMC1R EE or Ee Produces eumelanin instead of pheomelanin\nExample 4: Golden Retriever\nFFiigguurree :: Golden Retriever. (Credit: Dirk Vorderstraße) 200 Mt Hood Community College Biology 102\nGene Genotype Phenotype\nRSPO2 ff no furnishings\nFGF5 ss long fur\n+ +\nKRT71 K K straight fur\nMITF SS entirely solid color\nKBKB, KBkbr, or\nK locus KBky Solid color, not brindle or yellow.\nProduces black eumelanin, not brown (seen in the\nTYRP1 BB or Bb\nnose)\nProduces pheomelanin instead of eumelanin, so\nMC1R ee\nappears yellow\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax. Additional complexity\nFigure 29: An English Cocker Spaniel. (Credit eNil)\nWe haven’t exhaustively discussed all the genes that can affect dog appearance. For example, what gene (or genes) causes\nthe English Springer Spaniel in Figure 29 to be red? What gene(s) cause it to be speckled on it’s back? Or lead to its\nfreckles? There are estimated to be about 19,000 genes in the dog genome (Ostrander, 2005). The interactions of all these\ngenes together lead to the overall phenotype of one individual dog.\nIf you’re interested in learning more about the genes that are involved in the appearance of dogs, check out the Dog\nCoat Color Genetics website at http://www.doggenetics.co.uk.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\nOstrander EA, Wayne RK. 2005. The Canine Genome. Genome Res. 15: 1706-1716.\n201  It's not all in the genes\nNot all traits are directly caused by DNA alone. The environment also plays a large role in shaping an individual’s traits.\nSome examples can be seen below.\n• Height and weight: A number of genes interact to determine the general height and weight that a person will\nhave. But the environment has a major influence as well. If an individual is malnourished, their growth may be\nslowed and they may be smaller than they would have been if they had gotten enough food. In contrast, if a\nperson consumes more calories than they need, their weight will likely increase regardless of their genetics.\n• Fingerprints: the general characteristics of a person’s fingerprints are determined by genetics, but the specific\npattern is generated randomly during development. Identical twins typically have fingerprints that are similar,\nbut not identical.\n• Intelligence: Like most aspects of human behavior and cognition, intelligence is a complex trait that is\ninfluenced by both genetic and environmental factors. Roughly 50% of a person’s IQ appears to be determined\nby genetic factors. Factors related to a child’s home environment and parenting, education and availability of\nlearning resources, and nutrition, among others, also contribute to intelligence. A person’s environment and\ngenes influence each other, and it can be challenging to tease apart the effects of the environment from those of\ngenetics. For example, if a child’s IQ is similar to that of his or her parents, is that similarity due to genetic\nfactors passed down from parent to child, to shared environmental factors, or (most likely) to a combination of\nboth? It is clear that both environmental and genetic factors play a part in determining intelligence.\n• Cancer Risk: For example, a person could inherit a mutation in the BRCA1 gene, which increases the risk of\ndeveloping breast or ovarian cancer. Researchers have identified more than 1,800 mutations in\nthe BRCA1 gene. Most BRCA1 gene mutations lead to the production of an abnormally short version of the\nBRCA1 protein or prevent any protein from being made from one copy of the gene. As a result, less of this\nprotein is available to help repair damaged DNA or fix mutations that occur in other genes. As these defects\naccumulate, they can trigger cells to grow and divide uncontrollably to form a tumor. These mutations are\npresent in every cell in the body and can be passed from one generation to the next. As a result, they are\nassociated with cancers that cluster in families. However, not everyone who inherits a mutation in\nthe BRCA1 gene will develop cancer. Other genetic, environmental, and lifestyle factors also contribute to a\nperson’s cancer risk.\n• In contrast, cancer can be caused by purely environmental factors. According to the CDC, cigarette smoking is\nthe number one risk factor for lung cancer. In the United States, cigarette smoking is linked to about 90% of\nlung cancers and people who smoke are 15 to 30 times more likely to get lung cancer or die from lung cancer\nthan people who do not smoke. Radon exposure also increases the likelihood that a person will develop lung\ncancer.\nReferences\nUnless otherwise noted, images on this page are licensed under CC-BY 4.0 by OpenStax.\n“BRCA1” by Genetics Home Reference: Your Guide to Understanding Genetic Conditions, National Institutes of\nHealth: U.S> National Library of Medicine is in the Public Domain\n203 204 Mt Hood Community College Biology 102\nFFiigguurree 3300:: The colors on the poodle seen in this figure have no\nrelationship to his DNA: he was dyed for a parade. (Credit:\nskeeze)\n“Is intelligence determined by genetics?” by Genetics Home Reference: Your Guide to Understanding Genetic\nConditions, National Institutes of Health: U.S> National Library of Medicine is in the Public Domain"
}