{
    "text": " Applied Human Neuroanatomy About this Book\nThis is an open textbook. That means that this book is freely available and you are\nwelcome to use, adapt, and share it with attribution according to the Creative Commons\nAttribution International 4.0 license (CC BY 4.0).\nInstructors and students reviewing, adopting, or adapting this textbook are encouraged\nto provide feedback (or report errors) online at: https://bit.ly/feedback-applied-human-\nneuroanatomy. Applied Human Neuroanatomy\nMichael F. Nolan\nJohn P. McNamara\nVirginia Tech Carilion School of Medicine\nin association with Virginia Tech Publishing\nBlacksburg, VA\nA free version of this book can be downloaded from:\nhttps://doi.org/10.21061/applied-human-neuroanatomy Cover photos by Ryan Anderson, Virginia Tech Carilion School of Medicine. We wish to thank Ryan\nAnderson, VTCSOM Photo and Video Communications Manager, for the book cover photos, and Kelsey\nSellers, VTCSOM Anatomy Laboratory Program Assistant Manager, for her time and permission to use\nher photos for the book cover.\nCopyright © 2022 by Michael F. Nolan and John P. McNamara\nFirst published in 2022 by the Virginia Tech Carilion School of Medicine in association with Virginia Tech\nPublishing\nVirginia Tech Carilion School of Medicine\n2 Riverside Circle\nRoanoke, VA 24016 USA\nVirginia Tech Publishing\nUniversity Libraries at Virginia Tech\n560 Drillfield Drive\nBlacksburg, VA 24061 USA\nThis work is licensed under the Creative Commons Attribution 4.0 International License. To view a copy\nof this license, visit http://creativecommons.org/licenses/by/4.0/ or send a letter to Creative Commons, PO\nBox 1866, Mountain View, CA, 94042, USA. Note to users: This work may contain components (e.g.,\nphotographs, illustrations, or quotations) not covered by the license. Every effort has been made to\nidentify these components but ultimately it is your responsibility to independently evaluate the copyright\nstatus of any work or component part of a work you use, in light of your intended use. Brand names,\ntrademarks, and service marks in this book are legally protected and should not be used without prior\nauthorization by their owners. Their inclusion in this book is for analytical, illustrative and pedagogical\npurposes only.\nCataloging-in-Publication Data\nNames: Nolan, Michael F., author | McNamara, John P., author.\nTitle: Applied Human Neuroanatomy / Michael F. Nolan and John P. McNamara.\nDescription: Roanoke, VA : Virginia Tech Carilion School of Medicine in association with Virginia Tech\nPublishing, 2022. | Summary: “The clinical assessment of neurologic function is often viewed as an\nexercise involving difficult to master techniques that frequently generate difficult to interpret findings. The\nauthors argue that the neurologic examination is a reasonable and logical exercise involving the clinical\napplication of basic principles of neuroanatomy and neurophysiology.” – Preface.\nIdentifiers: ISBN: 978-1-957213-32-3 (PDF) | ISBN: 978-1-957213-94-1 (pbk) |\nDOI: https://doi.org/10.21061/ applied-human-neuroanatomy\nSubjects: HUMAN ANATOMY / Laboratory manuals. | HUMAN ANATOMY / Problems and Exercises. Table of Contents\nPreface ................................................................................................................ vii\nIntroduction ...........................................................................................................1\nHow to use the Manual ..........................................................................................2\nSensory Systems\nAnterolateral System ..................................................................................3\nLemniscal System ......................................................................................8\nCortical Sensory Functions ....................................................................... 15\nMotor Systems\nMotor System (Strength) .......................................................................... 18\nCoordination, Station, and Gait................................................................. 26\nGait ........................................................................................................... 33\nReflexes\nReflexes (including Muscle Tone) ............................................................. 39\nCranial Nerves\nOlfactory Nerve ......................................................................................... 46\nVisual System and Pupillary Reflexes ...................................................... 48\nOcular Motor Nerves ................................................................................ 55\nTrigeminal Nerve ...................................................................................... 62\nFacial Nerve ............................................................................................. 67\nCochlear Nerve ......................................................................................... 72\nVestibular Nerve ....................................................................................... 77\nGlossopharyngeal and Vagus Nerves ...................................................... 82\nAccessory Nerve ...................................................................................... 87\nHypoglossal Nerve ................................................................................... 89\nMental Status\nConsciousness ......................................................................................... 91\nAttention ................................................................................................... 95\nOrientation ................................................................................................ 97\nLanguage Function ................................................................................... 99\nLearning and Memory ............................................................................. 104\nCognitive Function .................................................................................. 108\nAnswer Key ....................................................................................................... 111  Preface\nThe clinical assessment of neurologic function is often viewed as an exercise involving\ndifficult to master techniques that frequently generate difficult to interpret findings. We\nwould like to argue an alternative proposition; that the neurologic examination is a\nreasonable and logical exercise involving the clinical application of basic principles of\nneuroanatomy and neurophysiology. One of our goals in developing this manual is to\nconvince the reader of the truth of this perspective.\nMichael F. Nolan, Ph.D., P.T.\nJohn P. McNamara, M.S., D.C.\nvi  Introduction\nThis manual is comprised of two types of learning activities: free response fill-in-the-\nblank questions focused of the facts and principles of neuroanatomy and\nneurophysiology that underpin the neurologic examination and specifically developed\nexercises that demonstrate how the facts and principles are related to the particular\ntests and procedures that comprise the neurologic examination. Free response\nquestions form the bulk of the Neuroscience Review section of each chapter and are\nintended as a review of information previously or concurrently being learned regarding\nthe structure, function and organization of the nervous system. Some questions focus\non anatomical or physiological facts and relationships that help explain why certain\ntechniques are performed as they are, such as why non-nociceptive tactile stimuli are\nrequired in order to activate nerve impulse transmission in the lemniscal system. Other\nquestions are intended to revisit facts and concepts that are needed to properly interpret\nthe elicited findings.\nThe Application Exercises of each chapter are designed to demonstrate how\nneuroanatomical and neurophysiological information is used in the design of particular\nclinical tests of neurologic function. The application exercises are also intended to help\nusers learn how to perform and become comfortable with the various clinical maneuvers\nand tests that comprise the routine neurologic examination. An important outcome of\nperforming these exercises is that, as a member of a learning group, each individual\nhas the opportunity to experience the neurologic examination from the point of view of\nthe subject (patient) – an experience that arguably provides insight and understanding\nthat can be gained in no other way.\nThe questions and exercises in the manual are designed as group learning\nexercises that might complement and reinforce learning acquired in more traditionally\nstructured courses dealing with the clinical examination of a patient. The “group activity”\napproach, in which the student performs each exercise on a small number of “normal”\nsubjects (classmates), is founded on the belief that the ability to recognize an abnormal\nfinding on clinical examination requires a familiarity with the range of normal findings in\nthe otherwise healthy population. This is particularly true for new learners who may be\nfor the first time, learning about the structure and function of the nervous system.\nIt is our hope that the questions and exercises in this manual will help the reader\nacquire and solidify both knowledge and skill in evaluating the function of the nervous\nsystem.\n1 How to Use the Manual\nThe exercises described in this manual are group activities, intended and designed for\nsmall numbers of students working together. Each work group should ideally consist of\nfour to six students, preferably mixed with regard to gender, race, ethnicity, body size\nand overall shape. The intent of building diversity within the work group is to permit\nstudents to gain familiarity with as wide a range of normal findings as class enrollment\nwill permit. Students should dress comfortably in clothing that does not prohibit the\nproper performance of the exercises described.\nEach student in the work group should perform each exercise on all members of\nthe group and take a turn as subject for each of the other members of the group. In this\nway students can begin the process of gaining familiarity with the range of normal for a\nparticular examination technique and begin to recognize differences among individuals\nthat may affect how the test is performed or how the results are interpreted. In addition,\nstudents can begin to gain an appreciation of what it may be like to be the patient in a\nclinical encounter. Clearly, the greatest benefit is achieved when each student performs\neach exercise on all of the members of his or her group.\nAlthough these exercises are intended to be performed during regularly\nscheduled laboratory sessions when faculty or preceptor assistance may be available,\nthere is no reason why they cannot be performed or repeated outside scheduled class\ntime. Both technical skill and the ability to reliably interpret exam results are best\ndeveloped by practice and conscious reflection. There are simply no substitutes for\ndirect experience and practice.\nIt is essential that you come to each scheduled laboratory session with all the\ndiagnostic tools and other supplies that may be necessary to complete the exercises.\nBriefly review the exercises before each session so that you know what to bring in order\nto benefit from the exercises. Please be conscientious in this regard.\nFinally, learning by application, particularly when it involves human subjects, can\nsometimes be uncomfortable or embarrassing for both the learner and the subjects,\nwhether they are classmates or actual patients. Please view these exercises as\nimportant, necessary and serious parts of your educational and professional\ndevelopment, and treat your workgroup partners with the respect and sensitivity you\nwould wish them to extend to you.\n2 Anterolateral System\nObjectives\n1. Describe the functions of the anterolateral system.\n2. Describe the physiological characteristics of the receptors associated with the\nanterolateral system.\n3. Describe the peripheral and central organization and connections of neural\nstructures associated with the anterolateral system.\n4. Describe the rationale for using specific stimuli to activate impulse transmission\nin the anterolateral system.\n5. Describe the autonomous zones for the major, commonly tested pre-plexus\nspinal nerve roots and peripheral nerves.\n6. Describe the types of dysfunctions and signs and symptoms that result from\nlesions/diseases that affect the anterolateral system.\n7. List terms commonly used by patients that might suggest dysfunction of the\nanterolateral systems.\n8. Demonstrate the ability to evaluate the function of the anterolateral system.\nNeuroscience Review Questions\n1. What are the characteristics of the receptors that when activated give rise to\nnerve impulse transmission in the anterolateral system?\nThreshold ________________________________________________\nAdapting ________________________________________________\n2. What types of energy can depolarize nociceptors?\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n3 3. Which afferent nerve fibers transmit nerve impulses toward the CNS in response\nto activation of nociceptors? What is the conduction velocity for each fiber type?\nFiber Type Conduction Velocity\n___________________________ _______________________________\n___________________________ _______________________________\n4. In what part of the spinal gray matter do nociceptive afferent fibers terminate?\n________________________________________________________________\n5. In which specific laminae of Rexed do nociceptive afferent fibers terminate?\n________________________________________________________________\n6. Name the region of the spinal cord where axons destined to form the\nanterolateral tracts decussate.\n________________________________________________________________\n7. List two (2) major nuclei or regions of the brainstem that receive synaptic input\nfrom anterolateral system axons.\n________________________________________________________________\n________________________________________________________________\n8. List three (3) thalamic nuclei that receive synaptic input from anterolateral system\naxons.\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n4 9. Cells of the ventral posterolateral nucleus (VPL) project axons that terminate in\nthe ipsilateral cerebral hemisphere. List the two (2) gyri where these axons\nterminate and indicate the body part functionally related to each.\nGyrus Body Part\n____________________________ _______________________________\n____________________________ _______________________________\n10. In which limb of the internal capsule are these thalamocortical fibers located?\n________________________________________________________________\n11. Cells of the dorsal medial nucleus (DM) are the origin of axons that terminate in\nthe ipsilateral cerebral hemisphere. List two (2) gyri or parts of the hemisphere\nwhere these axons terminate.\n________________________________________________________________\n________________________________________________________________\n12. In which limb of the internal capsule are these thalamocortical fibers located?\n________________________________________________________________\n13. Describe the orientation of the sensory homunculus on the primary\nsomatosensory cortices.\n________________________________________________________________\n14. Define the following terms:\nanesthesia\nanalgesia\nhypesthesia\nhypalgesia\nhyperalgesia\nallodynia\nparesthesia\ndysesthesia\nnociceptor\n5 Application Exercises\n1. On several lab partners identify the area of skin innervated by each of the\nfollowing pre- plexus spinal nerves:\nupper limb - C5, C6, C7, C8, T1\ntrunk - T4, T10\nlower limb - L2, L3, L4, L5, S1\n2. With a skin pencil mark the autonomous zone for each of the above listed pre-\nplexus spinal nerves.\n3. On several lab partners identify the area of skin innervated by each of the\nfollowing post plexus peripheral nerves:\nupper limb\nmedian\nulnar\nradial\naxillary\nmusculocutaneous\nmedial antebrachial cutaneous\nmedial brachial cutaneous\nlower limb\nlateral femoral cutaneous\nobturator\ndeep peroneal (fibular)\nsuperficial peroneal (fibular)\nsaphenous\nsural\n4. With a skin pencil mark the autonomous zone for each of the above listed post-\nplexus peripheral nerve.\n5. On several lab partners demonstrate and describe a method for evaluating the\nanterolateral system in a patient with a suspected lesion in the posterior limb of\nthe internal capsule.\n______________________________________________________________\n6. On several lab partners demonstrate and describe a method for evaluating the\nanterolateral system in a patient with a suspected lesion involving the radial\nnerve.\n______________________________________________________________\n6 7. On several lab partners demonstrate and describe a method for evaluating the\nanterolateral system in a patient with a suspected distal peripheral neuropathy\nsuch as might be found in a patient with diabetes mellitus.\n______________________________________________________________\n8. What peripheral nervous system structure is most likely involved in a patient with\nabsent pin prick sensation on the skin of the palmer surface of the left long\nfinger? On which side is the lesion?\nStructure Involved Side of Lesion\n_____________________________ _____________________________\n9. What peripheral nervous system structure is most likely involved in a patient with\nabsent thermal sensation on the skin of the lateral surface of the right thigh? On\nwhich side is the lesion?\nStructure Involved Side of Lesion\n_____________________________ _____________________________\n10. Which limb or limbs is (are) most likely to be affected in a patient with sensory\nimpairment resulting from damage to Lissauer’s tract on the left side extending\nfrom C5-T1? Which side of the body is affected?\nLimb(s) Affected Side Affected\n_____________________________ _____________________________\n11. Which limb of the internal capsule is most likely involved in a patient with\nincreased threshold to pin prick stimulation of the left upper and lower limbs? On\nwhich side is the lesion?\nPart of Internal Capsule Side of the Lesion\n_____________________________ ______________________________\n7 Lemniscal System\nObjectives\n1. Describe the functions of the lemniscal system.\n2. Describe the physiological characteristics of the receptors associated with the\nlemniscal system.\n3. Describe the peripheral and central organization and connections of neural\nstructures associated with the lemniscal system.\n4. Describe the rationale for using specific stimuli to activate impulse transmission\nin the lemniscal system.\n5. Describe the autonomous zones for the major, commonly tested pre-plexus\nspinal nerve roots and peripheral nerves.\n6. Describe the types of dysfunctions and signs and symptoms that result from\nlesions/diseases that affect the lemniscal system.\n7. List terms commonly used by patients that might suggest dysfunction of the\nlemniscal system.\n8. Demonstrate the ability to evaluate the function of the lemniscal system.\nNeuroscience Review Questions\n1. What are the characteristics of the receptors that when activated give rise to\nnerve impulse transmission in the lemniscal system?\nThreshold ______________________________________________\nAdapting ______________________________________________\n2. Which receptor is involved in the perception of light tactile stimuli?\n______________________________________________________________\n3. Which receptor is primarily involved in the perception of joint position and\nmovement?\n_______________________________________________________________\n8 4. Which afferent nerve fiber transmits nerve impulses toward the CNS in response\nto activation of receptors involved in the perception of light tactile stimuli and\nwhat is its conduction velocity?\nFiber Type Conduction Velocity\n____________________________ __________________________\n5. Which afferent nerve fiber transmits nerve impulses toward the CNS in response\nto activation of receptors involved in the perception of joint position and\nmovement and what is its conduction velocity?\nFiber Type Conduction Velocity\n____________________________ __________________________\n____________________________ __________________________\n6. In which funiculus of the spinal cord are the central processes of these non-\nnociceptive afferent cells located?\n______________________________________________________________\n7. Name the two (2) fasciculi in the spinal cord that are formed by the central\nprocesses of non-nociceptive afferent fibers AND indicate which limb is\nassociated with each.\nFasciculus Limb\n____________________________ __________________________\n____________________________ __________________________\n8. Describe the somatotopic organization of the fibers of the dorsal funiculus.\n______________________________________________________________\n9. List the nuclei where these fibers terminate and indicate the part of the body\nfunctionally related to each.\nNucleus Body Part\n____________________________ __________________________\n____________________________ __________________________\n9 10. At what level of the brainstem do the axons of the above two nuclei cross the\nmidline? (Be as specific as you can.)\n_______________________________________________________________\n11. What fiber tract is formed by these axons after they cross the midline?\n_______________________________________________________________\n12. What is the somatotopic organization of this pathway at the level of the:\nInferior olivary nucleus _______________________________________\nMid Pons __________________________________________________\nMid Midbrain _______________________________________________\n13. Name the thalamic nucleus where the fibers of the medial lemniscus terminate.\n_______________________________________________________________\n14. Describe the somatotopic organization of the cells of this thalamic nucleus.\n________________________________________________________________\n15. Cells of the ventral posterolateral nucleus (VPL) project axons that terminate in\nthe ipsilateral cerebral hemisphere. List the two (2) gyri where these axons\nterminate and indicate the body part functionally related to each.\nGyrus Body Part\n____________________________ _______________________________\n____________________________ _______________________________\n16. In which limb of the internal capsule are these thalamocortical fibers located?\n________________________________________________________________\n17. Describe the orientation of the sensory homunculus on the primary\nsomatosensory cortices.\n________________________________________________________________\n10 18. What two (2) functions of a sensory system occur as a result of activating the\nprimary somatosensory cortex?\n________________________________________________________________\n________________________________________________________________\n19. Cells of the primary somatosensory cortex project axons toward two (2) other\nregions of the cerebral cortex. What are these other cortical areas and what\n(briefly) are their functions?\nCortical Area Function\n______________________________ _______________________________\n______________________________ _______________________________\n20. Define the following terms:\nhypesthesia\nhyperesthesia\nthigmesthesia\npallesthesia\nproprioception\nkinesthesia\ntopesthesia\nApplication Exercises\n1. On several lab partners identify the area of skin innervated by each of the\nfollowing pre-plexus spinal nerves:\nupper limb - C5, C6, C7, C8, T1\ntrunk - T4, T10\nlower limb - L2, L3, L4, L5, S1\n2. Use a skin pencil mark the autonomous zone for each of the above listed pre-\nplexus spinal nerves.\n3. On several lab partners identify the area of skin innervated by each of the\nfollowing peripheral nerves:\nupper limb\nmedian\nulnar\n11 radial\naxillary\nmusculocutaneous\nmedial antebrachial cutaneous\nmedial brachial cutaneous\nlower limb\nlateral femoral cutaneous\nobturator\ndeep peroneal (fibular)\nsuperficial peroneal (fibular),\nsaphenous\nsural\n4. Use a skin pencil mark the autonomous zone for each of the above listed post-\nplexus peripheral nerves.\n5. On several lab partners demonstrate and describe a method for evaluating light\ntouch perception in the upper and lower limbs.\n________________________________________________________________\n6. Describe the findings you would expect on testing light touch sensation in a\npatient with a suspected lesion in the posterior limb of the internal capsule on the\nright side.\n________________________________________________________________\n7. On several lab partners demonstrate and describe a method for evaluating tactile\nlocalization in the upper and lower limbs.\n________________________________________________________________\n8. Describe the findings you would expect on testing light touch sensation in a\npatient with a suspected lesion in the radial nerve on the left side.\n________________________________________________________________\n9. Which tuning fork should be used for testing vibratory sense?\n_______________________________________________________________\n10. On several lab partners demonstrate and describe a method for evaluating\nvibratory sense in the upper and lower limbs.\n________________________________________________________________\n12 11. Describe the findings you might expect on testing vibratory sense in a patient\nwith a suspected distal peripheral neuropathy such as might be found in a patient\nwith diabetes mellitus.\n________________________________________________________________\n12. On several lab partners demonstrate and describe a method for evaluating\nposition sense in the upper and lower limbs.\n________________________________________________________________\n13. Describe the findings you might expect on testing position sense in a patient with\na suspected distal peripheral neuropathy such as might be found in a patient with\ndiabetes mellitus.\n________________________________________________________________\n14. On several lab partners demonstrate and describe a method for evaluating\nstation using the Romberg test.\n_______________________________________________________________\n15. Describe the findings you would observe in a patient in whom the Romberg test\nis “positive.”\n_______________________________________________________________\n_______________________________________________________________\n16. Where might a lesion be located in a patient who demonstrates a “positive”\nRomberg test?\n_______________________________________________________________\n17. What spinal pathway is most likely involved in a patient with impaired vibratory\nsensation in the right foot? On which side of the spinal cord is the lesion?\nSpinal Pathway Side of Lesion\n____________________________ _______________________________\n13 18. What thalamic nucleus is most likely involved in a patient with increased\nthreshold to light touch stimuli in the left upper and lower limbs? On which side of\nthe brain is the lesion?\nThalamic Nucleus Side of Lesion\n____________________________ _______________________________\n19. An imaging study in a patient with impaired vibratory sense and increased\nthreshold to non-nociceptive cutaneous stimuli in the left upper and lower limbs\nreveals a focal abnormality in the caudal pons. What neural structure is most\nlikely involved and on which side?\nNeural Structure Side of Lesion\n____________________________ _______________________________\n14 Cortical Sensory Functions\nObjectives\n1. Describe the functions of the cerebral cortex referred to as cortical sensory\nfunctions.\n2. Indicate which gyrus is implicated in patients with abnormalities in cortical\nsensory functions.\n3. Demonstrate the proper technique for evaluating cortical sensory functions.\nNeuroscience Review Questions\n1. Which receptor is involved in the perception of light tactile stimuli?\n_______________________________________________________\n2. Which afferent nerve fiber transmits nerve impulses toward the CNS in response\nto activation of receptors involved in the perception of light tactile stimuli and\nwhat is its conduction velocity?\nFiber Type Conduction Velocity\n____________________________ __________________________\n3. Name the ascending fiber tract transmits non-nociceptive nerve impulses from\nthe upper limbs.\n______________________________________________________________\n4. Name the fiber tract in the brainstem that transmits non-nociceptive impulses\nfrom the upper limbs.\n_____________________________________________________________\n5. Name the thalamic nucleus where the fibers of the medial lemniscus terminate.\n_______________________________________________________________\n6. Describe the somatotopic organization of the cells of this thalamic nucleus.\n________________________________________________________________\n15 7. Cells of the ventral posterolateral nucleus (VPL) project axons that terminate in\nthe ipsilateral cerebral hemisphere. List the two (2) gyri where these axons\nterminate and indicate the body part functionally related to each.\nGyrus Body Part\n____________________________ _______________________________\n____________________________ _______________________________\n8. In which limb of the internal capsule are these thalamocortical fibers located?\n________________________________________________________________\n9. Describe the orientation of the sensory homunculus on the primary\nsomatosensory cortices.\n________________________________________________________________\n10. What two (2) functions of a sensory system occur as a result of activating the\nprimary somatosensory cortex?\n________________________________________________________________\n________________________________________________________________\n11. Cells of the primary somatosensory cortex project axons toward two (2) other\nregions of the cerebral cortex. What are these other cortical areas and what\n(briefly) are their functions?\nCortical Area Function\n______________________________ _______________________________\n______________________________ _______________________________\n12. Name the three (3) neurological functions tested when evaluating cortical\nsensory functions.\n_______________________________________________________________\n_______________________________________________________________\n_______________________________________________________________\n16 13. What types of objects should be used when evaluating stereognosia?\n______________________________________________________________\n14. Define the following terms:\nstereognosia (object identification)\ngraphesthesia (traced figure identification)\nextinction (to double simultaneous stimulation)\ntactile agnosia\nApplication Exercises\n1. Describe and demonstrate in several lab partners a method for evaluating\nstereognosia.\n2. Describe and demonstrate in several lab partners a method for evaluation\ngraphesthesia.\n3. Describe and demonstrate in several lab partners a method for evaluating\nsensory extinction to double simultaneous stimulation.\n17 Motor System (Strength)\nObjectives\n1. List the commonly tested movements when measuring strength.\n2. For each of the routinely tested movements, list the pre-plexus spinal nerve roots\nand peripheral nerves that primarily contribute to that movement.\n3. Describe the system used for grading muscle strength.\n4. Describe the features that distinguish weakness resulting from lower motor\nneuron injury from weakness resulting from upper motor neuron injury.\n5. Demonstrate the ability to measure muscle strength in the upper limb, lower limb\nand trunk.\nNeuroscience Review Questions\n1. Indicate the peripheral nerve being tested when you evaluate the strength of\neach of the following movements.\nUpper Limb Peripheral Nerve\nshoulder abduction ______________________\nelbow flexion ______________________\nelbow extension ______________________\nwrist extension ______________________\nwrist flexion ______________________\nfinger extension ______________________\nfinger flexion (grip strength) ______________________\nfinger abduction ______________________\nfinger adduction ______________________\n18 Lower Limb\nhip flexion ______________________\nhip adduction ______________________\nhip abduction ______________________\nhip extension ______________________\nknee extension ______________________\nknee flexion ______________________\nankle dorsiflexion ______________________\nankle plantar flexion ______________________\ntoe extension ______________________\n2. Indicate the spinal segments being tested when you evaluate the strength of\neach of the following movements.\nUpper Limb Spinal Segments\nshoulder abduction _______________________\nelbow flexion _______________________\nelbow extension _______________________\nwrist extension _______________________\nwrist flexion _______________________\nfinger extension _______________________\nfinger flexion (grip strength) _______________________\nfinger abduction _______________________\nfinger adduction _______________________\nLower Limb\nhip flexion _______________________\n19 hip adduction _______________________\nhip abduction _______________________\nhip extension _______________________\nknee extension _______________________\nknee flexion _______________________\nankle dorsiflexion _______________________\nankle plantar flexion _______________________\ntoe extension _______________________\n3. What lobes of the brain contain corticospinal tract cell bodies?\n______________________________________________________________\n______________________________________________________________\n4. What lobe(s) of the brain contains cortical upper motor neurons that influence\nlower motor neurons that innervate muscles of each of the following limbs?\nupper limbs _____________________________________________\nlower limbs _____________________________________________\n5. What gyrus/gyri contain cortical upper motor neurons that influence lower motor\nneurons that innervate muscles of each of the following limbs?\nupper limbs _____________________________________________\nlower limbs _____________________________________________\n20 6. In what white matter structure of the brain are corticospinal axons located at the\nlevel of each of the following structures?\nthalamus ________________________________________\nmidbrain ________________________________________\npons ________________________________________\nmedulla oblongata ________________________________________\n7. What is the name of the white matter structure where corticospinal fibers\ndecussate (cross the midline)?\n______________________________________________________________\n8. Which limb is influence by corticospinal fibers that decussate in each of the\nfollowing?\nrostral part of the pyramidal decussation? ____________________\ncaudal part of the pyramidal decussation? ____________________\n9. What percentage of corticospinal fibers typically decussate in the pyramidal\ndecussation?\n___________________\n10. What descending spinal cord pathway is formed by corticospinal fibers that:\ndecussate in the pyramidal decussation?\n_________________________________________________________\ndo not decussate in the pyramidal decussation?\n_________________________________________________________\n11. What percentage of fibers of the lateral corticospinal tract terminates at:\nupper limb segments (C5 – T1) ______________________________\nlower limb segments (L2 – S2) ______________________________\nnon-limb segments (T2 – L1) ______________________________\n21 12. In segments of the spinal cord that contain lower motor neurons that innervate\nthe limbs, which muscle groups are innervated by lower motor neurons primarily\nlocated in each of the following?\nMuscle Groups\nmedial part of the ventral horn __________________________\nintermediate part of the ventral horn __________________________\nlateral part of the ventral horn __________________________\n13. Define the performance criteria/characteristics for each of the following muscle\nstrength grade.\nnormal (5/5) _______________________________________________\ngood (4/5) _______________________________________________\nfair (3/5) _______________________________________________\npoor (2/5) _______________________________________________\ntrace (1/5) _______________________________________________\nzero (0/5) _______________________________________________\n14. Define the following terms:\nlower motor neuron\nmotor unit\ndisuse atrophy\ndenervation atrophy\nhypertrophy\nparesis\nhemiparesis\nflaccid paralysis\nspastic paralysis\npronator drift\nfibrillation\nfasciculation\nparaplegia\nhemiparesis\nquadriplegia\nwrist drop\nfoot drop\n22 claw hand\nErb’s Palsy\nKlumpke’s Palsy\nApplication Exercises\n1. Inspect and compare the two upper limbs and the two lower limbs. Focus on\nsymmetry, specifically regarding muscle bulk and contour. Describe and\ncharacterize any observed asymmetry or side to side differences in bulk and\ncontour.\n2. Is an observed asymmetry necessarily a sign of abnormality or pathology? (Y/N)\n_________________\n3. If not, how much asymmetry might be seen in the normal population AND how\nmight you explain the presence of visible asymmetry between muscles or muscle\ngroups?\n________________________________________________________________\n4. On several lab partners demonstrate and describe how to measure strength of\neach of the following movements AND assign an appropriate strength grade.\nUpper Limb Strength Grade\nshoulder abduction ____________________\nelbow flexion ____________________\nelbow extension ____________________\nwrist extension ____________________\nwrist flexion ____________________\nfinger extension ____________________\nfinger flexion (grip strength) ____________________\nfinger abduction ____________________\nfinger adduction ____________________\n23 Lower Limb\nhip flexion ____________________\nhip adduction ____________________\nhip abduction ____________________\nhip extension ____________________\nknee extension ____________________\nknee flexion ____________________\nankle dorsiflexion ____________________\nankle plantar flexion ____________________\ntoe extension ____________________\n5. What are the likely locations of lesions that result in denervation atrophy?\n_______________________________________________________________\n_______________________________________________________________\n6. What peripheral nervous system structure is most likely involved in a patient with\n0/5 strength of ankle dorsiflexion and 0/5 strength of great toe extension on the\nright side? Which side is involved?\nStructure Involved Side of Lesion\n___________________________ __________________________\n7. What peripheral nervous system structure is most likely involved in a patient with\n3/5 strength of elbow flexion and 3/5 strength of shoulder abduction on the left\nside? Which side is involved?\nStructure Involved Side of Lesion\n___________________________ __________________________\n24 8. What peripheral nervous system structure is most likely involved in a patient with\n0/5 strength of finger abduction, finger adduction and wrist flexion with ulnar\ndeviation on the right side? Which side is involved?\nStructure Involved Side of Lesion\n___________________________ __________________________\n9. What peripheral nervous system structure is most likely involved in a patient with\n2/5 strength of knee extension and 3/5 strength of hip adduction on the left\nside? Which side is involved?\nStructure Involved Side of Lesion\n___________________________ __________________________\n25 Coordination, Station, and Gait\nObjectives\n1. Define and describe the differences between metric movements and\ndiadochokinetic movements.\n2. Describe commonly used techniques for evaluating metric and diadochokinetic\nmovements in the upper limbs.\n3. Describe commonly used techniques for evaluating metric and diadochokinetic\nmovements in the lower limbs.\n4. Describe the characteristic features of dysmetric movements.\n5. Describe the characteristic features of dysdiadochokinetic movements.\n6. Describe the neural bases for the ability to stand erect (station).\n7. Describe the commonly used technique for evaluating station.\n8. List and describe the characteristics of gait that are commonly evaluated\nin the clinical setting.\n9. Describe several common gait abnormalities.\n10. Demonstrate the ability to measure coordination, station and gait.\nNeuroscience Review Questions\n1. List the three (3) gross anatomic parts of the cerebellum.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n26 2. List the three (3) developmental (embryological) components of the cerebellum.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n3. List the three (3) functional regions of the cerebellar cortex.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n4. Name the fissure that separates the anterior lobe from the posterior lobe.\n____________________________________________________________\n5. Name the fissure that separates the posterior lobe from the flocculonodular lobe.\n____________________________________________________________\n6. Name the three (3) major cerebellar peduncles and the region of the brainstem\nwith which each is anatomically associated.\nCerebellar Peduncle Related Brainstem Region\n____________________________ _________________________\n____________________________ _________________________\n____________________________ _________________________\n7. Name the three (3) layers of the cerebellar cortex.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n27 8. Name the two (2) cells with cell bodies located in the molecular layer.\n_____________________________________________________________\n_____________________________________________________________\n9. Name the two (2) cells with cell bodies located in the granular layer.\n_____________________________________________________________\n_____________________________________________________________\n10. List the major cerebellar afferent and efferent tracts located in each of the\ncerebellar peduncles.\nAfferent Tract Efferent Tract\nSuperior Cerebellar Peduncle\n____________________________ _________________________\n____________________________ _________________________\n_________________________\nMiddle Cerebellar Peduncle\n____________________________\nInferior Cerebellar Peduncle\n____________________________\n____________________________\n____________________________\nJuxtarestiform Body\n____________________________ ________________________\n11. What nucleus is the origin of climbing fibers?\n______________________________________________________________\n28 12. Name two (2) nuclei in the spinal cord that are the origin of mossy fibers.\n_______________________________________________________________\n_______________________________________________________________\n13. Name two (2) nuclei in the medulla oblongata that are the origin of mossy fibers.\n_______________________________________________________________\n_______________________________________________________________\n14. In what layer of the cerebellar cortex are glomeruli located?\n_______________________________________________________________\n15. What cell is the “output” cell of the cerebellar cortex?\n_______________________________________________________________\n16. What is the neurotransmitter synthesized and used by this cell?\n_______________________________________________________________\n17. Name the cerebellar deep nuclei from medial to lateral AND indicate the\nfunctional region(s) of the cerebellar cortex with which it is related.\nNucleus Functional Cortical Region(s)\n_____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n29 18. List the cerebellar deep nuclei from medial to lateral AND indicate the main\nnucleus that each projects to.\nNucleus Nuclear Target\n_____________________________ __________________________\n_____________________________ __________________________\n_____________________________ __________________________\n_____________________________ __________________________\n19. Define the following terms:\nataxia\ndysmetria\ntruncal ataxia\nmetric movements\ndiadochokinetic movements\ndysdiadochokinesia\ndysarthria\nintention (kinetic) tremor\ntitubation\ncheck and rebound\ntandem gait\nastasia\nastasia-abasia\nfinger to nose testing\nheel to shin testing\nRomberg test\nApplication Exercises\n1. On several lab partners demonstrate and describe a method for evaluating\ncoordination (metric movements) in the upper and lower limbs.\n________________________________________________________________\n2. Describe the findings you might expect who demonstrated dysmetria of the upper\nlimb and of the lower limb.\nUpper Limb _____________________________________________________\nLower Limb _____________________________________________________\n30 3. On several lab partners demonstrate and describe a method for evaluating\ncoordination (diadochokinetic movements) in the upper and lower limbs.\n________________________________________________________________\n4. Describe the findings you might expect in a patient who demonstrates\ndysdiadochokinesia involving the right upper limb and of the lower limb.\nUpper Limb _____________________________________________________\nLower Limb _____________________________________________________\n5. On several lab partners demonstrate and describe a method for evaluating\nstation using the Romberg test.\n_______________________________________________________________\n6. Describe your observations in a patient in whom the Romberg test is “positive.”\n_______________________________________________________________\n_______________________________________________________________\n7. Where might a lesion be located in a patient who demonstrates a “positive”\nRomberg test?\n________________________________________________________________\n8. On several lab partners demonstrate and describe a method for evaluating gait.\n________________________________________________________________\n9. List and describe several specific components of gait that you might focus on\nduring an evaluation of gait.\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n31 10. Describe the characteristics of a hemiparetic gait.\n_______________________________________________________________\n11. Describe the features of the gait of a patient with unilateral foot drop.\n_______________________________________________________________\n12. Describe the features of the gait of a patient with a destructive lesion involving\nthe cerebellar vermis.\n_______________________________________________________________\n13. Describe the features of the gait of a patient with Parkinson disease.\n_______________________________________________________________\n14. Describe the features of the gait of a patient with Huntington disease.\n_______________________________________________________________\n15. Describe the features of the gait of a patient with tabes dorsalis (sensory ataxia).\n_______________________________________________________________\n16. A 27 y/o man presents with the sudden onset of difficulty walking. On\nexamination he demonstrates impaired performance on finger-to-nose testing\nand heel-to-shin testing on the right side. An imaging study reveals a tumor mass\nin the cerebellum. On which side is the tumor mass most likely located?\n_______________________________________________________________\n17. Lesions of the cerebellar hemisphere are sometimes associated with hypotonia.\nWhich hemisphere of the cerebellum is most likely to be affected in a patient who\ndemonstrates hypotonia in the left upper and lower limbs?\n_______________________________________________________________\n32 Gait\nObjectives:\n1. Define and describe the individual components of the gait cycle.\n2. List the components of the general physical examination that should be\nevaluated when assessing gait.\n3. Describe the movements that occur at the ankle, knee, hip, shoulders and elbow\nduring the gait cycle.\n4. Describe the specific effects on individual components of the gait cycle that\nwould be expected in a patient with weakness or paralysis of each of the\nfollowing muscle groups:\nankle dorsiflexors\nankle plantar flexors\nknee extensors\nknee flexors\nhip abductors\nhip elevators (hip hikers)\nhip extensors\n5. Describe the compensatory movements that might be used by patients with\nweakness/paralysis of the muscle groups listed above.\n6. Describe the gait characteristics “typically” observed in patients with arthritis of\nthe hip, Parkinson disease and stroke.\nNeuroscience Review Questions\n1. What percent of the normal gait cycle is spent in stance phase?\n_____________\n2. What percent of the normal gait cycle is spent in swing phase?\n_____________\n3. What percent of the gait cycle is spent in single limb support?\n_____________\n33 4. What percent of the gait cycle is spent in double limb support?\n_____________\n5. Describe the movement of the ankle joint that occurs between heel strike and\nfoot flat.\n_____________________________________________________________\n6. Describe the movement of the ankle joint that occurs between toe off and heel\nstrike.\n_____________________________________________________________\n7. Describe the movements that occur at the knee joint between heel strike and foot\nflat.\n_____________________________________________________________\n8. Describe the movements of the knee joint that occur between toe off and toe off\nand heel strike.\n_____________________________________________________________\n9. Describe the movement of the center of gravity from the middle of single limb\nsupport (SLS) to the middle of double limb support (DLS).\n_____________________________________________________________\n10. What muscle group of the ankle joint is most active during the time from heel\nstrike to foot flat?\n_____________________________________________________________\n11. What muscle group of the hip joint is most active during stance phase?\n_____________________________________________________________\n12. What muscle group of the hip joint is most active during swing phase?\n_____________________________________________________________\n34 13. What muscle group of the knee joint is most active during the first half of swing\nphase?\n_____________________________________________________________\n14. What muscle group of the knee joint is most active during the second half of\nswing phase?\n_____________________________________________________________\n15. What muscle group of the knee joint is most active at heel strike?\n_____________________________________________________________\n16. What muscle group of the ankle joint is most active during the first half of swing\nphase?\n_____________________________________________________________\n17. What muscle group of the ankle joint is most active at heel strike?\n_____________________________________________________________\n18. Describe the movements of the hip, knee and ankle joints in a patient who\nsustained a stroke several months ago and is now ambulatory.\n_____________________________________________________________\n19. During swing phase of the right lower limb is the right upper limb (shoulder)\nmoving from flexion into extension OR from extension into flexion?\n_____________________________________________________________\n20. During single limb support is the line of gravity aligned over the limb in swing\nphase OR the limb in stance phase?\n____________________________________________________________\n21. Is the center of mass at its highest vertical point during single limb support OR\ndouble limb support?\n__________________________________________________________\n35 22. Define the following terms:\nbase of support\ncenter of gravity\nline of gravity\nstep length\nstride length\nstance phase\nswing phase\nsingle limb support\ndouble limb support\nheel strike\nfoot flat\ntoe off\ngait cycle\ncadence\nvelocity\nstride width\npropulsion\nretropulsion\nabnormal gait patterns\nspastic gait\nantalgic gait\nhemiparetic gait\nsteppage gait\nfestinating gait\nataxic gait\nApplication Exercises\nLateral Observation\nInstruct a subject to walk in a straight line from point “A” to point “B” and back again for\na distance of approximately 25 feet at a comfortable speed. Place yourself\napproximately 8 feet to the side of the subject’s line of progression, midway between the\nstarting and ending points, so that you can observe the subjects’ right and left sides as\nhe/she passes from point “A” to point “B.”\n1. Compare the duration of stance phase on each limb.\nAre they essentially the same for each limb? ________________________\nIf not, describe. ______________________________________________\n36 2. Compare the time from heel strike to foot flat for each limb.\nAre they essentially the same for each limb? ________________________\nIf not, describe. ______________________________________________\nWeakness or paralysis of what muscle group would likely decrease the time\nfrom heel strike to foot flat?\n_____________________________________________________________\n3. Compare the movements of the knee joint during both stance phase and swing\nphase for each limb.\nAre these movements essentially the same for each limb? ____________\nIf not, describe. ____________________________________________\n4. Compare the movement of the hip joint during both stance phase and swing\nphase for each limb.\nAre these movements essentially the same for each limb? ____________\nIf not, describe. ____________________________________________\n5. Compare the movements of the shoulder and elbow joints during the gait cycle.\nAre these movements essentially the same for each limb? ____________\nIf not, describe. ____________________________________________\nForward and Backward Observation\nInstruct a subject to walk in a straight line from point “A” to point “B” and back again for\na distance of approximately 25 feet at a comfortable speed. Place yourself in line with\nthe subject’s line of progression so that you can observe the subject walking away from\nyou and directly towards you.\n6. Observe and estimate the distance between the right and left foot during single\nlimb support phase on each limb. ____________________________\n37 7. Observe and estimate the angle subtended between the axis of the foot and the\nline of progression during stance phase for each limb.\nAre these angles essentially the same for each limb? _________________\nIf not, describe. ____________________________________________\n8. Observe and estimate the lateral movement of the center of mass from the\nmidline during stance phase on each limb.\nIs the lateral distance moved essentially the same for each limb? _______\nIf not, describe the differences. __________________________________\n9. Observe the movements of the shoulder and elbow joints during the gait cycle.\nAre these movements essentially the same for each limb? ____________\nIf not, describe. ____________________________________________\n38 Reflexes (including Muscle Tone)\nObjectives\n1. List the commonly tested muscle stretch reflexes.\n2. For each of the commonly tested muscle stretch reflexes, list the pre-plexus\nspinal nerve roots and peripheral nerves that primarily contribute to that reflex\nresponse.\n3. Describe a system for grading muscle stretch reflexes.\n4. List and describe some common abnormal muscle stretch reflex responses.\n5. Describe a method for evaluating muscle tone.\n6. List some common causes of abnormal muscle tone.\n7. Characterize and describe the basic mechanism of clonus.\n8. List the commonly evaluated cutaneous reflexes.\n9. List and describe some abnormal cutaneous reflexes.\n10. Demonstrate the ability to elicit and grade commonly tested muscle stretch\nreflexes.\n11. Demonstrate the ability to elicit and interpret commonly tested cutaneous\nreflexes.\nNeuroscience Review Questions\n1. Name the two (2) muscle-related receptors that play a role in mediating muscle\ntone.\n_____________________________________________________________\n_____________________________________________________________\n2. Which of these receptors is activated when eliciting a muscle stretch reflex?\n_____________________________________________________________\n39 3. What is the adequate stimulus for activating a muscle spindle?\n_____________________________________________________________\n4. Name the two types of afferent endings that associated with the muscle spindle\nAND indicate the afferent nerve fiber type associated with each.\nAfferent Ending Afferent Fiber Type\n___________________________ _________________________\n___________________________ _________________________\n5. What is the conduction velocity for each of these two afferent nerve fibers?\nAfferent Fiber Type Conduction Velocity\n___________________________ _________________________\n___________________________ _________________________\n6. What is the physiological effect of activating muscle spindles on efferent\n(motor) cells in the CNS?\n_______________________________________________________________\n7. Name the nerve cell that provides motor innervation to the muscle spindle AND\nindicate the conduction velocity of the axon of that cell.\nMotor Cell Type Conduction Velocity\n___________________________ _________________________\n8. What is the adequate stimulus for the Golgi tendon organ?\n_______________________________________________________________\n9. What fiber type is associated with the Golgi tendon organ AND what is the\nconduction velocity for this afferent nerve fiber?\nAfferent Fiber Type Conduction Velocity\n____________________________ _______________________\n40 10. What is the physiological effect of activating Golgi tendon organs on efferent\n(motor) cells in the CNS?\n_____________________________________________________________\n11. List the peripheral nerves that mediate each of the following muscle stretch\nreflexes.\nReflex Peripheral Nerve\nbiceps reflex __________________________\ntriceps reflex __________________________\nbrachioradialis reflex __________________________\nfinger flexor reflex __________________________\nquadriceps reflex __________________________\nAchilles reflex __________________________\n12. List the spinal segments that mediate each of the following reflexes.\nReflex Spinal Segment\nbiceps reflex __________________________\ntriceps reflex __________________________\nbrachioradialis reflex __________________________\nfinger flexor reflex __________________________\nquadriceps reflex __________________________\nAchilles reflex __________________________\n13. Define each of the following reflex grades.\n0/5 ________________________________________________________\n1/5 ________________________________________________________\n2/5 ________________________________________________________\n41 3/5 ________________________________________________________\n4/5 ________________________________________________________\n5/5 ________________________________________________________\n14. List three (3) features that characterize and distinguish spasticity from rigidity.\nSpasticity\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\nRigidity\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n15. Several muscle stretch reflexes are “suppressed” in the neurologically intact\nindividual and become manifest with certain type of CNS injuries. List two (2) of\nthese normally suppressed reflexes.\n________________________________________________________________\n________________________________________________________________\n16. What is the adequate stimulus for eliciting the plantar reflex?\n________________________________________________________________\n17. What is the normal response when eliciting the plantar reflex?\n________________________________________________________________\n18. What is the term used to refer to an abnormal plantar reflex?\n________________________________________________________________\n42 19. Is an abnormal plantar reflex a sing of an upper or lower motor neuron injury?\n________________________________________________________________\n20. Define the following terms:\nnormal muscle tone\natonia, hypotonia, hypertonia\nspasticity\nclonus\nreflex spread\nwithdrawal reflex\nplacing reaction\nlead pipe rigidity\ncogwheel rigidity\nrest tremor\ndystonia\ntics\nmyoclonus\nathetosis\nchorea\nballismus (hemiballismus)\nasterixis\nblepharospasm\nmyotatic reflex\nwithdrawl reflex\nplacing reacton\nBabinski sign\nApplication Exercises\n1. In several lab partners demonstrate and describe a method for eliciting the static\ncomponent of the tonic stretch reflex.\n________________________________________________________________\n2. In several lab partners demonstrate and describe a method for eliciting the\ndynamic component of the tonic stretch reflex.\n________________________________________________________________\n43 3. List the four (4) observable response variables for the phasic component of the\nmuscle stretch reflex.\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n________________________________________________________________\n4. On several lab partners demonstrate and describe a method for evaluating\nmuscle tone in the upper and lower limbs.\n________________________________________________________________\n5. On several lab partners demonstrate and describe a method for evaluating\nclonus in the lower limb.\n________________________________________________________________\n6. On several lab partners demonstrate and describe a method for eliciting each of\nthe following muscle stretch (deep tendon) reflexes AND assign an appropriate\ngrade.\nReflex Grade\nbiceps reflex ______________________\ntriceps reflex ______________________\nbrachioradialis reflex ______________________\nfinger flexor reflex ______________________\nquadriceps reflex ______________________\nAchilles reflex ______________________\n7. On several lab partners demonstrate and describe a method for eliciting the\nplantar reflex.\n____________________________________________________________\n44 8. What muscle stretch reflex is most likely to be affected in a patient with a lesion\ninvolving the C7 spinal nerve on the right side? On which side would the reflex\nbe affected?\nReflex Affected Side Affected\n___________________________ _________________________\n9. What muscle stretch reflex is most likely to be affected in a patient with a lesion\ninvolving the femoral nerve on the left side? On which side would the reflex\nbe affected?\nReflex Affected Side Affected\n___________________________ _________________________\n10. In several lab partners demonstrate and describe a method for eliciting the\nabdominal reflex.\n_____________________________________________________________\n11. In several lab partners demonstrate and describe a method for eliciting the\nHoffman reflex.\n_____________________________________________________________\n45 Olfactory Nerve\nObjectives\n1. Describe the cellular organization of the olfactory epithelium.\n2. Describe the peripheral and central connections of the olfactory system.\n3. List the major central projections of fibers of the olfactory tract.\n4. List and describe major physiological and behavioral responses to varying types\nof olfactory stimuli.\nNeuroscience Review Questions\n1. List the four (4) cell types found in the olfactory epithelium.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n2. Which of the above listed cells is associated with a cellular process that forms\nthe olfactory fila?\n______________________________________________________________\n3. How do the olfactory fila gain access to the intracranial compartment?\n______________________________________________________________\n4. Name the gross neural structure where the axons of the olfactory fila terminate.\n______________________________________________________________\n5. Name the cells in the above-named structure that give rise to the axons of the\nolfactory tract.\n______________________________________________________________\n46 6. What is the affect (excitation/inhibition) of activating cells of the anterior\nolfactory nucleus?\n______________________________________________________________\n7. List three (3) major targets of axons of the lateral olfactory stria.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n8. List one (1) major synaptic target of the axons of the medial olfactory stria.\n______________________________________________________________\n9. List several odorants that might be used to evaluate olfactory function.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n10. Briefly explain why you do NOT use irritant substances (volatile hydrocarbons\nsuch as ammonia) to test olfactory function.\n______________________________________________________________\n11. Define the following term:\nanosmia\nApplication Exercises\n1. In several lab partners inspect the nares. (Note the position of the nasal septum\nand look for obstructions.)\n2. In several lab partners demonstrate and describe a method for evaluating\nolfactory function. (Be sure to evaluate each side separately.)\n47 Visual System and Pupillary Reflexes\nObjectives\n1. Briefly describe the visual pathway from the retina to the primary visual\ncortex.\n2. Name and describe the visual field deficit resulting from lesions affecting the\noptic nerve, optic chiasm, optic tract and different regions of the visual\nradiations.\n3. Describe methods for evaluating visual fields and visual acuity.\n4. Demonstrate the ability to evaluate visual fields and visual acuity.\n5. Describe the neural organization of the pupillary light reflexes and the\naccommodation response.\n6. Describe the structures of the eye important in mediating the light and\naccommodation reflexes.\n7. Describe the effects of various lesions affecting the light reflex and\naccommodation pathways on the light and accommodation reflexes.\n8. Demonstrate the ability to evaluate the pupillary light reflexes.\n9. Demonstrate the ability to evaluate the accommodation responses.\nNeuroscience Review Questions\n1. Describe the relationship between visual fields and retinal quadrants.\n_______________________________________________________________\n2. Indicate the extent of vision (in degrees of arc) in each of the four directions\nindicated below with the eye maintained in the position of primary gaze.\nSuperiorly _________________\nMedially _________________\nInferiorly _________________\nLaterally _________________\n48 3. Describe the location and size (in degrees of arc) of the binocular visual field of\nan individual with both eyes viewing and in the position of primary gaze.\n_______________________________________________________________\n4. Describe the location and size (in degrees of arc) of the monocular visual fields\nfor each eye an individual with both eyes viewing and in the position of primary\ngaze.\n_______________________________________________________________\n5. Which retinal quadrants from which eye are represented in the right optic nerve?\nRetinal Quadrant Eye\n____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n6. Which retinal quadrants from which eye are represented in the right optic tract?\nRetinal Quadrant Eye\n____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n____________________________ __________________________\n7. In which part of the optic chiasm will you find the decussating fibers from the\nmacular part of each retina?\n________________________________________________________________\n8. What percentage of the axons of the optic nerve decussate (cross) in the optic\nchiasm?\n____________________________\n49 9. Which retinal quadrant is represented by the axons that form Wilbrand’s knee?\n______________________________________________________________\n10. Which retinal quadrants are the origin of axons that synapse in the lateral part of\nthe lateral geniculate nucleus on the right side?\nRight Eye ___________________________________________\nLeft Eye ___________________________________________\n11. Which retinal quadrants are the origin of axons that synapse in the medial part of\nthe lateral geniculate nucleus on the left side?\nRight Eye ___________________________________________\nLeft Eye ___________________________________________\n12. Which part of the lateral geniculate nucleus is the origin of axons that course\nthrough Meyer’s loop?\n______________________________________________________________\n13. Name the gyrus of the occipital lobe that receives synaptic input from cells in\neach of the following:\nLateral Geniculate Nucleus Gyrus\nLateral Part ______________________________\nMedial Part ______________________________\n14. What part of the visual field projects visual information to the:\nanterior part of the calcarine cortex _________________________\noccipital pole _________________________\n15. What artery supplies the primary visual cortex? _________________________\n16. What Brodmann areas are considered visual association cortices?\n______________________________________________________________\n50 17. Name the visual field defect associated with lesions affecting each of the\nfollowing parts of the visual pathway. (Assume a complete lesion.)\nRight optic nerve _______________________________________\nLeft optic tract _______________________________________\nOptic chiasm _______________________________________\nRight lateral geniculate _______________________________________\nLeft Meyer’s loop _______________________________________\n18. What type of vision is measured using a Snellen chart?\n______________________________________________________________\n19. What type of vision is measured using a Rosenbaum card?\n______________________________________________________________\n20. Where are the cell bodies of the two nerve cells that mediate pupillary\nconstriction?\nPreganglionic Cell Postganglionic Cell\n____________________________ _________________________\n21. Where are the cell bodies of the two nerve cells that mediate pupillary dilatation?\nPreganglionic Cell Postganglionic Cell\n____________________________ _________________________\n22. What nerve serves as the afferent limb of the pupillary light reflex?\n______________________________________________________________\n23. What nerve serves as the efferent limb of the pupillary light reflex?\n______________________________________________________________\n24. Describe the response referred to as the direct light reflex.\n______________________________________________________________\n51 25. Describe the response referred to as the indirect (consensual) light reflex.\n______________________________________________________________\n26 List the three (3) components of the accommodation response.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n27. What is the likely location of a lesion in a patient with a relative afferent pupillary\ndefect (RAPD) on the right side?\n_______________________________________________________________\n28. Define the following terms:\nmacular vision\nperipheral vision\ntemporal crescent\noccipital pole\nMeyer’s loop\nmacular sparring\nanopsia (anopia)\nblind spot\nhemianopsia\nquadrantanopsia\nhomonymous\nheteronymous\nscotoma\npositive scotoma\nnegative scotoma\namaurosis fugax\nmyopia\nhyperopia\namblyopia\ndiplopia\nmiosis\nmydriasis\nanisocoria\niridoplegia\ncycloplegia\nhippus\npresbyopia\n52 relative afferent pupillary defect (RAPD)\nlight-near dissociation\nMarcus-Gunn pupil\nAdie’s pupil\ndirect light reflex\nindirect light reflex\nApplication Exercises\n1. On several lab partners demonstrate and describe a method for evaluating visual\nfields.\n2. On several lab partners demonstrate and describe a method for evaluating visual\nacuity for distant vision.\n3. On several lab partners demonstrate and describe a method for evaluating visual\nacuity for near vision.\n4. On several lab partners demonstrate and describe a method for evaluating the\ndirect light reflex.\n5. On several lab partners demonstrate and describe performance of the “swinging\nflashlight test.”\n6. In a patient with a lesion involving the left optic nerve, what would you expect to\nobserve in the left eye in response to illumination of the left eye?\n_______________________________________________________________\n7. In a patient with a lesion involving the left optic nerve, what would you expect to\nobserve in the right eye in response to illumination of the left eye?\n_______________________________________________________________\n8. In a patient with a lesion involving the left optic nerve, what would you expect to\nobserve in the left eye in response to illumination of the right eye?\n_______________________________________________________________\n9. In a patient with a lesion involving the left optic nerve, what would you expect to\nobserve in the right eye in response to illumination of the right eye?\n_______________________________________________________________\n53 10. In a patient with a lesion involving the right abducens nerve, what would you\nexpect to observe in the left eye in response to illumination of the left eye?\n_______________________________________________________________\n11. In a patient with a lesion involving the right abducens nerve, what would you\nexpect to observe in the right eye in response to illumination of the left eye?\n_______________________________________________________________\n12. In a patient with a lesion involving the right abducens nerve, what would you\nexpect to observe in the left eye in response to illumination of the right eye?\n_______________________________________________________________\n13. In a patient with a lesion involving the right abducens nerve, what would you\nexpect to observe in the right eye in response to illumination of the right eye?\n_______________________________________________________________\n14. In a patient with a lesion involving the right oculomotor nerve, what would you\nexpect to observe in the left eye in response to illumination of the left eye?\n_______________________________________________________________\n15. In a patient with a lesion involving the right oculomotor nerve, what would you\nexpect to observe in the right eye in response to illumination of the left eye?\n_______________________________________________________________\n16. In a patient with a lesion involving the right oculomotor nerve, what would you\nexpect to observe in the left eye in response to illumination of the right eye?\n_______________________________________________________________\n17. In a patient with a lesion involving the right oculomotor nerve, what would you\nexpect to observe in the right eye in response to illumination of the right eye?\n_______________________________________________________________\n54 Ocular Motor Nerves\nObjectives\n1. List the actions of each of the individual extraocular muscles.\n2. Describe the resting position of the eye as a result of paralysis of each\nindividual extraocular muscle.\n3. List the eye movement that will result in maximal strabismus for each extraocular\nmuscle.\n4. Describe movements of each eye used to assess the function of the muscles\nacting on that eye.\n5. Describe compensatory changes in head position expected in a patient with an\nacute, unilateral injury involving the abducens, trochlear and oculomotor\nnerves.\n6. Describe the strabismus resulting from lesions affecting each of the extraocular\nnerves.\n7. Describe the neural structures and connection involved in horizontal and vertical\ngaze shifts.\n8. Describe the neural structures and connections involved in volitional and pursuit\neye movements.\n9. Demonstrate a method for evaluating the function of each extraocular muscle.\n10. Demonstrate a method for evaluating a patient with tropia.\nNeuroscience Review Questions\n1. Define and describe Listing’s plane.\n_____________________________________________________________\n_____________________________________________________________\n55 2. Define and describe Fick’s axes.\nX axis__________________________________________________\nY axis__________________________________________________\nZ axis__________________________________________________\n3. List the extraocular muscles AND indicate the cranial nerve that innervates\neach.\nMuscle Nerve\n_________________________ _________________________\n_________________________ _________________________\n_________________________ _________________________\n_________________________ _________________________\n________________________ _________________________\n________________________ _________________________\n4. List the primary and secondary actions for each extraocular muscle.\nMuscle Primary Action Secondary Actions\nlateral rectus ____________\nmedial rectus ___________\nsuperior rectus ___________ ____________ ____________\ninferior rectus ____________ ____________ ____________\nsuperior oblique ____________ ____________ ____________\ninferior oblique ____________ ____________ ____________\n56 5. Describe the action for each muscle used for testing that muscle.\nlateral rectus ______________________________________________\nmedial rectus ______________________________________________\nsuperior rectus ______________________________________________\ninferior rectus ______________________________________________\nsuperior oblique ______________________________________________\ninferior oblique ______________________________________________\n6. Describe the resting position of the eye in a patient with damage to each of the\nextraocular nerves.\nabducens nerve ______________________________________________\noculomotor nerve ______________________________________________\ntrochlear nerve ______________________________________________\n7. Where in the brainstem is the oculomotor nucleus located?\n_____________________________________________________________\n8. Where in the brainstem is the trochlear nucleus located?\n_____________________________________________________________\n9. Where in the brainstem is the abducens nucleus located?\n_____________________________________________________________\n10. Which of the ocular motor nerves emerges from the brainstem from its dorsal\nsurface?\n______________________________________________________________\n11. Which intraorbital muscle is innervated by cells located on both the ipsilateral\nand contralateral sides?\n_______________________________________________________________\n57 12. Which of the ocular motor nerves passes through (rather than in the wall of) the\ncavernous sinus?\n____________________________________________________________\n13. Which of the ocular motor nerves does NOT pass through the annulus of Zinn?\n____________________________________________________________\n14. Which of the ocular motor nerves caries autonomic as well as somatic motor\nfibers?\n____________________________________________________________\n15. According to Sherrington’s law, when the right lateral rectus muscle contracts,\nwhat other muscle will be affected AND will it contract or relax?\nMuscle Side Contract/Relax\n____________________ ____________ _____________________\n16. According to Hering’s law, when the right lateral rectus muscle contracts, what\nother muscle will be affected AND will it contract or relax?\nMuscle Side Contract/Relax\n____________________ _____________ _______________________\n17. Where in the brainstem is the center for horizontal gaze?\n____________________________________________________________\n18. Where in the brainstem is the center for vertical gaze?\n____________________________________________________________\n19. What is the name of the fiber pathway that interconnects the brainstem gaze\ncenters with the ocular motor nuclei?\n____________________________________________________________\n58 20. What area of the cerebral cortex (Brodmann area) is associated with volitional\neye movements AND what is the Brodmann number of this area?\nCortical Area Brodmann Number\n_____________________________ ________________________\n21. What areas of the cerebral cortex are associated with pursuit (tracking) eye\nmovements AND what are the Brodmann numbers of these areas?\nCortical Area Brodmann Number\n_____________________________ ________________________\n22. Define the following terms:\nsaccades\nvisual pursuit\nheterotropia (tropia)\ncomitant heterotropia\nincomitant heterotropia\nheterophoria (phoria)\nstrabismus\nnystagmus\ndiplopia\nptosis\nduction movements\nversion movements\nvergence movements\nprimary deviation\nsecondary deviation\noscillopsia\nSherrington’s law\nHering’s law\ncover-uncover test\nalternate cover test\nApplication Exercises\n1. What are the two (2) steps involved in the single cover test?\n_____________________________________________________________\n_____________________________________________________________\n59 2. What are the two (2) steps involved in the cover-uncover test?\n____________________________________________________________\n____________________________________________________________\n3. What are the two (2) steps involved in the alternate cover test?\n____________________________________________________________\n____________________________________________________________\n4. In several lab partners perform and describe a method for evaluating the function\nof each the extraocular muscles individually.\n____________________________________________________________\n5. In several lab partners perform the single cover test and describe the findings\nyou would expect in a patient with a lesion involving the right abducens nerve.\n____________________________________________________________\n6. In several lab partners perform the cover/uncover test and describe the findings\nyou would expect in a patient with a lesion involving the left abducens nerve.\n____________________________________________________________\n7. In several lab partners perform the alternate cover test and describe the findings\nyou would expect in a patient with an esophoria.\n____________________________________________________________\n8. Which of the ocular motor nerves may be injured in a patient with transtentorial\n(uncal) herniation?\n_____________________________________________________________\n9. Describe the strabismus expected in a patient with a unilateral lesion involving\nthe right oculomotor nerve.\n________________________________________________________________\n10. What movement will result in maximal diplopia in a patient with a lesion that\naffects the left abducens nerve?\n_______________________________________________________________\n60 11. Damage to which ocular motor nerve will result in anisocoria?\n_______________________________________________________________\n12. Name the ocular motor abnormality likely to be observed in a patient attempting\nto look straight ahead who has a lesion affecting the cavernous part of the left\ncarotid artery.\n_______________________________________________________________\n13. If the patient in the above question reports diplopia in the position of primary\ngaze, shifting the gaze in which direction will result in a worsening of the\ndiplopia?\n_______________________________________________________________\n14. In the patient in the above question, will you expect to find anisocoria? Explain.\n_______________________________________________________________\n15. In several lab partners demonstrate and describe a method for evaluating\nvolitional eye movements.\n_______________________________________________________________\n16. Describe the findings you would expect in a patient with a destructive lesion\ninvolving the posterior part of the frontal lobe on the left side.\n_______________________________________________________________\n17. In several lab partners demonstrate and describe a method for evaluating pursuit\neye movements.\n_______________________________________________________________\n18. Describe the findings you would expect in a patient with a destructive lesion\ninvolving the occipital cortex on the left side.\n_______________________________________________________________\n61 Trigeminal Nerve\nObjectives\n1. Describe the peripheral and central organization and neural connections\nof the trigeminal nerve.\n2. List and describe the functions mediated by the trigeminal nerve.\n3. List, define and describe the major signs and symptoms associated with lesions\naffecting the peripheral and central parts of the trigeminal nerve.\n4. Describe the anatomical and physiological bases of clinical examination\ntechniques used to evaluate the function of the trigeminal nerve.\n5. Demonstrate the ability to evaluate the function of the trigeminal nerves.\nNeuroscience Review Questions\n1. List the three divisions of the trigeminal nerve AND name the intracranial\nforamen through which each passes.\nDivision Foramen\n___________________________ __________________________\n___________________________ __________________________\n___________________________ __________________________\n2. Name the part of the trigeminal nuclear complex where the nociceptive afferent\nfibers terminate.\n_______________________________________________________________\n3. Name the part of the trigeminal nuclear complex where the non-nociceptive\nafferent fibers terminate.\n_______________________________________________________________\n4. Name the tract formed by the trigeminothalamic axons that cross the midline.\n_______________________________________________________________\n62 5. Name the tract formed by the trigeminothalamic axons that do NOT cross the\nmidline.\n______________________________________________________________\n6. Name the three (3) thalamic nuclei that receive synaptic input from the\ntrigeminothalamic tracts.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n7. Name the gyrus where thalamocortical fibers subserving the face terminate.\n______________________________________________________________\n8. What artery supplies the primary sensory cortical area that subserves the face?\n______________________________________________________________\n9. Through which limb of the internal capsule do these face-related thalamocortical\nfibers pass?\n______________________________________________________________\n10. Describe the orientation of the homunculus of the face on the primary sensory\ncortex.\n______________________________________________________________\n11. Name the nucleus comprised of motor neurons with axons that are part of the\ntrigeminal nerve.\n______________________________________________________________\n12. Which division of the trigeminal nerve includes these motor axons?\n______________________________________________________________\n63 13. Name the four (4) major muscles innervated by the trigeminal nerve.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n14. Name the four (4) smaller muscles innervated by the trigeminal nerve.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n15. Name the four (4) reflexes in which the trigeminal nerve serves as the afferent\nlimb.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n16. Name the reflex in which the trigeminal nerve serves as the efferent limb.\n____________________________________________________________\n17. Where are the nerve cell bodies of the afferent limb of the masseter reflex?\n____________________________________________________________\n18. In addition to the skin of the face, what two (2) other structures or region of the\nhead receive sensory innervation by way of the trigeminal nerve?\n___________________________________________________________\n____________________________________________________________\n64 19. Define the following terms:\nmasseter reflex\nlacrimation reflex\nsalivation reflex\nApplication Exercises\n1. On several lab partners mark and describe the areas of skin innervated by each\ndivision of the trigeminal nerve.\n____________________________________________________________\n2. On several lab partners demonstrate and describe a method for evaluating the\nsensory function of the trigeminal nerve.\n____________________________________________________________\n3. On several lab partners demonstrate and describe a method for eliciting the\nmasseter reflex.\n____________________________________________________________\n4. What is the expected response to elicitation of the masseter reflex in a\nneurologically intact individual?\n____________________________________________________________\n5. On several lab partners demonstrate and describe a method for eliciting the\ncorneal reflex.\n____________________________________________________________\n6. Indicate the cranial nerves that subserve the afferent limb AND the efferent limb\nof the corneal reflex.\nAfferent Limb Efferent Limb\n___________________________ _______________________\n7. What is the expected response to elicitation of the corneal reflex in a\nneurologically intact individual?\n_____________________________________________________________\n65 8. On several lab partners demonstrate and describe a method for evaluating the\nintegrity of the motor division of the trigeminal nerve.\n____________________________________________________________\n9. What two (2) muscles can you palpate to evaluate the motor division of the\ntrigeminal nerve?\n____________________________________________________________\n____________________________________________________________\n10. A 40 y/o man presents to the clinic with a sore eye. When you lightly touch the\nright cornea both eyes close briskly. When you lightly touch the left cornea\nneither eye closes. What structure is affected in this patient AND on which side?\nStructure Affected Side Affected\n____________________________ __________________________\n11. A 54 y/o woman presents to the clinic with a sore eye. When you lightly touch the\nright cornea the right eye closes briskly but the left eye does not close. When you\nlightly touch the left cornea the right eye closes briskly but the left eye does not\nclose. What structure is affected in this patient AND on which side?\nStructure Affected Side Affected\n____________________________ __________________________\n66 Facial Nerve\nObjectives\n1. Describe the peripheral and central organization and neural connections\nof the facial nerve.\n2. List and describe the functions mediated by the facial nerve.\n3. List, define and describe the major signs and symptoms associated with\nlesions affecting the peripheral and central parts of the facial nerve.\n4. Describe the anatomical and physiological bases of clinical examination\ntechniques used to evaluate the function of the facial nerve.\n5. Demonstrate the ability to evaluate the function of the facial nerve.\nNeuroscience Review Questions\n1. List the two (2) major divisions of the facial nerve.\n_____________________________________________________________\n_____________________________________________________________\n2. Name the cranial foramen through which the facial nerves passes to exit the\ncranial cavity.\n_____________________________________________________________\n3. Name the part of the brainstem that marks the attachment of the facial nerve.\n_____________________________________________________________\n4. Name the nucleus comprised of lower motor nerve cell bodies that is the origin of\nmotor nerve fibers of the facial nerve.\n_____________________________________________________________\n5. Name the nucleus that is comprised of nerve cells bodies that are the origin of\nthe autonomic nerve fibers in the facial nerve.\n_____________________________________________________________\n67 6. Name the foramen through which the facial nerve proper passes to exit the skull.\n_____________________________________________________________\n7. In addition to the muscles of facial expression, list two (2) other muscles\ninnervated by the facial nerve.\n_____________________________________________________________\n_____________________________________________________________\n8. Name the two (2) parasympathetic ganglia that receive synaptic input from\npreganglionic fibers of the facial nerve.\n_____________________________________________________________\n_____________________________________________________________\n9. Name the two (2) targets of the autonomic nerve fibers of the facial nerve.\n_____________________________________________________________\n_____________________________________________________________\n10. Name the two (2) branches of the facial nerve that carry preganglionic autonomic\nnerve fibers.\n_____________________________________________________________\n_____________________________________________________________\n11. Name the sensory function of the facial nerve.\n_____________________________________________________________\n12. Name the ganglion comprised of the sensory (afferent) cells bodies of the facial\nnerve.\n_____________________________________________________________\n13. Name the nucleus that receives synaptic input from the afferent nerve fibers of\nthe facial nerve.\n_____________________________________________________________\n68 14 Name the ascending tract (pathway) formed by the axons of the cells of the\nabove-named nucleus.\n____________________________________________________________\n15. Name the two (2) diencephalic nuclei and two (2) brainstem nuclei that receive\nsynaptic input from this ascending gustatory pathway.\nDiencephalic Nuclei Brainstem Nuclei\n__________________________ ____________________________\n__________________________ ____________________________\n16. Name the gyrus where thalamocortical fibers subserving taste terminate.\n____________________________________________________________\n17. Through which limb of the internal capsule do these thalamocortical fibers pass?\n____________________________________________________________\n18. Name the gyrus that contains cortical upper motor neurons that innervate the\nfacial nucleus.\n___________________________________________________________\n19. Through which limb of the internal capsule do these descending fibers pass?\n____________________________________________________________\n20. Define the following terms:\nBell’s palsy\nBell’s phenomenon\nageusia\n69 Application Exercises\n1. What four (4) muscles are commonly tested when evaluating the motor function\nof the facial nerve?\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n2. On several lab partners demonstrate and describe a method for evaluating the\nsomatic motor function of the facial nerve.\n____________________________________________________________\n3. Which facial muscles will be affected by a lesion that damages the internal\ncapsule on the left side AND on which side will each be affected?\nMuscle Affected Side Affected\n__________________________ ____________________________\n__________________________ ____________________________\n__________________________ ____________________________\n__________________________ ____________________________\n4. Which facial muscles will be affected by a lesion that damages the facial nerve\non the right side AND on which side will each be affected?\nMuscle Affected Side Affected\n__________________________ ____________________________\n__________________________ ____________________________\n__________________________ ____________________________\n__________________________ ____________________________\n70 5. A 36 y/o man underwent a surgical procedure in which the chorda tympani was\ninadvertently damaged on the right side. What two (2) functions will be affected\nin this patient?\n____________________________________________________________\n____________________________________________________________\n6. A 12 y/o girl was diagnosed with a glioma that has invaded the Vidian canal and\ndamaged the neural structure located therein. What sign or symptom would you\nlook for in this girl?\n_____________________________________________________________\n7. What symptom would you expect in a patient with a lesion affecting the nerve to\nthe stapedius?\n______________________________________________________________\n71 Cochlear Nerve\nObjectives\n1. Describe the basic neuroanatomical organization of the auditory system.\n2. Describe the technique of performing the Rinne’ test and indicate the inferences\nthat can be drawn from the results.\n3. Describe the technique of performing the Weber test and indicate the inferences\nthat can be drawn from the results.\nNeuroscience Review Questions\n1. Name the middle ear ossicles AND indicate the branchial arch each is derived\nfrom.\nOssicle Branchial Arch\n___________________________ __________________________\n___________________________ __________________________\n___________________________ __________________________\n2. Two of the ossicles listed above have muscular attachments. Name the two\nossicles with attached muscles AND name the muscle attached to each.\nOssicle Muscle\n__________________________ _________________________\n__________________________ _________________________\n3. Name the two (2) muscles attached to ossicles AND name the nerve that\ninnervates each.\nMuscle Nerve\n__________________________ _________________________\n__________________________ _________________________\n72 4. On which membrane of the organ of Corti do the auditory receptor cells rest?\n______________________________________________________________\n5. Which membrane of the organ of Corti separates the scala vestibuli from scala\nmedia (cochlear duct)?\n______________________________________________________________\n6. Which membrane of the organ of Corti separates the scala tympani from the\nscala media (cochlear duct)?\n______________________________________________________________\n7. Which membrane of the organ of Corti makes contact with the cilia of the\nauditory receptor cells?\n______________________________________________________________\n8. Describe the tonotopic organization of the auditory receptor cells. (Which tones\nare represented at the base and which tones are represented at the apex?)\n______________________________________________________________\n9. Name the ganglion comprised of the afferent cell bodies of the auditory nerve.\n______________________________________________________________\n10. Name the cranial foramen through which the auditory nerve passes to enter the\ncranial cavity.\n_____________________________________________________________\n11. Name the nuclei where the axons of the auditory nerve terminate.\n_____________________________________________________________\n12. Name the three (3) decussating pathways that originate from the cochlear\nnuclei.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n73 13. Which of the above decussating pathways is referred to as the trapezoid body?\n_____________________________________________________________\n14. Name the ascending auditory pathway that arises from the cochlear nuclei.\n_____________________________________________________________\n15. Name the mesencephalic nucleus that receives synaptic input from the above-\nnamed pathway.\n_____________________________________________________________\n16. Name the thalamic nucleus that receives auditory information.\n____________________________________________________________\n17. Name the pathway (tract) formed by the axons that arise from the mesencephalic\nnucleus named above and terminates in the thalamic nucleus named above.\n____________________________________________________________\n18. Name the gyrus where thalamocortical fibers subserving auditory function\nterminate AND indicate is its Brodmann number?\nGyrus Name Brodmann Number\n____________________________ _______________________\n19. Through which limb of the internal capsule do these thalamocortical fibers\npass?\n____________________________________________________________\n20. Describe the tonotopic organization of the primary auditory cortex. (Which tones\nare represented anterolaterally and which tones are represented\nposteromedially in the primary auditory cortex?)\n____________________________________________________________\n21. What Brodmann areas are referred to as auditory association areas?\n____________________________________________________________\n74 22. What specific auditory association area is related to language function?\n____________________________________________________________\n23. Sudden loud sounds can elicit two (2) reflex responses that help to dampen the\nmovements of the ossicles. List the two muscles involved AND indicate the nerve\nthat innervates each.\nMuscle Nerve\n__________________________ __________________________\n__________________________ __________________________\n24. Define the following terms:\ntonotopia\nhypacusis\nconduction deafness\nsensorineural deafness\ntinnitus\npresbycusis\nstapedius reflex\nRinne’ test\nWeber test\ntonotopia\nApplication Exercises\n1. Does most of the auditory information that reaches the cerebral cortex arise from\nthe ipsilateral side or contralateral ear?\n____________________________________________________________\n2. On several lab partners demonstrate and describe a screening method for\nevaluating auditory function.\n____________________________________________________________\n3. On several lab partners demonstrate and describe a method for performing the\nRinne’ test.\n____________________________________________________________\n75 4. Which tuning fork is recommended for use when performing the Rinne’ test?\n__________________Hz\n5. In a patient with suspected hearing loss in the right ear, the Rinne’ test reveals\nthat AC>BC. Is this finding suggestive of conduction deafness or sensorineural\ndeafness of the right ear?\n____________________________________________________________\n6. In a patient with suspected hearing loss in the left ear, the Rinne’ test reveals that\nBC>AC. Is this finding suggestive of conduction deafness or sensorineural\ndeafness of the left ear?\n____________________________________________________________\n7. On several lab partners demonstrate and describe a method for performing the\nWeber test.\n____________________________________________________________\n8. Which tuning fork is recommended for use when performing the Weber test?\n__________________Hz\n9. In a patient with suspected hearing loss in the right ear, the Weber test\nlateralizes to the left side. Is this finding suggestive of conduction deafness or\nsensorineural deafness of the right ear?\n____________________________________________________________\n10 In a patient with suspected hearing loss in the left ear, the Weber test lateralizes\nto the left side. Is this finding suggestive of conduction deafness or sensorineural\ndeafness of the left ear?\n____________________________________________________________\n76 Vestibular Nerve\nObjectives\n1. List and briefly describe the stimuli appropriate for activating receptors\nin the semicircular canals and otolithic organs.\n2. List the signs and symptoms commonly associated with unilateral disease\naffecting vestibular receptors or vestibular nerve.\n3. Describe the neuroanatomical organization and functions of the vestibulo-\nocular reflexes (oculo-cephalic and oculo-vestibular).\n4. List and describe the major causes of dizziness.\n5. Describe a mechanism for jerk nystagmus.\n6. Describe the technique of cold caloric testing.\nNeuroscience Review Questions\n1. Which vestibular receptor is responsive to angular (rotatory) acceleration and\ndeceleration AND where are these receptors located?\nReceptor Location\n___________________________ __________________________\n2. Which vestibular receptor is responsive to linear acceleration and deceleration\nAND where are these receptors located?\nReceptor Location\n___________________________ ___________________________\n3. Which of the receptors indicated above is associated with otoconia?\n_______________________________________________________________\n4. Name the ganglion comprised of the afferent cell bodies of the vestibular nerve.\n_______________________________________________________________\n77 5. Name the cranial foramen through which the vestibular nerve passes to enter the\ncranial cavity.\n_____________________________________________________________\n6. Name the nuclei where the axons of the vestibular nerve terminate.\n_____________________________________________________________\n7. Which of the vestibular nuclei preferentially receive synaptic input from the\nreceptors in the semicircular canals?\n_____________________________________________________________\n8. Which of the vestibular nuclei preferentially receive synaptic input from the\nreceptors in the utricle and saccule?\n_____________________________________________________________\n9. Which of the vestibular nuclei preferentially give rise to axons that ascend in the\nmedial longitudinal fasciculus?\n_____________________________________________________________\n10. Which of the vestibular nuclei preferentially give rise to axons that descend in the\nmedial vestibulospinal tract?\n_____________________________________________________________\n11. In which region of the spinal cord is the medial vestibulospinal tract located?\n_____________________________________________________________\n12. Which nucleus gives rise to axons that descend in the lateral vestibulospinal\ntract?\n_____________________________________________________________\n13. In which region of the spinal cord is the lateral vestibulospinal tract located?\n_____________________________________________________________\n14. Which lobe of the cerebellum is reciprocally connected with the vestibular\nnuclei?\n_____________________________________________________________\n78 15. What is the name of the fiber pathway that interconnects the vestibular nuclei\nwith the cerebellum?\n_____________________________________________________________\n16. What nucleus of the brainstem receives projections from the vestibular nuclei and\nplays a role in vomiting?\n_____________________________________________________________\n17. What nucleus of the brainstem receives projections from the vestibular nuclei and\nplays a role in pharyngeal muscle activity?\n_____________________________________________________________\n18. What region of the brainstem that receives projections from the vestibular nuclei\nplays a role in mediating sweating and facial pallor?\n_____________________________________________________________\n19. Name three (3) nuclei of the diencephalon that receive synaptic input from the\nvestibular nuclei.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n20. What is the effect on impulse frequency in the left vestibular nerve when the\nhead is rotated to the left?\n_____________________________________________________________\n21. Describe the pathophysiological bases for each of the following:\nvertiginous dizziness\npresyncopal dizziness\ndisequilibrium\nlightheadedness\n22. Define the following terms:\nvertigo\noscillopsia\n79 nystagmus\npositional nystagmus\ngaze-evoked nystagmus\nvestibulo-ocular reflexes\noculo-vestibular reflex\noculo-cephalic reflex\ncanal paresis\nDix-Hallpike maneuver\nEpply maneuver\nApplication Exercises\n1. Slowly rotate a lab partner to the left on a revolving stool at a rate of 1/2\nrevolution per second for eight (8) revolutions. Stop the subject and observe the\nsubject’s eyes. Name the type of nystagmus you observe.\n_______________________________________________________________\n2. Describe the response you would expect to elicit in a neurologically intact\nindividual in whom you irrigate the right external ear canal with cold water.\n_______________________________________________________________\n3. Describe a method for eliciting the oculo-cephalic reflex.\n_______________________________________________________________\n4. Describe a method for eliciting the oculo-vestibular reflex.\n_______________________________________________________________\n5. Demonstrate the use of “past-pointing” in the evaluation if suspected vestibular\nnerve dysfunction.\n_______________________________________________________________\n6. Describe the observation you might expect when using “past-pointing” in a\npatient with damage to the right vestibular nerve\n_______________________________________________________________\n7. Demonstrate the use of “marching-in-place” in the evaluation if suspected\nvestibular nerve dysfunction.\n_______________________________________________________________\n80 8. Describe the observation you might expect when using “marching-in-place” in a\npatient with damage to the left vestibular nerve\n_______________________________________________________________\n9. Name the type of nystagmus that might be observed in a patient with an acute\ndestructive lesion affecting the right vestibular nerve.\n_______________________________________________________________\n10. Describe the findings you might expect with cold caloric testing of the right side\nin a patient with a supra-tentorial lesion.\n______________________________________________________________\n11. Describe the findings you might expect with cold caloric testing of the right side\nin a patient with damage to the vestibular nerve on the right side.\n_____________________________________________________________\n12. What is the term used to describe the type of rigidity observed in a patient with a\nlesion above the level of the midbrain?\n______________________________________________________________\n13. What is the term used to describe the type of rigidity observed in a patient with a\nlesion at the level of the mid pons?\n______________________________________________________________\n14. A 30 y/o man with dizziness and an imaging-confirmed lesion involving the left\nvestibular nerve presents to the ENT clinic. The patient demonstrates rotation\nwhen performing marching in place. Which direction will he rotate during this\ntest?\n______________________________________________________________\n15. A 42 y/o woman presents with hearing loss and left horizontal jerk nystagmus.\nShe is diagnosed with disease resulting in damage to the vestibular nerve. On\nwhich side is her disease?\n______________________________________________________________\n81 Glossopharyngeal and Vagus Nerves\nObjectives\n1. Describe the peripheral and central organization and neural connections of the\nglossopharyngeal and vagus nerves.\n2. List and describe the functions mediated by the glossopharyngeal and vagus,\nnerves.\n3. List, define and describe the major signs and symptoms associated with lesions\naffecting the peripheral and central parts of the glossopharyngeal and\nvagus nerves.\n4. Describe the anatomical and physiological bases of clinical examination\ntechniques used to evaluate the function of the glossopharyngeal and\nvagus nerves.\n5. Demonstrate the ability to evaluate the function of the glossopharyngeal and\nvagus nerves.\nNeuroscience Review Questions\n1. Name the sulcus of the brainstem that marks the attachment of the\nglossopharyngeal nerve.\n_____________________________________________________________\n2. Name the cranial foramen through which the glossopharyngeal nerves passes to\nexit the cranial cavity.\n_____________________________________________________________\n3. Name the skeletal muscle that is innervated by the glossopharyngeal nerve.\n_____________________________________________________________\n4. Name the nucleus in the brainstem that is the origin of axons that innervate the\nmuscle indicated above.\n_____________________________________________________________\n82 5. Name the gland that is innervated by the glossopharyngeal nerve.\n_____________________________________________________________\n6. Name the nucleus in the brainstem that is the origin of preganglionic axons that\nare part of the glossopharyngeal nerve.\n_____________________________________________________________\n7. Name the ganglion that receives synaptic input from the preganglionic axons of\nthe glossopharyngeal nerve.\n______________________________________________________________\n8. Name the structure that is innervated by the postganglionic nerve cells indicated\nabove.\n______________________________________________________________\n9. Name the two sensory receptors that, when activated, transmit impulses toward\nthe brainstem by way of the glossopharyngeal nerve AND name the sensory\nganglia formed by the cell bodies that innervate each.\nReceptor Ganglion\n__________________________ _____________________________\n__________________________ _____________________________\n10. Name the nucleus in the brainstem where the central processes from each of the\nganglia listed above terminate.\nGanglion Brainstem Nucleus\n__________________________ ____________________________\n__________________________ ____________________________\n11. Name the sulcus of the brainstem that marks the attachment of the vagus\nnerve.\n_____________________________________________________________\n83 12. Name the cranial foramen through which the vagus nerves passes to exit the\ncranial cavity.\n_____________________________________________________________\n13. Name the two (2) skeletal muscle groups that are innervated by the vagus\nnerve.\n_____________________________________________________________\n_____________________________________________________________\n14. Name the muscle innervated by the external laryngeal nerve.\n_____________________________________________________________\n15. Name the branch of the vagus nerve that innervates the laryngeal muscles.\n_____________________________________________________________\n16. Name the nucleus in the brainstem that is the origin of axons that innervate the\nlaryngeal muscles.\n_____________________________________________________________\n17. Name the nucleus in the brainstem that is the origin of axons that influence\nactivity of the heart.\n_____________________________________________________________\n18. Name the nucleus in the brainstem that is the origin of axons that influence\nactivity of the circular and longitudinal muscles of small intestine.\n_____________________________________________________________\n19. Name the ganglion comprised of nerve cell bodies with axons that carry afferent\n(sensory) information from the duodenum.\n_____________________________________________________________\n20. Name the ganglion comprised of nerve cell bodies with axons that carry afferent\n(sensory) information from the meninges.\n_____________________________________________________________\n84 21. Name the two sensory receptors that, when activated, transmit impulses toward\nthe brainstem by way of the vagus nerve AND name the sensory ganglia formed\nby the cell bodies that innervate each.\nReceptor Ganglion\n__________________________ _____________________________\n__________________________ _____________________________\n22. Name the nucleus in the brainstem where the afferent (sensory) fibers from the\nstomach terminate.\n_____________________________________________________________\n23. Name the nucleus in the brainstem where the afferent (sensory) fibers from the\nmeninges terminate.\n_____________________________________________________________\n24. Define the following terms:\ndysphagia\ndysarthria\ndysphonia\ncarotid sinus reflex\ncarotid body reflex\nApplication Exercises\n1. What cranial nerves serve as the afferent and efferent limbs of the pharyngeal\n(gag) reflex?\nAfferent Limb Efferent Limb\n___________________________ ________________________\n2. What ganglion is formed in part by the nerve cell bodies of the nerve that serves\nas the afferent limb of the pharyngeal (gag) reflex?\n_____________________________________________________________\n3. What muscle is innervated by the nerve that serves as the efferent limb of the\npharyngeal (gag) reflex?\n______________________________________________________________\n85 4. What muscle forms the posterior pillar of the tonsillar fossa?\n______________________________________________________________\n5. What muscle forms the anterior pillar of the tonsillar fossa?\n______________________________________________________________\n6. What cranial nerve innervates the carotid sinus?\n______________________________________________________________\n7. What cranial nerve innervates the carotid body?\n_____________________________________________________________\n8. In a patient with a lesion involving the left glossopharyngeal nerve, which way\nwill the uvula deviate when the patient is asked to say, “AAAHHH”?\n_____________________________________________________________\n9. In a patient with a lesion involving the right vagus nerve, which way will the\nuvula deviate when the patient is asked to say, “AAAHHH”?\n_____________________________________________________________\n10. In a patient with a lesion involving the left glossopharyngeal nerve, what will you\nlikely observe when you touch the right tonsillar fossa?\n___________________________________________________________\n11. In a patient with a lesion involving the left glossopharyngeal nerve, what will you\nlikely observe when you touch the left tonsillar fossa?\n___________________________________________________________\n86 Accessory Nerve\nObjectives\n1. Describe the peripheral and central organization and neural connections\nof the accessory nerve.\n2. List and describe the functions mediated by the accessory nerve.\n3. List, define and describe the major signs and symptoms associated with\nlesions affecting the peripheral and central parts of the accessory nerve.\n4. Describe the anatomical and physiological bases of clinical examination\ntechniques used to evaluate the function of the accessory nerve.\n5. Demonstrate the ability to evaluate the function of the accessory nerve.\nNeuroscience Review Questions\n1. Name the nucleus formed by the cell bodies that give rise to the axons of the\naccessory nerve.\n_____________________________________________________________\n2. Are the cortical upper motor neurons that innervate the above named nucleus\nlocated on the ipsilateral or contralateral side?\n_____________________________________________________________\n3. Name the foramen through which the fibers of the accessory nerve enter the\ncranial cavity.\n_____________________________________________________________\n4. Name the foramen through which the fibers of the accessory nerve exit the\ncranial cavity.\n_____________________________________________________________\n5. Name the two (2) muscles innervated by the accessory nerve.\n_____________________________________________________________\n_____________________________________________________________\n87 6. Define the following term:\ntorticollis\nApplication Exercise\n1. In several lab partners demonstrate and describe a method for evaluating the\nfunction of the accessory nerve.\n_____________________________________________________________\n88 Hypoglossal Nerve\nObjectives\n1. Describe the peripheral and central organization and neural connections of the\nhypoglossal nerve.\n2. List and describe the functions mediated by the hypoglossal nerve.\n3. List, define and describe the major signs and symptoms associated with lesions\naffecting the peripheral and central parts of the hypoglossal nerve.\n4. Describe the anatomical and physiological bases of clinical examination\ntechniques used to evaluate the function of the hypoglossal nerve.\n5. Demonstrate the ability to evaluate the function of the hypoglossal nerve.\nNeuroscience Review Questions\n1. Name the sulcus of the brainstem that marks the attachment of the hypoglossal\nnerve.\n_____________________________________________________________\n2. Name the nucleus formed by the cell bodies that give rise to the axons of the\nhypoglossal nerve.\n_____________________________________________________________\n3. Are the cortical upper motor neurons that innervate the above-named nucleus\nlocated on the ipsilateral or contralateral side?\n_____________________________________________________________\n4. Name the foramen through which the fibers of the hypoglossal nerve exit the\ncranial cavity.\n_____________________________________________________________\n89 5. Name the three (3) extrinsic muscles of the tongue innervated by the hypoglossal\nnerve.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n6. Name the one (1) extrinsic muscle of the tongue that is NOT innervated by the\nhypoglossal nerve.\n_____________________________________________________________\n7. Define the following terms:\ndysphonia\ndysarthria\nApplication Exercises\n1. Which extrinsic muscle of the tongue is used to protrude the tongue as\nperformed as part of the evaluation of the hypoglossal nerve?\n_____________________________________________________________\n2. On several lab partners demonstrate and describe a method for evaluating the\nfunction of the hypoglossal nerve.\n_____________________________________________________________\n3. In a patient with a lesion involving the right hypoglossal nerve, which side of the\ntongue will demonstrate atrophy?\n___________________________________________________________\n4. In a patient with a lesion involving the left hypoglossal nerve, which way will the\ntongue deviate on protrusion?\n___________________________________________________________\n90 Consciousness\nObjectives\n1. Describe the differences between level of consciousness and content of\nconsciousness.\n2. Describe behaviors commonly associated with level and content of\nconsciousness.\n3. Describe the relationship between consciousness and the reticular formation.\n4. Describe selected tests used to evaluate consciousness.\nNeuroscience Review Questions\n1. What are the two categories of consciousness?\n____________________________________________________________\n____________________________________________________________\n2. List four (4) terms that refer to altered levels of consciousness.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n3. List four (4) brainstem reflexes commonly used to localize lesions that affect level\nof consciousness.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n91 4. List four (4) physiological processes mediated by brainstem centers that may be\naffected in patients with brainstem lesions that alter level of consciousness\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n5. List the three (3) categories of responses observed when administering the\nGlasgow Coma Scale.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n6. Decreased level of consciousness suggests brainstem dysfunction. List the main\ncauses of brainstem injury associated with altered level of consciousness.\na. primary (direct) causes of brainstem injury\n______________________________________________________\n______________________________________________________\nb. secondary (indirect) causes brainstem injury\n______________________________________________________\n______________________________________________________\n7. List four (4) cerebral (higher cortical) functions commonly assessed when\nevaluating a patient with altered content of consciousness.\n___________________________________________________________\n___________________________________________________________\n___________________________________________________________\n___________________________________________________________\n92 8. Decreased content of consciousness suggests cerebral dysfunction. List the\nmain cause of cerebral injury associated with altered content of consciousness.\n___________________________________________________________\n9. Describe the alterations in muscle tone and resulting changes in limb position\n(upper limbs and lower limbs) in a patient that exhibits decerebrate rigidity.\nUpper Limbs ___________________________________________\nLower Limbs ___________________________________________\n10. Describe the alterations in muscle tone and resulting changes in limb position\n(upper limbs and lower limbs) in a patient that exhibits decorticate rigidity.\nUpper Limbs ____________________________________________\nLower Limbs ____________________________________________\n11. Define the following terms:\nlevel of consciousness (arousal)\ncontent of consciousness (awareness)\nalert\nlethargy\nobtundation\nstupor\ncoma\nconfusion\ndelirium\nacute confusional state\nvegetative state\nminimally conscious state\ndecorticate rigidity\ndecerebrate rigidity\nApplication Exercises\n1. On several lab partners demonstrate and describe a method for evaluating and\ndocumenting the results of testing each of the following brainstem reflexes:\na. pupillary light reflexes\nb. corneal reflex\nc. vestibule-ocular reflex (oculo-cephalic reflex)\nd. pharyngeal reflex\n93 2. On several lab partners demonstrate and describe a method for evaluating and\ndocumenting the results of testing each of the following cerebral functions:\na. attention\nb. orientation\nc. memory function\nimmediate recall\nshort term memory\nlong term memory\n94 Attention\nObjectives\n1. Define the three major attention-related cognitive tasks: capturing, focusing, and\nmaintaining.\n2. Describe the concepts of selective attention and divided attention.\n3. Describe several simple clinical tests of attention.\nNeuroscience Review Questions\n1. Identify the three (3) major nuclei of the ascending reticular activating system\n(ARAS) and indicate the main neurotransmitter synthesized by the cells that form\neach.\nNucleus Neurotransmitter\n_________________________ __________________________\n_________________________ __________________________\n_________________________ __________________________\n2. The axons of the cells identified in the above question ascend to the cerebrum\nwhere they terminate in wide variety of nuclei and cortical areas. Identify the\npathway formed by the axons of these cells as they pass through the\ndiencephalon.\n______________________________________________________________\n3. Describe the location within the diencephalon of the pathway identified in the\nprevious question.\n______________________________________________________________\n4. Describe the location and function of the reticular nucleus of the thalamus.\n______________________________________________________________\n______________________________________________________________\n95 5. Define the following terms:\nreticular formation\nreticular activating system\nattention\nselective\ndivided\ndelirium\nconcentration\nvigilance\nhemispheric neglect\nApplication Exercises\n1. Demonstrate and describe the method used to evaluate attention embedded in\nthe Mini Mental State exam.\n______________________________________________________________\n2. Demonstrate and describe one or more alternative and more reliable test for\nevaluating attention.\n______________________________________________________________\n96 Orientation\nObjectives\n1. List and describe the three (3) primary domains of orientation.\n2. Indicate several, standard questions commonly used for evaluating orientation.\n3. Discuss the diagnostic and functional implications for patients with impaired\norientation.\nNeuroscience Review Questions\n1. Being oriented indicates an awareness of self and one’s surroundings. List the\nareas of orientation commonly assessed in the neurologic exam.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n(____________________________________________________________)\n2. List two (2) questions that might be asked to evaluate orientation to person.\n______________________________________________________________\n______________________________________________________________\n3. List five (5) questions that might be asked to evaluate orientation to place.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n97 4. List five (5) questions that might be asked to evaluate orientation to time.\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n5. Disorientation to which of the above is MOST likely to be indicative of a\npsychiatric disorder?\n______________________________________________________________\n6. Define the following terms:\ndisorientation\npsychosis\nApplication Exercises\n1. Demonstrate and describe a method for evaluating orientation.\n______________________________________________________________\n2. Describe a method for documenting the findings in a patient who is disoriented to\nplace.\n______________________________________________________________\n98 Language Function\nObjectives\n1. Identify areas of the right and left cerebral hemispheres that are important in\nlanguage function.\n2. Describe the pathways interconnecting the cortical language areas.\n3. List and describe specific language deficits associated with focal lesions\naffecting different parts of the cerebral cortex.\n4. Describe simple tests for evaluating language function.\nNeuroscience Review Questions\n1. Speaking and language are two separate functions. Speaking involves the\nproduction of sounds. Language involves the use of symbols (auditory or visual)\nto communicate information. List the four (4) physiological operations involved in\nspeaking (speech).\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n______________________________________________________________\n2. What is the term used to describe visual symbols used for communication?\n______________________________________________________________\n3. What is the term used to describe auditory symbols used for communication?\n______________________________________________________________\n99 4. Both the left and the right hemispheres are involved in language function. What\ncomponents of language function are mediated by each?\nFunctional Component\nLeft hemisphere __________________________________\nRight hemisphere __________________________________\n5. List the three (3) major operations associated with oral language function and\nindicate the main brain regions/structures important for each.\nLanguage Operation Important Brain Region/Structure\n__________________________ ___________________________\n__________________________ ___________________________\n__________________________ ___________________________\n6. What are the Brodmann areas (numbers) associated with each of the following:\nBroca’s area ________________\nWernicke’s area ________________\n7. What is the arterial blood supply to Broca’s area? (Be specific.)\n_______________________________________________________________\n8. What is the arterial blood supply to Wernicke’s area? (Be specific.)\n_______________________________________________________________\n9. What four (4) terms can be used synonymously with Broca’s aphasia?\n_______________________________________________________________\n10. What four (4) terms can be used synonymously with Wernicke’s aphasia?\n_______________________________________________________________\n100 11. Define the following terms:\nfluency\nprosody\naphasia\ntranscortical motor aphasia\ntranscortical sensory\nconduction\nglobalaphasia\nnon-fluent aphasia\nfluent aphasia\nneologism\nanomia\ndysphasia\ndysarthria\ndysphonia\nplanum temporale\naphasia\nagraphia\nanomia\nalexia\nphoneme\ngrapheme\npropositional language\nprosodic language\nparaphasia\nWernicke’s aphasia\nBroca’s aphasia\nApplication Exercises\n1. List the five (5) language operations commonly evaluated.\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n_____________________________________________________________\n101 2. On several lab partners demonstrate and describe a method for evaluating\nfluency.\n_____________________________________________________________\n3. On several lab partners demonstrate and describe a method for evaluating\ncomprehension.\n_____________________________________________________________\n4. On several lab partners demonstrate and describe a method for evaluating\nrepetition.\n_____________________________________________________________\n5. On several lab partners demonstrate and describe a method for evaluating object\nnaming.\n_____________________________________________________________\n6. On several lab partners demonstrate and describe a method for evaluating\nreading.\n_____________________________________________________________\n7. On several lab partners demonstrate and describe a method for evaluating\nwriting.\n_____________________________________________________________\n8. What percentage of naturally right-handed individuals who sustain a lesion in the\nleft hemisphere are likely to demonstrate impaired fluency or comprehension?\n_________________\n9. What percentage of naturally right-handed individuals who sustain a lesion in the\nright hemisphere are likely to demonstrate impaired fluency or comprehension?\n_________________\n10. What percentage of naturally left-handed individuals who sustain a lesion in the\nleft hemisphere are likely to demonstrate impaired fluency or comprehension?\n_________________\n102 11. What percentage of naturally left-handed individuals who sustain a lesion in the\nright hemisphere are likely to demonstrate impaired fluency or comprehension?\n_________________\n12. Describe the clinical findings regarding language function in a right-handed man\nwho sustains a lesion that damages the arcuate fasciculus on the right side.\n_____________________________________________________________\n13. What finding on clinical examination helps to distinguish a patient with a Broca’s\naphasia from a patient with a transcortical motor aphasia?\n_____________________________________________________________\n14. What finding on clinical examination helps to distinguish a patient with a\nWernicke’s aphasia from a patient with a transcortical sensory aphasia?\n_____________________________________________________________\n15. Mr. Dextra is a right-handed man with an infarction involving the middle cerebral\nartery territory in the right cerebral hemisphere. Mr. Sinstra is a left-handed man\nwith an infarction involving the middle cerebral artery territory in the right cerebral\nhemisphere. Which of these two individuals is most likely to demonstrate\ndysprosody on examination?\n_____________________________________________________________\n16. What is the most likely location of a lesion that results in a global aphasia?\n_____________________________________________________________\n17. What is the most likely location of a lesion that results in a Broca’s aphasia?\n____________________________________________________________\n18. What is the most likely location of a lesion that results in a Wernicke’s aphasia?\n____________________________________________________________\n19. What is the basic pathophysiological mechanism leading to the development of a\ntranscortical sensory aphasia?\n____________________________________________________________\n103 Learning and Memory\nObjectives\n1. List the structures that comprise the limbic system.\n2. Describe the functions commonly associated with the hippocampal formation.\n3. Describe the histological organization of the hippocampal formation.\n4. Describe the afferent and efferent connections of the hippocampal formation.\n5. Describe and discuss the neural mechanisms associated with the processes of\nlearning and remembering.\nNeuroscience Review Questions\n1. What is the major cortical area involved in the formation of memories?\n____________________________________________________________\n2. What are the three (3) cortical structures that comprise the hippocampal\nformation?\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n3. What is the distinctive histological feature that distinguishes the hippocampal\nformation from other cortical areas of the hemisphere?\n____________________________________________________________\n4. What are the names of the two (2) fiber pathways that transmit information into\nthe hippocampal formation from the adjacent cortex (entorhinal cortex)?\n____________________________________________________________\n____________________________________________________________\n104 5. What is Sommer’s sector and what is its functional/clinical significance?\n____________________________________________________________\n____________________________________________________________\n6. Where are the cell bodies of fibers referred to as Schaffer collaterals?\n____________________________________________________________\n7. Where are the cell bodies of fibers referred to as mossy fibers?\n____________________________________________________________\n8. What is the location of the majority of cells that give rise to the fornix?\n____________________________________________________________\n9. What three (3) nuclei do most of the fibers of the fornix terminate in?\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n10. Describe the Papez circuit (beginning in the temporal lobe).\n____________________________________________________________\n____________________________________________________________\n11. What are the time frames associated with each of the following types of\nmemory?\nworking memory ______________________________________\nshort term memory ______________________________________\nlong term memory ______________________________________\n105 12. Define the following terms:\nhippocampal formation\nhippocampus\ncornu ammonis\nalveus\nfimbria\ndeclarative (explicit) memory\nprocedural (implicit) memory\namnesia\nretrograde\nanterograde\nemotion\nPapez circuit\nApplication Exercises\n1. List the four (4) words that YOU will use (now and forever more) when you\nevaluate memory function in your patients. (Hint: select an object, a color, a\ncharacteristic and a number; and present them to the patient always in this\norder.) Write them below, memorize them and use them consistently.\n_______________________________________ (object)\n_______________________________________ (color)\n_______________________________________ (characteristic)\n_______________________________________ (number)\n2. On several lab partners demonstrate and describe a method for assessing\nworking memory (immediate recall).\n_____________________________________________________________\n3. On several lab partners demonstrate and describe a method for assessing short\nterm memory.\n_____________________________________________________________\n4. On several lab partners demonstrate and describe a method for assessing long\nterm memory.\n_____________________________________________________________\n106 5. In patients who may be unable to speak, visual memory for objects hidden in the\nroom may be tested. In several lab partners demonstrate a method for evaluating\nvisual memory.\n_____________________________________________________________\n6. Describe a method for documenting findings on memory testing.\n_____________________________________________________________\n7. Lesions affecting what cortical area are most likely to result in impaired short-\nterm memory?\n_____________________________________________________________\n8. Lesions affecting what nuclear structure are most likely to result in impaired\nshort-term memory?\n_____________________________________________________________\n9. Where are long term visual memories most likely stored?\n_____________________________________________________________\n10. Where are long term auditory memories most likely stored?\n_____________________________________________________________\n107 Cognitive Function\nObjectives\n1. List and describe several behaviors (there are many!) that rely of the functional\nand structural integrity of the cerebral hemisphere operating as a whole.\n2. Describe some commonly used approaches for evaluating these cognitive\nfunctions.\n3. Discuss how impairment of these cognitive functions can affect patient’s lives\nincluding activities of daily living (ADL’s).\nNeuroscience Review Questions\n1. Cognitive function (higher cortical function) generally means operations mediated\nby cells of the cerebral cortex other than simply perceiving stimuli and initiating\nmovement. These functions typically include thinking, planning, judging, deciding,\ncalculating. The cortical cells involved are described as forming the modality\nspecific and integrative association cortices of both cerebral hemispheres.\n2. Typical “cognitive functions” tested include fund of knowledge, calculation ability,\nproverb interpretation and praxis.\n3. List the three (3) clinical findings that define Balint’s syndrome.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n4. List the four (4) clinical findings that define Gerstmann syndrome.\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n____________________________________________________________\n108 5. Define the following terms:\nacalculia\ngnosia\nagnosia\napperceptive agnosia\nassociative agnosia\nprosopagnosia\nstereognosia\npraxis\napraxia\nideational apraxia\nideomotor apraxia\nlimb-kinetic apraxia\nbuccofacial apraxia\ndressing apraxia\nocular motor apraxia\nconstructional apraxia\namnesia\ntransitive movements\nintransitive movements\nApplication Exercises\n1. Evaluating fund of knowledge involves having the individual describe/discuss\ntopics of general understanding in areas that the individual would be expected to\nhave some understanding of. An adequate history is required in order to identify\nappropriate topics for discussion. In several lab partners whom you have some\nprevious familiarity with demonstrate and describe a method for evaluating fund\nof knowledge. Document your finding as you would in a patient’s chart.\n_____________________________________________________________\n2. Calculation ability refers to the ability to correctly perform simple arithmetical\ncalculations and is determined by asking the individual to solve simple arithmetic\nproblems involving addition, subtraction, multiplication, and division. In several\nlab partners demonstrate and describe a method for evaluating calculation ability.\nDocument your findings as you would in a patient’s chart.\n_____________________________________________________________\n109 3. Proverb interpretation is an example of abstract interpretation. It involves the\nability to make an interpretation of a statement other than a literal one. In several\nlab partners demonstrate and describe a method for evaluating proverb\ninterpretation. Document your findings as you would in a patient’s chart.\n_____________________________________________________________\n4. Praxis refers to the ability to perform previously learned movements. In several\nlab partners demonstrate and describe a method for assessing the ability to\nperform an intransitive movement.\n_____________________________________________________________\n5. Praxis refers to the ability to perform previously learned movements. In several\nlab partners demonstrate and describe a method for assessing the ability to\nperform a transitive movement.\n_____________________________________________________________\n6. In several lab partners demonstrate and describe a method for evaluating tactile\ngnosis. Document your findings as you would in a patient’s chart.\n_____________________________________________________________\n110 Answer Key\nAnterolateral System\nNeuroscience Review\n1. high\nslowly\n2. mechanical\nchemical\nthermal\n3. C 0.5 – 2.0 m/sec\nAδ 12 – 30 m/sec\n4. dorsal horn\n5. laminae I, II, V\n6. anterior white commissure\n7. reticular formation\nsuperior colliculus\n8. ventral posterolateral (VPL)\ndorsal medial (DM)\ncentral medial (CM)\n9. post central gyrus upper limb\nposterior paracentral gyrus lower limb\n10. posterior limb\n11. cingulate gyrus\nsuperior frontal gyrus, medial surface\n12. anterior limb\n13. upper limb – dorsolateral surface\nlower limb – medial surface\n111 Application Exercises\n1.\n2.\n3.\n4.\n5.\n6.\n7.\n8. C7 spinal nerve root left\n9. lateral femoral cutaneous nerve right\n10. upper limb left\n11. posterior limb right\nLemniscal System\nNeuroscience Review\n1. low\nrapidly adapting and very rapidly adapting\n2. Meissner’s corpuscle\n3. muscle spindle\n4. Aβ 30 – 70 m/sec\n5. Ia 70 – 120 m/sec\nII 30 – 70 m/sec\n6. dorsal columns\n7. fasciculus gracilis lower limb\nfasciculus cuneatus upper limb\n8. lower limb – medial, upper limb – lateral\n112 9. nucleus gracilis – lower limb\nnucleus cuneatus – upper limb\n10. rostral part of caudal half of medulla oblongata\n11. medial lemniscus\n12. upper limb – dorsal, lower limb – ventral\nupper limb – medial, lower limb – lateral\nupper limb – ventromedial, lower limb - dorsolateral\n13. ventral posterolateral (VPL)\n14. upper limb – medial, lower limb – lateral\n15 post central gyrus upper limb\nposterior paracentral gyrus lower limb\n16. posterior limb\n17. upper limb – dorsolateral surface, lower limb – medial surface\n18. perception\nlocalization\n19. somatosensory association cortex – interpretation and recognition\nmotor and premotor cortex – planning and execution of movements\nApplication Exercises\n1.\n2.\n3.\n4.\n5.\n6. increased threshold (decreased perception) to stimulation on entire left side of\nbody\n7.\n113 8. anesthesia to stimulation on posterior surface of forearm and dorsal surface of\nhand (in distribution of radial nerve)\n9. 128Hz tuning fork\n10.\n11. reduced duration of perception\n12.\n13. increased number of incorrect responses to changes in joint position\n14.\n15. eyes open – stable, eyes closed – unstable\n16. dorsal columns of spinal cord\n17. fasciculus gracilis right side\n18. ventral posterolateral nuc. right side\n19. medial lemniscus right side\nCortical Sensory Functions\nNeuroscience Review\n1. postcentral gyrus Brodmann areas 3,1,2\n2. superior parietal lobule Brodmann areas 5,7\n3. middle cerebral artery\n4. 128 Hz\n5. upper limb – index or long finger lower limb – great toe\n6.\n114 Application Exercises\n1.\n2. 8 -10 or until you are satisfied of the reliability of your evaluation\n3. 1 – 3 degrees of arc are all that is necessary\n4.\n5.\n6.\n7.\nMotor System\nNeuroscience Review\n1. Upper Limb Peripheral Nerve\nshoulder abduction axillary\nelbow flexion musculocutaneous\nelbow extension radial\nwrist extension radial\nwrist flexion median\nfinger extension radial\nfinger flexion (grip strength) ulnar\nfinger abduction ulnar\nfinger adduction ulnar\nLower Limb\nhip flexion\nhip adduction obturator\nhip abduction superior gluteal\nhip extension inferior gluteal\nknee extension femoral\nknee flexion sciatic (tibial/common peroneal)\nankle dorsiflexion anterior tibial (deep peroneal)\nankle plantar flexion tibial (posterior tibial)\ntoe extension anterior tibial (deep peroneal)\n115 2. Upper Limb Spinal Segments\nshoulder abduction C5, C6\nelbow flexion C5, C6\nelbow extension C6, C7\nwrist extension C6, C7\nwrist flexion C7, C8\nfinger extension C7, C8\nfinger flexion (grip strength) C8, T1\nfinger abduction C8, T1\nfinger adduction C8, T1\nLower Limb\nhip flexion L2, L3, L4\nhip adduction L2, L3, L4\nhip abduction L4, L5, S1\nhip extension L5, S1, S2\nknee extension L2, L3, L4\nknee flexion L5, S1, S2\nankle dorsiflexion L4, L5\nankle plantar flexion L5, S1, S2\ntoe extension L4, L5\n3. frontal lobe\nparietal lobe\n4. upper limbs - frontal\nLower limbs - frontal\n5. upper limb - precentral gyrus\nLower limb – anterior paracentral gyrus\n6. thalamus – posterior limb of the internal capsule\nmidbrain – cerebral peduncle\npons – basis pons (longitudinal pontine bundles\nmedulla oblongata – medullary pyramid\n7. pyramidal decussation (decussation of the medullary pyramid)\n8. rostral part – upper limb\ncaudal part – lower limb\n9. 80% - 90%\n10. decussate – lateral corticospinal tract\ndo not decussate – anterior corticospinal tract\n116 11. upper limb – 55%\nlower limb – 25%\nnon limb – 20%\n12. medial part of ventral horn – axial muscle groups\nintermediate part of the ventral horn – girdle and proximal muscle groups\nlateral part of the ventral horn – distal muscle groups\n13. normal (5/5) full ROM against gravity with maximal resistance\ngood (4/5) full ROM against gravity with some resistance\nfair (3/5) full ROM against gravity only\npoor (2/5) full ROM with gravity eliminated\ntrace (1/5) palpable or visible muscle contraction with little or no movement\nzero (0/5) no palpable or visible muscle contraction\n14.\nApplication Exercises\n1.\n2. no\n3. activity or occupation related hypertrophy OR disuse atrophy\n4.\n5. ventral horn (lower motor neuron)\nperipheral nervous system (ventral roots, spinal nerve, plexus or peripheral\nnerves)\n6. anterior tibial (deep peroneal) nerve right side\n7. C5 or C6 spinal nerve root left side\n8. ulnar nerve right side\n9. L2 or L3 or L4 spinal nerve root left side\n117 Coordination, Station, and Gait\nNeuroscience Review\n1. anterior lobe\nposterior lobe\nflocculonodular lobe\n2. archicerebellum (vestibulocerebellum)\npaleocerebellum (spinocerebellum)\nneocerebellum (cerebrocerebellum)\n3. vermal region\nparavermal region\nhemispheric region\n4. primary fissure\n5. posterolateral fissure\n6. superior cerebellar peduncle midbrain\nmiddle cerebellar peduncle pons\ninferior cerebellar peduncle medulla oblongata\n7. molecular\nPurkinje\ngranular\n8. stellate\nbasket\n9. granule\ngolgi\n10. Afferent Tract Efferent Tract\nSuperior Cerebellar Peduncle\nventral spinocerebellar tr cerebello-rubral tr\ntrigemino-cerebellar tr dentato-thalamic tr\ncerebello-olivary tr\nMiddle Cerebellar Peduncle\npontocerebellar tr\n118 Inferior Cerebellar Peduncle\ndorsal spinocerebellar tr\ncuneocerebellar tr\nolivo-cerebellar tr\nJuxtarestiform body\nvestibulocerebellar tr cerebellovestibular tr\n11. inferior olivary nucleus\n12. nucleus dorsalis (Clarke’s nucleus)\nspinal border cells (Stilling’s nucleus)\n13. vestibular nuclei\nexternal (accessory, lateral) cuneate nucleus\n14. granular layer\n15. Purkinje cell\n16. gamma aminobutyric acid (GABA)\n17. fastigial vermis\nglobose vermis and paravermal\nemboliform paravermal\ndentate hemispheric\n18. fastigial vestibular nuclei\nglobose red nucleus\nemboliform red nucleus\ndentate ventral lateral (VL)\nApplication Exercises\n1.\n2. upper limb – ataxia with voluntary movement\nLower limb – ataxia (unsteadiness) of gait\n3.\n4. upper limb – slow, ataxic forearm pronation/supination\nlower limb – slow, ataxic ankle plantar and dorsiflexion\n119 5.\n6. standing with eyes open – stable\nstanding with eyes closed – unstable\n7. dorsal columns of spinal cord\n8.\n9. heel strike\nfoot flat\nheel off\ntoe off\nswing phase\n10. stiff knee and hip with circumduction during swing phase\n11. excessive hip and knee flexion during swing phase with toe hitting before heel\n12. unsteady progression, wide-based steps\n13. short steps, limited ROM at all joints, difficulty turning in place\n14. dance-like steps impaired arm swing\n15. high stepping with “slapping” of foot at heel strike\n16. right side\n17. left side\nGait\nNeuroscience Review\n1. 60%\n2. 40%\n3. 80%\n4. 20%\n5. the ankle moves from dorsiflexion into plantar flexion\n6. the ankle moves from plantar flexion into dorsiflexion (to clear the floor)\n120 7. the knee moves from full extension into slight flexion\n8. the knee moves from extension at toe off into flexion during swing phase and\nback into extension as heel strike approaches\n9. the center of mass moves slightly (variably) toward the side of SLS during stance\nphase on each limb\n10. tibialis anterior (ankle dorsiflexors)\n11. gluteus maximus and gluteus medius (hip extensors and hip abductrs)\n12. iliopsoas (hip flexors)\n13. hamstrings (knee flexors)\n14. quadriceps femoris (knee extensors)\n15. quadriceps femoris (knee extensors)\n16. tibialis anterior (ankle dorsiflexors)\n17. tibialis anterior (ankle dorsiflexors)\n18. all movements are reduced as a result of spasticity\n19. shoulder moves from flexion to extension during ipsilateral swing phase\n20. stance phase\n21. single limb support\nApplication Exercises\n1.\n2. a. tibialis anterior\n3.\n4.\n5.\n6.\n121 7.\n8.\n9.\nReflexes (including Muscle Tone)\nNeuroscience Review\n1. muscle spindle\nGolgi tendon organ\n2. muscle spindle\n3. muscle elongation (stretch)\n4. primary (annulospiral) Ia\nSecondary (flower spray) II\n5. Ia 70 – 120 m/sec\nII 30 – 70 m/sec\n6. excitation\n7. gamma motor neurons 15 – 30 m/sec\n8. increase in tension applied to the tendon\n9. Ib fiber 70 – 120 m/sec\n10. inhibition of lower motor neurons\n11. Reflex Peripheral Nerve\nbiceps reflex musculocutaneous\ntriceps reflex radial\nbrachioradialis reflex radial\nfinger flexor reflex median/ulnar\nquadriceps reflex femoral\nAchilles reflex tibial (posterior tibial)\n12. Reflex Spinal Segment\n122 biceps reflex C5, C6\ntriceps reflex C6, C7, C8\nbrachioradialis reflex C5, C6, C7\nfinger flexor reflex C8, T1\nquadriceps reflex L2, L3, L4\nAchilles reflex L5, S1, S2\n13. 0/5 no visible or palpable muscle contraction with reinforcement\n1/5 slight muscle contraction with little or no joint movement\n2/5 distinct muscle contraction with slight joint movement\n3/5 brisk muscle contraction with moderate joint movement\n4/5 strong muscle contraction with 1-3 beats of clonus and possible spread\n5/5 strong muscle contraction with sustained clonus\n14. Spasticity\nvelocity dependent\nclasp-knife phenomenon\nmore pronounced in antigravity muscles\nRigidity\nvelocity independent\ncog wheeling or lead pipe resistance\naffects all limb muscle groups equally\n15 masseter\nHoffman\n16. tactile stimuli (stroking) applied to sole of foot\n17. flexion of the toes (downgoing toes)\n18. Babinski sign\n19. upper motor neuron disease\nApplication Exercises\n1.\n2.\n3. threshold\nlatency\nmagnitude (amplitude and spread)\nduration\n4.\n123 5.\n6.\n7.\n8. triceps brachii right\n9. quadriceps femoris left\n10.\n11.\nOlfactory Nerve\nNeuroscience Review\n1. olfactory receptor cell\nBowman’s gland cell\nbasal cell\nsustentacular cell\n2. olfactory receptor cell\n3. pass upward through the cribriform plate of the ethmoid bone\n4. olfactory bulb\n5. mitral cells\n6. inhibition\n7. lateral olfactory gyrus (in prepiriform cortex)\nhippocampus\namygdaloid nucleus\n8. septal nuclei\n9. coffee\nsoap\nmint\n10. irritant substances activate trigeminal nerve chemoreceptors\n124 Application Exercises\n1.\n2.\nVisual System and Pupillary Reflexes\nNeuroscience Review\n1. inversely related both vertically and horizontally\n2. superiorly 60°\nmedially 70°\ninferiorly 80°\nlaterally 90°\n3. 120° (60° in both lateral directions from central vision in primary gaze)\n4. 30° (far lateral peripheral vision for each eye – from 60° – 90° from primary gaze\n5. Retinal Quadrant Eye\nupper nasal right\nlower nasal right\nupper temporal right\nlower temporal right\n6. Retinal Quadrant Eye\nupper nasal left\nlower nasal left\nupper temporal right\nlower temporal right\n7. posterior\n8. 53%\n9. lower nasal\n10. right eye lower temporal\nleft eye lower nasal\n11. right eye upper nasal\nLeft eye upper temporal\n12. lateral part\n125 13. lateral part lingual gyrus\nmedial part cuneate gyrus\n14. anterior part – peripheral fields\nosterior part (occipital poles) – central fields (macular fields)\n15. posterior cerebral artery\n16. Brodmann areas 18 and 19\n17. right optic nerve right anopsia\nleft optic tract right homonymous hemianopsia\noptic chiasm bitemporal heteronymous hemianopsia\nright lateral geniculate left homonymous hemianopsia\nleft Meyer’s loop right superior homonymous quadrantanopsia\n18. far vision\n19. near vision\n20. Edinger-Westphal nucleus ciliary ganglion\n21. intermediolateral nucleus superior cervical ganglion\n22. optic nerve\n23. oculomotor nerve\n24. prompt constriction of the pupil in the illuminated eye\n25. prompt constriction of the pupil in the non-illuminated eye\n26. ocular adduction\npupillary constriction\naccommodation of the lens\n27. right optic nerve\n28.\nApplication Exercises\n1.\n2.\n126 3.\n4.\n5.\n6. no change in pupil size (no pupillary response)\n7. no change in pupil size (no pupillary response)\n8. pupillary constriction\n9. pupillary constriction\n10. pupillary constriction\n11. pupillary constriction\n12. pupillary constriction\n13. pupillary constriction\n14. pupillary constriction\n15. no change in pupil size (no pupillary response)\n16. pupillary constriction\n17. no change in pupil size (no pupillary response\nOcular Motor Nerves\nNeuroscience Review\n1. a coronal plane that divides the eye into anterior and posterior halves\n2. X- axis (lateral-horizontal axis) permits supraduction and subduction\nY- axis (anterior-posterior axis) permits intorsion and extorsion\nZ -axis (vertical axis) permits abduction and adduction\n3. Muscle Nerve\nlateral rectus abducens\nmedial rectus oculomotor\nsuperior rectus oculomotor\ninferior rectus oculomotor\n127 superior oblique trochlear\ninferior oblique oculomotor\n4. Muscle Primary Action Secondary Actions\nlateral rectus abduction\nmedial rectus adduction\nsuperior rectus supraduction adduction intorsion\ninferior rectus subduction adduction extorsion\nsuperior oblique intorsion subduction abduction\ninferior oblique extorsion supraduction abduction\n5. Muscle\nlateral rectus abduction\nmedial rectus adduction\nsuperior rectus supraduct the abducted eye\ninferior rectus subduct the abducted eye\nsuperior oblique subduct the adducted eye\ninferior oblique supraduct the adducted eye\n6. abducens nerve adducted\noculomotor nerve subducted and abducted\ntrochlear nerve extorted and supraducted\n7. rostral midbrain\n8. caudal midbrain\n9. caudal pons\n10. trochlear nerve\n11. levator palpebrae superioris\n12. abducens nerve\n13. trochlear nerve\n14. oculomotor nerve\n15. medial rectus right side relax\n16. medial rectus left side contract\n17. paramedian pontine reticular formation (PPRF)\n18. rostral interstitial nucleus of the medial longitudinal fasciculus (riMLF)\n128 19. medial longitudinal fasciculus (MLF)\n20. prefrontal eye fields area 8\n21. visual association cortex areas 18 and 19\nApplication Exercises\n1. cover fixating eye\nobserve response of non-fixating eye\n2. cover an eye\nuncover the eye and observe the response in that eye\n3. alternately cover each eye\nobserve the response in the uncovered eye\n4.\n5. cover the fixating left eye\nobserve abduction in the non-fixating right eye to take up fixation\n6. cover the right eye\nuncover the right eye and observe abduction of the right eye to take up fixation\nOR\ncover the left eye\nuncover the left eye and observe that it remains adducted\n7. the alternately uncovered eye will abduct to take up fixation\n8. oculomotor nerve\n9. exotropia and subduction of the right eye\n10. left lateral gaze shift\n11. oculomotor nerve\n12. esotropia involving the left eye\n13. to the left\n14. no – abducens nerve does NOT innervate pupillary muscles\n15.\n129 16. impaired gaze shift to the right\n17.\n18. impaired visual pursuit from primary gaze to the left\nTrigeminal Nerve\nNeuroscience Review\n1. Division Foramen\nophthalmic superior orbital fissure\nmaxillary foramen rotundum\nmandibular foramen ovale\n2. spinal trigeminal nucleus (pars caudalis)\n3. principle (main, chief sensory) trigeminal nucleus\n4. ventral trigeminothalamic tract\n5. dorsal trigeminothalamic tract\n6. ventral posteromedial nucleus (VPM)\ndorsal medial nucleus (DM)\ncentral medial nucleus (CM)\n7. postcentral gyrus\n8. middle cerebral artery\n9. posterior limb\n10. forehead and scalp – dorsal, mid face – intermediate, chin and mouth – ventral\n11. masticator (motor) nucleus\n12. mandibular\n13. masseter\ntemporalis\nlateral pterygoid\nmedial pterygoid\n130 14. tensor tympani\nanterior belly of digastric\nmylohyoid\ntensor veli palatini\n15. corneal reflex\nlacrimal reflex\nsneeze reflex\nmasseter reflex\n16. masseter reflex\n17. mesencephalic nucleus\n18. meninges\nanterior part of oral cavity, including tongue, teeth and gingiva\nApplication Exercises\n1.\n2.\n3.\n4. no contraction of the masseter muscle\n5.\n6. ophthalmic nerve (V1) facial nerve (VII)\n7. bilateral contraction of the orbicularis oculi\n8.\n9. masseter muscle\ntemporalis muscle\n10. Structure Affected Side affected\ntrigeminal nerve left\n11. facial nerve left\n131 Facial Nerve\nNeuroscience Review\n1. facial nerve proper\nnervous intermedius\n2. internal auditory meatus\n3. pontomedullary angle\n4. facial nucleus\n5. superior salivatory nucleus\n6. stylomastoid foramen\n7. stapedius\nposterior belly of the digastric\n8. pterygopalatine ganglion\nsubmandibular ganglion\n9. lacrimal gland\nsalivary glands (submandibular and sublingual glands)\n10. greater superficial petrosal nerve\nchorda tympani\n11. taste appreciation from the anterior 2/3 of the tongue\n12. geniculate ganglion\n13. nucleus solitarius\n14. solitariothalamic tract\n15. Diencephalic Nucleus Brainstem Nucleus\nventral posteromedial nucleus ambiguus, reticular formation\nhypothalamus hypoglossal nucleus, dorsal motor nucleus\n16. postcentral gyrus or insula\n17. posterior limb of the internal capsule\n18. precentral gyrus\n132 19. genu of the internal capsule\n20.\nApplication Exercises\n1. frontalis\norbicularis oculi\nrisorius\norbicularis oris\n2.\n3. Muscle Affected Side Affected\nrisorius right\norbicularis oris right\n4. frontalis right\norbicularis oculi right\nrisorius right\norbicularis oris right\n5. taste perception\nsalivation\n6. dry, possibly sore eye on ipsilateral side\n7. hyperacusis\nCochlear Nerve\nNeuroscience Review\n1. Ossicle Branchial Arch\nMalleus 1st\nIncus 1st\nStapes 2nd\n2. Ossicle Muscle\nmalleus tensor tympani\nstapes stapedius\n3. Muscle Nerve\ntensor tympani trigeminal\nstapedius facial\n133 4. basilar membrane\n5. Reissner’s membrane\n6. basilar membrane\n7. tectorial membrane\n8. high frequency at base, low frequency at apex\n9. spiral (cochlear) ganglion\n10. internal auditory meatus\n11. dorsal and ventral cochlear nuclei\n12. dorsal acoustic stria\nintermediate acoustic stria\nventral acoustic stria\n13. ventral acoustic stria\n14. lateral lemniscus\n15. nucleus of the inferior colliculus\n16. medial geniculate nucleus\n17. brachium of the inferior colliculus\n18. superior transverse temporal gyrus 41\n19. sublenticular part of posterior limb of internal capsule\n20. low frequency – anterolateral high frequency – posteromedial\n21. 42 and 22\n22. Wernicke’s area\n23. Muscle Nerve\ntensor tympani trigeminal nerve\nstapedius facial nerve\n134 Application Exercises\n1. contralateral ear\n2.\n3.\n4. 512 Hz\n5. sensorineural\n6. conduction\n7.\n8. 512 Hz\n9. sensorineural\n10. conduction\nVestibular Nerve\nNeuroscience Review\n1. crista ampullaris semicircular canals\n2. macula utricle and saccule\n3. macula\n4. vestibular (Scarpa’s) ganglion\n5. internal auditory meatus\n6. superior, medial, lateral and inferior vestibular nuclei\n7. superior and medial\n8. inferior and lateral\n9. superior and medial\n10. medial\n135 11. anterior funiculus\n12. lateral vestibular nucleus\n13. ventrolateral fasciculus\n14. flocculonodular lobe\n15. juxtarestiform body\n16. dorsal motor nucleus (of X)\n17. nucleus ambiguus\n18. reticular formation\n19. ventral posteromedial (VPM)\nhypothalamus\npulvinar\n20. impulse frequency increases\nApplication Exercises\n1. right horizontal nystagmus\n2. left horizontal nystagmus\n3.\n4.\n5.\n6. past pointing to the right side\n7.\n8. marching in place with rotation to the left\n9. left horizontal nystagmus\n10. tonic deviation of the eyes to the right\n11. no ocular response\n136 12. decorticate rigidity\n13. decerebrate rigidity\n14. to the left\n15. right side\nGlossopharyngeal and Vagus Nerves\nNeuroscience Review\n1. post olivary sulcus\n2. jugular foramen\n3. stylopharyngeus\n4. nucleus ambiguus\n5. parotid gland\n6. inferior salivatory nucleus\n7. otic ganglion\n8. parotid gland\n9. Receptor Ganglion\ncarotid sinus petrosal (inferior) ganglion\nmechanoreceptor jugular (superior) ganglion\n10. Ganglion Brainstem nucleus\npetrosal (inferior) ganglion nucleus solitarius\njugular (superior) ganglion spinal trigeminal nucleus\n11. post olivary sulcus\n12. jugular foramen\n13. pharyngeal muscles\nlaryngeal muscles\n14. cricothyroid muscle\n15. inferior branch of recurrent laryngeal nerve\n137 16. nucleus ambiguus\n17. dorsal motor nucleus\n18. dorsal motor nucleus\n19. nodose (inferior) ganglion\n20. jugular (superior) ganglion\n21. Receptor Ganglion\ncarotid body nodose\nmechanoreceptor jugular\n22. nucleus solitarius\n23. spinal trigeminal nucleus\n24.\nApplication Exercises\n1. Afferent limb Efferent limb\nglossopharyngeal nerve vagus nerve\n2. petrosal ganglion\n3. levator veli palatini\n4. palatopharyngeus\n5. palatoglossus\n6. glossopharyngeal nerve\n7. vagus nerve\n8. straight up in the midline\n9. to the left\n10. bilateral pharyngeal muscle contraction (normal response)\n11. no pharyngeal muscle contraction (no response)\n138 Accessory Nerve\nNeuroscience Review\n1. accessory nucleus\n2. ipsilateral side\n3. foramen magnum\n4. jugular foramen\n5. sternocleidomastoid\ntrapezius\nApplication Exercises\n1.\nHypoglossal Nerve\nNeuroscience Review\n1. preolivary sulcus\n2. hypoglossal nucleus\n3. contralateral side\n4. hypoglossal canal\n5. styloglossus\nhyoglossus\ngenioglossus\n6. palatoglossus\n7.\nApplication Exercises\n1. genioglossus\n2.\n139 3. right side\n4. to the left\nConsciousness\nNeuroscience Review\n1. level of consciousness (arousal)\ncontent of consciousness (awareness)\n2. lethargy\nobtundation\nstupor\ncoma\n3. pupillary light reflexes\ncorneal reflex\npharyngeal (gag) reflex\nvestibulo-ocular reflexes\n4. blood pressure\nheart rate\nrespiration rate\nsweating (galvanic skin response)\n5. eye opening\nbest verbal response\nbest motor response\n6. a. trauma/vascular\nb. compression/displacement\n7. attention\norientation\ncognitive function\nmemory\n8. toxic/metabolic\n9. upper limbs – increased tone and extension\nlower limbs – increased tone and extension\n10. upper limbs – increased tone and flexion\nlower limbs – increased tone and extension\n140 11.\nApplication Exercises\n1.\n2.\nAttention\nNeuroscience Review\n1. locus coeruleus norepinephrine\nraphe nuclei serotonin\nventral tegmental area dopamine\n2. medial forebrain bundle\n3. lateral hypothalamus\n4. between the internal capsule and the thalamic external medullary lamina\nmodulates (inhibits) thalamocortical activity\n5.\nApplication Exercises\n1.\n2. list the months of the year forward, then backward\nOrientation\nNeuroscience Review\n1. person\nplace\ntime\n(situation)\n2. what is your name?\nwho am I?\n141 3. what country are we in?\nwhat state are we in?\nwhat county are we in?\nwhat city are we in?\nwhat kind of a place are we in?\n4. what year is this?\nwhat season is this?\nwhat month is this?\nwhat day of the week is this?\nwhat is the date today?\n5. person\nApplication Exercises\n1.\n2.\nLanguage Function\nNeuroscience Review\n1. respiration\nphonation\nresonation\narticulation\n2. graphemes\n3. phonemes\n4. left hemisphere – propositional components\nright hemisphere – prosodic components\n5. fluency Broca’s area\ncomprehension Wernicke’s area\nrepetition arcuate fasciculus\n6. Broca’s area 44, 45\nWerniche’s area 42, 22\n7. superior branch of the middle cerebral artery (MCA)\n142 8. inferior branch of the middle cerebral artery (MCA)\n9. motor, expressive, anterior, non-fluent\n10. sensory, receptive, posterior, fluent\n11.\nApplication Exercises\n1. fluency\ncomprehension\nrepetition\nreading\nwriting\n2.\n3.\n4.\n5.\n6.\n7.\n8. 95%\n9. 5%\n10. 70%\n11. 30%\n12. impaired repetition with relatively preserved fluency and comprehension\n13. repetition is relatively intact\n14. repetition is relatively intact\n15. Mr. Dextra\n16. proximal (main stem) segment of the MCA (M1 segment) on the left side\n143 17. superior branch of the MCA on the left side\n18. inferior branch of the MCA on the left side\n19. heart (pump) failure/hypovolemia/hypoperfusion\nLearning and Memory\nNeuroscience Review\n1. hippocampal formation of the medial temporal lobe\n2. dentate gyrus\nhippocampus (coru ammonis)\nsubiculum\n3. it is 3 layered (archicortex)\n4. perforant pathway\nalveolar pathway\n5. CA1 region of the hippocampus\nhigh susceptibility to hypoxia\n6. CA3 region of the hippocampus\n7. dentate gyrus\n8. subiculum\n9. mammillary nuclei\nanterior nucleus of the thalamus\nseptal nuclei (area)\n10. temporal lobe → mammillary nucleus → anterior thalamic nucleus → cingulate\ncortex → temporal lobe\n11. working memory – seconds\nshort term memory – minutes to days\nlong term memory – months to years\n12.\n144 Application Exercises\n1.\n2.\n3.\n4.\n5.\n6.\n7. hippocampal formation in medial temporal lobe\n8. mammillary nuclei\n9. occipital association cortices\n10. temporal association cortices\nCognitive Function\nNeuroscience Review\n1.\n2.\n3. simultagnosia\nocular apraxia\noptic ataxia\n4. agraphia\nacalculia\nfinger agnosia\nright – left confusion\n5.\nApplication Exercises\n1.\n2.\n145 3.\n4.\n5.\n6.\n7.\n8.\n9.\n146 About the Authors\nMichael F. Nolan is professor of Basic Science Education at the Virginia Tech Carilion\nSchool of Medicine in Roanoke. He received his Physical Therapy training at Marquette\nUniversity and his PhD in Human Anatomy from the Medical College of Wisconsin.\nNolan spent the first 34 years of his career teaching gross anatomy and neuroanatomy\nto medical students and resident physicians at the University of South Florida. He has\nreceived more than 20 awards for excellence in teaching including the Master Teacher\nAward in 2014 from the International Association of Medical Science Educators and the\nJohn M. Thompson Outstanding Teacher Award in Neurosurgery in 2006. He has\npublished over 40 peer-reviewed articles and book chapters as well as four textbooks in\nhuman gross anatomy and neuroanatomy.\nJohn P. McNamara is the Director of Anatomy and Assistant Professor of Basic\nScience Education at the Virginia Tech Carilion School of Medicine in Roanoke. His\ndoctoral training is in chiropractic from Life University (Marietta, GA) with undergraduate\n(Lock Haven University of Pennsylvania) and graduate (Shippensburg University of\nPennsylvania) degrees. He is also ABD from Virginia Tech in Educational Leadership\nand Policy Studies. For nearly the past 30 years, McNamara has maintained a private\npractice in Salem, VA, and taught full-time anatomy and physiology, gross anatomy,\nneuroanatomy, and pathophysiology at the College of Health Sciences (Jefferson\nCollege) in Roanoke. From 2013 to 2017 he taught the gross anatomy course for the\nDoctor of Physical Therapy program at Radford University in Roanoke. He is licensed to\npractice as a Doctor of Chiropractic in both Virginia and Pennsylvania, and he is\ncertified as an Emergency Medical Technician in Virginia.\n147"
}