{
    "text": "Not logged in Discussion for this IP address Contributions Create account Log in\nBookDiscussion ReadEditEdit sourceView history\nSearch Wikibooks\nEnglish More\nApplied Ecology/Printable version\nThe printable version is no longer supported and may have rendering errors. Please update your browser bookmarks and please use the default browser print function instead.\nMain Page\nHelp\nBrowse\nCookbook\nWikijunior\nFeatured books\nRecent changes\nApplied Ecology\nDonations\nRandom book\nUsing Wikibooks\ncommunity\nReading room\nforum\nCommunity\nportal\nBulletin Board\nHelp out! The current, editable version of this book is available in Wikibooks, the open-content textbooks collection, at\nhttps://en.wikibooks.org/wiki/Applied_Ecology\nPolicies and\nguidelines\nContact us Permission is granted to copy, distribute, and/or modify this document under the terms of the Creative Commons Attribution-ShareAlike 3.0 License.\nTools\nWhat links here\nContents\nRelated changes\nUpload file\n1 Introduction\nSpecial pages\n1.1 Current state of the book\nPermanent link\n1.2 Definition\nPage information\n1.3 Scope\nCite this page\nGet shortened 1.3.1 In situ and ex situ conservation systems\nURL\n1.3.2 Conservation management\n1.3.3 The endangered resources\nsister projects\n1.3.4 New societies and cultures\nWikipedia\nWikiversity 2 Conservation Management\nWiktionary 2.1 Scale of action\nWikiquote\n2.2 Systems thinking\nWikisource\n2.3 Strategies and operations\nWikinews\n2.4 Conservation management systems\nWikivoyage\n2.4.1 The UK experience\nCommons\n2.4.2 Data model of a conservation management system (CMS)\nWikidata\nMediaWiki 2.4.3 Diagram of the planning cycle of a CMS\nMeta-Wiki 2.5 Scope of conservation management\n2.6 Fundamental scientific questions\nPrint/export\n2.7 References\nCreate a\ncollection 3 Habitat Creation\nDownload as 4 Agro-Ecological Systems\nPDF\n5 Wetland Engineering\nLanguages 6 Disease Transmission\nAdd links 7 Breeding and Reintroduction of Rare Species\n7.1 Organisations\n7.1.1 Botanical Gardens\n7.1.2 Zoos and Other Institutions for Animal Breeding\n7.2 Aims and objectives\n7.2.1 Biological\n7.2.2 Socio-economic and Legal\n8 Environmental Valuation\n8.1 Humanity and nature\n8.2 GEMS and Surveillance\n8.3 Environmental impact assessment\n8.3.1 Introduction\n8.3.2 Guiding Principles\n8.3.3 Operating Principles\n8.3.3.1 Screening\n8.3.3.2 Scoping\n8.3.4 Survey\n8.3.4.1 Mitigation\n8.3.4.2 Review for decision-making\n8.3.4.3 Decision making\n8.3.5 Management, monitoring, evaluation and auditing\n9 Nature Tourism\n10 The Endangered Resources\n10.1 Objective\n11 New Societies and Cultures\n11.1 Holistic economics\n11.1.1 Management\n11.1.2 The cosmic adventure\n11.2 Social applications of ecology\n11.2.1 Cultural ecology\n11.2.2 Social organisation\n11.2.2.1 Political ecology\n11.2.2.2 Social ecology\n11.2.2.2.1 The Social and the Ecological\n11.2.2.2.2 An Evolving Theory\n11.3 Historical models of communitarianism\n11.4 Systems thinking\n12 Case Studies\n12.1 Educating through case studies\n12.2 Nature conservation\n12.2.1 Connecting nature\n12.2.2 Connecting people and nature\n12.2.3 Connecting nature operations with policies\n12.3 Community development\n12.4 Ecological economics\n12.4.1 Hamburger economics\n12.5 Industry\n12.5.1 The Need for Industrial Transformation\n12.5.2 Problem perceptions and policy approaches: Market versus State Failure\n12.5.3 The Core Challenges\n13 Case Studies/Asian Rainforest Politics\n13.1 Topography\n13.1.1 Dynamics\n13.1.2 Countries in the region\n13.2 Human settlement\n13.3 Politics of logging\n13.3.1 WWF and World Bank Alliance\n13.4 East Kalimantan\n13.5 The industrial politics of the Orang-utan\n13.6 People and the forest\n13.6.1 Conflict\n13.6.2 Blockades\n13.6.3 Deforestation as an anti-development issue\n13.6.4 The Government viewpoint\n13.7 Human impact on forest primates\n14 Case Studies/British Limestone Grasslands\n14.1 Types of grassland\n14.1.1 Chalk\n14.1.2 Harder limestones\n14.2 Regional differences in biodiversity\n14.2.1 Plants\n14.2.2 Animals\n14.3 Targets and sites\n14.4 Examples of threatened species\nIntroduction\nCurrent state of the book\nThis wikibook project is in its first stage, which is to decide the chapters to be included and summarise what they should contain. At the present time, editorial effort is directed towards the writing of introductions to\neach chapter. This is also a process of selecting the main subsections for each chapter. These will eventually appear as ‘pages’ indented in the table of contents.\nContributors are reminded that it is a textbook to provide an up to date review of important areas of applied ecological knowledge for advanced level university students and site managers.\nDefinition\nApplied ecology is a framework for the application of knowledge about ecosystems so that actions can be taken to create a better balance and harmony between people and nature in order to reduce human\nimpact on other beings and their habitats.\nScope\nIn situ and ex situ conservation systems\nWith respect to scope, it is intended that the book should contain a body of knowledge about the use of ecological theory and principles to solve problems associated with the intensive human use of the\nenvironment. It is beyond our capacity to return Earth to a primeval state, but what we can do is build a technological ‘ark’ to retain as much ecological integrity as possible. To achieve this, many aspects of\necology have to be applied to manage conservation systems where the maintenance, restoration, and creation of diverse and healthy ecosystems are principal objectives.\nSome conservation systems may be broadly classified as in situ operations. These include:\nprotection of rare species and habitats;\nrestoration of industrial wasteland and the mitigative creation of new ecosystems;\nusing wetland ecosystems for treating wastewater;\nenvironmental valuation in relation to the needs for conservation and development to go hand in hand;\nintegration of sustainable ecosystems with commercial enterprises, such as agriculture and nature tourism;\nstudy of the ecology of human diseases in relation to their control.\nOther kinds of conservation systems are classified as ex situ. These include operations in zoos, botanical gardens, museums, and germ plasm stores. The objectives are to provide breeding populations of plants\nand animals for reintroductions, and maintain a classified biodiversity inventory of specimens and genetic resources.\nConservation management\nThese conservation systems all overlap with each other, but they broadly define topics that most people would recognise as covering distinct applications of management practices to ecosystems, where the\noutcomes benefit humankind. Each one could be developed as a chapter of this book, but it is important to think hard before initiating a new chapter, because its principles may fall into an existing one. The\nunifying principle that brings the topics together is that they all centre on the management of species and habitats. A common objective is long-term sustainability, and it is in this sense that the planning and\noperation of conservation management systems is the practical point of focus.\nThe endangered resources\n2\nIn 1974 Norman Myers estimated the annual loss of tropical ecosystems to be about 240,000 km . This was the outcome of commercial timber extraction, farming operations and fuel gathering; a combination of\neconomic objectives and the subsistence behaviour of native peoples. Biodiversity represents the very foundation of human existence. Besides its profound ethical and aesthetic implications, a loss of biodiversity\nhas serious economic and social costs. As an essential resource, future changes should be tracked through the collection and dissemination of scientific knowledge on a global scale. It was in this spirit that UNEP\ncommissioned the Global Biodiversity Assessment (GBA) project, which reported in 1995 as a first step to assemble an inventory of Earth’s endangered biological resources.\nNew societies and cultures\nThe application of ecological principles and knowledge to environmental issues of world development is changing the way societies value natural resources. This new understanding is having a cultural impact\nthrough changes in the behaviour of governments, communities and families. This is mainly the result of a combination of publicity and legislation. For example, in 1977 the Countryside Commission for England\nand Wales organised a national campaign to persuade farmers to enhance the wildlife and scenic value of agricultural land. Although this particular campaign did not halt the destructive ecological outcomes of\nintensive agriculture, it marked the beginning of a process of change in agrarian culture. This is now obvious throughout Britain, largely because of a shift in the system of farm subsidies away from production\ntowards the creation of environmental goods.\nEducation is another important factor in creating a culture of sustainable development. This requires the promotion of a knowledge system linking culture and ecology. The aim is to present economic development\nalongside the work of organisations in society that are promoting the conservation of natural resources.\nConservation Management\nScale of action\nBiological conservation management applies ecological evidence and practical experience to formulate and implement actions to maintain or\nattain a specific ecological objective, which is agreed upon by consensus and/or prescribed by legislation.\nOn a global scale the concept of Earth being a single system is easy to comprehend. The material resources are finite, and significant amounts\nof matter are neither lost nor gained across the boundary between atmosphere and space. Our planet is essentially a closed system with respect\nto matter but an open one so far as energy is concerned (Phillipson 1975). Radiant energy from the sun enters the biosphere and is re-radiated to\nspace as heat. The maintenance of global stability requires that the biospheric inputs and outputs of energy equal each other over time; if this\nequality is severely disrupted then unstable conditions will persist until the changed amounts of input and output equalize and a new equilibrium is\nachieved.\nGlobal warming is a clear indication of unstable, non-equilibrium conditions. A new equilibrium will eventually be reached but the question is\nwhether, when it is reached, will conditions be suitable for human existence and well being.\nThe biosphere provides the scale on which global conservation strategies and management operations function. The natural resources of the\nbiosphere are, in effect, assets; as such they can be categorized as either fixed or current. The fixed assets are the non-living (abiotic)\ncomponents, exemplified by gases (the atmosphere), water bodies (the hydrosphere), and solid inorganic matter (the lithosphere); together these\nconstitute the physico-chemical environment. The current assets are the living (biotic) components—a potentially renewable stock of plants (flora)\nand animals (fauna). Transfers within and between the two major types of asset can, and do, take place; for example, the daily exchanges of heat\nenergy between atmosphere, hydrosphere, and lithosphere and also the biological processes of photosynthesis and decomposition which involve\nenergy transformations and exchange of chemical elements between abiotic and biotic parts of the biosphere.\nThe virtually closed biosphere is clearly a mosaic of many interacting smaller systems in which the sum of the parts is more stable than any one\nof the constituent parts. Biospheric stability and local ecosystem stabilities are inextricably linked; on these grounds alone a strong case can be\nmade for protecting the Earth's natural ability to regulate its own stability by maintaining habitat diversity. Management of the biosphere's present\nhabitat diversity and natural resources is multinational. In 1973 it was estimated that 174 nations each had a share of global assets, which included 1841 thousand million metric tonnes dry mass of plant material\n(Phillipson 1973).\nOn a smaller local or regional scale every ecosystem—be it on land or in the ocean—is, like the biosphere, a functioning system. Unlike the biosphere, however, significant amounts of matter can be lost or gained\nacross boundaries (which are frequently difficult to define). Ecosystems smaller than the biosphere are essentially open systems with respect to matter as well as energy. Left unperturbed over ecological or\nevolutionary time the constituent ecosystems of the biosphere will, as a result of interactions between organisms and environment, also reach a state of equilibrium; classical examples of this are mature tropical\nforests and well-established coral reefs. Because of the dynamic nature of the interactions between living and non-living components, ecosystems smaller than the biosphere rarely achieve a fixed and lasting\nequilibrium, and instead exhibit varying degrees of fluctuation (Phillipson 1989a).\nCommitment to conservation, including sustainable development objectives, appears to be strongest when:\nan influential leader declares it should be so;\nnon-government agencies actively promote conservation;\nlocal people become involved in conservation projects;\nlocal people benefit either financially or in kind as a result of conservation activities;\nthe country itself makes a substantial contribution in cash or kind to conservation.\nSystems thinking\nEcological thinking is about studying organisms in space and time, classifying patterns of distribution and describing\nthe response of populations to physical/biological factors and the impact of human exploitation. This basic ecological\nknowledge is applied to make conservation management plans in order to predict the consequences of a particular\naction in a conservation management system.\nA conservation management system is based on evidence about:\nboundaries (e.g. the study of species area relationships)\ndistributions of species (e.g. the study of effects of local variations in light)\nclassification of communities (e.g. vegetation analysis)\ninputs and flows of energy (e.g. analysis of food chains)\ninputs and cycling of nutrients (e.g. measurement of nutrient reservoirs)\nbehaviour of populations in response to: -\nphysical factors such as climate, geography and soils;\nbiological factors such as disease and predation;\nhuman factors connected with the use of land and water; such as pollution;\nthe exploitative management of species and habitats; such as hunting.\nexperience from management systems for the same species in similar habitats\nConservation management implies the control of environmental and socioeconomic factors in order:\nto make more efficient use of materials,\nto recycle materials and energy that are vital to human survival,\nto restore derelict land\nand to maintain the capacity of ecosystems, which are the basis of all economies, to renew and grow.\nThis is a vast area of applied science and technology, which is developing alongside new social organisations that are changing cultural attitudes towards the value of natural resources.\nOver the years, particularly at a governmental level, conservation management has come to focus on biological resources such as:\nAgriculture and pastoralism\nFisheries\nForest ecosystems\nWater\nTourism and recreation\nWildlife\nGenetic resources\nFrom this perspective the aim is to foster attitudes in community and industry to the use of biological resources, changing from the 'maximum yield' approach to one of ecologically sustainable yield. This new\nattitude recognises the need for conservation of biodiversity and maintenance of ecological integrity.\nStrategies and operations\nSince the first Earth Summit in 1992, national strategies are now commonly in place to integrate conservation management within and between industries and communities to meet appropriate environmental,\neconomic and social objectives. The practical aim is now to turn these strategies into operational systems and so balance exploitative management of natural resources with their conservation management. The\ngoal is to provide the principles and tools to soften the clash between Earth’s ability to sustain life and the character of its human occupancy. This means developing methods for biological conservation\nmanagement alongside softer technological organisations for production (natural economy) and ‘green’ legislative actions for the organisation of people for production (political economy).\nThe global educational topic-framework, which links conservation management with exploitative management, has been defined as ‘cultural ecology’. It is within this area of knowledge that conservation\nmanagement systems can be seen to require more than the scientific input of conservation biology. The essential feature of conservation management programmes is that they are part of the linkages between\nenvironmental, social and economic progress; between peace and security; between productivity of environment and community; and between sustainability and the renewal and extension of democracy. In this\nsense, conservation management is about working on behalf of ecosystems to restore a culture where people are engaged with their place on the planet for the long term future.\nIt is commonplace to hear conservation managers stress that they are really naturalists who do their best to apply good science to ecosystems that are unique in each case history. No two sites share the same\nhistory and factors limiting their biodiversity. They will differ with respect to time lags and non-linear responses to a given intervention. From this point of view conservation systems have much in common with the\nmanagement systems of farmers and gardeners with regards uncertainties of the effects of inputs. Because of the internal complexity of ecosystems, science has yet to answer fundamental question that were\nposed by Darwin regarding the factors that control relative abundance of species, with respect to space, time, pattern, food chains and population dynamics. There are fundamental questions in ecological science\nthat underpin all conservation management systems.\nEvery nature reserve is likely to have some or all of the following questions unanswered:\nHow do organisms change with space?\ne.g. What constitutes and adequate size and shape of a reserve?\nHow do organisms change with time?\ne.g. To what extent is the site a successional process?\nHow do organisms exist in patterns?\ne.g. How many states or ‘ways to be’ are there for a particular compositional state of a habitat?\nHow do organisms exist in food chains?\ne.g. What is the importance of keystone resources in maintaining community structure?\nHow do organisms exist in populations?\ne.g. What is a sustainable population size for a particular species?\nAnswers to these questions are embedded in the conservation management system. All environmental systems are open systems with throughputs of matter and energy whilst maintaining structure and\npermanence in the medium term. A conservation management system will become part of this ecosystem with linkages to several feedback mechanisms, some positive and some negative, so that feedback loops\ncan be unpredictable. This situation makes it virtually impossible to map the system as a whole, and usually the feedback is only revealed as an unexpected response, once management has commenced. It is in\nthis sense that a management plan can be considered as the first stage of a research project, and the plan is adapted in response to its outcomes.\nThe aim of this chapter is to exemplify the application of the above five pillars of ecology to conservation management systems.\nConservation management systems\nA conservation management system is a procedure for maintaining a species or habitat in a particular state. It is a means whereby humankind secures wildlife in a favourable condition for contemplation,\neducation or research, in perpetuity. It is an important topic in cultural ecology, where conservation management counterbalances the unchecked exploitative management of natural resources. Conservation\nmanagement systems are vital for turning sustainable development strategies into successful operations.\nThe UK experience\nAs a British idea the concept of a national conservation management system may be traced to an upsurge of sentiment after the Second World War that the world should be made a better place. It was the\nbotanist Arthur Tansley who pleaded for organised nature conservation on the double ground of scientific value and beauty. He had advanced the concept of the ecosystem in 1935, and a number of key ideas of\nrelevance to nature conservation stem from this. In the immediate post-war years, he hoped for an ‘Ecological Research Council’, and a ‘National Wildlife Service’. In this context, the idea of national standards of\nconservation management can be traced to the formation of the Nature Conservancy Council (NCC), and its great survey of habitats and species, the Nature Conservation Review, published in 1977. From this\ntime there was general agreement that the common purpose of conservation management systems was to transform situations of ecological confrontation between humans and non-humans into a system of\nmutual accommodation. The NCC’s first guidelines for managing its national resource was a pro forma to accommodate a description of the site, the goals of management, and a prescriptive section, in which the\nobjectives of management were to be interpreted in a practical manner. Central to the latter section were lists of codified jobs to help wardens abide by best practice. The major shortcoming of the guidelines was\nthe lack of a business philosophy to track value for the inputs of effort and resources.\nBritain’s first proper conservation management system (CMS), which tied objectives to practical interventions with feedback from monitoring outcomes, coalesced around Mike Alexander (Warden of Skomer\nIsland National Nature Reserve), Tim Read (staff member of the Joint Nature Conservation Committee) and James Perrins (an environmental/IT graduate of York University). This initiative in the 1980s led to the\nsetting up of the CMS Partnership by the UK’s main conservation agencies, which produced a relational database for linking management objectives with scheduled on-site operational inputs. The database\nrecorded all actions, particularly the results of monitoring against performance indicators. Over the years the software has improved greatly with respect to the user/screen interface, but the data model is still very\nmuch the same as in the original programme, which was produced with ‘Advanced Revelation’. Although the NCC has been replaced by four country agencies, in terms of the widespread uptake of the CMS\nacross the UK, the current version, mounted on MS Access, is now, de facto, a national conservation management system. As its use becomes more widespread CMS plans are beginning to function as an\nevidence-based library of best practice for exchanging practical know how between users.\nData model of a conservation management system (CMS)\nA CMS is simply a recording and filing tool that aids and improves the way in which heritage green assets are managed and kept in a favourable condition. Its prime function is to keep track of the inputs, outputs\nand outcomes of projects to meet measurable objectives. The aim is to promote efficient and effective operations, and allow recording of the work that was done and reporting on whether or not the objective was\nachieved. A CMS also enables the exchange of information about methods and achievements within and between organisations. These are essential components of a CMS of any scale, whether a national park,\nor a village pond.\nTechnically, a CMS is a project-based planning and recording system aimed at managing conservation features within acceptable limits of variation. A feature is any component of the environment that has to be\nmanaged e.g. a footpath or a species. A 'project' is simply a programme of work leading to an output e.g. 'construct a footpath', 'patrol an area' or 'record a species'. Projects are work plans that control specific\nfactors that help or impede the attainment of management objectives. Each project includes a description of a process, e.g. the work to be done, when and where it is to be done and the inputs of resources\nrequired. When a project is completed, what was actually done is recorded. This is an output. The outcome of a CMS is the state of the feature at the end of the project and is measured by performance indicators.\nPerformance indicators are quantitative or qualitative attributes of the features e.g. numbers of a species, and they are measured by special monitoring-projects in order to gauge success in reaching the\nmanagement objectives. Copies of all projects with their inputs, outputs and outcomes are retained in the CMS to provide a progress- register, and an archive to support managerial continuity.\nIn summary, the prime function of a CMS is to enable conservation managers to control the operational functions of a management plan as a feedback system or work-cycle by:-\nidentifying and describing, in a standard way, all the tasks required to control the key factors (positive of negative), which influence the condition of the features, and thereby maintain the features in a favourable\ncondition; producing and budgeting various work programmes to control the factors, for example five-year plans, rolling- plans, annual schedules, financial schedules, and work schedules for specified categories\nof staff; providing a site/species monitoring system to check the effectiveness of the plan against the specified objectives; facilitating the exchange of management information by reporting, within, and between,\nsites and organisations; using feedback from monitoring to improve the management system. The sequence of identifying features, setting objectives, and then selecting the factors to be controlled by projects\nwith scheduled work plans, comprises a management plan.\nThe most effective way of organising a CMS is to assemble it as a set of interlinked forms as a relational database. However, it is also possible to operate a management plan with a spread sheet or a collection of\nhyperlinked ‘to-do’ lists.\nDiagram of the planning cycle of a CMS\nDiagram of the data structure of a CMS\nScope of conservation management\nConservation management implies the control of environmental and socioeconomic factors in order:\nto make more efficient use of materials,\nto recycle materials and energy that are vital to human survival,\nto restore derelict land\nand to maintain the capacity of ecosystems, which are the basis of all economies, to renew and grow.\nThis is a vast area of applied science and technology, which is developing alongside new social attitudes towards the values of natural resources.\nOver the years, particularly at a governmental level, conservation management has come to focus on biological resources such as:\nAgriculture and pastoralism\nFisheries\nForestry\nWater\nTourism and recreation\nWildlife\nGenetic resources\nFrom this perspective the aim is to foster attitudes in community and industry to the use of biological resources, changing from the 'maximum yield' approach to one of ecologically sustainable yield. This new\nattitude recognises the need for conservation of biodiversity and maintenance of ecological integrity.\nSince the first Global Environment Summit in 1992, national strategies are now commonly in place to integrate regimes of conservation management within and between industry sectors and communities to meet\nappropriate environmental, economic and social objectives. The practical aim is now to turn these strategies into operational systems and so balance exploitative management of natural resources with their\nconservation management. The goal is to provide the principles and tools to soften the clash between Earth’s ability to sustain life and the character of its human occupancy. This means developing methods for\nbiological conservation management alongside softer technological organisations for production (natural economy) and ‘green’ legislative actions for the organisation of people for production (political economy).\nThe global educational topic-framework, which links conservation management with exploitative management, has been defined as ‘cultural ecology’. It is within this area of knowledge that conservation\nmanagement systems can be seen to require more than the scientific input of conservation biology. The essential feature of conservation management programmes is that they are part of the linkages between\nenvironmental, social and economic progress; between peace and security; between productivity of environment and community; and between sustainability and the renewal and extension of democracy. This is a\nroundabout way of saying that conservation management is about working on behalf of the wild to restore a culture, where people live and think as if they were totally engaged with their place on the planet for the\nlong future.\nFundamental scientific questions\nIt is commonplace to hear conservation managers stress that they are really naturalists who do their best to apply good science to ecosystems that are unique in each case history. No two nature sites share the\nsame history and factors limiting their biodiversity. They will differ with respect to time lags and non-linear responses to a given intervention. From this point of view conservation systems have much in common\nwith the management systems of farmers and gardeners with regards uncertainties of the effects of inputs. Because of the internal complexity of ecosystems, science has yet to answer fundamental question that\nwere posed by Darwin regarding the factors that control relative abundance of species, with respect to space, time, pattern, food chains and population dynamics. Every nature reserve is likely to have some or all\nof the following questions unanswered. They are fundamental questions in ecological science that underpin all conservation management systems.\nHow do organisms change with space?\ne.g. What constitutes and adequate size and shape of a reserve?\nHow do organisms change with time?\ne.g. To what extent is the site a successional process?\nHow do organisms exist in patterns?\ne.g. How many states or ‘ways to be’ are there for a particular compositional state of a habitat?\nHow do organisms exist in food chains?\ne.g. What is the importance of keystone resources in maintaining community structure?\nHow do organisms exist in populations?\ne.g. What is a sustainable population size for a particular species?\nAnswers to these questions are embedded in the management system. All environmental systems are open systems with throughputs of matter and energy whilst maintaining structure and permanence in the\nmedium term. A conservation management system will become part of this ecosystem with linkages to several feedback mechanisms, some positive and some negative, so that feedback loops can be\nunpredictable. This situation makes it virtually impossible to map the system as a whole, and usually the feedback is only revealed as an unexpected response, once management has commenced. It is in this\nsense that a management plan can be considered as the first stage of a research project, and the plan is changed in response to its outcomes.\nReferences\nPinchot, G., (1947) Breaking New Ground, Harcourt Brace, New York\nUsher, M. B. (1973) Biological Management and Conservation: Chapman and Hall London\nCarter, G. F., (1975) Man and the Land- A Cultural Geography, Holt Rinehart & Winston, New York\nHys, S. P., (1975) Conservation and the Gospel of Efficiency, Atheneum, New York\nRatcliffe, D. Ed (1977) A Nature Conservation Review Vols 1 & 2: Cambridge University Press\nSlobodkin, L. B., (1988). Intellectual problems of applied ecology. Bioscience 38: 337-42\nFiedler, P. L., and Jain, S. K. Eds. (1992) Conservation Biology; the Theory and Practice of Nature Conservation Preservation and Management, Chapman and Hall, New York\nBotsford, L. W., and Jain, S. K. (1991) Population biology and its application to practical problems, In Applied population biology, ed. S.K. Jain and L.W.Botsford, Kluever, Dordrecht Snyder, G., (1995) The\nRediscovery of Turtle Island, A Place in Space, Aesthetics and Watersheds, Counterpoint, Washington D.C.\nChristie, I., and Warburton, D. (2001) From Here to Sustainability, Earthscan Publications, London.\nRetrieved from \"http://en.wikipedia.org/wiki/Conservation_Management_System\"\nHabitat Creation\nHabitat creation as a distinct ecological movement can be traced to the choice of the topic of 'Ecology and the Industrial Society' by the British Ecological Society for its fifth symposium, held at the University\nCollege of Wales, Swansea, on 13–16 April 1964 (Goodman, Edwards and Lambert, 1965). It was a time in the 1960s when ecologists became aware of the contribution they could make to solve the special\nenvironmental problems created by urban and industrial living. Academics were stepping tentatively out of their ivory towers into the real world. Ecologists emerged into a decade when it had became clear on\nmany fronts that the United Kingdom had passed through the 'industrial revolution phase' of economic development. Unwanted side effects of the use of land and water for mass production had become obvious,\nsuch as the disposal of industrial and urban wastes, and had clearly brought about land dereliction on a scale and severity that was previously unknown. These impacts serious created large-scale problems of\npollution, erosion, flooding, loss of wildlife, and unsightliness.\nThe organisers of the Swansea conference felt that ecologists had something important to offer in the recognition, analysis and solution of these problems. In applying ecological thinking that was traditionally\nderived from investigating more \"natural\" communities, it is clear that ecologists can often forecast the likely outcome of a particular urban or industrial development on the local biological processes. This, in turn,\nmay lead to ways of modifying further developments, and cleaning up past outcomes, so as to avoid any economically or aesthetically undesirable long-term side effects in the environment. It was recognised that\nalthough restoration of derelict land and polluted water was an important part of modern planning, applied ecology could produce new industrial operations aimed at solving the problems and at the same time\ncreate stable diverse habitats.\nIn his opening address, the botanist, A. R. Clapham, outlined the main theme of the conference as the solution of problems involved in shaping new ecosystems or restoring old ones. In other words it would\ninvolve the deliberate determination of a recipe for the correct floristic composition and structure as a starting point for producing a viable ecosystem. This prescription had to meet a new objective for purposes\nother than agricultural. In Clapham's view, these 'contrived ecosystems' would be needed more and more, as the principles of multi-purpose land-use become more widely understood and accepted, especially for\nrecreation and amenity.\nThe conference recognised that there would often be great difficulty in achieving a permanently satisfactory result, other than by prolonged trial-and-error, unless applied ecologists played a part in planning the\noperation and continued to give advice. Otherwise there would be danger of a situation in which technological expertise might outstrip ecological understanding, or in which the technologist went ahead without\nprior consultation with the ecologist. What was needed for the future was a synthesis of an ecological technology, for which there would need to be some strategic preparation, and long-term conservation\nmanagement systems.\nAmong the chief factors causing the formation of industrial wasteland are the production and disposal of industrial and domestic refuse and the creation of post-industrial barren land, such as unsightly heaps and\npits by mining, and quarrying activities, and the sites of former factories and industrial infrastructure.\nEven in the 1960s, in many countries throughout the world, attempts were being made to prevent this misuse of land and, where it has happened, to reclaim it. Ecological studies had indicated that the absence of\nvegetation on this type of land was mainly due to either fresh disturbance by machines, or the detrimental effects of persistent site factors. These factors were toxic ingredients, the unstable nature of the waste\nmaterial, erosion, or air pollution. Reclamation schemes were being undertaken in all European countries, from Hungary to the United Kingdom and also across the Atlantic Ocean, and in South Africa and\nMalaysia. There was extensive forestation on American strip-mines; the Danish 'Desert Arboretum' was founded on lignite spoil banks, topsoil management was underway in Czechoslovakia, and there were\nrehabilitation schemes in UK county of Lancashire. Some of the biggest projects involved forestation of colliery waste in the Ruhr basin, and the combination of mining, agriculture, and forestry to build up new\nland in the Rhineland. From these very beginnings, ecological principles and experimental evidence have been further developed to return wasteland to economic or recreational use. The over riding objective was\nbeen the production of an ecosystem that restores a productive and visual amenity\nSince the 1960s ecology applied to habitat creation has been exended to intensive agricultural systems where it has encompassed meadows, ponds and wetlands. The term ‘wilding’ has recently been given to\nlarge-scale projects to created contrived ecosystems on land previously used for agriculture or forestry. These schemes are taking place on a suck-it-and see approach with minimum interference except for\ncontrolling visitors. Wildings cannot replace primeval systems that have been lost through economic development, but they have the potential to act as more stable refuges for wildlife and offer the right scale for\noffering people spiritual and aesthetic contacts with ‘big nature’. Most landscape architects regard ecological science as an important source of principles. Planting native trees and shrubs on a housing or\nindustrial estate is of more value than filling in with a collection of Japanese Cherries and ornamental-leafed Maples. Applied ecology is also becoming a force in garden design, where urban gardeners are\nstarting to care about what kind of an impact they have on the environment. For example, the Connecticut Department of Environmental Protection website advises gardeners to:\n\"Use Native Plants: A built green landscape uses native vegetation that competes well with weeds and other pests. These plants are native to your region and climate. Emphasize plant\ndiversity with a palette of plants that naturally grow together, are reseeding, and spread without much maintenance. This strengthens the ecology of your yard requiring less fertilizer and\npest control. Native plants also attract more birds, butterflies and other wildlife.\"\nSince urban dwellers are now in the majority, the parks and gardens in towns and cities have major potential for increasing biodiversity, and what the town gardener decides to plant in a container or garden, is a\nvery important factor in determining local biodiversity.\nThe choice of Swansea for the Ecological Society's meeting in 1964 was significant in that a large area to the north, in the lower valley of the River Tawe, was one of the most extensive areas of industrial\nwasteland in Britain. Of about 300 ha of derelict land, around half was covered by almost bare waste-tips between 3–30 metres high. These were composed of slags derived from ores after extraction for heavy\nmetals. A pioneer cross-disciplineary research project in the University, involving ecologists, microbiologists and conservators, had been investigating the area with a view to total rehabilitation. These pioneer\necological studies have long since been applied to create a new, clean, and ecologically productive environment in the Tawe valley and have been duplicated in similar areas of industrial dereliction elsewhere. By\nand large knowledge and experience has been directed towards the following four approaches:\n1. Accepting the site conditions as they are after the wasteland has been left by industry, and planting the area with pioneer plants of low requirements.\n2. Changing infertile or polluted sites by re-shaping the contours and by adding soil amendments before or after planting.\n3. Planning the future land use before displacing the waste, and following this by restoring fertility to the site to a state that may easily become productive once more.\n4. Allowing former farmland and plantation forest develop as large contrived ‘wildings’, gathering information on the processes involved through surveillance with minimum habitat management.\nThe first three approaches are bound up with the flows of industrial and domestic waste through the human food chain. All wastes are now a significant part of the planetary system. Ecological knowledge is\nrequired for application at all levels of their disposal, from finding sites, coping with mining wastes, hazardous wastes, air pollution, water pollution, pesticides, waste heat, radioactive wastes, and coping with the\ngreenhouse effect and breaks in the ozone layer. Sound scientific knowledge is required not only to minimise undesirable effects but also to get an accurate and balanced picture of threats and future risks.\nAgro-Ecological Systems\nToday's countryside has, worldwide, been shaped and maintained largely by farming activities, and most semi-natural areas are managed with agricultural production as a prime motivation. However, changes in\nfarming practices have reduced the value to wildlife of many farms.\nThe first comprehensive national discussion on agri-ecological management to increase farm biodiversity in the United Kingdom was signalled by a conference organised by the Royal Society for the Protection of\nBirds and the Farming and Wildlife Advisory Group of Agricultural and Conservation Organisations. This took place in July 1969 at the Silsoe Agricultural College, Bedfordshire. For the first time farmers and\nconservationists met to make bridges between the two extremes of land management. The weekend conference focused on the management of Pendley Grove Farm, a collection of farmed fields made available\nfor delegates to suggest proposals to couple arable and livestock farming with management objectives in order to increase wildlife. A report on the meeting, 'Farming & Wildlife: A study in compromise', was\npublished in 1971 (Barber, 1971). A most important event following the Silsoe weekend took place in Dorset on the 25–26 July 1970. Here a 320-acre enterprise, East Farm, Hammoon in the Blackmore Vale, near\nSturminster Newton, was surveyed in even greater detail than Pendley Grove, and the study in reconciliation between wildlife and farming widened to include forestry and hunting, as well as freshwater fishing\ninterests.\nAt East Farm a fundamental issue, which arose at Silsoe, again came well to the fore in the Dorset discussions. It's an issue of applied ecology which relates to the 'strategy' of planning a farm for wildlife\ninterests, in contrast to a series of ad hoc measures carried out by a farmer, which might suitably be referred to as 'tactics'.\nThere is a wealth of difference between a number of unrelated actions on a farm, such as leaving hedges for the sake of leaving hedges (however desirable the retention of any hedge might be) and the planting\nof an odd clump of trees to improve the view, and an integrated conservation plan for a farm based on a full understanding of how to provide the most valuable and varied habitats. For it is very desirable that\nthere is a connection between the various physical features. Mammals, many birds - particularly game birds - and some insects need to use connecting lines, travel-ways, flyways, stepping stones, between\nisolated parcels of trees; and hedges in most instances, wild patches become much more valuable as habitats if they form uninterrupted links.\nReference was made at the Dorset meeting to the extraordinary amount of activity, which the Silsoe conference had triggered off and which coincided with all the publicity attaching to European Conservation Year\nin 1971. There was now, it was said, a steadily increasing interest in planting patches of woodland, shelter belts and field corners, and one prominent agriculturalist stated that he had no doubt that farmers would\nbe planting thousands of acres throughout the country during the next decade. However, the sponsors of the conferences were not so optimistic. It seemed pertinent to ask whether the trees would always be\nplanted in the most appropriate place and whether full acknowledgement would be made of the need to ensure, farm requirements permitting, that this relatively new concept of providing connecting ecological\nlinks will be applied.\nIn many cases a series of unrelated actions on a farm was all that was hoped for, but the importance of this particular issue of integrating physical features was an important matter of applied ecology. It was\nconsidered to be a vital part of the conservation message going out to the farming and land-owning community.\nIn fact it took another twenty years before the Silsoe proposals developed as an integrated government policy, which was set out in the 1994 UK Biodiversity Action Plan. In the meantime pilot schemes had been\norganised and several national programmes were developed, but the loss of farmland habitats continued, with government subsidies for drainage and hedgerow removal. Between 1984 and 1990 there was a net\nloss of 23% of hedges (about 130,000 km) in Great Britain. The net loss of hedges was the result of a combination of hedge removal and hedge degradation, and it occurred despite the planting/ regeneration of\nabout 50,000 km of hedges. In addition to the reduction in the extent of this important linear habitat, there was also a lost of quality. Between 1978 and 1990, on average one plant species was lost from each 10\nmetres of hedge, an 8% loss of plant species diversity.\nNevertheless, at the time the strategy was published, Silsoe and other initiatives had resulted in several integrated farming and conservation programmes initiated by government agencies. These were initiatives\nin applied ecology to integrate agricultural and environmental objectives designed to conserve and enhance wildlife habitats in the farmed countryside. They were targeted at selected areas and habitats to help\nsecure biodiversity objectives.\nEnvironmentally Sensitive Areas (ESAs) were run by the territorial agricultural departments, this scheme was targeted on areas of high conservation value. It provided incentives to farmers\nand crofters to protect and enhance environmental features of their land and to prevent damage to landscapes and wildlife, which might result from some types of agricultural\nintensification.\nA ‘Countryside Stewardship Scheme’ for England and ‘Tir Cymen’ a payment by results scheme being trialled in Wales (run by the Countryside Commission and the Countryside Council\nfor Wales), were pilot projects offering a flexible system of incentives to farmers and land managers to conserve, enhance and in some instances recreate, selected important landscapes\nand their wildlife habitats in England and Wales.\nThe ‘Wildlife Enhancement Scheme’ aimed to develop a new and more positive working relationship with owners and occupiers of Sites of Special Scientific Interest (SSSIs) and to make\nfull use of their land management skills and experience of local conditions. English Nature launched this three-year pilot scheme in 1991. By the end of March 1993 the scheme had been\nextended to cover four areas. An essential part of the scheme required land managers to record what they had done on the land in a way that could be used by English Nature. This\ninformation was then used to fine tune management practices in the light of experience to achieve the best results for wildlife. Under the scheme a straightforward management agreement\nand management plan was agreed with English Nature in return for a fixed annual payment, which reflected the additional costs of managing the SSSI for wildlife. Provision was also made\nfor fixed cost works such as fencing which are needed to allow grazing for conservation purposes.\nThe ‘Farm and Conservation Grant Scheme’ was run by the territorial agricultural departments. The scheme allowed grants to be paid to farmers for capital works, which have an\nenvironmental value including traditional field boundaries and shelterbelts, and heather management.\nThe ‘Farm Woodland Premium Scheme’ was also run by the territorial agricultural departments, this scheme offered incentives to farmers to plant and maintain primarily broad-leaved\nwoodlands on farms, thereby contributing to biodiversity and providing other environmental benefits.\nThe ‘Hedgerow Incentive Scheme’ was run by the Countryside Commission, this scheme offered incentives to secure the long-term well being and environmental value of threatened\nhedgerows, through the re-introduction of beneficial management.\nIn addition to these economic incentives, free technical advice was made available for farmers on pollution and conservation issues, in the form of on-farm visits and Codes of Practice, for example on ‘Good\nUpland Management’ and on ‘Good Agricultural Practice for the Protection of Water, Air and Soil’. Opportunities for enhancing biodiversity include encouraging the use of traditional, long established livestock\nbreeds that are adapted to the climate and topography of each region. Where necessary, regulations were also used to provide essential environmental safeguards, in connection with, for example, the approval of\npesticides and the storage of slurry and agricultural fuelled oil. Underpinning all these initiatives was the Government's R&D programme, designed to improve understanding of the complex interactions between\nUK agriculture and the environment (it received £67 million in 1992/3).\nAll of these initiative appeared in the UK Biodiversity Action Plan. This was an important outcome from the Rio Environment Summit of 1992 and in effect it set out how ecology should be applied and integrated\nwith agricultural production. The strategy emphasised the significance for eco-agricultural systems in relation to the fact that almost 77% of the UK land surface is in farming use. Agriculture is, therefore, a key\ndeterminant of the Nation’s biodiversity, and farmers and landowners are key partners in implementing measures to further biodiversity.\nWithin the relatively small area of the UK there is a great diversity of farming types. This reflects a varied climate, geology, soils and local traditions. Each farming type makes its own contribution to biodiversity,\nand many habitats and species depend upon traditional agricultural practices for their survival. Agricultural habitats may be highly diverse at the local level. Others may have relatively low local biodiversity, but\nnonetheless support unusual assemblages of species, which are nationally or internationally rare, and therefore contribute to global biodiversity.\nMaintaining biodiversity can have commercial benefits for agriculture. For example, biological pest control - which has been developed through an understanding of ecosystems and predator/prey relationships -\nhas in some cases allowed a reduction in the use of pesticides. An attractive countryside, rich in wildlife, is also a basis for farm diversification through the growth in farm tourism, and can bring benefits to the\nwider rural economy.\nBiodiversity has played a vital role in enabling agriculture to develop to its current productive state. Genetic variation has allowed plant breeders to select desirable characteristics and manipulate plant character\nand productivity. Maintaining genetic diversity will be a significant factor in the stability and future development of agriculture, while modern biotechnology is likely to lead to the cultivation of new crops and crop\nstrains for food and industrial use. On the other hand, a reduction in the variety of crops and livestock may result in greater vulnerability to disease and pest attack.\nWith regards threats and opportunities, the UK biodiversity strategy singled out three main concerns:\nthe continuing loss and fragmentation of habitats such as chalk grassland, heather moorland, hay meadows and wetlands, as a result of such factors as intensified farming practices, land drainage and\nabstraction of water and road construction;\nthe loss of habitats, linear features such as hedgerows, field margins and ditches, and individual species resulting from neglect or abandonment, and from the decline of traditional forms of management as\nthey become increasingly uneconomic and difficult to sustain;\ndamage to soils, water and ecosystems caused by inappropriate use of fertilisers and pesticides and atmospheric pollution.\nBiodiversity is enhanced by policies, which encourage land management practices, which produce benefits for wildlife. The aim of such policies is to:\nprotect and maintain existing wildlife features and habitats, which are important for biodiversity;\nenhance the wildlife value of farmland, which is of low biodiversity at present;\ntake advantage of opportunities to establish new, permanent areas of conservation value, especially when identifying alternative uses for agricultural land.\nOpportunities for enhancing biodiversity include:\nrecognising and strengthening those regional and local farming and land management practices that enhance the national diversity of flora and fauna, habitats, landscapes, historical features and character,\nand which will help to strengthen links between land use and local community identity;\nimproving livestock management to minimise pollution from wastes and establishing stocking densities on moors, heaths and semi-natural grasslands which are related more closely to the environmental\ncarrying capacity of the land;\nimproving crop management to reduce the need for fertilisers and pesticides;\nencouraging the use of traditional, long established livestock breeds and crop varieties, which are adapted to the climate, and topography of each region;\nrecognising the importance of those traditional skills and practices used by those who manage land, and upon which many valued habitats depend.\nintroducing greater diversity on the farm, for example through the encouragement of reversion of arable land to pastoral use in appropriate areas and the wider use of rotations in arable farming;\nmaintaining hedges, where possible and appropriate to the area concerned;\nwithdrawing from productive agriculture altogether in selected areas and allowing natural succession to take its course.\nThis broad review sets out scope of the field of agro-ecological systems. Updates are required from the 1994 baseline with regards, legislation, policy, strategy and examples of operational management.\nWetland Engineering\nExamples of engineered wetlands are those currently constructed for remediation applications: as surface flow systems for the removal of\npollutants from liquid effluents such as sewage and petroleum wastes. The systems rely primarily on microbial communities, which grow as\nbiofilms in the plant root zone. Their construction relies on an understanding of the relationship between the selection of vegetative species\nand soil, hydrology, grading/site preparation, and installation methods. Construction of wetlands involves an understanding of the various\nscientific, legal, and technical components of wetland ecology.\nAn engineered wetland with areas of open water is similar to that of a natural marsh. These systems are typically designed to support the\ngrowth of emergent wetland plants, interspersed with lagoons. These surface flow systems are more tolerant of wastewaters with high\nsuspended solid concentrations than gravel-bed systems, and they support a higher biodiversity than subsurface flow water treatment\nsystems. They model the ecology of natural habitats such as salt scrub, pine savannahs, estuarine tidal marshes, forested wetlands, shrub-\nscrub wetlands, emergent wetlands, freshwater tidal wetlands, brackish tidal wetlands, and open marshes. Construction requires an\nunderstanding of the relationship between the selection of vegetative species and soil, hydrology, grading/site preparation, and installation\nmethods. The management system involves an ecological rationale for maintaining a high clearance rate of pollutants.\nMillennium Wetlands & Trostre Works. The newly-created waterfowl\nsanctuary contrasts with South Wales' traditional industry.\nDisease Transmission\nIn 1999, a study group on Veterinary Public Health (VPH), convened jointly by the World Health Organization (WHO), the Food and Agriculture Organization of the United nations (FAO), and the Office\nInternational des epizooties (OIE), and including twenty-eight experts from eighteen countries, defined veterinary public health as \"the contribution to the complete physical, mental, and social well-being of\nhumans through an understanding and application of veterinary science.\" The emphasis was on the human ecosystem where the contribution of veterinary science to human health has been fundamental and\nsustained over millennia. It is not generally appreciated that this contribution pertains not only to livestock and food production, animal traction, and transportation, which have laid the basis for most urban\nsocieties around the world. The study and management of animal diseases have also laid the basis for much of what we know about the dynamics and management of infectious human diseases, and the\npromotion of environmental quality.\nDefined as diseases transmitted between vertebrate animals and humans, zoonotic diseases (zoonoses) include bubonic plague, Lyme disease, salmonella, and rabies. Disease-carrying animals, called\nreservoirs, infect humans through several pathways: when they are eaten by humans, when they bite humans, or when arthropods that have fed on them, such as mosquitoes or ticks, then feed on a human host.\nIt has been estimated that over 60% of infectious diseases impacting humans are zoonotic in origin and zoonoses are on the rise globally, accounting for over 75% of emerging diseases.\nMany important human diseases have originated in animals, and so changes in the habitats of animals that are disease vectors or reservoirs may affect human health, sometimes positively and sometimes\nnegatively. For example, the Nipah virus is believed to have emerged after forest clearance fires in Indonesia drove carrier bats to neighbouring Malaysia, where the virus infected intensively farmed pigs, and then\ncrossed to humans. Intensive livestock production, while providing benefits to health in terms of improved nutrition, has also created environments favourable to the emergence of diseases. Greater human\ncontact with wild species and 'bush meat' from encroachment in forests and changes in diet also create opportunities for disease transmission. Trends ranging from forest clearance to climate-induced habitat\nchanges also appear to have impacted certain populations of mosquitoes, ticks and midges, altering transmission patterns for diseases like malaria and lyme disease.\nUntil recently, zoonotic diseases have not been treated as part of ecological systems. In response to the prevalence of zoonoses, the multidisciplinary field of disease ecology has emerged. It involves the study of\nany ecological system that includes pathogens and incorporates the complexity of multiple interactions. The research area covers basic processes underlying the linkages between climate, ecosystems, and\ninfectious disease, particularly the different ways that climate can influence the emergence and transmission of infectious disease agents. For example Mexican researchers adopted an ecosystem approach to\nbetter understand the complex set of factors that influenced the incidence and spread of malaria in Oaxaca. This project includes the molecular biology of the vector and the parasite, community perceptions of\nmalaria, statistical analyses, and a geographic information-based surveillance system.\nMammals are the most common reservoirs for zoonotic diseases, with rodents leading the pack. The plague (Yersinia pestis), Lyme disease (Borrelia burgdorferi), Hantavirus pulmonary syndrome and Rocky\nMountain spotted fever (Rickettsia rickettsii) all owe their spread to the presence of rodents. From an ecological perspective, rodents occupy the middle rung of the food chain. Primarily herbivores, with diets rich\nin plant matter, they are a food source for vertebrate predators such as foxes, and owls.\nAquatic animals that carry human parasites are also a source of disease and death. The human cost is high: The World Health Organization (WHO 2004, 2) estimates that globally \"1.8 million people die each\nyear from diarrhoeal diseases, 200 million people are infected with schistosomiasis and more than 1 billion people suffer from soil-transmitted helminthes infections.\"\nUnfortunately, agricultural systems, especially irrigated ones, have long been associated with manifestations of extreme human ill-health arising from water-related diseases. The major reason is that public health\nand disease control programs have not been concerns of the water resources sector, which typically has focused on potential economic benefits of water bodies in terms of food production and power generation.\nThis theme of applied ecology aims to increase knowledge of the relationship between water, human health and ecosystems; and to develop practical measures to reduce negative environmental health impacts\nby:\nmitigating adverse impacts due to malaria and other water-related parasitic diseases through water and land management strategies;\nmanaging the agricultural use of polluted water sources (including urban and industrial waste) so as to optimize food production and livelihoods benefits and minimize adverse health and environmental\nimpacts;\nexploring the trade-offs necessary to provide for environmental water requirements in river basins, the wise use of wetland ecosystems, and the conservation of biodiversity through the application of eco-\nagricultural principles.\nAnother important issue is the dangerous integration of circumstances when animals and consumers from different ecosystems come into contact. The lack of resistance to new pathogens makes humans and\nanimals replicating reservoirs, for viruses and bacteria to adapt and rapidly mutate. Further, the staggering numbers of animals and people in contact change one-in-a-million odds of a disease transfer into almost\na daily possibility. Even under the most hygienic conditions, this pool of viruses, bacteria, and other pathogens creates optimal conditions for diseases to multiply rapidly and jump between species to exploit new\npotential hosts; something the most \"successful\" diseases do all too well. Under this scenario, two problems are created. First is the high risk of new diseases spreading into human populations. Second is that\nthis can create a \"fear factor\" amongst people - their concern that wildlife is unhealthy might cause them to try to remove the threat by killing the wildlife. Shooting flying foxes was proposed in Southeast Asia\nwhen they were thought to be carrying nipa virus, even though the link has not been definitively proven and the disease is rarely found in flying foxes.\nThe global trade in wildlife provides disease transmission mechanisms that not only cause human disease outbreaks but also threaten livestock, international trade, rural livelihoods, native wildlife populations,\nand the health of ecosystems. Outbreaks resulting from wildlife trade have caused hundreds of billions of dollars of economic damage globally.\nIn almost all cases, eradication schemes are not cost efficient or effective means to reduce disease spread when compared to health education, sanitation, and controlling animal movement. Moreover, eradication\nschemes do not address the fundamental problem of our creating conditions, which maximize opportunities for disease build-up and cross-species transmission. Much research is still needed on the links between\nviruses in different species and human disease, and means of transmission between the two. Rather than attempting to eradicate pathogens or the wild species that may harbour them, a practical approach would\ninclude decreasing the contact rate among species, including humans, at the interface created by the wildlife trade. Since wildlife marketing functions as a system of networks with major hubs, these points\nprovide control opportunities to maximize the effects of regulatory efforts.\nIntensive production has also given rise to new disease problems, such as Bovine Spongiform Encephalopathy (Mad Cow Disease) and Avian flu. These indicate the potential for disease transmission through\nhuman food chains that are now often extended halfway across the globe. Industrialized animal production systems are now major features of human ecology. They have considerable impacts on the quality of the\natmosphere, water and soil due to nutrient overloads; they impact terrestrial ecosystems directly and indirectly; in addition, disruption of marine fisheries occurs locally with pollution and runoff from production\nfacilities and globally in terms of depletion of fish stocks where fishmeal has become a large commodity in the production of livestock feeds.\nThe response to the fact that several vector-borne, parasitic or zoonotic diseases have (re)-emerged and spread in Europe with major health, ecological, socio-economical and political consequences, has been\nthe establishment of EDEN (Emerging Diseases in a changing European Environment). Most of these outbreaks are linked to global and local changes resulting from climate change, human-induced landscape\nchanges or the activities of human populations. Europe must anticipate, prevent and control new emergences to avoid major societal and economical crises (cf. SARS in Asia, West Nile in the USA). EDEN offers\na unique opportunity to prepare for uncertainties about the future of the European environment by exploring the impact of environmental. Other aims are to identify, evaluate and catalogue European ecosystems\nand environmental conditions linked to global change, which can influence the spatial and temporal distribution and dynamics of human pathogenic agents. The project will develop and co-coordinate at the\nEuropean level a set of generic methods, tools and skills such as predictive emergence and spread models, early warning, surveillance and monitoring tools and scenarios, which can be used by decision makers\nfor risk assessment, decision support for intervention and public health policies both at the EU and at the national or regional level. Part of EDEN's innovation will be to combine spatial data (earth observation\ndata, GIS etc.) with epidemiological data.\nEDEN has selected for study a range of indicator human diseases that are especially sensitive to environmental changes and will be studied within a common scientific framework (involving Landscapes, Vector\nand Parasite bionomics, Public Health, and Animal Reservoirs). Some of these diseases are already present in Europe (tick- and rodent-borne diseases, leishmaniasis, West Nile fever); others were present\nhistorically (malaria) and so may re-emerge, whilst others are on the fringes of Europe (Rift Valley fever) in endemic regions of West and Northern Africa.\nBreeding and Reintroduction of Rare Species\nOrganisations\n'Species re-introduction' is a process to establish a plant or animal in an area which was once part of its historical range, but from which it has been extirpated or become extinct. 'Species re-establishment' is a\nsynonym, which usually implies that the re-introduction has been successful. The term translocation is used to describe the deliberate and mediated movement of wild individuals or populations from one part of\ntheir range to another. Reinforcement or supplementation means the addition of individuals to an existing population.\n'Benign introduction' is a process to establish a species, for the purpose of conservation, outside its recorded distribution but within an appropriate habitat and eco-geographical area.\nZoos, aquaria, marine parks, insect houses, botanical gardens - all have their role to play in captive breeding of plants and animals to provide stocks for reintroductions, be it by actually conducting captive\nbreeding, or providing expertise and help. It is estimated that there are about 500,000 animals in captivity in zoos throughout the world. However, it is widely believed that for best results, captive breeding must be\ndone with minimum human contact. The survival of up to 60,000 plant species - about a quarter of the world's total - will be threatened over the next few decades by population growth, deforestation, habitat loss,\ndestructive development and agricultural expansion. Human survival is threatened by the destruction of plants on such a massive scale. In addition to the small number of crop plants we use for our basic food,\nmany wild plants also have great economic importance, providing food, fuel, clothing and shelter for hundreds of millions of people throughout the world. Plants also supply medicines, especially in developing\ncountries where vast numbers depend on wild plants for their traditional remedies. Plants also help maintain the planet's environmental balance and ecosystem stability and provide habitats for the world's animal\nlife.\nBotanical Gardens\nThere are about 1,600 botanic gardens in the world. They grow tens of thousands of plant species between them; probably as much as a quarter\nof all the world's flowering plants and ferns are in their collections. The increasing rate of the loss of plant diversity and wild habitats worldwide\nhas encouraged many botanic gardens to become important conservation centres.\nIn many countries, botanic gardens are amongst the leading, and sometimes the only, institutions involved in or capable of undertaking extensive\nwork in wild plant research and conservation. Many new botanic gardens are being opened or developed to act as centres for plant conservation,\nstudy and education, particularly of plants native to their own regions.\nBotanic gardens can be defined as public gardens which maintain collections of live plants mainly for study; for scientific research, conservation\nor education. Many different types of botanic gardens occur, large and small. While their size and resources varies hugely, botanic gardens are\nunited in the belief of the important role that they must play in preserving the world's plant diversity.\nBotanical gardens grow large collections of endangered plants, holding them safely in cultivation or seed banks in case wild populations\nare destroyed.\nThey reintroduce plants back to wild as part of species recovery projects.\nThey undertake botanical research to document and record the plants of the world and their characteristics. For example, their collections\nof dried plants (herbaria) contain millions of specimens as a permanent global reference on plant diversity.\nThey promote environmental awareness amongst the general public through their education work. Globally, botanic gardens receive more\nthat 150 million visitors each year.\nThey are expert centres for horticulture and training; knowing how to grow a plant may be a key to its future survival.\nZoos and Other Institutions for Animal Breeding\nA commonly stated aim of many captive breeding programmes conducted in zoological parks is to produce founder populations for release into\nthe wild in reintroduction programmes. Not many zoos possess the know-how for seriously managing captive populations, though that is a\nsituation that is rapidly changing. With new technology, like molecular and DNA analysis, species management has become easier and helps\nscientists avoid potential pitfalls. For example, mapping genealogical information also helps minimising inbreeding.\nPolicy guidelines have been drafted by the Re-introduction Specialist Group of the International Union for the Conservation of Nature and Natural\nResources (IUCN) in response to the increasing occurrence of re-introduction projects worldwide, and consequently, to the growing need for\nspecific policy guidelines to help ensure that the re-introductions achieve their intended conservation benefit, and do not cause adverse side-\neffects of greater impact.\nThese guidelines are intended to act as a guide for procedures useful to re-introduction programmes and do not represent an inflexible code of conduct. Many of the points are more relevant to re-introductions\nusing captive-bred individuals than to translocations of wild species. Others are especially relevant to globally endangered species with limited numbers of founders. Each re-introduction proposal should be\nrigorously reviewed on its individual merits. It should be noted that re-introduction is always a very lengthy, complex and expensive process. The following sections which illustrate the requirement to integrate\necological knowledge with re-introduction, have been taken from the guidelines.\nAims and objectives\nThe principal aim of any re-introduction should be to establish a viable, free-ranging population in the wild, of a species, subspecies or race, which has become globally or locally extinct, or extirpated, in the wild. It\nshould be re-introduced within the species' former natural habitat and range and should require minimal long-term management.\nThe objectives of a re-introduction may include: to enhance the long-term survival of a species; to re-establish a keystone species (in the ecological or cultural sense) in an ecosystem; to maintain and/or restore\nnatural biodiversity; to provide long-term economic benefits to the local and/or national economy; to promote conservation awareness; or a combination of these.\nA re-introduction requires a multidisciplinary approach involving a team of persons drawn from a variety of backgrounds. As well as government personnel, they may include persons from governmental natural\nresource management agencies; non-governmental organisations; funding bodies; universities; veterinary institutions; zoos (and private animal breeders) and/or botanic gardens, with a full range of suitable\nexpertise. Team leaders should be responsible for coordination between the various bodies and provision should be made for publicity and public education about the project.\nBiological\n(i) Feasibility study and background research\nAn assessment should be made of the taxonomic status of individuals to be re-introduced. They should preferably be of the same subspecies or race as those which were extirpated, unless adequate numbers\nare not available. An investigation of historical information about the loss and fate of individuals from the re-introduction area, as well as molecular genetic studies, should be undertaken in case of doubt as to\nindividuals' taxonomic status. A study of genetic variation within and between populations of this and related taxa can also be helpful. Special care is needed when the population has long been extinct.\nDetailed studies should be made of the status and biology of wild populations(if they exist) to determine the species' critical needs. For animals, this would include descriptions of habitat preferences,\nintraspecific variation and adaptations to local ecological conditions, social behaviour, group composition, home range size, shelter and food requirements, foraging and feeding behaviour, predators and\ndiseases. For migratory species, studies should include the potential migratory areas. For plants, it would include biotic and abiotic habitat requirements, dispersal mechanisms, reproductive biology,\nsymbiotic relationships (e.g. with mycorrhizae, pollinators), insect pests and diseases. Overall, a firm knowledge of the natural history of the species in question is crucial to the entire re-introduction\nscheme.\nThe species, if any, that has filled the void created by the loss of the species concerned, should be determined; an understanding of the effect the re-introduced species will have on the ecosystem is\nimportant for ascertaining the success of the re-introduced population.\nThe build-up of the released population should be modelled under various sets of conditions, in order to specify the optimal number and composition of individuals to be released per year and the numbers\nof years necessary to promote establishment of a viable population.\nA Population and Habitat Viability Analysis will aid in identifying significant environmental and population variables and assessing their potential interactions, which would guide long-term population\nmanagement.\n(ii) Previous Re-introductions\nThorough research into previous re-introductions of the same or similar species and wide-ranging contacts with persons having relevant expertise should be conducted prior to and while developing re-\nintroduction protocol.\n(iii) Choice of release site and type\nSite should be within the historic range of the species. For an initial re-inforcement there should be few remnant wild individuals. For a re-introduction, there should be no remnant population to prevent\ndisease spread, social disruption and introduction of alien genes. In some circumstances, a re-introduction or re-inforcement may have to be made into an area which is fenced or otherwise delimited, but it\nshould be within the species' former natural habitat and range.\nA conservation/ benign introduction should be undertaken only as a last resort when no opportunities for re-introduction into the original site or range exist and only when a significant contribution to the\nconservation of the species will result.\nThe re-introduction area should have assured, long-term protection (whether formal or otherwise).\n(iv) Evaluation of re-introduction site\nAvailability of suitable habitat: re-introductions should only take place where the habitat and landscape requirements of the species are satisfied, and likely to be sustained for the for-seeable future. The\npossibility of natural habitat change since extirpation must be considered. Likewise, a change in the legal/ political or cultural environment since species extirpation needs to be ascertained and evaluated as\na possible constraint. The area should have sufficient carrying capacity to sustain growth of the re-introduced population and support a viable (self-sustaining) population in the long run.\nIdentification and elimination, or reduction to a sufficient level, of previous causes of decline: could include disease; over-hunting; over-collection; pollution; poisoning; competition with or predation by\nintroduced species; habitat loss; adverse effects of earlier research or management programmes; competition with domestic livestock, which may be seasonal. Where the release site has undergone\nsubstantial degradation caused by human activity, a habitat restoration programme should be initiated before the re-introduction is carried out.\n(v) Availability of suitable release stock\nIt is desirable that source animals come from wild populations. If there is a choice of wild populations to supply founder stock for translocation, the source population should ideally be closely related\ngenetically to the original native stock and show similar ecological characteristics (morphology, physiology, behaviour, habitat preference) to the original sub-population.\nRemoval of individuals for re-introduction must not endanger the captive stock population or the wild source population. Stock must be guaranteed available on a regular and predictable basis, meeting\nspecifications of the project protocol.\nIndividuals should only be removed from a wild population after the effects of translocation on the donor population have been assessed, and after it is guaranteed that these effects will not be negative.\nIf captive or artificially propagated stock is to be used, it must be from a population which has been soundly managed both demographically and genetically, according to the principles of contemporary\nconservation biology.\nRe-introductions should not be carried out merely because captive stocks exist, nor solely as a means of disposing of surplus stock.\nProspective release stock, including stock that is a gift between governments, must be subjected to a thorough veterinary screening process before shipment from original source. Any animals found to be\ninfected or which test positive for non-endemic or contagious pathogens with a potential impact on population levels, must be removed from the consignment, and the uninfected, negative remainder must\nbe placed in strict quarantine for a suitable period before retest. If clear after retesting, the animals may be placed for shipment.\nSince infection with serious disease can be acquired during shipment, especially if this is intercontinental, great care must be taken to minimize this risk.\nStock must meet all health regulations prescribed by the veterinary authorities of the recipient country and adequate provisions must be made for quarantine if necessary.\n(vi) Release of captive stock\nMost species of mammal and birds rely heavily on individual experience and learning as juveniles for their survival; they should be given the opportunity to acquire the necessary information to enable\nsurvival in the wild, through training in their captive environment; a captive bred individual's probability of survival should approximate that of a wild counterpart.\nCare should be taken to ensure that potentially dangerous captive bred animals (such as large carnivores or primates) are not so confident in the presence of humans that they might be a danger to local\ninhabitants and/or their livestock.\nSocio-economic and Legal\nRe-introductions are generally long-term projects that require the commitment of long-term financial and political support.\nSocio-economic studies should be made to assess impacts, costs and benefits of the re-introduction programme to local human populations.\nA thorough assessment of attitudes of local people to the proposed project is necessary to ensure long term protection of the re-introduced population, especially if the cause of species' decline was due to\nhuman factors (e.g. over-hunting, over-collection, loss or alteration of habitat). The programme should be fully understood, accepted and supported by local communities.\nWhere the security of the re-introduced population is at risk from human activities, measures should be taken to minimise these in the re-introduction area. If these measures are inadequate, the re-\nintroduction should be abandoned or alternative release areas sought.\nThe policy of the country to re-introductions and to the species concerned should be assessed. This might include checking existing provincial, national and international legislation and regulations, and\nprovision of new measures and required permits as necessary.\nRe-introduction must take place with the full permission and involvement of all relevant government agencies of the recipient or host country. This is particularly important in re-introductions in border areas,\nor involving more than one state or when a re-introduced population can expand into other states, provinces or territories.\nIf the species poses potential risk to life or property, these risks should be minimised and adequate provision made for compensation where necessary; where all other solutions fail, removal or destruction of the\nreleased individual should be considered. In the case of migratory/mobile species, provisions should be made for crossing of international/state boundaries.\n(i) Planning, preparation and release stages\nApproval of relevant government agencies and land owners, and coordination with national and international conservation organizations.\nConstruction of a multidisciplinary team with access to expert technical advice for all phases of the programme.\nIdentification of short- and long-term success indicators and prediction of programme duration, in context of agreed aims and objectives.\nSecuring adequate funding for all programme phases.\nDesign of pre- and post- release monitoring programme so that each re-introduction is a carefully designed experiment, with the capability to test methodology with scientifically collected data. Monitoring\nthe health of individuals, as well as the survival, is important; intervention may be necessary if the situation proves unforseeably favourable.\nAppropriate health and genetic screening of release stock, including stock that is a gift between governments. Health screening of closely related species in the re-introduction area.\nIf release stock is wild-caught, care must be taken to ensure that: a) the stock is free from infectious or contagious pathogens and parasites before shipment and b) the stock will not be exposed to vectors\nof disease agents which may be present at the release site (and absent at the source site) and to which it may have no acquired immunity.\nIf vaccination prior to release, against local endemic or epidemic diseases of wild stock or domestic livestock at the release site, is deemed appropriate, this must be carried out during the \"Preparation\nStage\" so as to allow sufficient time for the development of the required immunity.\nAppropriate veterinary or horticultural measures as required to ensure health of released stock throughout the programme. This is to include adequate quarantine arrangements, especially where founder\nstock travels far or crosses international boundaries to the release site.\nDevelopment of transport plans for delivery of stock to the country and site of re-introduction, with special emphasis on ways to minimize stress on the individuals during transport.\nDetermination of release strategy (acclimatization of release stock to release area; behavioural training - including hunting and feeding; group composition, number, release patterns and techniques; timing).\nEstablishment of policies on interventions (see below).\nDevelopment of conservation education for long-term support; professional training of individuals involved in the long-term programme; public relations through the mass media and in local community;\ninvolvement where possible of local people in the programme.\nThe welfare of animals for release is of paramount concern through all these stages.\n(ii) Post-release activities\nPost release monitoring is required of all (or sample of) individuals. This most vital aspect may be by direct (e.g. tagging, telemetry) or indirect (e.g. spoor, informants) methods as suitable.\nDemographic, ecological and behavioural studies of released stock must be undertaken.\nStudy of processes of long-term adaptation by individuals and the population.\nCollection and investigation of mortalities.\nInterventions (e.g. supplemental feeding; veterinary aid; horticultural aid) when necessary.\nDecisions for revision, rescheduling, or discontinuation of programme where necessary.\nHabitat protection or restoration to continue where necessary.\nContinuing public relations activities, including education and mass media coverage.\nEvaluation of cost-effectiveness and success of re- introduction techniques.\nRegular publications in scientific and popular literature.\nEnvironmental Valuation\nHumanity and nature\nFor those wishing to establish a point in history when checking out the impact of human activities on the environment became a thing worth doing, a good date is 1864, and the event is the publication by George\nPerkins Marsh of his book, 'Man and Nature, or Physical Geography Modified by Human Action'. In his travels as an American diplomat, Marsh was well placed not only to document environmental change, but\nalso to evaluate it. In this respect he is remembered for the way he forcefully pointed out the difference in attitudes between the native people's and European's attitudes to the natural world. The native leaves a\nslight footprint on the Earth, whilst civilisation \"assumes an aggressive attitude, and thenceforward strives to subdue to his control and subject to his uses, all her productivity and all her motive powers\". Another\nway of stating this difference is that preindustrial production systems are characteristic of 'inscribed groups', who organise for the sustained exploitation of local natural resources. They are inscribed, or\nembedded, into local ecosystems by being linked to the productivity of a narrow range of biophysical flows which limit the number of people who can partake of the local resources. Modern production systems are\ncharacteristic of 'constructive groups' who construct a landscape to serve their economic aspirations, populating it beyond the limits of the local natural productivity, importing goods and services from elsewhere,\nthereby destroying its ecosystems. Costructive groups gather around sites where there is an application of inventions for mass production. Workers migrate attracted by better wages and prospects, taking\nadvantage of improved communications.\n'Man and Nature' was the most comprehensive statement about land management that had ever appeared. It was culled from Marsh's own farming experiences in New England and his research into the works of\nEuropean naturalists, geographers, foresters and hydrologists. There is no better exposition of need for environmental impact assessment and its precautionary principle than the following:\n\"The equation of animal and vegetable life is too complicated a problem for human intelligence to solve and we can never know how wide a circle of disturbance we produce in the harmonies of nature when we\nthrow the smallest pebble in the ocean of organic life\"\nGEMS and Surveillance\nAs far as wildlife was concerned Marsh advised farmers to err on the side of caution rather than risk destroying a vital part of their production system.\nJust over a century later the US National Environmental Policy Act of 1970 required the preparation of Environmental Impact Assessments for the evaluation of any detrimental effects of new schemes that would\naffect landform and drainage. This was followed two years later by the Global Monitoring System (GEMS), which was endorsed by the U.N. Conference on the Human Environment in Stockholm. Then followed a\nspate of conventions and conferences that placed the topic of environmental evaluation at the top of international and national strategies of economic development. The practical outcomes were the application of\necological principles to programmes of surveillance, monitoring and impact assessment at the levels of biosphere, ecosystem, landscape and population. Some of the early milestones are:\n1946 International Convention for the Regulation of Whaling establishes the International Whaling Commission.\n1948 UN Charter; International Union for the Protection of Nature (IUPN) established.\n1955 The Wenner Gren Conference on Man's Role in Changing the Face of the Earth, Wenner Gren Foundation, Princeton, New Jersey, USA.\n1956 Man's Role in Changing the Face of the Earth (Thomas Ed. 1955) published.\n1957 The IUPN becomes the International Union for the Conservation of Nature and Natural Resources (IUCN).\n1958 Law of the Sea. The first UN Conference on the Law of the Sea approves draft conventions.\n1958 U.K River quality survey\n1959 Antarctic Treaty; Economic and Social Council of the u N adopts resolution to publish a register of national parks and equivalent reserves of the world.\n1961 Establishment of World Wildlife Fund (World Wide Fund for Nature).\n1961 National Survey of Air Pollution set up the UK government in 1961\n1962 Silent Spring (Carson 1962) published.\n1964 International Council of Scientific Unions (icsu) established the International Biological Programme (IBP).\n1966 IUCN Red Data Books first published.\n1968 UNESCO 'Biosphere' Conference.\n1969 Friends of the Earth (FOE) founded.\n1970 The US National Environmental Policy Act (NEPA) requires preparation of Environmental Impact Assessments.\n1971 Man and the Biosphere (MAB) Programme of UNESCO launched. Greenpeace International founded.\n1972 UN Stockholm Conference on the Human Environment; Concept of a Global Monitoring System (GEMS) endorsed by the Stockholm Conference; United Nations Environment (UNEP) Programme\nestablished. 'Blueprint for Survival' sponsored by the journal Ecologist. Limits to Growth (Meadows et al. 1972) published.\n1972 Landsat1 launched by U.S. National Aeronautics and Space Administration (NASA)\n1974 UNEP Regional Seas Programme established.\n1975 Convention on International Trade in Endangered Species of Wild Fauna and Flora (CITES); The Kenya Rangeland Ecological Monitoring Unit (KREMU) established as a result of collaboration\nbetween Kenya and the Canadian International Development Agency.\n1976 The Scientific Committee on Problems of the Environment (SCOPE) -reports to the International Council of Scientific Unions (icsu) on global trends in the biosphere most urgently requiring\ninternational and interdisciplinary scientific effort.\n1977 UN Conference on desertification.\n1979 World Climate Conference organized by the World Meteorological organization recognizes the 'greenhouse effect'.\n1980 World Conservation Strategy (IUCN) launched; IUCN Conservation Monitoring Centre (now the World Conservation Monitoring Centre) established.\n1988 Publication of BAOBAB Journal on Arid and Semi Arid Areas by Arid Lands Information Network\n1997 The Human Impact Reader: Readings and Case Studies Andrew Goudie Ed. Blackwell, Oxford\nAnnual Directories of environmental data and trends\nThe Green Globe Yearbook- Fridtjof Nansen Institute with Oxford University Press\nVital Signs- WorldWatch Institute with Earthscan Publications\nState of the World- Worldwatch Institute with W.W.Norton\nEnvironmental impact assessment\nIntroduction\nEnvironmental Impact Assessment can be defined as:\nThe process of identifying, predicting, evaluating and mitigating the biophysical, social, and other relevant effects of development proposals prior to major decisions being taken and\ncommitments made. The aim of an assessment is to address biodiversity at all appropriate levels and allow for enough survey time to take seasonal features into account. It should focus\non processes and services which are critical be conserved and protected in this context, it is essential that it is linked to the issue of securing sustainable livelihoods for local people based\non biodiversity resources.\nThe starting point of every environmental assessment is that biodiversity must be conserved to ensure it survives, continuing to provide services, values and benefits for current and future generations. The aim is\nto identify, protect and promote sustainable use of biodiversity, so that yields/harvests can be maintained over time. This involves examining the likely impacts of development on the benefits of biodiversity arising\nfrom the provision of essential life support systems and ecosystem services such as:\nwater yield;\nwater purification;\nbreakdown of wastes;\nflood control;\nstorm and coastal protection;\nsoil formation and conservation;\nsedimentation processes;\nnutrient cycling;\ncarbon storage;\nand climatic regulation.\nAn assessment process also takes into account the costs of replacing these services.\nAreas with \"important biodiversity\" are those that:\nSupport endemic, rare, declining habitats/species/genotypes.\nSupport genotypes and species whose presence is a prerequisite for the persistence of other species.\nAct as a buffer, linking habitat or ecological corridor, or play an important part in maintaining environmental quality.\nHave important seasonal uses or are critical for migration.\nSupport habitats, species populations, ecosystems that are vulnerable, threatened throughout their range and slow to recover.\nSupport particularly large or continuous areas of previously undisturbed habitat.\nAct as refugia for biodiversity during climate change, enabling persistence and continuation of evolutionary processes.\nSupport biodiversity for which mitigation is difficult or its effectiveness unproven including habitats that take a long time to develop characteristic biodiversity.\nAre currently poor in biodiversity but have potential to develop high biodiversity with appropriate intervention.\nIn 2005 the International Association for Impact Assessment (http://www.iaia.org/) published a public document on the guiding principles intended to promote \"biodiversity-inclusive\" impact assessment (IA),\nincluding Environmental Impact Assessment (EIA) for projects, and strategic environmental assessment (SEA) for policies, plans and programs.\nThe aim was to help practitioners to integrate biodiversity in IA, decision-makers to commission and review IAs, and other stakeholders to ensure their biodiversity interests are addressed in development\nplanning. This document serves as a useful introduction to the concept.\nIt centralises biodiversity as a cross-cutting theme relevant to all fields of IA, where the aim for conservation is to work to biodiversity-related Conventions that are based on the premise that further loss of\nbiodiversity is unacceptable.\nImpacts of development projects are assessed in terms of:\navoiding irreversible losses of biodiversity.\nseeking alternative solutions that minimize biodiversity losses.\nmitigation to restore any loss of biodiversity.\ncompensation for unavoidable loss by providing substitutes of at least similar biodiversity value.\nhighlighting opportunities for enhancement.\nThis approach can be called \"positive planning for biodiversity.\" It helps achieve no net loss of biodiversity by ensuring:\nPriorities and targets for biodiversity at international, national, regional and local level are respected, and a positive contribution to achieving them is made.\nDamage is avoided to unique, endemic, threatened or declining species, habitats and ecosystems; to species of high cultural value to society, and to ecosystems providing important services.\nGuiding Principles\nThe ‘Convention on Biological Diversity’ advocates an \"ecosystem approach\" to impact assessment because people and biodiversity depend on healthily functioning ecosystems that have to be assessed in an\nintegrated way, not constrained by artificial boundaries. The ecosystem approach is participatory and requires a long-term perspective based on a biodiversity-based study area and adaptive management to deal\nwith the dynamic nature of ecosystems, uncertainty and the often unpredictable nature of ecosystem functions, behavior and responses. Biodiversity concerns are not limited to protected areas. Elements of\nnatural systems remain in even the most urbanized cities and play an often important role in the quality of life in those cities.\nTraditional rights and uses of biodiversity are recognized in IA and the benefits from commercial use of biodiversity are shared fairly. Needs of future should be considered as well as current generations (inter-\ngenerational needs). Alternatives should be sought that do not trade in biodiversity \"capital\" to meet short term needs, where this could jeopardize the ability of future generations to meet their needs.\nThe precautionary principle is applied in any situation where important biodiversity may be threatened and there is insufficient knowledge to either quantify risks or implement effective mitigation. Application of the\nprecautionary principle requires that development consent should be delayed while steps are taken to ensure that best available information can be obtained through consultation with local stakeholders/experts\nand/or new information on biodiversity can be obtained/consolidated.\nAn environmental assessments involves consulting widely to ensure that all stakeholders have been consulted and that important biodiversity values are taken into account. Valuation of biodiversity can only be\ndone in negotiation with the different groups or individuals in society (stakeholders) who have an interest in biodiversity. Use traditional and indigenous knowledge wherever appropriate. Work carefully with\nindigenous communities to ensure that knowledge of biodiversity is not inappropriately exploited.\nOperating Principles\nScreening\nBiodiversity inclusive screening criteria are used to determine whether important biodiversity resources may be affected.\nBiodiversity screening \"triggers\" for IA should include: • Potential impacts on protected areas and areas supporting protected species. • Impacts on other areas that are not protected but are important for\nbiodiversity. • Activities posing a particular threat to biodiversity (in terms of their type, magnitude, location, duration, timing, reversibility). • Areas that provide important biodiversity services including extractive\nreserves, indigenous people's territories, wetlands, fish breeding grounds, soils prone to erosion, relatively undisturbed or characteristic habitat, flood storage areas, groundwater recharge areas, etc. Encourage\ndevelopment of a biodiversity screening map indicating important biodiversity values and ecosystem services. If possible, integrate this activity with the development of a National Biodiversity Strategy and Action\nPlan (NBSAP) and/or biodiversity planning at sub-national levels (e.g., regions, local authorities, towns) to identify conservation priorities and targets.\nScoping\nScoping leads to Terms of Reference for IA, defining the issues to be studied and the methods that will be used. Use scoping as an opportunity to raise awareness of biodiversity concerns and discuss alternatives\nto avoid or minimize negative impacts on biodiversity.\nIt is good practice to produce a scoping report for consultation. This should address the following issues (on the basis of existing information and any preliminary surveys or discussions):\nThe type of project, program, plan or policy, possible alternatives and a summary of activities likely to affect biodiversity\nAn analysis of opportunities and constraints for biodiversity (include \"no net biodiversity loss\" or \"biodiversity restoration\" alternatives)\nExpected biophysical changes (in soil, water, air, flora, fauna)resulting from proposed activities or induced by any socioeconomic changes\nSpatial and temporal scale of influence, identifying effects on connectivity between ecosystems, and potential cumulative effects\nAvailable information on baseline conditions and any anticipated trends in biodiversity in the absence of the proposal\nLikely biodiversity impacts associated with the proposal in terms of composition, structure and function\nBiodiversity services and values identified in consultation with stakeholders and anticipated changes in these (highlight any irreversible impacts)\nPossible measures to avoid, minimize, or compensate for significant biodiversity damage or loss, making reference to any legal requirements\nInformation required to support decision making and summary of important gaps\nProposed IA methodology and timescale\nFor practical use, develop in-country (sectoral) guidance translating this generic scoping sequence into tools, such as guidelines and sample Terms of Reference.\nSurvey\nAddress biodiversity at all appropriate levels and allow for enough survey time to take seasonal features into account. Focus on processes and services which are critical opportunity to raise awareness of\nbiodiversity concerns and discuss alternatives to avoid or minimize negative impacts on biodiversity.\nThe CIAI recommends basing the assessment on the following questions:\nAt the gene level, to what extent will the proposal have significant effects on:\nGenetic diversity of species, particularly rare and declining species and those with identified as priorities in NBSAPs and/or subnational biodiversity plans?\nOpportunities for species populations to interact, e.g., by increasing habitat fragmentation and isolation?\nRisk of extinction?\nPersistence of locally-adapted populations?\nAt the species level, to what extent will the proposal:\nAlter the species-richness or species-composition of habitats in the study area?\nAlter the species-composition of communities?\nCause some species to be lost from the area?\nAffect species identified as priorities in NBSAPs and/or subnational biodiversity plans?\nIncrease the risk of invasion by alien species?\nAt the ecosystem level, to what extent will the proposal:\nChange the amount, quality or spatial organization of habitat?\nAffect plans to enhance habitat availability or quality?\nDamage ecosystem processes and services, particularly those on which local communities rely?\nFinally:\nIf habitats will be lost or altered, is alternative habitat available to support associated species populations?\nAre there opportunities to consolidate or connect habitats?\nTake an ecosystem approach and involve relevant stakeholders (including local communities). Consider the full range of factors affecting biodiversity. These include direct drivers of change associated with a\nproposal (e.g., land conversion and vegetation removal leading to loss of habitat-a key driver of biodiversity loss, emissions, disturbance, introduction of alien and genetically modified species, etc.); and indirect\ndrivers of change which are harder to quantify, including demographic, economic, socio-political, cultural and technological processes or interventions.\nEvaluate impacts of alternatives with reference to the baseline situation. Compare against thresholds and objectives for biodiversity. Use NBSAPs, sub-national biodiversity plans and other conservation reports\nfor information and objectives. Take into account cumulative threats and impacts resulting either from repeated impacts of projects of the same or different nature over space and time, and/or from proposed plans,\nprograms or policies.\nBiodiversity is influenced by cultural, social, economic and biophysical factors. Cooperation between different specialists in the IA team is thus essential, as is the integration of findings which have bearing on\nbiodiversity. Provide insight into cause-effect chains. If possible, quantify the changes in quality and amount of biodiversity. Explain the expected consequences of any biodiversity losses associated with the\nproposal, including the costs of replacing biodiversity services if they will be damaged by a proposal. Find out how these relate to relevant biodiversity priorities and objectives or any legal obligations? Indicate the\nlegal issues that create the boundary conditions for decision making.\nMitigation\nRemedial action can take several forms, i.e., avoidance (or prevention), mitigation (including restoration and rehabilitation of sites), and compensation. Apply the \"positive planning approach,\" where avoidance\nhas priority and compensation is used as a last resort measure. Avoid \"excuse\"-type compensation. Look for opportunities to positively enhance biodiversity. Acknowledge that compensation will not always be\npossible; there will still be cases where it is appropriate to say \"no\" to development proposals on grounds of irreversible damage to biodiversity.\nReview for decision-making\nPeer review of environmental reports with regard to biodiversity should be undertaken by a specialist with appropriate expertise, where biodiversity impacts are significant. Depending on the level of confidentiality\nof public decision-making, consideration should be given to the involvement of affected groups and civil society.\nDecision making\nAvoid pitting conservation goals against development goals; balance conservation with sustainable use for economically viable, and socially and ecologically sustainable solutions. For important biodiversity\nissues, apply the precautionary principle where information is insufficient and the no net loss principle in relation to irreversible losses associated with the proposal.\nManagement, monitoring, evaluation and auditing\nIt is important to recognize that all prediction of biodiversity response to perturbation is uncertain, especially over long time frames. Management systems and programs, including clear management targets (or\nLimits of Acceptable Change (LC)) and appropriate monitoring, should be set in place to ensure that mitigation is effectively implemented, unforeseen negative effects are detected and addressed, and any\nnegative trends are detected. Provision is made for regular auditing of impacts on biodiversity. Provision should be made for emergency response measures and/or contingency plans where upset or accident\nconditions could threaten biodiversity.\nNature Tourism\nIn industrial countries, mass tourism and recreation are now fast overtaking the extractive industries as the largest threat to indigenous\ncommunities, and 'pristine' environments. These are destinations that tourists now want to visit. Attractive landscape sites, such as sandy\nbeaches, lakes, riversides, and mountaintops and slopes, are often transitional zones, characterized by species-rich ecosystems. Typical physical\nimpacts include the degradation of such ecosystems. The ecosystems most threatened with degradation are ecologically fragile areas such as\nalpine regions, rain forests, wetlands, mangroves, coral reefs and sea grass beds. The threats to, and pressures on, these ecosystems are often\nsevere because such places are very attractive to both tourists and developers. Since 1945, visits to the 10 most popular mountainous national\nparks in the United States have increased twelvefold. In the European Alps, tourism now exceeds 100 million visitor-days. Every year in the\nIndian Himalaya, more than 250,000 Hindu pilgrims, 25,000 trekkers, and 75 mountaineering expeditions climb to the sacred source of the\nGanges River, the Gangotri Glacier. They deplete local forests for firewood, trample riparian vegetation, and strew litter. Even worse, this tourism\nfrequently induces poorly planned, land-intensive development.\nNegative impacts from tourism occur when the level of visitor use is greater than the environment's ability to cope with this use within the\nacceptable limits of change. Uncontrolled conventional tourism poses potential threats to many natural areas around the world. It can put\nenormous pressure on an area and lead to impacts such as soil erosion, increased pollution, discharges into the sea, natural habitat loss,\nincreased pressure on endangered species and heightened vulnerability to forest fires. It often forces local populations to compete for the use of other critical resources. Tourism development can put pressure on\nnatural resources when it increases consumption in areas where resources are already scarce. Water, and especially fresh water, is one of the most critical natural resources. Tourism can also create great\npressure on other local resources like energy, food, and other raw materials that may already be in short supply. Greater extraction and transport of these resources exacerbates the physical impacts associated\nwith their exploitation. Because of the seasonal character of the industry, many destinations have ten times more inhabitants in the high season as in the low season. A high demand is placed upon these\nresources to meet the high expectations tourists often have (proper heating, hot water, etc.). Important land resources include minerals, fossil fuels, fertile soil, forests, wetland and wildlife. Increased construction\nof facilities for tourism and recreational has increased the pressure on these resources and on scenic landscapes. Direct impact on natural resources, both renewable and non-renewable, in the provision of tourist\nfacilities can be caused by the use of land for accommodation and other infrastructure provision, and the use of building materials.\nTourism can cause the same forms of pollution as any other industry: air emissions, noise, solid waste and littering, releases of sewage, oil and chemicals, even architectural/visual pollution. Transport by air, road,\nand rail is continuously increasing in response to the rising number of tourists and their greater mobility. To give an indication, the number of international air passengers worldwide rose from 88 million in 1972 to\n344 million in 1994. One consequence of this continuing increase in air transport is that tourism now accounts for more than 60% of air travel and is therefore responsible for an important share of air emissions.\nOne study estimated that a single transatlantic return flight emits almost half the CO2 emissions produced by all other sources (lighting, heating, car use, etc.) consumed by an average person yearly. Transport\nemissions and emissions from energy production and use are linked to acid rain, global warming and photochemical pollution. Air pollution from tourist transportation has impacts on the global level, especially\nfrom carbon dioxide emissions related to transportation energy use. And it can contribute to severe local air pollution. Some of these impacts are quite specific to tourist activities. For example, especially in very\nhot or cold countries, tour buses often leave their motors running for hours while the tourists go out for an excursion because they want to return to a comfortably air-conditioned bus.\nIn areas with high concentrations of tourist activities and appealing natural attractions, waste disposal is a serious problem and improper disposal can be a major despoiler of the natural environment - rivers,\nscenic areas, and roadsides. For example, cruise ships in the Caribbean are estimated to produce more than 70,000 tons of waste each year. Today some cruise lines are actively working to reduce waste-related\nimpacts. Solid waste and littering can degrade the physical appearance of the water and shoreline and cause the death of marine animals.\nConstruction of hotels, recreation and other facilities often leads to increased sewage pollution. Wastewater has polluted seas and lakes surrounding tourist attractions, damaging the flora and fauna. Sewage\nrunoff causes serious damage to coral reefs because it stimulates the growth of algae, which cover the filter-feeding corals, hindering their ability to survive. Changes in salinity and siltation can have wide-ranging\nimpacts on coastal environments. And sewage pollution can threaten the health of humans and animals.\nOften tourism fails to integrate its structures with the natural features and indigenous architectural of the destination. Large, dominating resorts of disparate design can look out of place in any natural environment\nand may clash with the indigenous structural design. A lack of land-use planning and building regulations in many destinations has facilitated sprawling developments along coastlines, valleys and scenic routes.\nThe sprawl includes tourism facilities themselves and supporting infrastructure such as roads, employee housing, parking, service areas, and waste disposal.\nTourists using the same off-road trail over and over again trample the vegetation and soil, eventually causing damage that can lead to loss of biodiversity. Such damage can be even more extensive when visitors\nfrequently stray off established trails. Wildlife viewing can bring about stress for the animals and alter their natural behavior when tourists come too close. Safaris and wildlife watching activities have a degrading\neffect on habitat as they often are accompanied by the noise and commotion created by tourists as they chase wild animals in their trucks and aircraft. This puts high pressure on animal habits and behaviors and\ntends to bring about behavioral changes. In some cases, as in Kenya, it has led to animals becoming so disturbed that at times they neglect their young or fail to mate.\nAfter decades of sustained growth in volume and visibility, tourism is now one of the leading global industries (11% of global GDP) and one of the major migratory movements in modern society (about 700 million\ninternational travelers in 2001), producing significant impacts on resource consumption, pollution, and social systems. It can be compared in its deleterious impacts and environmental risks to any other major\nindustry. On the other hand, tourism is a unique tool for awareness building and learning for guests and hosts alike. Sound natural and cultural environments are its basic assets, while peace is one of its basic\nrequirements.\nFortunately there is an encouraging 'greening' of mainstream tourism. Greater sustainability in the industry as a whole will have the largest impact on overall wildlife protection, and on communities and individuals.\nBut 'nature-based tourism' will play a crucial role in the communities and natural environments under the greatest pressure from the development of tourism.\nNature Tourism, often referred to as Ecotourism, was introduced to the tourist industry in the early 1980s. Nature tourism attracts tourists with an interest in temporarily living in, and coming to better understand a\nspecific, novel, relatively natural ecosystem. Its primary focus is on experiencing natural areas that fosters environmental and cultural understanding, appreciation and conservation. Nature tourism was initially\nconnected with outdoor travel to remote, unique, and/or scenic areas. Although in its early stages there was a strong educational aspect, this was not a crucial or required element to the industry or the consumer.\nHowever, as the demand has increased, the inclusion of ecology as an integral educational element has become increasingly important. This is why nature tourism is an important topic in applied ecology.\nSince its conception, nature tourism has grown to include an entire methodology of planning, conservation management, and economics. It is becoming a robust and encompassing process that not only includes\nsite information, but also considers the sustainability of the ecosystem, conservation management, education, equitable social benefits, and community responsibility. Nature Tourism now includes several major\nprinciples:\nEducation about the area\nSustainable use of resources, and avoidance of degradation\nEnhancement of local community and assistance in development\nRespect for cultural/social/political aspects of local people\nProfit from the tourism industry providing a boost to the local economy\nNature-based tourism attracts people interested in visiting natural areas for the purpose of enjoying the scenery, including plant and animal wildlife. Examples of on-site activities include hunting, fishing,\nphotography, bird watching, and visiting parks and studying information about the ecosystem. An example is visiting, photographing, and learning about organgatuangs in Borneo. The returns to an individual from\nthe experience have been described as potentially life-changing or at least memorable, and the development of new skills and knowledge. Since the mid-1990's nature tourism has emerged as a human activity\ndistinct from adventure travel. Packages tend to be marketed as a more politically correct, environmentally and culturally aware\" form of tourism, e.g., responsible travel to natural areas that conserve the\nenvironment and improve the well-being of local people. In this sense nature tourism is being increasingly recognized as a tool for sustainable development. Achieving this aim is a challenge, because high\nstandards have to be met. But when it is achieved, communities and natural environments are the immediate beneficiaries.\nHowever, despite their \"green image\", few nature tourism packages contribute a positive benefit to the global environment. A major contradiction comes from considering the environmental impact of the energy\nconsumed in transportation to the exotic location. One study estimated that a single transatlantic return flight emits almost half the CO2 emissions produced by all other sources (lighting, heating, car use, etc.)\nconsumed by an average person yearly. Arrival also introduces its own set of problems. As in any tourist activity, adverse impacts are ever present, such as cultural erosion and atmospheric pollution, and the\ndrain on local natural resources to provide Western living standards as enclaves in Third World countries. Problems of sustainability are also evident in the developed countries. For example, in winter 2000,\n76,271 people entered Yellowstone National Park on snowmobiles, outnumbering the 40,727 visitors who came in cars, 10,779 in snowcoaches and 512 on skis. A survey of snowmobile impacts on natural\nsounds at Yellowstone found that snowmobile noise could be heard 70% of the time at 11 of 13 sample sites, and 90% of the time at 8 sites. At the Old Faithful geyser, snowmobiles could be heard 100% of the\ntime during the daytime period studied. Snowmobile noise drowned out even the sound of the geyser erupting. In Yosemite National Park, the number of roads and facilities have been increased to keep pace with\nthe growing visitor numbers and to supply amenities, infrastructure and parking lots for tourists. These actions have caused habitat loss in the park and are accompanied by various forms of pollution including air\npollution from automobile emissions; the Sierra Club has reported \"smog so thick that Yosemite Valley could not be seen from airplanes\". This occasional smog is harmful to all species and vegetation inside the\nPark. Such issues are being addressed by planning and managing destinations, setting up institutional partnerships and the continued development of environmentally friendly technology.\nThe concept of ecotourism has come into common use in the last decade. It describes a goal towards which tourism entrepreneurs, government agencies, non-governmental organizations (NGOs) and\ncommunities have been aiming at for much longer. A definition put forward by The Ecotourism Society in 1991 describes it as 'responsible travel to natural areas that conserves the environment and sustains the\nwell-being of local people.' Professionals working within the field of ecotourism generally agree that 'ecotourism' stands out within the area of nature tourism by:\nTravel to a natural area.\nTravel that supports the conservation of biodiversity.\nTravel that brings benefits to local host communities.\nTravel that leads to greater understanding of the natural or cultural environment visited.\nIncluding these four components in a travel package significantly restricts the number of tourism products that can genuinely be labelled ecotourism. To some people, ecotourism is regarded as one niche market\nwithin the larger, and rapidly expanding market of nature tourism. Here it has been estimated that nature-based tourism now comprises 20 per cent of the world travel market, and ecotourism 7 per cent. A\npackage labelled ecotourism has some inbuilt constraints; the main one being that participants are responsible and benefit conservation efforts and local communities, and the visitor has participated in some\nlearning experience. One example might be camping at a national park, paying an entry fee, following park rules of conduct, buying supplies at a gateway community outside the park, and participating in a natural\nhistory lesson. However, these kinds of constraints are what all kinds of nature tourism are aiming for. In this respect, it is perhaps better to retain the term nature tourism as an umbrella for all packages that\ninvolve the softer interaction of people with habitats and species as a primary objective of the holiday.\nNature tourism requires interactions and partnerships with conservation NGOs, government tourism and resource management agencies, community groups and the private sector. Above all it requires the\nmanagement of the many impacts of massed humans introduced into species rich ecosystems. Even better would be the integration of nature tourism into international strategies for sustainable development. In\nthis context, the United Nations Environment Programme (UNEP) has been appointed by the Commission on Sustainable Development (CSD) as the Interagency Coordinator or lead agency responsible for\nimplementation of Agenda 21 issues on tourism. Together with the World Tourism Organization (WTO/OMT), UNEP is the main focal point on sustainable tourism for CSD and the Convention on Biological\nDiversity for devising global strategies for tourism can contribute to environmental conservation\nThe Endangered Resources\nIn the second half of the 20th century the pace of growth of the world population and its technological capacity to utilise natural resources\nincreased to such a degree that human activity now impinges on all segments of the biosphere. As the scale of habitat destruction has multiplied\nso have human efforts for the remainder to be vigilantly protected by applying ecological principles to safeguard, legislate, evaluate and manage\nfragile ecosystems and their declining species.\nConservation on a global scale may be approached either through organisations that focus on its rare and endangered species or through the\nwork of others that highlight the world's 'fragile' habitats. The international bodies that illustrate these two complementary approaches are the\nWorld Conservation Union and UNESCO's Man and the Biosphere programme.\nThe World Conservation Union (http://www.iucn.org/) began as the International Union for the Protection of Nature (or IUPN) founded in October\n1948 following an international conference in Fontainebleau, France. The organization changed its name to the International Union for\nConservation of Nature and Natural Resources in 1956 and became the \"World Conservation Union\" began in 1990. The full name and the\nacronym are often used together as many people still know the Union as IUCN\nThe theme of 'man and the biosphere' became an international concern in 1972 with the launch of UNESCO's programme of environmental\nresearch. It is an interdisciplinary undertaking of environmental research initiated to develop the basis, within the natural and social sciences, for\nthe rational use and conservation of the resources of the biosphere, and for the improvement of the global relationship between people and the\nenvironment. The hallmark of the MAB Programme is its holistic and interdisciplinary approach. Examination of human impacts on a specific\necosystem - that is, the interrelationship between people and the environment - requires studies of both the natural sciences (e.g. climatology,\nbiology, soil sciences and forestry) and the social sciences (e.g. economics, human geography and sociology). Hence, the name of the\nprogramme: \"Man and the Biosphere\" or 'MAB'(http://www.unesco.org/mab/).\nThe World Conservation Union is probably best known for monitoring the state of the world's species through the IUCN Red List of Threatened\nSpecies. But it also supports and develops conservation science; implements this research in field projects around the world; and then links both\nresearch and results to local, national, regional and global policy by convening dialogues between governments, civil society and the private\nsector.\nThe priority of the Union's current Programme (2005–2008) is to build recognition of the many ways in which human lives and livelihoods,\nespecially of the poor, depend on the sustainable management of natural resources. In its projects, the Union applies sound ecosystem\nmanagement to conserve biodiversity and builds sustainable livelihoods for those directly dependent on natural resources. The Union is actively\nengaged in managing and restoring ecosystems and improving people's lives, economies and societies.\nThe Union's databases, assessments, guidelines and case studies, prepared by its global membership, Commissions and Secretariat, are among\nthe world's most respected and frequently cited sources of information and reference on the environment.\nAs the world's largest environmental knowledge network, the Union has helped over 75 countries to prepare and implement national conservation\nand biodiversity strategies. The Union also has the official status of Observer at the United Nations General Assembly.\nUNESCOs MAB programme uses an applied ecological approach that focuses on mountain ecosystems, on arid lands or on humid tropical\nforests. Shortly after the programme was launched in April 1973, a panel of experts met in Salzburg, Austria, to discuss the \"Impact of human\nactivities on mountain and tundra ecosystems\". Its task was to elaborate the scientific content of projects to be proposed under the MAB\nProgramme. The panel recommended study of the following factors:\nhuman settlements at high altitudes;\neffects of land-use alternatives on mountain ecosystems;\nimpact of large-scale technology on mountain ecosystems;\neffects of tourism and recreation on mountain ecosystems.\nA working group assembled in Lillehammer, Norway, later in 1973 to define further the scope, objectives, methodologies and possible outputs of studies in areas where problems were acknowledged. This meeting\nled to a more clearly defined identification of thematic and regional problems requiring study, as follows:\nresource development and human settlements in high tropical mountains (i.e. above 2 500 us and between the latitudes 30° north and 30° south), including the tropical Andes, the South Asia mountain\ncomplexes and the East African and Ethiopian highlands;\ntourism, technology and land use in temperate mountains in the middle latitudes (approximately latitudes 30° to 60° north and south), where there are distinct winter and summer seasons;\nland-use problems in high-latitude mountain and tundra ecosystems, with special reference to grazing, industrial development and recreation.\nIn order that study methods and results could be compared, the working group in Lillehammer identified tentative \"minimal\" research requirements for both natural sciences (e.g. climatology and soil sciences) and\nsocial sciences (e.g. sociology and economics). It was considered vital that the results of regional mountain studies in one area could be compared with those elsewhere in an international context.\nThe variables identified for study in mountain areas may appear obvious and simplistic - air temperature, precipitation and wind velocity, for example, in climatic studies. Nevertheless, considerable efforts were\nmade to achieve international agreement on a uniform and consistent methodology for research on mountain ecosystems within the framework of an intergovernmental scientific programme. Conceptually, the\nestablishment of this catalogue of minimal research requirements was an important step forward in international cooperative research. As a consequence, a large number of case studies were carried out\nworldwide within the framework of the MAB Programme, in particular in the Andes and the Alps.\nIn the early 1990s, the MAB Programme entered into a new phase following the decision of its governing body, the MAB International Co-ordinating Council. The three new major thrusts are: scientific capacity\nbuilding, research on biological diversity and ecological processes, and promoting the World Network of Biosphere Reserves. The third undertaking proved to be particularly successful and there are currently 352\nbiosphere reserves in 87 countries; of these, over 40 percent are located in mountain regions.\nBiosphere reserves are areas of terrestrial and coastal/marine ecosystems where, through appropriate zoning patterns and land management, the conservation of ecosystems and their biodiversity is combined\nwith the sustainable use of natural resources for the benefit of local communities. Thus, they represent a major tool for implementing the concerns of Agenda 21 (such as Chapter 13 on mountains), the\nConvention on Biological Diversity and other international agreements.\nThe concept of \"biosphere reserve\" implies environmental conservation, scientific research and sustainable development. The management of biosphere reserves aims to show that environmental conservation\ncan be used to promote sustainable development based on scientific research findings together with a partnership with the local people. This is realized through a specific land-use system, which takes into\naccount the topographic, biological, economic and socio-cultural characteristics of each site.\nBiosphere reserves have three different, but interrelated, functions:\nConservation\nBiosphere reserves provide protection of indigenous genetic resources, plant and animal species, ecosystems and landscapes of value for the conservation of the world's biological diversity.\nDevelopment\nBiosphere reserves seek to combine conservation concerns with sustainable use of resources through close cooperation with local communities, taking advantage of traditional knowledge, indigenous\nproducts and appropriate land management.\nNetworking\nBiosphere reserves are linked through a global network; they provide facilities for research, monitoring, education and training at the local level as well as for comparative research and monitoring\nprogrammes at an international or regional level.\nWhile the relative importance of these three basic functions will vary from case to case, it is a combination of their roles that characterizes the distinctive feature of biosphere reserves. The articulation of these\nroles is translated on the ground through a pattern of zonation. This includes a core area (or areas) that is strictly protected according to pre-established conservation objectives. The core area is surrounded by, or\ncontiguous with, a delineated buffer zone (or zones) where only activities that are compatible with the conservation objectives can take place. Finally, a more loosely defined transition area encircles the core and\nbuffer areas and here cooperation with the local population and sustainable resource management practices are developed.\nAt the heart of the international community's interactions with the global environment, particularly through actions mandated by two World Environment Summits, is the United Nationals Environment Programme\n(UNEP (http://www.unep.org/)) Biodiversity information for policy and action to conserve the living world is provided by UNEP's World Conservation Monitoring Centre in Cambridge. Its programmes concentrate\non species, forests, protected areas, marine, mountains and freshwaters; plus habitats affected by climate change such as Polar Regions. It also address the relationship between trade and the environment and\nthe wider aspects of biodiversity assessment.(http://www.unep-wcmc.org/)\nBetween them, MAB the WCU and the WCMC, are well placed to provide answers to questions about the state of major international habitats and rare species.\nObjective\nThis module is intended to describe some of the protected sites and species of major international importance with respect to the following three questions about their state as an endangered resource:\nWhat is happening?\nWhat is being done?\nWhat should be done?\nNew Societies and Cultures\nHolistic economics\nThe economic history of the world is the entire history of the world, but seen from a certain vantage point; that of the economy. The ecological history of the world is the history of the world seen from an\nenvironmental viewpoint. Increasingly, this environmental viewpoint takes in the place of Homo sapiens in the entire cosmos. To choose one or other vantage point, and no other, is of course to favour from the\nstart a one-sided form of explanation. However, economists and historians have stopped thinking of economics as a self-contained discipline and of economic history as a neatly defined body of knowledge, which\none could study in isolation from other subjects. Economists cannot properly grasp economic phenomena unless they go beyond the economy. With regard to political economy, which in the 19th century\nappeared to concern only material goods, it has turned out to embrace the social system as a whole, being related to everything in society. The same can be said of biologists with respect to ecology, with its\nhistory of evolution, which is no longer regarded as primarily science, but as a philosophy of inter-relatedness.\nPolitical culture is an important variable in the analysis of the relationships between culture and ecology as it suggests underlying beliefs, values and opinions, which a group of people holds dear (such as shared\nethnic and religious affinities). For example, Catholicism treats the individual as social and transcendent.\nEconomics and ecology come together at their common linguistic root, ‘oikos’, which in both cases signifies a space where a complex of activities is undertaken concerned with the consumption of natural\nresources and their transformation for production and distribution.\nManagement\nSolidarity in human societies resides in the organisations established to manage the utilisation of natural resources. Management, as a specific pattern of human activities, emerges in the archaic use of the word\neconomy to define the ordering of household affairs; (via Latin from Greek oikonomia; domestic management, from oikos house + -nomia, from nemein to manage). Managerial behaviour, involves the setting of\ntargets and the marshalling of inputs necessary to overcome limiting environmental factors. It is central to activities that turn environmental resources into food, goods and services. Ecology comes from the same\netymological root. As a human scientific endeavour it has prompted new institutions and organisations in society by which ecological thinking can be directed to manage ecosystems as human goods. In this\nrespect, applied ecology is a powerful feedback from science to force cultural changes in the use of habitats and species.\nTension within society comes, on the one hand, from the managerial applications of science for the commodification and industrialisation of nature, and on the other, to the applications of ecology for the\npreservation of intrinsic value in the living world. These two rival views of the relationship between humans and nature define the area of cultural ecology.\nFrom all of these viewpoints, applied ecology is influencing the formation of new social organisations and their cultural expressions through managerialism as global and local strategies and site operations. Some\nof these changes in society and culture come about because of direct applications of science. However, other movements, such as 'deep ecology', with their promotion of intrinsic value in ecological order, do not\ncome directly out of the science of ecology, but are suggested, inspired and fortified, by ecological ideas. In native cultures their ideological aspects comprised beliefs, rituals, magical practices, art, ethics, religion\nand myths. These defined the permissible and acceptable relationships with nature, and they were part of local systems for conserving resources. In industrialised societies this role has been taken over by the\ncultural package of 'nature conservation', which includes the philosophies and legal systems of society directed at supporting order in habitats and their species. This is the web of perception and action that locks\nindividuals together in geographical space as societies. It is focused on balancing the exploitation of environmental resources for production with the conservation of resources to ensure survival of the community.\nThis balancing act involves technological, sociological and ideological management systems.\nThe technological aspect of management is concerned with tools, materials and machines. The sociological aspect involves the relationships into which people enter especially in work and in the family. These two\naspects encompass topics that deal respectively with the exploitation of resources through production and demand. Changes in technology and social organisation will bring forth changes in the ideas and beliefs\nthat connect people with local and planetary resources, and also define humans in the wider cosmos, but such ideas will always feed back on the social organisation, which moves forward.\nThe ideological aspects of the conservation of resources are expressed\nthrough ideas about 'nature' and 'place', as these have developed historically to provide philosophical, artistic and spiritual values for present day environmentalism;\nthrough science, as applied ecology;\nand through ‘living in nature’ and applying traditional ecological knowledge to realise global and local strategies of resource management.\nAll these aspects define the two major routes of Western reasoning about nature. On the one hand, since the 18th century, there has been a ready acceptance of the scientific drive for the domination of nature.\nOn the other hand, the environmental outcomes of this mode of activity has precipitated the ecological search for intrinsic value and its preservation. These two rival views of the relationship between humans and\nnature define a fluid mind-map to steer a global society toward sustainability. The rivalry comes from fragmentation of civil society in the pursuit of profit and status. Only as conscious agents of a cultural\nrevolution, which promotes a balanced synthesis of the exploitative and conserving segments of society, can we harness our species' ecological potential for a sustainable future.\nThe twentieth century opened with a revolution in humankind’s attitude to the environment. It sprang spontaneously from all branches of culture and from all countries across a Europe. The discoveries of Einstein\nin outer space corresponded with those of Jung into the inner space of the subconscious. Biology began to shape the modern perspective of our place in nature. The arts themselves exploded into a new\nenvironmental dimension. No longer was the inquiring mind satisfied with appearance. Scientists and artists began to define the relationship between people and environment that was more comprehensive than\nthe search for natural resources. Thus artists, such as Paul Klee and Jean Miro, set out to combine the invisible with the visible, the abstract with the figurative. They let themselves be invaded by the living world\nand then processed it in a very subjective manner.\nThe cosmic adventure\nThere are profound connections between stars, atoms and life that place human culture in the grand outline of the development of the universe. This perspective has been called the 'cosmic adventure'.\nThe adventure began in a hot and undifferentiated broth of radiation. Eventually, on our tiny planet in a remote corner of a small galaxy, there developed the incredible complexity of life, consciousness and\nculture. We now appreciate that the universe has moved toward increasingly more intense forms of ordered novelty. In this respect, we can say that it does have a direction, particularly here on Earth, where there\nis significantly more ordered variety than there was three minutes after the big bang. We have arrived throughout the fifteen billion years of cosmic development as part of a process that has kept a balance\nbetween pairs of primeval qualities. These qualities are:\nharmony and contrast;\norder and unpredictability;\nunity and complexity;\npattern and nuance;\nhomogeneity and diversity;\nstability and novelty.\nThe existence of the universe and everything in it depends on the internal ordering, or tuning of its components. As far as we can see, it was six numbers imprinted in the 'big bang' that have maintained the\ntrajectory of cosmic ecology as a balance of qualities. Two of the numbers relate to the basic forces; two fix the size and the overall texture of the universe and determine whether it will continue forever, and two\nmore fix the properties of space itself. If any one of these numbers was slightly different at the start there would be no stars and no life. Our universe is a rarity with the right combination of the key numbers to\nensure that it survives and has developed as an intricately structured whole. Terrestrial evolution is the story of one such molecular outcome, as are the political and technological endeavours of nations of the\nearth are the social outcomes.\nPhysics and chemistry existed before human evolution and in this sense they define the non-human purpose of the cosmos as a physico-chemical process. Therefore, in thinking about cosmic purpose we must\nseparate ourselves from the modern bias that nature is a value- neutral canvas. It does not remain blank until we have painted it with our cultural and political inventions. The core of human distinctiveness is that\nwe are capable of thinking about the internal ordering of the universe and our planetary systems so as to understand how these qualities are expressed. We are also able to add value to them.\nThis attitude has an important bearing on the way we view our social and biological heritage in their cosmic, ecological and social dimensions. There are currently two views about the direction of cosmic\ndevelopment and our place in it. After the universe was energised from the void, the ordering of novelty followed the sequence of energy, particles, stars, planets, materials and life forms. Process theology takes\nthe view that a programme of development according to divine will governed the direction. Process humanism takes the view that our universe is just one of an infinity of universes bubbling up at random from the\nvoid. Most would be untuned.\nProcess theology says that the self-creativity of all constituents of the cosmos willed by God deserve our care because they are especially intense actualisations of divinely inspired creativity and cosmic beauty.\nWhen nature suffers, God suffers.\nProcess humanism says that to gain an appropriate sense of our human worth we need to become aware of our creative potential to work towards global order. Therefore, intervention to maintain a balance of\nqualities that define our biological and social heritage, by ordering novelty and unifying complexity, is actually a small part of the grand cosmic purpose.\nBoth points of view provide us with a knowledge framework for applying ecological thinking to culture that is deeply rooted in cosmology. Also, they recapture the ancient spiritual sense that we live in a meaningful\nand intrinsically valuable world and do so in a manner entirely consonant with contemporary science. Humanity's origins and practical capabilities require it to participate in sustaining the cosmic process as a\nbalance of qualities that define our place in nature as much as our attitudes to the use of nature expressed in technology, art, architecture and literature. In particular, this vision involves recognising that\nconservation of biodiversity is not just for humans or valueless apart from them.\nSocial applications of ecology\nEcology deals with the interactions between species and the necessary conditions of existence in the environment to which they are adapted. These adaptations comprise webs of perception and action evolved\nto ensure resources are available to maintain growth and reproduction. Behavioural interactions are at the heart of the interactions where they function to unite individuals into more or less stable social structures.\nIn particular, behaviour determines and regulates the relations of individuals to one another. It provides such external adaptations to the physical environment, and such internal adaptations between the\ncomponent individuals or groups to make possible an ordered social life. Each species has a behaviour structure that is an evolved harmonious whole in order to maintain the sum of its parts in biochemical\nequilibrium with its environment. This structure survives and flourishes because it successfully maintains external social solidarity among its members, and chemical integrity amongst its internal organs and cells.\n'Ecology' is used to define a particular type or branch of the relationship between living organisms and their environment e.g. aquatic ecology; avian ecology. Where the species is a community of Homo sapiens,\nsharing a common heritage of ideas, beliefs values and knowledge, the interrelationship is called cultural ecology. It includes an environmental complex of human activities undertaken for profit. The activities are\nconcerned with the production, distribution, and consumption of goods and services and the management of natural resources (land, forest, water), finances, income, and expenditure of a community, business\nenterprise, etc. This highlights the fact that the subject matter of both ecology and economics, which are themselves interrelated, cannot be isolated from all the other social, ideological and political problems.\nEvidence for this are the categories of ‘political ecology’ and ‘social ecology’, which have emerged from the social sciences, to highlight the relationships between political and social organisations and\nenvironmental issues.\nApplied ecology, being an instrumental mode of systems thinking, has a role to play, as behavioural structures in stabilising the humankind-nature relationship. It is central to an educational system for\nsustainability, which presents exploitative management and conservation management as two sides of the coin of economic development. Applied ecology provides the operational tools for environmental\norganisations and institutions interacting within a society, and constituting it. It thereby contributes to group solidarity for planetary survival by providing practical solutions to the challenges of the industrialised\nenvironment. A full understanding requires placing applied ecology in the context of systems thinking about the organisation of natural resources and people for production. It is about providing tools for modifying\nhuman production by people who are organising for nature conservation. Ecology drives national, and global strategies by which these groups respond to ethical values in nature.\nCultural ecology\nCulture first emerges within the ecosystems of primates where it is expressed in the learned group behaviours of food- gathering and display, which are local to a species in a certain place. In humans, culture\nappeared as the integrated system of learned behaviour patterns characteristic of members of a society. The system of behaviour constitutes a way of life of any given social group. It is also a social heritage,\ntransmitted from generation to generation by individuals and organisations. This heritage is instilled into the minds of the young, not only by initiation and education, but also by the long, unconscious conditioning\nwhereby each individual becomes the person he/she ultimately is. It thus becomes a form of social heredity. As an evolved harmonious whole it ensures that all the institutions interacting within a society, and\nconstituting it, contribute to group solidarity.\nNew relationships are being forged between culture and ecology in response to social concerns that arise because of the present state of the earth household. One of these responses is the concept of\n‘sustainability’, which is not a scientific term, but more a focus of social problems arising from the large-scale use of natural resources. These issues can only be solved by new social organisations, local and\nglobal, established to manage industrial production within the limitations of Earth’s ecological infrastructure. There also has to be a new holistic cross-disciplinary social model, where knowledge about human\nsocial evolution is categorised to connect the social sciences with disciplines such as law, history, geography, education, and biology. A start in this direction was made by Ramchandra Guha (1994) who argues in\nfavour of creating an ‘environmentally orientated sociology’ for a world in environmental crisis by placing ecological infrastructure at the base of the traditional pyramidal model of society.\nIn such a pyramid, consisting of ‘nature’, ‘society’ and ‘culture, the two functional pillars of social organisation are the organisation of people for production (political economy) and the organisation of natural\nresources for production (natural economy). Both of these economies draw upon what may be called the planetary economy. This model of cultural ecology is provisionally set out in Fig 11.1. Geographers and\nanthropologists mean different (but complementary) things by \"cultural ecology.\" In general, \"cultural ecology\" studies the relationship between a given society and its natural environment. But geographers\ngenerally mean the study of how socially organized human activities affect the natural environment; anthropologists generally mean the study of how the natural environment affects socially organized behaviours\n(although, at its extreme, environmental determinism has fallen out of favour among most anthropologists).\nFig 11.1 Provisional model of cultural ecology\nSocial organisation\nWherever we find a community, however primitive, however complex, we find more than an association of individuals, each pursuing a personal own life and possessing personal ideas; we find a social pattern, a\ncoherent body of customs and ideas, an integrated unity or system in which each element has a definite function in relation to the whole environment, physical, biological and social.\nBut what determines the pattern? The anthropological explanation is 'the necessary conditions of existence of the social organism'. To this the social institutions must correspond. In turn, the necessary conditions\nof existence, at any stage of social development, depend on the geographical situation and the level of technology. This is true from the Stone Age to the present age of industrialism. Basic to every form of social\norganization is the method of obtaining those items essential for human survival. In other words, how do the people of a particular society exploit natural resources to produce their food, clothing, tools, and other\nitems that they need in order to live as human beings?\nThese 'necessary conditions of existence' shape the relationship of people to each other and their command of natural resources. Individuals utilize nature, directly or indirectly, to produce the necessities of life,\nnot in isolation from each other, not as separate individuals, but in common groups and societies with shared, or conflicting, cultural norms.\nPolitical ecology\nPolitical ecology is an umbrella term for a variety of projects that involve politics and the natural environment. ese projects generally fall within one of three types:\nattempts to study politics using the language and methods of ecology (in other words, the claim that, like species of plants and animals, societies and states can only be understood in terms of their place in\na larger system including other societies or states)\nthe study of political struggles for control over natural resources, or of political struggles whose outcome is determined by differential access to natural resources\nresearch on biodiversity and natural resource exploitation that is intended to inform public policy.\nWhen geographers and anthropologists refer to \"political economy,\" they generally mean the study of how different polities (states or societies) in different parts of the world are actually parts of a global structure\nthrough which one polity exploits another polity. This approach to political economy comes out of the works of Immanuel Wallerstein and Andre Gundar Frank, who argues that European development was made\npossible by the underdevelopment or impoverishment of non-European societies.\nGeographical and anthropological political ecologists argue that a cultural ecology informed by political economy will:\nlook at cultures not only in their natural environment, but in their political environment as well\nlook at how unequal relations among societies affect the natural environment\nlook at how unequal relations (especially class relations) within a culture affect the environment\nSocial ecology\nThis section is the first five paragraphs from an open article entitled ‘A Social Ecology’ by John Clark in M. Zimmerman et al., Environmental Philosophy, second edition (Prentice Hall, 1997)\n\"Humanity is Nature achieving self-consciousness.\"—Elisée Reclus\nIn its deepest and most authentic sense, a social ecology is the awakening earth community reflecting on itself, uncovering its history, exploring its present predicament, and contemplating its future. One aspect of\nthis awakening is a process of philosophical reflection. As a philosophical approach, a social ecology investigates the ontological, epistemological, ethical and political dimensions of the relationship between the\nsocial and the ecological, and seeks the practical wisdom that results from such reflection. It seeks to give us, as beings situated in the course of real human and natural history, guidance in facing specific\nchallenges and opportunities. In doing so, it develops an analysis that is both holistic and dialectical, and a social practice that might best be described as an eco-communitarianism.\nThe Social and the Ecological\nA social ecology is first of all, an ecology. There are strong communitarian implications in the very term ecology. Literally, it means the logos, the reflection on or study of, the oikos, or household. Ecology thus calls\nupon us to begin to think of the entire planet as a kind of community of which we are members. It tells us that all of our policies and problems are in a sense \"domestic\" ones. While a social ecology sometimes\nloses its bearings as it focuses on specific social concerns, when it is consistent it always situates those concerns within the context of the earth household, whatever else it may study within that community. The\ndialectical approach of a social ecology requires social ecologists to consider the ecological dimensions of all \"social\" phenomena. There are no \"non-ecological\" social phenomena to consider apart from the\necological ones.\nIn some ways, the term \"social\" in \"social ecology\" is the more problematical one. There is a seeming paradox in the use of the term \"social\" for what is actually a strongly communitarian tradition. Traditionally, the\n\"social\" realm has been counterposed to the \"communal\" one, as in Tönnies' famous distinction between society and community, Gesellschaft and Gemeinschaft. Yet this apparent self-contradiction may be a path\nto a deeper truth. A social ecology is a project of reclaiming the communitarian dimensions of the social, and it is therefore appropriate that it seek to recover the communal linguistic heritage of the very term itself.\n\"Social\" is derived from \"socius,\" or \"companion.\" A \"society\" is thus a relationship between companions—in a sense, it is itself a household within the earth household.\nAn Evolving Theory\nOver the past quarter-century, a broad social and ecological philosophy has emerged under the name \"social ecology.\" While this philosophy has recently been most closely associated with the thought of social\ntheorist Murray Bookchin, it continues a long tradition of ecological communitarian thought going back well into the nineteenth century. The lineage of social ecology is often thought to originate in the mutualistic,\ncommunitarian ideas of the anarchist geographer Kropotkin (1842–1921). One can certainly not deny that despite Kropotkin's positivistic tendencies and his problematical conception of nature, he has an\nimportant relationship to social ecology. His ideas concerning mutual aid, political and economic decentralization, human-scaled production, communitarian values, and the history of democracy have all made\nimportant contributions to the tradition. However, it is rooted much more deeply in the thought of another great anarchist thinker, the French geographer Elisée Reclus (1830–1905). During the latter half of the last\ncentury, and into the beginning of the present one, Reclus developed a far-ranging \"social geography\" that laid the foundations of a social ecology, as it explored the history of the interaction between human\nsociety and the natural world, starting with the emergence of homo sapiens and extending to Reclus' own era of urbanization, technological development, political and economic globalization, and embryonic\ninternational cooperation.\nReclus envisioned humanity achieving a free, communitarian society in harmony with the natural world. His extensive historical studies trace the long record of experiments in cooperation, direct democracy and\nhuman freedom, from the ancient Greek polis, through Icelandic democracy, medieval free cities and independent Swiss cantons, to modern movements for social transformation and human emancipation. At the\nsame time, he depicts the rise and development of the modern centralized state, concentrated capital and authoritarian ideologies. His sweeping historical account includes an extensive critique of both capitalism\nand authoritarian socialism from an egalitarian and anti-authoritarian perspective, and an analysis of the destructive ecological effects of modern technology and industry allied with the power of capital and the\nstate. It is notable that a century ago Reclus' social theory attempted to reconcile a concern for justice in human society with compassionate treatment of other species and respect for the whole of life on earth; a\nphilosophical problem that has only recently remerged in ecophilosophy and environmental ethics.\nHistorical models of communitarianism\nEvery morning, people leave small country towns in cars to go their workplace and are passed by others whose work destination is the place they have just left. In this dynamic transport shuttle everyone is\nsomehow connected with, and supporting, a transport system based on private cars. Science now indicates that this massive carbon economy has dislodged the biosphere from one of its stable states that has\nsupported human evolution for the past two million years. Climatic change has started to unfold and the world is not a unified community with powers to produce a global technological fix. Many are beginning to\nbelieve that in this scenario, sustainable development, with its adherence to annual year on year increases in spending power, is pointing in the wrong direction. Rather, what is needed is a sustainable economic\nretreat. This will require global strategies to adjust the relationship between production systems and natural resources to generate rates of waste emission that the biosphere can assimilate.\nIn contrast, a market town in the 1850s was a small balanced community. It represented the oldest kind of human institution, found absolutely everywhere throughout the world in all kinds of societies. Since the\nlate Palaeolithic more than 100 billion human beings have lived on earth and the majority have spent their entire life as members of very small groups, rarely of more than a few hundred persons. Their production\nsystems were each composed of few people. This picture is the staring point for ideas that there is a basic human need for small communities, which is encoded in our genes. It is in our behavioural makeup that\nwe still orientate towards a group; the small group of the village and the tribe. Rural communities in the British 2001 Population Census are still small, yet market towns with their surrounding villages now lack any\nsense of communal focus or scale of production. Their fragmented residential, commercial and cultural centres emphasise transportation by car so that the inhabitants also lack any sense of pedestrian scale.\nVillage and town are no longer serving as magnets for both people and ideas. People now seem to like isolation. New housing infills are socially sterile. Everything is new clean and neat. Neighbours are usually\nonly glimpsed as they walk to the car. Each house is a small fortress equipped with a barking dog or alarm system. The only visible activity is macho man cutting his lawns. There are obviously great differences\nbetween old and new. Leaving aside the crushing poverty, we can legitimately ask if a pre-industrial community was really a haven of creativity and neighbourly harmony, which could serve as a planning model for\ntoday’s social ills. Have we really lost a unique combination of unity with social, visual and ecological variety? Is there an historical small-town target that modern planners should use for social and ecological\nregeneration? Planners, since their profession emerged in the late 19th century, have thought so. Nineteenth century society was based on ideas of mutual aid, political and economic decentralisation, human-\nscaled production and communitarian ideas (Fig 11.2).\nFig 11.2 A small-town model of communitarianism.\nThese ideas of social ecology, as a recipe for human life, were first articulated at the end of the 19th century for an improved cooperative economy by the Russian geographer Peter Kropokin. The Scottish\nplanner, Patrick Geddes and his pupil Lewis Mumford developed them in Britain. Americans have followed this path since the 1990s to restore the integrity of their basic institutions and turn back disturbing trends\ntoward crime, social disorder, and family breakdown. The past decade has been an era of important social reforms: in the schools, in the criminal justice system, in family policy. In states and localities across the\nU.S.A, citizens have fought for greater emphasis on character, individual responsibility, and virtues and values in the public square. Partly as a result, on a host of \"leading social indicators”, such as rates of\nviolent crime, rates of youth crime, levels of teenage pregnancy, and even student test scores, the nation is showing incremental but significant improvements.\nCommunitarian ideas and policy approaches have been playing a major role in this growing North American movement of cultural and institutional regeneration. Communitarian thinkers are in the forefront of the\n‘Character Education Movement’, which is fostering a return to the teaching of good personal conduct and individual responsibility in thousands of schools around the country. Likewise, communitarians have been\nplaying a role in the new community-based approaches to criminal justice, which are showing solid success in restoring neighbourhood order and achieving real reductions in violent crime. In the area of family\npolicy, communitarians have worked for policies to strengthen families and discourage divorce. They have led in devising fresh, incentive-based policies designed to discourage a casual approach to marriage and\nto promote \"children-first\" thinking and family stability, while at the same time preserving the rights of women and men. The need for action has now reached the large politically influential community of the\nEvangelical Church, where a group of leaders, convinced of the science behind climate change, is trying to persuade its local membership to reduce their domestic carbon emissions. Communitarianism has\nbecome a part of one of the most innovative movements working to renew and revitalize American society.\nYesterday in every town is now a piece of the history of this movement, and everyone who lived through the past twenty-four hours holds some of the public evidence that could be put towards learning about the\npast to better understand the present and shape the future. The history of communities is in the making; it is not a dead thing to be pulled out and praised or deplored; it is the inhabitants who are custodians of the\npast, by the recording of the present. To make history part of the community’s social toolkit there has to be a reorientation of history towards ecology. Social ecology is nothing more than an environmentally\norientated study of a community, which explores a timeline of the relations between ecological infrastructure, politics, community organisations, the economy and culture. The creation of small town models is\ntherefore an important practical aim for the enrichment of cultural ecology as an educational resource.\nSystems thinking\nA system is any group of interdependent or interacting parts. Parts are generally systems themselves and are composed of other parts, just as systems are generally parts or components of other systems.\nSystems thinkers consider that:\na \"system\" is a dynamic and complex whole, interacting as a structured functional unit\ninformation flows between the different elements that compose the system\na system is a community situated within an environment\ninformation flows from and to the surrounding environment via semi-permeable membranes or boundaries\nsystems are often composed of entities seeking equilibrium, but can exhibit oscillating, chaotic, growth or decay behaviours.\nSystems thinking techniques may be used to study any kind of system; natural, scientific, social, or conceptual. It was the biologist Ludwig von Bertalanffy’s concepts of an open system and general systems\ntheory that established systems thinking as a major scientific movement. He set out to replace the mechanistic foundations of science with the following holistic vision:\n“General system theory is a general science of ‘wholeness’ which up till now was considered a vague, hazy, and semi-metaphysical concept. In elaborate form it would be a mathematical discipline in itself purely\nformal but applicable to the various empirical sciences. For sciences concerned with ‘organized wholes’, it would be of similar significance to that which probability theory has for sciences concerned with ‘chance\nevents’ (Berlalanffy, 1968).\nThe advantages of systems thinking are:\nIt helps explain why changing a system frequently leads to counterintuitive system responses. For example feedback loops may operate to either keep the organization in check or unbalance it.\nTraditional decision-making tends to involve linear cause and effect relationships. By taking a systems approach, we can see the whole complex of bidirectional interrelationships. Instead of analysing a\nproblem in terms of an input and an output, for example, we look at the whole system of inputs, processes, outputs, feedback, and controls. This larger picture will typically provide more useful results than\ntraditional methods.\nSystems thinking also helps integrate the temporal dimension of any decision. Instead of looking at discrete \"snapshots\" at points in time, a systems methodology will allow us to see change as a\ncontinuous process.\nSystems thinking aims to gain insights into the whole by understanding the linkages and interactions between the elements that comprise the whole \"system\".\nSystems thinking can help avoid the silo effect, where a lack of organisational communication can cause a change in one area of a system to adversely affect another area of the system.\nThese advantages are particularly valuable in studying the evolution and organisation of ecosystems. In this respect, some of the basic principles of ecology, such as interdependence, recycling, resilience and\ndiversity are concerned with processes organised as open systems. In communities, information and ideas flow through networks of systems with feedback loops, which enable individuals and organisations to\nadapt to changing situations. In this respect, systems thinking, which is behind theories of biological complexity and Earth’s self-sustaining properties, also provides foundations for conservation policies and action\nplans.\nCase Studies\nEducating through case studies\nIt is practically impossible to think about a single habitat that has not been modified by human culture, either by the deliberate dismantling of its food chains or by pollution at a distance. Even landscapes that from\na far vantage point appear to be free of human interference, will probably be found , on closer inspection, to be the product of human activity of one kind or another. However, there is no doubting the power of\nlandscapes as educational entry points to case histories of applied ecology. The study of disease transmission begins with a view of the dense network of duck farms scattered across drained marshes of South\nEast Asia where people, domestic livestock and migratory birds live cheek by jowl; a wetland engineering project catches the eye of the speeding motorist passing by a linear stretch of reedbed devised to clean\nup the motorway runoff; an effort to breed and reintroduce rare species begins with a shot of cattle grazing on former rainforest. The point is that learning about applying ecological principles to repair or redress\nour ecological predicament is best done by studying real outcomes of conservation management in actual units of human occupation, whether they be farms, towns or the ‘nature sites’ we conceptualise from rare\npatches of geology and vegetation. Another important reason for educating through case histories is that environmental projects do not fall neatly into one or other of the nine sections of applied ecology, which\nhave been summarised in the other modules. Case histories will therefore be presented in this module. They will have been chosen because they provide a cross-module perspective according to the practical\nways in which the environment and its resources are utilised in the light of the human dimensions of global change. This means selecting exemplars that illustrate the establishment of new contractual\nrelationships between human society and the environment that will not just be economically and ecologically sustainable, but morally sustainable as well.\nThe areas from which these examples should be drawn were broadly defined in the 1988 Tokyo International Symposium on the Human Dimensions of Global Change Programme as:\nNature conservation:\nTo improve the scientific understanding and increase awareness of the complex dynamics governing human interactions with ecosystems.\nCommunity development:\nTo identify social strategies to prevent or mitigate undersirable impacts of global change or to adapt to changes that are already unavoidable.\nEcological economics:\nTo explore new tools that can provide a replacement for GNP as a measure of human progress.\nIndustry\nTo assess attempts to restructure industries in developed countries in relation to the inevitablity of rapid industrial development elsewhere.\nNature conservation\nThree useful definitions of nature conservation strategies are:\nThe management of human and natural resources to provide maximum benefits over a sustained period of time. In farming, conservation entails matching cropping patterns and the productive potential and\nphysical limitations of agricultural lands to ensure long-term sustainability of profitable production. Conservation practices focus on conserving soil, water, energy, and biological resources. Contour farming,\nno-till farming, and integrated pest management are typical examples of conservation practices aimed at minimising loss of biodiversity whilst maintaining crop production.\nPreserving and renewing natural resources. The use, protection, and improvement of natural resources according to principles that will ensure their highest economic or social benefits.\nThe protection of an area, or particular element within an area, accepting the dynamic nature of the environment and therefore allowing change.\nAt a practical level, the European Union is taking three routes to stop biodiversity decline by 2010. These are:\nto increase the connectivity between nature and nature areas in Europe\nto increase the interest and involvement of people in Europe with nature\nto improve the implementation of European policies for nature, and to link policies to practice, and practice to policies\nConnecting nature\nPopulations of species can only survive if they have large enough habitats and/or enough possibilities to interact with other populations. Due to fragmentation of their habitats as a result of changes in land use,\nmany species in Europe have disappeared or may disappear in the near future. Good landscape connectivity will give species a better chance of survival. Due to the impact of climate change on vegetation and\nhabitats in Europe, species are slowly but surely moving northwards. In order to accommodate for these changing environments, it is necessary that species are able to adapt. Insurmountable barriers may result\nin a further decline of populations. Therefore a fully functional European Ecological Network with proper connections between nature areas is needed in the near future.\nLand use in Europe is changing. Important developments are intensification of agriculture in some parts of Europe, and massive abandonment of agricultural land in other parts. The extension of road and rail\ninfrastructure in vulnerable regions in Europe, urban sprawl and increased tourist infrastructure are other developments impacting on the connectivity of nature.\nBesides the threats posed by climate change and development in land use, there are also various promising opportunities. Taking advantage of these opportunities will not only benefit nature conservation, but\nalso other sectors of society.\nConnecting people and nature\nIn nature conservation the role of people often receives less attention than the intrinsic value of nature and biodiversity. However, nature conservation is per definition a human activity. The support, awareness\nand involvement of the public and stakeholders are vital in order to be able to reach the conservation targets. The decline of nature can only be stopped when the interaction between people involved in nature\nconservation and land use sectors is intensified, and common ground is found.\nCivic opposition to the implementation of Natura 2000, has already resulted in a greater interest by the European Commission and EU member states in communicating this issue. On the Pan-European level, the\nPEBLDS Council (Pan-European Biological Diversity and Landscape Strategy) has adopted a European action plan for public participation and awareness for nature in Europe. At the conference more\nopportunities to increase the interest and involvement of people with nature will be discussed.\nConnecting nature operations with policies\nOrganisations that manage nature areas and National Parks have a lot of experience in connecting practice to nature conservation targets, while involving people. Other organisations have more experience in\ninfluencing policy.\nEurope’s nature would benefit greatly if the site management organisations were more policy orientated and if the policy-influencing organisations were more involved in the implementation of the policies.\nThe conference may create new alliances that assist in linking policies to practice, and practice to policies and stimulate co-operation between these organisations.\nCommunity development\nA community’s complex of economic relations are basic to all social life: notably, the ways in which people interact with the natural world, especially through using natural resources. Society emerges out of the\nnatural world and is sustained by it, yet most people are now alienated from elemental natural relations. The origins of alienation lie in pre-capitalist societies with their monarchical, agrarian and craft hierarchies\nthat gave way to the social divisions and economics of mass production. We now live with its consequences of global consumerism present in every niche of social life. If we go further back in social evolution from\nthe 18th century, human social behaviour is seen as a continuation of the evolution of the rest of nature. The big question of ‘sustainability’ is whether our social nature can adapt to the fact that no other society\ncan ever reach the level of the North American way of life, because our planet will not survive the necessary sevenfold increase in the day to day use of materials and energy by the rest of the world.\nChanges are therefore necessary in a social-ecological future organised for sustainability, at an environmental level, a personal level, and a communal level. Appropriate institutional frameworks and an ethical\nvision are necessary. According to Peter Staudenmaier we must turn our attention to the social structures that might make free nature and a free society more likely. Instead of handing over decision-making\npower to experts, professionals, representatives, or bureaucrats, social ecology he foresees all people participating directly in the self-management of their communal affairs. This has to take place as an historical\nprocess in which communities move smoothly from their past to the present. Local history in this context is a stabilising force for future change. Murry Bookchin expressed it this way:\n“We are thus in a position either to follow a path toward a grim “end of history,” in which a banal succession of vacuous events replaces genuine progress, or to move on to a path toward\nthe true making of history, in which humanity genuinely progresses toward a rational world. We are in a position to choose between an ignominious finale, possibly including the\ncatastrophic nuclear oblivion of history itself, and history’s rational fulfillment in a free, materially abundant society in an aesthetically crafted environment”.\nEcological economics\nSince they are based on tapping the capital of natural resources, human economies are parts of larger natural ecosystems and develop with these systems. In our utilisation nature, ecosystems provide materials\nand energy to maintain relations between human economies and the supply materials and energy for the production of goods and services. The economic process is a circular flow of money between families and\ncompanies. Families spend money on goods produced by companies and companies spend money to buy inputs for production, such as materials, energy, land, labour and capital. These inputs are owned by\nhouseholds, either directly or indirectly because they are vested in the State. This model, which was first used as the basis for economic theory by Adam Smith in the 1770s, concentrates on the total volume of\nthe circular flow generated by demand and supply, which is described as the gross national product (GNP). GNP is the primary focus of the economic policies of nations. It is assumed that when GNP grows,\nhuman wellbeing increases; year on year growth of GNP is what keeps a democratic government in power through increases in jobs, wages and goods. The economic cycle is isolated from the environment\nbecause it is designed to continue regardless of changes in the environment.\nFor two centuries after Smith published his book ‘The Wealth of Nations’ the environment was simply an inexhaustible supply of raw materials and an infinite sink for wastes. In Smith’s model there are no ties\nbetween economics and environment. When sources of inputs are exhausted, others are discovered or new inputs are invented. In the 1970s it suddenly dawned on people that the production of wealth on the\nSmith model can only be sustained when economies are small in relation to the environment available for human growth and settlement. Flows of wastes from human production systems now rival the flows\nthrough some natural systems and many of the impacts are irreversible or are only remedied over a very long time. In this situation, reliance on the GDP as a major tool of economics is an obstacle because it just\nmeasures production for any purpose resulting from any activity. A nation encouraged to maximise GNP may do so by choosing to exhaust its natural resource capital, such as felling all its forests.\nThe simplest way of organising an economics that involves putting the environment into accounting is:\nMeasure the value of services provided by the economy and the environment\nMeasure the specific costs of environmental deterioration due to depletion and pollution\nKeep track of environmental capital such as clean water and ecosystems\nThese measuements would enable the correction of GNP by subtracting from it depletion of natural capital. It would also be possible to balance theextraa benefits of increased consumption against the extra\nenvironmental costs.\nHamburger economics\nIf cattle gain 50 kg per hectare per year, and are slaughtered after eight years, and half the weight is non-meat (skin, bones, etc.), then each cow produces 200 kg, or 1,600 hamburgers.\nIt takes one hectare of cleared tropical moist forest, turned to pasture, to feed that one cow and to produce the 1,600 hamburgers. Because the land is fertile for grazing for only a few years, this is a one-shot\ndeal, and an expensive one. After ten years—a generous estimate of the life of the soil—the return on the land from the hamburgers it produces will have been $3 US per hectare per year.\nThe cumulative effect of this hamburger consumption is equivalent to millions of years of evolution, and to thousands of species.\nConversion of all of Amazonia—4 million square kilometres— to cattle pasture would produce one month of hamburger for the world's population and no more—since the soil would be depleted and the forest\nirreversibly lost.\nAdapted from J. O. Browder: The Social Costs of Rain Forest Destruction: The Hamburger Debate. InterClencia, Caracas, 1988\nIndustry\nIn 2003 the Environmental Policy and Global Change section of the German Political Science Association (DVPW) and its partners organised a conference in Berlin on the Human Dimensions of Global\nEnvironmental Change. It addressed the theme “Governance for Industrial Transformation”. Its three major divisions set out why we need to change the orientation of industry, the causes of the mismatch between\nindustry and its sources of materials and energy and the core challenges for practical solutions. The structure of the conference sets out the strategic questions, which have to be answered by establishing\noperational systems.\nThe Need for Industrial Transformation\nCurrent patterns in the production and consumption of goods, energy and services fail to meet basic requirements of environmental sustainability in both industrialised and developing countries. The use of natural\nresources and the utilisation of the environment as a sink for emissions exceed tolerable rates, and most producers and consumers are still able to externalise costs caused by their emissions or by the extraction\nof materials at the expense of future generations or of other world regions. Although some indicators point to an increasing decoupling of economic growth from environmental degeneration, most observers agree\nthat this is not sufficient for sustainable economic and environmental conditions. A more comprehensive industrial transformation towards sustainability is hence needed, in particular in the richer countries of the\nNorth. But what forms of governance are likely to pave the way for such transformation?\nProblem perceptions and policy approaches: Market versus State Failure\nSome scholars view market failure as the chief cause of the problem. They see the state as the appropriate actor with sufficient capacity and legitimacy to correct these failures. Others argue, however, that in\naddition to market failures, the limited capacities of governments to intervene in market activities are part of the problem. They claim that ‘state failure’ results from conflicting policy objectives for governments to\nprotect the environment and to further economic growth and employment at the same time. In addition, governments often lack the necessary information and knowledge required for the effective and efficient\ncorrection of market failures. Governmental regulations therefore at best support the ecological modernisation of economies by redirecting modernisation processes towards environmentally sounder technologies.\nEcological modernisation alone, however, will not overcome structural rigidities, and in many cases, its achievements are compensated, and often overcompensated, by economic growth.\nThe conclusions based on this state failure diagnosis vary considerably. Some scholars stress the need to better involve other stakeholders to compensate insufficient state capacities. Others hope that in the long\nrun, autonomous trends of technical modernisation will automatically reduce emissions. A third group of studies stresses the deficits of traditional command and control but also simple incentive based policies.\nMore complex strategies, often in an evolutionary spirit, such as strategic niche management, transition management, or recently “time strategies” and other types of innovation policies and ‘ecological industrial\npolicy’ which build on and aptly use and modulate ongoing innovation dynamics and rely more on the interaction of political and broader societal forces, have been advocated for. Yet it is open if these strategies\nare likely to bring about the necessary changes.\nThe Core Challenges\nGiven this dilemma of simultaneous market and state failure, the 2003 Berlin Conference aimed to bring together new and innovative research in this field — in particular with an empirical emphasis — that\nindicates possible pathways for the successful governance of industrial transformation processes. The papers addressed one or several of the following issues:\nHistory\nCase studies that draw on historical experiences with the management of industrial transformation and the stimulation of ecologically friendly innovations and markets: What were the driving forces —\nautonomous market mechanisms, state regulation, or a combination of both? What conclusions can be drawn regarding the dynamic nature of economic and political development, in particular with a view\nof economic globalisation and a possible retreat of the capacity of states to act?\nForesight\nWhat methods are available to forecast future patterns of production in order to devise and implement appropriate policies as early as possible? Which indicators are necessary and available for the\napplication of foresight methods?\nScope\nWhat should be the scope of industrial transformation? Are efficiency improvements as a result of modernisation processes a sufficient condition for industrial transformation? Are markets or governments\nthe proper institutions to cope with this requirement? Or are the options for change limited for example by deeply rooted cultural norms, consumer (and voter) preferences or the infrastructure. Which\npolicies are likely to address these issues successfully?\nNew Generation of Strategies and Instruments\nIn how far are evolutionary strategies such as strategic niche management, transition management or time strategies likely to bring about the necessary changes? Are the so-called 3rd generation\ninstruments that build on collaboration and information — such as the eco-management and audit scheme, sustainability reporting of companies or voluntary agreements — likely to contribute to the\nrequired changes, and under which institutional settings, incentive structures and actor constellations is this the case?\nMulti-actor and multi-level Governance\nWhat institutions, actors, strategies, instruments are most likely to bring forward substantial changes in the relationships between societies and the natural environment? Which governance structures are\npromising to provide a sustainable use of regional and local resources? Are dialogues between industry and environmentalist NGOs an effective and legitimate instrument to regulate a globalising industry?\nWhich other actors (e.g. financing services, consultants or trade unions) are able to intervene successfully in favour of, or as an impediment to, an industrial transition? What role can international\norganisations play in this respect? How can the different levels from global to regional be co-ordinated?\nCase Studies/Asian Rainforest Politics\nTopography\nSoutheast Asia extends from the Tropic of Cancer to south of the Equator, and from the Himalayan foothills of Burma to the tropical islands of the Philippines and Indonesia, a distance of more than 6,000 km west\nto east. It encompasses a wide variety of habitats, and is the meeting place for species from two continents. Burma, Thailand, Indochina and most of Malaysia mark the southernmost limit for Asian species, and\nthe islands of eastern Indonesia, including western New Guinea, lying on the Australian continental shelf, contain many Oceanian species. This warm, fertile region contains some of the wildest places still\nremaining anywhere in the world, both on land and in the seas.\nOverview of biome: [1] (http://www.blueplanetbiomes.org/se_asian_rnfrst.htm)\nDynamics\nThe region has long been a focus for case studies of evolution and the impact of economic growth on the integrity of tropical forests. This really began when Alfred Russel Wallace (1823–1913) travelled widely in\nthe region. He was the co-publisher with Charles Darwin (1809–82) of the theory of natural selection, coming to the same conclusions as Darwin by recognising a clear-cut division of species distribution in the\narea.\nDuring the last ice age the countries of mainland tropical Asia and the Greater Sunda Islands - Sumatra, Borneo and lava - were connected by dry land; they were separated as melting ice caused sea levels to\nrise again. Before this wildlife was able to move along the land bridges, and the islands still have plant and animal species in common with those of the mainland, characterized by tall dipterocarp trees and by\nmonkeys, native deer and hornbills. These habitats, together with their plants and animals, fall within the Indomalayan biogeographical region.\nBy contrast the islands of eastern Indonesia - Irian Jaya (western New Guinea), Kai and Am - lie on the Australian continental shelf and belong within the Oceanian biogeographical region. Here there are mound-\nbuilding birds, bowerbirds, parrots and birds of paradise, while wallabies take over the ecological niche of deer.\nWallace's dividing line, separating these two biogeographical regions, runs through the islands between Bali and Lombok, Borneo and Sulawesi, and Palawan and the rest of the Philippines. Still recognized as\nthe biogeographical boundary for many families of plants, and of birds, mammals, insects and other animals, it is a reminder of Southeast Asia's dynamic geological past. On the edges of these two\nbiogeographical regions the islands of Sulawesi, the Philippines, the Moluccas and the Lesser Sundas form a mixing ground for plants and animals from both east and west. They include many species that are\nfound only here.\nSoutheast Asia was created between 15 and 3 million years ago when outlying fragments of ancient drifting supercontinents collided in the vicinity of the island of Sulawesi. Moulded by its geological past, at a\ncrossroads for animal and plant migrations, the region has some of the most spectacular and diverse tropical habitats in the world. These range from muddy coastal mangroves and peat swamp forests to moss-\ndraped cloud forests and shrubby alpine plant communities. There are tall, lowland dipterocarp (two-winged fruited) forests The tops of these giant dipterocarp trees do not overlap. One explanation for this \"crown\nshyness\" is that it inhibits the spread of leaf-eating caterpillars. It also allows light to penetrate through the trees, and has led to the evolution of jumping and gliding mammals and reptiles. The eastern islands\nhave palm-thick jungles. There are tidal wetlands and multicoloured crater lakes of still-active volcanoes; craggy limestone hills with spearlike pinnacles and vast underground cave systems to harsh, nutrient-poor\nheathlands. The cloudy moss forest at 3,500 m in Northern Borneo is one of the wettest places on Earth, and in the highlands it is also very cold. The trees are stunted, being no more than 10 to 15 m (30 to 45 ft)\nhigh; as there is only a single canopy layer enough light penetrates to promote the growth of hanging lichens, mosses and other epiphytes, as well as ground plants. Lava and ash on a volcanic peak weather to a\nfertile soil, the radiating ridges and channels formed in the lava flows are colonized by wind-blown seeds, and vegetation begins to cover the mountainside.\nCountries in the region\nBrunei, Burma, Cambodia, Indonesia, Laos, Malaysia, Philippines, Singapore, Thailand, Vietnam\nMajor protected areas Type Hectares\nAlaungdaw Kathapa NP (160,667 ha)\nAngkorWat NP (10,717 ha)\nCat Ba NP (27,700 ha)\nCibodas NP BR (15,000 ha)\nCucPhuong NP (25,000 ha)\nDumoga-Bone NR (300,000 ha)\nGunung Leuser NP BR (792,675 ha)\nGunung Lorentz NR (1,560,250 ha)\nGunung Mulu NP (52,865 ha)\nGunung Niut NR (110,000 ha)\nHuai Kha Khaeng WS (257,464 ha)\nKhaoYai NP (216,863 ha)\nKomodo NP BR (75,000 ha)\nLore Lindu NP BR (231,000 ha)\nMae Sa-Kog Ma R BR (14,200 ha)\nMount Apo NP (72,814 ha)\nMount Kinabalu NP (75,370 ha)\nPuerto Galera BR (23,545 ha)\nSakaerat RA BR (8,10 ha)\nSiberut NP BR (56,500 ha)\nTaman Negara NP (434,351 ha)\nTanjung Putting NP BR (355,000 ha)\nUjung Kulon NP (78,619 ha)\nBR=Biosphere Reserve; NP=National Park; Reserve; R=Reserve; RA=Research station Sanctuary NR=Nature ; WS=Wildlife\nHuman settlement\nThe region has had a long history of human settlement, and people have left their mark on the landscape. The open rolling grasslands of Thailand, east Java and the Lesser Sunda Islands, which extend from Bali\nto Timor, are great swathes of once forested land that was cleared for agriculture a long time ago and subsequently abandoned. Traditional peoples living at low densities were once able to practice shifting\ncultivation in ecological balance with their environment. The Land Dayaks of Borneo, the Muong people of Laos and the hill tribes of Burma all cleared land, grew their crops and then let the land lie fallow for\nseveral years before returning to cultivate it again. As human populations have grown and remote areas have been opened up for new settlers, more forest areas have been cleared, often on vulnerable lands with\nnutrient-poor soils. These fields may provide crops for a year or two, but with regular burning they cannot return to secondary forest.\nEventually these abandoned fields become a sea of alang-alang (cogon) grasslands. These are becoming increasingly common throughout tropical Asia. The tough, tall grass is difficult to supplant, has little value\nexcept for new grazing and thrives on burning. Fires sweep through the grasslands, destroying adjacent plantations of newly planted trees and eating into the natural forest.\nThe demands of agriculture now place tremendous pressures on wilderness areas in the region. Forests are being felled by farmers who cultivate the land and then move on, for plantations, and to satisfy the\nworld's seemingly insatiable appetite for hardwoods. Tropical rainforests are disappearing at an alarming rate. Malaysia, where an estimated 230,000 ha (570,000 acres) are cut down every year, will lose all its\nremaining forest during the 1990s if this rate continues.\nForests have also been lost as a consequence of war, as in Vietnam where 2 million ha (5 million acres) of forest and mangroves were sprayed with herbicides such as Agent Orange during the conflict with the\nUnited States between 1964 and 1975. In Borneo large areas have been lost to forest fires, which consumed 3.6 million ha (8.9 million acres) in Kalimantan, in the center and south of the island, and another\nmillion in Sabah in the north during the drought year of 1983. Fires started by farmers practicing shifting cultivation raged out of control and were spread by the underlying coal and peat seams; they swept through\nforests that had already been logged, and damaged the edges of primary forest. In 1987 east Kalimantan was a sea of fire again until the flames were quenched by the late monsoon rains.\nMost countries in Southeast Asia have already lost at least half their forest cover. In densely crowded Java only 9 percent of the island remains forested. Even on Borneo, renowned for its vast tracts of tall\ndipterocarp and swamp forests, the forest boundaries are being pushed back farther and farther inland and every major river is congested with floating logs. Until people throughout the world become aware of the\nthreat and there is a dramatic reduction in the use of tropical hardwoods, the destructive deforestation of Southeast Asia will continue.\nSometimes the need for conservation is understood only too well by the local people but ignored by governments and business interests, more concerned with short-term profit than the long-term cost of\nenvironmental folly. The Penan of Sarawak, hunter-gatherers who harvest wild meat and a few minor forest products for their own use, are now building blockades to halt the timber trucks of the companies that\nare destroying their traditional lands. Local people, struggling for a livelihood from shifting cultivation, are often blamed for starting the fires that lead to forest losses, but the areas that burn most intensely are\nthose that have already been logged.\nMany countries in the region are suffering the environmental consequences that follow the loss of natural landscapes -droughts where there was once rain, floods sweeping down deforested valleys, and erosion\nof coasts and hillsides. Lowland habitats, particularly on the fertile alluvial lands along river valleys, are the first to disappear. Swamps, mangroves and wetlands are drained for development and agriculture,\nforests are cleared, limestone hills are quarried for cement, coral reefs are burned for lime and damaged by blasting to kill the fish. As these habitats are lost, so too are the benefits they provide: natural products,\nfish nurseries, coastline and watershed protection.\nPolitics of logging\nThe politics of conservation in South East Asia first captured the World’s attention when the Malaysian Prime Minister Mahathir Mohamad threatened to boycott the 1992 United Nations Conference on the\nEnvironment and Development (UNCED) in Brazil because of what he saw as \"abuse\" of Third World Countries from First World environmentalists. This situation was reviewed by William Steiff in the November\n1991 issue of ‘Monitor’ with an article entitled Deforesting Malaysia\nThe original article by Steiff may be viewed from here: [2] (http://multinationalmonitor.org/hyper/issues/1991/11/front.html)\nThis perceived affront seemed to focus on a book published the previous year by Philip Hurst entitled Rainforest Politics: Ecological Destruction in South-East Asia. Hurst presented six case studies of the\nPhilippines, Indonesia, Malaysia, Papua New Guinea, Thailand and Burma. From personal experience of the area he set out the human and economic consequences of forest destruction. His analysis revealed\nthat its causes are rooted in an exploitation of natural resources for western markets going back to colonial days. In addition, a range of other factors play a role including land hunger of small farmers deprived of\ntheir traditional farming lands, wrongly conceived development strategies and the pressures of foreign debt. In the 1980s and early 1990s, it was received wisdom in the development agencies that the main\npressure on tropical forests came from the poor. Many NGOs put a lot of effort into demonstrating the links between deforestation, landlessness and poverty and the processes of land and wealth concentration,\nwhich were in turn driven by macro-economic forces and global trade. They called for secure tenure for indigenous peoples and participatory agrarian reforms for peasants to address the linked problems of\necological injustice and deforestation.\nSubsequent studies demonstrated that forest loss caused by logging was far more than had previously been thought. NGO case studies showed how the demands of the timber, and later paper and pulp,\nindustries were heavily simplified and degraded both boreal and temperate forests. They also exposed the corruption in the timber industry, explored the political ecology of forest loss and drew attention to the\nactivities of migratory loggers who have been expanding their operations out of South-East Asia and posed an increasingly serious threat to the world’s forests.\nWWF and World Bank Alliance\nIn 1997, the World Bank and the WorldWide Fund for Nature (WWF) announced the establishment of a new ‘Alliance’ to be shaped around a joint strategy designed to meet the WWF’s dual campaign targets of\n‘setting aside’ 10% of all major forest ecosystems as protected areas and bringing an additional 200 million hectares of the world’s forests under sustainable forest management, both by the year 2005. The\nalliance brought together the WWF’s abilities to work with a wide range of ‘stakeholders’ and the financial power of the World Bank. It was important to visualise what was actually happening to forests on the\nground. Improved data about rates of deforestation have also sharpened concerns about whether these targets are realisable or even too modest. Revised FAO and WRI figures suggest that forest loss at this\ntime was still accelerating with global annual loss now estimated at 15 million hectares per year.\nAccording to World Bank/WWF projections, by 2050 a further 200 million hectares of the world’s total 3.2 billion hectares of forests would be lost to agriculture, while to service a projected demand of 3 billion\ncubic metres of industrial roundwood per year, up to half of the worlds’ remaining forests will be subject to logging at an intensity of 2 cubic metres/ha/year. This may be taking logging up to the limits, as according\nto one study up to half of all forests are likely to remain inaccessible to logging for the foreseeable future.\nAn ‘Intensification Model’ was therefore put forward by the WWF/World Bank Alliance to meet market demands – a ‘model’ which corresponded closely with the Bank’s existing forest policy. Under this model, 200\nmillion hectares of forests would still be ineluctably lost to agricultural expansion, but intensive management of silviculture and plantations, on 600 million hectares of forest yielding up to 5 cubic metres of\nroundwood per hectare per year, would service the global market, potentially freeing an additional 900 million hectares of forest for additional protected areas, while still leaving a further 1.5 billion hectares of\nforests relatively inaccessible and untouched.\nThis alliance and the outcomes it predicted were critically reviewed by Marcus Colchester in 2000.\nA draft of Colchester’s article may be viewed from here: [3] (http://greatrestoration.rockefeller.edu/21Jan2000/Colchester.htm)\nIn May 2005 the WWF and the World Bank renewed their Alliance for Forest Conservation and Sustainable Use (Forest Alliance) with a programme aimed at reducing global deforestation rates 10% by 2010. The\ntwo organizations signed on to the Forest Alliance agreement for another five years on 26 May 2005, during the fifth session of the UN Forum on Forests. The programme was designed to support the\nestablishment of new forest protected areas; more effective management of forest protected areas, and improved management of forests outside of protected areas. It will also facilitate regional cooperation and\nthe adoption of policies in support of more effective forest management.\nThe following year (Mar 2006) the \"Heart of Borneo\" conservation initiative was officially launched today with the three Bornean governments - Brunei Darussalam, Indonesia and Malaysia - declaring their\ncommitment to support it. The tri-country initiative aims to preserve one of the most important centres of biological diversity in the world, including approximately 220,000km2 of equatorial forests and numerous\nwildlife species. A recent WWF report had highlighted that 361 new species have been discovered in the last ten years.\nToday, only half of Borneo's forest cover remains, down from 75 per cent in the mid 1980s. According to WWF, all lowland rainforests in Kalimantan, the Indonesian part of Borneo, would disappear by 2010, if the\ncurrent deforestation rate of 1.3 million hectares per year continues. That's an area equivalent to about one-third the size of Switzerland. Forest fires, the conversion of forests to plantations, and logging are also\ndriving the destruction of Borneo's forests.\nIn addition, the three Bornean governments recently announced new conservation measures within the ‘Heart of Borneo’. Malaysia declared it will protect more than 200,000ha of key forest habitat in Sabah for\nthe protection of orang-utans, elephants and rhinos. Brunei has established two conservation areas. And Indonesia has proposed a new national park of 800,000ha.\nAccording to WWF, the Heart of Borneo initiative spells the end of plans to create the world's largest palm oil plantation in Kalimantan along Indonesia's mountainous border with Malaysia. The scheme -\nsupported with Chinese investments - was expected to cover an area of 1.8 million hectares and would have had long-lasting, damaging consequences on the Heart of Borneo. WWF repeatedly said new oil palm\nplantations should be established on degraded, non-forested land. It is a well known logging area\nEast Kalimantan\n2 2\nEast Kalimantan was the first of Philip Hurst’s case studies, a region which occupies about 200,000 km . of Borneo. In 1981 there were an estimated 173,000 km of forest, of which 130,000 had been designated\nfor logging. In the 1980s Kalimantan as a whole supplied almost one-third of the country's timber exports. Despite this contribution to the economy the profits accrued to a small minority and did not generally\n2\nimproved the living standards of the local people. By 1984 Kalimantan had more than 10,000 km of 'critical lands', a dangerous situation for an agricultural region. This has been proven in the studies.\nAs an introduction to the politics of logging Hurst presented the case of the U.S. Weyerhauser Corporation provides a good example of logging concession politics in this region at this time.\nHurst’s story begins in the late 1960s when Weyerhauser's logging concessions in the Philippines were becoming unprofitable. Wishing to expand operations Weyerhauser went into\npartnership with an Indonesian company: the International Timber Corporation of Indonesia (ITCI). In 1971 ITCI gained rights to 386,000 ha of primary hill forest in East Kalimantan.\nWeyerhauser could never buy out its partner because ITCI was a trust set up personally by President Suharto. On paper, Weyerhauser owned only 65% of ITCI but they provided the\noperations' total investment of US$32m. Both parties gained: Weyerhauser had financial control over ITCI and ITCI acquired a large working capital with no investment. ITCI's major\nshareholders were the top 73 Generals in Suharto's 'New Order' government. In effect the partnership was a form of pay-off from Suharto for the loyalty of Indonesia's military elite. Over\nthe first seven years ITCI's log sales averaged US$37m annually. In 1977, output from this one concession reached 1.6m tons of logs worth US$66m.\nHow much of this figure was straight profit for Weyerhauser is not clear. The forest expert, Norman Myers, estimated that for a similarly funded operation the foreign shareholder gained\nmore than US$3m profit per year.\nThe ‘Three Ministers Decree’ of 1980 put pressure on all logging operations to reinvest profits in processing facilities, but this did not suit Weyerhauser who pulled out of ITCI in 1984. In\nshort, Weyerhauser was not interested in timber processing or managing the forest after they had extracted the highest value timber, an attitude typical of foreign investment in Indonesia's\ntimber industry at this time. The concessionaires left behind an overcut forest and a tinderbox, which was revealed when during 1982-3 fires swept through 3.5m ha of the region. An\nestimated 20 million cu. metres of timber from primary forest and a further 35 million c. metres from secondary forest were destroyed.\nIn 1993 came the report of the Southeast Asia Sustainable Forest Management Network ‘Communities and Forest Management in East Kalimantan: Pathway to Environmental Stability. This was edited by Mark\nPoffenberger and Betsy McGean of the Center for Southeast Asia Studies, International and Area Studies of University of California, Berkeley. This report provides a preliminary discussion of selected research\nfindings from the Indonesian members of the Southeast Asia Sustainable Forest Management Network. With nearly three-quarters of the country's land area officially under forest cover, national planners have\nviewed forest utilization as a vehicle to stimulate economic growth and as a land pool to absorb Java's growing population. Migrants seek forest land for farming. Businessmen see profit-generating opportunities.\nNon-government organizations perceive the richness of the cultural and biological diversity and hope to preserve it. Indigenous peoples view the forest as their ancestral home, the foundation of their traditions\nand their continuity. The East Kalimantan case studies did not attempt to justify any of these views described above. Rather, the researchers reported changes in the environment and society occurring in the\nprovincial study sites in recent years through human forest interactions. The study found that forest utilization practices by concessionaires, developers, migrants, and local populations had led to a rapid process\nof forest degradation, especially in high pressure areas nearer roads and urban centres. The researchers raised the question, \"How can Indonesia best manage its millions of hectares of degraded forest lands?\"\nThey concluded that while some of this area can be developed for settlements, agriculture, and fast-growing timber plantations, a sizable majority might best be left to regenerate naturally under the protection of\nlocal communities.\nThey found that indigenous Dayak communities in Datarban and Diak Lay both showed a deep knowledge of forest ecology and regenerative processes based on centuries of experience with long rotation\nagriculture. Traditional wisdom combined with more recent scientific experimentation indicates rapid regrowth can be achieved if cutting and burning are controlled. The productivity of valuable timber and non-\ntimber forest products could be greatly increased through enrichment planting and other manipulations of the natural environment. The Dayaks, as well as the Kutai and migrant groups, were concerned about the\nfuture of their communities and the natural resources upon which they depend. The researchers concluded by urging planners, academics, and community development specialists to empower forest people with\nthe legal custodial authority to heal disturbed forest ecosystems and make them once again ecologically rich and economically productive.\nIllegal logging and fire have continued to be major issues in East Kalimantan for the next quarter of a century. According to a 2006 report by Ferdinandus Agung Prasetyo and Krystof Obidzinski from the Center\nfor International Forestry Research (CIFOR) the East Kalimantan provincial government is losing over US$100 million a year in lost business tax revenue due to illegal logging and unreported timber processing.\nThis does not include the intangible costs of the loss of biodiversity and water services. Nor the future social cost of natural disasters and loss of jobs from forest destruction.\nDemand for timber is now far exceeding the amounts that can be produced sustainably. According to the CIFOR study, East Kalimantan's timber industry has the capacity to produce about 9.1 million cubic meters\nof wood a year. For all of Indonesia the capacity exceeds 60 million cubic meters. This is in stark contrast to the Ministry of Forestry's allowable cut of 5.7 million cubic meters in 2004. The report takes a fairly\nstandard estimate that the industry in East Kalimantan is working at only 60 percent of its potential capacity, which equates to the need for timber in the region being around 5.5 million cubic meters\" Figures for\nthe past five years show that the official quantity of log production from natural forest has been around 2.1 million cubic meters per year. Subtract this official figure of 2.1 million cubic meters from the 60 percent\nestimated output, and there is an apparent deficit of 3.3 million cubic meter of logs. This 3.3 million cubic meters of timber is being processed without any taxes being paid to the provincial government. There is\nalso the lost revenue incurred through illegal timber smuggling to neighbouring countries. This was over two million cubic meters in 2000. . In total, undocumented timber processing and illegal logging amount to a\nrevenue loss of Rp 856 billion a year - about $US107 million a year - half the annual revenue of the region. This is money that could be spent on poverty reduction programs, job creation schemes, new schools\nand health centres.\nThe price of timber is decreasing despite a rise in demand for wood and a decline in the legal production of timber. Given falling supply and increasing demand, economics dictates that prices should be rising.\nThat prices are not going up means there is an oversupply of timber on the market, and this appears to be from illegal or at least undocumented sources. This timber costs less because the suppliers do not have\nto pay tax or meet the other financial obligations associated with legally producing timber.\nIt appears that the days of East Kalimantan being the main source of timber to Indonesia are over. In 1974, official government statistics listed the region as producing 6.6 million cubic meters of timber. The\nestimate of the Ministry of Forestry for 2004 is only 1.6 million cubic meters. The decline in output is due to a number of causes. These range from the 1997/98 forest fires and recent land use changes, through to\nunsustainable and illegal logging, which is also contributing to the steady deforestation of East Kalimantan. There are many issues underpinning illegal logging. One of them, but not the major one, is the lack of\nlaw enforcement. The most significant underlying cause of illegal logging is the client-patron relationship. Illegal logging is difficult to eliminate because both suppliers and purchasers benefit from the profitability of\nthe trade, especially by evading tax.\nCurrent timber prices are reaching as low as US$45–50 per cubic meters. These levels are bound to make legal timber production unprofitable. Another reason for the low prices is that workers involved in illegal\nlogging earn much less than legal workers because of their poor bargaining position.\nThe authors of the report suggest a number of solutions to the illegal logging problem. Restructuring the timber industries, increasing the supply of timber from plantations and improving the management of\nnatural forest would reduce illegal logging and slow down deforestation. Other solutions include making timber industry regulations more transparent and improving law enforcement practices.\nForestry is the main source of livelihood in East Kalimantan. If illegal logging is not properly addressed, Prasetyo and Obidzinski predict unemployment in the region will increase due to the short-term benefits and\nunequal distribution of profits from the business of illegal logging will harm the environment and the economic future of the region.\nIn 2005 the system for verifying the legality of timber known as the ‘legality standard’, the outcome of an MOU between the governments of Indonesia and UK, had clearly not been agreed upon by the\nstakeholders in East Kalimantan. However the independent parties that instigated the system – i.e. The Nature Conservancy (TNC) of America, the Department for International Development (DFID) of UK and\nSGS/URS Forestry (a TNC consultant) continued to attempt to spread information about it in East Kalimantan. The East Kalimantan Working Group on Forests, (Coordinator, Yoga Sofyar), the Director of BEBSiC\n(Ade Fadli) and the Coordinator of Working Group 30 (Public Policy Advocacy Foundation), Kahar Al Bahri. Yoga, Ade Fadli and Kahar hoped that later there would be a system which supports the conservation of\nthe forest and takes the part of the local communities. They admitted concern for the situation of the forestry sector. Up to now, after almost 40 years selling timber, Indonesia has not yet been able to say that the\ntimber from the forest is harvested according to law, i.e. that it is legal. “This is a very shameful situation,” said Ade Fadli on the web site ‘Illegal-logging.info’.\nMeanwhile, the headline in The Jakarta Post, Feb 9, 2006, 'Illegal logging rolls on', has an air of resignation about it, as the paper reported the latest news on the logging issue:\nSome 20 ships loaded with illegally cut logs and sawn timber are docked outside Tanjung Balai Karimun Customs Office in Riau Islands province. The ships were detained by the customs\noffice while attempting to smuggle their illegal cargo into Malaysia and Singapore, the head of the office, Bambang Prasodjo, told The Jakarta Post. Eight of the ships were detained in\nJanuary, carrying over 613,000 cubic meters of illegally cut timber worth an estimated Rp 3.5 billion (US$376,344). Last year, the office detained about 30 ships. Bambang claimed Monday\nthere were no signs that the smuggling of illegal logs in the province's waters was slowing down. \"It is still difficult to break up the networks smuggling illegally cut logs into Singapore and\nMalaysia. Complicating the situation is the fact that the under the Customs Law, the smugglers are considered to be the ones carrying (the illegal goods), in this case, the captain and crew.\n(Arresting) the owners of the ships is outside our authority,\" he said. He said smugglers carried the logs at night, even during rough weather, believing there would be fewer police patrols.\nIn Riau Islands, five areas are believed to be the main suppliers of illegal logs to neighbouring countries. They are Tembilahan, Selat Panjang, Dumai, Tiga Island and Dabo Singkep.\n(JP/Fadli)\nThe industrial politics of the Orang-utan\nTo view the orang-utan crisis: [4] (http://www.orangutans-sos.org/orangcrisis.php)\nThe orang-utan - whose name, appropriately, means 'man of the woods' - is the only great ape living outside Central Africa. It is also the most arboreal of the great apes, and well adapted for life in the trees. It\nmoves through the forest swinging by its arms from branch to branch, a style of movement that has led it to develop arms that are half as long again as its legs; when hanging loosely they reach almost to its\nankles. The orang-utan's long, narrow hands and feet are, similarly, adaptations for grasping branches. On the ground it moves awkwardly on its hind legs with arms held over its head. When moving more quickly\nit uses its long arms like crutches, pivoting on clenched fists and swinging its body between them. Usually it lives either singly or in twos, occasionally in small groups of up to four individual animals. Old males live\napart except briefly when mating. The orang-utan feeds mainly on fruit-notably the evil-smelling but pleasant-tasting fruit of the durian tree - supplemented by leaves, bark, birds' eggs, freshwater crustaceans, and\ninsects. Females and young sleep in the trees 10 m/30 ft or more above the ground. Each female makes a nest in the form of a simple platform in the fork of a tree, put together in a matter of minutes. Nests are\nseldom used more than once.\nThe orang-utan has a low reproductive potential; females do not become sexually mature until about ten years of age, and reproduce only every fourth year. The single young is suckled for at least 12 months and\ndoes not become completely independent for four years. There is moreover a high (40%) infant mortality rate. Thus a female orang-utan may succeed in raising no more than two or three young during her\nlifetime.\nThe Sumatran orang-utan (Pongo pygmaeus abelii) differs genetically and physically from the Bornean orang-utan (Pongo pygmaeus pygmaeus), and the population is smaller. Both species are highly\nendangered due to habitat loss and poaching and it is imperative that they are saved from extinction. The population of Sumatran orang-utans declined in number from over 12,000 in 1994 to 7,300 in 2003.\nThere may be as many as 180,000 orang-utans in Sumatra and Kalimantan, with another 4,000 or so in Sabah and Sarawak. But although these figures are higher than earlier estimates, numbers are believed to\nbe declining at the rate of several thousand a year. The only orang-utans that can be regarded as reasonably secure are the 20,000 or so estimated to occur in established reserves; but these reserves are in\nneed of more rigorous protection and higher standards of management. Orang-utans are a \"keystone\" species for conservation. They play an important part in the forest's regeneration through the fruits and\nseeds they eat. Their disappearance may represent the loss of thousands of species of plants and animals within that ecosystem. The Sumatran Orang-utan has been placed on the \"Critically Endangered\" list of\nthe Convention on International Trade in Endangered Species (CITES).\nIn Sumatra, with their jungle environment burnt and logged and their food sources lost, the Sumatran orang-utan population has been forced to move into upland forest. Current estimates suggest that they could\nbecome extinct in the wild in less than 10 years. Illegal logging and the deliberate starting of forest fires in order to convert virgin forest to timber and palm oil plantations are the main factors responsible for the\nloss of over 80% of orang-utan habitat over the last 20 years.\nHabitat destruction has arisen from the need to provide cultivated land for the constantly expanding human population, and from extensive commercialised exploitation of the primary forest in which the orang-utan\nlives. Fire is a further hazard: in 1983, a huge fire destroyed about 30,000 km2 of forest, including 8,000 km2 of primary forest. Most of the orang-utans in Sarawak and Sabah occur in 'forest reserves', a\ndesignation implying protection, but the term is misleading. Forest reserves are expressly earmarked for licensed timber extraction by contractors from whom the government draws a royalty. Clear felling of the\nforest has had the effect of splitting the orang-utans into small, often isolated, groups, making their survival difficult. Heavy losses have also been incurred in capturing orang-utans both for medical research\npurposes and for the pet trade. There is a lucrative market for baby orang-utans in many parts of the Far East, and the high prices paid prove an irresistible temptation to smugglers. The capture of baby orang-\nutans generally involves slaughtering their mothers; few of the young survive the separation. Young orang-utans are delicate animals and are susceptible to the same diseases as human beings. Captured\nanimals are generally kept under unhygienic conditions and forced to exist on an unnatural diet, with the result that most of them die from malnutrition or disease. For every young orang-utan that survives in\ncaptivity, ten die.\nTrade in young orang-utans is now illegal, with the governments of Singapore and Hong Kong prohibiting their import and export. The International Union of Directors of Zoological Gardens has also introduced\nstringent regulations governing the acquisition of orang-utans. Biological field stations have been established in both Borneo and Sumatra with the purpose of rehabilitating confiscated pets and smuggled orang-\nutans for reintroduction to the wild. Certain medical research organizations in the US have undertaken to establish their own private breeding centres in an attempt to minimize the need for wild-caught animals.\nThese measures have succeeded in almost completely halting the illegal trade in orang-utans. But there remains the need to establish a series of large and well-managed orangutan sanctuaries, in addition to\nSumatra's existing Gunung Leuser National Park (9,464 km2).\nGunung Leuser National Park is one of the biggest national parks in Indonesia (950,000 hectare). Actually, it's a collection of various nature reserves and forests: Gunung Leuser, Nature Reserve Kappi, Nature\nReserve Kluet, Sikundur Langkat Wildlife Reserve, Ketambe Research Station, Singkil Barat and Dolok Sembilin. Most parts of the national park lie in the region Aceh Tenggara (SE Aceh). Other parts are situated\nin the region east Aceh, south Aceh, and Langkat (a part of North Sumatra). The Gunung Leuser National Park comprises more than 100 kilometres of the Bukit Barisan Mountains. It has been declared a world\nheritage site by the United Nations Educational, Scientific and Cultural Organisation because of its complete ecosystem. The park consists of steep, almost inaccessible mountainous terrain. The altitude ranges\nfrom 0 metre, in Kluet (South Aceh), to 3,381 metre, on top of the Gunung Leuser (Southeast Aceh). The Alas river cuts the park into an eastern and western half. Apart from mountains there are several other\necosystems: beach forest, swamp areas, lowland rainforest, alpine and mountain forest.\nTo view the Gunung Leuser National Park Website: [5] (http://www.unesco.or.id/activities/science/env_sci/sitsup_env/207.php)\nThe latest threat to this ecosystem is the rehabilitation project to rehouse the population of Aceh made homeless by the tsunami that hit the coastal region in 2005. The epicenter of the undersea quake was at\nMeulaboh in western Aceh. In Aceh, more than 70 percent of the inhabitants of some coastal villages are reported to have died. The official death toll is at 111,171, while more than 127,000 others remain missing.\nThe exact number of victims will probably never be known. The Indonesian Ministry of Forestry estimated that about 8.5 million cubic metres of timber are needed to build 123,000 houses for Acehnese who\nsurvived the Dec. 26 tsunami disaster. Of the total figure, six million cubic meters will be in the form of logs and the remaining 2.5 million cubic meters will be sawn. According to the Ministry of Environment, the\ncentral government is targeting the Gunung Leuser National Park, be the supplier of the logs.\nTo view a newspaper article on the above project: [6] (http://www.ipsnews.net/print.asp?idnews=27688)\nThe only area in Sabah to have a legally protected population of orangutans is the Tabin Wildlife Reserve (1,205 km2 / 465 sq mis). The species' prospects have been greatly improved by the establishment of the\nDanum Valley Conservation Area (427 km2 in Eastern Sabah, an area unsuitable to agriculture which is believed to contain a substantial number of orang-utans, as well as a group of Sumartran Rhinoceroses.\nTo view Project Borneo: [7] (http://www.projectborneo.co.uk/danum.htm)\nSarawak Lanjak-Enomau National Park was created primarily for the protection of the orang-utan in 1983, with the proposed Batan Ai National Park adjoining the Lanjak Entimau Sanctuary's southern border. This\nwildlife sanctuary in southwestern Sarawak lies adjacent to the international border with Indonesia and falls within the Sri Aman, Sibu, Sarikei and Kapit divisions. It covers an area of 187,000 hectares and\noriginally created as a protected forest in 1940. It was gazetted as a wildlife sanctuary in 1983, primarily as an orang utan reserve. It comprises rugged and steeply dissected terrain with hills and ridges that are\ncommonly over 300m. Steep slopes with narrow V-shaped valleys predominate the area. The sanctuary has three peaks, namely Bukit Lanjak (1,284m), Bukit Entimau (975m) and Gunong Spali (966m). The\nregion is an important water-catchment area and is drained by the Ensirieng, Mujol, Poi, Ngemah, Katibas, Bloh, Apoh and Kanowit rivers.\nThrough biodiversity surveys, the sanctuary is now known to contain 2,807 species of vascular plants, 218 species of medicinal plants, 158 species of jungle fruits, 108 species of jungle vegetables, 500 species\nof fungi, 42 species of lichens, 6 species of primates, 48 species of small mammals, 235 species of birds, 73 species of reptiles and amphibians, 82 species of fish and 1,053 species of insects.\nIn 1990, the International Tropical Timber Organisation (ITTO) recommended that the Lanjak-Entimau Wildlife Sanctuary to be developed as a Totally Protected Area. This development is crucial to the\nconservation of tropical biodiversity because of the richness of its flora and fauna and its close links to the Bentung Kerihun National Park in West Kalimantan, Indonesia. Other than biodiversity conservation, the\nproject also aims to support sustainable livelihoods among local residents living on its periphery. Therefore, in 1993, the Sarawak government embarked on a cross-border cooperation with the Indonesian\ngovernment to develop and establish the Lanjak-Entimau/Bentung Kerihun as a Totally Protected Area, in which ITTO acts as a catalyst and facilitator. In Sarawak, the project began in 1993. On the Indonesian\nside, the first phase commenced in 1995. This combined areas of 1.1 million hectares is not only the region's first tropical forest transboundary biodiversity conservation area (TBCA) but and also one of the\nworld's largest. This TCBA constitutes the most important sanctuary in Borneo for about 3,000 orang utans, perhaps 10% of the world's remaining wild population of the species, and other rare and threatened\nplant and animal species.\nTo view TCBA Sactuary: [8] (http://www.forestry.sarawak.gov.my/forweb/wildlife/sanc/lanjak/lanenwls.htm)\nAn effective survival programme for Sumatran orang-utans is imperative because they have been neglected for a long time and have received almost no international help for years. Deprived of their forest cover,\nthey are increasingly confronted by ever-expanding human populations. The search for food forces them to stray into farms and palm oil plantations where they are often killed or fall victim to poachers. The only\nhope for these orang-utan refugees, and for orang-utans taken captive and kept as pets both in Sumatra and abroad, is rescue and re-introduction into the wild.\nAlthough there are several active rehabilitation centres for Bornean orang-utans, until 2002 Sumatra had only one, the Bohorok Orangutan Centre (BOC). Unfortunately, the BOC was forced to close its doors to\nnew arrivals in 1996. Essentially, the centre had too many orang-utans and no place to put them. These reasons, coupled with the tourist explosion in the 1990s at Bohorok, left Sumatra without a working centre.\nThe latest conservation strategies recommend against the re-introduction of ex-captives into wild populations, due to the threat of disease. This eliminates the vast Gunung Leuser National Park, adjacent to the\nBohorok centre, as a viable relocation site. Despite this, the orang-utans living at Bohorok still remain and need to be cared for.\nPeople and the forest\n2\nIn his case study of the impact of logging on indigenous peoples, Philip Hurst reported in 1990 that than 2,000 km of Sarawak's forests were being logged annually. Along the Baram river alone more than 30\n2\nlogging operations were working on approximately 400 km of forest. This highlighted the relations between the longhouse communities in the upper reaches of the Baram and Limbang rivers and the logging\ncompanies which had been deteriorating since the mid 1970s.\nSince the 1960s, the timber industry had profoundly disrupted the lifestyle of the Penan people and only half of the 10,000 Penan continued to live their traditionally nomadic life style in the forests. Most settled\nPenan had relocated in government resettlement schemes.\nView the history of Penan and the logging of the rainforest:\n[9] (http://www.earthisland.org/borneo/news/articles/010403article.html)\nIn response to deforestation the Penan have generally attempted to avoid the logging companies by moving towards the Kalimantan border. By the mid 1980s, however, logging roads extended so deep into the\ninterior that even the most remote Penan groups could no longer avoid logging concessions. As a result there have been constant problems, with logging operations scaring away wildlife, causing the silting of\nrivers, killing fish and contaminating drinking water supplies. The environmental damage forms the crux of opposition to logging in these districts, but the logging companies' attitude has undoubtedly exacerbated\nthe situation.\nConflict\n2\nHurst quotes one example of the conflict between Limbang Trading and Along Sega, a Penan headman from Long Adang ('Long' is the local term for 'Longhouse'). The 1,000 km Limbang concession was owned\nby Datuk James Wong, the Tourist Minister for Sarawak. The trouble started in 1985 when Limbang Trading destroyed the graves of Along Sega's parents and five other relatives. It was one of the first cases in\nwhich a more militant stand began to emerge. The logging camp manager offered Along a MS$100 (US$40) note as compensation, which Along refused.\nIn his own words:\nI told him, even if I have to die of any cause I shall not trade the bodies and souls of my parents and relatives to save mine because our bodies, dead or alive, are not for sale. I refused the\nmoney and pleaded with him also that if you have so much money already please don't come here to take our land. But he just shook his head, laughed and replied; 'We have been\nlicensed to work on this land. There is no such thing as your land in the forest because forest belongs only to the government. Take this money or you get nothing.' I still rejected the\nmoney.\nThe Penan, however, are not the only tribal group to be angered by the timber industry. In 1981, 500 Kenyah from Long Apoh on the Baram river approached the Sam Ling Timber Company logging camp and\ndemanded compensation for damage to their land. Previously they had sent a number of petitions asking the company to enter into negotiations over compensation proposals for their longhouse. All these had\nbeen ignored and when there was still no response to their suggestion of MS$40 (US$16) compensation for every ton of timber extracted they threatened to burn the camp. The Kenyah leaders were promptly\narrested.\nLater that year 80 people from 22 longhouses descended on the Lamat logging camp demanding MS$2 (US$0.80 cents) per ton of timber extracted. The longhouses had applied for their own timber licenses a\nnumber of times but had been refused and the 68,000 ha concession had gone to Lamat.187 Another incident occurred in the Niah area where a camp manager was stopped and forced to pay MS$7,000\n(US$2,800) as compensation for damage caused by logging. The local longhouse had earlier been promised compensation, but it never arrived. Once again those involved were arrested.\nIn 1983 the Ulu Nyalan logging camp in Niah was threatened by a small group of Iban demanding MS$100,000 (US$40,000) as compensation and MS$10 for every ton of timber extracted.189 They threatened to\nburn down the camp and were arrested two days later. In October of that year several blocks of living quarters in the Batu Niah logging camp were burnt to the ground. In January 1984, 200 Iban barricaded a\ntimber road with logs at Lubok Lalang in Sungai Medamit. They demanded MS$2m (US$790,000) in compensation from another company owned by Datuk James Wong, to no avail.\nIn other cases, however, compensation has been agreed although the sums that change hands are clearly inadequate for the loss of resources. At Long Piah, in the Baram District, loggers drove roads through\nswidden fields without permission. According to the local people the sites are now useless as all the top soil has been scraped or washed away. They did not bother to take the company to court for this illegal\ndamage on Native Customary Land, as they could only claim the maximum MS$5 per metre compensation for the damage.190 There is a general mistrust in the justice handed out from the courts within\nSarawak's Dayak community. This has built up from a number of cases in which logging companies have broken the law but received no punishment.\nThe law can, however, even act against tribal people attempting to stop logging on land they own. In 1985, Laeng Wan, a Kayan from Long Miri, was arrested for building a fence across a logging road leading to\nhis land. He was charged with unlawfully restricting a trespasser from encroaching on his own land. In 1977 he had signed an agreement leasing his land for ten years to a timber company. In 1983, however,\nwhen the initial cut had been completed, the timber company moved out and was replaced by a new contractor, and logging continued without Laeng Wan's permission or any offer of compensation for the extra\ndamage caused. It was then that Laeng took matters into his own hands and built the barricade. Due to the extremely intimate relationship between government officials and timber concessionaires, many\nlonghouses complain that the authorities are not interested in their problems. One example, in late 1986, from Long Tepan on Ulu Tutoh, a major tributary of the Baram, illustrates this lack of concern.\nThe Dayaks described their experiences when some government officials took the unusual step of visiting an area where complaints had emerged.\n\"As we are not able to write we were happy that they [government officers] came, so we told them about our problems which are mainly caused by the logging activities of Samling Timber\nSnd Bhd, which started operations about six years ago in Sungai Puak. They wrote all what we told them down and we were assured that they would take the necessary action to protect\nour land as requested. But merely two weeks after they left the bulldozers roared mercilessly around us. Then we realized it was just another empty promise from the officials. Samling\nTimber gained their logging rights direct from twelve longhouses by giving them MS$2,000 (approximately MS$7 per person; US$3) in return for allowing timber contractors to clear the\nland.\"\nView representation made by Penan to the Malaysian Timber Certification Council: [10] (http://www.rengah.c2o.org/news/article.php?identifer=de0420t)\nBlockades\nIn March 1987,12 major logging roads were blockaded by more than 2,000 people from three ethnic groups, the Penan, Kayan and Kelabit. The Penan formed the majority although most sites were located on\nNative Customary Land controlled by the other groups. Nine timber companies were affected, including: Samling Timber, Limbang Trading, Wong Tong Kwong, Merlin Timber, Sarsin Lumber, Marabong Lumber\nand Baya Lumber. The sites formed a 150 km swathe across the upper Baram and Limbang rivers.\nThe authorities immediately sealed off the areas and arrested those whom they thought were instigating the trouble. Several members of SAM were charged under the Internal Security Act and held in prison for\nup to one month. The blockades, however, remained in place.\nOne primary aim of the blockades was to publicize the problems and this strategy proved to be successful. In East Malaysia, however, the national papers are directly owned by the various political parties, all of\nwhom are involved in logging. The ruling Sarawak National Party (SNAP) claimed that outside agitators had incited the Penans and that a lawyer from Kuala Lumpur had visited the areas just before the\nblockades to stir up local people.\nIn June 1987 a delegation of Penan headmen went to Kuala Lumpur to appeal to the King and Prime Minister. They saw neither but gained considerable press coverage, and sympathy was developing abroad as\ninternational press agencies picked up on the story.\nDeforestation as an anti-development issue\nAs outside support developed, the press within Sarawak began to show less tolerance. A few reports attempted to turn the blockades into an anti-dvelopment issues, claiming that SAM and other groups\nsupporting the cause wanted to keep the Penan as museum pieces.\nThose who choose to maintain a traditional way of life depend utterly on wild game, fish and edible plants. Sago, supplemented by a wide range of fruits, nuts and berries, forms the vegetable base to their diet,\nwhile boar, lizard, monkey, various birds and fish provide the major protein source. The Penan establish a camp in an area for three to six weeks, moving on when food becomes scarce. The social groups are\nsmall, 20 to 30 individuals, and material possessions limited. Their rough, open shelters, constructed entirely from forest produce, quickly deteriorate and are reclaimed by the forest after abandonment. This life\nstyle restricts them to a few material possessions that can be carried, such as metal cooking implements, large machete-type knives (parangs) and a few Western consumer items, such as watches and radios are\nall bought by trading forest produce.\nIn the 1990s blowpipes were still in use, although rifles were more popular. Only the older Penan men continued to wear the traditional loincloth, 'T' shirts and shorts were more common. The women usually wore\nsome form of sarong, a single piece of material wrapped around the body.\nThe nomadic lifestyle is undoubtedly hard; life expectancy is low at 40 years. For many years the government has attempted to restrict the Penan's movements and to establish them in settled villages in order to\nprovide basic health care and education. The other side of this seemingly benevolent policy is the claim that the Penan are a threat to the development of the timber industry. In physical terms they have an\nabsolutely minimal effect on the forests, it is their political influence that creates a challenge to the authorities. The timber industry destroys their forest environment and consequently their culture and lifestyle. The\ninterests of the two groups are entirely incompatible. Clearly, the Penan feel seriously threatened by the type of development to which they have been exposed. As nomads they can make no legal claims over the\nforest land they use because it has not been cleared; they are, therefore, trespassers on state-owned land. The Penan in the government plantation settlements live in an atmosphere of grudging acceptance\nrather than in hope for an improved lifestyle.\nBy July the Peoples Mirror of Sarawak was running a general smear campaign against the Penan and the blockades. One reporter described the Penan and their lifestyle thus:\nA society without doors - a life of mere existence with no material possessions. . .. Children with phlegm-smeared faces tug to their mothers sarongs [Malaysian dress]. Sucklings and\ntoddlers - children -could very well be their only possession and no doors can keep them safe ... if the Penans are not ready for change now, then when will they ever be? ... The Penans,\nbeing a very simple people are being easily swayed. The truth is that logging does not deprive them of their food and water supply.\nThe blockades stayed in place until October 1987 when an amendment to Sarawak's Forest Ordinances made it a criminal offence - even for the land owner - to block any logging road. Forest Officers were\nempowered to arrest without warrant, and conviction brought a MS$6,000 (US$2,400) fine and up to two years in prison. There were 42 arrests at the blockade sites as troops were used to end the protests.\nSince the publication of Philip Child’s account of the bad relations between the Penan and their government, the situation that caused the blockades has not changed in the last quarter of a century.\nAn immense quantity of statements have emerged from the people involved and one, signed by 61 tribal leaders, clearly presents the Dayak view of their situation: Some people say we are against 'development'\nif we do not agree to move out of our land and forest. This completely misrepresents our position. Development does not mean stealing our land and forest. . . . This is not development but theft of our land, our\nrights and our cultural identity. Development to us means:\n1. recognizing our land rights in practice;\n2. putting a stop to logging in our lands and forests so that we can continue to live;\n3. introducing clean water supply, proper health facilities, better schools for our children.\nThis kind of development we want. Why don't you give us this development and progress?\nView 'the final chapter for Sarawk's primary forests': [11] (http://forestalert.org/forest.php?lang=en&news_id=5)\nThe Government viewpoint\nThe internet is full of the websites of organisations presenting the view of forest peoples, and urging western folk to lobby and boycott aimed at supporting the likes of the Penan. On the other side the Malaysia\ngovernment makes statements that it continues to strongly support international efforts to promote and ensure sustainability in forest management. Its long term view is that, if the global community wishes to halt\ndeforestation and improve forest management and conserve biodiversity it should be willing to share the cost entailed. Some additional US$125 billion a year is estimated to be required to achieve the necessary\nimprovement in forestry management practices world wide. Since UNCED in 1992 the additional resources pledged by the developed nations to assist Third World countries in this field are still not forthcoming.\nOn these ground tropical forests are undervalued. In particular, the international community which values tropical forests for their biodiversity as a carbon sink is still unprepared to pay for these services.\nIn Peninsular Malaysia alone the estimated cost of implementing sustainable forest management is about RM1.7 billion which will have to be financed through royalties and levies imposed on forestry products\n.The achievement of sustainability cannot be attained overnight nor are the goals static . The whole process is dynamic and evolving. Malaysia says it remains committed to ITTO's Objective Year 2000, definite\nsteps are already in place to pave the way towards this direction, notwithstanding the lack of transfer of resources, as promised, from the developed North.\nIn the view of Y.B. Dato' Seri Dr. Lim Keng Yaik, Minister of Primary Industries of Malaysia the package of measures that have been agreed upon and are being implemented represents a comprehensive and\nconcerted effort by all segments of the community and stakeholders towards sustainability. In other words, Malaysia is confident that it will achieve sustainable forest management within the given time frame and\nthat Malaysia will remain \"green \" for future generations to come.\nView the statement on sustainable forest management by the Minister of Primary Industries: [12] (http://www.mtc.com.my/publication/speech/forest.htm)\nHuman impact on forest primates\nThe human impact of people on forest primates ranges from the outright destruction of their arboreal habitat, through felling or damming river systems, to the isolation of small populations in isolated pockets of\nforest, which are below the threshold required to maintain a viable population. Apart from logging and clearance for agriculture, other impacts are removal of primates as agricultural pests, as food for human or\npet consumption, as bait, and the taking of live animals as pets or for laboratory research.\nIn most parts of the primate habitat of Asia, habitat disturbance commonly takes the form of commercial logging as well as shifting cultivation. The effects of logging on primate survival are tied to the type of\nlogging practices and the requirements of the animals. One key factor in survival is whether or not timber sought by loggers is also their food resource. In this respect it has been shown that Malaysian primates in\na given area can survive the destruction of up to half of the forest. Also, high densities of some primates can be reached in surviving ‘islands’ in a ‘sea’ of monocultures. These situations only apply to a limited\nnumber of species.\nHunting of primates is not as great a problem in Asia as in Africa or South America because three of the major religions there (Islam, Buddhism, and Hinduism) have proscriptions against eating primates.\nNonetheless, hunting by aboriginal groups is common in Indonesia, and Chinese hunt all species of monkeys in China and in other Asian countries in which they live. In Asia, the major direct threat to primates is\nthat they are traded commercially. The commercial use of wild monkeys for biomedical research is responsible for the decline in macaques, an Asian genus.\nAlthough non-timber products provide a justification for the conservation of forest, if the markets for them are successfully developed, the result could be overexploitation, leading to clear-cutting for areas of\ncommercial cultivation. Understory clearing, often for fodder for domestic animals or for plantations of shade-loving crops, destroys seedlings, and with them, the possibility of the regeneration of canopy trees.\nShifting cultivation increases the proportion of secondary forest at the expense of primary forest. In Asia, this change favors cercopithecines at the expense of colobines. In peninsular Malaysia, the primate\nbiomass in primary forest is dominated by colobines (Presbytis spp.), whereas secondary forest, riverine swamp, domestic orchards, paddy fields, and so forth commonly host cercopithecines, particularly long-\ntailed macaques. For open-country monkey species like most macaques (Macaca spp.) and the Hanuman langur (Presbytis entellus), any kind of disturbance that results in landscapes such as the meadow like\ncommunities created by clear-cutting, grazing, and crop planting mimics the forest edge or savanna to which they originally were adapted. It has been argued that the rhesus monkey (Macaca mulatto), which\nprefers feeding on ground herbs that occur in disturbed sites, has spread with the disappearance of the forests of Asia during the Pleistocene glaciations and that continues to prosper in the face of the human\ncolonization of forestlands.\nDespite the Indo-Pacific’s unsurpassed biological richness, many species other than primates are in immediate danger of extinction. The number of current extinctions globally and regionally, in fact, rivals that of\nthe end of the Age of Dinosaurs. Given the increasing scale and scope of current threats such as logging, agricultural expansion, and increasing demographic pressures on natural resources, new conservation\nstrategies and fieldwork with local governments and communities are clearly necessary if biodiversity in the Indo-Pacific is to be protected.\nTo view the work of the Indo-Pacific Conservation Alliance: [13] (http://www.indopacific.org/biodiversity.asp)\nCase Studies/British Limestone Grasslands\nTypes of grassland\nBritain’s lowland limestone grasslands share the common geochemical feature that they are composed mainly of rocks rich in calcium carbonate. Also, until recent times they were unenclosed and formed the\nprincipal sheep pastures of southern England. These grasslands, which may never have been cultivated or have escaped ploughing for hundreds of years, are often described as semi-natural grasslands. Their\ndistribution in England rests on five main geological formations,\nChalk,\nOolitic limestone,\nCarboniferous limestone,\nMagnesium limestone\nDevonian limestone.\nThe most important differences which influence the vegetation they carry appears to be physical rather than chemical. Limestones are harder and frequently form rocky outcrops on hills which may give rise to\ncliffs, often associated with screes. In some districts there are extensive areas in which landscape features produced through rocks being dissolved by running water are developed (karstic features). It has been\npostulated that the difference in hardness of the rocks may have been an important factor in determining the present-day flora, the softer limestone hills having been tree-covered in early post-glacial times\nwhereas the harder rocks, especially on cliffs, gorges and similar exposed sites may have remained open throughout the period of forest maximum. This hypothesis suggests that until forest clearance by people\nin the Neolithic(3000-1850 B.C.) and Bronze Age (1850-550 B.C.) periods some of these sites may have served as refuges for plants which subsequently colonized the open grasslands. Lowland calcareous\ngrasslands are derived from sedimentary deposits of chalk or other types of limestone, e.g. metamorphic mica schist and serpentine. Other base-rich substrates, such as ultrabasic igneous formations and heavy\nmetal contaminated soil support Calaminarian grassland.\nThe most diverse communities, with characteristic flora including some important lower plant communities, characteristic and specialist invertebrates and birds, occur on shallow rendzina soils over calcareous\nbedrock. Other quality measures include the presence of short-lived disturbance patches, patches of developing and mature scrub, and areas with continuity of low-intensity grazing.\nLarge sites tend to occur along escarpments where modern agricultural techniques are not dominant and where soils derived from glacial deposits have not obscured the calcareous bedrock. Large sites, or\nsmaller contiguous sites, are more likely to support characteristic species with large ranges and provide opportunities for recolonisation local extinctions occur.\nThe Lizard peninsula Cornwall's is Britain's most southerly point. Nowhere else in Cornwall can boast such a density of nationally recognised Sites of Special Scientific Interest (SSSI's) or regionally important\ncounty geology sites (formery known as RIGS). The rocks on the Lizard are totally different from the rest of Cornwall. The most extensive (20 square miles) is the serpentine which is largest outcrop.\nSerpentine and gabbro produce magnesium or calcium rich soils and it is the resulting alkalinity of the soils on these parts of the Lizard that has enabled a large number of quite rare plants to thrive here, such as\ndropwort, salad burnet, bloody cranesbill and the rare Cornish heath which is only found on The Lizard.\nChalk\nChalk is a particularly soft form of limestone, which weathers to form smooth rounded hills known as \"downs\" or \"wolds\", often dissected by flat bottomed valleys associated with prominent, rounded spurs. The\nrock formation was laid down in shallow seas some sixty million years ago. Chalk rarely outcrops and only forms cliffs at the coast (e.g. the \"White Cliffs of Dover\"). English downland is broadly divisible into four\nmain regions:-\nthe North Downs of Kent and Surrey;\nthe broader South Downs of Sussex, Hampshire and the Isle of Wight;\nthe Chilterns;\nthe Wessex downs of Wiltshire, Dorset, Hampshire and Berkshire, in the centre of which lies Salisbury Plain.\nUntil the middle of the last century these downlands were devoted almost exclusively to sheep-rearing. In many places on the chalk, woodland occurs, and in some areas such as the Chilterns, there are\nsubstantial beech forests. Ungrazed chalk grassland will soon be invaded by bushes, and eventually by woodland trees. These facts are the starting point for the conservation of downland because it indicates that\ngrassland of today is stable only because of the grazing of animals— mainly domestic sheep, and wild rabbits. It has been inferred, from the concentration of artifacts of late Neolithic culture on the Wessex\ndowns, and, to a less extent, on the South Downs, that the original forest covering these chalk hills must have been at least partly removed by 2500 B.C.; and it may well be that in these areas a good deal of the\nchalk grassland turf is about 4,000 years old. But in other areas, e.g. the North Downs, there was no such widespread early culture, and the origin of the open downland must be a good deal more recent.\nWoodland of today many not be all that ancient; for in several places lynchets,' or old Celtic ploughing terraces, can be detected in present day mature beech woods.\nHarder limestones\nThe term limestone is commonly used to describe calcareous strata that are harder and older than chalk. As a guide to their distribution it may be said that in the British Isles the chalk areas occur in east and\nsouth-east England where the young rocks are exposed; next, to the north and west, are situated the older Oolitic limestones—rather soft yellowish stone so beautifully used for building in the Cotswolds, for\nexample; and farther north and west, in a larger arc, are to be found the Carboniferous or Mountain limestones, e.g. the Mendips, Gower, the Great Orme, the Craven district of Yorkshire, and the Derbyshire\nDales. Elsewhere in north and west Britain the limestones are small in extent and most of the rocks are ancient siliceous strata. In Ireland, however, there is a great deal of Carboniferous limestone; but little is free\nfrom peat covering which is maintained as an organic ground cover in that very wet climate. In general, much of the geographical variability of lowland calcareous grassland over the country as a whole may be\naccounted for by differences in climate.\nRegional differences in biodiversity\nPlants\nRegional botanical differences can be generalised in terms of distinctive groupings of plants. For example in Matthew's oceanic southern biodiversity element, Helianthemum apenninum is restricted to the outcrop\nof Devonian limestone and to certain areas in the Mendips; Koeleria vallesiana is restricted entirely to the Mendips. Polygala calcarea an important species of the Chalk and Oolitic limestone within the oceanic\nsouthern element is more widespread but reaches its highest abundance in the western chalk grasslands and its northern limit on the Oolitic limestone in Rutland.\nTwenty-six European species, most of them rare or local plants of calcareous grasslands, are included in Matthew's continental southern element, which in Britain has a markedly southern distribution with the\nhighest concentration of species in south-east England, south of a line joining the Bristol Channel and the Wash. Ophrys fuciflora, 0. purpurea and 0. simia are restricted to the chalk in Kent while 0. sphegodes is\nfound in Kent, Sussex, on the Isle of Wight and on the Jurassic formation in Dorset. More widespread species in this group includes Hippocrepis comosa which extends northwards to the carboniferous limestone\nin northern England but is only common in the chalk grasslands of southern England. Other species in this group, each with their own special distribution pattern but included in this major south-eastern floristic\nelement are:\nAceras anthropophorum, Ajuga chamaepitys. Anacamptis pyramidalis, Asperula cynanchica, Blackstonia perfoliata, Buxus sempervirens, Carex humilis, Cephalanthera damasonium, Daphne laureola,\nHimantoglossum hircinum, Spiranthes spiralis, Trifolium scabrum and Trinia glauca.\nHelianthemum canum, Hornungia petraea and Linosyris vulgaris are, however, western species in Britain and found mainly on Carboniferous limestone.\nThe continental element includes many of the rare species characteristic of the chalk and Oolitic limestone in the south and south-east which are mostly absent from the western Carboniferous limestone. This\ngroup includes Pulsatilla vulgaris, Bunium bulbocastanum, Dianthus gratianopolitanus, Hypochaeris maculate, Ophrys insectifera, Orchis militaris, 0. ustulata, Orobanche elatior, Phleum phleoides, Phyteuma\ntenerum, Carex ericetorum, Senecio integrifolius and Seseli libanotis.\nCirsium acaulon, which is included in this group also occurs on the carboniferous limestone, but it is significant that at the northern limit of its range, in Derbyshire and Yorkshire, it occurs only on south to south-\nwest facing slopes. The northern and sub-montane calcicole element in the flora is well represented below 1,000 ft. on the carboniferous limestone of Northern England, but only one species (Antennaria diolca) in\nthis floristic element reaches the chalk, although the moss Rhytidium rugosum is abundant on the chalky boulder clay in the Breckland. Examples of northern species relatively abundant on the lowland\ncarboniferous limestone of the Pennines, the Peak District and Morecambe Bay are: Viola lutea, Crepis mollis, Trollius europaeus, Prunus padus, Rosa villosa, Draba incana, Cirsium heterophyllum, Geranium\nsylvaticum, Epipactis atrorubens, Melica nutans, Saxifraga hypnoides and Asplenium viride.\nAnimals\nMuch the same factors which appear to determine the distribution of plant species are relevant to the distribution of animals. The proximity of the Continent of Europe to the eastern chalk in Kent and Sussex is\nundoubtedly related to the particular richness of the fauna in these counties. Relatively few species seem to be more numerous or only present in western Britain, although the insects of the Cornish peninsula,\nparticularly associated with vegetation of the calcareous maritime serpentine rocks at the Lizard, probably include many species which only occur in this region in Britain. Species such as the Small Blue butterfly\nCupido minimus are undoubtedly commoner in Western Britain than in the East.\nMany animal species have distributions in Britain which are markedly southern. Some occur only along the south coast of England, others are not found north of the Thames while others again occur only up to the\nMidlands. It is often difficult, especially in the case of predacious species, to determine whether these are restricted to limestone formations or not. Limestone in southern England warms up quickly and shares\nwith arenaceous and cindery substrates an abundance of thermophilous animal species which is not found so frequently on the colder clay soils.\nThe richness of phytophagous animals on limestone in southern Britain is frequently easily related to the occurrence of particular foodplants and the abundance of these. It seems probable that the physical\ncharacteristics of limestone rocks and soils, the occurrence of these rocks and soil abundantly in southern England, and the growth and diverse vegetation on limestones are the most important factors in\ndetermining the distribution and abundance of the animals. Chemical factors are of over-riding importance in some cases, for example the occurrence of many terrestrial Mollusca. The proximity of the sea seems\nto be a powerful modifying influence, with many maritime species being particularly associated with limestone cliff tops and cliff faces.\nThe history of grasslands in Britain whether in the long term (i.e. throughout the Pleistocene), medium term (Prehistoric) or recent (Historic) has been important in determining the composition of the fauna.\nPalaeoecological studies have shown how different the fauna of Britain has been in recent geological time. The creation of grasslands from the primaeval forest is reflected in the fossil faunas collected from\ndifferent sites. In historic times the introduction of the Rabbit (Oryctolagus cuniculus), and the extinction of the Great Bustard (Otis tarda) and near extinction of the Large Blue_ butterfly (Maculinea anion) are\nexamples of the greatly modifying influence directed by human activity on the fauna of calcareous grasslands.\nTargets and sites\nIn the Biodiversity Challenge, and agenda for conservation in the UK (1994), produced by a group of voluntary conservation organizations the targets for lowland dry calcareous grassland were stated as:-\nDevelop and/or maintain appropriate management of the existing resource, and protect sites from damaging activities.\nRestore adjacent areas where possible, to create a buffer zone for the main site ar a mosaic of bare soil habitats, short-grazed and tall-sward pastures and scrub of various ages.\nEstablish the true extent of the remaining resource as an essential first step to achieving these targets.\nThe total extent of unimproved grassland habitats in the UK is estimated to be less than 0.3 million ha (UK Action Plan) with only a proportion of this figure 'supporting its characteristic biodiversity'. In 1972, Dorset\nhad only 2,268 ha of unimproved cha grassland left compared with 28,000 ha in 1811. Best estimates suggest that the total resource of lowland unimproved calcareous grassland is now less than 20,000 ha in the\nUK. Priority areas for action include:\nSalisbury Plain,\nChiltern Scarp,\nthe North and South Downs,\nCotswold Scarp,\nthe Mendips,\nthe Lincolnshire and Yorkshire Wolds,\nAnglesey and the Vale of Clwyd in Wales,\nBreckland (CG7b),\nthe magnesian limestone grasslands in Durham (CG8),\nthe Dorset Downs,\nthe Isle of Wight,\nthe Carboniferous limestones of Derbyshire,\nthe Pembroke coast (CG1b)\nThe grasslands are under threat from changes in farming practice, particularly:\nabandonment of grazing on steep slopes which leads to encroachment by coarse grasses and scrub\nfertilising\nploughing.\nRDB vascular plants of lowland calcareous grasslands, such as Gentianella anglica, tend to be more characteristic of the short, grazed pastures provided by low-intensity sheep grazing, mixed livestock grazing or\nunmanaged rabbit grazing.\nExamples of threatened species\nExamples of key species whose conservation is closely linked to the conservation of unimproved lowland calcareous grasslands are listed below. A suggested conservation target is given for each species.\nLichens\nBuellia asterella (starry Breck lichen)\nReduce scrub encroachment by appropriate management and reinstate rabbit-grazing. Prosecute botanists illegally collecting material. Known from only three areas in the Suffolk Breckland.\nCharacteristic of rabbit-grazed, calcareous, sandy, lichen-dominated turf.\nBryophytes\nBarbula glauca (glaucous beard-moss).\nKnown from only one site in Wiltshire, in a dry chalk crevice. Threatened by shading, rubbish dumping and collecting, the site should be managed appropriately and collecting discouraged by\nprosecution.\nFlowering plants\nAlthaea hirsuta (hairy mallow)\nContinue to restore appropriate management at threatened Somerset site and only Kent site. Monitor recovery of these populations and monitor status of third native population. Known from only\nthree native sites. A plant of disturbance patches on south-facing calcareous slopes.\nGentianella anglica (early gentian) Maintain in 25 sites on chalk in southern England. A UK endemic species.\nOrchis militaris (military orchid)\nMaintain conservation management to enhance populations at only two known sites in the UK, both owned by the FC. Establish the extent of genetic variation between British and continental plants\nusing gene or enzyme analysis. Provide suitable management at other historic sites to allow natural recolonisation.\nInsects\nDecticus verrucivorus (wart-biter grasshopper)\nSurvey Wiltshire chalk grasslands for further populations. Re-establish in the only former known site in the county.\nGomphocerripus rufus (a grasshopper)\nMaintain range on limestone grassland. Hesperia comma (silver-spotted skipper) Halt decline and restore range.\nSiona lineata (black-veined moth)\nMaintain remaining populations at two chalk grassland sites in Kent. Restore to other sites in previous range.\nBirds\nBurhinus oedicnemus (stone-curlew)\nTarget from the RSPB /JNCC species action plan. Increase the population breeding in England to 200 pairs by the year 2000, within the present range which also includes arable and calcifugous\ngrassland. Encourage recolonisation of the past breeding range within England. Increase the proportion of the population nesting in semi-natural grassland habitats. An important part of the\npopulation nests on chalk grassland in southern England.\nRetrieved from \"https://en.wikibooks.org/w/index.php?title=Applied_Ecology/Printable_version&oldid=4224500\"\nThis page was last edited on 29 December 2022, at 01:43.\nText is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy."
}