{
    "text": "Blog Browse Log In Sign Up\nBrowse Content / Aging\nSECTIONS\nAging\nAbstract\nLearning Objectives\nBy Tara Queen and Jacqui Smith\nUniversity of Michigan Introduction\nOverview: Life Span and Life C…\nTraditionally, research on aging described only the lives of people over age\nCognitive Aging\n65 and the very old. Contemporary theories and research recognizes that\nPersonality and Self-Related Pr…\nbiogenetic and psychological processes of aging are complex and lifelong.\nSocial Relationships\nFunctioning in each period of life is in\u0000uenced by what happened earlier\nEmotion and Well-being\nand, in turn, a\u0000ects subsequent change. We all age in speci\u0000c social and\nSuccessful Aging and Longevity\nhistorical contexts. Together, these multiple in\u0000uences on aging make it\nOutside Resources\ndi\u0000cult to de\u0000ne when middle-age or old age begins. This module\nDiscussion Questions\ndescribes central concepts and research about adult development and\naging. We consider contemporary questions about cognitive aging and Vocabulary\nchanges in personality, self-related beliefs, social relationships, and References\nsubjective well-being. These four aspects of psychosocial aging are related\nAuthors\nto health and longevity\nCreative Commons License\nhttp://noba.to/gtp7r548\nTags: Adult development, Cognitive aging, Life span development, Midlife, Old age, Self-perceptions of aging, Successful aging\nLearning Objectives\nExplain research approaches to studying aging.\nDescribe cognitive, psychosocial, and physical changes that occur with age.\nProvide examples of how age-related changes in these domains are observed in the context of everyday life.\nIntroduction\nWe are currently living in an aging society (Rowe,\n2009). Indeed, by 2030 when the last of the Baby\nBoomers reach age 65, the U.S. older population\nwill be double that of 2010. Furthermore, because\nof increases in average life expectancy, each new\ngeneration can expect to live longer than their\nparents’ generation and certainly longer than their\ngrandparents’ generation. As a consequence, it is\ntime for individuals of all ages to rethink their\npersonal life plans and consider prospects for a\nlong life. When is the best time to start a family?\nWill the education gained up to age 20 be\nsu\u0000cient to cope with future technological\nadvances and marketplace needs? What is the\nright balance between work, family, and leisure\nthroughout life? What's the best age to retire? How\ncan I age successfully and enjoy life to the fullest\nDue to positive health trends the population of older adults is\nwhen I'm 80 or 90? In this module we will discuss\nincreasing steadily. Understanding the psychology of aging will be\nseveral di\u0000erent domains of psychological\nmore important than ever to support this group and help them\nresearch on aging that will help answer these\nthrive. [Photo: Woody Hibbard, https://goo.gl/VP7pfz, CC BY 2.0,\nimportant questions.\nhttps://goo.gl/JD0cjj]\nOverview: Life Span and Life Course Perspectives on Aging\nJust as young adults di\u0000er from one another, older adults are also not all the same. In each decade of adulthood,\nwe observe substantial heterogeneity in cognitive functioning, personality, social relationships, lifestyle, beliefs,\nand satisfaction with life. This heterogeneity re\u0000ects di\u0000erences in rates of biogenetic and psychological aging and\nthe sociocultural contexts and history of people's lives (Bronfenbrenner, 1979; Fingerman, Berg, Smith, &\nAntonucci, 2011). Theories of aging describe how these multiple factors interact and change over time. They\ndescribe why functioning di\u0000ers on average between young, middle-aged, young-old, and very old adults and why\nthere is heterogeneity within these age groups. Life course theories, for example, highlight the e\u0000ects of social\nexpectations and the normative timing of life events and social roles (e.g., becoming a parent, retirement). They\nalso consider the lifelong cumulative e\u0000ects of membership in speci\u0000c cohorts (generations) and sociocultural\nsubgroups (e.g., race, gender, socioeconomic status) and exposure to historical events (e.g., war, revolution,\nnatural disasters; Elder, Johnson, & Crosnoe, 2003; Settersten, 2005). Life span theories complement the life-\ncourse perspective with a greater focus on processes within the individual (e.g., the aging brain). This approach\nemphasizes the patterning of lifelong intra- and inter-individual di\u0000erences in the shape (gain, maintenance,\nloss), level, and rate of change (Baltes, 1987, 1997). Both life course and life span researchers generally rely on\nlongitudinal studies to examine hypotheses about di\u0000erent patterns of aging associated with the e\u0000ects of\nbiogenetic, life history, social, and personal factors. Cross-sectional studies provide information about age-group\ndi\u0000erences, but these are confounded with cohort, time of study, and historical e\u0000ects.\nCognitive Aging\nResearchers have identi\u0000ed areas of both losses and gains in cognition in older age. Cognitive ability and\nintelligence are often measured using standardized tests and validated measures. The psychometric approach\nhas identi\u0000ed two categories of intelligence that show di\u0000erent rates of change across the life span (Schaie &\nWillis, 1996). Fluid intelligence refers to information processing abilities, such as logical reasoning, remembering\nlists, spatial ability, and reaction time. Crystallized intelligence encompasses abilities that draw upon experience\nand knowledge. Measures of crystallized intelligence include vocabulary tests, solving number problems, and\nunderstanding texts.\nWith age, systematic declines are observed on\ncognitive tasks requiring self-initiated, e\u0000ortful\nprocessing, without the aid of supportive memory\ncues (Park, 2000). Older adults tend to perform poorer\nthan young adults on memory tasks that involve recall\nof information, where individuals must retrieve\ninformation they learned previously without the help\nof a list of possible choices. For example, older adults\nmay have more di\u0000culty recalling facts such as names\nor contextual details about where or when something\nhappened (Craik, 2000). What might explain these\nde\u0000cits as we age? As we age, working memory, or\nour ability to simultaneously store and use\ninformation, becomes less e\u0000cient (Craik & Bialystok,\n2006). The ability to process information quickly also\ndecreases with age. This slowing of processing speed\nThere are many stereotypes of older adults. They are\nmay explain age di\u0000erences on many di\u0000erent\nsometimes seen as slow because of changes in cognitive\ncognitive tasks (Salthouse, 2004). Some researchers\nprocessing speed. They are though, on average, excellent at\nhave argued that inhibitory functioning, or the ability\ndrawing on personal experience and knowledge. And they tend\nto focus on certain information while suppressing\nto outperform young adults when it comes to social and\nattention to less pertinent information, declines with\nemotional challenges. [Image: Alex E. Proimos,\nage and may explain age di\u0000erences in performance\nhttps://goo.gl/20SbW8, CC BY-NC 2.0, https://goo.gl/FIlc2e]\non cognitive tasks (Hasher & Zacks, 1988). Finally, it is\nwell established that our hearing and vision decline as\nwe age. Longitudinal research has proposed that\nde\u0000cits in sensory functioning explain age di\u0000erences in a variety of cognitive abilities (Baltes & Lindenberger,\n1997).\nFewer age di\u0000erences are observed when memory cues are available, such as for recognition memory tasks, or\nwhen individuals can draw upon acquired knowledge or experience. For example, older adults often perform as\nwell if not better than young adults on tests of word knowledge or vocabulary. With age often comes expertise,\nand research has pointed to areas where aging experts perform as well or better than younger individuals. For\nexample, older typists were found to compensate for age-related declines in speed by looking farther ahead at\nprinted text (Salthouse, 1984). Compared to younger players, older chess experts are able to focus on a smaller\nset of possible moves, leading to greater cognitive e\u0000ciency (Charness, 1981). Accrued knowledge of everyday\ntasks, such as grocery prices, can help older adults to make better decisions than young adults (Tentori, Osheron,\nHasher, & May, 2001).\nHow do changes or maintenance of cognitive ability a\u0000ect older adults’ everyday lives? Researchers have studied\ncognition in the context of several di\u0000erent everyday activities. One example is driving. Although older adults\noften have more years of driving experience, cognitive declines related to reaction time or attentional processes\nmay pose limitations under certain circumstances (Park & Gutchess, 2000). Research on interpersonal problem\nsolving suggested that older adults use more e\u0000ective strategies than younger adults to navigate through social\nand emotional problems (Blanchard-Fields, 2007). In the context of work, researchers rarely \u0000nd that older\nindividuals perform poorer on the job (Park & Gutchess, 2000). Similar to everyday problem solving, older workers\nmay develop more e\u0000cient strategies and rely on expertise to compensate for cognitive decline.\nPersonality and Self-Related Processes\nResearch on adult personality examines normative age-related increases and decreases in the expression of the\nso-called \"Big Five\" traits—extraversion, neuroticism, conscientiousness, agreeableness, and openness to new\nexperience. Does personality change throughout adulthood? Previously the answer was no, but contemporary\nresearch shows that although some people’s personalities are relatively stable over time, others’ are not (Lucas &\nDonnellan, 2011; Roberts & Mroczek, 2008). Longitudinal studies reveal average changes during adulthood in the\nexpression of some traits (e.g., neuroticism and openness decrease with age and conscientiousness increases)\nand individual di\u0000erences in these patterns due to idiosyncratic life events (e.g., divorce, illness). Longitudinal\nresearch also suggests that adult personality traits, such as conscientiousness, predict important life outcomes\nincluding job success, health, and longevity (Friedman, Tucker, Tomlinson-Keasey, Schwartz, Wingard, & Criqui,\n1993; Roberts, Kuncel, Shiner, Caspi, & Goldberg, 2007).\nIn contrast to the relative stability of personality traits, theories about the aging self-propose changes in self-\nrelated knowledge, beliefs, and autobiographical narratives. Responses to questions such as “Tell me something\nabout yourself. Who are you?” \"What are your hopes for the future?\" provide insight into the characteristics and\nlife themes that an individual considers uniquely distinguish him or herself from others. These self-descriptions\nenhance self-esteem and guide behavior (Markus & Nurius, 1986; McAdams, 2006). Theory suggests that as we\nage, themes that were relatively unimportant in young and middle adulthood gain in salience (e.g., generativity,\nhealth) and that people view themselves as improving over time (Ross & Wilson, 2003). Reorganizing personal life\nnarratives and self-descriptions are the major tasks of midlife and young-old age due to transformations in\nprofessional and family roles and obligations. In advanced old age, self-descriptions are often characterized by a\nlife review and re\u0000ections about having lived a long life. Birren and Schroots (2006), for example, found the\nprocess of life review in late life helped individuals confront and cope with the challenges of old age.\nOne aspect of the self that particularly interests\nlife span and life course psychologists is the\nindividual’s perception and evaluation of their\nown aging and identi\u0000cation with an age group.\nSubjective age is a multidimensional construct\nthat indicates how old (or young) a person feels\nand into which age group a person categorizes\nhim- or herself. After early adulthood, most\npeople say that they feel younger than their\nchronological age and the gap between subjective\nage and actual age generally increases. On\naverage, after age 40 people report feeling 20%\nyounger than their actual age (e.g., Rubin &\nBerntsen, 2006). Asking people how satis\u0000ed they\nare with their own aging assesses an evaluative\ncomponent of age identity. Whereas some\naspects of age identity are positively valued (e.g.,\nThere is a di\u0000erence between physical age and subjective age as\nacquiring seniority in a profession or becoming a\nsummarized in the saying \"You are only as old as you feel.\" [Image:\ngrandparent), others may be less valued,\nEmar, CC BY-NC-SA 2.0, https://goo.gl/HEXbAA]\ndepending on societal context. Perceived physical\nage (i.e., the age one looks in a mirror) is one\naspect that requires considerable self-related\nadaptation in social and cultural contexts that value young bodies. Feeling younger and being satis\u0000ed with one’s\nown aging are expressions of positive self-perceptions of aging. They re\u0000ect the operation of self-related\nprocesses that enhance well-being. Levy (2009) found that older individuals who are able to adapt to and accept\nchanges in their appearance and physical capacity in a positive way report higher well-being, have better health,\nand live longer.\nSocial Relationships\nSocial ties to family, friends, mentors, and peers are primary resources of information, support, and comfort.\nIndividuals develop and age together with family and friends and interact with others in the community. Across\nthe life course, social ties are accumulated, lost, and transformed. Already in early life, there are multiple sources\nof heterogeneity in the characteristics of each person's social network of relationships (e.g., size, composition,\nand quality). Life course and life span theories and research about age-related patterns in social relationships\nfocus on understanding changes in the processes underlying social connections. Antonucci's Convoy Model of\nSocial Relations (2001; Kahn & Antonucci, 1980), for example, suggests that the social connections that people\naccumulate are held together by exchanges in social support (e.g., tangible and emotional). The frequency, types,\nand reciprocity of the exchanges change with age and in response to need, and in turn, these exchanges impact\nthe health and well-being of the givers and receivers in the convoy. In many relationships, it is not the actual\nobjective exchange of support that is critical but instead the perception that support is available if needed\n(Uchino, 2009). Carstensen’s Socioemotional Selectivity Theory (1993; Carstensen, Isaacowitz, & Charles, 1999)\nfocuses on changes in motivation for actively seeking social contact with others. She proposes that with\nincreasing age our motivational goals change from information gathering to emotion regulation. To optimize the\nexperience of positive a\u0000ect, older adults actively restrict their social life to prioritize time spent with emotionally\nclose signi\u0000cant others. In line with this, older marriages are found to be characterized by enhanced positive and\nreduced negative interactions and older partners show more a\u0000ectionate behavior during con\u0000ict discussions\nthan do middle-aged partners (Carstensen, Gottman, & Levenson, 1995). Research showing that older adults have\nsmaller networks compared to young adults and tend to avoid negative interactions also supports this theory.\nSimilar selective processes are also observed when time horizons for interactions with close partners shrink\ntemporarily for young adults (e.g., impending geographical separations).\nMuch research focuses on the associations between speci\u0000c e\u0000ects of long-term social relationships and health in\nlater life. Older married individuals who receive positive social and emotional support from their partner\ngenerally report better health than their unmarried peers (Antonucci, 2001; Umberson, Williams, Powers, Liu, &\nNeedham, 2006; Waite & Gallagher, 2000). Despite the overall positive health e\u0000ects of being married in old age\n(compared with being widowed, divorced, or single), living as a couple can have a \"dark side\" if the relationship is\nstrained or if one partner is the primary caregiver. The consequences of positive and negative aspects of\nrelationships are complex (Birditt & Antonucci, 2008; Rook, 1998; Uchino, 2009). For example, in some\ncircumstances, criticism from a partner may be perceived as valid and useful feedback whereas in others it is\nconsidered unwarranted and hurtful. In long-term relationships, habitual negative exchanges might have\ndiminished e\u0000ects. Parent-child and sibling relationships are often the most long-term and emotion-laden social\nties. Across the life span, the parent-child tie, for example, is characterized by a paradox of solidarity, con\u0000ict, and\nambivalence (Fingerman, Chen, Hay, Cichy, & Lefkowitz, 2006).\nEmotion and Well-being\nAs we get older, the likelihood of losing loved ones or experiencing declines in health increases. Does the\nexperience of such losses result in decreases in well-being in older adulthood? Researchers have found that well-\nbeing di\u0000ers across the life span and that the patterns of these di\u0000erences depend on how well-being is\nmeasured.\nMeasures of global subjective well-being assess individuals’ overall perceptions of their lives. This can include\nquestions about life satisfaction or judgments of whether individuals are currently living the best life possible.\nWhat factors may contribute to how people respond to these questions? Age, health, personality, social support,\nand life experiences have been shown to in\u0000uence judgments of global well-being. It is important to note that\npredictors of well-being may change as we age. What is important to life satisfaction in young adulthood can be\ndi\u0000erent in later adulthood (George, 2010). Early research on well-being argued that life events such as marriage\nor divorce can temporarily in\u0000uence well-being, but people quickly adapt and return to a neutral baseline (called\nthe hedonic treadmill; Diener, Lucas, & Scollon, 2006). More recent research suggests otherwise. Using\nlongitudinal data, researchers have examined well-being prior to, during, and after major life events such as\nwidowhood, marriage, and unemployment (Lucas, 2007). Di\u0000erent life events in\u0000uence well-being in di\u0000erent\nways, and individuals do not often adapt back to baseline levels of well-being. The in\u0000uence of events, such as\nunemployment, may have a lasting negative in\u0000uence on well-being as people age. Research suggests that global\nwell-being is highest in early and later adulthood and lowest in midlife (Stone, Schwartz, Broderick, & Deaton,\n2010).\nHedonic well-being refers to the emotional component of well-being and includes measures of positive (e.g.,\nhappiness, contentment) and negative a\u0000ect (e.g., stress, sadness). The pattern of positive a\u0000ect across the adult\nlife span is similar to that of global well-being, with experiences of positive emotions such as happiness and\nenjoyment being highest in young and older adulthood. Experiences of negative a\u0000ect, particularly stress and\nanger, tend to decrease with age. Experiences of sadness are lowest in early and later adulthood compared to\nmidlife (Stone et al., 2010). Other research \u0000nds that older adults report more positive and less negative a\u0000ect\nthan middle age and younger adults (Magai, 2008; Mroczek, 2001). It should be noted that both global well-being\nand positive a\u0000ect tend to taper o\u0000 during late older adulthood and these declines may be accounted for by\nincreases in health-related losses during these years (Charles & Carstensen, 2010).\nPsychological well-being aims to evaluate the positive aspects of psychosocial development, as opposed to factors\nof ill-being, such as depression or anxiety. Ry\u0000’s model of psychological well-being proposes six core dimensions\nof positive well-being. Older adults tend to report higher environmental mastery (feelings of competence and\ncontrol in managing everyday life) and autonomy (independence), lower personal growth and purpose in life, and\nsimilar levels of positive relations with others as younger individuals (Ry\u0000, 1995). Links between health and\ninterpersonal \u0000ourishing, or having high-quality connections with others, may be important in understanding how\nto optimize quality of life in old age (Ry\u0000 & Singer, 2000).\nSuccessful Aging and Longevity\nIncreases in average life expectancy in the 20th\ncentury and evidence from twin studies that\nsuggests that genes account for only 25% of the\nvariance in human life spans have opened new\nquestions about implications for individuals and\nsociety (Christensen, Doblhammer, Rau, & Vaupel,\n2009). What environmental and behavioral factors\ncontribute to a healthy long life? Is it possible to\nintervene to slow processes of aging or to\nminimize cognitive decline, prevent dementia, and\nensure life quality at the end of life (Fratiglioni,\nPaillard-Borg, & Winblad, 2004; Hertzog, Kramer,\nWilson, & Lindenberger, 2009; Lang, Baltes, &\nWagner, 2007)? Should interventions focus on late\nlife, midlife, or indeed begin in early life?\nSuggestions that pathological change (e.g.,\ndementia) is not an inevitable component of aging\nPhysical activity is one of the pillars of successful aging. [Image:\nand that pathology could at least be delayed until\nWilliam Murphy, https://goo.gl/Khsbsb, CC BY-SA 2.0,\nthe very end of life led to theories about\nhttps://goo.gl/jSSrcO]\nsuccessful aging and proposals about targets for\nintervention. Rowe and Kahn (1997) de\u0000ned three\ncriteria of successful aging: (a) the relative\navoidance of disease, disability, and risk factors like high blood pressure, smoking, or obesity; (b) the maintenance\nof high physical and cognitive functioning; and (c) active engagement in social and productive activities. Although\nsuch de\u0000nitions of successful aging are value-laden, research and behavioral interventions have subsequently\nbeen guided by this model. For example, research has suggested that age-related declines in cognitive\nfunctioning across the adult life span may be slowed through physical exercise and lifestyle interventions (Kramer\n& Erickson, 2007). It is recognized, however, that societal and environmental factors also play a role and that\nthere is much room for social change and technical innovation to accommodate the needs of the Baby Boomers\nand later generations as they age in the next decades.\nOutside Resources\nWeb: Columbia Aging Society\nhttp://www.agingsocietynetwork.org/\nWeb: Columbia International Longevity Center\nhttp://www.mailman.columbia.edu/academic-departments/centers/columbia-aging/international-longevity-\ncenter-knowledge-transfer\nWeb: National Institute on Aging\nhttp://www.nia.nih.gov/\nWeb: Stanford Center Longevity\nhttp://longevity3.stanford.edu/\nDiscussion Questions\n1. How do age stereotypes and intergenerational social interactions shape quality of life in older adults? What\nare the implications of the research of Levy and others?\n2. Researchers suggest that there is both stability and change in Big Five personality traits after age 30. What is\nstable? What changes?\n3. Describe the Social Convoy Model of Antonucci. What are the implications of this model for older adults?\n4. Memory declines during adulthood. Is this statement correct? What does research show?\n5. Is dementia inevitable in old age? What factors are currently thought to be protective?\n6. What are the components of successful aging described by Rowe and Kahn (1998) and others? What\noutcomes are used to evaluate successful aging?\nVocabulary\nAge identity\nHow old or young people feel compared to their chronological age; after early adulthood, most people feel\nyounger than their chronological age.\nAutobiographical narratives\nA qualitative research method used to understand characteristics and life themes that an individual considers to\nuniquely distinguish him- or herself from others.\nAverage life expectancy\nMean number of years that 50% of people in a speci\u0000c birth cohort are expected to survive. This is typically\ncalculated from birth but is also sometimes re-calculated for people who have already reached a particular age\n(e.g., 65).\nCohort\nGroup of people typically born in the same year or historical period, who share common experiences over time;\nsometimes called a generation (e.g., Baby Boom Generation).\nConvoy Model of Social Relations\nTheory that proposes that the frequency, types, and reciprocity of social exchanges change with age. These social\nexchanges impact the health and well-being of the givers and receivers in the convoy.\nCross-sectional studies\nResearch method that provides information about age group di\u0000erences; age di\u0000erences are confounded with\ncohort di\u0000erences and e\u0000ects related to history and time of study.\nCrystallized intelligence\nType of intellectual ability that relies on the application of knowledge, experience, and learned information.\nFluid intelligence\nType of intelligence that relies on the ability to use information processing resources to reason logically and solve\nnovel problems.\nGlobal subjective well-being\nIndividuals’ perceptions of and satisfaction with their lives as a whole.\nHedonic well-being\nComponent of well-being that refers to emotional experiences, often including measures of positive (e.g.,\nhappiness, contentment) and negative a\u0000ect (e.g., stress, sadness).\nHeterogeneity\nInter-individual and subgroup di\u0000erences in level and rate of change over time.\nInhibitory functioning\nAbility to focus on a subset of information while suppressing attention to less relevant information.\nIntra- and inter-individual di\u0000erences\nDi\u0000erent patterns of development observed within an individual (intra-) or between individuals (inter-).\nLife course theories\nTheory of development that highlights the e\u0000ects of social expectations of age-related life events and social roles;\nadditionally considers the lifelong cumulative e\u0000ects of membership in speci\u0000c cohorts and sociocultural\nsubgroups and exposure to historical events.\nLife span theories\nTheory of development that emphasizes the patterning of lifelong within- and between-person di\u0000erences in the\nshape, level, and rate of change trajectories.\nLongitudinal studies\nResearch method that collects information from individuals at multiple time points over time, allowing\nresearchers to track cohort di\u0000erences in age-related change to determine cumulative e\u0000ects of di\u0000erent life\nexperiences.\nProcessing speed\nThe time it takes individuals to perform cognitive operations (e.g., process information, react to a signal, switch\nattention from one task to another, \u0000nd a speci\u0000c target object in a complex picture).\nPsychometric approach\nApproach to studying intelligence that examines performance on tests of intellectual functioning.\nRecall\nType of memory task where individuals are asked to remember previously learned information without the help\nof external cues.\nRecognition\nType of memory task where individuals are asked to remember previously learned information with the\nassistance of cues.\nSelf-perceptions of aging\nAn individual’s perceptions of their own aging process; positive perceptions of aging have been shown to be\nassociated with greater longevity and health.\nSocial network\nNetwork of people with whom an individual is closely connected; social networks provide emotional,\ninformational, and material support and o\u0000er opportunities for social engagement.\nSocioemotional Selectivity Theory\nTheory proposed to explain the reduction of social partners in older adulthood; posits that older adults focus on\nmeeting emotional over information-gathering goals, and adaptively select social partners who meet this need.\nSubjective age\nA multidimensional construct that indicates how old (or young) a person feels and into which age group a person\ncategorizes him- or herself\nSuccessful aging\nIncludes three components: avoiding disease, maintaining high levels of cognitive and physical functioning, and\nhaving an actively engaged lifestyle.\nWorking memory\nMemory system that allows for information to be simultaneously stored and utilized or manipulated.\nReferences\nAntonucci, T. C. (2001). Social relations: An examination of social networks, social support and sense of\ncontrol. In J.E. Birren & K. W. Schaie (Eds.), Handbook of the psychology of aging (5th ed., pp. 427–453). New\nYork: Academic Press.\nBaltes, P. B . (1987). Theoretical propositions of lifespan developmental psychology: On the dynamics\nbetween growth and decline. Developmental Psychology, 23, 611–626.\nBaltes, P. B. & Lindenberger, U. (1997). Emergence of powerful connection between sensory and cognitive\nfunctions across the adult life span: A new window to the study of cognitive aging? Psychology and Aging,\n12, 12–21.\nBirditt, K., & Antonucci, T. C. (2008). Life sustaining irritations? Relationship quality and mortality in the context\nof chronic illness. Social Science & Medicine, 67, 1291.\nBirren, J. E. & Schroots, J. J. F. (2006). Autobiographical memory and the narrative self over the life span. In J. E.\nBirren and K. Warner Schaie (Eds.) Handbook of the psychology of aging (6th ed. pp. 477–499). Burlingham,\nMA: Elsevier Academic Press.\nBlanchard-Fields, F. (2007). Everyday problem solving and emotion: An adult development perspective.\nCurrent Directions in Psychological Science, 16, 26–31.\nBronfenbrenner, U. (1979). The ecology of human development. Cambridge, MA: Harvard University Press.\nCarstensen, L. L. (1993). Motivation for social contact across the life span: A theory of socioemotional\nselectivity. In J. E. Jacobs (Ed.), Nebraska Symposium on Motivation, 1992: Developmental perspectives on\nmotivation (pp. 209–254). Lincoln, NE: University of Nebraska Press.\nCarstensen, L. L., Gottman, J. M., & Levensen, R. W. (1995). Emotional behavior in long-term marriage.\nPsychology and Aging, 10, 140–149.\nCarstensen, L. L., Isaacowitz, D. M., & Charles, S. T. (1999). Taking time seriously: A theory of socioemotional\nselectivity. American Psychologist, 54, 165–181.\nCharles, S. T., & Carstensen, L. L. (2010). Social and emotional aging. Annual review of psychology, 61, 383–409.\nCharness, N. (1981). Search in chess: Age and skill di\u0000erences.Journal of Experimental Psychology: Human\nPerception and Performance, 7, 467.\nChristensen, K., Doblhammer, G., Rau, R., Vaupel, J. W. (2009). Ageing populations: the challenges ahead.\nLancet, 374, 1196–208.\nCraik, F. I., & Bialystok, E. (2006). Cognition through the lifespan: mechanisms of change. Trends in Cognitive\nSciences, 10, 131–138.\nCraik, F. I. M. (2000). Age-related changes in human memory. In D. C. Park & N. Schwarz (Eds.), Cognitive Aging:\nA Primer (pp. 75–92). New York: Psychology Press.\nDiener, E., Lucas, R. E., & Scollon, C. N. (2006). Beyond the hedonic treadmill: revising the adaptation theory of\nwell-being. American Psychologist, 61, 305.\nElder, G. H., Johnson, M. K., & Crosnoe, R. (2003). The emergence and development of life course theory. In J.\nT. Mortimer & M. J. Shanahan (Eds.), Handbook of the Life Course, 3-19. New York: Kluwer\nAcademic/Plenum Publishers.\nFingerman, K. L., Berg, C. A., Smith, J., & Antonucci, T.C. (Eds.) (2011). Handbook of Life-Span Development. New\nYork: Springer\nFingerman, K. L., Chen, P. C., Hay, E., Cichy, K. E., & Lefkowitz, E. S. (2006). Ambivalent reactions in the parent\nand o\u0000spring relationship. The Journals of Gerontology Series B: Psychological Sciences and Social Sciences,\n61, 152-160.\nFratiglioni, L., Paillard-Borg, S., & Winblad, B. (2004). An active and socially integrated lifestyle in late life might\nprotect against dementia. Lancet Neurology, 3, 343–353\nFriedman, H. S., Tucker, J. S., Tomlinson-Keasey, C., Schwartz, J. E., Wingard, D. L., & Criqui, M. H. (1993). Does\nchildhood personality predict longevity? Journal of Personality and Social Psychology, 65, 176–185.\ndoi:10.1037/0022-3514.65.1.176\nGeorge, L. K. (2010). Still happy after all these years: Research frontiers on subjective well-being in later life.\nThe Journals of Gerontology Series B: Psychological Sciences and Social Sciences, 65, 331.\nHasher, L. & Zacks, R. T. (1988). Working memory, comprehension, and aging: A review and a new view. In\nG.H. Bower (Ed.), The Psychology of Learning and Motivation, (Vol. 22, pp. 193–225). San Diego, CA:\nAcademic Press.\nHertzog, C., Kramer, A. F., Wilson, R. S., & Lindenberger, U. (2009). Enrichment e\u0000ects on adult cognitive\ndevelopment: Can the functional capacity of older adults be preserved and enhanced? Psychological\nScience in the Public Interest, 9, 1–65\nKahn, R. L., & Antonucci, T. C. (1980). Convoys over the life course: Attachment, roles, and social support. In P.\nB. Baltes & O. G. Brim (Eds.), Life-span development and behavior (pp. 253–286). New York: Academic Press.\nKramer, A. F. & Erickson, K. I. (2007). Capitalizing on cortical plasticity: The in\u0000uence of physical activity on\ncognition and brain function. Trends in Cognitive Sciences, 11, 342–348.\nLang, F. R., Baltes, P. B., & Wagner, G. G. (2007). Desired lifetime and end-of-life desires across ddulthood\nFrom 20 to 90: A dual-source information model. Journal of Gerontology: Psychological Sciences, 62B, 268–\n276.\nLevy, B. (2009). Stereotype Embodiment: A Psychosocial Approach to Aging. Current Directions in Psychological\nScience, 18(6), 332–336\nLucas, R. E. (2007). Adaptation and the Set-Point Model of Subjective Well-Being Does Happiness Change After\nMajor Life Events?. Current Directions in Psychological Science, 16, 75–79.\nLucas, R. E. & Donnellan, A. B. (2011). Personality development across the life span: Longitudinal analyses with\na national sample from Germany. Journal of Personality and Social Psychology, 101, 847–861\nMagai, C. (2008). Long-lived emotions. In M. Lewis, J. M. Haviland-Jones, & L. Feldman Barrett (Eds.), Handbook\nof Emotions, 376–392. New York: Guilford.\nMarkus, H., & Nurius, P. (1986). Possible selves. American Psychologist, 41, 954–969.\nMcAdams, D. P.(2006). The redemptive self: Generativity and the stories Americans live by. Research in Human\nDevelopment, 3(2-3), 81–100.\nMroczek, D. K. (2001). Age and emotion in adulthood. Current Directions in Psychological Science, 10(3), 87–90.\nPark, D. C. (2000). The basic mechanisms accounting for age-related decline in cognitive function. In D.C. Park\n& N. Schwarz (Eds.), Cognitive Aging: A Primer (pp. 3–21). New York: Psychology Press.\nPark, D. C. & Gutchess, A. H. (2000). Cognitive aging and everyday life. In D.C. Park & N. Schwarz (Eds.),\nCognitive Aging: A Primer (pp. 217–232). New York: Psychology Press.\nRoberts, B. W., & Mroczek, D. K. (2008). Personality trait change in adulthood. Current Directions in\nPsychological Science, 17, 31–35.\nRoberts, B. W., Kuncel, N., Shiner, R., N., Caspi, A., & Goldberg, L. R. (2007). The power of personality: The\ncomparative validity of personality traits, socioeconomic status, and cognitive ability for predicting\nimportant life outcomes. Perspectives on Psychological Science, 2(4), 313–345. doi:10.1111/j.1745-\n6916.2007.00047.\nRook, K. S. (1998). Investigating the positive and negative sides of personal relationships: Through a lens\ndarkly? In W. R. Cupach & B. H. Spitzberg (Eds.), The dark side of close relationships (pp. 369–393). Mahwah,\nNJ: Lawrence Erlbaum.\nRoss, M., & Wilson, A. E. (2003). Autobiographical memory and conceptions of self: Getting better all the time.\nCurrent Directions in Psychological Science, 12, 66–69.\nRowe, J. W. (2009). Facts and \u0000ctions about an aging America. Contexts, 8, 16–21.\nRowe, J. W. & Kahn, R. L. (1997). Successful aging. The Gerontologist, 37(4), 433–440.\nRubin, D., & Berntsen, D. (2006). People over 40 feel 20% younger than their age: Subjective age across the\nlifespan. Psychonomic Bulletin & Review. 13, 776–780\nRy\u0000, C. D. (1995). Psychological well-being in adult life. Current Directions in Psychological Science, 4(4), 99–104\nRy\u0000, C. D., & Singer, B. (2000). Interpersonal \u0000ourishing: A positive health agenda for the new millennium.\nPersonality and Social Psychology Review, 4, 30–44.\nSalthouse, T. A. (2004). What and when of cognitive aging. Current Directions in Psychological Science, 13, 140–\n144.\nSalthouse, T. A. (1984). E\u0000ects of age and skill in typing. Journal of Experimental Psychology: General, 113, 345.\nSchaie, K. W. & Willis, S. L. (1996). Psychometric intelligence and aging. In F. Blanchard-Fields & T.M. Hess\n(Eds.), Perspectives on Cognitive Change in Adulthood and Aging (pp. 293–322). New York: McGraw Hill.\nSettersten, R. A., Jr. (2005). Toward a stronger partnership between lifecourse sociology and life-span\npsychology. Research in Human Development, 2(1–2), 25–41.\nStone, A. A., Schwartz, J. E., Broderick, J. E., & Deaton, A. (2010). A snapshot of the age distribution of\npsychological well-being in the United States. Proceedings of the National Academy of Sciences, 107, 9985–\n9990.\nTentori, K., Osherson, D., Hasher, L., & May, C. (2001). Wisdom and aging: Irrational preferences in college\nstudents but not older adults. Cognition, 81, B87–B96.\nUchino, B. N. (2009). What a lifespan approach might tell us about why distinct measures of social support\nhave di\u0000erential links to physical health. Journal of Social and Personal Relationships, 26(1), 53–62. DOI:\n10.1177/0265407509105521\nUmberson, D., Williams, K., Powers, D. A., Liu, H., & Needham, B. (2006). You make me sick: Marital quality and\nhealth over the life course. Journal of Health and Social Behavior, 47, 1–16.\nWaite, L. J. & Gallagher, M. (2000). The case for marriage: Why married people are happier, healthier, and better\no\u0000 \u0000nancially. New York: Doubleday.\nAuthors\nTara Queen\nTara Queen is a postdoctoral research fellow at the University of Michigan's Institute for Social\nResearch. She received her PhD in Lifespan Developmental Psychology at North Carolina State\nUniversity in 2011. Her research focuses on social cognition and well-being in the context of aging and\nadult development.\nJacqui Smith\nJacqui Smith, Professor of Psychology at the University of Michigan and Research Professor at the\nInstitute for Social Research (ISR). She is a Co-PI of the Health and Retirement Study (HRS) and\ninvestigates how psychological functioning and subjective well-being change after age 50.\nCreative Commons License\nAging by Tara Queen and Jacqui Smith is licensed under a Creative Commons Attribution-NonCommercial-ShareAlike 4.0\nInternational License. Permissions beyond the scope of this license may be available in our Licensing Agreement.\nHow to cite this Noba module using APA Style\nQueen, T. & Smith, J. (2023). Aging. In R. Biswas-Diener & E. Diener (Eds), Noba textbook series: Psychology.\nChampaign, IL: DEF publishers. Retrieved from http://noba.to/gtp7r548\nAbout Privacy Terms Licensing Contact © 2023 Diener Education Fund Comments or questions?"
}