{
    "text": "Consciousness Studies/Introduction\nEveryone has their own view of the nature of consciousness based on their education and background. The\nintention of this book is to expand this view by providing an insight into the various ideas and beliefs on the\nsubject as well as a review of current work in neuroscience. The neuroscientist should find the\nphilosophical discussion interesting because this provides first-person insights into the nature of\nconsciousness and also provides some subtle arguments about why consciousness is not a simple problem.\nThe student of philosophy will find a useful introduction to the subject and information about neuroscience\nand physics that is difficult to acquire elsewhere.\nIt is often said that consciousness cannot be defined. This is not true; philosophers have indeed defined it in\nits own terms. It can be described in terms of two principal components: firstly phenomenal consciousness\nwhich consists of our experience with things laid out in space and time, sensations, emotions, thoughts, etc.,\nand secondly access consciousness which is the processes that act on the things in experience. Phenomenal\nconsciousness is much like the “perceptual space” of psychological and physiological research. It is the\nmany simultaneous events that become the space of experience in general and it is now a legitimate target\nof scientific research.\nAs will be seen in the following pages, the issue for the scientist and philosopher is to determine the\nlocation and form of the things in phenomenal consciousness and even to consider whether such a thing\ncould exist. Is phenomenal consciousness directly things in the world beyond the body, is it brain activity\nbased on things in the world and internal processes — a sort of virtual reality — or is it some spiritual or\nother phenomenon?\nA note on Naive Realism\nThe study of consciousness may seem to be esoteric or outside of the main stream but it includes some very\nreal problems in science and philosophy. The most obvious problem is how we can see anything at all.\nMany people with a smattering of geometry tend to believe that they have a 'point eye' that sees the world,\nand this idea is known as perceptual \"Naive Realism\". Physical considerations show that this idea is highly\ncontentious; we have two eyes with different images in each, normally the only images in the world are\ncreated by optical instruments such as the eye, and the photons that carry light to the observer cannot and\ndo not all converge at a single point. Some of the discrepancies between the physical reality and our\nexperience are shown in the illustrations.\nThe naive realist idea of perception involves a point eye\nlooking at a geometrical form. But the physics is different; there are two eyes with sometimes very different\nimages in each. Light is refracted over the entire area of the cornea and directed over the entire area of the retina - there is no 'point eye'.\nThe cloud of photons that compose light must get in the way of the view but naive realism neglects this,\nregarding the photons as somehow transparent yet gathering as an impossible group of millions of photons\nin a viewing point.\nLight rays go everywhere, it is only after light has passed through an optical instrument such as the eye that\nan image is formed. Hold up a sheet of paper - there are no images on it.\nThe illustrations show the nature of one of the most difficult problems studied by\nneuroscience: how can the images on the two retinas become experience? How\ncan we imagine things or experience dreams and hallucinations? Studies on the\nneural basis of binocular rivalry and MRI studies of imagination are leading the\nway in our comprehension of these problems but there is still no physical theory\nthat is congruent with sensory experience. The problem of binding also takes\nus further from Naive Realism; we experience speech at the mouth of the speaker\neven though we might be listening through headphones, how is sound, touch etc.\nbound to vision? The objective of the scientific study of consciousness is to\ndiscover how we convert data from the world into our experience.\nA degree of Naive Realism is a sensible idea for coping with the everyday problems of working and living.\nMost physical scientists and people in general are, to some extent, Naive Realists until they study the\nbiology of sensation and the problems of perception and consciousness. There is often a suspicion, or even\nfear, amongst Naive Realists that any analysis of conscious experience is a suggestion that the world does\nnot exist or everything is imaginary. These fears are unfounded: Neuroscience is a study of the part of the\nphysical world represented by brain activity and is part of medicine.\nIntended audience and how to read this book\nThis book is intended as a complementary text for neuroscience and philosophy degree courses. The book\nis divided into four parts. If you are not interested in some part, skip to the next. The first part is a detailed\nhistorical review of the philosophy of phenomenal consciousness. The second part is a discussion of\nphilosophical theories, it is intended to be challenging and even irritating. Philosophy undergraduates are\nencouraged to criticise and react to this part. The third part is a review of the neuroscience of consciousness\nand is suitable for undergraduate studies in the field. The end of the book is a discussion of theories of\nconsciousness.\nBeing freely available to all students the book can serve as a source for seminars even if you disagree with\nthe content i.e.: “Why is (a given section) an oversimplification/biased/out of date etc.?”\nThe text covers a difficult area that straddles the humanities and science faculties. It is probably more\noriented towards the scientist who needs a scientific insight into philosophical theory rather than vice versa.\nIt is suitable as a supplementary text for the following undergraduate modules, units and courses:\nNeurophysiology/Neurobiology modules (physiology of perception, physiology of\nconsciousness, neuronal basis of consciousness)\nNeuropsychology modules\nNeuroanatomy modules\nCognitive psychology/Cognitive science\nPsychology of consciousness\nPsychology - behaviourism vs cognitivism debate Philosophy of mind and metaphysics\nComputing - Artificial intelligence and consciousness\nConsciousness studies courses\nThis is a “Wikibook” and, in this edition, has more breadth than depth. In some areas, particularly in the\nhuge field of the philosophy of consciousness, topics are introduced and the obvious flaws or successes\npointed out but a fully referenced, in-depth treatment is sometimes absent at this stage. We need your help\nand contributions from scholars in the field are invited. Please contribute but please, at the very least, scan\nthe book first to ensure that your prospective contribution has not been included already! In particular\ncontributors who wish to write “all self respecting scientists think that the brain is a digital computer”\nshould read the section on information theory and add their contribution to the section on the possibility of\nconscious digital computers.\nRetrieved from \"https://en.wikibooks.org/w/index.php?title=Consciousness_Studies/Introduction&oldid=3230930\"\nThis page was last edited on 14 June 2017, at 22:29.\nText is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. By using\nthis site, you agree to the Terms of Use and Privacy Policy."
}