{
    "text": "1\nWhat Is Human Sexuality?\nLearning Objectives\nTHE SCIENCE OF HUMAN SEXUALITY\nLO 1 Defi ne the science of human sexuality\nSEXUALITY AND VALUES\nLO 2 Defi ne the value systems people use in making sexual decisions\nTHINKING CRITICALLY ABOUT HUMAN SEXUALITY\nLO 3 Explain how you can become a critical thinker\nPERSPECTIVES ON HUMAN SEXUALITY\nLO 4 Discuss the historical perspective on human sexuality\nLO 5 Describe the biological perspective on human sexuality\nLO 6 Describe the evolutionary perspective on human sexuality\nLO 7 Describe the cross-species perspective on human sexuality\nLO 8 Describe sociological perspectives on human sexuality\nLO 9 Describe psychological perspectives on human sexuality\nLO 10 Discuss feminist theory\nLO 11 Discuss queer theory\nLO 12 Explain why it is useful to look upon human sexuality from multiple\nperspectives\nMY LIFE, MY SEXUALITY: THINKING CRITICALLY ABOUT SEXUAL ADVICE ON\nTHE INTERNET: ARE THERE ANY QUICK FIXES?\nsex, n. sex, v. sex, adj.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd xxxxvvii 1122//1199//1122 1100::4400 AAMM Adolescent\nSexuality\nExplore the video, Adolescent Sexuality, by scanning this\nQR code with your mobile device. If you don’t already have\none, you may download a free QR scanner for your device\nwherever smartphone apps are sold. You can also view this\nvideo in MyDevelopmentLab. For more videos related to\nthis chapter’s content, log into MyDevelopmentLab to view\nthe entire Human Sexuality Video Series.\nTRUTH OR FICTION? T\nF\nWhich of the following statements are the truth and which are fiction? You will find the\nanswers as you read this chapter.\n1 Scientific knowledge will enable you to make the right sexual decisions. T F?\n2 In ancient Greece, a mature man would take a sexual interest in an\nadolescent boy, often with the blessing of the boy’s parents. T F?\n3 Throughout most of human history, women were considered to\nbe the property of their husbands. T F?\n4 The production of sex manuals originated in modern\ntimes. T F?\n5 The graham cracker came into being as a means for helping\nyoung men control their sexual appetites. T F?\n6 Female redback spiders eat their mates after the females have been\ninseminated. T F?\n7 In our dreams, airplanes, bullets, snakes, sticks, and similar objects\nsymbolize the male genitals. T F?\n1\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 11 1122//1199//1122 1100::4400 AAMM 2 CHAPTER 1 What Is Human Sexuality?\nLet’s Google the islands off the coast of Europe and During intercourse, the man lies on top. He is always the\nin the South Pacific—both in space and time. We go initiator. Foreplay is brief. The man ejaculates as fast as he\nto Google Maps, find Inis Beag, click on the satellite can, in the belief that he is the only partner with sexual needs\nimage, further click on 1955 (no, you can’t really do this— and to spare his wife as best he can. Then he turns over and\nyet), and swoop in … falls asleep. Once more the couple have done their duty.\nAnd suddenly we find ourselves visiting two islands that On to Mangaia, which is a pearl of an island. It lies on\nare a world apart—sexually as well as geographically. Our the other side of the world from Inis Beag—in more ways\nfirst stop is Inis Beag, which lies in the Atlantic, off the misty than one. From an early age, Mangaian boys and girls are\ncoast of Ireland. Our second stop will be Mangaia, which lifts encouraged to get in touch with their own sexuality through\nlanguidly out of the blue waters of the Pacific. sexual play and masturbation. At about the age of 13,\nThe distant satellite image shows Inis Beag as a green Mangaian boys are initiated into manhood by adults who\njewel, fertile and inviting. The residents of this community instruct them in sexual techniques.\ndo not believe that it is normal for women to experience Boys practice their new techniques with girlfriends on\norgasm. Anthropologists have reported that any woman who secluded beaches or beneath the listing fronds of palms.\nfinds pleasure in sex—especially the intense waves of plea- They may visit girlfriends in huts where they sleep with their\nsure that can accompany orgasm—is viewed as deviant. families. Parents often listen for their daughters to laugh and\nPremarital sex is all but unknown on Inis Beag. Prior to gasp so that they will know that they have reached orgasm\nmarriage, men and women socialize apart. Marriage comes with a visiting young “sleepcrawler.” Parents often pretend\nlate—usually in the middle 30s for men and the middle 20s to be asleep so as not to interfere with courtship and impede\nfor women. Mothers teach their daughters that they will have their daughters’ chances of finding a mate. Daughters may\nto submit to their husbands’ animal cravings in order to obey receive a nightly succession of sleepcrawlers and have mul-\nGod’s injunction to “be fruitful and multiply.” tiple orgasms with each one.\nBut the women of Inis Beag need not be overly con- Mangaians look on virginity with disdain, because virgins\ncerned about frequent sex, since the men of the island do not know how to provide sexual pleasure. Thus, the older\nbelieve, erroneously, that sexual activity will drain their male makes his contribution by initiating the girl.\nstrength. Consequently, men avoid sex on the eve of sport- Mangaians expressed concern when they learned that\ning activity or strenuous work. Because of taboos against many Western women do not regularly experience orgasm.\nnudity, married couples have sex with their undergarments Orgasm is apparently universal among Mangaian women.\non. Intercourse takes place in the dark—literally as well as Therefore, Mangaians could only assume that Western\nfiguratively. women suffered from some abnormality of the sex organs.\nMangaia. Perhaps they didn’t wear coconut shells, but a generation or so ago, sex on\nMangaia was free wheeling. In other places and at other times, sex has been seen as a\nnecessary evil to follow God’s command to “be fruitful and multiply.”\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 22 1122//1199//1122 1100::4400 AAMM The Science of Human Sexuality? 3\nThe residents of Inis Beag and Mangaia have similar anatomical features\nbut vastly different attitudes toward sex. Their cultural settings influence\ntheir patterns of sexual behavior and the pleasure they gain—or fail to\ngain—from sex. Sex may be a natural function, but few natural functions have\nbeen influenced so strongly by religious and moral beliefs, cultural tradition,\nfolklore, and superstition.\nWe are about to embark on the study of human sexuality. But why study human\nsexuality? Isn’t sex something to do rather than to talk about? Isn’t sex a natural\nfunction? Don’t we learn what we need to know from personal experience or from\nour parents or our friends?\nYes. And no. We can learn how our bodies respond to sexual stimulation\nthrough personal experience, but experience teaches us little about the biology of\nsexual response and orgasm. Nor does experience inform us about the variations\nin sexual behavior that exist around the world. Experience does not prepare us to\nrecognize the signs of sexually transmitted infections (STIs) or to evaluate the risks\nof pregnancy. What many of us learned about sex from our parents can probably be\nsummarized in a single word: “Don’t.” The information we received from our friends\nwas probably riddled with exaggeration, even lies. Many young people today receive\naccurate information through sex education courses in the schools, but they are usu-\nally taught about STIs and contraception, not about sexual techniques.\nYou may know more about human sexuality than your parents or grandparents\ndid at your age, or do today. But how much do you really know? What causes an\nerection or vaginal lubrication? What factors determine sexual orientation? What\nare sexual dysfunctions and what causes them? How do our sexual responsiveness\nand interests change as we age? Can you contract a sexually transmitted infection\nand not know it? If you have no symptoms, can you infect others?\nThese are just a few of the issues we will explore in this book . One feature of\nthis text, “Real Students, Real Questions,” illustrates some of the questions and\nerroneous ideas many of us have about sex. Watch the Video\nGender versus Sex:\nFlorence Denmark\non MyDevelopmentLab\nReal Students, Real Questions\nQ I am 17 years old, and the topic of sex in my f amily is\nnonexistent. How do I begin a c onversation with my\nfamily?\nA Most people find it difficult to talk about sex. Y ou’ll find\nideas for initiating conversations about sex with family\nmembers and other people throughout this text—con-\nversations about contraception, STIs, and problems in\nrelationships. In all cases, think about selecting a good\ntime and place to talk. Consider asking permission to\ntalk about a sensitive topic, as in “I know that talking\nabout birth control is a no-no in this house, but I have\nsome questions. Can we talk about them?” Or, “I could\nuse some help. Can we talk about it?” People who care\nabout you might just surprise you by accepting the\nchallenge of trying to communicate about topics that\ncan be off-limits. If you desire parental help, you might\nthink about catching the more receptive parent when\nhe or she is alone.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 33 1122//1199//1122 1100::4400 AAMM 4 CHAPTER 1 What Is Human Sexuality?\nThe Science of Human Sexuality?\nWhat is human sexuality? This is not a trick question. Consider the meaning, or\nrather meanings, of the word sex . One use of the term sex refers to our anatomic\nsex, male or female. The words s ex or sexual are also used to refer to anatomic\nstructures, called sex organs or sexual organs, that play a role in reproduction or\nsexual pleasure. We may also speak of sex when referring to physical activities\ninvolving our sex organs for purposes of reproduction or pleasure, as in h aving sex .\nSex also relates to erotic feelings, experiences, or desires, such as sexual fantasies\nand thoughts, sexual urges, or feelings of sexual attraction.\nMany researchers reserve the word s ex for reference to anatomic or biological\ncategories, but prefer the word g ender when they are referring to social or cul-\ntural categories. For example, one might say that “reproductive anatomy appears\nto depend on the s ex (not the g ender ) of the individual, but in so-called traditional\nsocieties, g ender roles (not sex roles ) are often seen as polar opposites.”\nThe term human sexuality refers to the ways in which we experience and express\nourselves as sexual beings. Our awareness of ourselves as females or males is part of\nour sexuality, as is the capacity we have for erotic experiences and responses. Our\nWatch the Video knowledge of the gender roles in our culture also has a profound influence on us.\nThe Big Picture: The Power of Sex\non MyDevelopmentLab\nTHE STUDY OF HUMAN SEXUALITY\nThe study of human sexuality draws on the scientific expertise of anthropologists,\nbiologists, medical researchers, sociologists, and psychologists, to name some of the\nprofessional groups involved in the field. These disciplines all make contributions,\nbecause human sexuality reflects biological capabilities, psychological characteris-\ntics, and social and cultural influences. Biologists inform us about the physiological\nmechanisms of sexual arousal and response. Medical science teaches us about STIs\nand the biological bases of sexual dysfunctions. Psychologists examine how our\nsexual behavior and attitudes are shaped by perception, learning, thought, moti-\nvation and emotion, and personality. Sociocultural theorists examine relationships\nbetween sexual behavior and religion, race, and social class. Anthropologists focus\non cross-cultural similarities and differences in sexual behavior.\n1 T TRUTH OR FICTION REVISITED: Although science provides us with informa-\nF\ntion, it cannot make sexual decisions for us. In making sexual decisions, we also\nconsider our v alues . The Declaration of Independence endorsed the fundamental\nvalues of “life, liberty, and the pursuit of happiness”—not a bad beginning. Our\nreligious traditions also play a prominent role in shaping our values, as we see in\nthe following section.\nGender The behavioral,\ncultural, or psychological traits\nSexuality and Values\ntypically associated with one sex.\nGender roles Complex c lusters Our society is pluralistic. It embraces a wide range of sexual attitudes and values.\nof ways in which males and\nSome readers may be liberal in their sexual views and behavior. Others may be con-\nfemales are expected to behave\nservative. Some are pro-choice on abortion, others pro-life. Some approve of premar-\nwithin a given culture.\nital sex for couples who know each other casually. Others hold the line at emotional\nHuman sexuality The ways\ncommitment. Still others believe in waiting until marriage. People’s sexual attitudes,\nin which we experience and\nexperiences, and behaviors are shaped to a large extent by cultural traditions and\nexpress ourselves as sexual\nbeliefs. They influence how, where, and with whom we become sexually involved.\nbeings.\nAs noted by feminists, some of the variability in sexual behavior between males\nValues The qualities in life that\nand females reflects power rather than choice (S mith & Konik, 2011) . Throughout\nare deemed important or unim-\nhistory and in many places, for example, women have been considered the property\nportant, right or wrong, desirable\nor undesirable. of men. Even today, women are often “given away” by their fathers to their husbands.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 44 1122//1199//1122 1100::4400 AAMM Sexuality and Values 5\nLet’s consider the various value systems that people draw on in making sexual\ndecisions. Watch the Video\nSpecial Topics: Cultural Norms\nVALUE SYSTEMS FOR MAKING SEXUAL DECISIONS and Sexual Behavior\non MyDevelopmentLab\nAlthough sex is a natural function, most of us choose how, where, and with whom\nto become sexually involved. We face a wide array of sexual decisions: Whom should\nI date? When should my partner and I become sexually intimate? Should I initiate\nsexual relations or wait for my partner to approach me? Should my partner and\nI practice contraception? If so, which method? Should I use a condom to protect\nagainst STIs, or insist that my partner does? Should I be tested for HIV (the virus that\ncauses AIDS)? Should I insist that my partner be tested for HIV before we have sex?\nValue systems provide a framework for judging the moral acceptability of sexual\noptions. We often approach sexual decisions by determining whether the choices we\nface are compatible with our moral values. Our value systems—our sexual standards—\nhave many sources: parents, peers, religious training, ethnic subcultures, the larger\nculture, and our appraisal of all these influences. Value systems include legalism, situ-\national ethics, ethical relativism, hedonism, asceticism, utilitarianism, and rationalism.\nLegalism The legalistic approach formulates ethical behavior on the basis of a\ncode of moral laws derived from an external source, such as a religion. The Hebrew\nand Christian Bibles contain many examples of the moral code of the Jewish and\nChristian religions. In the Book of Leviticus (20:10–17) in the Hebrew Bible we\nfind many of the prohibitions against adultery, incest, sexual activity with people of\none’s own gender, and bestiality:\n10: And the man that committeth adultery with another man’s wife, even he\nthat committeth adultery with his neighbour’s wife, the adulterer and the adul-\nteress shall surely be put to death.\n11: And the man that lieth with his father’s wife hath uncovered his father’s naked-\nness: both of them shall surely be put to death; their blood shall be upon them.\n12: And if a man lie with his daughter in law, both of them shall surely be put\nto death: they have wrought confusion; their blood shall be upon them.\n13: If a man also lie with mankind, as he lieth with a woman, both of them\nhave committed an abomination: they shall surely be put to death; their blood\nshall be upon them.\n14: And if a man take a wife and her mother, it is wickedness: they shall be\nburnt with fire, both he and they; that there be no wickedness among you.\n15: And if a man lie with a beast, he shall surely be put to death: and ye shall\nslay the beast.\n16: And if a woman approach unto any beast, and lie down thereto, thou shalt\nkill the woman, and the beast: they shall surely be put to death; their blood\nshall be upon them.\n17: And if a man shall take his sister, his father’s daughter, or his mother’s\ndaughter, and see her nakedness, and she see his nakedness; it is a wicked thing;\nand they shall be cut off in the sight of their people: he hath uncovered his\nsister’s nakedness; he shall bear his iniquity.\n18: And if a man shall lie with a woman having her sickness, 1 and shall uncover\nher nakedness; he hath discovered her fountain, and she hath uncovered the\nfountain of her blood: and both of them shall be cut off from among their people.\n1 That is, menstruation.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 55 1122//1199//1122 1100::4400 AAMM 6 CHAPTER 1 What Is Human Sexuality?\nMany religious followers accept the moral codes of their religions as a matter\nof faith and commitment. Some people find it reassuring to be informed by religious\nauthorities or scripture that a certain course of action is right or wrong. Others,\nhowever, take a more liberal view. They say that the Bible reflects the social setting\nof the time in which it was written, not just divine inspiration. Now that population\ngrowth is exploding in many parts of the world, biblical injunctions to be fruitful\nand multiply may no longer be socially and environmentally sound. Prohibitions,\nsuch as that against sexual relations during menstruation, may have been based on\nprescientific perceptions of danger. Some people thus view religious teachings as a\ngeneral framework for decision making rather than as a set of absolute rules.\nS ituational Ethics Episcopal theologian Joseph Fletcher (1966, 1967) argued\nthat ethical decision making should be guided by love for others rather than by rigid\nmoral rules, and that sexual decision making should be based on the context of the\nsituation that the person faces. For this reason, his view is termed s ituational ethics.\nAccording to Fletcher, a Roman Catholic woman will have been taught that abor-\ntion is the taking of a human life. Her situation, however—her love for her exist-\ning family and her recognition of her limited resources for providing for another\nchild—might influence her to decide in favor of an abortion.\nFletcher argues that rules for conduct should be flexible. “The situationist is\nprepared in any concrete case to suspend, ignore, or violate any principle if by doing\nso he can effect more good than by following it” (1966, p. 34).\nEthical Relativism E thical relativism assumes that diverse values are basic to\nhuman existence. Ethical relativists reject the idea that there is a single correct moral\nview about subjects as diverse as wearing revealing clothing, masturbation, pre-\nmarital sex, oral sex, anal sex, contraception, and abortion. One person may believe\nthat premarital sex is unacceptable under any circumstances, whereas another may\nhold that “being in love” makes it acceptable. Still another person may believe that\nsex is morally permissible without an emotional commitment. The ethical relativist\nHow do you make sexual decisions? What value system or systems do you employ?\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 66 1122//1199//1122 1100::4400 AAMM Sexuality and Values 7\nbelieves that there is no objective way of justifying one set of moral values over\nanother. In this view, the essence of human morality is to derive one’s own principles\nand apply them according to one’s own conscience. Opponents of ethical relativism\nargue that allowing people free rein to determine what is right or wrong may bring\nabout social chaos and decay.\nOne form of ethical relativism is cultural relativism . From this perspective,\nwhat is right or wrong must be understood in terms of the cultural beliefs that\naffect sexual decision making. In some cultures, premarital sex is tolerated or even\nencouraged, whereas in others, it is considered immoral.\nHedonism T he hedonist is guided by the pursuit of pleasure, not by whether\na particular behavior is morally or situationally justified. “If it feels good, do it”\nexpresses the hedonistic ethic. The hedonist believes that sexual desires, like hunger\nor thirst, do not invoke moral considerations.\nAsceticism Religious celibates, such as Roman Catholic priests and Buddhist\nmonks, choose a sceticism (self-denial of material and sexual desires) in order to\ndevote themselves to spiritual pursuits. Many ascetics in Eastern and Western reli-\ngions seek to transcend physical and worldly desires.\nUtilitarianism Ethical guidelines can be based on principles other than religious\nones. The English philosopher John Stuart Mill (1806–1873) proposed an ethical\nsystem based on u tilitarianism —the view that moral conduct is based on that which\nwill bring about “the greatest good for the greatest number” (M ill, 1863) . The utili-\ntarian characterizes behavior as ethical when it does the greatest good and causes\nthe least harm. This is not the same thing as freedom of action. Utilitarians may\ncome down hard in opposition to premarital sex and bearing children out of wed-\nlock, for example, if they believe that these behavior patterns jeopardize a nation’s\nhealth and social fabric. Mill’s ethics require that we treat one another justly and\nhonestly, because it serves the greater good for people to be true to their word and\njust in their dealings with others.\nRationalism R ationalism is the use of reason to determine a course of action.\nThe rationalist believes that decisions should be based on intellect and reason rather\nthan emotions or faith. The rationalist assesses the facts in a sexual situation and\nthen weighs the consequences of various courses of action to make a decision. The\nrationalist shares with the utilitarian the belief that reasoning can lead to ethical\nReal Students, Real Questions\nQ Is a person who takes a vow of chastity, such as a nun,\nno longer considered a sexual being?\nA A person who takes a vow of chastity only promises\nnot to be a sexually active being. The reason usually\ninvolves dedication to values in which self-denial of\nsexual desires plays a key role, as in a religious t radition.\nBut this doesn’t mean that the person is no longer\na sexual being. The person remains female or male,\nand continues to be subject to the sexual drives, sexual\nhealth issues, and cultural expectations that affect\nfemales and males.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 77 1122//1199//1122 1100::4400 AAMM 8 CHAPTER 1 What Is Human Sexuality?\nT Taabbllee 11..11\nV VVaalluuee SSyysstteemmss ffoorr MMaakkiinngg SSeexxuuaall DDeecciissiioonnss\nSSyysstteemm C C oorree BBeelliieeff EE xxaammppllee\nLLeeggaalliissmm E Etthhiiccaall bbeehhaavviioorr iiss ddeerriivveedd ffrroomm aann eexxtteerrnnaall ssoouurrccee,, TThhee OOlldd TTeessttaammeenntt ccoonnttaaiinnss pprroohhiibbiittiioonnss aaggaaiinnsstt\nssuucchh aass aa rreelliiggiioonn.. aadduulltteerryy,, iinncceesstt,, sseexxuuaall aaccttiivviittyy wwiitthh ppeeooppllee ooff oonnee’’ss\noowwnn ggeennddeerr,, aanndd bbeessttiiaalliittyy..\nSSiittuuaattiioonnaall EEtthhiiccss E Etthhiiccaall ddeecciissiioonn mmaakkiinngg sshhoouulldd bbee gguuiiddeedd bbyy tthhee AA wwoommaann wwhhoo hhaass bbeeeenn ttaauugghhtt tthhaatt aabboorrttiioonn iiss tthhee\nssiittuuaattiioonn aanndd bbyy ggeennuuiinnee lloovvee ffoorr ootthheerrss.. ttaakkiinngg ooff aa hhuummaann lliiffee mmaayy ffiinndd hheerrsseellff wwiitthh lliimmiitteedd\nrreessoouurrcceess aanndd ddeecciiddee iinn ffaavvoorr ooff aann aabboorrttiioonn..\nRReellaattiivviissmm T Thheerree iiss nnoo oobbjjeeccttiivvee wwaayy ooff jjuussttiiffyyiinngg oonnee sseett ooff CCoohhaabbiittaattiioonn iiss ttoolleerraatteedd iinn ssoommee ccuullttuurreess bbuutt\nmmoorraall vvaalluueess oovveerr aannootthheerr.. ccoonnssiiddeerreedd iimmmmoorraall iinn ootthheerrss..\nHHeeddoonniissmm P Puurrssuuiitt ooff pplleeaassuurree iiss tthhee gguuiiddee.. H Heeddoonniissttss mmiigghhtt aarrgguuee tthhaatt sseexxuuaall ddeessiirreess,, lliikkee hhuunn--\nggeerr oorr tthhiirrsstt,, ddoo nnoott iinnvvoollvvee mmoorraall ccoonnssiiddeerraattiioonnss..\nAAsscceettiicciissmm O Onnee ddeenniieess sseexxuuaall ddeessiirreess ttoo ddeevvoottee oonneesseellff ttoo MMaannyy aasscceettiiccss iinn WWeesstteerrnn aanndd EEaasstteerrnn rreelliiggiioonnss sseeeekk\nssppiirriittuuaall ppuurrssuuiittss.. ttoo ttrraannsscceenndd pphhyyssiiccaall aanndd wwoorrllddllyy ddeessiirreess..\nUUttiilliittaarriiaanniissmm M Moorraall ccoonndduucctt bbrriinnggss aabboouutt tthhee ggrreeaatteesstt ggoooodd ffoorr WWee sshhoouulldd bbee hhoonneesstt aanndd jjuusstt bbeeccaauussee iitt sseerrvveess tthhee\ntthhee ggrreeaatteesstt nnuummbbeerr.. ggrreeaatteerr ggoooodd ffoorr ppeeooppllee ttoo bbee ttrruuee ttoo tthheeiirr wwoorrdd\naanndd ttrreeaatt eeaacchh ootthheerr jjuussttllyy..\nRRaattiioonnaalliissmm S Seexxuuaall ddeecciissiioonnss sshhoouulldd bbee bbaasseedd oonn iinntteelllleecctt aanndd TThhee rraattiioonnaalliisstt mmiigghhtt ddeecciiddee tthhaatt tthhee p peerrssoonnaall\nrreeaassoonn,, nnoott bblliinndd oobbeeddiieennccee.. ccoonnsseeqquueenncceess ooff ccoonnttiinnuuiinngg aann uunnhhaappppyy m maarrrriiaaggee\noouuttwweeiigghh tthhee eeffffeeccttss oonn tthhee ffaammiillyy oorr tthhee\nccoommmmuunniittyy aatt llaarrggee..\nbehavior but is not bound to the utilitarian code that makes choices on the basis of\nthe greatest good for the greatest number. The utilitarian may decide, for example,\nto prolong an unhappy marriage because of the belief that the greater good of the\nfamily and the community is better served by maintaining an unhappy marriage\nthan by dissolving it. The rationalist might decide that the personal consequences\nof continuing an unhappy marriage outweigh the consequences to the family or the\ncommunity at large.\nThese ethical systems represent general frameworks of moral reasoning or\npathways for judging the moral acceptability of sexual and nonsexual behavior.\nWhereas some of us may adopt one or another of these systems in their purest\nforms, others adopt a system of moral reasoning that involves some combination\nor variation of these ethical systems. Table 1.1 summarizes some of the value sys-\ntems in use.\nMany students will think critically about which values to apply to a given\nsituation. They may also apply critical thinking to the claims and arguments about\nhuman sexuality they come across from authority figures, colleagues, friends, and\nadvertisements. In the following section, we explore the nature of critical thinking.\nThinking Critically about\nHuman Sexuality\nWe are flooded with so much information about sex that it is difficult to separate\ntruth from fiction. Newspapers, TV shows, popular books and magazines, and the\nInternet contain one feature after another about sex. Many of them contradict one\nanother, contain half-truths, or draw unsupported conclusions.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 88 1122//1199//1122 1100::4400 AAMM Thinking Critically about Human Sexuality 9\nMost of us also tend to assume that authority figures such as doctors and\ngovernment officials provide us with factual information and are qualified to make\ndecisions that affect our lives. But when two doctors disagree on the need for breast\nsurgery, or two officials disagree as to whether condoms should be distributed in\npublic schools, how can both be correct? Critical thinkers never say, “This is true\nbecause so-and-so says that it is true.”\nTo help students evaluate claims, arguments, and widely held beliefs, most col- CRITICAL THINKING\nleges encourage critical thinking. The core of critical thinking is skepticism—taking What kinds of intellectual and\nnothing for granted. Critical thinking means being skeptical of things that are pre- interpersonal conflicts are\nsented in print, uttered by authority figures or celebrities, or passed along by friends. likely to be encountered by\nAnother aspect of critical thinking is thoughtful analysis and probing of claims and people who decide that they\nwould like to become critical\narguments. Critical thinking means scrutinizing definitions of terms and evaluating\nthinkers?\nthe premises of arguments and their logic. Critical thinkers maintain open minds.\nThey suspend their beliefs until they have obtained and evaluated the evidence.\nPRINCIPLES OF CRITICAL THINKING\nHere are some principles of critical thinking:\n1. Be skeptical. Politicians, religious leaders, and other authority figures attempt\nto convince you of their points of view. Even researchers and authors may hold\ncertain biases. Accept no opinion as fact until you have personally weighed the\nevidence.\n2. Examine definitions of terms. Some statements are true when a term is defined\nin one way but not in another. Consider the maxim, “Love is blind.” If love is\ndefined as head-over-heels infatuation, there may be substance to the statement.\nInfatuated people tend to idealize loved ones. But if love is defined as deep\ncaring and commitment based on a more realistic (if still somewhat slanted)\nappraisal of the loved one, then love is not blind—just a bit nearsighted.\n3. Examine the assumptions or premises of arguments. Consider the statement,\n“Abortion is murder.” Webster’s New World Dictionary defines murder as “the\nunlawful and malicious or premeditated killing of one human being by another.”\nThe statement is true, according to this dictionary, only if (a) the victim is a\nhuman being and (b) the act is unlawful and malicious or premeditated. Many\npro-life advocates argue that embryos and fetuses are human beings from the\nmoment of conception. Many pro-choice advocates argue that embryos and\nfetuses do not become human beings until various stages of development. Thus,\nthe judgment that abortion is murder will rest in part on one’s beliefs as to\nwhether—and when—an embryo or fetus is a human being.\n4. B e cautious in drawing conclusions from evidence. Research finds that teenagers\nwho listen to rap, hip-hop, pop, and rock music with sexually explicit lyrics—or\nwith lyrics that refer to women as sex objects—are more likely to initiate sexual\nactivity at early ages (M artino et al., 2006) . The popular media seem obsessed\nwith the idea that “dirty” songs instigate sex, and lots of it. However, teens\nwho choose to listen to these songs may differ from those who do not in their\nvalues, so that they not only spend hours with their iPods blasting sexual lyr-\nics into their ears but also choose to have sex at early ages. The evidence of an\nassociation between listening to this music and having sex is open to various\ninterpretations—which brings us to our next principle of critical thinking.\n5. Consider alternative interpretations of research evidence. For example, teens\nwho dwell on sexual song lyrics may also be more open to sexual activity\nbecause they are generally less traditional than teens who (literally) turn these\nsongs off. Correlations or associations between events do not necessarily reveal\ncause and effect.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 99 1122//1199//1122 1100::4400 AAMM 10 CHAPTER 1 What Is Human Sexuality?\nA Closer Look\nThe National Survey of Sexual Health and B ehavior:\nWho Does What with Whom?\nYou see surveys on sex all the reasonably accurate picture of what people ■ Many older people continue to have\ntime. They’re in Glamour and are willing to report. enjoyable sex lives.\nCosmopolitan . They’re reported in You’ll find a quick overview of some of\n■ Men are most likely to reach orgasm\nnewspapers and on talk shows. But what the researchers’ results in Table 1.2 . The\nwhen vaginal intercourse is involved;\nare you to believe? kinds of sexual behaviors they surveyed\nwomen are more likely to reach\nOne of the problems with most are shown across the top. The ages of the\norgasm when a variety of sexual\nsurveys on sex is the sampling. A s we’ll respondents are indicted in the column\nactivities are used, including vaginal\nsee in C hapter 2 , i f you’re trying to report on the left. Respondents are broken down\nintercourse or oral sex.\naccurately on sex in the United States, you by gender (men and women) as well as\nhave to give everyone in the country an by age. Let’s take a look at the first sexual ■ The percentage of people who have\nequal chance of participating. That never behavior in the list, masturbation, and had experience with people of the\nhappens perfectly. What if you want to see what we find. For every age group, same gender during their lives is\ninterview college students and use listed men are more likely to report masturbat- nearly double that of people who\nphone numbers to reach them? In doing ing alone in the past year than women identify themselves as being gay,\nso, you’ve just left out all students who use are. Why do you think that is so? Also, the lesbian, or bisexual.\ncell phones only. The researchers who pub- incidence of masturbation alone generally ■ The percentage of adolescents who\nlished the National Survey of Sexual Health rises through the late 20s and then begins engage in vaginal intercourse has\nand Behavior (NSSHB) took measures to to decline. How would you explain that? probably been exaggerated some-\nprevent that type of thing from happening We’ll consider possible explanations in the what in the media.\n( Reece et al., 2010) , which we’ll elaborate chapters to come.\nYou’ll find more on all these topics in\non in Chapter 2 . All in all, they surveyed The researchers also note the follow-\nthe chapters to come.\n5,865 adolescents and adults, aged 14 ing about their results:\nto 94, and derived what most researchers\n■ American adults engage in an enor-\nbelieve is a reasonably accurate snapshot\nmous variety of sexual behaviors.\nof the American population—or at least a\nTTaabbllee 11..22\nPPPeerrcceennttaaggee ooff AAmmeerriiccaannss PPeerrffoorrmmiinngg CCeerrttaaiinn SSeexxuuaall BBeehhaavviioorrss iinn tthhee PPaasstt YYeeaarr ((NN == 55886655))\nS Seexxuuaall BBeehhaavviioorrss\nA Aggee GGrroouuppss MMaassttuurrbbaatteedd M Maassttuurrbbaatteedd RReecceeiivveedd OOrraall R Reecceeiivveedd OOrraall G Gaavvee OOrraall ttoo G Gaavvee OOrraall ttoo V Vaaggiinnaall R Reecceeiivveedd PPeenniiss I Innsseerrtteedd PPeenniiss\nAAlloonnee wwiitthh PPaarrttnneerr ffrroomm WWoommeenn ffrroomm MMeenn WWoommeenn MMeenn iinntteerrccoouurrssee iinn AAnnuuss iinnttoo AAnnuuss\nM Meenn 6 622%% 5 5%% 1 122%% 1 1%% 8 8%% 1 1%% 9 9%% 1 1%% 3 3%%\n1144––1155\nW Woommeenn 4 400%% 8 8%% 11 %% 1 100%% 2 2%% 1 122%% 1 111%% 4 4%%\nM Meenn 7 755%% 1 166%% 3 311%% 3 3%% 1 188%% 2 2%% 3 300%% 1 1%% 6 6%%\n1 166––1177\nW Woommeenn 4 455%% 1 199%% 5 5%% 2 244%% 7 7%% 2 222%% 3 300%% 5 5%%\nM Meenn 8 811%% 4 422%% 5 544%% 6 6%% 5 511%% 4 4%% 5 533%% 4 4 %% 6 6%%\n1 188––1199\nW Woommeenn 6 600%% 3366%% 44%% 5 588%% 2 2%% 5 599%% 6 622%% 1 188%%\nM Meenn 8 833%% 4 444%% 6 633%% 6 6%% 5 555%% 7 7%% 6 633%% 5 5%% 1111%%\n2 200––2244\nW Woommeenn 6644%% 3366%% 9 9%% 7700%% 9 9%% 7 744%% 8 800%% 2233%%\nM Meenn 8 844%% 4 499%% 7 777%% 5 5%% 7744%% 5 5%% B BSS%% 4 4%% 2 277%%\n2 255––2299\nW Woommeenn 7722%% 4488%% 3 3%% 7722%% 3 3%% 7 766%% 8 877%% 2211%%\nM Meenn 8 800%% 4 455%% 7 788%% 6 6%% 6699%% 5 5%% 8 855%% 3 3%% 2 244%%\n3 300––3399\nW Woommeenn 6633%% 4433%% 5 5%% 5599%% 4 4%% 5 599%% 7 744%% 2222%%\nM Meenn 7 766%% 3 388%% 6 622%% 6 6%% 5577%% 7 7%% 7 744%% 4 4%% 2 211%%\n4 400––4499\nW Woommeenn 6 655%% 3 355%% 2 2%% 5 522%% 3 3%% 5 533%% 7 700%% 1 122%%\nM Meenn 7 722%% 2 288%% 4 499%% 8 8%% 4 444%% 8 8%% 5 588%% 5 5%% 1 111%%\n5 500––5599\nW Woommeenn 5 544%% 1 188%% 1 1%% 3 344%% 1 1%% 3 366%% 5 511%% 6 6%%\nM Meenn 6 611%% 1 177%% 3 388%% 3 3%% 3 344%% 3 3%% 5 544%% 1 1%% 6 6%%\n6 600––6699\nW Woommeenn 4477%% 1133%% 1 1%% 2 255%% 1 1%% 2 233%% 4 422%% 4 4%%\nM Meenn 4 466%% 1 133%% 1 199%% 2 2%% 2 244%% 3 3%% 4 433%% 2 2%% 2 2%%\n7700++\nW Woommeenn 3333%% 55%% 2 2%% 8 8%% 2 2%% 7 7%% 2 222%% 1 1%%\nSSoouurrccee:: CCeenntteerr ffoorr SSeexxuuaall HHeeaalltthh PPrroommoottiioonn.. ((22001111)).. NN aattiioonnaall SSuurrvveeyy ooff SSeexxuuaall HHeeaalltthh aanndd BBeehhaavviioorr ((NNSSSSHHBB)). . IInnddiiaannaa UUnniivveerrssiittyy,, BBlloooommiinnggttoonn:: SScchhooooll ooff HHeeaalltthh,, PPhhyyssiiccaall EEdduuccaattiioonn,, aanndd RReeccrreeaattiioonn..\nh httttpp::////wwwwww..nnaattiioonnaallsseexxssttuuddyy..iinnddiiaannaa..eedduu//ggrraapphh..hhttmmll ((AAcccceesssseedd FFeebbrruuaarryy 2222,, 22001122))\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1100 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 11\n6. Consider the kinds of evidence on which conclusions are based. Some conclu-\nsions, even seemingly “scientific” conclusions, are based on anecdotes and per-\nsonal endorsements. They are not founded on sound research.\n7. Do not oversimplify. Consider the statement, “Homosexuality is inborn.”\nThere is some evidence that sexual orientation may involve inborn predispo-\nsitions, such as genetic influences. However, biology is not destiny in human\nsexuality. Gay male, lesbian, and heterosexual sexual orientations appear to\ndevelop as the result of a complex interaction of biological and environmental\nfactors.\n8. Do not overgeneralize. Consider the belief that gay males are effeminate and\nlesbians are masculine. Yes, some gay males and lesbians fit these stereotypes.\nHowever, many do not. Overgeneralizing makes us vulnerable to accepting\nstereotypes.\nPerspectives on Human Sexuality\nHuman sexuality is a complex topic. No single theory or perspective can capture\nall its nuances. In this book we explore human sexuality from many perspectives.\nIn this section we introduce a number of them—historical, biological, evolution-\nThe “Venus of Willendorf.”\nary, cross-species, cross-cultural, psychological, and sociocultural. W e draw on these\nThis ancient figurine is\nperspectives in subsequent chapters. believed to be a fertility\nsymbol.\nTHE HISTORICAL PERSPECTIVE\nHistory places sexual attitudes and behavior in context. It informs us as to whether\nsexual behavior reflects trends that have been with us through the millennia or the\ncustoms of a particular culture and era. History shows little evidence of universal\nsexual trends. Attitudes and behaviors vary extensively from one time and place\nto another. Contemporary American society may be permissive when compared\nto the Victorian and post–World War II eras. Yet it looks staid when compared\nto the sexual excesses of some ancient societies, such as the ruling class of\nancient Rome. History also shows how religion has been a major influ-\nence on sexual values and behavior. Let us trace some historical changes\nin attitudes toward sexuality. We begin by turning the clock back 20,000\nto 30,000 years, to the days before written records were kept—that is, to\nprehistory.\nPrehistoric Sexuality: From Female Idols to Phallic\nWorship I nformation about life among our Stone Age ancestors is\ndrawn largely from cave drawings, stone artifacts, and the customs of\nmodern-day preliterate peoples whose existence has changed little over\nthe millennia. From such sources, historians and anthropologists infer\na prehistoric division of labor. By and large, men hunted for game, and\nwomen tended to remain close to home. Women nurtured children and\ngathered edible plants and nuts, crabs, and other marine life that wandered\nalong the shore or swam in shallow waters.\nArt produced in the Stone Age suggests the worship of women’s ability\nto bear children and perpetuate the species ( Fichner-Rathus, 2013) . Primitive\nstatues and cave drawings portray women with large, pendulous breasts, rounded\nhips, and prominent sex organs. Most theorists regard the figurines as fertility\nsymbols. Stone Age people may have been unaware of the male’s contribution to\nreproduction.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1111 1122//1199//1122 1100::4400 AAMM 12 CHAPTER 1 What Is Human Sexuality?\nAs the glacial sheets of the last Ice Age retreated (about 11,000 BCE) and the\nclimate warmed, human societies turned agrarian. Hunters and gatherers became\nfarmers and herders. Villages sprang up around fields. Men tended livestock. Women\nfarmed. As people grew aware of the male role in reproduction, p hallic worship\n(worship of the penis) sprang into being. Knowledge of paternity is believed to have\ndeveloped around 9000 BCE, resulting from observation of livestock. When people\nbegan to observe animals throughout the years, they also began to understand that\na predictable period of time elapsed between copulation and the birth of offspring.\nThe penis became glorified in art as a plough, ax, or sword. Phallic symbols\nplayed roles in religious ceremonies in ancient Egypt. The ancient Greeks sometimes\nrendered phalluses as rings, sometimes as necklaces. In ancient Rome, a large phal-\nlus was carried like a float in a parade honoring Venus, the goddess of love.\nThe incest taboo may have been the first human taboo. All human societies\napparently have some form of incest taboo, but societies have varied in terms of its\nstrictness. Brother–sister marriages were permitted among the presumably divine\nrulers of ancient Egypt and among the royal families of the Incas and of Hawaii,\neven though they were generally prohibited among commoners. Father–daughter\nmarriages were permitted among the aristocracy and royalty of ancient Egypt.\nIncestuous relationships in these royal blood lines may have kept wealth and power,\nas well as “divinity,” in the family.\nThe Ancient Hebrews The ancient Hebrews viewed sex, at least in marriage,\nas a satisfying experience intended to fulfill the divine command to “be fruitful and\nmultiply.” The emphasis on the procreative function of sex led to some interest-\ning social customs. For example, childlessness and the development of a repulsive\nabnormality, such as a boil, were grounds for divorce. Male–male and female–female\nsexual behavior were strongly condemned, as they threatened the perpetuation of\nthe family.\nThe ancient Hebrews believed that sex helped strengthen marital bonds and\nsolidify the family. But it would be inaccurate to ignore the fact that according to\nthe Hebrew Bible, the prophet Abraham had several wives and concubines, and\nKing Solomon had several hundred. In any event, Jewish law legislated the mini-\nmum frequency of marital relations, which varied according to the man’s profession\nand the amount of time spent at home:\nEvery day for those who have no occupation, twice a week for laborers, once\na week for ass-drivers; once every thirty days for camel drivers; and once every\nsix months for sailors.\n—Mishnah Ketubot 5:6; Ketubot 62b–62b\nAccording to the Book of Proverbs, a good wife rises before dawn to tend to\nher family’s needs, brings home food, instructs the servants, tends the vineyards,\nmakes the clothes, keeps the ledger, helps the needy, and works well into the night.\nEven so, a wife was considered the property of her husband and could be divorced\non a whim. A wife could also be stoned to death for adultery, but she might have to\nPhallic worship Worship of the\nshare her husband with secondary wives and concubines. Men who consorted with\npenis as a symbol of generative\nthe wives of other men were considered to have violated the property rights of those\npower.\nmen and might have to pay for “damages.”\nPhallic symbol An image of the\nIn case the notion that a woman is a man’s property sounds ancient to you, we\npenis.\nmust note that in many cultures it remains current. For example, in Afghanistan\nIncest taboo The p rohibition\nsome fathers have given other men their daughters as payment for gambling debts\nagainst intercourse and\n( Bearak, 2006) . And Zambian judge Alfred Shilibwa ordered a hotel employee,\nreproduction among close\nObert Siyankalanga, to pay a woman’s husband $300 in compensation after he\nblood relatives.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1122 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 13\nfondled her breasts (“Man pays victim’s husband,” 2000). The woman had been\nironing at the time. She explained the scars on Obert’s face and head: “I clobbered\nhim on the head with the iron.” Because Obert was the woman’s supervisor, the\njudge also convicted him of sexual harassment.\nThe Ancient Greeks T he classical or golden age of Greece lasted from about\n500 to 300 BCE. Within this relatively short span lived the philosophers Socrates,\nPlato, and Aristotle; the playwrights Aristophanes, Aeschylus, and Sophocles; the natu-\nral scientist Archimedes; and the lawgiver Solon. Like the Hebrews, the Greeks valued\nfamily life, but Greek men also admired the well-developed male body and enjoyed\nnude wrestling in the arena. Erotic encounters and off-color jokes characterized the\nplays of Aristophanes and other playwrights. The Greeks held that the healthy mind\nmust dwell in a healthy body. They cultivated muscle and movement along with mind.\nThe Greeks viewed their gods—Zeus, god of gods; Apollo, who inspired art and\nmusic; Aphrodite, the goddess of carnal love whose name is the basis of the word\naphrodisiac; and others—as voracious seekers of sexual variety. Not only were they\nbelieved to have sexual adventures among themselves but they were also thought to\nhave seduced mortals.\nThree aspects of Greek sexuality are of particular interest to our study of\nsexual practices in the ancient world: male–male sexual behavior, pederasty, and\nMany Ancient Greek\nCeramics Depict Male–Male\nSexual Activity. The ancient\nGreeks believed that males\nwere bisexual. In Homer’s\nIliad, brought to the silver\nscreen as Troy, Achilles is\nspurred to battle by the killing\nof his lover Patroclus. The film,\nhowever, glossed over this\nmotive by emphasizing the\nfamily relationship between\nthe two.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1133 1122//1199//1122 1100::4400 AAMM 14 CHAPTER 1 What Is Human Sexuality?\nprostitution. The Greeks viewed people as b isexual . Male–male sex was deemed\nnormal and tolerated so long as it did not threaten the institution of the family.\nPederasty means love of boys. Sex between men and prepubescent boys was illegal,\nbut families were generally pleased if their adolescent sons attracted socially prominent\n2 T mentors. TRUTH OR FICTION REVISITED: Men in ancient Greece might take on an\nF\nadolescent male as a lover and pupil. Pederasty did not impede the boy’s future male–\nfemale functioning, because the pederast himself was usually married, and Greeks\nbelieved people to be equally capable of male–female and male–male sexual activity.\nProstitution flourished at every level of society. Prostitutes ranged from refined\ncourtesans to c oncubines , who were usually slaves. Courtesans could play musical\ninstruments, dance, engage in witty repartee, and discuss politics. They were also\nskilled in the arts of love. No social stigma was attached to visiting a courtesan. At\nthe lower rungs of society were streetwalkers and brothel prostitutes. The latter\nwere not hard to find: A wooden or painted penis invariably stood by the door.\nThe women of Athens had no more rights than slaves. They were subject to\nthe authority of their male next-of-kin before marriage and to their husbands after-\nwards. They received no formal education and were consigned mostly to women’s\nquarters in their homes. They were chaperoned when they ventured out of doors.\nA husband could divorce his wife without cause and was obligated to do so if she\n3 T committed adultery. T RUTH OR FICTION REVISITED: Women in the ancient world\nF\nwere treated as property.\nThe World of Ancient Rome Much is made of the sexual excesses of\nthe Roman emperors and ruling families. Julius Caesar is reputed to have been\nbisexual—“a man to every woman and a woman to every man.” Other emper-\nors, such as Caligula, sponsored orgies at which guests engaged in sexual practices\nincluding bestiality and sadism . Sexual excesses were found more often among the\nupper classes of palace society than among average Romans, however.\nRomans disapproved of male–male sexual behavior as a threat to the integrity\nof the Roman family. The family was viewed as the source of strength of the empire.\nBisexual Sexually responsive to\nAlthough Roman women were more likely than their Greek counterparts to share\neither gender.\ntheir husbands’ social lives, they still were the property of their husbands.\nPederasty Sexual love of boys.\nWestern society traces the roots of many of its sexual terms to Roman cul-\nCourtesan A prostitute—espe- ture, as indicated by their Latin roots. F ellatio , for example, derives from the Latin\ncially the mistress of a noble or\nfellare, meaning “to suck.” C unnilingus derives from c unnus, meaning “vulva,” and\nwealthy man.\nlingere, “to lick.” Fornication derives from f ornix, an arch or vault. The term stems\nConcubine A secondary wife, from Roman streetwalkers’ practice of serving their customers in the shadows of\nusually of inferior legal and social\narchways near public buildings such as stadiums and theaters.\nstatus.\nBestiality Sexual relations The Early Christians C hristianity emerged within the Roman Empire during\nbetween a person and an animal. the centuries following the death of Jesus. Early Christian views on sexuality were\nlargely shaped by Saint Paul and the church fathers in the first century and by Saint\nSadism The practice of achiev-\ning sexual gratification through Augustine in the latter part of the fourth century. Adultery and fornication were\nhurting or humiliating others. rampant among the upper classes of Rome at the time, and early Christian leaders\nbegan to associate sexuality with sin (M acCulloch, 2011) .\nFellatio A sexual activity involv-\ning oral contact with the penis. In replacing the pagan values of Rome, the early Christians, like the Hebrews,\nsought to restrict sex to marriage. They saw temptations of the flesh as distractions\nCunnilingus A sexual activity\nfrom spiritual devotion. Paul preached that celibacy was closer to the Christian\ninvolving oral contact with the\nfemale genitals. ideal than marriage. He recognized that not everyone could achieve celibacy, how-\never, so he said that it was “better to marry than to burn” (with passion, that is).\nFornication Sexual intercourse\nChristians, like Jews before them, demanded virginity of brides (M acCulloch,\nbetween people who are not\nmarried to one another. 2011 ). Prostitution was condemned. Christians taught that men should love their\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1144 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 15\nwives with restraint, not passion. The goal of procreation should govern sexual\nbehavior—the spirit should rule the flesh. Divorce was outlawed. Unhappiness with\none’s spouse might reflect sexual, thus sinful, restlessness. Dissolving a marriage\nmight also jeopardize the social structure that supported the church. Masturbation,\nmale–male sexual behavior, female–female sexual behavior, oral–genital contact,\nanal intercourse—all were viewed as abominations in the eyes of God, as in Leviticus.\nSaint Augustine (353–430 CE) associated sexual lust with the original sin of Adam\nand Eve in the Garden of Eden. Lust and shame were passed down through the genera-\ntions. Lust made any sexual expression, even in marriage, inherently evil. Only through\ncelibacy, according to Augustine, could men and women attain a state of grace.\nIslam\nThe Seraglio of the sultan of the Ottoman Empire housed about 1,600 vir-\ngins, each hoping to be chosen for one night of honor. The sultan makes [the\nMormon] Brigham Young, who had only a few dozen wives, look like a piker.\n( Bentley, 2009 )\nIslam, the dominant religion in the Middle East, across North Africa and into\nparts of Southern Asia, was founded by the Prophet Muhammad. Muhammad was\nborn in what is now Saudi Arabia, in about 570 CE. The Islamic\ntradition treasures marriage and sexual fulfillment in marriage.\nPremarital sex and adultery invite shame and social condemna-\ntion—and, in some fundamentalist Islamic states, the death penalty,\nby stoning.\nMuhammad decreed that marriage represents the road to vir-\ntue. Islamic tradition permits a sexual double standard, however.\nMen under most circumstances may take up to four wives (we saw\nthat the sultan of the Ottoman Empire had a few more), but women\nare permitted only one husband. Public social interactions between\nmen and women are severely restricted in more conservative Islamic\nsocieties. Women are expected to keep their heads and faces veiled in\npublic and to avoid all contact with men other than their husbands.\nIndia P erhaps no culture has cultivated sexual pleasure as a spiri-\ntual ideal to the extent of the ancient Hindus of India. From the\nfifth century CE onward, temples show sculptures of gods, nymphs,\nand ordinary people in erotic poses. Hindu sexual practices were\ncodified in a sex manual, the K ama Sutra, which illustrates sexual\npositions, some of which would challenge a contortionist. It also\nholds recipes for alleged aphrodisiacs. This manual is believed to\nhave been written by the Hindu sage Vatsyayana sometime between\nthe third and fifth centuries CE, at about the time that Christianity\nwas ascending in the West.\nIn its graphic representations of sexual positions and practices,\nthe Kama Sutra reflected the Hindu belief that sex was a religious\nduty, not a source of shame or guilt. Hindu deities were often por-\ntrayed as engaging in same-sex as well as male–female sexual activ-\nAn Illustration from the Kama Sutra. The Kama\nities. In the Hindu doctrine of karma (the passage of souls from\nSutra, an Indian sex manual believed to have\none place to another), sexual fulfillment was regarded as one way been written sometime between the third and\nto become reincarnated at a higher level of existence. Indian soci- fifth centuries CE, contained graphic illustrations\nety grew more restrictive toward sexuality after about 1000 CE. of sexual techniques and pratices.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1155 1122//1199//1122 1100::4400 AAMM 16 CHAPTER 1 What Is Human Sexuality?\nThe Far East\nSecond century sex manuals … describe the beautiful bodies—“supple like\ngrass”—of dancing girls, who “put forth all their charms so that one forgets\nlife and death.” ( B entley, 2009)\nIn the cultures of the Far East, sexuality was akin to spirituality. To the Taoist\nmasters of China, who influenced Chinese culture for millennia, sex was a sacred\nduty—a form of worship that led toward harmony with nature and immortality.\n4 T TRUTH OR FICTION REVISITED: It is not true that the production of sex manuals\nF\noriginated in modern times. The Chinese culture was the first to produce a detailed\nsex manual, which came into use about 200 years before the birth of Jesus. The man\nwas expected to extend intercourse as long as possible to absorb more of his wife’s\nnatural essence, or yin. Yin would enhance his own masculine essence, or yang.\nMoreover, he was to help bring his partner to orgasm so as to increase the flow of\nenergy that he might absorb.\nTaoists believed that it was wasteful for a man to “spill his seed.” Masturbation,\nacceptable for women, was ruled out for men. Sexual practices such as anal intercourse\nand oral–genital contact (fellatio and cunnilingus) were permissible, so long as the man\ndid not squander yang through wasteful ejaculation. Same-sex activity was not pro-\nhibited by Taoist holy writings, but some Taoists frowned on exclusive homosexuality.\nA parallel to Western cultures was the role accorded women in traditional Chinese\nsociety. The “good wife,” like her Western counterparts, was limited to domestic roles.\nChristianity in the Middle Ages T he Middle Ages span the millennium of\nWestern history from about 476 to 1450 CE. The attitudes of the Roman Catholic\nChurch toward sexuality, largely unchanged since the time of Augustine, dominated\nmedieval thought (C rawford et al., 2011) . Yet some currents of change crept across\nmedieval Europe in the social standing of women. The Church had long regarded all\nwomen as being tainted by the sin of Eve. But in the Eastern Empire of Byzantium,\nbased in Constantinople, the cult of the Virgin Mary flourished. The ideal of wom-\nanhood was in the image of Mary: good, gracious, loving, and saintly. Imported by\nthe Crusaders and others who returned from the East, the cult of the Virgin Mary\nswept European Christendom and helped elevate the status of women.\nThere were two conflicting concepts of woman: One was the woman as Eve,\nthe temptress; the other was the woman as Mary, virtuous and pure. Contemporary\nWestern images of women still show the schism between the good girl and the bad\ngirl—the Madonna and the whore.\nThe Protestant Reformation D uring the Reformation, Martin Luther (1483–\n1546) and other Christian reformers such as John Calvin (1509–1564) split off from\nthe Roman Catholic Church and formed their own sects, which led to the devel-\nopment of the modern Protestant denominations. Luther disputed many Roman\nCatholic doctrines on sexuality. He believed that priests should be allowed to marry\nand rear children. To Luther, marriage was as much a part of human nature as eating\nor drinking. Calvin rejected the Roman church’s position that sex in marriage was\npermissible only for procreation. He believed that sexual expression in marriage also\nstrengthened the marriage bond and helped relieve the stresses of everyday life.\nComing to America E arly settlers brought to North America the religious\nteachings that had dominated Western thought and culture for centuries. Whatever\ntheir differences, each religion stressed the ideal of family life and viewed sex outside\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1166 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 17\nof marriage as immoral or sinful. A woman’s place, by and large, was\nin the home and in the fields. Not until 1833, when Oberlin College\nopened its doors to women, were women permitted to attend college in\nthe United States. (Not until 1920 did women gain the right to vote.)\nThe Victorian Period T he middle and later parts of the nineteenth\ncentury are generally called the Victorian period, after Queen Victoria\nof England. Victoria assumed the throne in 1837 and ruled until her\ndeath in 1901. Her name has become virtually synonymous with sex-\nual repression. Victorian society in Europe and the United States, on\nthe surface at least, was prim and proper. Sex was not discussed in\npolite society. Even the legs of pianos were draped with cloth for the\nsake of modesty. Many women viewed sex as a marital duty to be per-\nformed for procreation or to satisfy their husbands’ cravings. Consider\nthe following quotation:\nI am happy now that Charles calls on my bed chamber less frequently\nthan of old. As it is, I now endure but two calls a week and when I hear\nhis steps outside my door I lie down on my bed, close my eyes, open\nmy legs and think of England.\n—Attributed to Alice, Lady Hillingdon\nWomen were assumed not to experience sexual desires or p leasures.\n“I would say,” observed William Acton (1814–1875), an influential\nQueen Victoria of England. Sexuality may not\nEnglish physician, in 1857, “that the majority of women (happily for\nhave been as repressed as advertised during\nsociety) are not much troubled with sexual feeling of any kind.”\nthe reign of Queen Victoria.\nIt was widely believed among medical authorities in England and\nthe United States that sex drains the man of his vitality. Physicians thus\nrecommended that intercourse be practiced infrequently. The Reverend Sylvester\nGraham (1794–1851) preached that ejaculation depleted men of “vital fluids” they\nneeded to maintain health and vitality. Graham preached against “wasting the seed”\nby masturbation or frequent marital intercourse (H aynes, 2012 ). (How frequent\nwas “frequent”? In Graham’s view, intercourse more than once a month could\ndangerously sap vital energies.) T RUTH OR FICTION REVISITED: Graham recom- 5\nmended that young men control their sexual appetites by a diet of simple foods\nbased on whole-grain flours, and invented what we now call the Graham cracker\nto serve this purpose.\nBut the behavior of Victorians was not as repressed as advertised. Despite\nActon’s beliefs, Victorian women did experience sexual pleasure and orgasm.\nConsider some findings from an early sex survey conducted in 1892 by a female\nphysician, Clelia Duel Mosher. Although her sample was small and nonrandom, 35\nof the 44 women who responded admitted to desiring sexual intercourse. And 34\nof them reported experiencing orgasm. Women’s diaries of the time also contained\naccounts of passionate love affairs.\nProstitution flourished during the Victorian era. Men apparently thought that\nthey were doing their wives a favor by looking elsewhere. Accurate statistics are\nhard to come by, but there may have been as many as 1 prostitute for every 12 men\nin London during the nineteenth century; in Vienna, perhaps 1 for every 7 men.\nSame-sex sexual behavior was considered indecent in Victorian society. The\ncelebrated, gay Anglo-Irish novelist and playwright Oscar Wilde—author of T he\nPicture of Dorian Gray, An Ideal Husband, and T he Importance of Being Earnest —\nwas imprisoned after being convicted of “gross indecency.”\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1177 1122//1199//1122 1100::4400 AAMM 18 CHAPTER 1 What Is Human Sexuality?\nFoundations of the Scientific Study of Sexuality A gainst this backdrop\nof repression, scientists and scholars began to approach sexuality as an area of\nlegitimate scientific study. The English physician Havelock Ellis (1859–1939) pub-\nlished a veritable encyclopedia of sexuality between 1897 and 1910, S tudies in the\nPsychology of Sex. Ellis drew information from case histories, anthropological find-\nings, and medical knowledge. He argued that sexual desires in women were natural\nand healthy. He wrote that many sexual problems had psychological rather than\nphysical causes. Gay male or lesbian sexual orientation was a natural variation, Ellis\nargued, and not an aberration. He treated gay male and lesbian sexual orientations\nas inborn dispositions, not as vices or character flaws.\nThe influential German psychiatrist Richard von Krafft-Ebing (1840–1902)\ndescribed case histories of people with sexual deviations in his book, Psychopathia\nSexualis (1886). Cases included sadomasochism (sexual gratification through\ninflicting or receiving pain), bestiality, and necrophilia (intercourse with dead peo-\nple). Krafft-Ebing viewed deviations as mental diseases that could be studied and\nperhaps treated by medical science.\nAt about the same time, a Viennese physician, Sigmund Freud (1856–1939), was\ndeveloping a theory of personality that has had an enormous influence on modern cul-\nture and science. Freud believed that the sex drive was our principal motivating force.\nAlfred Kinsey (1894–1956), an Indiana University zoologist, conducted the first\nlarge-scale studies of sexual behavior in the 1930s and 1940s. Kinsey conducted\ndetailed interviews with nearly 12,000 people across the United States. The results\nof his surveys were published in two volumes, S exual Behavior in the Human Male\n(Kinsey et al., 1948) and S exual Behavior in the Human Female (Kinsey et al., 1953).\nThese books represent the first scientific attempts to provide a comprehensive picture\nof sexual behavior in the United States.\nThe books made for dry reading. They were filled with statistical tables rather\nthan racy pictures or vignettes. Nevertheless, they became best-sellers, exploding on\na public that had not yet learned to discuss sex openly. Their publication unleashed\nthe dogs of criticism. Kinsey’s work had some methodological flaws—especially\nin its selection of participants—but much of the criticism branded it immoral and\nobscene. Many newspapers refused to report the results of his survey on female sex-\nuality. A congressional committee in the 1950s claimed that Kinsey’s work under-\nmined the moral fiber of the nation, rendering it more vulnerable to a Communist\ntakeover. Despite all the brouhaha, Kinsey and his colleagues made sex research a\nscientifically respectable field of study and helped lay the groundwork for discuss-\ning sexual behavior openly.\nThe Sexual Revolution T he period of the mid-1960s to the mid-1970s is often\nreferred to as the s exual revolution. Dramatic changes occurred in American sexual\nattitudes and practices during the “Swinging Sixties.” Our society was on the thresh-\nold of major social upheaval, not only in sexual behavior but also in science, politics,\nfashion, music, art, and cinema. The so-called Woodstock generation, disheartened\nby commercialism and the Vietnam War, tuned in (to rock music on the radio), turned\non (to drugs), and dropped out (of mainstream society). The heat was on between the\nhippies and the hardhats. Long hair became the mane of men. Bell-bottomed jeans\nflared out. Films became sexually explicit as censorship crumbled. Critics seriously\ncontemplated whether the pornography “classic” D eep Throat had deep social impli-\ncations. Hard rock music bellowed the message of rebellion and revolution.\nThe sexual revolution gained momentum from a timely interplay of scientific,\nsocial, political, and economic forces. The war (in Vietnam), the bomb (fear of the\nnuclear bomb), the pill (the introduction of the birth control pill), and the mass\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1188 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 19\nmedia (especially television) were four such forces. The pill lessened the risk of\nunwanted pregnancy, permitting young people to engage in recreational or casual\nsex. Pop psychology movements, such as the Human Potential Movement of the\n1960s and 1970s (the “Me Decade”), spread the message that people should get\nin touch with and express their genuine feelings, including their sexual feelings.\n“Doing your own thing” became one catchphrase. “If it feels right, go with it”\nbecame another. The lamp was rubbed. Out popped the sexual genie.\nThe sexual revolution was tied to social permissiveness and political liberalism.\nThe media dealt openly with sex. Popular books encouraged people to explore their\nsexuality. Film scenes of lovemaking became so commonplace that the movie rating\nsystem was introduced to alert parents.\nGay Activism S ome say gay activism began in 1969, with the gay “rebellion”\nagainst police discrimination at the gay bar, the Stonewall Inn, in Manhattan. Gay\nactivism mushroomed during the sexual revolution. Not only did gays become more\nvoluble in demanding equal rights, but they also began gay parades in major cities,\nsuch as the annual parades in San Francisco and New York’s Greenwich Village. In\nthe early 1980s, gay people also built social institutions to tackle the problem of\nHIV/AIDS, which afflicted gay males disproportionately. Today gay activism is cen-\ntered around the issue of gay marriage, which we will discuss further in C hapter 1 0 .\nSex Research During the sexual revolution, sexually explicit questionnaires pro- CRITICAL THINKING\nliferated in popular magazines, interviewers posed sexually explicit questions by What, then, does history\ntelephone and in person, and some pioneers, including William H. Masters and tell us about sex? Is there\nVirginia Johnson, observed people engaging in sexual activity in the laboratory. a universal standard for\nShere Hite published controversial books based on magazine surveys, but her popu- defining sexual values, or are\nthere many standards?\nlarity fell when it became clear that 3,000 magazine readers did not represent the\ncountry, or even all readers of the magazine. Morton Hunt conducted a telephone\nsurvey financed by P layboy in the 1970s, and he claimed to find a populace more\nsexually liberal than in Kinsey’s day. However, he, like Shere Hite, had a relatively\nlow response rate. In the 1960s, Masters and Johnson were condemned by many as\ndestroying the moral fabric of the nation—a complaint similar to those leveled ear-\nlier against Kinsey. Today, research on sexual behavior continues, with more valid\nmethods of sampling the population and a largely jaded citizenry. Watch the Video\nResearch Methods in Sexuality:\nMichael Bailey’s Laboratory\non MyDevelopmentLab\nThe Legacy of Stonewall.\nA month after Stonewall, the\nfirst gay-pride march was\nheld. The Stonewall incident,\nin which police arrested\ngays for simply being at the\nInn, unleashed a series of\nuprisings and mass actions.\nA provocative slogan came\ninto use: “We’re here. We’re\nqueer. Get used to it.”\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 1199 1122//1199//1122 1100::4400 AAMM 20 CHAPTER 1 What Is Human Sexuality?\nAre today’s young people\nmore or less liberal in the\nexpression of their sexuality\nthan people in earlier\ngenerations?\nRecent Trends M ore teenagers are sexually active today, and at younger ages,\nthan they were a couple of generations ago (R ussell et al., 2012 ). In addition to\npremarital sex, two other features of the sexual revolution have become permanent\nparts of our social fabric: the liberation of female sexuality and a greater willingness\nto discuss sex openly. Countless pornography websites populate the Internet and can\nbe accessed by children. As late as the early 1960s, men’s magazines might reveal\nmodels’ breasts, and nudist magazines might show some more. Today, however,\nwith multiple websites offering the opportunity to download videos of celebrities\nsuch as Paris Hilton and Kim Kardashian engaging in sexual activity, pornography\nhas nearly reached the status of wallpaper.\nIn sum, all societies have some form of an incest taboo. Most societies place a\nvalue on procreative sex within the context of an enduring relationship, usually in the\nform of marriage. Marriage provides security for children, maintains or increases the\npopulation, and institutionalizes the orderly transfer of property from generation to\ngeneration. Other sexual practices—masturbation, promiscuous sex, male–male sex-\nual behavior, female–female sexual behavior, prostitution, polygamy, and so on—have\nbeen condemned in some societies, tolerated by others, and encouraged by still others.\nTHE BIOLOGICAL PERSPECTIVE\nThe biological perspective focuses on the roles of genes, hormones, the nervous\nsystem, and other biological factors in human sexuality. Sex, after all, serves the\nbiological function of reproduction. We are biologically endowed with structures\nthat make sexual behavior possible—and, for most people, pleasurable.\nStudy of the biology of sex informs us about the mechanisms of reproduction\nas well as of the mechanisms of sexual arousal and response. We learn that orgasm\nis a spinal reflex as well as a psychological event.\nBiological researchers have made major strides in assisting infertile couples\nto conceive, for example, through laboratory-based methods of fertilization.\nKnowledge of biology has furthered our ability to overcome sexual problems.\nTHE EVOLUTIONARY PERSPECTIVE\nSpecies vary not only in their physical characteristics but also in their social behavior,\nEvolution The development\nincluding their mating behavior. Scientists look to e volution to help explain such vari-\nof a species to its present state,\nability (B uss & Schmitt, 2011 ). The English naturalist Charles Darwin (1809–1882)\nwhich is believed to involve\nadaptations to its environment. showed that current species of animals and plants evolved from other life-forms\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2200 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 21\nthrough natural selection , or “survival of the fittest.” In each species, individuals vary, Natural selection The evolu-\nand some are better adapted to their environments than others. Better-adapted mem- tionary process by which adap-\ntive traits enable members of a\nbers are more likely to survive to reproduce and transmit their traits to succeeding\nspecies to survive to reproduc-\ngenerations. They are not necessarily the strongest or fleetest of foot, although these\ntive age and transmit these traits\ntraits are adaptive for some species and enhance their reproductive success. to future generations.\nNew variations in species can also be introduced through random genetic\nchanges called m utations . Although mutations occur randomly, they are subject to\nnatural selection. Adaptive mutations enhance reproductive success. As more mem-\nbers of the species come to possess these traits, the species changes.\nTraits are transmitted by units of heredity called g enes . Traits are determined\nby single genes or combinations of genes that offspring inherit from their parents.\nGenes are segments of c hromosomes , which are composed of d eoxyribonucleic acid\n(DNA) . Each human cell normally contains a complement of 46 chromosomes,\nwhich are arranged in 23 pairs. Each pair of chromosomes consists of 1,000 or so\ngenes. A child normally inherits one member of each pair from each parent. Each\nchild inherits half of his or her genes from each parent. The particular combinations\nof genes that one inherits account for whether one has blue eyes or brown eyes, light\nor dark hair, and arms or wings.\nSome scientists suggest that there is also a genetic basis to social behavior,\nincluding sexual behavior, among humans and other animals (B uss & Schmitt,\n2011 ). If so, we may carry traits that helped our prehistoric ancestors survive and\nreproduce successfully.\nDoes biology govern sexual behavior? Although the sexuality of other species is\nlargely governed by biological processes, culture and experience also play vital roles\nin human sexuality (P etersen & Hyde, 2010) . Human sexuality involves a complex\nweb of biological, psychological, and cultural factors. Watch the Video\nEvolution and Sex: Michael Bailey\nThe Evolutionary Perspective and Erotic Plasticity C onsider the concept on MyDevelopmentLab\nof “erotic plasticity” (B aumeister, 2000 ), which addresses the fact that in response\nto various social and cultural forces, people show different levels of sex drive and\nexpress their sexual desires in a variety of ways. There is evidence that women show\ngreater erotic plasticity than men do (B aumeister, 2000; Yost & Thomas, 2011) . For\nexample, (1) individual women show greater variation than men in sexual behavior\nover time; (2) women seem to be more responsive than men to most specific cultural\nMutation A random change in\nfactors, such as cultural permissiveness or restraint; and (3) men’s sexual behavior is\nthe molecular structure of DNA.\nmore consistent with their sexual attitudes than women’s. Are evolutionary, biologi-\ncal forces an important factor in the greater female erotic plasticity? Genes The basic units of\nheredity, which consist of chro-\nAltruism T here is a tendency to think of adaptive traits as somehow more “wor- mosomal segments of DNA.\nthy,” “good,” or “admirable” than less adaptive traits. But evolution is not a mor- Chromosomes The rodlike\nalistic enterprise. A trait either does or does not enhance reproductive success. It structures that reside in the\nis not good or bad in itself. It is apparently adaptive for the female of one species nuclei of every living cell and\ncarry the genetic code in the\nof insect to eat the male after mating. “Dad” then literally nourishes his offspring\nform of genes.\nduring the period of gestation. In evolutionary terms, his “altruism”—his personal\nDNA Deoxyribonucleic acid—\nsacrifice—is adaptive if it increases the chances that the offspring will survive and\nthe chemical substance whose\ncarry his genes. In other species, it may be adaptive for fathers to “love them and\nmolecules make up genes and\nleave them”—that is, to mate with as many females as possible and abruptly aban-\nchromosomes.\ndon them to “plant their seed” elsewhere.\n6\nTRUTH OR FICTION REVISITED: Shortly after inseminating a female, the male\nredback spider does a somersault into the female’s mouth and becomes her after-sex\nmeal. Females pause in their sexual activity after “taking in” their partners. Thus,\ntheir partner’s sacrifice improves the chance that his own sperm will fertilize her\neggs before another male can have at her.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2211 1122//1199//1122 1100::4400 AAMM 22 CHAPTER 1 What Is Human Sexuality?\nCRITICAL THINKING Gender Differences in Preferred Number of Sex Partners S ome\nThe biological, evolutionary, evolutionary psychologists argue that men are naturally more promiscuous than\nand cross-species women because they are the genetic heirs of ancestors whose reproductive success\nperspectives may offer some was related to the number of women they could impregnate (B uss & Schmitt, 2011) .\ninsights into what kinds of Women, by contrast, can produce only a few offspring in their lifetimes. Thus, the\nsexual behavior are “natural.”\ntheory goes, they have to be more selective with respect to their mating partners.\nIf a sexual behavior pattern\nWomen’s reproductive success is enhanced by mating with the fittest males—not\nis judged to be natural, does\nwith any Tom, Dick, or Harry who happens by. From this perspective, the male’s\nthat mean that it is right or\n“roving eye” and the female’s selectivity are embedded in their genes.\ngood? Explain.\nTHE CROSS-SPECIES PERSPECTIVE\nWatch the Video\nThe study of other animal species places human behavior in broader context.\nMating Trick\nA surprising variety of sexual behaviors exists among nonhumans. There are animal\non MyDevelopmentLab\nexamples, or analogues, of human male–male sexual behavior, female–female sexual\nbehavior, oral–genital contact, and oral–oral behavior (i.e., kissing). Foreplay is also\nwell known in the animal world. Turtles massage their mates’ heads with their claws.\nMale mice nibble at their partner’s necks. Most mammals use only a rear-entry posi-\ntion for copulation, but some animals, such as apes, use a variety of coital positions.\nCross-species research reveals an interesting pattern. Sexual behavior among\n“higher” mammals, such as primates, is less directly controlled by instinct than it is\namong the “lower” species, such as birds, fish, or lower mammals. Experience and\nlearning play more important roles in sexuality as we travel up the evolutionary ladder.\nSOCIOLOGICAL PERSPECTIVES\nSociological perspectives, like the historical perspective, provide insight into the\nways in which cultural institutions and beliefs affect sexual behavior and people’s\nsense of morality. Interest in the effects of culture on sexuality was spurred by\nthe early-twentieth-century work of Margaret Mead (1901–1978) and Bronislaw\nMalinowski (1884–1942).\nIn Sex and Temperament in Three Primitive Societies (1935), Mead laid the\ngroundwork for recent psychological and sociological research challenging gender-\nrole stereotypes. In most cultures characterized by a gender division of labor, men\ntypically go to business or to the hunt, and—when necessary—to war. In such cul-\ntures, men are perceived as strong, active, independent, and logical. Women are\nviewed as passive, dependent, nurturing, and emotional. Mead concluded that\nthese stereotypes are not inherent in our genetic heritage. Rather, they are acquired\nthrough cultural expectations and socialization. That is, men and women learn to\nbehave in ways that are expected of them in their particular culture.\nIn 1951, Clellan Ford, an anthropologist, and Frank Beach, a psychologist,\nreviewed sexual behavior in almost 200 preliterate societies around the world. They\nfound great variety in sexual customs and beliefs. They also found some fairly common\nthreads. Kissing was quite common although not universal. The Thonga of Africa did\nnot practice kissing. When witnessing European visitors kissing each other, members\nof the tribe commented that they could not understand why Europeans “ate” each\nother’s saliva and dirt. The frequency of sexual intercourse also varies from culture to\nculture, but intercourse is relatively more frequent among young people everywhere.\nSocieties differ in their attitudes toward childhood masturbation. Some societ-\nies, such as the Hopi Native Americans of the southwest United States, ignore it.\nTrobrianders encourage it. Other societies condemn it.\nSocieties differ widely in their sexual attitudes, customs, and practices. The members\nof all human societies share anatomic structures and physiological capacities for sexual\npleasure, however. The same hormones flow through their arteries. Yet their sexual\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2222 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 23\npractices, and the pleasure they reap or fail to attain, may set them apart. If human\nsexuality were determined exclusively by biology, we might not find such diversity.\nPSYCHOLOGICAL PERSPECTIVES\nPsychological perspectives focus on the many psychological influences—perception,\nlearning, motivation, emotion, personality, and so on—that affect our sexual behav-\nior and our experience of ourselves as female or male. Some psychological theorists,\nsuch as Sigmund Freud, focus on the motivational role of sex in human personality.\nOthers focus on how our experiences and mental representations of the world affect\nour sexual behavior.\nSigmund Freud and Psychoanalytic Theory S igmund Freud, a Viennese\nphysician, formulated a grand theory of personality termed p sychoanalysis . Freud\nbelieved that we are all born with biologically based sex drives that must be chan- Psychoanalysis The theory of\nneled through socially approved outlets if family and social life are to carry on personality originated by Sig-\nwithout undue conflict. mund Freud, which proposes\nthat human behavior represents\nFreud proposed that the mind operates on conscious and unconscious levels.\nthe outcome of clashing inner\nThe conscious level corresponds to our state of present awareness. The unconscious\nforces.\nmind refers to the darker reaches of the mind that lie outside our direct awareness.\nThe ego shields the conscious mind from awareness of our baser sexual and aggres- Defense mechanisms In psy-\nchoanalytic theory, automatic\nsive urges by means of d efense mechanisms such as repression , or motivated forget-\nprocesses that protect the ego\nting of traumatic experiences.\nfrom anxiety by disguising or\nAlthough many sexual ideas and impulses are banished to the unconscious, they ejecting unacceptable ideas and\ncontinue to seek expression. One avenue of expression is the dream, through which urges.\nsexual impulses may be perceived in disguised, or symbolic, form. The therapists\nRepression The automatic\nand scholars who follow in the Freudian tradition are quite interested in analyzing\nejection of anxiety-evoking ideas\ndreams, and the dream objects listed in Table 1 .3 are often considered sex symbols. from consciousness.\nTTaabbllee 11..33\nDDDrreeaamm SSyymmbboollss iinn PPssyycchhooaannaallyyttiicc TThheeoorryy\nS Syymmbboollss ffoorr tthhee MMaallee GGeenniittaall OOrrggaannss\na aiirrppllaanneess f f iisshh nneecckkttiieess t t oooollss ww eeaappoonnss\nb buulllleettss h haannddss ppoolleess t trraaiinnss\nf feeeett h hoosseess ssnnaakkeess t trreeeess\nf fiirree k knniivveess ssttiicckkss u ummbbrreellllaass\nS Syymmbboollss ffoorr tthhee FFeemmaallee GGeenniittaall OOrrggaannss\nb boottttlleess c caavveess d doooorrss oovveennss sshhiippss\nb booxxeess cchheessttss h haattss ppoocckkeettss t tuunnnneellss\nc caasseess c clloosseettss j jaarrss ppoottss\nS Syymmbboollss ffoorr SSeexxuuaall IInntteerrccoouurrssee\nc clliimmbbiinngg aa llaaddddeerr f fllyyiinngg iinn aann aaiirrppllaannee\nc clliimmbbiinngg aa ssttaaiirrccaassee r riiddiinngg aa hhoorrssee\nc crroossssiinngg aa bbrriiddggee r riiddiinngg aann eelleevvaattoorr\nd drriivviinngg aann aauuttoommoobbiillee r riiddiinngg aa rroolllleerr ccooaasstteerr\ne enntteerriinngg aa rroooomm w waallkkiinngg iinnttoo aa ttuunnnneell oorr ddoowwnn aa hhaallll\nS Syymmbboollss ffoorr tthhee BBrreeaassttss\na apppplleess ppeeaacchheess\nHow might a psychoanalyst\nF Frreeuudd tthheeoorriizzeedd tthhaatt tthhee ccoonntteenntt ooff ddrreeaammss ssyymmbboolliizzeedd uurrggeess,, wwiisshheess,, aanndd oobbjjeeccttss ooff ffaannttaassyy tthhaatt wwee wwoouulldd cceennssoorr iinn tthhee\nwwaakkiinngg ssttaattee.. interpret this dream image?\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2233 1122//1199//1122 1100::4400 AAMM 24 CHAPTER 1 What Is Human Sexuality?\nA World of Diversity\nAn “Honor Killing” in Germany\nHatun Surucu, 23, was killed on for her middle-school certificate. Later marriages often come violence and rape;\nher way to a bus stop in Berlin- she finished a vocational-training pro- the bride has no choice but to fulfill the\nTempelhof by several shots to the gram to become an electrician. She put duties of the marriage arranged by her\nhead and upper body, fired at point-blank on makeup, wore her hair unbound, went parents and her in-laws.\nrange. Months before, she had reported dancing, and adorned herself with rings, There have been 49 known “honor\none of her brothers to the police for necklaces, and bracelets. Then her life was crimes” during the past nine years in\nthreatening her. Three of her five brothers cut short. Germany. Perhaps the murder of Hatun\nwere tried for murder. According to the Evidently, in the eyes of her brothers, Surucu never would have made the head-\nprosecutor, the oldest (age 25) acquired Hatun Surucu’s capital crime was that, lines at all but for another piece of news\nthe weapon, the middle brother (age 24) living in Germany, she had begun living that stirred up the press. Just a few hun-\nlured his sister to the scene of the crime, like a German. One brother noted that dred yards from where Surucu was killed,\nand the youngest (age 18) shot her. she had stopped wearing her head scarf, at the Thomas Morus High School, three\nHatun Surucu had “dishonored” her that she refused to go back to her family, Muslim students openly declared their\nfamily. She grew up in Berlin as the daugh- and that she had declared her intent to approval of the murder. Shortly before\nter of Turkish Kurds. When she finished “seek out her own circle of friends.” Often that, the same students had bullied a fel-\neighth grade, her parents took her out of in such cases it is the father of the family low pupil because her clothing was “not in\nschool. Shortly after that she was taken who decides about the punishment, but keeping with the religious regulations.”\nto Turkey and married to a cousin. Later Seyran Ates, a Turkish-German lawyer, Politicians and religious scholars of all\nshe separated from her husband and reports cases in which the mother has a faiths are right in pointing out that there\nreturned to Berlin, pregnant. At age 17 leading role—mothers who were forced are many varieties of Islam, that Islamism\nshe gave birth to a son. She moved into a to marry forcing the same fate on their and Islam should not be confused, and\nwomen’s shelter and completed the work daughters. Necla Kelek, a Turkish-German that there is no line in the K oran that would\nauthor, explained, “The mothers are look- justify murder. However, disregard for wom-\ning for solidarity by demanding that their en’s rights—especially the right to sexual\ndaughters submit to the same hardship self-determination—is an integral compo-\nand suffering.” By disobeying them, the nent of almost all Islamic societies. Islam\ndaughter calls into question her mother’s needs something like an Enlightenment—\nlife—her silent submission to the ritual of only by sticking hard to their own\nforced marriage. Enlightenment, with its separation of\nMany Germans were made aware of religion and state, can the Western democ-\nthe parallel Muslim world arising in their racies persuade their Muslim residents that\nmidst primarily thanks to three women human rights are universally valid. “We\nMuslim authors: Seyran Ates, Necla Kelek, Western Muslim women,” Seyran Ates\nand Serap Cileli. Ates and Kelek narrowly says, “will set off the reform of traditional\nescaped Hatun Surucu’s fate, and Serap Islam, because we are its victims.”\nCileli, when she was 13 years old, tried to\nkill herself to escape her first forced mar-\nCRITICAL THINKING\nriage. Later she was taken to Turkey and\nmarried against her will, then she returned The Muslim author Seyran Ates states\nto Germany with two children from this that “human rights are universally valid.”\nmarriage and took refuge in a women’s What human rights is she speaking\nshelter to escape her father’s violence. about? Is she correct? Support your view.\nSeyran Ates estimates that perhaps\nhalf of young Turkish women living Which institution has a greater right to\nin Germany are forced into marriage govern people’s attitudes and behavior:\nHatun Surucu every year. In the wake of these forced A nation or a religion? Explain your view.\n7 TRUTH OR FICTION REVISITED: To a psychoanalyst, dreams of airplanes, bul-\nlets, snakes, sticks, and similar objects may indeed symbolize the male genitals. But\nthis is the case according to psychoanalytic theory, and not necessarily supported\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2244 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 25\nby research evidence. To his credit, Freud himself maintained skepticism about the\nimportance of dream symbols. He once remarked, “Sometimes a cigar is just a cigar.”\nFreud introduced us to new and controversial ideas about ourselves as s exual\nbeings. For example, he originated the concept of e rogenous zones —the idea that\nmany parts of the body, not just the genitals, are responsive to sexual stimulation.\nOne of Freud’s most controversial beliefs was that children normally harbor\nErogenous zones Parts of the\nerotic interests. He believed that the suckling by the infant in the oral stage was an\nbody, including but not limited\nerotic act, and he believed the same about the anal bodily experimentation through to the sex organs, that are\nwhich 2-year-olds find pleasure in the control of their sphincter muscles in the pro- responsive to sexual stimulation.\ncess of elimination. He theorized that it was normal for children to progress through Psychosexual development\nstages of development in which the erotic interest shifts from one erogenous zone to In psychoanalytic theory, the\nanother, as, for example, from the mouth or oral cavity to the anal cavity. According process by which sexual f eelings\nshift from one erogenous zone to\nto his theory of p sychosexual development , children undergo five stages of devel-\nanother.\nopment: oral, anal, phallic, latency, and genital, which are named according to the\nmain erogenous zones of each stage. Oedipus complex In psycho-\nanalytic theory, a conflict of the\nFreud believed that it was normal for children to develop erotic feelings toward\nphallic stage in which the boy\nthe parent of the other sex during the phallic stage. These incestuous urges lead\nwishes to possess his mother\nto conflict with the parent of the same sex. I n later chapters we will see that t h ese\nsexually and perceives his father\ndevelopments, which Freud termed the Oedipus complex , have implications for the as a rival in love.\nassumption of gender roles and sexual orientation.\nBehaviorists Learning theo-\nrists who argue that a scientific\nLearning Theories T o what extent does sexual behavior reflect experience? approach to understanding\nWould you hold the same sexual attitudes and do the same things if you had been behavior must refer only to\nobservable and measurable\nreared in another culture? We think not. Even within the same society, family and\nbehaviors.\npersonal experiences can shape unique sexual attitudes and behaviors.\nCoitus (co-it-us or co-EET-us)\nBehaviorists such as John B. Watson (1878–1958) and B. F. Skinner (1904–\nSexual intercourse.\n1990) emphasized the importance of rewards and punishments in the learning pro-\ncess. Children left to explore their bodies without parental condemnation will learn Social–cognitive theory\nA cognitively oriented learning\nwhat feels good and tend to repeat it. The Trobriand child who is rewarded for mas-\ntheory in which o bservational\nturbation and premarital c oitus through parental praise and encouragement will be\nlearning, values, and expecta-\nmore likely to repeat these behaviors than the child in a more sexually restrictive\ntions play key roles in determin-\nculture, who is punished for the same behavior. When sexual behavior (like mastur- ing behavior.\nbation) feels good, but parents connect it with feelings\nof guilt and shame, the child is placed in conflict and\nmay vacillate between masturbating and swearing off\nit. If, as young children, we are severely punished for\nsexual exploration, we may come to associate sexual\nstimulation in general with feelings of guilt or anxiety.\nCan such early learning experiences set the stage for\nsexual problems or dysfunctions in adulthood?\nCognitive Views C ognitive psychologists empha-\nsize the importance of cognitive activity (problem solv-\ning, decision making, expectations, and so on). They\nalso recognize that people learn intentionally and by\nobserving others. Observational learning refers to\nacquiring knowledge and skills through observing oth-\ners. Observational learning includes seeing models in\nAcquisition of Gender Roles. According to social—cognitive\nfilms or on television, hearing about them, and reading\ntheory, children learn gender roles by means of reinforcement\nabout them. According to s ocial–cognitive theory , chil- of certain behavior patterns and by observing the gender-\ndren acquire the gender roles deemed appropriate in related behaviors of their parents, peers, and other role models\na society through reinforcement of gender-appropriate in media such as TV, films, and books.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2255 1122//1199//1122 1100::4400 AAMM 26 CHAPTER 1 What Is Human Sexuality?\nbehavior and through observing the gender-role behavior of their parents, their\npeers, and other models on television, in films, in books, and so on.\nFEMINIST THEORY\nThe Greek philosopher Aristotle is said to have described a female as a deformed\nmale. We can only guess at the number of objectionable beliefs expressed in this\ndescription, such as seeing the male as the ideal, focusing on the differences rather\nthan the similarities between men and women, and the implicit right of men to hold\npower over women.\nFeminism and f eminist theory are born of protest against ideas such as those of\nAristotle’s—ideas that remain with us today in many if not most parts of the world\n( Petersen & Hyde, 2010) . Definitions of feminism and of feminist theory are con-\ntroversial, but it is clear enough that feminist theory focuses on the subordination of\nwomen to men; analyzing the relationships between sexism, heterosexism (prejudice\nor discrimination against homosexuals by heterosexuals), racism, and class oppres-\nsion; and exploring means of resistance—on individual and societal levels (P etersen\n& Hyde, 2010 ).\nAmong other things, feminist theory challenges:\n• Traditional views of men as breadwinners and women as homemakers\n• Traditional views of men as political policymakers, especially since those policies\naffect women and children\n• Traditional views of men as sexual “aggressors” and women as sexual\n“gatekeepers”\n• Traditional gender roles that view men as objective and rational, and women as\nemotional and irrational\nSome feminists challenge the very concepts of femininity and masculinity\nbecause their existence tends to suggest that there is some sort of biological or\n“actual” basis to the distinction (S hields & Dicicco, 2011) . They argue, instead, that\nfemininity and masculinity might be purely social constructions that have the effect\nof giving women second-class citizenship—or, in many historic eras and parts of the\nworld, no citizenship whatsoever.\nIn terms of topics most relevant to this b ook , we will find feminists asserting\nthat men have no right to control women’s bodies—for example, that abortion is\nthe personal choice of a woman; that women have as much right as men to decide\nwhether or not to engage in sexual activity, and with whom; that there are few if\nany gender differences in mental abilities, such as those used in math and science;\nand that most medical research has been conducted by men for men, with men as\nsubjects.\nAlthough the extent and nature of gender differences remain controversial, we\ncan note that many traditions that subjugate women are falling by the wayside,\nat least in developed nations. Most Western women, for example, are now in the\nworkforce. As a result, many men now share in child rearing and housekeeping with\nfemale partners. In the United States, as many women as men are pursuing careers\nin traditionally male domains, such as business, law, and medicine ( Kimmel et al.,\n2012 ). Many women now feel free to initiate sex and relationships.\nQUEER THEORY\nFeminist theory A theory that\nThe word q ueer was initially used as an insult to describe homosexuals. After\nchallenges acceptance of the\napproximately two centuries, the term became gradually replaced by the word g ay .\nmale as the norm, traditional\nHowever, homosexuals have reappropriated the word queer as a sign of pride, as\ngender roles, and male oppres-\nsion of females. shown by the title of the former TV show, Queer Eye for the Straight Guy . As one\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2266 1122//1199//1122 1100::4400 AAMM Perspectives on Human Sexuality 27\nresult of this reappropriation, a widely cited theory of the psychology and sociology\nof gender roles and sexual orientation is termed q ueer theory ( Hegarty, 2011 ).\nQueer theory challenges a number of commonly held assumptions about gender\nand sexuality, such as the assumptions that heterosexuality is normal and superior to\nhomosexuality (S emp, 2011) . Queer theory also challenges the assumption that people\nare naturally divided into heterosexuals and homosexuals (D owning & Gillett, 2011) .\nAccording to queer theory, the concepts of heterosexuality and homosexuality\nare social constructs that ignore commonly experienced mismatches among people’s\nanatomic sex, society’s gender roles, and individuals’ sexual desires (D owning &\nGillett, 2011 ). Queer theory asserts that human sexuality has always been more\nvaried than those in power—particularly male heterosexuals—are willing to admit.\nThey point to historical examples such as ancient Greek bisexuality and to current\nhomophobia as evidence. W e will revisit concepts of queer theory in later chapters,\nparticularly the chapters on gender and sexual orientation. Watch the Video\nThe Basics: Sex and\nMULTIPLE PERSPECTIVES ON HUMAN SEXUALITY Gender Differences\non MyDevelopmentLab\nGiven the complexity and range of human sexual behavior, we need to consider\nmultiple perspectives to understand sexuality. Each perspective—historical, biologi-\ncal, cross-species, sociological, psychological, feminist, and queer—has something to\nteach us. Let us venture a few conclusions based on our overview of these perspec-\ntives. First, human sexuality appears to reflect a combination of biological, social,\ncultural, and psychological factors that interact in complex ways. Second, there are\nfew universal patterns of sexual behavior, and views on what is right and wrong\nshow great diversity. Third, although our own cultural values and beliefs may be\nQueer theory A theory that\ndeeply meaningful to us, they may not indicate what is normal, natural, or moral challenges heteronormativity\nin terms of sexual behavior. The complexity of human sexuality—a complexity that and heterosexism.\ncauses it to remain somewhat baffling even to scientists—adds to the wonder and\nHomophobia Hatred of\nrichness of our sexual experience. homosexuals.\nReal Students, Real Questions\nQ If there are so many ways of looking at sex, how\ncan you tell what is the right way of thinking about\nthings? It makes it hard to make decisions.\nA Yes, it can be hard to make sexual decisions, but it\ndoesn’t have to be! If the decisions are informed\ndecisions, if they are consistent with your values,\nand—most important—if they are your decisions, you\ncan be quite comfortable with them. Do not allow\nyourself to be pressured by someone else; if you’re\npressured and you go along with the pressure, it’s not\nyou making the decision. This textb ook will suggest\nthings to consider when making decisions about\ndozens of sexual topics. But in the end, the decisions\nhave to be your decisions. What is right for someone\nelse might not be right for you. One more thing: We\ndon’t know anyone who makes the right decision\nabout every issue all the time. Be stubborn about\nmatters of sexual health, but if you err in a judgment\nabout another person, know that you’re not alone.\nWe’ve “been there.”\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2277 1122//1199//1122 1100::4400 AAMM 28 CHAPTER 1 What Is Human Sexuality?\nChapter Review\nStudy and Review on MMyDevelopmentLab\nLO 1 Defi ne the science of human sexuality suggest that certain kinds of behaviors are\nHuman sexuality concerns the ways in which “natural” in that other species do not plan and\nwe experience and express ourselves as sexual evaluate sexual behavior in the way that humans\nbeings. The study of human sexuality draws do. (Question: Can we equate “natural” with\non the expertise of anthropologists, biologists, “good”—especially when it comes to humans?)\nmedical researchers, sociologists, psychologists, LO 8 Describe sociological perspectives\nand other scientists. on human sexuality\nLO 2 Defi ne the value systems people use The sociological perspective studies ways in\nin making sexual decisions which cultural beliefs affect sexual behavior\nAlong with accurate knowledge about and attitudes.\nhuman sexuality, our values inform our LO 9 Describe psychological perspectives\nsexual decisions. Value systems include l egalism, on human sexuality\nsituational ethics, ethical relativism, hedonism, Psychological perspectives focus on the pro-\nasceticism, utilitarianism, and rationalism. cesses of perception, learning, motivation,\nLO 3 Explain how you can become a critical emotion, and personality that affect gender and\nthinker sexual behavior. The theory of psychoanalysis\nCritical thinking is a skeptical approach to proposes that biologically based sex drives\nevaluating arguments, widespread beliefs, and come into conflict with social codes. Learning\nevidence. Critical thinkers examine definitions theories focus on factors such as rewards, pun-\nof terms and the premises of arguments. ishments, and observational learning.\nLO 4 Describe the historical perspective LO 10 Discuss feminist theory\non human sexuality Feminist theory challenges traditional views of\nThe historical perspective suggests that there are men as breadwinners and women as homemak-\nfew universal sexual trends. Ancient Hebrews, ers; of men as political policymakers, especially\nGreeks, and Romans dwelled in male-oriented since those policies affect women and children;\nsocieties that viewed women as property. of men as sexual “aggressors” and women as\nRepressive Victorian sexual attitudes gave way sexual “gatekeepers”; and traditional gender\nto the sexual revolution of the 1960s and 1970s. roles that view men as objective and rational,\nLO 5 Describe the biological perspective and women as emotional and irrational.\non human sexuality LO 11 Discuss queer theory\nThe biological perspective focuses on biologi- Queer theory challenges heteronormativity—\ncal sexual processes such as genetic, hormonal, the viewpoint that heterosexuality is normal.\nand neural factors. Evolutionary theory suggests According to queer theory, h eterosexuality and\nthat social behaviors that enhance reproductive homosexuality are social constructs that ignore\nsuccess may be subject to natural selection. The commonly experienced mismatches among\ncross-species perspective reveals the variety of people’s anatomic sex, society’s gender roles,\nsexual behaviors among nonhumans. and individuals’ sexual desires.\nLO 6 Describe the evolutionary perspective LO 12 Explain why it is useful to look upon\non human sexuality human sexuality from multiple\nEvolutionary theory has been active in studying perspectives\nthe areas of mate selection and aggression— Given the complexity and range of human\nincluding sexual aggression. The evolutionary sexual behavior, we need to consider multiple\nperspective suggests that social behaviors that perspectives to understand sexuality. Based\nenhance reproductive success may be subject to on our overview of these perspectives, we\nnatural selection. may conclude that human sexuality reflects a\nLO 7 Describe the cross-species perspective combination of biological, social, cultural, and\non human sexuality psychological factors that interact in complex\nThe cross-species perspective reveals the vari- ways. Second, there are few universal patterns\nety of sexual behaviors among nonhumans. of sexual behavior, and views on what is right\nStudying the behavior of other species may and wrong show great diversity.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2288 1122//1199//1122 1100::4411 AAMM Test Your Learning 29\nTest Your Learning\n1. Critical thinking involves all of the following (a) correlation coefficients\nexcept (b) cross-cultural methods\n(a) skepticism. (c) the laboratory-observation method\n(b) challenging tradition. (d) the survey\n(c) evaluating the premises of logic.\n7. Queer theory opposes\n(d) blindly following authority figures.\n(a) heterosexism.\n2. Stone Age art suggests that people worshiped (b) use of the word q ueer.\n(a) women’s ability to bear children. (c) activism.\n(b) a scientific approach to human sexuality. (d) challenging prevailing views of gender\n(c) bisexuality in men. and sexuality.\n(d) men’s ability to father children.\n8. According to __________ theory, children\n3. The ancient __________ were first to produce a acquire the gender roles deemed appropriate\nsex manual. in a society through reinforcement and\nobservational learning.\n(a) Greeks (c) Chinese\n(b) Romans (d) Indians (a) evolutionary\n(b) social–cognitive\n4. According to the text, __________ challenged the\n(c) feminist\nprevailing British view by arguing that sexual\n(d) psychoanalytic\ndesires in women were natural and healthy.\n9. Psychopathia Sexualis was written by\n(a) Havelock Ellis\n(b) Sylvester Graham (a) Havelock Ellis.\n(c) Sigmund Freud (b) Sylvester Graham.\n(d) Richard von Krafft-Ebing (c) Sigmund Freud.\n(d) Richard von Krafft-Ebing.\n5. A controversial Freudian belief is that\n10. According to queer theory,\n(a) children normally harbor erotic interests.\n(a) there is no such thing as homosexuality.\n(b) children ignore unacceptable impulses.\n(b) all heterosexuals are prejudiced.\n(c) childhood is an important time of life.\n(c) everybody is bisexual.\n(d) children seek pain and avoid pleasure.\n(d) current categories of sexual orientation\n6. Masters and Johnson are best known for using do not adequately describe all people.\n__________ in their research on human sexual\nresponse.\nd .01 ;d .9 ;b .8 ;a .7 ;c .6 ;a .5 ;a .4 ;c .3 ;a .2 ;d .1 :srewsnA\nMy Life, My Sexuality\nThinking Critically about Sexual Advice on the Internet: Are There Any Quick Fixes?\nExplore this My Life, My Sexuality feature by scanning this QR code with your mobile device. If you don’t\nalready have one, you may download a free QR scanner for your device wherever smartphone apps are sold.\nYou can also view this feature in MyDevelopmentLab, along with an accompanying critical thinking assignment\nThe Internet would appear to have all the advice anyone would need on almost any topic. Sex is certainly no\nexception; sex, in fact, is the most commonly surfed topic on the Internet. But how can you safely bring sexual\ninformation on the Internet into your life? How can you enhance your life and at the same time protect your sexual-\nity, your health, and your relationships? Scan the code to go online and find advice on how to sift the “chaff from\nthe wheat” and make the most of what you find on the Internet—safely.\n0099446699__0011__cchh11__ppxxxxvvii--002299..iinndddd 2299 1122//1199//1122 1100::4411 AAMM"
}