{
    "text": "Blog Browse Log In Sign Up\nUnderstanding Biological Behavior (\u0000rst edition) / Vocabulary\nVocabulary\n5α-reductase\nAn enzyme required to convert testosterone to 5α-dihydrotestosterone.\nAbducens nucleus\nA group of excitatory motor neurons in the medial brainstem that send projections through the VIth\ncranial nerve to control the ipsilateral lateral rectus muscle. In addition, abducens interneurons send\nan excitatory projection across the midline to a subdivision of cells in the ipsilateral oculomotor\nnucleus, which project through the IIIrd cranial nerve to innervate the ipsilateral medial rectus\nmuscle.\nAblation\nSurgical removal of brain tissue.\nAcetylcholine\nAn organic compound neurotransmitter consisting of acetic acid and choline. Depending upon the\nreceptor type, acetycholine can have excitatory, inhibitory, or modulatory e\u0000ects.\nAction potential\nA transient all-or-nothing electrical current that is conducted down the axon when the membrane\npotential reaches the threshold of excitation.\nAction Potential\nA transient all-or-nothing electrical current that is conducted down the axon when the membrane\npotential reaches the threshold of excitation.\nAdherence\nIn health, it is the ability of a patient to maintain a health behavior prescribed by a physician. This\nmight include taking medication as prescribed, exercising more, or eating less high-fat food.\nAdoption study\nA behavior genetic research method that involves comparison of adopted children to their adoptive\nand biological parents.\nA\u0000ect\nAn emotional process; includes moods, subjective feelings, and discrete emotions.\nA\u0000erent nerve \u0000bers\nSingle neurons that innervate the receptor hair cells and carry vestibular signals to the brain as part\nof the vestibulocochlear nerve (cranial nerve VIII).\nA\u0000erent nerves\nNerves that carry messages to the brain or spinal cord.\nA-\u0000bers\nFast-conducting sensory nerves with myelinated axons. Larger diameter and thicker myelin sheaths\nincreases conduction speed. Aβ-\u0000bers conduct touch signals from low-threshold mechanoreceptors\nwith a velocity of 80 m/s and a diameter of 10 μm; Aδ-\u0000bers have a diameter of 2.5 μm and conduct\ncold, noxious, and thermal signals at 12 m/s. The third and fastest conducting A-\u0000ber is the Aα,\nwhich conducts proprioceptive information with a velocity of 120 m/s and a diameter of 20 μm.\nAggression\nA form of social interaction that includes threat, attack, and \u0000ghting.\nAgnosias\nDue to damage of Wernicke’s area. An inability to recognize objects, words, or faces.\nAgonists\nA drug that increases or enhances a neurotransmitter’s e\u0000ect.\nAllodynia\nPain due to a stimulus that does not normally provoke pain, e.g., when a light, stroking touch feels\npainful.\nAlogia\nA reduction in the amount of speech and/or increased pausing before the initiation of speech.\nAmbulatory assessment\nAn overarching term to describe methodologies that assess the behavior, physiology, experience,\nand environments of humans in naturalistic settings.\nAmygdala\nTwo almond-shaped structures located in the medial temporal lobes of the brain.\nAmygdala\nA region located deep within the brain in the medial area (toward the center) of the temporal lobes\n(parallel to the ears). If you could draw a line through your eye sloping toward the back of your head\nand another line between your two ears, the amygdala would be located at the intersection of these\nlines. The amygdala is involved in detecting relevant stimuli in our environment and has been\nimplicated in emotional responses.\nAnalgesia\nPain relief.\nAnhedonia\nLoss of interest or pleasure in activities one previously found enjoyable or rewarding.\nAnhedonia/amotivation\nA reduction in the drive or ability to take the steps or engage in actions necessary to obtain the\npotentially positive outcome.\nAntagonist\nA drug that blocks a neurotransmitter’s e\u0000ect.\nAnterograde amnesia\nInability to form new memories for facts and events after the onset of amnesia.\nAphasia\nDue to damage of the Broca’s area. An inability to produce or understand words.\nArcuate fasciculus\nA \u0000ber tract that connects Wernicke’s and Broca’s speech areas.\nAromatase\nAn enzyme that converts androgens into estrogens.\nAspartate\nAn excitatory amino acid neurotransmitter that is widely used by vestibular receptors, a\u0000erents, and\nmany neurons in the brain.\nAttributional style\nThe tendency by which a person infers the cause or meaning of behaviors or events.\nAudience design\nConstructing utterances to suit the audience’s knowledge.\nAutobiographical memory\nMemory for the events of one’s life.\nAutomatic process\nWhen a thought, feeling, or behavior occurs with little or no mental e\u0000ort. Typically, automatic\nprocesses are described as involuntary or spontaneous, often resulting from a great deal of practice\nor repetition.\nAutonomic nervous system\nA part of the peripheral nervous system that connects to glands and smooth muscles. Consists of\nsympathetic and parasympathetic divisions.\nAwareness\nA conscious experience or the capability of having conscious experiences, which is distinct from self-\nawareness, the conscious understanding of one’s own existence and individuality.\nAxial plane\nSee “horizontal plane.”\nAxon\nPart of the neuron that extends o\u0000 the soma, splitting several times to connect with other neurons;\nmain output of the neuron.\nAxon\nPart of the neuron that extends o\u0000 the soma, splitting several times to connect with other neurons;\nmain output of the neuron.\nBasal ganglia\nSubcortical structures of the cerebral hemispheres involved in voluntary movement.\nBehavioral genetics\nThe empirical science of how genes and environments combine to generate behavior.\nBehavioral medicine\nA \u0000eld similar to health psychology that integrates psychological factors (e.g., emotion, behavior,\ncognition, and social factors) in the treatment of disease. This applied \u0000eld includes clinical areas of\nstudy, such as occupational therapy, hypnosis, rehabilitation or medicine, and preventative\nmedicine.\nBinocular advantage\nBene\u0000ts from having two eyes as opposed to a single eye.\nBiofeedback\nThe process by which physiological signals, not normally available to human perception, are\ntransformed into easy-to-understand graphs or numbers. Individuals can then use this information\nto try to change bodily functioning (e.g., lower blood pressure, reduce muscle tension).\nBiomedical Model of Health\nA reductionist model that posits that ill health is a result of a deviation from normal function, which\nis explained by the presence of pathogens, injury, or genetic abnormality.\nBiopsychosocial Model of Health\nAn approach to studying health and human function that posits the importance of biological,\npsychological, and social (or environmental) processes.\nBlocking\nIn classical conditioning, the \u0000nding that no conditioning occurs to a stimulus if it is combined with a\npreviously conditioned stimulus during conditioning trials. Suggests that information, surprise value,\nor prediction error is important in conditioning.\nBlood Alcohol Content (BAC)\nBlood Alcohol Content (BAC): a measure of the percentage of alcohol found in a person’s blood. This\nmeasure is typically the standard used to determine the extent to which a person is intoxicated, as\nin the case of being too impaired to drive a vehicle.\nBouncing balls illusion\nThe tendency to perceive two circles as bouncing o\u0000 each other if the moment of their contact is\naccompanied by an auditory stimulus.\nBrain stem\nThe “trunk” of the brain comprised of the medulla, pons, midbrain, and diencephalon.\nBrain Stem\nThe “trunk” of the brain comprised of the medulla, pons, midbrain, and diencephalon.\nBroca’s area\nAn area in the frontal lobe of the left hemisphere. Implicated in language production.\nBroca’s Area\nAn area in the frontal lobe of the left hemisphere. Implicated in language production.\nCallosotomy\nSurgical procedure in which the corpus callosum is severed (used to control severe epilepsy).\nCase study\nA thorough study of a patient (or a few patients) with naturally occurring lesions.\nCatatonia\nBehaviors that seem to re\u0000ect a reduction in responsiveness to the external environment. This can\ninclude holding unusual postures for long periods of time, failing to respond to verbal or motor\nprompts from another person, or excessive and seemingly purposeless motor activity.\nCategorize\nTo sort or arrange di\u0000erent items into classes or categories.\nCell membrane\nA bi-lipid layer of molecules that separates the cell from the surrounding extracellular \u0000uid.\nCentral Nervous System\nThe portion of the nervous system that includes the brain and spinal cord.\nCentral sulcus\nThe major \u0000ssure that divides the frontal and the parietal lobes.\nCerebellum\nThe distinctive structure at the back of the brain, Latin for “small brain.”\nCerebellum\nThe distinctive structure at the back of the brain, Latin for “small brain.”\nCerebellum\nA nervous system structure behind and below the cerebrum. Controls motor movement\ncoordination, balance, equilibrium, and muscle tone.\nCerebral cortex\nThe outermost gray matter of the cerebrum; the distinctive convoluti characteristic of the\nmammalian brain.\nCerebral hemispheres\nThe cerebral cortex, underlying white matter, and subcortical structures.\nCerebrum\nConsists of left and right hemispheres that sit at the top of the nervous system and engages in a\nvariety of higher-order functions.\nCerebrum\nUsually refers to the cerebral cortex and associated white matter, but in some texts includes the\nsubcortical structures.\nCerebrum\nUsually refers to the cerebral cortex and associated white matter, but in some texts includes the\nsubcortical structures.\nC-\u0000bers\nC-\u0000bers: Slow-conducting unmyelinated thin sensory a\u0000erents with a diameter of 1 μm and a\nconduction velocity of approximately 1 m/s. C-pain \u0000bers convey noxious, thermal, and heat signals;\nC-tactile \u0000bers convey gentle touch, light stroking.\nChromosomal sex\nThe sex of an individual as determined by the sex chromosomes (typically XX or XY) received at the\ntime of fertilization.\nChronic disease\nA health condition that persists over time, typically for periods longer than three months (e.g., HIV,\nasthma, diabetes).\nChronic pain\nPersistent or recurrent pain, beyond usual course of acute illness or injury; sometimes present\nwithout observable tissue damage or clear cause.\nChronic stress\nDiscrete or related problematic events and conditions which persist over time and result in\nprolonged activation of the biological and/or psychological stress response (e.g., unemployment,\nongoing health di\u0000culties, marital discord).\nChunk\nThe process of grouping information together using our knowledge.\nCingulate gyrus\nA medial cortical portion of the nervous tissue that is a part of the limbic system.\nCircadian Rhythm\nCircadian Rhythm: The physiological sleep-wake cycle. It is in\u0000uenced by exposure to sunlight as well\nas daily schedule and activity. Biologically, it includes changes in body temperature, blood pressure\nand blood sugar.\nClassical conditioning\nThe procedure in which an initially neutral stimulus (the conditioned stimulus, or CS) is paired with\nan unconditioned stimulus (or US). The result is that the conditioned stimulus begins to elicit a\nconditioned response (CR). Classical conditioning is nowadays considered important as both a\nbehavioral phenomenon and as a method to study simple associative learning. Same as Pavlovian\nconditioning.\nClassical conditioning\nDescribes stimulus-stimulus associative learning.\nCochlea\nSnail-shell-shaped organ that transduces mechanical vibrations into neural signals.\nCommon ground\nInformation that is shared by people who engage in a conversation.\nCompensatory re\u0000exes\nA stabilizing motor re\u0000ex that occurs in response to a perceived movement, such as the\nvestibuloocular re\u0000ex, or the postural responses that occur during running or skiing.\nComputerized axial tomography\nA noninvasive brain-scanning procedure that uses X-ray absorption around the head.\nConditioned aversions and preferences\nLikes and dislikes developed through associations with pleasurable or unpleasurable sensations.\nConditioned compensatory response\nIn classical conditioning, a conditioned response that opposes, rather than is the same as, the\nunconditioned response. It functions to reduce the strength of the unconditioned response. Often\nseen in conditioning when drugs are used as unconditioned stimuli.\nConditioned response (CR)\nThe response that is elicited by the conditioned stimulus after classical conditioning has taken place.\nConditioned stimulus (CS)\nAn initially neutral stimulus (like a bell, light, or tone) that elicits a conditioned response after it has\nbeen associated with an unconditioned stimulus.\nCones\nPhotoreceptors that operate in lighted environments and can encode \u0000ne visual details. There are\nthree di\u0000erent kinds (S or blue, M or green and L or red) that are each sensitive to slightly di\u0000erent\ntypes of light. Combined, these three types of cones allow you to have color vision.\nConscious experience\nThe \u0000rst-person perspective of a mental event, such as feeling some sensory input, a memory, an\nidea, an emotion, a mood, or a continuous temporal sequence of happenings.\nConsciousness\nConsciousness: the awareness or deliberate perception of a stimulus\nConsolidation\nProcess by which a memory trace is stabilized and transformed into a more durable form.\nConsolidation\nThe process occurring after encoding that is believed to stabilize memory traces.\nContemplative science\nA research area concerned with understanding how contemplative practices such as meditation can\na\u0000ect individuals, including changes in their behavior, their emotional reactivity, their cognitive\nabilities, and their brains. Contemplative science also seeks insights into conscious experience that\ncan be gained from \u0000rst-person observations by individuals who have gained extraordinary\nexpertise in introspection.\nContext\nStimuli that are in the background whenever learning occurs. For instance, the Skinner box or room\nin which learning takes place is the classic example of a context. However, “context” can also be\nprovided by internal stimuli, such as the sensory e\u0000ects of drugs (e.g., being under the in\u0000uence of\nalcohol has stimulus properties that provide a context) and mood states (e.g., being happy or sad). It\ncan also be provided by a speci\u0000c period in time—the passage of time is sometimes said to change\nthe “temporal context.”\nContralateral\nLiterally “opposite side”; used to refer to the fact that the two hemispheres of the brain process\nsensory information and motor commands for the opposite side of the body (e.g., the left\nhemisphere controls the right side of the body).\nContralateral\nLiterally “opposite side”; used to refer to the fact that the two hemispheres of the brain process\nsensory information and motor commands for the opposite side of the body (e.g., the left\nhemisphere controls the right side of the body).\nContrast\nRelative di\u0000erence in the amount and type of light coming from two nearby locations.\nContrast gain\nProcess where the sensitivity of your visual system can be tuned to be most sensitive to the levels of\ncontrast that are most prevalent in the environment.\nControl\nFeeling like you have the power to change your environment or behavior if you need or want to.\nConverging evidence\nSimilar \u0000ndings reported from multiple studies using di\u0000erent methods.\nCoronal plane\nA slice that runs from head to foot; brain slices in this plane are similar to slices of a loaf of bread,\nwith the eyes being the front of the loaf.\nCorpus Callosum\nThe thick bundle of nerve cells that connect the two hemispheres of the brain and allow them to\ncommunicate.\nCortisol\nA hormone made by the adrenal glands, within the cortex. Cortisol helps the body maintain blood\npressure and immune function. Cortisol increases when the body is under stress.\nC-pain or Aδ-\u0000bers\nC-pain \u0000bers convey noxious, thermal, and heat signals\nCrossmodal phenomena\nE\u0000ects that concern the in\u0000uence of the perception of one sensory modality on the perception of\nanother.\nCrossmodal receptive \u0000eld\nA receptive \u0000eld that can be stimulated by a stimulus from more than one sensory modality.\nCrossmodal stimulus\nA stimulus with components in multiple sensory modalties that interact with each other.\nC-tactile \u0000bers\nC-tactile \u0000bers convey gentle touch, light stroking\nCue overload principle\nThe principle stating that the more memories that are associated to a particular retrieval cue, the\nless e\u0000ective the cue will be in prompting retrieval of any one memory.\nCues\nCues: a stimulus that has a particular signi\u0000cance to the perceiver (e.g., a sight or a sound that has\nspecial relevance to the person who saw or heard it)\nCutaneous senses\nThe senses of the skin: tactile, thermal, pruritic (itchy), painful, and pleasant.\nDaily Diary method\nA methodology where participants complete a questionnaire about their thoughts, feelings, and\nbehavior of the day at the end of the day.\nDaily hassles\nIrritations in daily life that are not necessarily traumatic, but that cause di\u0000culties and repeated\nstress.\nDark adaptation\nProcess that allows you to become sensitive to very small levels of light, so that you can actually see\nin the near-absence of light.\nDay reconstruction method (DRM)\nA methodology where participants describe their experiences and behavior of a given day\nretrospectively upon a systematic reconstruction on the following day.\nDecay\nThe fading of memories with the passage of time.\nDeclarative memory\nConscious memories for facts and events.\nDefeminization\nThe removal of the potential for female traits.\nDelusions\nFalse beliefs that are often \u0000xed, hard to change even in the presence of con\u0000icting information, and\noften culturally in\u0000uenced in their content.\nDemasculinization\nThe removal of the potential for male traits.\nDendrite\nPart of a neuron that extends away from the cell body and is the main input to the neuron.\nDendrites\nPart of a neuron that extends away from the cell body and is the main input to the neuron.\nDepolarized\nWhen receptor hair cells have mechanically gated channels open, the cell increases its membrane\nvoltage, which produces a release of neurotransmitter to excite the innervating nerve \u0000ber.\nDepressants\nDepressants: a class of drugs that slow down the body’s physiological and mental processes.\nDescending pain modulatory system\nA top-down pain-modulating system able to inhibit or facilitate pain. The pathway produces\nanalgesia by the release of endogenous opioids. Several brain structures and nuclei are part of this\ncircuit, such as the frontal lobe areas of the anterior cingulate cortex, orbitofrontal cortex, and\ninsular cortex; and nuclei in the amygdala and the hypothalamus, which all project to a structure in\nthe midbrain called the periaqueductal grey (PAG). The PAG then controls ascending pain\ntransmission from the a\u0000erent pain system indirectly through the rostral ventromedial medulla\n(RVM) in the brainstem, which uses ON- and OFF-cells to inhibit or facilitate nociceptive signals at the\nspinal dorsal horn.\nDetection thresholds\nThe smallest amount of head motion that can be reliably reported by an observer.\nDiagnostic criteria\nThe speci\u0000c criteria used to determine whether an individual has a speci\u0000c type of psychiatric\ndisorder. Commonly used diagnostic criteria are included in the Diagnostic and Statistical Manual of\nMental Disorder, 5th Edition (DSM-5) and the Internal Classi\u0000cation of Disorders, Version 9 (ICD-9).\nDichotic listening\nAn experimental task in which two messages are presented to di\u0000erent ears.\nDi\u0000use Optical Imaging (DOI)\nA neuroimaging technique that infers brain activity by measuring changes in light as it is passed\nthrough the skull and surface of the brain.\nDi\u0000use optical imaging (DOI)\nA neuroimaging technique that infers brain activity by measuring changes in light as it is passed\nthrough the skull and surface of the brain.\nDi\u0000usion\nThe force on molecules to move from areas of high concentration to areas of low concentration.\nDihydrotestosterone (DHT)\nA primary androgen that is an androgenic steroid product of testosterone and binds strongly to\nandrogen receptors.\nDirectional tuning\nThe preferred direction of motion that hair cells and a\u0000erents exhibit where a peak excitatory\nresponse occurs and the least preferred direction where no response occurs. Cells are said to be\n“tuned” for a best and worst direction of motion, with in-between motion directions eliciting a lesser\nbut observable response.\nDiscriminative stimulus\nIn operant conditioning, a stimulus that signals whether the response will be reinforced. It is said to\n“set the occasion” for the operant response.\nDisorganized behavior\nBehavior or dress that is outside the norm for almost all subcultures. This would include odd dress,\nodd makeup (e.g., lipstick outlining a mouth for 1 inch), or unusual rituals (e.g., repetitive hand\ngestures).\nDisorganized speech\nSpeech that is di\u0000cult to follow, either because answers do not clearly follow questions or because\none sentence does not logically follow from another.\nDissociation\nDissociation: the heightened focus on one stimulus or thought such that many other things around\nyou are ignored; a disconnect between one’s awareness of their environment and the one object the\nperson is focusing on\nDissociative amnesia\nLoss of autobiographical memories from a period in the past in the absence of brain injury or\ndisease.\nDistinctiveness\nThe principle that unusual events (in a context of similar events) will be recalled and recognized\nbetter than uniform (nondistinctive) events.\nDivided attention\nThe ability to \u0000exibly allocate attentional resources between two or more concurrent tasks.\nDNA methylation\nCovalent modi\u0000cations of mammalian DNA occurring via the methylation of cytosine, typically in the\ncontext of the CpG dinucleotide.\nDNA methyltransferases (DNMTs)\nEnzymes that establish and maintain DNA methylation using methyl-group donor compounds or\ncofactors. The main mammalian DNMTs are DNMT1, which maintains methylation state across DNA\nreplication, and DNMT3a and DNMT3b, which perform de novo methylation.\nDopamine\nA neurotransmitter in the brain that is thought to play an important role in regulating the function of\nother neurotransmitters.\nDouble \u0000ash illusion\nThe false perception of two visual \u0000ashes when a single \u0000ash is accompanied by two auditory beeps.\nDrive state\nA\u0000ective experiences that motivate organisms to ful\u0000ll goals that are generally bene\u0000cial to their\nsurvival and reproduction.\nEarly adversity\nSingle or multiple acute or chronic stressful events, which may be biological or psychological in\nnature (e.g., poverty, abuse, childhood illness or injury), occurring during childhood and resulting in\na biological and/or psychological stress response.\nEcological momentary assessment\nAn overarching term to describe methodologies that repeatedly sample participants’ real-world\nexperiences, behavior, and physiology in real time.\nEcological validity\nThe degree to which a study \u0000nding has been obtained under conditions that are typical for what\nhappens in everyday life.\nEctoderm\nThe outermost layer of a developing fetus.\nE\u0000erent nerves\nNerves that carry messages from the brain to glands and organs in the periphery.\nElectroencephalogram\nA measure of electrical activity generated by the brain’s neurons.\nElectroencephalography\nA technique that is used to measure gross electrical activity of the brain by placing electrodes on the\nscalp.\nElectroencephalography (EEG)\nA neuroimaging technique that measures electrical brain activity via multiple electrodes on the scalp.\nElectroencephalography (EEG)\nA neuroimaging technique that measures electrical brain activity via multiple electrodes on the scalp.\nElectronically activated recorder, or EAR\nA methodology where participants wear a small, portable audio recorder that intermittently records\nsnippets of ambient sounds around them.\nElectrostatic pressure\nThe force on two ions with similar charge to repel each other; the force of two ions with opposite\ncharge to attract to one another.\nEmotion-focused coping\nCoping strategy aimed at reducing the negative emotions associated with a stressful event.\nEncoding\nThe initial experience of perceiving and learning events.\nEncoding\nProcess by which information gets into memory.\nEncoding\nThe pact of putting information into memory.\nEncoding speci\u0000city principle\nThe hypothesis that a retrieval cue will be e\u0000ective to the extent that information encoded from the\ncue overlaps or matches information in the engram or memory trace.\nEndocrine gland\nA ductless gland from which hormones are released into the blood system in response to speci\u0000c\nbiological signals.\nEndorphin\nAn endogenous morphine-like peptide that binds to the opioid receptors in the brain and body;\nsynthesized in the body’s nervous system.\nEngrams\nA term indicating the change in the nervous system representing an event; also, memory trace.\nEnzyme\nA protein produced by a living organism that allows or helps a chemical reaction to occur.\nEnzyme induction\nProcess through which a drug can enhance the production of an enzyme.\nEpigenetics\nHeritable changes in gene activity that are not caused by changes in the DNA sequence.\nhttp://en.wikipedia.org/wiki/Epigenetics\nEpigenetics\nThe study of heritable changes in gene expression or cellular phenotype caused by mechanisms\nother than changes in the underlying DNA sequence. Epigenetic marks include covalent DNA\nmodi\u0000cations and posttranslational histone modi\u0000cations.\nEpigenome\nThe genome-wide distribution of epigenetic marks.\nEpisodic memory\nMemory for events in a particular time and place.\nEpisodic memory\nThe ability to learn and retrieve new information or episodes in one’s life.\nEstrogen\nAny of the C18 class of steroid hormones, so named because of the estrus-generating properties in\nfemales. Biologically important estrogens include estradiol and estriol.\nEuphoria\nEuphoria: an intense feeling of pleasure, excitement or happiness.\nEvent-related potentials\nA physiological measure of large electrical change in the brain produced by sensory stimulation or\nmotor responses.\nExcitatory postsynaptic potentials\nA depolarizing postsynaptic current that causes the membrane potential to become more positive\nand move towards the threshold of excitation.\nExperience-sampling method\nA methodology where participants report on their momentary thoughts, feelings, and behaviors at\ndi\u0000erent points in time over the course of a day.\nExternal validity\nThe degree to which a \u0000nding generalizes from the speci\u0000c sample and context of a study to some\nlarger population and broader settings.\nExteroception\nThe sense of the external world, of all stimulation originating from outside our own bodies.\nExtinction\nDecrease in the strength of a learned behavior that occurs when the conditioned stimulus is\npresented without the unconditioned stimulus (in classical conditioning) or when the behavior is no\nlonger reinforced (in instrumental conditioning). The term describes both the procedure (the US or\nreinforcer is no longer presented) as well as the result of the procedure (the learned response\ndeclines). Behaviors that have been reduced in strength through extinction are said to be\n“extinguished.”\nFear conditioning\nA type of classical or Pavlovian conditioning in which the conditioned stimulus (CS) is associated with\nan aversive unconditioned stimulus (US), such as a foot shock. As a consequence of learning, the CS\ncomes to evoke fear. The phenomenon is thought to be involved in the development of anxiety\ndisorders in humans.\nFeminization\nThe induction of female traits.\nFight or \u0000ight response\nThe physiological response that occurs in response to a perceived threat, preparing the body for\nactions needed to deal with the threat.\nFirst-person perspective\nObservations made by individuals about their own conscious experiences, also known as\nintrospection or a subjective point of view. Phenomenology refers to the description and\ninvestigation of such observations.\nFlashbulb memory\nVivid personal memories of receiving the news of some momentous (and usually emotional) event.\nFlat a\u0000ect\nA reduction in the display of emotions through facial expressions, gestures, and speech intonation.\nFlexible Correction Model\nFlexible Correction Model: the ability for people to correct or change their beliefs and evaluations if\nthey believe these judgments have been biased (e.g., if someone realizes they only thought their day\nwas great because it was sunny, they may revise their evaluation of the day to account for this\n“biasing” in\u0000uence of the weather)\nForebrain\nA part of the nervous system that contains the cerebral hemispheres, thalamus, and hypothalamus.\nFornix\n(plural form, fornices) A nerve \u0000ber tract that connects the hippocampus to mammillary bodies.\nFrontal lobe\nThe front most (anterior) part of the cerebrum; anterior to the central sulcus and responsible for\nmotor output and planning, language, judgment, and decision-making.\nFrontal Lobe\nThe front most (anterior) part of the cerebrum; anterior to the central sulcus and responsible for\nmotor output and planning, language, judgment, and decision-making.\nFrontal lobe\nThe most forward region (close to forehead) of the cerebral hemispheres.\nFull-cycle psychology\nA scienti\u0000c approach whereby researchers start with an observational \u0000eld study to identify an e\u0000ect\nin the real world, follow up with laboratory experimentation to verify the e\u0000ect and isolate the causal\nmechanisms, and return to \u0000eld research to corroborate their experimental \u0000ndings.\nFunctional capacity\nThe ability to engage in self-care (cook, clean, bathe), work, attend school, and/or engage in social\nrelationships.\nFunctional magnetic resonance imaging\nA measure of changes in the oxygenation of blood \u0000ow as areas in the brain become active.\nFunctional magnetic resonance imaging\n(or fMRI) A noninvasive brain-imaging technique that registers changes in blood \u0000ow in the brain\nduring a given task (also see magnetic resonance imaging).\nFunctional magnetic resonance imaging (fMRI)\nFunctional magnetic resonance imaging (fMRI): A neuroimaging technique that infers brain activity\nby measuring changes in oxygen levels in the blood.\nFunctional Magnetic Resonance Imaging (fMRI)\nFunctional magnetic resonance imaging (fMRI): A neuroimaging technique that infers brain activity\nby measuring changes in oxygen levels in the blood.\nFunctional neuroanatomy\nClassifying how regions within the nervous system relate to psychology and behavior.\nGamma-aminobutyric acid\nA major inhibitory neurotransmitter in the vestibular commissural system.\nGaze stability\nA combination of eye, neck, and head responses that are all coordinated to maintain visual \u0000xation\n(fovea) upon a point of interest.\nGene\nA speci\u0000c deoxyribonucleic acid (DNA) sequence that codes for a speci\u0000c polypeptide or protein or\nan observable inherited trait.\nGeneral Adaptation Syndrome\nA three-phase model of stress, which includes a mobilization of physiological resources phase, a\ncoping phase, and an exhaustion phase (i.e., when an organism fails to cope with the stress\nadequately and depletes its resources).\nGeneralize\nGeneralizing, in science, refers to the ability to arrive at broad conclusions based on a smaller\nsample of observations. For these conclusions to be true the sample should accurately represent the\nlarger population from which it is drawn.\nGenome-wide association study (GWAS)\nA study that maps DNA polymorphisms in a\u0000ected individuals and controls matched for age, sex,\nand ethnic background with the aim of identifying causal genetic variants.\nGenotype\nThe DNA content of a cell’s nucleus, whether a trait is externally observable or not.\nGlobus pallidus\nA nucleus of the basal ganglia.\nGlutamate\nAn excitatory amino acid neurotransmitter that is widely used by vestibular receptors, a\u0000erents, and\nmany neurons in the brain.\nGoal-directed behavior\nInstrumental behavior that is in\u0000uenced by the animal’s knowledge of the association between the\nbehavior and its consequence and the current value of the consequence. Sensitive to the reinforcer\ndevaluation e\u0000ect.\nGonadal sex\nThe sex of an individual as determined by the possession of either ovaries or testes. Females have\novaries, whereas males have testes.\nGrandiosity\nIn\u0000ated self-esteem or an exaggerated sense of self-importance and self-worth (e.g., believing one\nhas special powers or superior abilities).\nGray matter\nThe outer grayish regions of the brain comprised of the neurons’ cell bodies.\nGray matter\nComposes the bark or the cortex of the cerebrum and consists of the cell bodies of the neurons (see\nalso white matter).\nGustation\nThe action of tasting; the ability to taste.\nGyri\n(plural) Folds between sulci in the cortex.\nGyrus\nA fold between sulci in the cortex.\nGyrus\n(plural form, gyri) A bulge that is raised between or among \u0000ssures of the convoluted brain.\nHabit\nInstrumental behavior that occurs automatically in the presence of a stimulus and is no longer\nin\u0000uenced by the animal’s knowledge of the value of the reinforcer. Insensitive to the reinforcer\ndevaluation e\u0000ect.\nHabituation\nOccurs when the response to a stimulus decreases with exposure.\nHair cells\nThe receptor cells of the vestibular system. They are termed hair cells due to the many hairlike cilia\nthat extend from the apical surface of the cell into the gelatin membrane. Mechanical gated ion\nchannels in the tips of the cilia open and close as the cilia bend to cause membrane voltage changes\nin the hair cell that are proportional to the intensity and direction of motion.\nHallucinations\nPerceptual experiences that occur even when there is no stimulus in the outside world generating\nthe experiences. They can be auditory, visual, olfactory (smell), gustatory (taste), or somatic (touch).\nHallucinogens\nHallucinogens: substances that, when ingested, alter a person’s perceptions, often by creating\nhallucinations that are not real or distorting their perceptions of time.\nHealth\nAccording to the World Health Organization, it is a complete state of physical, mental, and social\nwell-being and not merely the absence of disease or in\u0000rmity.\nHealth behavior\nAny behavior that is related to health—either good or bad.\nHeritability coe\u0000cient\nAn easily misinterpreted statistical construct that purports to measure the role of genetics in the\nexplanation of di\u0000erences among individuals.\nHippocampus\n(plural form, hippocampi) A nucleus inside (medial) the temporal lobe implicated in learning and\nmemory.\nHistone acetyltransferases (HATs) and histone deacetylases (HDACs)\nHATs are enzymes that transfer acetyl groups to speci\u0000c positions on histone tails, promoting an\n“open” chromatin state and transcriptional activation. HDACs remove these acetyl groups, resulting\nin a “closed” chromatin state and transcriptional repression.\nHistone modi\u0000cations\nPosttranslational modi\u0000cations of the N-terminal “tails” of histone proteins that serve as a major\nmode of epigenetic regulation. These modi\u0000cations include acetylation, phosphorylation,\nmethylation, sumoylation, ubiquitination, and ADP-ribosylation.\nHomeostasis\nThe tendency of an organism to maintain a stable state across all the di\u0000erent physiological systems\nin the body.\nHomeostatic set point\nAn ideal level that the system being regulated must be monitored and compared to.\nHomo habilis\nA human ancestor, handy man, that lived two million years ago.\nHomo sapiens\nModern man, the only surviving form of the genus Homo.\nHorizontal plane\nA slice that runs horizontally through a standing person (i.e., parallel to the \u0000oor); slices of brain in\nthis plane divide the top and bottom parts of the brain; this plane is similar to slicing a hamburger\nbun.\nHormone\nAn organic chemical messenger released from endocrine cells that travels through the blood to\ninteract with target cells at some distance to cause a biological response.\nHormones\nChemicals released by cells in the brain or body that a\u0000ect cells in other parts of the brain or body.\nHostility\nAn experience or trait with cognitive, behavioral, and emotional components. It often includes\ncynical thoughts, feelings of emotion, and aggressive behavior.\nHyperpolarizes\nWhen receptor hair cells have mechanically gated channels close, the cell decreases its membrane\nvoltage, which produces less release of neurotransmitters to inhibit the innervating nerve \u0000ber.\nHypersomnia\nExcessive daytime sleepiness, including di\u0000culty staying awake or napping, or prolonged sleep\nepisodes.\nHypnosis\nHypnosis: the state of consciousness whereby a person is highly responsive to the suggestions of\nanother; this state usually involves a dissociation with one’s environment and an intense focus on a\nsingle stimulus, which is usually accompanied by a sense of relaxation\nHypnotherapy\nHypnotherapy: The use of hypnotic techniques such as relaxation and suggestion to help engineer\ndesirable change such as lower pain or quitting smoking.\nHypothalamic-pituitary-adrenal (HPA) axis\nA system that involves the hypothalamus (within the brain), the pituitary gland (within the brain), and\nthe adrenal glands (at the top of the kidneys). This system helps maintain homeostasis (keeping the\nbody’s systems within normal ranges) by regulating digestion, immune function, mood, temperature,\nand energy use. Through this, the HPA regulates the body’s response to stress and injury.\nHypothalamus\nPart of the diencephalon. Regulates biological drives with pituitary gland.\nHypothalamus\nA portion of the brain involved in a variety of functions, including the secretion of various hormones\nand the regulation of hunger and sexual arousal.\nHypothalamus\nA brain structure located below the thalamus and above the brain stem.\nIdentical twins\nTwo individual organisms that originated from the same zygote and therefore are genetically\nidentical or very similar. The epigenetic pro\u0000ling of identical twins discordant for disease is a unique\nexperimental design as it eliminates the DNA sequence-, age-, and sex-di\u0000erences from\nconsideration.\nImmunocytochemistry\nA method of staining tissue including the brain, using antibodies.\nImplicit Associations Test\nImplicit Associations Test (IAT): A computer reaction time test that measures a person’s automatic\nassociations with concepts. For instance, the IAT could be used to measure how quickly a person\nmakes positive or negative evaluations of members of various ethnic groups.\nImplicit learning\nOccurs when we acquire information without intent that we cannot easily express.\nImplicit memory\nA type of long-term memory that does not require conscious thought to encode. It's the type of\nmemory one makes without intent.\nInattentional blindness\nThe failure to notice a fully visible object when attention is devoted to something else.\nIncidental learning\nAny type of learning that happens without the intention to learn.\nIngroup\nGroup to which a person belongs.\nIngroup\nA social group to which an individual identi\u0000es or belongs.\nInhibitory postsynaptic potentials\nA hyperpolarizing postsynaptic current that causes the membrane potential to become more\nnegative and move away from the threshold of excitation.\nInstrumental conditioning\nProcess in which animals learn about the relationship between their behaviors and their\nconsequences. Also known as operant conditioning.\nIntegrated\nThe process by which the perceptual system combines information arising from more than one\nmodality.\nIntentional learning\nAny type of learning that happens when motivated by intention.\nInteraural di\u0000erences\nDi\u0000erences (usually in time or intensity) between the two ears.\nInterference\nOther memories get in the way of retrieving a desired memory\nInternal validity\nThe degree to which a cause-e\u0000ect relationship between two variables has been unambiguously\nestablished.\nInteroception\nThe sense of the physiological state of the body. Hunger, thirst, temperature, pain, and other\nsensations relevant to homeostasis. Visceral input such as heart rate, blood pressure, and digestive\nactivity give rise to an experience of the body’s internal states and physiological reactions to external\nstimulation. This experience has been described as a representation of “the material me,” and it is\nhypothesized to be the foundation of subjective feelings, emotion, and self-awareness.\nIon channels\nProteins that span the cell membrane, forming channels that speci\u0000c ions can \u0000ow through between\nthe intracellular and extracellular space.\nIonotropic receptor\nIon channel that opens to allow ions to permeate the cell membrane under speci\u0000c conditions, such\nas the presence of a neurotransmitter or a speci\u0000c membrane potential.\nJet Lag\nJet Lag: The state of being fatigued and/or having di\u0000culty adjusting to a new time zone after\ntraveling a long distance (across multiple time zones).\nLateral geniculate nucleus\n(or LGN) A nucleus in the thalamus that is innervated by the optic nerves and sends signals to the\nvisual cortex in the occipital lobe.\nLateral inhibition\nA signal produced by a neuron aimed at suppressing the response of nearby neurons.\nLateral rectus muscle\nAn eye muscle that turns outward in the horizontal plane.\nLateral sulcus\nThe major \u0000ssure that delineates the temporal lobe below the frontal and the parietal lobes.\nLateral vestibulo-spinal tract\nVestibular neurons that project to all levels of the spinal cord on the ipsilateral side to control\nposture and balance movements.\nLateralized\nTo the side; used to refer to the fact that speci\u0000c functions may reside primarily in one hemisphere\nor the other (e.g., for the majority individuals, the left hemisphere is most responsible for language).\nLaw of e\u0000ect\nThe idea that instrumental or operant responses are in\u0000uenced by their e\u0000ects. Responses that are\nfollowed by a pleasant state of a\u0000airs will be strengthened and those that are followed by\ndiscomfort will be weakened. Nowadays, the term refers to the idea that operant or instrumental\nbehaviors are lawfully controlled by their consequences.\nLesion\nA region in the brain that su\u0000ered damage through injury, disease, or medical intervention.\nLesion studies\nA surgical method in which a part of the animal brain is removed to study its e\u0000ects on behavior or\nfunction.\nLesions\nDamage or tissue abnormality due, for example, to an injury, surgery, or a vascular problem.\nLexicon\nWords and expressions.\nLimbic System\nIncludes the subcortical structures of the amygdala and hippocampal formation as well as some\ncortical structures; responsible for aversion and grati\u0000cation.\nLimbic system\nIncludes the subcortical structures of the amygdala and hippocampal formation as well as some\ncortical structures; responsible for aversion and grati\u0000cation.\nLimbic system\nA loosely de\u0000ned network of nuclei in the brain involved with learning and emotion.\nLimited capacity\nThe notion that humans have limited mental resources that can be used at a given time.\nLinguistic inquiry and word count\nA quantitative text analysis methodology that automatically extracts grammatical and psychological\ninformation from a text by counting word frequencies.\nLinguistic intergroup bias\nA tendency for people to characterize positive things about their ingroup using more abstract\nexpressions, but negative things about their outgroups using more abstract expressions.\nLived day analysis\nA methodology where a research team follows an individual around with a video camera to\nobjectively document a person’s daily life as it is lived.\nLordosis\nA physical sexual posture in females that serves as an invitation to mate.\nMagnetic resonance imaging\nOr MRI is a brain imaging noninvasive technique that uses magnetic energy to generate brain images\n(also see fMRI).\nMagnetic resonance imaging\nA set of techniques that uses strong magnets to measure either the structure of the brain (e.g., gray\nmatter and white matter) or how the brain functions when a person performs cognitive tasks (e.g.,\nworking memory or episodic memory) or other types of tasks.\nMagni\u0000cation factor\nCortical space projected by an area of sensory input (e.g., mm of cortex per degree of visual \u0000eld).\nMasculinization\nThe induction of male traits.\nMaternal behavior\nParental behavior performed by the mother or other female.\nMcGurk e\u0000ect\nAn e\u0000ect in which con\u0000icting visual and auditory components of a speech stimulus result in an\nillusory percept.\nMechanically gated ion channels\nIon channels located in the tips of the stereocilia on the receptor cells that open/close as the cilia\nbend toward the tallest/smallest cilia, respectively. These channels are permeable to potassium ions,\nwhich are abundant in the \u0000uid bathing the top of the hair cells.\nMedial prefrontal cortex\nAn area of the brain located in the middle of the frontal lobes (at the front of the head), active when\npeople mentalize about the self and others.\nMedial temporal lobes\nInner region of the temporal lobes that includes the hippocampus.\nMedial vestibulo-spinal tract\nVestibular nucleus neurons project bilaterally to cervical spinal motor neurons for head and neck\nmovement control. The tract principally functions in gaze direction and stability during motion.\nMedulla oblongata\nAn area just above the spinal cord that processes breathing, digestion, heart and blood vessel\nfunction, swallowing, and sneezing.\nMelatonin\nMelatonin: A hormone associated with increased drowsiness and sleep.\nMemory traces\nA term indicating the change in the nervous system representing an event.\nMentalizing\nThe act of representing the mental states of oneself and others. Mentalizing allows humans to\ninterpret the intentions, beliefs, and emotional states of others.\nMetabolism\nBreakdown of substances.\nMetabolite\nA substance necessary for a living organism to maintain life.\nMetacognition\nDescribes the knowledge and skills people have in monitoring and controlling their own learning and\nmemory.\nMind–body connection\nThe idea that our emotions and thoughts can a\u0000ect how our body functions.\nMindfulness\nMindfulness: a state of heightened focus on the thoughts passing through one’s head, as well as a\nmore controlled evaluation of those thoughts (e.g., do you reject or support the thoughts you’re\nhaving?)\nMisinformation e\u0000ect\nWhen erroneous information occurring after an event is remembered as having been part of the\noriginal event.\nMnemonic devices\nA strategy for remembering large amounts of information, usually involving imaging events\noccurring on a journey or with some other set of memorized cues.\nMotor cortex\nRegion of the frontal lobe responsible for voluntary movement; the motor cortex has a contralateral\nrepresentation of the human body.\nMultimodal\nOf or pertaining to multiple sensory modalities.\nMultimodal perception\nThe e\u0000ects that concurrent stimulation in more than one sensory modality has on the perception of\nevents and objects in the world.\nMultimodal phenomena\nE\u0000ects that concern the binding of inputs from multiple sensory modalities.\nMultisensory convergence zones\nRegions in the brain that receive input from multiple unimodal areas processing di\u0000erent sensory\nmodalities.\nMultisensory enhancement\nSee “superadditive e\u0000ect of multisensory integration.”\nMyelin\nFatty tissue, produced by glial cells (see module, “Neurons”) that insulates the axons of the neurons;\nmyelin is necessary for normal conduction of electrical impulses among neurons.\nMyelin Sheath\nFatty tissue, that insulates the axons of the neurons; myelin is necessary for normal conduction of\nelectrical impulses among neurons.\nMyelin sheath\nSubstance around the axon of a neuron that serves as insulation to allow the action potential to\nconduct rapidly toward the terminal buttons.\nNervous System\nThe body’s network for electrochemical communication. This system includes all the nerves cells in\nthe body.\nNeural crest\nA set of primordial neurons that migrate outside the neural tube and give rise to sensory and\nautonomic neurons in the peripheral nervous system.\nNeural induction\nA process that causes the formation of the neural tube.\nNeuroblasts\nBrain progenitor cells that asymmetrically divide into other neuroblasts or nerve cells.\nNeurodevelopmental\nProcesses that in\u0000uence how the brain develops either in utero or as the child is growing up.\nNeuroendocrinology\nThe study of how the brain and hormones act in concert to coordinate the physiology of the body.\nNeuroepithelium\nThe lining of the neural tube.\nNeurons\nIndividual brain cells\nNeuroscience\nThe study of the nervous system.\nNeurotransmitter\nA chemical messenger that travels between neurons to provide communication. Some\nneurotransmitters, such as norepinephrine, can leak into the blood system and act as hormones.\nNeurotransmitter\nA chemical substance produced by a neuron that is used for communication between neurons.\nNeurotransmitters\nChemical substance released by the presynaptic terminal button that acts on the postsynaptic cell.\nNeurotransmitters\nA chemical compound used to send signals from a receptor cell to a neuron, or from one neuron to\nanother. Neurotransmitters can be excitatory, inhibitory, or modulatory and are packaged in small\nvesicles that are released from the end terminals of cells.\nNeurotransmitters\nChemical substance released by the presynaptic terminal button that acts on the postsynaptic cell.\nNociception\nThe neural process of encoding noxious stimuli, the sensory input from nociceptors. Not necessarily\npainful, and crucially not necessary for the experience of pain.\nNociceptors\nHigh-threshold sensory receptors of the peripheral somatosensory nervous system that are capable\nof transducing and encoding noxious stimuli. Nociceptors send information about actual or\nimpending tissue damage to the brain. These signals can often lead to pain, but nociception and\npain are not the same.\nNomenclature\nNaming conventions.\nNonassociative learning\nOccurs when a single repeated exposure leads to a change in behavior.\nNoxious stimulus\nA stimulus that is damaging or threatens damage to normal tissues.\nNucleus\nCollection of nerve cells found in the brain which typically serve a speci\u0000c function.\nNucleus accumbens\nA region of the basal forebrain located in front of the preoptic region.\nObservational learning\nLearning by observing the behavior of others.\nOccipital lobe\nThe back part of the cerebrum, which houses the visual areas.\nOccipital lobe\nThe back most (posterior) part of the cerebrum; involved in vision.\nOccipital Lobe\nThe back most (posterior) part of the cerebrum; involved in vision.\nOcial touch hypothesis\nProposes that social touch is a distinct domain of touch. C-tactile a\u0000erents form a special pathway\nthat distinguishes social touch from other types of touch by selectively \u0000ring in response to touch of\nsocial-a\u0000ective relevance; thus sending a\u0000ective information parallel to the discriminatory\ninformation from the Aβ-\u0000bers. In this way, the socially relevant touch stands out from the rest as\nhaving special positive emotional value and is processed further in a\u0000ect-related brain areas such as\nthe insula.\nOculomotor nuclei\nIncludes three neuronal groups in the brainstem, the abducens nucleus, the oculomotor nucleus,\nand the trochlear nucleus, whose cells send motor commands to the six pairs of eye muscles.\nOculomotor nucleus\nA group of cells in the middle brainstem that contain subgroups of neurons that project to the\nmedial rectus, inferior oblique, inferior rectus, and superior rectus muscles of the eyes through the\n3rd cranial nerve.\nOlfaction\nThe sense of smell; the action of smelling; the ability to smell.\nOmnivore\nA person or animal that is able to survive by eating a wide range of foods from plant or animal\norigin.\nOperant\nA behavior that is controlled by its consequences. The simplest example is the rat’s lever-pressing,\nwhich is controlled by the presentation of the reinforcer.\nOperant conditioning\nSee instrumental conditioning.\nOperant conditioning\nDescribes stimulus-response associative learning.\nOpponent Process Theory\nTheory of color vision that assumes there are four di\u0000erent basic colors, organized into two pairs\n(red/green and blue/yellow) and proposes that colors in the world are encoded in terms of the\nopponency (or di\u0000erence) between the colors in each pair. There is an additional black/white pair\nresponsible for coding light contrast.\nOrbital frontal cortex\nA region of the frontal lobes of the brain above the eye sockets.\nOrthonasal olfaction\nPerceiving scents/smells introduced via the nostrils.\nOtoconia\nSmall calcium carbonate particles that are packed in a layer on top of the gelatin membrane that\ncovers the otolith receptor hair cell stereocilia.\nOtolith receptors\nTwo inner ear vestibular receptors (utricle and saccule) that transduce linear accelerations and head\ntilt relative to gravity into neural signals that are then transferred to the brain.\nOutgroup\nGroup to which a person does not belong.\nOutgroup\nA social group to which an individual does not identify or belong.\nOxytocin\nA peptide hormone secreted by the pituitary gland to trigger lactation, as well as social bonding.\nOxytocin\nA nine amino acid mammalian neuropeptide. Oxytocin is synthesized primarily in the brain, but also\nin other tissues such as uterus, heart and thymus, with local e\u0000ects. Oxytocin is best known as a\nhormone of female reproduction due to its capacity to cause uterine contractions and eject milk.\nOxytocin has e\u0000ects on brain tissue, but also acts throughout the body in some cases as an\nantioxidant or anti-in\u0000ammatory.\nPain\nDe\u0000ned as “an unpleasant sensory and emotional experience associated with actual or potential\ntissue damage, or described in terms of such damage,” according to the International Association for\nthe Study of Pain.\nParasympathetic nervous system\nA division of the autonomic nervous system that is slower than its counterpart—that is, the\nsympathetic nervous system—and works in opposition to it. Generally engaged in “rest and digest”\nfunctions.\nParental behavior\nBehaviors performed in relation to one’s o\u0000spring that contributes directly to the survival of those\no\u0000spring\nParietal Lobe\nThe part of the cerebrum between the frontal and occipital lobes; involved in bodily sensations,\nvisual attention, and integrating the senses.\nParietal lobe\nThe part of the cerebrum between the frontal and occipital lobes; involved in bodily sensations,\nvisual attention, and integrating the senses.\nParietal lobe\nAn area of the cerebrum just behind the central sulcus that is engaged with somatosensory and\ngustatory sensation.\nPaternal behavior\nParental behavior performed by the father or other male.\nPavlovian conditioning\nSee classical conditioning.\nPerceptual learning\nOccurs when aspects of our perception changes as a function of experience.\nPeriaqueductal gray\nThe gray matter in the midbrain near the cerebral aqueduct.\nPeripheral Nervous System\nAll of the nerve cells that connect the central nervous system to all the other parts of the body.\nPhantom pain\nPain that appears to originate in an amputated limb.\nPharmacokinetics\nThe action of a drug through the body, including absorption, distribution, metabolism, and\nexcretion.\nPhenotype\nThe pattern of expression of the genotype or the magnitude or extent to which it is observably\nexpressed—an observable characteristic or trait of an organism, such as its morphology,\ndevelopment, biochemical or physiological properties, or behavior.\nPhotoactivation\nA photochemical reaction that occurs when light hits photoreceptors, producing a neural signal.\nPhrenology\nA now-discredited \u0000eld of brain study, popular in the \u0000rst half of the 19th century that correlated\nbumps and indentations of the skull with speci\u0000c functions of the brain.\nPinna\nVisible part of the outer ear.\nPlacebo e\u0000ect\nE\u0000ects from a treatment that are not caused by the physical properties of a treatment but by the\nmeaning ascribed to it. These e\u0000ects re\u0000ect the brain’s own activation of modulatory systems, which\nis triggered by positive expectation or desire for a successful treatment. Placebo analgesia is the\nmost well-studied placebo e\u0000ect and has been shown to depend, to a large degree, on opioid\nmechanisms. Placebo analgesia can be reversed by the pharmacological blocking of (cid:0) opioid\nreceptors. The word “placebo” is probably derived from the Latin word “placebit” (“it will please”).\nPolypharmacy\nThe use of many medications.\nPons\nA bridge that connects the cerebral cortex with the medulla, and reciprocally transfers information\nback and forth between the brain and the spinal cord.\nPositron emission tomography\nA technique that uses radio-labelled ligands to measure the distribution of di\u0000erent\nneurotransmitter receptors in the brain or to measure how much of a certain type of\nneurotransmitter is released when a person is given a speci\u0000c type of drug or does a particularly\ncognitive task.\nPositron Emission Tomography\n(or PET) An invasive procedure that captures brain images with positron emissions from the brain\nafter the individual has been injected with radio-labeled isotopes.\nPositron emission tomography (PET)\nA neuroimaging technique that measures brain activity by detecting the presence of a radioactive\nsubstance in the brain that is initially injected into the bloodstream and then pulled in by active brain\ntissue.\nPositron Emission Tomography (PET)\nA neuroimaging technique that measures brain activity by detecting the presence of a radioactive\nsubstance in the brain that is initially injected into the bloodstream and then pulled in by active brain\ntissue.\nPrediction error\nWhen the outcome of a conditioning trial is di\u0000erent from that which is predicted by the conditioned\nstimuli that are present on the trial (i.e., when the US is surprising). Prediction error is necessary to\ncreate Pavlovian conditioning (and associative learning generally). As learning occurs over repeated\nconditioning trials, the conditioned stimulus increasingly predicts the unconditioned stimulus, and\nprediction error declines. Conditioning works to correct or reduce prediction error.\nPreoptic area\nA region in the anterior hypothalamus involved in generating and regulating male sexual behavior.\nPreoptic region\nA part of the anterior hypothalamus.\nPreparedness\nThe idea that an organism’s evolutionary history can make it easy to learn a particular association.\nBecause of preparedness, you are more likely to associate the taste of tequila, and not the\ncircumstances surrounding drinking it, with getting sick. Similarly, humans are more likely to\nassociate images of spiders and snakes than \u0000owers and mushrooms with aversive outcomes like\nshocks.\nPrimary auditory cortex\nA region of the cortex devoted to the processing of simple auditory information.\nPrimary Motor Cortex\nA strip of cortex just in front of the central sulcus that is involved with motor control.\nPrimary Somatosensory Cortex\nA strip of cerebral tissue just behind the central sulcus engaged in sensory reception of bodily\nsensations.\nPrimary visual cortex\nA region of the cortex devoted to the processing of simple visual information.\nPrimary visual cortex (V1)\nBrain region located in the occipital cortex (toward the back of the head) responsible for processing\nbasic visual information like the detection, thickness, and orientation of simple lines, color, and\nsmall-scale motion.\nPriming\nPriming: the activation of certain thoughts or feelings that make them easier to think of and act upon\nPriming\nA stimulus presented to a person reminds him or her about other ideas associated with the\nstimulus.\nPrinciple of Inverse E\u0000ectiveness\nThe \u0000nding that, in general, for a multimodal stimulus, if the response to each unimodal component\n(on its own) is weak, then the opportunity for multisensory enhancement is very large. However, if\none component—by itself—is su\u0000cient to evoke a strong response, then the e\u0000ect on the response\ngained by simultaneously processing the other components of the stimulus will be relatively small.\nProblem-focused coping\nA set of coping strategies aimed at improving or changing stressful situations.\nProcessing speed\nThe speed with which an individual can perceive auditory or visual information and respond to it.\nProgesterone\nA primary progestin that is involved in pregnancy and mating behaviors.\nProgestin\nA class of C21 steroid hormones named for their progestational (pregnancy-supporting) e\u0000ects.\nProgesterone is a common progestin.\nProhormone\nA molecule that can act as a hormone itself or be converted into another hormone with di\u0000erent\nproperties. For example, testosterone can serve as a hormone or as a prohormone for either\ndihydrotestosterone or estradiol.\nProlactin\nA protein hormone that is highly conserved throughout the animal kingdom. It has many biological\nfunctions associated with reproduction and synergistic actions with steroid hormones.\nProprioceptive\nSensory information regarding muscle position and movement arising from receptors in the\nmuscles, tendons, and joints.\nPsychoactive drugs\nA drug that changes mood or the way someone feels.\nPsychomotor agitation\nIncreased motor activity associated with restlessness, including physical actions (e.g., \u0000dgeting,\npacing, feet tapping, handwringing).\nPsychomotor retardation\nA slowing of physical activities in which routine activities (e.g., eating, brushing teeth) are performed\nin an unusually slow manner.\nPsychoneuroimmunology\nA \u0000eld of study examining the relationship among psychology, brain function, and immune function.\nPsychopathology\nIllnesses or disorders that involve psychological or psychiatric symptoms.\nPsychosomatic medicine\nAn interdisciplinary \u0000eld of study that focuses on how biological, psychological, and social processes\ncontribute to physiological changes in the body and health over time.\nPsychotropic drug\nA drug that changes mood or emotion, usually used when talking about drugs prescribed for various\nmental conditions (depression, anxiety, schizophrenia, etc.).\nPunisher\nA stimulus that decreases the strength of an operant behavior when it is made a consequence of the\nbehavior.\nQuantitative genetics\nScienti\u0000c and mathematical methods for inferring genetic and environmental processes based on\nthe degree of genetic and environmental similarity among organisms.\nQuantitative law of e\u0000ect\nA mathematical rule that states that the e\u0000ectiveness of a reinforcer at strengthening an operant\nresponse depends on the amount of reinforcement earned for all alternative behaviors. A reinforcer\nis less e\u0000ective if there is a lot of reinforcement in the environment for other behaviors.\nReceptive \u0000eld\nThe portion of the world to which a neuron will respond if an appropriate stimulus is present there.\nReceptor\nA chemical structure on the cell surface or inside of a cell that has an a\u0000nity for a speci\u0000c chemical\ncon\u0000guration of a hormone, neurotransmitter, or other compound.\nRecoding\nThe ubiquitous process during learning of taking information in one form and converting it to\nanother form, usually one more easily remembered.\nReinforcer\nAny consequence of a behavior that strengthens the behavior or increases the likelihood that it will\nbe performed it again.\nReinforcer devaluation e\u0000ect\nThe \u0000nding that an animal will stop performing an instrumental response that once led to a\nreinforcer if the reinforcer is separately made aversive or undesirable.\nRenewal e\u0000ect\nRecovery of an extinguished response that occurs when the context is changed after extinction.\nEspecially strong when the change of context involves return to the context in which conditioning\noriginally occurred. Can occur after extinction in either classical or instrumental conditioning.\nResilience\nThe ability to “bounce back” from negative situations (e.g., illness, stress) to normal functioning or to\nsimply not show poor outcomes in the face of adversity. In some cases, resilience may lead to better\nfunctioning following the negative experience (e.g., post-traumatic growth).\nResting membrane potential\nThe voltage inside the cell relative to the voltage outside the cell while the cell is a rest\n(approximately -70 mV).\nRetrieval\nThe process of accessing stored information.\nRetrieval\nProcess by which information is accessed from memory and utilized.\nRetroactive interference\nThe phenomenon whereby events that occur after some particular event of interest will usually\ncause forgetting of the original event.\nRetrograde amnesia\nInability to retrieve memories for facts and events acquired before the onset of amnesia.\nRetronasal olfaction\nPerceiving scents/smells introduced via the mouth/palate.\nReward value\nA neuropsychological measure of an outcome’s a\u0000ective importance to an organism.\nRods\nPhotoreceptors that are very sensitive to light and are mostly responsible for night vision.\nRostrocaudal\nA front-back plane used to identify anatomical structures in the body and the brain.\nRubber hand illusion\nThe false perception of a fake hand as belonging to a perceiver, due to multimodal sensory\ninformation.\nSagittal plane\nA slice that runs vertically from front to back; slices of brain in this plane divide the left and right side\nof the brain; this plane is similar to slicing a baked potato lengthwise.\nSapir-Whorf hypothesis\nThe hypothesis that the language that people use determines their thoughts.\nSatiation\nThe state of being full to satisfaction and no longer desiring to take on more.\nSelective attention\nThe ability to select certain stimuli in the environment to process, while ignoring distracting\ninformation.\nSelf-e\u0000cacy\nThe belief that one can perform adequately in a speci\u0000c situation.\nSemantic memory\nThe more or less permanent store of knowledge that people have.\nSemicircular canals\nA set of three inner ear vestibular receptors (horizontal, anterior, posterior) that transduce head\nrotational accelerations into head rotational velocity signals that are then transferred to the brain.\nThere are three semicircular canals in each ear, with the major planes of each canal being\northogonal to each other.\nSensitization\nOccurs when the response to a stimulus increases with exposure\nSensitization\nIncreased responsiveness of nociceptive neurons to their normal input and/or recruitment of a\nresponse to normally subthreshold inputs. Clinically, sensitization may only be inferred indirectly\nfrom phenomena such as hyperalgesia or allodynia. Sensitization can occur in the central nervous\nsystem (central sensitization) or in the periphery (peripheral sensitization).\nSensory modalities\nA type of sense; for example, vision or audition.\nSex determination\nThe point at which an individual begins to develop as either a male or a female. In animals that have\nsex chromosomes, this occurs at fertilization. Females are XX and males are XY. All eggs bear X\nchromosomes, whereas sperm can either bear X or Y chromosomes. Thus, it is the males that\ndetermine the sex of the o\u0000spring.\nSex di\u0000erentiation\nThe process by which individuals develop the characteristics associated with being male or female.\nDi\u0000erential exposure to gonadal steroids during early development causes sexual di\u0000erentiation of\nseveral structures including the brain.\nShadowing\nA task in which the individual is asked to repeat an auditory message as it is presented.\nSimulation\nImaginary or real imitation of other people’s behavior or feelings.\nSituation model\nA mental representation of an event, object, or situation constructed at the time of comprehending\na linguistic description.\nSocial brain hypothesis\nThe hypothesis that the human brain has evolved, so that humans can maintain larger ingroups.\nSocial categorization\nThe act of mentally classifying someone into a social group (e.g., as female, elderly, a librarian).\nSocial integration\nThe size of your social network, or number of social roles (e.g., son, sister, student, employee, team\nmember).\nSocial Learning Theory\nThe theory that people can learn new responses and behaviors by observing the behavior of others.\nSocial models\nAuthorities that are the targets for observation and who model behaviors.\nSocial networks\nNetworks of social relationships among individuals through which information can travel.\nSocial support\nThe perception or actuality that we have a social network that can help us in times of need and\nprovide us with a variety of useful resources (e.g., advice, love, money).\nSocial support\nA subjective feeling of psychological or physical comfort provided by family, friends, and others.\nSo cial touch hypothesis\nProposes that social touch is a distinct domain of touch. C-tactile a\u0000erents form a special pathway\nthat distinguishes social touch from other types of touch by selectively \u0000ring in response to touch of\nsocial-a\u0000ective relevance; thus sending a\u0000ective information parallel to the discriminatory\ninformation from the Aβ-\u0000bers. In this way, the socially relevant touch stands out from the rest as\nhaving special positive emotional value and is processed further in a\u0000ect-related brain areas such as\nthe insula.\nSocial zeitgeber\nZeitgeber is German for “time giver.” Social zeitgebers are environmental cues, such as meal times\nand interactions with other people, that entrain biological rhythms and thus sleep-wake cycle\nregularity.\nSocioeconomic status (SES)\nA person’s economic and social position based on income, education, and occupation.\nSodium-potassium pump\nAn ion channel that uses the neuron’s energy (adenosine triphosphate, ATP) to pump three Na+ ions\noutside the cell in exchange for bringing two K+ ions inside the cell.\nSoma\nCell body of a neuron that contains the nucleus and genetic information, and directs protein\nsynthesis.\nSoma\nCell body of a neuron that contains the nucleus and genetic information, and directs protein\nsynthesis.\nSomatic nervous system\nA part of the peripheral nervous system that uses cranial and spinal nerves in volitional actions.\nSomatosensory (body sensations) cortex\nThe region of the parietal lobe responsible for bodily sensations; the somatosensory cortex has a\ncontralateral representation of the human body.\nSomatosensory cortex\nConsists of primary sensory cortex (S1) in the postcentral gyrus in the parietal lobes and secondary\nsomatosensory cortex (S2), which is de\u0000ned functionally and found in the upper bank of the lateral\nsulcus, called the parietal operculum. Somatosensory cortex also includes parts of the insular cortex.\nSomatotopically organized\nWhen the parts of the body that are represented in a particular brain region are organized\ntopographically according to their physical location in the body (see Figure 2 illustration).\nSpatial principle of multisensory integration\nThe \u0000nding that the superadditive e\u0000ects of multisensory integration are observed when the\nsources of stimulation are spatially related to one another.\nSpatial resolution\nA term that refers to how small the elements of an image are; high spatial resolution means the\ndevice or technique can resolve very small elements; in neuroscience it describes how small of a\nstructure in the brain can be imaged.\nSpatial Resolution\nA term that refers to how small the elements of an image are; high spatial resolution means the\ndevice or technique can resolve very small elements; in neuroscience it describes how small of a\nstructure in the brain can be imaged.\nSpina bi\u0000da\nA developmental disease of the spinal cord, where the neural tube does not close caudally.\nSpines\nProtrusions on the dendrite of a neuron that form synapses with terminal buttons of the presynaptic\naxon.\nSpinothalamic tract\nRuns through the spinal cord’s lateral column up to the thalamus. C-\u0000bers enter the dorsal horn of\nthe spinal cord and form a synapse with a neuron that then crosses over to the lateral column and\nbecomes part of the spinothalamic tract.\nSplit-brain Patient\nA patient who has had most or all of his or her corpus callosum severed.\nSplit-brain patient\nA patient who has had most or all of his or her corpus callosum severed.\nSpontaneous recovery\nRecovery of an extinguished response that occurs with the passage of time after extinction. Can\noccur after extinction in either classical or instrumental conditioning.\nStereocilia\nHairlike projections from the top of the receptor hair cells. The stereocilia are arranged in ascending\nheight and when displaced toward the tallest cilia, the mechanical gated channels open and the cell\nis excited (depolarized). When the stereocilia are displaced toward the smallest cilia, the channels\nclose and the cell is inhibited (hyperpolarized).\nStereotypes\nThe beliefs or attributes we associate with a speci\u0000c social group. Stereotyping refers to the act of\nassuming that because someone is a member of a particular group, he or she possesses the group’s\nattributes. For example, stereotyping occurs when we assume someone is unemotional just because\nhe is man, or particularly athletic just because she is African American.\nStimulants\nStimulants: a class of drugs that speed up the body’s physiological and mental processes.\nStimulus control\nWhen an operant behavior is controlled by a stimulus that precedes it.\nStorage\nThe stage in the learning/memory process that bridges encoding and retrieval; the persistence of\nmemory over time.\nStress\nA pattern of physical and psychological responses in an organism after it perceives a threatening\nevent that disturbs its homeostasis and taxes its abilities to cope with the event.\nStress\nA threat or challenge to our well-being. Stress can have both a psychological component, which\nconsists of our subjective thoughts and feelings about being threatened or challenged, as well as a\nphysiological component, which consists of our body’s response to the threat or challenge (see “\u0000ght\nor \u0000ight response”).\nStressor\nAn event or stimulus that induces feelings of stress.\nStria terminalis\nA band of \u0000bers that runs along the top surface of the thalamus.\nSubcortical\nStructures that lie beneath the cerebral cortex, but above the brain stem.\nSubliminal perception\nThe ability to process information for meaning when the individual is not consciously aware of that\ninformation.\nSuicidal ideation\nRecurring thoughts about suicide, including considering or planning for suicide, or preoccupation\nwith suicide.\nSulci\n(plural) Grooves separating folds of the cortex.\nSulcus\nA groove separating folds of the cortex.\nSulcus\n(plural form, sulci) The crevices or \u0000ssures formed by convolutions in the brain.\nSuperadditive e\u0000ect of multisensory integration\nThe \u0000nding that responses to multimodal stimuli are typically greater than the sum of the\nindependent responses to each unimodal component if it were presented on its own.\nSuperior temporal sulcus\nThe sulcus (a \u0000ssure in the surface of the brain) that separates the superior temporal gyrus from the\nmiddle temporal gyrus. Located in the temporal lobes (parallel to the ears), it is involved in\nperception of biological motion or the movement of animate objects.\nSympathetic nervous system\nA branch of the autonomic nervous system that controls many of the body’s internal organs. Activity\nof the SNS generally mobilizes the body’s \u0000ght or \u0000ight response.\nSympathetic nervous system\nA division of the autonomic nervous system, that is faster than its counterpart that is the\nparasympathetic nervous system and works in opposition to it. Generally engaged in “\u0000ght or \u0000ight”\nfunctions.\nSynapse\nJunction between the presynaptic terminal button of one neuron and the dendrite, axon, or soma of\nanother postsynaptic neuron.\nSynapse\nThe tiny space separating neurons.\nSynapses\nJunction between the presynaptic terminal button of one neuron and the dendrite, axon, or soma of\nanother postsynaptic neuron.\nSynaptic Gap\nAlso known as the synaptic cleft; the small space between the presynaptic terminal button and the\npostsynaptic dendritic spine, axon, or soma.\nSynaptic gap\nAlso known as the synaptic cleft; the small space between the presynaptic terminal button and the\npostsynaptic dendritic spine, axon, or soma.\nSynaptic vesicles\nGroups of neurotransmitters packaged together and located within the terminal button.\nSynesthesia\nThe blending of two or more sensory experiences, or the automatic activation of a secondary\n(indirect) sensory experience due to certain aspects of the primary (direct) sensory stimulation.\nSyntax\nRules by which words are strung together to form sentences.\nTarget cell\nA cell that has receptors for a speci\u0000c chemical messenger (hormone or neurotransmitter).\nTaste aversion learning\nThe phenomenon in which a taste is paired with sickness, and this causes the organism to reject—\nand dislike—that taste in the future.\nTemporal lobe\nAn area of the cerebrum that lies below the lateral sulcus; it contains auditory and olfactory (smell)\nprojection regions.\nTemporal Lobe\nThe part of the cerebrum in front of (anterior to) the occipital lobe and below the lateral \u0000ssure;\ninvolved in vision, auditory processing, memory, and integrating vision and audition.\nTemporal lobe\nThe part of the cerebrum in front of (anterior to) the occipital lobe and below the lateral \u0000ssure;\ninvolved in vision, auditory processing, memory, and integrating vision and audition.\nTemporal parietal junction\nThe area where the temporal lobes (parallel to the ears) and parieta lobes (at the top of the head\ntoward the back) meet. This area is important in mentalizing and distinguishing between the self and\nothers.\nTemporal Resolution\nA term that refers to how small a unit of time can be measured; high temporal resolution means\ncapable of resolving very small units of time; in neuroscience it describes how precisely in time a\nprocess can be measured in the brain.\nTemporal resolution\nA term that refers to how small a unit of time can be measured; high temporal resolution means\ncapable of resolving very small units of time; in neuroscience it describes how precisely in time a\nprocess can be measured in the brain.\nTemporally graded retrograde amnesia\nInability to retrieve memories from just prior to the onset of amnesia with intact memory for more\nremote events.\nTerminal button\nThe part of the end of the axon that form synapses with postsynaptic dendrite, axon, or soma.\nTestosterone\nThe primary androgen secreted by the testes of most vertebrate animals, including men.\nThalamus\nA structure in the midline of the brain located between the midbrain and the cerebral cortex.\nThalamus\nA part of the diencephalon that works as a gateway for incoming and outgoing information.\nThird-person perspective\nObservations made by individuals in a way that can be independently con\u0000rmed by other individuals\nso as to lead to general, objective understanding. With respect to consciousness, third-person\nperspectives make use of behavioral and neural measures related to conscious experiences.\nThreshold of excitation\nSpeci\u0000c membrane potential that the neuron must reach to initiate an action potential.\nTorsion\nA rotational eye movement around the line of sight that consists of a clockwise or counterclockwise\ndirection.\nTrance States\nTrance: a state of consciousness characterized by the experience of “out-of-body possession,” or an\nacute dissociation between one’s self and the current, physical environment surrounding them.\nTranscranial direct current stimulation (tDCS)\nA neuroscience technique that passes mild electrical current directly through a brain area by placing\nsmall electrodes on the skull.\nTranscranial magnetic stimulation (TMS)\nA neuroscience technique whereby a brief magnetic pulse is applied to the head that temporarily\ninduces a weak electrical current that interferes with ongoing activity.\nTransduction\nA process in which physical energy converts into neural energy.\nTransduction\nThe mechanisms that convert stimuli into electrical signals that can be transmitted and processed by\nthe nervous system. Physical or chemical stimulation creates action potentials in a receptor cell in\nthe peripheral nervous system, which is then conducted along the axon to the central nervous\nsystem.\nTransfer-appropriate processing\nA principle that states that memory performance is superior when a test taps the same cognitive\nprocesses as the original encoding activity.\nTransverse plane\nSee “horizontal plane.”\nTrichromacy theory\nTheory that proposes that all of your color perception is fundamentally based on the combination of\nthree (not two, not four) di\u0000erent color signals.\nTwin studies\nA behavior genetic research method that involves comparison of the similarity of identical\n(monozygotic; MZ) and fraternal (dizygotic; DZ) twins.\nTympanic membrane\nEar drum, which separates the outer ear from the middle ear.\nType A Behavior\nType A behavior is characterized by impatience, competitiveness, neuroticism, hostility, and anger.\nType B Behavior\nType B behavior re\u0000ects the absence of Type A characteristics and is represented by less\ncompetitive, aggressive, and hostile behavior patterns.\nUnconditioned response (UR)\nIn classical conditioning, an innate response that is elicited by a stimulus before (or in the absence\nof) conditioning.\nUnconditioned stimulus (US)\nIn classical conditioning, the stimulus that elicits the response before conditioning occurs.\nUnimodal\nOf or pertaining to a single sensory modality.\nUnimodal components\nThe parts of a stimulus relevant to one sensory modality at a time.\nUnimodal cortex\nA region of the brain devoted to the processing of information from a single sensory modality.\nVagus nerve\nThe 10th cranial nerve. The mammalian vagus has an older unmyelinated branch which originates in\nthe dorsal motor complex and a more recently evolved, myelinated branch, with origins in the\nventral vagal complex including the nucleus ambiguous. The vagus is the primary source of\nautonomic-parasympathetic regulation for various internal organs, including the heart, lungs and\nother parts of the viscera. The vagus nerve is primarily sensory (a\u0000erent), transmitting abundant\nvisceral input to the central nervous system.\nVasopressin\nA nine amino acid mammalian neuropeptide. Vasopressin is synthesized primarily in the brain, but\nalso may be made in other tissues. Vasopressin is best known for its e\u0000ects on the cardiovascular\nsystem (increasing blood pressure) and also the kidneys (causing water retention). Vasopressin has\ne\u0000ects on brain tissue, but also acts throughout the body.\nVergence angle\nThe angle between the line of sight for the two eyes. Low vergence angles indicate far-viewing\nobjects, whereas large angles indicate viewing of near objects.\nVestibular compensation\nFollowing injury to one side of vestibular receptors or the vestibulocochlear nerve, the central\nvestibular nuclei neurons gradually recover much of their function through plasticity mechanisms.\nThe recovery is never complete, however, and extreme motion environments can lead to dizziness,\nnausea, problems with balance, and spatial memory.\nVestibular e\u0000erents\nNerve \u0000bers originating from a nucleus in the brainstem that project from the brain to innervate the\nvestibular receptor hair cells and a\u0000erent nerve terminals. E\u0000erents have a modulatory role on their\ntargets, which is not well understood.\nVestibular system\nConsists of a set of motion and gravity detection receptors in the inner ear, a set of primary nuclei in\nthe brainstem, and a network of pathways carrying motion and gravity signals to many regions of\nthe brain.\nVestibulocochlear nerve\nThe VIIIth cranial nerve that carries \u0000bers innervating the vestibular receptors and the cochlea.\nVestibuloocular re\u0000ex\nEye movements produced by the vestibular brainstem that are equal in magnitude and opposite in\ndirection to head motion. The VOR functions to maintain visual stability on a point of interest and is\nnearly perfect for all natural head movements.\nVestibulo-ocular re\u0000ex\nCoordination of motion information with visual information that allows you to maintain your gaze on\nan object while you move.\nVicarious reinforcement\nLearning that occurs by observing the reinforcement or punishment of another person.\nVisual cortex\nThe part of the brain that processes visual information, located in the back of the brain.\nVisual hemi\u0000eld\nThe half of visual space (what we see) on one side of \u0000xation (where we are looking); the left\nhemisphere is responsible for the right visual hemi\u0000eld, and the right hemisphere is responsible for\nthe left visual hemi\u0000eld.\nWernicke’s area\nA language area in the temporal lobe where linguistic information is comprehended (Also see\nBroca’s area).\nWhat pathway\nPathway of neural processing in the brain that is responsible for your ability to recognize what is\naround you.\nWhere-and-How pathway\nPathway of neural processing in the brain that is responsible for you knowing where things are in\nthe world and how to interact with them.\nWhite coat hypertension\nA phenomenon in which patients exhibit elevated blood pressure in the hospital or doctor’s o\u0000ce\nbut not in their everyday lives.\nWhite matter\nThe inner whitish regions of the cerebrum comprised of the myelinated axons of neurons in the\ncerebral cortex.\nWhite matter\nRegions of the nervous system that represent the axons of the nerve cells; whitish in color because\nof myelination of the nerve cells.\nWorking memory\nShort transitory memory processed in the hippocampus.\nWorking memory\nThe ability to maintain information over a short period of time, such as 30 seconds or less.\nWorking memory\nThe form of memory we use to hold onto information temporarily, usually for the purposes of\nmanipulation.\nAbout Privacy Terms Licensing Contact © 2023 Diener Education Fund Comments or questions?"
}