{
    "text": "1\nWWWWWWWWWWhhhhhhhhhhaaaaaaaaaatttttttttt iiiiiiiiiissssssssss PPPPPPPPPPssssssssssyyyyyyyyyycccccccccchhhhhhhhhhoooooooooollllllllllooooooooooggggggggggyyyyyyyyyy??????????\nChapter\nAfter reading this chapter, you would be able to\n• understand the nature and role of psychology in understanding mind\nand behaviour,\n• state the growth of the discipline,\n• know the different fields of psychology, its relationship with other\ndisciplines, and professions, and\n• appreciate the value of psychology in daily life to help you understand\nyourself and others better.\nContents\nIntroduction\nWhat is Psychology?\nPsychology as a Discipline\nPsychology as a Natural Science\nPsychology as a Social Science\nUnderstanding Mind and Behaviour\nPopular Notions about the Discipline of Psychology\nEvolution of Psychology\nSome Interesting Landmarks in the Evolution of\nModern Psychology (Box 1.1)\nDevelopment of Psychology in India\nBranches of Psychology\nThemes of Research and Applications\nPsychology and Other Disciplines\nPsychologists at Work\nThe growth of the human mind Psychology in Everyday Life\nis still high adventure,\nKey Terms\nin many ways the highest\nSummary\nadventure on earth.\nReview Questions\nProject Ideas\n– Norman Cousins\nRationalised 2023-24 Introduction\nYou were, perhaps, asked by your teacher in the first class why you opted for\npsychology over other subjects. What do you hope to learn? If you were asked this\nquestion, what was your response? Generally, the range of responses which surface\nin class to this question are truly bewildering. Most students give inane responses,\nlike they want to know what others are thinking. But then one also comes across\nsuch responses as knowing oneself, knowing others or more specific responses like\nknowing why people dream, why people go out of their way to help others or beat\neach other up. All ancient traditions have engaged themselves with questions about\nhuman nature. The Indian philosophical traditions, in particular, deal with questions\nrelating to why people behave in the manner in which they do. Why are people\ngenerally unhappy? What changes should they bring about in themselves if they\ndesire happiness in their lives? Like all knowledge, psychological knowledge too\nis intended to contribute to human well-being. If the world is full of misery, it is\nlargely due to humans themselves. Perhaps, you have asked why a 9/11 or war\nin Iraq happened. Why innocent people in Delhi, Mumbai, Srinagar or in the North-\nEast have to face bombs and bullets? Psychologists ask what is in the experiences\nof young men which turn them into terrorists seeking revenge. But there is another\nside to human nature. You may have heard the name of Major HPS Ahluwalia,\nparalysed waist down because of an injury he suffered in a war with Pakistan,\nwho climbed the Mt. Everest. What moved him to climb such heights? These are not\nonly questions about human nature which psychology addresses as a human\nscience. You will be surprised to learn that modern psychology also deals with\nsomewhat nebulous micro-level phenomenon like consciousness, focusing attention\nin the face of noise, or supporters trying to burn down a shopping complex after\ntheir team had scored victory in a football game over its traditional rival. Psychology\ncannot claim that answers have been found to these complex questions. But it\nsurely has improved upon our understanding and how we make sense of these\nphenomena. The most striking aspect of the discipline, unlike other sciences, lies in\nthe study of psychological processes which are largely internal and available to\nhumans for observation within themselves.\npsychology was a study of the soul or mind.\nWHAT IS PSYCHOLOGY?\nBut since then it has moved away considerably\nAny knowledge discipline is hard to define. from this focus and established itself as a\nFirstly, because it evolves continuously. scientific discipline which deals with processes\nSecondly, because the range of phenomena it underlying human experience and behaviour.\nstudies cannot be captured by any one The range of phenomena it studies, some of\ndefinition. This is even more true of psychology. which we mentioned above, are spread over\nLong time back, students like yourself were told several levels, viz. individual, dyadic (two\nthat the term psychology is derived from two person) group, and organisational. They also\nGreek words psyche meaning soul and logos have biological as well as social bases.\nmeaning science or study of a subject. Thus, Naturally, therefore, the methods required to\n2\nPsychology\nRationalised 2023-24 study them also vary greatly depending on the try to understand how the mind works and to\nphenomenon one wants to study. A discipline help us improve the uses and applications of\nis defined both in terms of what it studies and these mental capacities.\nhow it studies. In fact, more in terms of how or Psychologists also study experiences of\nmethod/s it uses. Keeping this in view, people. Experiences are subjective in nature.\npsychology is defined formally as a science We cannot directly observe or know someone\nwhich studies mental processes, experiences else’s experience. Only the experiencing person\nand behaviour in different contexts. In doing can be aware or be conscious of her or his\nso, it uses methods of biological and social experiences. Thus, experiences are embedded\nsciences to obtain data systematically. It makes in our awareness or consciousness.\nsense of these data so that they can be Psychologists have focused on experiences of\norganised as knowledge. Let us try to pain being experienced by terminally ill\nunderstand the three terms used in the patients or of psychological pain felt in\ndefinition, namely, mental processes, bereavement, besides experiences which lead\nexperience, and behaviour. to positive feelings, such as in romantic\nWhen we say experiences are internal to encounters. There are some esoteric\nthe experiencing person, then we refer to states experiences also which attract the attention of\nof consciousness or awareness or mental psychologists, such as when a Yogi meditates\nprocesses. We use our mental processes when to enter a different level of consciousness and\nwe think or try to solve a problem, to know or creates a new kind of experience or when a\nremember something. One level at which these drug addict takes a particular kind of drug to\nmental processes are reflected is the brain get a high, even though such drugs are\nactivity. As we think or solve a mathematical extremely harmful. Experiences are influenced\nproblem, our brain activities can be observed by internal and the external conditions of the\nusing different techniques of brain imaging. experiencer. If you are travelling in a crowded\nHowever, we cannot say that brain activities bus during a hot summer day, you may not\nand mental processes are the same, although experience the usual discomfort if you are\nthey are interdependent. Mental activities and going for a picnic with some close friends. Thus,\nneural activities are mutually overlapping the nature of experience can only be understood\nprocesses but, they are not identical. Unlike by analysing a complex set of internal and\nthe brain, the mind does not have a physical external conditions.\nstructure or has a location. Mind emerges and Behaviours are responses or reactions we\nevolves as our interactions and experiences make or activities we engage in. When\nin this world get dynamically organised in the something is hurled at you, your eyes blink in\nform of a system which is responsible for the a simple reflex action. You are taking an\noccurrence of various mental processes. examination and can feel your heart pounding.\nBrain activities provide important clues as to You decide to go for a particular movie with a\nhow our mind functions. But the friend. Behaviours may be simple or complex,\nconsciousness of our own experiences and short or enduring. Some behaviours are overt.\nmental processes are much more than the They can be outwardly seen or sensed by an\nneural or brain activities. Even when we are observer. Some are internal or covert. When\nasleep some mental activities go on. We you are in a difficult situation while playing a\ndream, and receive some information such game of chess you almost feel your hand\nas a knock on the door while we are asleep. muscles twitching, trying to experiment with\nSome psychologists have shown that we also a move. All behaviours, covert or overt, are\nlearn and remember in our sleep. Mental associated with or triggered by some stimulus\nprocesses, such as remembering, learning, in the environment or changes that happen\nknowing, perceiving, feeling are of interest to internally. You may see a tiger and run or think\npsychologists. They study these processes to that there is a tiger and decide to flee. Some\n3\nChapter 1 • What is Psychology?\nRationalised 2023-24 psychologists study behaviour as an Many students go on to earn a B.Sc. or M.Sc.\nassociation between stimulus (S) and response degree in universities. In fact, two of the most\n(R). Both stimulus and response can be sought after emerging disciplines which\ninternal or external. continuously borrow from psychology are\nNeuroscience and Computer Science. Some of\nPsychology as a Discipline us would be aware of the fast developing brain\nimaging techniques like fMRI, EEG, etc. which\nAs we have discussed above, psychology\nmake it possible to study brain processes in real\nstudies behaviour, experience and mental\ntime, i.e. when they are actually taking place.\nprocesses. It seeks to understand and explain\nSimilarly, in IT areas, both human-computer\nhow the mind works and how different mental\ninteraction and artificial intelligence cannot\nprocesses result in different behaviours. When\npossibly grow without psychological knowledge\nwe observe others as lay or common persons,\nin cognitive processes. Thus, psychology as a\nour own points of view or our ways of\ndiscipline today has two parallel streams. One\nunderstanding the world influence our\nwhich makes use of the method in physical and\ninterpretations of their behaviours and\nbiological sciences and the other which makes\nexperiences. Psychologists try to minimise\nuse of the method of social and cultural\nsuch biases in their explanations of behaviour\nsciences in studying various psychological and\nand experience in various ways. Some do so\nsocial phenomena. These streams sometimes\nby seeking to make their analysis scientific\nconverge only to drift apart and go their\nand objective. Others seek to explain\nseparate ways. In the first case, psychology\nbehaviour from the point of view of the\nconsiders itself as a discipline, which focuses\nexperiencing persons because they think that\nlargely on biological principles to explain\nsubjectivity is a necessary aspect of human\nhuman behaviour. It assumes that all\nexperience. In the Indian tradition, self-\nbehavioural phenomena have causes which can\nreflection and analysis of our conscious\nbe discovered if we can collect data\nexperiences, is held to be a major source of\nsystematically under controlled conditions.\npsychological understanding. Many western\nHere the aim of the researcher is to know the\npsychologists have also begun to emphasise\ncause and effect relationship so that a prediction\nthe role of self-reflection and self-knowledge\nof the behavioural phenomenon can be made\nin understanding human behaviour and\nand behaviour can be controlled if need be. On\nexperience. Regardless of the differences in the\nthe other hand, psychology as a social science\nway psychologists go about the study of\nfocuses on how behavioural phenomena can be\nbehaviour, mental processes and experiences,\nexplained in terms of the interaction that takes\nthey seek to understand and explain them in\nplace between the person and the socio-\na systematic and verifiable manner.\ncultural context of which s/he is a part. Each\nPsychology, though it is a very old\nbehavioural phenomenon is assumed to have\nknowledge discipline, is a young science, if one\nmultiple causes. Let us now discuss these two\nwere to take the year of the founding of the\nstreams separately.\nfirst laboratory of psychology in 1879 in\nLeipzig. However, what kind of science is\nPsychology as a Natural Science\npsychology, still remains a matter of debate,\nparticularly because of the new interfaces of It has been mentioned earlier that psychology\nit that have emerged in recent times. has its roots in philosophy. However, modern\nPsychology is generally categorised as a social psychology has developed because of the\nscience. But it should not come to you as a application of the scientific method to study\nsurprise that, not only in other countries, but psychological phenomenon. Science places a\nin India also, it is also a subject of study offered great deal of emphasis on objectivity which\nin the faculty of science, both at the can be obtained if there is consensus on the\nundergraduate and post-graduate levels. definition of a concept and how it can be\n4\nPsychology\nRationalised 2023-24 measured. Psychology was influenced by from a farmer’s family. Her grandparents,\nDescartes and later on by the developments in parents and elder brother worked on their farm.\nphysics has grown by following what is called They lived together in their house in the village.\na hypothetico-deductive model. The model Ranjita was a good athlete and was the best\nsuggests that scientific advancement can take long distance runner in the school. She loved\nplace if you have a theory to explain a meeting people and making friends.\nphenomenon. For example, physicists have Unlike her, Shabnam lived with her mother\nwhat is called a Big-bang theory to explain in the same village. Her father worked in an\nhow the universe came to be formed. Theory office in a town nearby and came home during\nis nothing else but a set of statements about holidays. Shabnam was a good artist and loved\nhow a certain complex phenomenon can be staying home and taking care of her younger\nexplained with the help of propositions which brother. She was shy and avoided meeting\nare interrelated. Based on a theory, scientists people.\ndeduce or propose a hypothesis, that offers a Last year there was very heavy rain and\ntentative explanation of how a certain the river nearby overflowed into the village.\nphenomenon takes place. The hypothesis then Many houses in the low lying areas were\nis tested and proved true or false based on flooded. The villagers got together and\nempirical data that one has gathered. The organised help and gave shelter to people in\ntheory is revised if data gathered point in a distress. Shabnam’s house was also flooded\ndifferent direction than the one suggested by and she came to live in Ranjita’s house with\nthe hypothesis. Using the above approach her mother and brother. Ranjita was happy\npsychologists have developed theories of helping the family and making them feel\nlearning, memory, attention, perception, comfortable in her house. When the flood water\nmotivation and emotion, etc. and have made receded, Ranjita’s mother and grandmother\nsignificant progress. Till date, most of the helped Shabnam’s mother to set-up their house.\nresearch in psychology follows this approach. The two families became very close. Ranjita\nApart from this, psychologists have also been and Shabnam also became very good friends.\nconsiderably influenced by the evolutionary In this case of Ranjita and Shabnam, both\napproach which is dominant in biological\nare very different persons. They grew up in\nsciences. This approach has also been used\ndifferent families under complex social and\nto explain diverse kinds of psychological\ncultural conditions. You can see some\nphenomenon such as attachment and\nregularity in the relationship of their nature,\naggression to mention just a few.\nexperience and mental processes with their\nsocial and physical environment. But at the\nPsychology as a Social Science\nsame time, there are variations in their\nWe mentioned above that psychology is behaviours and experiences which would be\nrecognised more as a social science because difficult to predict using the known\nit studies the behaviour of human beings in psychological principles. One can understand\ntheir socio-cultural contexts. Humans are not why and how individuals in communities\nonly influenced by their socio-cultural become quite helpful and self-sacrificing in\ncontexts, they also create them. Psychology crisis as was the case with the people in the\nas a social science discipline focuses on village of Ranjita and Shabnam. But, even in\nhumans as social beings. Consider the that case, not every villager was equally helpful\nfollowing story of Ranjita and Shabnam. and also under similar circumstances not\nRanjita and Shabnam were in the same every community is so forthcoming; in fact,\nclass. Although, they were in the same class, sometimes, the opposite is true – people\nthey were just acquainted with each other and become antisocial under similar\ntheir lives were quite different. Ranjita came circumstances indulging in looting and\n5\nChapter 1 • What is Psychology?\nRationalised 2023-24 exploitation when some crisis occurs. This relationship between the mind and the body\nshows that psychology deals with human and that they were parallel to each other.\nbehaviour and experience in the context of Recent studies in affective neuroscience have\ntheir society and culture. Thus, psychology is clearly shown that there is a relationship\na social science with focus on the individuals between mind and behaviour. It has been\nand communities in relation to their socio- shown that using positive visualisation\ncultural and physical environment. techniques and feeling positive emotions, one\ncan bring about significant changes in bodily\nprocesses. Ornish has shown this in a number\nUNDERSTANDING MIND AND BEHAVIOUR\nof studies with his patients. In these studies a\nperson with blocked arteries was made to\nYou will recall that psychology was once\nvisualise that blood was flowing through her/\ndefined as a science of the mind. For many\nhis blocked arteries. After practicing this over\ndecades, the mind remained a taboo in\na period of time, significant relief was obtained\npsychology because it could not be defined in\nby these patients as the degree of blockage\nconcrete behavioural terms or its location\nbecame significantly less. Use of mental\ncould not be indicated. If the term “mind” has\nimagery, i.e. images generated by a person in\nreturned to psychology, we should thank\nher/his mind, have been used to cure various\nneuroscientists like Sperry and physicists like\nkinds of phobias (irrational fears of objects and\nPenrose, who have given it the respect which\nsituations). A new discipline called\nit deserved and now has. There are scientists\nPsychoneuroimmunology has emerged which\nin various disciplines including psychology,\nemphasises the role played by the mind in\nwho think that a unified theory of the mind is\nstrengthening the immune system.\na possibility, although it still is far away.\nWhat is mind? Is it the same as brain? It\nAAAAAccccctttttiiiiivvvvviiiiitttttyyyyy 1.1\nis true that mind cannot exist without brain,\nbut mind is a separate entity. This can be\nImagine and visualise yourself in the following\nappreciated on account of several interesting\nsituations. Mention three psychological processes\ncases that have been documented. Some\ninvolved in each situation.\npatients whose occipital lobes, which are 1. You are writing an essay for a competition.\nresponsible for vision, were surgically removed 2. You are chatting with a friend on an\nhave been found to be responding correctly to interesting topic.\n3. You are playing football.\nlocation and configuration of visual cues.\n4. You are watching a soap opera on TV.\nSimilarly, an amateur athlete lost his arm in\n5. Your best friend has hurt you.\na motorcycle accident but continued to feel 6. You are appearing in an examination.\nan “arm” and also continued to feel its 7. You are expecting an important visitor.\nmovements. When offered coffee, his 8. You are preparing a speech to deliver in your\nschool.\n“phantom arm” reached out to the coffee cup\n9. You are playing chess.\nand when someone pulled it away, he\n10. You are trying to figure out the answer of a\nprotested. There are other similar cases difficult mathematics problem.\ndocumented by neuroscientists. A young man Discuss your answers with the teacher and\nwho suffered brain injury in an accident, after classmates.\nhe returned home from the hospital, claimed\nthat his parents had been replaced by their\n“duplicates”. They were imposters. In each of POPULAR NOTIONS ABOUT THE DISCIPLINE\nthese cases, the person had suffered from\nOF PSYCHOLOGY\ndamage of some part of the brain but his\n“mind” had remained intact. It was earlier We mentioned above that everyday, almost\nbelieved by scientists that there is no everyone of us acts like a psychologist. We\n6\nPsychology\nRationalised 2023-24 try to understand why someone behaved in confidence. Dweck’s study tested this. She took\nthe manner in which s/he did and come up two groups of students who were trained for\nwith ready explanations. Not only this, most 25 days in solving math problems. The first\nof us have developed our own theory of group was given easy problems which they were\nhuman behaviour. If we want some worker always able to solve. The second group had a\nto perform better than s/he has in the past, mix of easy and difficult problems. Obviously,\nwe know that we will need to push her/him. in case of difficult problems, they failed.\nMaybe even use a stick because people are Whenever this happened Dweck told them that\nbasically lazy. Such popular theories of their failure was because they had not tried\nhuman behaviour based on common sense hard enough and persuaded them not to give\nmay or may not be true if investigated up and keep trying. After the training period\nscientifically. In fact, you will find that was over, a new set of math problems were\ncommon sensical explanations of human given to the two groups. What Dweck found\nbehaviour are based on hindsight and explain goes against common belief. Those who had\nvery little. For example, if a friend you love always succeeded because they were given\ngoes away to a distant place, what will easy problems, gave up much faster when they\nhappen to your attraction for her/him? There faced failure than those who had experience\nare two sayings which you may recall to of both success and failure and were taught\nanswer this question. One of them is “Out of to attribute failure to their lack of effort.\nsight, out of mind”. The second one is There are many other common sense\n“Distance makes the heart grow fonder”. Both notions which you may not find to be true.\nof them make opposite statements, so which Not too long ago it was believed in some\none is true. The explanation you choose will cultures that men are more intelligent than\ndepend on what happens in your life after women or women cause more accidents than\nyour friend leaves. Suppose you are able to men. Empirical studies have shown that both\nfind a new friend, the saying “Out of sight, of these are untrue. Common sense also tells\nout of mind” will be used by you or others to us that one is not able to give one’s best if you\nexplain your behaviour. If you are unable to are asked to perform before a large audience.\nfind a new friend, you will keep remembering Psychological studies have shown that if you\nyour friend fondly. In this case, the saying have practiced well, you may actually perform\n“Distance makes the heart grow fonder” will better because the presence of others helps\nexplain your behaviour. Notice that in both your performance.\ncases the explanation follows the occurrence It is hoped that as you go through this\nof behaviour. Common sense is based on textbook you will discover that many of your\nhindsight. Psychology as a science looks for beliefs and understanding of human behaviour\npatterns of behaviour which can be predicted will change. You will also gather that\nand not explained after the behaviour occurs. psychologists are different from astrologers,\nScientific knowledge generated by tantriks and palm readers because they\npsychology often runs against common sense. systematically examine propositions based on\nOne such example is a study performed by data to develop principles about human\nDweck (1975). She was concerned with behaviour and other psychological phenomena.\nchildren who gave up too easily when faced\nwith a difficult problem or failure. She AAAAAccccctttttiiiiivvvvviiiiitttttyyyyy 1.2\nwondered how they could be helped. Common\nsense tells us to give them easy problems in\nAsk a cross-section of students about what they\norder to increase their success rate so that\nthink psychology is? Draw a comparison between\ntheir confidence goes up. Only later should what they say and what the textbook tells you.\nwe give them difficult problems which they What conclusion can you draw?\nwill be able to solve because of their new-found\n7\nChapter 1 • What is Psychology?\nRationalised 2023-24 In the early 20th century, a new perspective\nEVOLUTION OF PSYCHOLOGY\ncalled Gestalt psychology emerged in\nPsychology as a modern discipline, which is Germany as a reaction to the structuralism of\ninfluenced to a large extent by Western Wundt. It focused on the organisation of\ndevelopments, has a short history. It grew out perceptual experiences. Instead of looking at\nof ancient philosophy concerned with the components of the mind, the Gestalt\nquestions of psychological significance. We psychologists argued that when we look at the\nmentioned earlier that the formal beginning world our perceptual experience is more than\nof modern psychology is traced back to 1879 the sum of the components of the perception.\nwhen the first experimental laboratory was In other words, what we experience is more\nestablished in Leipzig, Germany by Wilhelm than the inputs received from our environment.\nWundt. Wundt was interested in the study of When, for example, light from a series of\nconscious experience and wanted to analyse flashing bulbs falls on our retina, we actually\nthe constituents or the building blocks of the experience movement of light. When we see a\nmind. Psychologists during Wundt’s time movie, we actually have a series of rapidly\nanalysed the structure of the mind through moving images of still pictures falling on our\nintrospection and therefore were called retina. Thus, our perceptual experience is more\nstructuralists. Introspection was a procedure than the elements. Experience is holistic; it is\nin which individuals or subjects in a Gestalt. We will learn more about the Gestalt\npsychological experiments were asked to psychology when we discuss about the nature\ndescribe in detail, their own mental processes of perception in Chapter 5.\nor experiences. However, introspection as a Yet another reaction to structuralism came\nmethod did not satisfy many other in the form of behaviourism. Around 1910,\npsychologists. It was considered less scientific John Watson rejected the ideas of mind and\nbecause the introspective reports could not consciousness as subject matters of\nbe verified by outside observers. This led to psychology. He was greatly influenced by the\nthe development of new perspectives in work of physiologists like Ivan Pavlov on\npsychology. classical conditioning. For Watson, mind is not\nAn American psychologist, William James, observable and introspection is subjective\nwho had set up a psychological laboratory in because it cannot be verified by another\nCambridge, Massachusetts soon after the observer. According to him, scientific\nsetting up of the Leipzig laboratory, developed psychology must focus on what is observable\nwhat was called a functionalist approach to and verifiable. He defined psychology as a study\nthe study of the human mind. William James of behaviour or responses (to stimuli) which\nbelieved that instead of focusing on the can be measured and studied objectively.\nstructure of the mind, psychology should Behaviourism of Watson was further developed\ninstead study what the mind does and how by many influential psychologists who are\nbehaviour functions in making people deal known as behaviourists. Most prominent\nwith their environment. For example, among them was Skinner who applied\nfunctionalists focused on how behaviour behaviourism to a wide range of situations and\nenabled people to satisfy their needs. popularised the approach. We will discuss\nAccording to William James, consciousness Skinner’s work later in this textbook.\nas an ongoing stream of mental process Although behaviourists dominated the field\ninteracting with the environment formed the of psychology for several decades after Watson,\ncore of psychology. A very influential a number of other approaches and views about\neducational thinker of the time, John Dewey, psychology and its subject matter were\nused functionalism to argue that human developing around the same time. One person\nbeings seek to function effectively by adapting who shook the world with his radical view of\nto their environment. human nature was Sigmund Freud. Freud\n8\nPsychology\nRationalised 2023-24 viewed human behaviour as a dynamic unfold their inner potential. They argued that\nmanifestation of unconscious desires and behaviourism with its emphasis on behaviour\nconflicts. He founded psychoanalysis as a as determined by environmental conditions\nsystem to understand and cure psychological undermines human freedom and dignity and\ndisorders. While Freudian psychoanalysis takes a mechanistic view of human nature.\nviewed human beings as motivated by These different approaches filled the\nunconscious desire for gratification of pleasure history of modern psychology and provided\nseeking (and often, sexual) desires, the multiple perspectives to its development. Each\nhumanistic perspective in psychology took of these perspectives has its own focus and\na more positive view of human nature. draws our attention to the complexity of\nHumanists, such as Carl Rogers and Abraham psychological processes. There are strengths\nMaslow, emphasised the free will of human as well as weaknesses in each approach. Some\nbeings and their natural striving to grow and of these approaches have led to further\nBBBBBoooooxxxxx 1.1 SSSSSooooommmmmeeeee IIIIInnnnnttttteeeeerrrrreeeeessssstttttiiiiinnnnnggggg LLLLLaaaaannnnndddddmmmmmaaaaarrrrrkkkkksssss iiiiinnnnn ttttthhhhheeeee EEEEEvvvvvooooollllluuuuutttttiiiiiooooonnnnn ooooofffff MMMMMooooodddddeeeeerrrrrnnnnn PPPPPsssssyyyyyccccchhhhhooooolllllooooogggggyyyyy\n1879 Wilhelm Wundt establishes the first behaviourism as a major approach to\npsychology laboratory in Leipzig, psychology.\nGermany. 1954 Humanistic psychologist Abraham Maslow\n1890 William James publishes Principles of publishes ‘Motivation and Personality’.\nPsychology. 1954 Bureau of Psychology is established at\n1895 Functionalism is formulated as a system Allahabad.\nof psychology. 1955 National Institute of Mental Health and\n1900 Sigmund Freud develops Psychoanalysis. Neurosciences (NIMHANS) is established at\n1904 Ivan Pavlov wins the Nobel Prize for his Bangalore.\nwork on digestive system that led to 1962 Hospital for Mental Diseases in Ranchi is\nunderstanding of principles of established.\ndevelopment of responses. 1973 Konrad Lorenz and Niko Tinbergen win the\n1905 Intelligence test developed by Binet and Nobel Prize for their work on built-in species-\nSimon. specific animal behaviour patterns that\n1912 Gestalt psychology is born in Germany. emerge without any prior experience/\n1916 First Psychology Department at Calcutta learning.\nUniversity is established. 1978 Herbert Simon wins the Nobel Prize for work\n1922 Psychology is included in Indian Science on decision-making.\nCongress Association. 1981 David Hubel and Torsten Wiesel win the Nobel\n1924 Indian Psychological Association is Prize for their research on vision cells in the\nfounded. brain.\n1924 John B. Watson publishes ‘Behaviourism’, 1981 Roger Sperry wins the Nobel Prize for split-\na book that led to the foundation of brain research.\nbehaviourism. 1989 National Academy of Psychology (NAOP) India\n1928 N.N. Sengupta and Radhakamal Mukerjee was founded.\npublish the first textbook on Social 1997 National Brain Research Centre (NBRC) is\nPsychology (London : Allen & Unwin). established at Gurgaon, Haryana.\n1949 Psychological Research Wing of the 2002 Daniel Kahneman wins the Nobel Prize for\nDefence Science Organisation of India is research on human judgment and decision-\nestablished. making under uncertainty.\n1951 Humanistic psychologist Carl Rogers 2005 Thomas Schelling wins the Nobel Prize for his\npublishes Client-Centred Therapy. work in applying Game Theory to\n1953 B.F. Skinner publishes ‘Science and understanding of conflict and cooperation in\nHuman Behaviour’, strengthening economic behaviour.\n9\nChapter 1 • What is Psychology?\nRationalised 2023-24 developments in the discipline. Aspects of departure both within the country and abroad.\nGestalt approach and structuralism were These attempts have tried to establish the\ncombined and led to the development of the truth value of various assertions in Indian\ncognitive perspective which focuses on how philosophical traditions through scientific\nwe know about the world. Cognition is the studies.\nprocess of knowing. It involves thinking, The modern era of Indian psychology\nunderstanding, perceiving, memorising, began in the Department of Philosophy at\nproblem solving and a host of other mental Calcutta University where the first syllabus\nprocesses by which our knowledge of the world of experimental psychology was introduced\ndevelops, making us able to deal with the and the first psychology laboratory was\nenvironment in specific ways. Some cognitive established in 1915. Calcutta University\npsychologists view the human mind as an started the first Department of Psychology in\ninformation processing system like the the year 1916 and another Department of\ncomputer. Mind, according to this view is like Applied Psychology in 1938. The beginning of\na computer and it receives, processes, modern experimental psychology at Calcutta\ntransforms, stores and retrieves information. University was greatly influenced by the Indian\nModern cognitive psychology views human psychologist Dr. N.N. Sengupta who was\nbeings as actively constructing their minds trained in USA in the experimental tradition\nthrough their exploration into the physical and of Wundt. Professor G. Bose was trained in\nthe social world. This view is sometimes called Freudian psychoanalysis, another area which\nconstructivism. Piaget’s view of child influenced the early development of\ndevelopment which will be discussed later is psychology in India. Professor Bose\nconsidered a constructivist theory of established Indian Psychoanalytical\ndevelopment of the mind. Another Russian Association in 1922. Departments of\npsychologist Vygotsky went even further to Psychology in the Universities of Mysore and\nsuggest that the human mind develops Patna were other early centres of teaching and\nthrough social and cultural processes in which research in psychology. From these modest\nthe mind is viewed as culturally constructed beginnings, modern psychology has grown as\nthrough joint interaction between adults and a strong discipline in India with a large number\nchildren. In other words, while for Piaget of centres of teaching, research and\nchildren actively construct their own minds,\napplications. There are two centers of\nVygotsky took a view that mind is a joint\nexcellence in psychology supported by the\ncultural construction and emerges as a result\nUGC at Utkal University, Bhubaneswar and\nof interaction between children and adults.\nat the University of Allahabad. About 70\nuniversities offer courses in psychology.\nDEVELOPMENT OF PSYCHOLOGY IN INDIA Durganand Sinha in his book Psychology\nin a Third World Country: The Indian\nThe Indian philosophical tradition is rich in Experience published in 1986 traces the\nits focus on mental processes and reflections history of modern psychology as a social\non human consciousness, self, mind-body science in India in four phases. According to\nrelations, and a variety of mental functions him, the first phase till independence was a\nsuch as cognition, perception, illusion, phase with emphasis on experimental,\nattention and reasoning, etc. Unfortunately, psychoanalytic and psychological testing\nphilosophical roots in the Indian tradition have research, which primarily reflected the\nnot influenced the development of modern development of the discipline in western\npsychology in India. The development of the countries. The second phase till the 1960s was\ndiscipline in India continues to be dominated a phase of expansion of psychology in India\nby western psychology, although some into different branches of psychology. During\nattempts have been made to find points of this phase Indian psychologists showed a\n10\nPsychology\nRationalised 2023-24 desire to have an Indian identity by seeking to\nBRANCHES OF PSYCHOLOGY\nlink western psychology to the Indian context.\nThey did this by using western ideas to Various fields of specialisation in psychology\nunderstand the Indian situation. However, have emerged over the years. Some of these\npsychology in India sought to become relevant are discussed in this section.\nfor Indian society in the post 1960s phase of\nproblem-oriented research. Psychologists Cognitive Psychology investigates mental\nbecame more focused on addressing the processes involved in acquisition, storage,\nproblems of the Indian society. Further, the manipulation, and transformation of\nlimitations of excessive dependence on information received from the environment\nwestern psychology for our social context were along with its use and communication. The\nalso realised. Leading psychologists major cognitive processes are attention,\nemphasised the significance of research, which perception, memory, reasoning, problem\nis of relevance to our situation. The search for solving, decision-making and language. You\na new identity of psychology in India led to will be studying these topics later in this\nthe phase of indigenisation, which started textbook. In order to study these cognitive\nduring the late 1970s. Besides rejecting the processes, psychologists conduct experiments\nwestern framework, Indian psychologists in laboratory settings. Some of them also follow\nstressed the need for developing an an ecological approach, i.e. an approach which\nunderstanding based on a framework, which focuses on the environmental factors, to study\nwas culturally and socially relevant. This trend cognitive processes in a natural setting.\nwas also reflected in some attempts to develop Cognitive psychologists often collaborate with\npsychological approaches based on traditional neuroscientists and computer scientists.\nIndian psychology, which came from our\nBiological Psychology focuses on the\nancient texts and scriptures. Thus, this phase\nrelationship between behaviour and the\nis characterised by development in indigenous\nphysical system, including the brain and the\npsychology, which originated from the Indian\nrest of the nervous system, the immune\ncultural context and was relevant for society\nsystem, and genetics. Biological psychologists\nand Indian psychology based on the Indian\noften collaborate with neuroscientists,\ntraditional knowledge system. While these\nzoologists, and anthropologists.\ndevelopments continue, psychology in India\nNeuropsychology has emerged as a field of\nis making significant contributions to the field\nresearch where psychologists and\nof psychology in the world. It has become more\nneuroscientists are working together.\ncontextual emphasising the need for\nResearchers are studying the role of\ndeveloping psychological principles, which are\nneurotransmitters or chemical substances\nrooted in our own social and cultural context.\nwhich are responsible for neural\nAlongside, we also find that new research\ncommunication in different areas of the brain\nstudies involving interfaces with neuro-\nand therefore in associated mental functions.\nbiological and health sciences are being carried\nThey do their research on people with normal\nout.\nfunctioning brain as well as on people with\nPsychology in India is now being applied\ndamaged brain by following advanced\nin diverse professional areas. Not only have\ntechnologies like EEG, PET and fMRI, etc.\npsychologists been working with children\nabout which you will study later.\nhaving special problems, they are employed\nin hospitals as clinical psychologists, in Developmental Psychology studies the\ncorporate organisations in the HRD and physical, social and psychological changes\nadvertising departments, in sports that occur at different ages and stages over a\ndirectorates, in the development sector and life-span, from conception to old age. The\nin IT industry. primary concern of developmental\n11\nChapter 1 • What is Psychology?\nRationalised 2023-24 psychologists is how we become what we are. Health Psychology focuses on the role of\nFor many years the major emphasis was on psychological factors (for example, stress,\nchild and adolescent development. However anxiety) in the development, prevention and\ntoday an increasing number of developmental treatment of illness. Areas of interest for a\npsychologists show strong interest in adult health psychologist are stress and coping, the\ndevelopment and ageing. They focus on the relationship between psychological factors and\nbiological, socio-cultural and environmental health, patient-doctor relationship and ways\nfactors that influence psychological of promoting health enhancing factors.\ncharacteristics such as intelligence, cognition,\nClinical and Counselling Psychology deals\nemotion, temperament, morality, and social\nwith causes, treatment and prevention of\nrelationship. Developmental psychologists\ndifferent types of psychological disorders such\ncollaborate with anthropologists,\nas anxiety, depression, eating disorders and\neducationists, neurologists, social workers,\nchronic substance abuse. A related area is\ncounsellors and almost every branch of\ncounselling, which aims to improve everyday\nknowledge where there is a concern for growth\nfunctioning by helping people solve problems\nand development of a human being.\nin daily living and cope more effectively with\nchallenging situations. The work of clinical\nSocial Psychology explores how people are\npsychologists does not differ from that of\naffected by their social environments, how\ncounselling psychologists although a\npeople think about and influence others.\ncounselling psychologist sometimes deals with\nSocial psychologists are interested in such\npeople who have less serious problems. In\ntopics as attitudes, conformity and obedience\nmany instances, counselling psychologists\nto authority, interpersonal attraction, helpful\nwork with students, advising them about\nbehaviour, prejudice, aggression, social\npersonal problems and career planning. Like\nmotivation, inter-group relations and so on.\nclinical psychologists, psychiatrists also study\nthe causes, treatment, and prevention of\nCross-cultural and Cultural Psychology\npsychological disorders. How are clinical\nexamines the role of culture in understanding\npsychologists and psychiatrists different? A\nbehaviour, thought, and emotion. It assumes\nclinical psychologist has a degree in\nthat human behaviour is not only a reflection\npsychology, which includes intensive training\nof human-biological potential but also a\nin treating people with psychological disorders.\nproduct of culture. Therefore behaviour should\nIn contrast, a psychiatrist has a medical degree\nbe studied in its socio-cultural context. As you\nwith years of specialised training in the\nwill be studying in different chapters of this\ntreatment of psychological disorders. One\nbook, culture influences human behaviour in\nimportant distinction is that psychiatrists can\nmany ways and in varying degrees.\nprescribe medications and give electroshock\ntreatments whereas clinical psychologist\nEnvironmental Psychology studies the\ncannot.\ninteraction of physical factors such as\ntemperature, humidity, pollution, and natural\nIndustrial/Organisational Psychology deals\ndisasters on human behaviour. The influence\nwith workplace behaviour, focusing on both the\nof physical arrangement of the workplace on\nworkers and the organisations that employ\nhealth, the emotional state, and interpersonal them. Industrial/organisational psychologists\nrelations are also investigated. Current topics are concerned with training employees,\nof research in this field are the extent to which, improving work conditions, and developing\ndisposal of waste, population explosion, criteria for selecting employees. For example,\nconservation of energy, efficient use of an organisational psychologist might\ncommunity resources are associated with and recommend that a company may adopt a new\nare functions of human behaviour. management structure that would increase\n12\nPsychology\nRationalised 2023-24 communication between managers and staff. psychology, forensic psychology, rural\nThe background of industrial and psychology, engineering psychology,\norganisational psychologists often includes managerial psychology, community\ntraining in cognitive and social psychology. psychology, psychology of women, and political\npsychology, to name a few. Try the Activity 1.3\nEducational Psychology studies how people to reflect upon your interest areas in psychology.\nof all ages learn. Educational psychologists\nprimarily help develop instructional methods PSYCHOLOGY AND OTHER DISCIPLINES\nand materials used to train people in both\neducational and work settings. They are also Any discipline, which deals with people, would\nconcerned with research on issues of relevance definitely recognise the relevance of the\nfor education, counselling and learning knowledge of psychology. Similarly\nproblems. A related field, school psychology, psychologists also acknowledge the relevance\nfocuses on designing programmes that of other disciplines in understanding human\npromote intellectual, social, and emotional behaviour. This trend has led to the emergence\ndevelopment of children, including those with of interdisciplinary approach in the field of\nspecial needs. They try to apply knowledge of psychology. Researchers and scholars in\npsychology in a school setting. science, social science and humanities have felt\nthe significance of psychology as a discipline.\nSports Psychology applies psychological\nFigure 1.1 clearly shows the relationship of\nprinciples to improve sports performance by\npsychology with other disciplines. In studying\nenhancing their motivation. Sports psychology\nbrain and behaviour, psychology shares its\nis a relatively new field but is gaining\nknowledge with neurology, physiology,\nacceptance worldwide.\nbiology, medicine and computer science. In\nOther Emerging Branches of Psychology : studying human behaviour (its meaning,\nThe interdisciplinary focus on research and growth and development) in a socio-cultural\napplication of psychology has led to the context, psychology shares its knowledge with\nemergence of varied areas like aviation anthropology, sociology, social work, political\npsychology, space psychology, military science and economics. In studying mental\nactivities involved in creation of literary texts,\nmusic and drama, psychology shares its\nAAAAAccccctttttiiiiivvvvviiiiitttttyyyyy 1.3\nknowledge with literature, art and music. Some\nof the major disciplines linked to the field of\nThink about the areas of psychology that you have\npsychology are discussed below:\nread in the text. Go through the list given below\nand rank them from 1 (most interesting) to 11 (least\ninteresting). Philosophy : Until the end of the 19th century,\nCognitive psychology certain concerns that are now part of\nBiological psychology contemporary psychology like, what is the\nDevelopmental psychology\nnature of the mind or how do humans come to\nSocial psychology\nknow their motivations and emotions were the\nCross-cultural and cultural psychology\nconcerns of philosophers. In the later part of\nEnvironmental psychology\nHealth psychology the 19th century, Wundt and other\nClinical and counselling psychology psychologists adopted an experimental\nIndustrial/Organisational psychology approach to these questions and contemporary\nEducational psychology\npsychology emerged. Despite the emergence of\nSports psychology\npsychology as a science, it greatly draws from\nAfter going through this textbook and completing\nphilosophy, particularly with respect to\nthe course you may like to return to this activity\nand mark the changes in your ranking. methods of knowing, and various domains of\nhuman nature.\n13\nChapter 1 • What is Psychology?\nRationalised 2023-24 Medicine : Doctors have realised that the terms of how a ‘computer’ is structured, its\nmaxim, healthy body requires a healthy mind, memory organised, sequential and\nis actually true. A large number of hospitals simultaneous (read parallel) processing of\nnow employ psychologists. The role of information. Computer scientists and\npsychologists in preventing people from engineers are seeking to make computers not\nengaging in health hazardous behaviours and only more and more intelligent but also\nin adhering to the prescribed doctors’ regimen machines which can sense and feel.\nare some of the important areas where the two Developments in both these disciplines have\ndisciplines have come together. While treating brought about significant advancement in the\npatients suffering from cancer, AIDS, and the field of cognitive sciences.\nphysically challenged, or handling patients in\nLaw and Criminology : A skilled lawyer and\nthe Intensive Care Unit, and patients during\na criminologist requires knowledge of\npost operative care doctors have also felt the\npsychology in answering such questions as:\nneed for psychological counselling. A\nHow well a witness remembers an accident, a\nsuccessful doctor looks at the psychological\nstreet fight, or a murder? How well can s/he\nas well as physical well-being of the patients.\nreport such facts when taking the witness\nstand in the court? What factors influence the\nEconomics, Political Science and\ndecision which is taken by the jury? What are\nSociology: As sister social science disciplines,\nthe dependable signs of guilt and falsehood?\nthese three have drawn considerably from\nWhat factors are held important in holding a\npsychology and have enriched it as well.\nculprit responsible for her/his action? What\nPsychology has contributed a great deal to the\ndegree of punishment is considered just for a\nstudy of micro-level economic behaviour,\ncriminal act? Psychologists seek to answer\nparticularly in understanding consumer\nthese questions. Currently, a number of\nbehaviour, savings behaviour and in decision-\npsychologists are involved in research on such\nmaking. American economists have used data\nissues, the answers to which would help the\non consumer sentiments to predict economic\nlegal system of the country in the future.\ngrowth. Three scholars who have worked on\nsuch problems have received the Nobel Prize\nMass Communication : The print and the\nin Economics, namely H. Simon, D. Kahneman\nelectronic media have entered in our lives in a\nand T. Schelling. Like economics, political\nvery big way. They have a major influence on\nscience too draws considerably from our thinking, attitudes and our emotions. If\npsychology, particularly, in understanding they have brought us closer together, they\nissues related to exercise of power and have also reduced cultural diversities. The\nauthority, nature of political conflicts and their impact of media on the formation of attitudes\nresolutions, and voting behaviour. Sociology of children and their behaviour is a domain\nand psychology come together to explain and where both these disciplines come together.\nunderstand the behaviour of individuals within Psychology also helps in developing strategies\ndifferent socio-cultural contexts. Issues related for better and effective communication. A\nto socialisation, group and collective behaviour, journalist in reporting news must know the\nand intergroup conflicts gain from both these reader’s interests in the story. Since most stories\ndisciplines. deal with human events, knowledge of their\nmotives and emotions is very important. A story\nComputer Science : From the very beginning, will have more impact if it is based on a\nthe effort of computer science has been in background of psychological knowledge and\nmimicking the human mind. One can see it in insight.\n14\nPsychology\nRationalised 2023-24 Political Science Education Economics\nPhilosophy Music and Fine Arts\nPsychology\nComputer Science Law/Criminology\nMedicine/Psychiatry Mass Communication\nArchitecture and Engineering Sociology\nFig.1.1 : Psychology and Other Disciplines\n15\nChapter 1 • What is Psychology?\nRationalised 2023-24 Music and Fine Arts : Music and psychology social reforms, interventions at the individual\nhave converged in many areas. Scientists have levels are also needed in order to change. Many\nmade use of music in raising work of these problems are largely of psychological\nperformance. Music and emotions is another nature and they result from our unhealthy\narea in which a number of studies have been thinking, negative attitude towards people and\ncarried out. Musicians in India have recently self and undesirable patterns of behaviour. A\nstarted experimenting with what they call psychological analysis of these problems helps\n‘Music Therapy’. In this they use different both in having a deeper understanding of these\n‘Ragas’ for curing certain physical ailments. problems and also in finding their effective\nThe efficacy of music therapy still remains to solutions.\nbe proven. The potential of psychology in solving the\nproblems of life is being realised more and\nArchitecture and Engineering : At first glance more. Media has played a vital role in this\nthe relationship between psychology and respect. You may have seen on television\narchitecture and engineering would appear counsellors and therapists suggesting\nimprobable. But such is actually not the case. solutions to a variety of problems related to\nAsk any architect, s/he must satisfy her/his children, adolescents, adults and the elderly\nclients by providing mental and physical space people. You may also find them analysing vital\nthrough her design and satisfy aesthetically. social problems relating to social change and\nEngineers must also take into account human development, population, poverty,\nhabits in their plans for safety, for example, interpersonal or intergroup violence, and\non streets and highways. Psychological environmental degradation. Many\nknowledge helps in a big way in designing of psychologists now play an active role in\nall mechanical devices and displays. designing and executing intervention\nTo sum up, psychology is located at the programmes in order to provide people with a\nintersection of many fields of knowledge better quality of life. Hence, it is no surprise\npertaining to human functioning. that we find psychologists working in diverse\nsettings such as schools, hospitals, industries,\nprisons, business organisations, military\nPSYCHOLOGY IN EVERYDAY LIFE\nestablishments, and in private practice as\nThe discussion above may have clarified that consultants helping people solve problems in\npsychology is not only a subject that satisfies their respective settings.\nsome of the curiosities of our mind about Besides helping you in rendering social\nhuman nature, but it is also a subject that service to others, the knowledge of psychology\ncan offer solutions to a variety of problems. is also personally relevant to you in your day-\nThese may range from purely personal (for to-day life. The principles and methods of\nexample, a daughter having to face an alcoholic psychology that you will learn in this course\nfather or a mother dealing with a problem child) should be made use of in analysing and\nto those that may be rooted within the family understanding yourself in relation to others.\nset up (for example, lack of communication and It is not that we do not think about ourselves.\ninteraction among family members) or in a But very often, some of us think very highly\nlarger group or community setting (for example, of ourselves and any feedback that contradicts\nterrorist groups or socially isolated our opinion about ourselves is rejected\ncommunities) or may have national or because we engage in what is called a\ninternational dimensions. Problems related to defensive behaviour. In some other cases,\neducation, health, environment, social justice, persons come to acquire a habit of running\nwomen development, intergroup relations, etc. down themselves. Both conditions do not\nare pervasive. While the solution of these permit us to grow. We need to have a positive\nproblems may involve political, economic and and balanced understanding of ourselves. You\n16\nPsychology\nRationalised 2023-24 may use psychological principles in a positive\nmanner to develop good habits of study for Key Terms\nimproving your learning and memory, and for\nsolving your personal and interpersonal\nBehaviour, Behaviourism, Cognition,\nproblems by using appropriate decision-\nCognitive approach, Consciousness,\nmaking strategies. You will also find it of use Constructivism, Developmental psychology,\nto reduce or alleviate the stress of Functionalism, Gestalt, Gestalt psychology,\nexamination. Thus, the knowledge of Humanistic approach, Introspection, Mind,\nNeuropsychology, Physiological psychology,\npsychology is quite useful in our everyday life,\nPsychoanalysis, Sociology, Stimulus,\nand is rewarding from personal as well as\nStructuralism\nsocial points of view.\nSummary\n• Psychology is a modern discipline aimed at understanding the complexities of mental\nprocesses, experiences and behaviour of individuals in different contexts. It is treated as a\nnatural as well as a social science.\n• The major schools of psychological thought are structuralism, functionalism, behaviourism,\nGestalt school, psychoanalysis, humanistic psychology and cognitive psychology.\n• Contemporary psychology is multivocal as it is characterised by many approaches or\ndiverse views, which explain behaviour at different levels. These approaches are not\nmutually exclusive. Each provides valuable insights into the complexities of human\nfunctioning. The cognitive approach uses thought processes as central to psychological\nfunctions. The humanistic approach views human functioning as characterised by a desire\nto grow, be productive and fulfill human potential.\n• Today psychologists work in many specialised fields which have their own theories and\nmethods. They make efforts to develop theories and solve problems in specific domains.\nSome of the major fields of psychology are: cognitive psychology, biological psychology,\nhealth psychology, developmental psychology, social psychology, educational and school\npsychology, clinical and counselling psychology, environmental psychology, industrial/\norganisational psychology, sports psychology.\n• More recently a need is felt to have multi/interdisciplinary initiatives to arrive at a better\nunderstanding of reality. This has led to a collaboration across disciplines. Interests of\npsychology overlap with social sciences (e.g., economics, political science, sociology),\nbiosciences (e.g., neurology, physiology, medicine), mass communication, and music and\nfine arts. Such efforts have led to fruitful research and application.\n• Psychology is a discipline not merely contributing to the development of theoretical\nknowledge about human behaviour, but contributing to the solution of problems at different\nlevels. Psychologists are employed to help in diverse activities in a variety of settings\nincluding schools, hospitals, industries, training institutes, military and government\nestablishments. Many of them are doing private practice and are consultants.\nRRRRReeeeevvvvviiiiieeeeewwwww QQQQQuuuuueeeeessssstttttiiiiiooooonnnnnsssss\n1. What is behaviour? Give examples of overt and covert behaviour.\n2. How can you distinguish scientific psychology from the popular notions about the discipline\nof psychology?\n3. Give a brief account of the evolution of psychology.\n17\nChapter 1 • What is Psychology?\nRationalised 2023-24 4. What are the problems for which collaboration of psychologists with other disciplines\ncan be fruitful? Take any two problems to explain.\n5. Differentiate between (a) a psychologist and a psychiatrist (b) a counsellor and a clinical\npsychologist.\n6. Describe some of the areas of everyday life where understanding of psychology can be put\nto practice.\n7. How can knowledge of the field of environmental psychology be used to promote\nenvironment friendly behaviour?\n8. In terms of helping solve an important social problem such as crime, which branch of\npsychology do you think is most suitable. Identify the field and discuss the concerns of\nthe psychologists working in this field.\nPPPPPrrrrrooooojjjjjeeeeecccccttttt IIIIIdddddeeeeeaaaaasssss\n1. This chapter tells you about several professionals in the field of psychology. Contact a\npsychologist who fits into one of the categories and interview the person. Have a list of\nquestions prepared beforehand. Possible questions could be: (i) What kind of education is\nnecessary for your particular job? (ii) Which college/university would you recommend for\nthe study of this discipline? (iii) Are there many jobs available today in your area of work?\n(iv) What would a typical day at work be like for you – or is there no such thing as\n“typical”? (v) What motivated you to enter this line of work?\nWrite a report of your interview and include your specific reactions.\n2. Go to the library or some bookstore or surf the internet and obtain names of some books\n(fiction/non-fiction or films), which have reference to applications of psychology.\nPrepare a report giving a brief synopsis.\n18\nPsychology\nRationalised 2023-24"
}