{
    "text": "Cultural Anthropology/Human Rights\nHuman Rights\nHuman rights are defined by the United Nations as rights inherent to all human beings, whatever nationality, place of\nresidence, sex, national or ethnic origin, colour, religion, language, or any other status. The United Nations replaced the\nLeague of Nations in 1945, it is tasked to promote international co-operation and to create and maintain international order.\n[1]\nAcross history, in the many cultures of the world, human rights have varied significantly. With triumphs and setbacks\nranging from the American Civil Rights Movement to the genocide committed by the Khmer Rouge. One of the first\nnotable civil rights leaders was Bhimrao Ramji Ambedkar, played an intricate role in the formation of India’s Constitution,\nhe campaigned against the discrimination of the Dalits class (AKA\"The untouchables\"), and for more woman’s labor\nrights. In America, we see notable civil rights leaders such as Dr. Martin Luther King Jr. who was the most visible\nspokesperson of the Civil Rights Movement of the 1960's or Susan B Anthony, leading the American Equal rights\nAssociation campaigning for equal rights for women and other minority groups. These famous leaders only scratch the\nsurface of the history of thousands of leaders and activists fighting the never ending battle of inequality where one group of\npeople are treated significantly worse than another group of people because of a trait that may deem that group of people as\nlesser. However, cultures bias, whether it be racial, socioeconomic or gender based, has always halted the many social\nDr. Martin Luther King Jr., an\ngroups of the world from achieving equal human rights. It is in observing these former leaders' triumphs and cultures'\nAmerican icon of the civil rights\nfailures that it is possible to understand the movement of social progress throughout the globe.[2] movement in the 1960s.\nHistory\nIt would appear that all cultures, have some form of human rights whether written or unwritten. However, what is considered a human right and who benefits from\nthese human rights has varied drastically over time.\nPrior to the 20th century, there were no international written documents that would declare that all people have rights, simply based on their status as human.\nBefore the formation of the United Nations, many different countries had documents outlining the rights of its citizens, such\nas; the US Constitution, the English Bill of Rights, and many others. A major problem arises when one realizes that these\ndocuments do not assure rights for all people, often omitting women, people of color, and/or people of a certain religion or\nsocial class. The League of Nations, the first world intergovernmental organization whose goal was maintaining world peace,\ntried to create protections for minority groups, but the League ultimately failed, and so these protections never came to pass.[3]\nAfter the events of World War II, many countries became committed to the idea of universal human rights. Franklin Delano\nRoosevelt called for four essential freedoms: freedom of speech, freedom of religion, freedom from want, and freedom from\nfear. One of the oldest known human rights activism groups is called the Amnesty International group. This group was\nfounded in 1961 in London.\nEleanor Roosevelt holding the\nUniversal Declaration of Human The Universal Declaration of Human Rights outlines that all people are born free and equal, and that they have certain rights\nRights including the right to life and security, the right to not be enslaved or tortured, and the right to be recognized as a person before\nthe law, among others. Originally written by the United Nations -an intergovernmental organization that replaced the League\nof Nations in 1945. The United Nations was tasked to promote international co-operation and to create and maintain\ninternational order. Representatives from all over with different legal and cultural backgrounds wrote the Declaration, and it was drafted by the United Nations\nGeneral Assembly in 1948. The Declaration supports that all people have rights, no matter their race, gender, religion, or social status. Some of these rights\nguaranteed by the UDHR come into conflict with the traditions of some cultures, and has been the cause of certain conflicts (rights of a culture vs. right of the\nindividual) and many of the articles in the document are vague, and leave room for interpretation, but it is this document that declares that there are some rights that\nare inherent in all people. Individual counties have created additional documents that further dedicate themselves to the ideals of the UDHR while also granting\ntheir citizens additional rights.[3] However, some question and fight these rights since they were written with only with western society in mind. They do not take\ninto account how other cultures may see rights or what needs other cultures prioritize.\nCivil and Political Rights\nThe Universal Declaration of Human Rights is a document representing the foundation of\nestablished human rights laws. The document, a set of civil principles, was adopted by the UN\nGeneral Assembly in 1948. This document was written in response to the travesties of WWII\nand the Holocaust as an agreement between the UN Nations to hold higher standards of\nhuman rights. This document was a commitment by countries to abide by certain humane\nregulations regarding political, social, economic, and cultural rights of humans inside of a\nsystem.\nThe Civil and political rights form the original and main part of international human rights. It is\na class of rights that restrict the higher power of authority, such as the government, social Parties and signatories to the ICCPR\norganizations and private individuals from discriminating or repressing the freedom an\nindividual. Civil rights ensure protection from discrimination and protect the physical and\nmental well-being of an individual such as privacy and freedom of speech. Political rights include fairness in law, fair trial and other civil rights in the judicial\nsystem.\nThe International Covenant on Civil and Political Rights(ICCPR) is a United Nations treaty based on the Universal Declaration of Human Rights, created in\n1966 and entered into force on 23 March 1976. The International Covenant on Civil and Political Rights is monitored by the Human Rights Committee (a separate body to the Human Rights Council which\nreplaced the Commission on Human Rights under the UN Charter in 2006) with permanent standing, to consider periodic reports submitted by member States on\ntheir compliance or following with the treaty. Members of the Human Rights Committee are elected by member states, but do not represent any State. The\nCovenant contains two Optional Protocols. The first optional protocol creates an individual complaints mechanism whereby individuals in member States can\nsubmit complaints, known as communications, to be reviewed by the Human Rights Committee. Its rulings under the first optional protocol have created the most\ncomplex jurisprudence or the theory or philosophy of law in the UN international human rights law system. The second optional protocol abolishes the death\npenalty; however, countries were permitted to make a reservation allowing for use of death penalty for the most serious crimes of a military nature, committed\nduring wartime.[4]\nEconomic, Social and Cultural Rights\nstates parties\nnon-state parties signatories\nnon-state parties non-signatories\nThe International Covenant on Economic, Social and Cultural Rights (ICESCR) is a\nmultilateral treaty adopted by the United Nations General Assembly on December 16, 1966,\nand in force from January 3, 1976. It commits its parties to granting economic, social, and\ncultural rights (ESCR) to individuals; including labor rights, rights to health, education, and an\nadequate standard of living. The United Nations replaced the League of Nations in 1945, as of\nDecember 2008, the Covenant had 159 parties.[5] A further seven countries have signed, but States parties and signatories to the ICESCR\nhave yet to ratify the Covenant.\nThe United Nation's many attempts to create peace in Northern Uganda example of the ICESCR's efforts to advance human rights. As discussed in Sverker\nFinnstrom's article in American Ethnologist, The Acholi peoples of Uganda, whose rights have been at stake for over two decades, have continued to make steps\ntoward a more stable economy despite having been largely displaced into refuge camps . The UN in its attempt to regain this cultures natural human rights\nprograms are working to put the rebel forces out .[6]\nThe ICESCR is part of the International Bill of Human Rights, along with the Universal Declaration of Human Rights (UDHR) and the International Covenant on\nCivil and Political Rights (ICCPR), including the latter's first and second Optional Protocols.[7]\nLabor Rights\nAs more nations participate in global trade, labor rights issues continue to arise. In the interest of globalization, companies continue to move their production to\nunderdeveloped countries with less regulation and cheaper labor. Globalization can be defined as the process through which businesses or other organizations\ndevelop international influence or operate on an international scale. Exploitation of laborers can include long hours, unsafe working conditions, lack of sick leave,\nvacation, or compensation. Compensations usually refers to money, awarded to someone as a recompense for loss, injury or suffering. This all renders the chances\nof upward mobility non-existent. Manufacturing industries of apparel and agriculture are some of the industries with the worst of these problems. (Cite)\nThe International Labor Organization (ILO) is a UN agency founded in the early 20th century. It is dedicated to tackling international labor issues and is composed\nof 187 member states of the UN. The organization received the 1969 Noble Peace Prize.[8]\nThe ILO defines decent working conditions as:[9]\nNeed for daily, weekly and perhaps annual limits on working hours\nImportance of keeping overtime acceptable, limiting the number of additional hours and providing compensation\nRight to regular and uninterrupted weekly rest\nRight to paid annual leave\nNeed to keep night-time work acceptable and warranting special protection\nImportance of enterprises’ needs in respect of flexible working-time arrangements\nRight to collective bargaining and the full and genuine consultation of employers’ and workers’ representatives on working time regulation\nNeed for an effective labor inspection system or other enforcement measures to prevent and punish abusive practices\nAn example of a labor rights may be portrayed in within the apparel industry. Violations of worker’s rights in the apparel industry typically manifest in developing\nnations, where labor regulation is not enforced or hasn't caught up with the developed world. The popular term “sweatshop”, is used to label factories/workplaces\nthat routinely exploit and under-provide for the employees. Because of the higher profit margins to be made with production in developing countries, labor is\nmoved abroad, and fiercely competed for. This effectively causes what is known as “race to the bottom” practices. Though awareness of these practices has\nbecome more publicized, the demand for inexpensive goods has only risen with time.[10]\nReproductive Rights\nReproductive rights were first established as a subset of human rights at the United Nation's 1968 International Conference on Human Rights.[3] The sixteenth\narticle of the resulting Proclamation of Teheran states, \"Parents have a basic human right to determine freely and responsibly the number and the spacing of their\nchildren.\"[4][5] Reproduction rights revolve around the decision of an individual to reproduce and maintain reproductive health. This includes the right to plan a\nfamily, terminate a pregnancy, use contraceptives, receive sex education in public schools, and gain access to reproductive health services [1] (http://family.findlaw.\ncom/reproductive-rights/what-are-reproductive-rights-.html). As reproduction rights are more clearly defined later in this section, the main question to be asked is:\nto what extent should women have control, or rights, over their reproductive systems?\nPro-life and Pro-choice\nMost people when asked whether they are pro-life or pro-choice supporters could give an answer that's a mixture of both because the topic itself is very complex.\nIf someone considers themselves to be pro-life, that does not automatically mean that they are anti-choice (and vice versa). Pro-choice supporters support the\nmovement or idea that women have the right to choose whether or not they will bring a child into the world. Pro-choice gives the opportunity for people to have a\nsafe abortion. It allows them to make their own \"choice\". Abortions were originally illegal until the late 1960's and early 1970's due to repealing the laws within\nsome states. Pro-life, on the other hand, is usually categorized as not being in favor of abortions because they violate the babies rights. For some it goes as far as to wanting abortions to be illegal in the United States again. The main reason behind this is that babies in the womb are still considered to be humans, and it is illegal\nto kill another human being. This is where both men and women's perspectives are considered because it becomes a conversation about killing another human, not\njust about a woman and if she is having a baby or not. However many pro-choice supporters counter this and would argue that if a woman does not have the\nfinancial stability, health care, support, etc. ,then it is her right to a healthy and safe abortion. Overall, this topic is still an issue that the United States is facing today\nand perhaps one way to solving it is an understanding of both perspectives before preconceived judgement makes the decision first.\nNative American Graves Protection and Repatriation Act\nOn 16 November 1990, a United States federal law passed that requires federal agencies and institutions to return Native American human remains and cultural\nitems to their respective peoples. This federal law was called the Native American Graves Protection and Repatriation Act, also known as NAGPRA. Some of\nthese cultural artifacts include funeral objects, religious objects, and objects of cultural patrimony. Patrimony is property that is passed down from father to son, or\nfrom one male ancestor to another. These federal agencies and institutions receive funding in order to do this. With this act, people are entitled to their culture both\nduring life and after death. A NAGPRA outline allows us to know who should gain ownership of the remains if it is unclear to who it should belong to.\nNAGPRA and Ownership\n1. Ownership resides with any lineal descendants\n2. If no lineal descendants, ownership resides with (in order) :\n1. The tribe on whose land the remains or objects were found or\n2. The tribe who has closest cultural affiliation with the remains and who stakes a claim or if undetermined\n3. The tribe who is recognized as aboriginally occupying land that was determined to be traditionally theirs by the Indian Claims\nCommission, unless\n4. Preponderance of the evidence shows that another tribe has a stronger cultural affiliation that the tribe id’ed by the ICC\nRights versus Culture, Rights to Culture\nRights to Culture ensure that an individual, or a group of individuals, all have the rights to participate in, and enjoy their culture. This includes aspects such as the\nright to take part in cultural life, a guarantee of cultural conservation but still development, and protection from harmful cultural practices.\nIn discussing rights and culture there are two assumptions that people often make: •Cultures are unchanging. •In a given society there is only one acceptable\nculture that everyone must abide by.\nThese assumptions may cause problems within a group of people in multiple ways. When new rights are accepted in a culture that is normally unchanging, that\nnew right may create conflict within the culture due to many of the varying viewpoints within the group. For example the issue of unveiling Muslim women so that\nthey would no longer be oppressed. While Westerners are using the etic point of view without understanding fully what the veil means to the Muslim women as\npart of their culture and their religion. This is where rights and culture may not agree. Culture and human rights sometimes disagree, and new human rights may\ncontradict accepted norms within a culture.\nHuman Rights and Cultural Relevance\nORGANIZATIONS THAT PROMOTE HUMANS RIGHTS\nCultural anthropologists study the world around them in order to better understand the differences of all various cultures. Even with human rights clearly defined in\na universal list of 30 articles; there still can be unclear cultural practices that question these articles by law and by morality of some. Today many organizations\nhave been formed to protect and fight for the rights of all man-kind. The list includes:\nAmnesty International: The oldest, largest human rights group focused on individual, local human rights activism. Because AI stays strictly out of politics and\navoids getting involved in issues outside its rather narrow mandate (area of concern), people from all sorts of political and religious backgrounds are members and\nwork together.\nElectronic Frontier Foundation: Founded to promote and extend the concept of civil liberties to on-line communications. While the EFF is a U.S.-based group\nwhose main focus is on U.S. law, it has a number of \"sister organizations\" in other countries.\nHuman Rights Watch: Founded in 1978 as Helsinki Watch, is a coalition formed by a number of independent regional human groups. They are perhaps the best\nhuman rights researchers in the field at present—their reports are extremely thorough, carefully written, and backed by impressive amounts of detail and numerous\nsources. They are a non-profit organization that defends the rights of people world-wide by staying neutral in political situations and by publishing over 100\ndetailed reports in 90 countries on human rights conditions. They also meet with government leaders and groups like the United Nations and the African Union\nalong with financial institutions and corporations to attempt to press change upon nations struggling in human rights.[11]\nPeacenet: Not a human rights group itself, but rather the first and largest computer network for activists in peace, human rights, and related issues. Peacenet is run\nby the Institute for Global Communications (IGC), an activity of the Tides Foundation, a San Francisco-based non-profit trust. It is a member of the Association for\nProgressive Communications, an international coalition of networks for peace and human rights activists. This is a good group for the hard core, on-line\nactivists.[12]\nWomen’s Rights in America\nToday woman hold the right to vote, birth control, formal education, own land, divorce, etc. This was not true for much of America's history. The woman’s right\nmovement in the United States began in 1848 with Elizabeth Cady Stanton's draft of The Declaration of Sentiments, which drew attention to the oppression of\nwoman in the US.[13] At the conclusion of the Civil War in 1865, the 15th amendment was passed giving African Americans the right to vote, and marking the\ndate when women found themselves the last social group in the United States not allowed to vote.[14] Around 1914, most women's activists were focused on the\nright to vote. In New York City, women's movements “revived flagging local organizations, introduced new lobbying techniques, standardized membership lists,\nand established a state headquarters”.[15] People all over were rallying and protesting for the woman's right to vote, which was rectified on August 18, 1920, 144\nyears after the US was founded, with the addition of the 19th amendment to the Constitution.[16]\nLabor, Land, and Women’s Rights in Africa LEGAL RIGHTS\nRecent developments illustrate an increasing awareness of the status of women’s rights in Africa and social well-being of\nwomen is contingent on rights to equality, health, education, and political participation in economic, electoral, and\ncustomary institutions. Legal instruments of the African system largely ignored women’s rights until recent years. The 1963\nCharter of the Organization of African Unity (OAU) made no mention of women. African nations designed the region’s\nprimary human rights document—the African Charter—in 1981 to protect state sovereignty. The African Charter references\nwomen only twice: Article 2 includes sex in a broad non-discrimination clause and Article 18(3) requires states to eliminate\nevery discrimination against women. The definition of employment at the most general level an activity for which one This satirical 1869 cartoon is an\nreceives payment needs some elaboration in the African context. example of the propaganda used in\nthe Womens' Rights Movement.\nUNPAID AND PAID LABOR\nEmployment for women in Africa is characterized by subsistence and small-scale farming, and their participation in informal trade is connected to agriculture, as\nopposed to what might be normally understood as paid labor. This “unpaid” work is typically tied to women’s duties as mothers and wives, and to their\ncommunity. African women’s agricultural labor, including subsistence and small-scale farming, will be referred to as “informal” labor and is distinguished from\nformal or salaried/contractual work. It is in this “informal” labor context that African human rights could usefully qualify and add to the existing international\nobligations of African states by framing labor rights in terms of salaried employment. Yet the Protocol adheres to a definition of labor that differentiates between\nemployment and agricultural work. The rights related to employment focus on equal pay and freedom from harassment- however the consequences regarding\nwomen are not clearly instated. In this regard, the Protocol is limited in its ability to address the obstacles that women face in developing and owning land and the\nimpact of these obstacles on women’s ability to sustain a living wage. Living wage refers to the pay rate that allows for one to meet the basic needs within their\nhousehold. Before analyzing the provisions regarding labor and employment in the Protocol more carefully, it is useful to explore the context in which many\nAfrican women perform their labor. Although specific employment patterns diverge across Africa, regional patterns seem to exist: 80% of African women do\nagricultural work, which is the mainstay of most East African economies, and few women perform salaried professional and clerical work. Clerical work includes\nwork in an office, especially routine documentation and administrative tasks. Sub-Saharan African countries, like Kenya, reflect similar employment patterns:\nwomen are largely excluded from formal, paid employment and they constitute almost half of the agricultural workforce and 70% to 80% of all subsistence\nfarmers. The chief reasons cited for women’s exclusion from the formal sector are lack of education, poor mobility, restrictions on reproductive choice, and\nworkplace discrimination.\nreferences: baobabwomen.org,apic.igc.org/docs96/wom9607.htm, apic.igc.org/docs96/wom9607.htm web.africa.ufl.edu/asq/v2/v2i3a2.htm\nFemale Genital Cutting: two sides\nIt is estimated that over 200 million girls today have undergone some type of female genital cutting. Each year, more than 3 million young girls and women are at\nrisk of undergoing FGC. Mostly practiced in Africa, female genital cutting(FCG) has many different levels of severity, with three main varieties of the procedure.\nThe first is Sunna (meaning “tradition\" in Arabic) Circumcision which involves the removal of the prepuce, or retractable fold of skin, or hood, and/or the tip of the\nclitoris. The second type is a clitoridectomy, which consists of the removal of the entire clitoris (prepuce and glands) and the removal of the adjacent labia. Lastly is\ninfibulation, or pharaonic circumcision (Female genital mutilation). Infibulation involves a clitoridectomy followed by the remaining tissue being stitched closed,\nleaving a small hole to allow for urine and menstrual blood to flow through. Most cases of female genital cutting occurs between the ages of four and eight and the\nuse of anesthesia is rare. FGC is practiced in order for the women of their culture to be accepted; it is the beginning of being a women. Although there are different\nreligions that practice FGC not one of these groups require it. The reactions to FGC involve national action and law.\nThe view on female genital cutting is a prime example of cultural relativism. Cultural relativism is a principle that someone should withhold judgement on another\nculture's beliefs or practices that differ from their own. That being said female genital cutting would require cultural relativism from a western prospective, because\na lot of times it is viewed as inhumane and a violation of human rights. However, from the prospective of a member of a village in Africa that does practice female\ngenital cutting (such as Senegal), this may be a social normalcy compared to male circumcision in the United States.\nFGC is a controversial issue that does not have a clear and concise answer. An international campaign to eliminate female genital cutting has been active since the\nearly 90's, actively attempting to divorce itself from a health framework, adopting instead a human rights framework to justify the intervention.[17] In Western\nculture genital cutting is not accepted. But with the numbers of circumcised women in the millions there is a strong conviction for many cultures to maintain the\nact. Different cultural factors affect the beliefs all over the world about whether the act of genital cutting is an appropriate action. There are many negative factors\nregarding genital cutting; effects include extreme pain, susceptibility to infection, death, HIV susceptibility, abscesses and small benign tumors, hemorrhages,\nshock, clitoral cysts, and decreased, if not elimination, of sexual pleasure. Long term effects may include kidney stones, sterility, sexual dysfunction, depression,\nurinary tract infections, various gynecological problems, and problems with child birth. For us in the Western part of the world it seems ridiculous to go under such\na risky procedure just to be accepted. The upside of the cultural cutting is that the girls can now be respected adults among the community and start a family,and\nthe fact that this custom has been practiced throughout their culture for many generations. In Sudan, for example, a family's honor derives from a woman's sexual\nconduct and by practicing genital cutting families can curb their sexual desires. These unbalanced side effects cause uproar among human rights activists For more\ninformation on genital cutting see Female Genital Cutting.\nMale Circumcision\nMale circumcision is a surgery that removes the foreskin from the tip of the penis and is most commonly performed on infants or children for religious or social\npurposes. Some claim a hygienic basis to the procedure, although others argue that circumcision can have lasting negative effects. Some research has suggested\nthere may be an effect on penile sensitivity[18], although this remains a contentious point of debate in medical circles.\nIn the late 1800s, male circumcision was popularized in the English-speaking world by such figures as Dr. John Harvey Kellogg, who considered masturbation as\nextremely unhealthy. He thought that circumcising young boys would curb their interest in self-pleasure and advocated for not using any sort of anesthetic,\nbelieving the unrelieved pain would end their “self-abuse.” During this time, a wide variety of other claims were propagated.[19]\nMale circumcision varies in a number of ways from female circumcision. The biggest difference between the two is the amount of tissue being removed and where\nthey are accepted culturally. In male circumcision, the foreskin is removed but never any tissue from the penile shaft. However when a female is circumcised, often\ntimes the clitoris and labia are removed which may lead to many life-threatening issues later in life. The healing period is also very different between male and\nfemale circumcision. Male circumcision can take a few days to a week in newborns and up to 2 months in adults to heal. Women face a longer healing period,\nlasting months. In some cases, the woman's mutilated vagina will not heal in her lifetime.[20] Male circumcision is also widely accepted in Western culture whereas\nfemale circumcision is considered to be incredibly taboo due to the extensive pain and healing process. Female and male genital cutting can also occur to intersex babies immediately following birth. If the clitoris or penis is too long or too short at birth then the parents\ncan opt in for surgery allowing the cutting of genitals to conform to binary gender norms. Intersex babies are incredibly common and are often recognized as a\nthird gender.\nEntitlements\nEntitlements are the rights which are socially defined to resources that sustain life, this means access to basic human rights and social freedoms. It is provision\nmade in accordance with a legal framework of a society. These include actions such as the right to strike, the right to a minimum set of (daily, weekly and yearly)\nwork hours, the age of retirement, to bear arms, to create unions, associations and cooperatives and etc. There is a clear correlation in between the level of social\nand economic development of a nation and support for entitlements. They have also an effect on the level of citizen happiness and reduce social conflicts. In many\ndeveloping countries where entitlements are not as explicitly defined and enforced as they are in first world countries, it is a struggle for citizens maintain their\nentitlements. In the Western world, social pressures, especially by the middle class, have established government entitlement programs created with the intention of\nmaintaining equality in employment opportunities, access to clean water, healthcare, minimum wage, and correct any other biases in the prevailing social economic\nsystem or due to geographic distribution of the population.[CitationNeeded 1]\nEntitlements in the United States\nIndividualism and Independence are common characteristics of Americans. The Rugged Individualistic mentality that many Americans profess comes in conflict\nwith the concept of entitlements. The Bill of Rights, being the hardest to be undone, is viewed as nonnegotiable. There is a duality present in the United States\npolitical spectrum that can lead to fierce debates between opposing sides on the topics of entitlements, rights, social justice, and individualism versus the\ncollectivism.\nOne view concerning entitlements in the United States is that the country is cover-obligated when it comes to entitlements and that it may bankrupt the nation.[21]\nThis notion of course does not make any sense as soon as one analyzes the expenditures in the nation's budget, and consider the effect of entitlements in increasing\nnormal state revenue and in distorting perceptions in regards to increases in the tax burden. There is also the argument that U.S. debt is a result of immense military\nspending, not entitlement payments. For example, Wallsten and Kosec [22] estimate that the U.S. is spending approximately $200 billion per year on military\nexpenditures (expenses).\nSome believe this idea of entitlement is hurting the U.S on a national level, and believe it is also damaging the citizens at a more personal level. They may think\nthat people do not really contribute to their workplace, that they simply show up and have 'face time' and expect that simply because they are there they are entitled\nto get their raise or promotion. This believe comes from Phillipe Bourgois’ article “Workaday World, Crack Economy”, describes, although this sense of\nentitlement is felt many people from areas such as East Harlem, simply quit working legally all together.[23] Although this mindset is believed to be widespread and\ndoes exist, it can cause the work ethic and motivation of employees to drop, which decreases their productivity.[24] The contrary argument can also be used, better\nwork ethics and increased motivation by guaranteeing job security and better pay may indeed increase productivity or at least improve social stability and future\nplanning.\n[25]\nCultural Imperialism\nCultural Imperialism was first conceptualized during the Cold War. It can be explained as an undermining of the cultural aspects of imperialism, which is the\nmaking and maintaining of relationship among civilizations which are unequal. There are two ideas on which it is based. The first is that a culture could have the\npotential to control a different culture; while the second is cultural domination by one culture will eventually destroy the lesser culture(s). A common, incorrect\nexample of cultural imperialism is the Western culture imperialism across the world, which is erasing local traditions and replacing them with cell phones,\nMcDonald's, and radios. However, anthropologists dismissed this because of three things. Cultural imperialism assumes the citizens do not have the means of\nresisting anything of Western origin; non-Western music, food, and material have been able to integrate into Western Europe and the United States. Cultural\nImperialism ignores the fact that cultural forms and practices sometimes move around the world, without ever reaching the West. Cultural imperialism depicts the\nreality of unequal relationships among society and cultures, and focuses on the more powerful civilians within these cultures/societies.\nCultural Hybridity\nAnthropologists were not satisfied with the discourse of cultural imperialism, so they began to search for alternative ways of understanding how global culture\nflows. That is when the phrase borrowing-with-modification came to be. Borrowing cultural forms or practices from elsewhere always involves borrowing-with-\nmodification. This phrase refers to the idea that people never adopt blindly, but always adopt what they borrow for local purposes. In other words people rarely\naccepted ideas, practices or objects from elsewhere without finding a way of adapting them to local practices in order to serve local purposes. This form of cultural\nchange is very different from having something from elsewhere forced upon you, like cultural imperialism suggests. Instead it is a Cultural hybridity, the borrowing\nand modification of ideas from other cultures within a culture. Today this merging is dominated by American ideals by media. Most movies in Europe are primarily\namerican while two out of every three films show in Africa are from Hollywood.[26][27]\nGender variance is when the actions or gender expression by an individual do not match the gender norms of their perceived gender by society. Anthropologists\nhave studied different cultures and the Gender variances that have emerged in these societies. In some societies these gender variances have been more widely\naccepted and even integrated into the culture. The concept of a Third Gender is recognized in many societies as a category of individuals that are neither male nor\nfemale. In cultures these genders have become an essential part of society. Examples of this are two-spirit, a gender role, which is a part of hundreds of Native\nAmerican cultures. Also, the Hijra in South Asian countries are born male but assigned a female gender expression. The Hijra is an ancient tradition, and has been\na part of Indian society for centuries. They are said to bring luck and fertility with their special powers. In the late 1800's the British tried to end this tradition or\nmake it difficult to uphold. In 1897 an act was amended which criminalized being transgender. It was subtitled “An Act for the Registration of Criminal Tribes and\nEunuchs”, and made Hirja practices illegal.[28]\nTransgender Rights In The United States\nTransgender oppression and liberation in the United States of America has many avenues of existence. Transgender individuals also called transsexual, are people\nthat have a different gender expression or a gender identity from the sex they were assigned to at birth, [29]. Trans individuals are often ostracized and promoted in\nheadlines involving suicide and depression among youth,[30] holistically social oppression is only part of trans oppression and liberation. Transgender individuals also face economic and political challenges, and often have short lives because of the challenges they face.[31]\nTransgender women in particular face incarceration at what are often considered worrying rates. Income levels for trans people are often at low levels, due to\nunemployment. Transgender individuals often face difficulty securing jobs due to bias from employers, thus making it difficult to live above the poverty line, let\nalone afford the surgeries often necessary to relieve the dysphoria that many trans people suffer from. This dysphoria is one of the main reasons behind trans\nsuicide. Many political obstacles also exist. Legalities range from housing and employment rights, to access to medical care, to use of public facilities as they're\noften a challenge for trans individuals. Being \"out\" and serving in the military has always a struggle for members of the LGBTQ community, but most notably\ntrans indivduals. Queer people have been able to openly serve in the Unites States military since 2011, but transgender personnel continued to risk discharge if they\ndidn't pass as their assigned sex until June 2016 when transgender bans were officially repealed. [32]\nSeveral trans rights organizations have existed for decades, primarily S.T.A.R, and in conjunction with gay rights organizations such as the Lambda defense and\nthe human rights campaign, have services for trans people in need of resources, legal defense funds, and social movements with the attempt of de-stigmatizing the\nexistence of trans people, which could be very effective at curbing trans suicide rates and increase the quality of life for those people.[33]\nLGBTQ Conversion Therapy\nGay conversion therapy also known as \"reproductive therapy\" has become a controversial issue of America’s human rights agenda. Less than half of the United\nStates have passed legislation to make it illegal to send minors to conversion therapy. Conversion therapy refers to the LGBTQ community, it is intensive therapy\nto turn them \"straight\". The LGBTQ community consists of people whose sexual orientation or gender are identified in different ways, such as; Lesbian,Gay,\nBisexual,Transgender and Queer. The difficulty with preventing these practices with minors is the inability for the states or minors to hold jurisdiction over family\nmembers and legal guardians. Recently, complaints of these practices have been legally filed to the FTC (Federal Trade Commission) on pretense of false\nadvertisement not based on scientific fact. “In February 2016, the Human Rights Campaign, National Center for Lesbian Rights, and Southern Poverty Law\nCenter filed a consumer fraud complaint with the Federal Trade Commission (FTC) against People Can Change, a major provider of conversion therapy; Also\nknown as \" reparative therapy\" a practice where they try to change a person's identity through gender, expression, or sexual orientation. The complaint alleges that\nPeople Can Change’s advertisements and business practices which claim they can change a person’s sexual orientation or gender identity constitute deceptive,\nfalse, and misleading practices and can cause serious harm to consumers, all in direct violation of Section 5 of the Federal Trade Commission Act” [34] They found\nthat aside the practices were not methodologically sound practices, furthermore many were found to be harmful to the subjects. In another study of LGBTQ\nstudents rejected or isolated by peers done by San Francisco State found suicide rates to be 8 times higher than average students, along with a 300% higher chance\nof using illicit drugs. This issue has received more attention as the LGBTQ community receives more rights. Many forced participants have reported physical and\npsychological abuse while being forced into these institutions, using such methods as shock therapy and confinement. As the U.S has strode for human rights, the\nrecent election of Donald Trump and VP Mike Pence has brought question to the ending of gay conversion therapy, Mike Pence being a supporter of it. In the\ncoming years this will remain a very hot issue of social, political and religious freedom. [35]\nChapter Glossary of Key Terms\n19th Amendment: The right for women to vote.\nAboriginal: Inhabiting or existing in a land from the earliest of times or before the arrival of colonists.\nAcephalous Society: A society without a governing head.\nAfrican Charter: An international women rights agreement intended to promote and protect women rights and basic freedoms in Africa.\nAmnesty International: The oldest and longest human rights group, focused on local human right activism.\nCivil and Political Rights: A class of rights that restrict the government, social organizations and private individuals from repressing the freedom of an individual to\nparticipate in society or state.\nClitoridectomy: Removal of the entire clitoris and the removal of the adjacent labia.\nCoalition: A group formed with two or more people, temporarily work together.\nCompensation: Something, typically money, awarded to someone as a recompense for loss, injury or suffering.\nControversial: Giving rise or likely to give rise to public disagreement.\nContraceptive: Devices or drug serving to prevent pregnancy.\nCultural hybridity: The borrowing and modification of ideas from other cultures within a culture.\nCultural Imperialism: An undermining of the cultural aspects of imperialism, which is the making and maintaining of relationship among civilizations which are\nunequal; the potential for culture to contrast another culture.\nDalit: A member of the lowest caste in the traditional Indian caste system. \"Untouchables.\"\nDe-Stigmatizing: To remove associations of shame or disgrace.\nDivorce: The legal dissolution of a marriage by a court or other competent body. Different cultures and religions have their own specific rules and \"norms.\"\nDysphoria: The state of feeling often experienced by transgender individuals which can be described as feeling as though one is born in a body that doesn't fit with\nwhat one feels they should be born as (i.e breasts or lack thereof, incorrect genitalia, absence or excess of body hair)\nElectronic Frontier Foundation: founded to promote and extend the concept of civil liberties to online communities.\nEntitlements: The society defined rights to life sustaining resources, meaning access to basic human rights and social freedoms.\nEntitlement Programs: Programs that supply basic needs like health care, food stamps and other services.\nExpenditures: The action of spending funds, or the amount of money spent. Exploitation: The action or fact of treating someone unfairly in order to benefit from their work.\nFemale Circumcision: The ritual cutting or removal of some or all of the external female genitalia.\nFirst Optional Protocol: An individual complaints mechanism in which people can submit complaints, also known as communications, to the Human Rights\nCommittee to be reviewed.\nFreedom from want: Freedom to the right to an adequate standard of living, depends on economic and social rights, right to property, work and education.\nGay Conversion Therapy: Sending people who identify as gay to therapy to attempt to make them straight.\nGenocide: The deliberate killing of a group of people.\nGlobalization: The process by which businesses or organizations develop international influence or start operating on an international scale.\nHuman Rights: The basic rights and freedoms to which all humans are entitled to inside of a system.\nIndividualism: Social theory advocating the liberty, rights or independent actions of the individual.\nInternational Labor Organization: Founded by the UN, and is dedicated to resolving international labor issues.\nIntersex: A person who is born with a reproductive or sexual anatomy that is not exclusive with the traditional definitions of male and female.\nJurisprudence: The theory or philosophy of law.\nLambda: A national organization committed to achieving full recognition of the LGBTQ community.\nLeague of Nations: The first world intergovernmental organization whose goal was maintaining world peace.\nLGBTQ: Individuals whose sexual orientation and gender are described as; Lesbian, Gay, Bisexual, Transgender and Queer.\nLineal Descendant: A person who is the direct line to an ancestor.\nLiving wage: A pay rate that allows for one to meet their household's basic needs.\nLobbying: To solicit or try to influence the votes of members of a legislative body.\nMandate: An official order or commission to do something.\nManifest: Clear or obvious to the eye or mind.\nMale Circumcision: A surgery that removes the foreskin from the tip of the penis and is most commonly performed on infants or children for religious or social\npurposes.\nMultilateral Treaty: Treaty in which 3 or more sovereign states are parties.\nNAGPRA: The Native American Graves Protection and Repatriation act. Allows for Native American Tribes to reclaim human remains and cultural object to the\ndirect lineal descendants.\nOppressed: Subject to harm and authoritarian treatment.\nPatrimony: Property inherited from ones father or male ancestor.\nPharaonic Circumcision: Female genital mutilation, removal of inner and outer labia, and suturing of the vulva.\nPreconceived: An idea or opinion formed before having the evidence for it's truth or usefulness.\nPro-Choice: Advocating legalized abortion.\nPro-Life: Political view that opposes abortions and euthanasia because it violates a fetus or baby's rights.\nProtocol: Official procedures or systems of rules governing affairs of state or diplomatic occasions.\nRank Societies: Class and caste limit social mobility.\nReproduction: The production of offspring by a sexual or asexual process.\nReproductive rights: The right to determine the number and spacing of their children.\nRight: Morally good, justified or acceptable.\nRights to Culture: Ensures that everyone has the right to participate in, and enjoy their culture.\nSecond Optional Protocol: Abolishes the death penalty, but countries could still request it for the worst of crimes of a military nature that is committed during war\ntime.\nSexually Demorphic: Is the condition where the two sexes of the same species exhibit different characteristics beyond the differences in their sexual organs.\nSocioeconomic: Interaction of social and economic factors.\nStreet Transvestite Action Revolutionaries (S.T.A.R): A transgender group founded in 1970 by two transgender members of the Stonewall Riots. Focused on\nsupporting homeless queer people and queer sex workers.\nTransgender: People that have a different gender expression or gender identity as the sex they were assigned to at birth. United Nations: An intergovernmental organization tasked to promote international co-operation and to create and maintain international order. It replaced the\nLeague of Nations in 1945.\nUniversal Declaration of Human Rights: Adopted by the UN Nations in 1945, it outlines that all people are born free and equal with the right to not be enslaved or\ntortured, the right to life, security, and to be recognized as a person before the law.\nUnpaid vs. Paid Labor: Unpaid labor is parental work, community work, agricultural work for personal use. Paid would be formal work with currency in\nexchange for labor and/or time.\nReferences\n1. United Nations http://www.who.int/topics/human_rights/en/ (http://ww 18. http://onlinelibrary.wiley.com/doi/10.1111/j.1464-\nw.ohchr.org/EN/Issues/Pages/WhatareHumanRights.aspx) 410X.2006.06685.x/full\n2. http://en.wikipedia.org/wiki/Human_rights#Regional_human_rights 19. http://www.historyofcircumcision.net/index.php?\n3. http://hrlibrary.umn.edu/edumat/hreduseries/hereandnow/Part- option=content&task=view&id=63\n1/short-history.htm 20. Male-vs-Female Circumcision\n4. Second Optional Protocol to the International Covenant on Civil and http://thecircumcisiondecision.com/male-vs-female-circumcision/\nPolitical Rights, aiming at the abolition of the death penalty (http://w 21. \"Curbing Spending by Reframing the Politics of Entitlements\".\nww.unhchr.ch/html/menu3/b/a_opt2.htm), Article 2.1 Walker Foundation. Retrieved ?-?-2009. {{cite web}}: Check\n5. \"UN Treaty Collection: International Covenant on Economic, Social date values in: |accessdate= (help)\nand Cultural Rights\". UN. 2009-02-24. Retrieved 2009-02-25. 22. http://www.nytimes.com/imagepages/2007/01/17/business/20070117_\n6. Sverker Finnstrom {url=http://www3.interscience.wiley.com/cgi- 23. Bourgois, Philippe 1995 “Workaday World, Crack Economy.” The\nbin/fulltext?ID=121359002&PLACEBO=IE.pdf&mode=pdf} Nation (December 4) pp. 706-11.\n7. http://en.wikipedia.org/wiki/International_Covenant_on_Economic,_Socialh_tatpn:d//w_Cwuwlt.uprhailli_pRpiegbhotsurgois.net/Nation%2095.pdf\n8. \"The Nobel Peace Prize 1969\". Nobelprize.org. Nobel Media AB 24. Danger in the Comfort Zone. American Management Association|\n2014. Web. 29 Nov 2016. {url=http://books.google.com/books?\n<http://www.nobelprize.org/nobel_prizes/peace/laureates/1969/> hl=en&lr=&id=rrJ_Ohzzm7oC&oi=fnd&pg=PR13&dq=american+entitle\n9. LO: Working time in the twenty-first century, report for discussion at 25. http://hdr.undp.org/en/media/HDI_2008_EN_Tables.pdf\nthe Tripartite Meeting of Experts on Working-time Arrangements, 26. Schultz, Emily and Lavenda, Robert, \"Cultural Anthropology, A\nGeneva, 17–21 Oct. 2011. Perspective on the Human Condition\" pg.422\n10. Chan, Anita, and Robert J. S. Ross. \"Racing To The Bottom: 27. http://community.seattletimes.nwsource.com/archive/?\nInternational Trade Without A Social Clause.\" Third World Quarterly date=20040118&slug=culture18===Gender Variance Across the\n24.6 (2003): 1011-1028. Academic Search Complete. Web. 31 Oct. Globe===\n2016.\n28. http://planettransgender.com/transindia-who-are-the-hijras-2/\n11. Human Rights Watch https://www.hrw.org/about\n29. https://www.merriam-webster.com/dictionary/transgender\n12. http://www.hrweb.org/orgs.html\n30. http://www.vocativ.com/culture/lgbt/transgender-suicide/\n13. \"The Declaration of Sentiments.\" Infoplease. Infoplease, n.d. Web.\n31. https://www.aclu.org/issues/lgbt-rights/transgender-rights\n30 Nov. 2016. <http://www.infoplease.com/ipa/A0875901.html>.\n32. Ross A., \"The invisible army: why the military needs to rescind its\n14. \"Primary Documents in American History.\" 15th Amendment to the\nban on transgender service members,\" Southern California\nConstitution: Primary Documents of American History (Virtual\nInterdisciplinary Law Journal 23 (2014) p. 185\nPrograms & Services, Library of Congress). N.p., n.d. Web. 01 Dec.\n33. http://www.nytimes.com/interactive/2015/05/15/opinion/editorial-\n2016.\ntransgender-timeline.html?_r=0\n<https://www.loc.gov/rr/program/bib/ourdocs/15thamendment.html>.\n34. http://www.hrc.org/resources/the-lies-and-dangers-of-reparative-\n15. Lois W. Banner, Women in Modern America: A Brief History\ntherapy . In 2007, the American Psychology Association reviewed\n16. \"19th Amendment to the U.S. Constitution: Women's Right to Vote\nthe practices of conversion therapy.\n(1920).\" Our Documents - 19th Amendment to the U.S. Constitution:\n35. Campaign, Human Rights. \"The Lies and Dangers of \"Conversion\nWomen's Right to Vote (1920). N.p., n.d. Web. 01 Dec. 2016.\nTherapy\" | Human Rights Campaign.\" Human Rights Campaign.\n<https://www.ourdocuments.gov/doc.php?flash=true&doc=63>.\nN.p., n.d. Web. 30 Nov. 2016.\n17. Bettina Shell-Duncan http://www.anthrosource.net/Abstract.aspx?\nissn=0002-\n7294&volume=110&issue=2&supplement=0&article=231977&jstor=False\n\"Female Genital Mutilation: A Call to Action\",Troubia N: New York, New York, Women, Ink, 1993. 48 p. (http://db.jhuccp.org/ics-wpd/exec/icswppro.dll?BU=ht\ntp://db.jhuccp.org/ics-wpd/exec/icswppro.dll&QF0=DocNo&QI0=097837&TN=Popline&AC=QBE_QUERY&MR=30%25DL=1&&RL=1&&RF=LongRecor\ndDisplay&DF=LongRecordDisplay)\n1. ^ Birx, James. \"Human Rights and Anthropology.\" Encyclopedia of Anthropology. 3. Thousand Oaks, CA: Sage Publications, Inc., 2006. Print.\nPg. 1228.\nRetrieved from \"https://en.wikibooks.org/w/index.php?title=Cultural_Anthropology/Human_Rights&oldid=3721140\"\nThis page was last edited on 5 September 2020, at 04:44.\nText is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy."
}