{
    "text": "Chapter One: Meaning and Nature of Sociology\n1.1 Definition\nIn the early part of the nineteenth century, the study of society was institutionalized through the creation\nof the discipline of sociology. During this period, the French philosopher and socialist Auguste Comte\ncoined the term “sociology”. Sociology is a new branch of social science, which primarily focused on\nsociety (social behavior). The term Sociology comes from the Latin “socius” meaning “companionship”\nand the Greek “logos”, meaning “science or study”. Literally, therefore, sociology means the study or\nthe science of human society. Sociology can also be defined as referring to the formal study of how\nhumans behave in groups. Sociology tends to focus on how human groups originate, how they are\norganized, and how they relate to one another. It is the scientific study of human societies and human\nbehavior in the many groups that make up a society.\nSociology studies human society at three levels: Society as a whole, Groups and associations, and\nIndividuals within the social settings. It is not easy to give a clear and comprehensive definition of\nsociology since it covers a wide variety of human relationships. Different sociologists have given several\ndefinition of sociology, including: 1) “Sociology is a scientific study or science of society or of social\nphenomenon.” L. F. Ward 2) “It is the study of the relationship between man and his human\nenvironment.” H. P. Fairchild 3) “Sociology is the study of human interactions, and interrelations, and\ntheir conditions and consequences.” M. Ginsberg 4) “Sociology seeks to discover the principles of\ncohesion and of order within the social structure.” Mac Iver 5) “Sociology is a systematic study of the\norigin, growth and development of institution as operated by the physical, mental and moral forces.” A.\nGiddens\n1.2 The Subject Matter of Sociology\nThe subject matter of sociology is everywhere. This is why people sometimes wrongly believe that\nsociology just explains the obvious. But sociologists bring a unique subject matter and perspective to\nunderstanding social behavior and social change. In general, there are three paths that are available for\ndelineating the subject matter of sociology:\n1. The historical path: whereby we seek through study of the classical sociological writings to find the\ncentral traditional concerns and interests of sociology as an intellectual discipline. The historical path\noffers us the opportunity to benefit from the wisdom of the past. In brief, we ask, “What did the founding\nfathers say?”\n2. The empirical path: whereby we study current sociological work to discover those subjects to which\nthe discipline gives most attention. In other words, we ask, “What are contemporary sociologists doing?”\nSociology is an empirical discipline. This means that sociological conclusions are based on careful and\nsystematic observations. In this way, sociology is very different from ordinary common sense.\n1 3. The analytical path: whereby we arbitrarily divide and delineate some larger subject matter and\nallocate it among different disciplines. Sociology is a scientific way of thinking about society and its\ninfluence on human groups. Observation, reasoning, and logical analysis are the tools of the sociologist,\ncoupled with knowledge of the large body of theoretical and analytical work done by previous\nsociologists and others. Sociology is inspired by the fascination people have for the thoughts and actions\nof other people, but it goes far beyond casual observations. It attempts to build on observations that are\nobjective and accurate to create analyses that are reliable and that can be validated by others.\n1.3 The Sociological Imagination\nSociologists talk about the connection between learning to understand and then change society as being\nthe sociological imagination. C. Wright Mills (1916–62), a colorful and controversial professor at New\nYork’s Columbia University, coined this term. Sociological imagination is an approach to the\nunderstanding of human behavior by placing it in its broader social context. To find out why people do\nwhat they do, sociologists look at social location, where people are located in history and on a particular\nsociety. Sociologists focus on such characteristics of people, as their job, income, education, gender, and\nrace. The center of the sociological perspective lies the question “how people are influenced by society”.\nWe usually think and speak of peoples’ behavior although it is caused by their sex, or their race, or some\nother factor transmitted by their genes. According to Mills, the sociological imagination is the ability to\nsee the interrelationships between biography and history, or the connections between our individual lives\nand larger social forces at work shaping our lives (e.g., racism or political agendas). Mills urged us to\nunderstand that our own personal fortunes or troubles (e.g., gain/loss of a job, divorce) must be\nunderstood in terms of larger public issues (e.g., the health of the economy, societal changes in the\ninstitution of marriage). They cannot be fully understood outside of this social context.\nThe sociological perspective helps us to escape from this narrow personal view by exposing the broader\nsocial context that underlies human behavior. It helps us to see the links between what people do and the\nsocial setting (social structure) that shapes their behavior.\nMills felt that developing a sociological imagination will help us to avoid becoming “victims” of social\nforces and better control our own lives. By understanding how social mechanisms operate, we can better\nwork to bring about change and influence history. Hence, as we learn to use the sociological\nimagination, we readily apply it to our daily lives. In doing so, it provides us four general benefits,\nincluding:\na. The sociological perspective becomes a way of thinking a 'form of consciousness’ that challenges\nfamiliar understandings of ourselves and of others, so that we can critically assess the truth of commonly\nassumptions.\nb. The sociological perspective enables us to assess both opportunities and the constraints that\ncharacterize lives. Sociological thinking leads us to see that, better or worse, our society operates in a\n2 particular way. It helps us to see the pattern and order found in all societies. Moreover, in the game of\nwe may decide how to play our cards, but it is society that deals us the hand. The more we understand\nthe game, then, the more effective players we will be. Sociology helps us t understand what we are likely\nand unlikely to accomplish for ourselves and how we can pursue our goals most effectively.\nc. The sociological perspective empowers us to be active participants in our society. Without an awareness\nof how society operates, we are likely to accept the status quo. We might just think that this is how all\nsocieties are, or how all people behave 'naturally'. But the greater our understanding of the operation of\nsociety, the more we can take an active part in shaping social life.\nd. The sociological perspective helps us to recognize human differences and human suffering and to confront\nthe challenges of living in a diverse world.\n1.4 Significance of Sociology\nSome of significances of sociology, including the following (Indrani, 2003: 5-6):\n Sociology as a scientific study of society is of great importance or a clear understanding and planning of\nsociety. Sociological knowledge is necessary to understand the diverse social experiences of a large\nvariety of institutions and organizations as well as policies, for social betterments are made on that basis.\n It provides knowledge of individual’s relation to society and such knowledge is necessary for every\nindividual’s relation to fellow beings. Human understanding between individuals and different cultural\ngroups is obtained by the scientific study of society. Sociology has changed our outlook with regard to\nthe problems of deviance and crime, etc through the science of deviance, criminology, penology and\ncriminal justice system.\n Sociology has made great contribution to enrich human culture. Culture has been made richer by the\ncontribution of sociology. Sociology has given a training to have rational approach to the questions\nconcerning oneself, one’s religion, customs, moral and institutions. Sociology studies role of the\ninstitutions in the development of the individual. It is through sociology that scientific study of the great\nfundamental social institutions; the relation of the individual and society, the home and family, the\nschool and education, the church and religion, the state and government, industry and work, etc is being\nmade.\n Sociology is useful as a teaching subject. It is being accorded as important place in the curriculum of\ncolleges and universities because it keeps us up-to-date on modern situations; contributes in making\ngood citizens; contributes to the solution of community problems; adds to the knowledge of the society;\nhelps the individual to find his relations to society; and Identifies good government within the\ncommunity.\n3 1.5 The Scope of Sociology\nMacro and Micro sociology\nSome sociologists concentrate on the study of small groups and the patterns and processes of human\nsocial relations, i.e. face to face interactions between humans. This part of sociology is known as Micro\nsociology. Other most sociologists concentrate on large groups, events or societies as a whole. This large\nscope sociology is known as macro sociology. Macro sociologists attempt to explain the fundamental\npatterns and processes of large-scale social relations.\n1.6 The Relationship of Sociology with Other Disciplines\nThere are different sciences dealing with different aspects of nature and human experience. The\nclassification of knowledge into various sciences is broadly under three categories, including: the\nphysical sciences, the material sciences and the social sciences. There are other social sciences also in\naddition to sociology which study society. Among them are Psychology, Anthropology, History,\nEconomics, Political Science, and Philosophy, etc. As one of the social sciences, sociology shares the\nbasic common element that all the social sciences attempt to understand human behavior. Accordingly,\nin the modern era, no sociologists can deny the utility of the other social sciences. In so doing, the social\nscience may use each other’s methodology to understand human behavior. They differ from one another,\nhowever, in their unique approach, the concepts they use, the questions they pose, and the solutions they\nreach and suggest. For instance, if the social problem to be investigated is the problem of low\nproductivity, the economist may suggest the improvement of the machinery, where as the sociologist\nmay suggest the creation of good working conditions as solutions to the problem.\nIn general, we can see as sociology has many similarities to the other social sciences. Like political\nscientists, sociologists study how people govern one another, especially the impact of various\nforms of government on people's lives. Like economists, sociologists are concerned with what\nhappens to the goods and services of a society; however, sociologists focus on the social consequences\nof production and distribution. Like anthropologists, sociologists study culture; they have a particular\ninterest in the social consequences of material goods, group structure, and belief systems, as well as in\nhow people communicate with one another. Like psychologists, sociologists are also concerned with\nhow people adjust to the difficulties of life. Given these overall similarities, then, what distinguishes\nsociology from the other social sciences? Unlike political scientists and economists, sociologists do not\nconcentrate on a single social institution. Unlike anthropologists, sociologists focus primarily on\nindustrialized societies. And unlike psychologists, sociologists stress factors external to the individual to\ndetermine what influences.\n4 Chapter Two: Origin and Development of Sociology\n2.1 Early Origins and Development of Sociology\nSociology is specifically the offspring of the 18th and the 19th century philosophy and has been viewed as\na reaction against the frequently non-scientific approaches of classical philosophy to social phenomenon.\nToday's sociology is not something, which has been raised like a phoenix from its ashes, rather it has\nundergone through several stages of developments. Different philosophers and religious authorities of\nancient and medieval societies made countless observations about human behaviors. However, they do\nnot test or verify these observations scientifically, even though these observations often became the\nbases for moral codes of that time. Sociology, as a distinctive way of thinking about society, was\nconcurrent with the rise of modernity; partly, means the rise of scientific way of thinking. The idea of\nmodernity originated as an account of the kind of institutions, ideas and behavior that grew out of the\ndecline of medieval society in Europe. In the most basic sense, modernity is the mode of our time (here\nand now). It is also an attitude of critical reflection on the past and critical distance from the future.\nTherefore, modernity evokes the idea of radically changing time.\n2.2 Factors That Contributed To the Development of Sociology\nThere are various social currents that put momentum in the development of sociology in the 19th\nCentury, including:\na) Political Revolution\nOne of the most influences behind the emergence of sociological thought was the political modernity\n(the rise of the national law and democracy), following different revolutionary movements, starting with\nthe French revolution in1789. This revolution was quite different from rebellions of the previous times.\nIn the French revolution for the first time in history there took place the overall dissolution of social\norder by the movement guided by secular ideas.\nThe rise of the state was the leading consideration for numerous legal and political writers in the 17th and\n18th centuries. The idea of French philosophers (Voltaire Montesquieu and Rousseau) included the\npercept (teaching, principle) that “all people are equal before the law and are innocent until proved\nguilty.” They also argued that illness and misfortune are not symptoms of divine maledictions, but have\nnatural and social causes. Throughout the 18th and 19th centuries, these ideas led numerous projects to\nreform and national administration of the institutions of social life, including the foundation of statute,\nschools, hospitals, prisons, and police force.\nB) Socio-economic Modernity: the rise of capitalism, industries, cities, etc.\nThe industrial revolution was as important as political revolution for the emergence of social thinking\n(sociological theory), mainly in the 19th and 20th centuries. This industrial revolution was not a single\nevent, but many interrelated developments that culminated in the transformation of the western world\nfrom predominantly agricultural to an overwhelmingly industrial system. Majority of the peasant left\n5 their farms behind for the industrial occupation offered by the growing factories. Bureaucracies arose to\nprovide many service needed by industry and the emerging capitalist economic system. It is usually\ntraced to the Great Britain in the late 18th century and spread in the 19th century throughout the Western\nEurope and the USA. The industrial revolution is sometimes presented as a set of technical innovations.\nBut these technical innovations are only part of the much broader sets of social and economic changes.\nPeople began to migrate from the surrounding areas to nearby urban centers. Industrialization and\nurbanization were at the heart of the transformations that have irreversibly dissolved most traditional\nforms of society. The impacts of these transformations on many societies were both negative and\npositive changes. However, what attracted the attention of many early theorists were not the positive\nconsequences but the negative effect of such changes (chaos and disorder especially in France) they\nwere united to restore order of society. This interest in the issue of social order, therefore, became the\nmajor concern of early social analysis. Sociology came in to being as though caught up in the initial\nseries of changes brought about by the two great revolutions, and sought to understand the conditions of\ntheir emergence and their likely consequences.\nThe idea of free- market economy emerged. This system profited a few while impoverished the majority\nwho worked for long hours for wage. A reaction against the industrial system and against capitalism in\ngeneral followed and led the labor movement as well as various radical movements aimed at\noverthrowing the capitalist system. The industrial revolution, capitalism and the reaction against them all\ninvolved an enormous upheaval in western societies. This upheaval affected sociologists greatly. K.\nMarx, E. Durkheim, and M. Weber spent their lives studying these problems to develop programs that\nwould help to solve them.\nc) The Rise of Socialism\nK. Marx was an active supporter of the overthrown of capitalist system and its replacement by socialist\nsystem. However, Weber and Durkheim were opposing to socialism. They fear socialism more than they\ndid capitalism. In fact, in many cases, the rise of sociological imaginations in the early times was a\nreaction against socialism.\nGenerally, processes of industrialization and urbanization, and ideas of democracy and enlightenment\nwere all central considerations for the 18th and 19th century social thinkers.\nd) Intellectual Factors\nThe emergence and development of sociology was speeded up by a large number of intellectual\nmovements and contributions. The movements include the rise of political economy, utilitarianism,\nliberalism, positivism, Marxism, functionalism, and action theory. The idea of positivism, which was\npredominantly proposed by A. Comte as a scientific study of social phenomena, was the corner stone of\nsociological thoughts for the most parts of sociology’s early history. The subsequent writers were either\nexpanding on or modifying this idea only.\n6 e) Colonization (exposure to different cultures)\nThe late 19th century was a period of extensive colonization. Some European countries got colony in\nNorth America, Africa, South America, and Asia. This colonialism resulted in cross-cultural contacts\namong peoples of these different continents of the world. During this time, academic curiosity was\nincreased and many scholars began to study this cross-cultural contact.\nf) Secularization\nBefore the 19th century sacred outlooks dominated western European thinking. This sacred outlook made\nmany aspects of human society; including government believe to have been predetermined by God.\nHowever, secularism has become one of the principles of industrial societies and people became to think\ndifferently\ng) The demand for sociological inquiry in planning\nGovernments needed to have social policies so as to solve different social problems like homelessness,\ncrime, unemployment, etc. Therefore, governments used the applications of sociological understandings\nto get rid of the social problems through appropriate social policy formulation.\n2.3 Founding Fathers of Sociology\nAs it has already been noted, philosophers and religious authorities of ancient and medieval societies\nmade countless observations about human behavior. Their observations were not tested or verified\nscientifically; nevertheless, they often became the foundation of moral codes. In the 19th century\nEuropean theorists including Auguste Comte, Herbert Spencer, Emile Durkheim, Max Weber and Karl\nMarx made pioneering contributions to the development of a science of human behavior, sociology.\nThese classical sociologists profile and major works have been demonstrated in the following pages.\n2.3.1 Auguste Comte (1798-1857)\nComte was a French social theorist who lived in a period when France was at a great chaos as a result of\nthe French Revolution. He was the man who coined the word “sociology” from Latin ‘Socius’ and the\nGreek “Logos” to apply to the science of human behavior.\nA Biographical Sketch\nAuguste Comte was born in Montpelier, France, on January 19, 1798.\nHis parents were middle class, and his father eventually rose to the\nposition of official local agent for the tax collector. Although a\nprecocious student, Comte never received a college-level degree. He\nand his whole class were dismissed from the Ecole Poly technique for\ntheir rebelliousness and their political ideas.\nAuguste Comte died on September 5, 1857.\n7 All the sciences, according to him, share an over-all framework of logic and method; all seek to uncover\nuniversal laws governing the particular phenomena with which they deal. If we discover the laws\ngoverning the human society, Comte believe, we will be able to shape our own destiny in much the same\nway as science has allowed us to control events in the natural world.\nPositive Philosophy is his well-known book and in this book and other of his writings he showed the\npossibility of the scientific study of society. He advocated positivism in that social phenomena could be\nstudied scientifically and proposed methods of studying it through observation, experimentation,\ncomparison and history. By using positive (scientific) methods, Comte believed, it is possible to study\nand provide solutions to existing social problems. The collective facts of history and society are subject\nto laws and not to individual volition (free will), according to Comte.\nComte treated society as divided in to two: social statics and social dynamics. Social statics refers to the\ninvestigations of the laws of action and reaction of the different parts of the social system. The parts of\nthe society can’t be studied separately as if they had an independent existence. Instead, they must be\nseen as a mutual relation forming a whole that compels us to treat them in a combination. If social statics\nis the study of how the parts of the society are interrelated, social dynamics was the focus on the whole\nsocieties as the unit of analysis and to show how societies develop and change through time. Comte was\nconvinced that all societies moved through certain fixed stages of development, and they progressed to\nan ever-increasing perfection. There are three stages of development in laws of human thought:\ntheological, metaphysical, and the positive. These stages characterize the development of both\nknowledge and society.\nThe Three Stages in the Laws of Human Development\nIn 1830, he published the first volume of ‘positivism’. In this book and other his writings he showed the\npossibility of the scientific study of the society. Comte is the first to create positivism, which is defined\nas the belief that social phenomena could be treated scientifically; and he proposed methods of\nobservation, comparison, history, and experiment. Positivism is a core idea in his sociology that he\nnamed as a queen of sciences. In his positivist explanation, he formulated three stages of the laws of\nhuman development. According to his laws of the three stages, Comte made analogy of human evolution\nwith individual evolution as follows:\nIndividual evolution human evolution\nChildhood-------------------------------------------theological\nAdolescence----------------------------------------metaphysical\nAdulthood------------------------------------------scientific (positivistic)\nAccording to Comte, human race (society) is evolved from the three stages of evolution: theological,\nmetaphysical, and scientific illustrated as:\n8  Theological stage (<1300A.D): In this stage, all human behavior or social phenomena were\nattributed to religion. In which people’s view of the world was guided by religious principles. Sociology\nwas regarded as unexpressed. People started to view a society as natural phenomena. There was no\ncritical investigation. Both philosophical speculation and scientific explanation were absent, rather\ndominated by religious interpretation of social phenomena.\n Metaphysical stage (1300-1800): At this stage, people’s view of the world was by partial religious\nand partial speculative philosophy. The religious explanation coming from the mid-way explanation that\nsociety is not the reflection of the perfection of human beings. Here, all societies centered at finding of\ncauses for social behaviors. It is a bit more revolutionary stage than the theological one.\n Scientific stage (1800-now): According to A. Comte, this stage is the final human intellectual\ndevelopment, which replaced both the theological and metaphysical stages as a whole. During this\nperiod, people give emphasis to scientific methods and actions. They become materialistic and\nindividualistic.\nIt is also Comte’s contribution to explain social dynamic and social static in classifying society. As to\nhim, society is divided in to two: social static and social dynamic.\nLimitations of Comte’s three stages of the law of human development\nDespite his enormous contribution to the development of sociology as a systematic scientific field of\nstudy, his basic ideas suffer from some drawbacks; such as\n1. He ignored the coexistence the three stages of social development within a given social system.\n2. He was naive that there could be a multidirectional development in a society by advocating only\nunilinear development.\n3. He ignored the existence of both regression as well as progression in change.\n2.3.2 Herbert Spencer (1820-1903)\nHerbert Spencer was an exponent of evolutionarism and organistic view of society. He defines\nevolution as “a change from a state of relatively indefinite, incoherent homogeneity to a state of\nrelatively definite, coherent heterogeneity”. In 1850, he published his major book ‘Social Statics’.\nA Biographical Sketch\nHerbert Spencer was born in Derby, England, on April 27, 1820.\nSpencer died on December 8, 1903.\n9 The identification of areas of study in sociology such as social control (deviance) politics, religion, the\nfamily, stratification, associations, and communities are one of the greatest contributions of Spencer. He\nbelieved that society operates according to certain fixed laws. However, his first and foremost concern\nwas with evolutionary changes in social structure and social institutions. He became convinced that\nsocieties evolve from lower or barbarian to higher or civilized forms. As generations pass, he said, the\nmost capable and intelligent or the fittest members of the society survive, while the less capable die out.\nTherefore, over time societies become steadily improved. Spencer called this principle “the survival of\nthe fittest”. Although Spencer coined this phrase, it is usually attributed to his contemporary Charles\nDarwin, who proposed that living organisms evolve over time as they survive the conditions of their\nenvironment. Because of their similarities Spencer’s view of the evolution of societies became known as\nSocial Darwinism.\nGrowth Structure and Differentiation\nSpencer saw society as an organism, where in the various social institutions being its different organs.\nBoth organic and social aggregates are characterized by Spencer according to progressive increase in\nsize “just like living organisms begin as germs societies start from extremely small masses.” Growth\nmay come either through an increase in population-by simple multiplication of units or from the\njoining of previously unrelated units-union of groups, and again union of groups of groups. Increase in\nsize is accompanied by an increase in the complexity of their structures. The process of growth is a\nprocess of integration. And integration must be accompanied by differentiation if the organism or\nsocietal unit is to be viable.\nIn short, Spencer had two important theories about human society in general: the idea of social evolution and\nthe organic view of society as discussed below:\n1) The Idea of Social Evolution: society moves from simple to more differentiated or complex forms or\nfrom homogeneity to heterogeneity. In his book, “The principle of Sociology”, he used the organic\nanalogy to explain social organization and social evolution.\n2) The Organic View of Society: Spencer conceived that the parts of a society are interdependent and\ninterrelated which implies that the existence of one depends on the existence of another and change in\none part implies change in another part, the idea he shared with Comte. But unlike Comte, who tried to\nprescribe laws to bring about change in the existing society, Spencer opposed to prescription.\nHis opposition to interference to bring about change made his approach very appealing and popular to\nmany influential people in England and the United States who had vested interest in the status quo and\nwere suspicious of social thinkers who endorsed change. He said that through evolution society moves\nfrom structural differentiation to functional differentiation, from simplicity to complexity, from\nuniformity (homogeneity) to specialization (heterogeneity).\n10 Types of Societies\nSpencer classified societies in terms of their evolutionary stage and their degree of structural\ncomplexity. He also classified societies as militant and industrial based on the type of internal regulation\nwithin the societies.\nThe types of societies as viewed by Spencer:\n1) The Militant: the lowest stage characterized by small bands of people; homogeneous,\nundifferentiated, dominated by military coercion and rigid rules; compulsory cooperation. In some of\nsuch societies chiefs or kings claim to have obtained their authority from divine power (the\nsupernatural). Religion justifies the exercise of military power.\n2) The Industrial stage (Society): this is the opposite of the militant stage. Status is replaced by contract.\nNo more rigidity but flexibility; no more despotic but democratic. The dominant sentiment was not\npatriotism but individualism and development. The greater part of social activity is toward peace, and\nproduction for the betterment of life. Human relationship is free, responsive and contractual which\ndemands not compulsory but voluntary cooperation.\n3) The Ethical society: the final and perfect stage of societal development. In such type of society,\nethics governs; individuals are selfish but responsive to others. Internal moral restraints replace external\nmoral restraints. Time would come when no need of courts, police and the like to govern society. In fact\nthis stage is more of an ideal type (Utopia).\nNote: The main characteristic of militant societies is compulsion, forced cooperation whereas; in\nindustrial societies cooperation is voluntary.\nLimitations of Spencer’s work\nAlthough Spencer contributed many useful concepts and terms many of his ideas had serious flaws. For\none thing societies are not the same as biological systems; people are able to create and transform the\nenvironment they live in. Moreover, the notion of survival of the fittest easily can be used to justify class,\nracial-ethnic, and gender inequalities and to rationalize the lack of action to eliminate harmful practices\nthat contribute to such inequalities.\n2.3.3 Emile Durkheim (1858-1917)\nDurkheim was a French sociologist who, like Comte and Spencer, identified certain basic areas of social\ninvestigation such as, religion, politics, the family, law, etc. He took society as the major unit of analysis,\nand believed, like Spencer, that studying the parts of society independently of each other would result\nbut incomplete facts about society. He viewed society as organic, or he had the organic view. Social\ngroups are the basic unit of analysis and the action of individuals or their psychological makeup are the\nreflections of group behavior. The following are some of his influential works: 1) the division of labor in\nsociety (1893); 2) The Rules of Sociological method (1895); 3) Suicide (1897); and 4) Elementary forms\nof Religious life (1912).\n11 A Biographical Sketch\nEmile Durkheim was born on April 15, 1858, in Epinal, France. He\nwas descended from a long line of rabbis and studied to be a rabbi, but by the time he was\nin his teens, he had largely disavowed his heritage (Strenski, 1997:4). From that time on,\nhis lifelong interest in religion was more academic than theological (Mestrovic, 1988).\nDurkheim, as we will see throughout this book, had a profound influence on the\ndevelopment of sociology, but his influence was not restricted to it (Halls, 1996). Much of\nhis impact on other fields came through the journal L’année sociologique which he\nfounded in 1898. An intellectual circle arose around the journal with Durkheim at its\ncenter. Through it, he and his ideas influenced such fields as anthropology, history\n(especially the “Annales school” [Nielsen, 2005b]), linguistics, and—somewhat ironically,\nconsidering his early attacks on the field—psychology. Durkheim died on November 15,\n1917.\nLike Spencer and Comte, Durkheim believed in the stages in the development of society and he\nexpressed this view in his book “The division of labor in Society.” In his “Rules of sociological method”\nhe wrote how sociological investigation could be conducted. In “suicide” he showed how the behavior of\nindividuals was influenced by social facts outside of the individual in question. In “Elementary forms of\nReligious life”, Durkheim showed that the origin of religion is social, not natural, and had a social\nfunction, how it affects society. Though religion and science seem incompatible, many sociologists took\nreligion as their area of interest. Durkheim was the founding father of functionalism school of thought\n(perspective) in sociology.\nFunctionalism is a perspective that emphasizes the way the parts of a society are structured to maintain\nits stability. Using functionalism as a perspective Durkheim focused on the role of religion in reinforcing\nfeelings of solidarity and unity within group.\nSocial facts\nDurkheim defined sociology as the study of social facts. According to him a social fact is every way of\nacting fixed or not, capable of exercising on the individual an external constraint or which is\ngeneral throughout society and existing in its own right independent of its individual manifestations.\n12 To Durkheim, thus social facts include such phenomena such as the group laws, belief systems,\ncustoms, institutions, rules of conduct of society- the facts of the social world. They are ways of acting\nthinking and feeling that are characteristics of a group in society.\nDurkheim selected certain social facts such as suicide as his area of investigation. He refused to accept\nthe belief that suicide was caused by cosmic forces or by inherited tendencies. It could be explained\ninstead, in terms of a variety of social facts affecting individuals.\nSuicide is the act of taking one’s own life intentionally and voluntarily. The likelihood of suicide was\nrelated to:\n1. The degree of the integration /involvement of within groups or society. More specifically, suicide is\nmore common or more likely to occur in the extreme circumstances in which individuals lacked\nadequate integration within groups or society or in instances where individuals were too highly\nintegrated into a group or society within these two type polarities there were various conditions for\nsuicide.\n2. Degree of regulation also determines the rate of suicide as well. Suicide could occur when there was:\na. Excessive/ oppressive regulation\nb. Low /lack of regulation. At low/lack of regulation there is no norm that group or society, the individual\nbecomes puzzled either to adjust him to the newly arriving norms or to commit suicide.\nTypes of suicide\n1) Egoistic Suicide: a form of self centered suicide which is a result of the individual’s lack of full\nparticipation together with emotional involvement that participation entails. It’s a result of low degree of\nintegration. The individual feels isolation, deprivation and detachment. For Durkheim, this kind of state\nof mind exists among Protestants than Catholics, among unmarried as opposed to the married, divorced\nthan undivorced.\n2. Anomic suicide: Anomie is a disjunction between means and ends or a breakdown of societal norms–a\nstate of normlessness. It is the failure to internalize the norms of the society or inability to adjust to\nchanging norms or tension resulted from the conflicting norms themselves. In ability to adjust and\nchoose to commit suicide occurs during economic crisis or when a there occurs a change in government.\nIt is a result of low degree of regulation of norms of the behavior of individuals. It is common in\nindustrial societies.\n3. Altruistic suicide: it is the result of an extreme integration into a group/society to the point where\ngroup norms and goals as the only thing that matter. Social norms or group expectations are strong\nenough to force the individual to commit suicide. Altruistic suicide is common in “traditional” societies\nwhere values, norms, customs and expectations of the group have an extreme influence upon the\nindividual. For example, Chinese society, killing oneself is preferred to surrendering to an enemy. In\nsome Indian societies a widow must accompany her deceased husband by killing herself at his funeral.\n13 4. Fatalistic suicide: it occurs when there is excessive or oppressive regulation, the opposite of anomic\ncases. When the regulation is so oppressive, individuals who see nothing bright in their future become\npessimistic due to their feeling of hopelessness, helplessness and forced to commit suicide. For example,\nsuicide committed by slaves in bondage.\nTable 2.1: Summary of the Types of Suicide Discussed By Durkheim\nLow High\nIntegration Egoistic Altruistic\nRegulation Anomic Fatalistic\nSocial Solidarity\nDurkheim invented the concept of social solidarity to explain the then existing social problems he\nwitnessed as he conducted most of his research where there was much disturbance in France. He used\nthe concept to explain: What links people in society? What is the historical development of society from\none stage to another? Hence, the main direction the evolution of society is seen in growing division of\nlabor and differentiation of tasks, duties, occupational roles as society moves forward. This shows that\nDurkheim was an evolutionist in a certain sense.\nSocial bond: Social facts that help society live together. Based on the quality of social bond society is\ndivided in to two: 1) Mechanical solidarity 2) Organic solidarity.\n1. Mechanical solidarity\n Characteristics of pre-industrial society\n similarity of interest and experience as well as no division of labor and differentiation of tasks.\n The social institutions perform almost all societal functions.\n There were shared values, norms and beliefs all of which help to hold society together.\n2. Organic solidarity\n It is the characteristics of industrial societies.\n Division of labor and specialization\nTable 2.2: Traits of both Mechanical and Organic Solidarity\nTraits Mechanical solidarity Organic solidarity\nMain social bond similar, uniform moral and differentiated tasks, complementary\nreligious consensus and mutual dependence\nPosition of the collectivism, focus on group or trying to achieve individual interest\nIndividual community\nEconomic structure Isolation, self sufficient, limited Division of labor mutual dependence\nexchange without side group of groups and exchange\nSocial control Repressive laws punish Restitutive laws, safe guarding\noffenders (criminal laws) contract (civil laws).\n14 2.3.4 Karl Marx (1818–1883)\nGerman political scientist, economist and philosopher Karl Marx (1818-1883) often is regarded as one\nof the most profound sociological thinkers; his theories combine ideas derived from philosophy,\nhistory, and the social sciences. Central to his view was the belief that society should not just be\nstudied but should also be changed, because the status quo (the existing state of society) was\nresulting in the oppression of most of the population by a small group of wealthy people.\nMarxist theory became increasingly influential in sociology during the 1970s. The following account is a\nsimplified version of Marxist theory. Marx's extensive writings have been variously interpreted and,\nsince his death, several schools of Marxism have developed.\nA Biographical Sketch\nKarl Marx was born in Trier, Prussia, on May 5, 1818 (Beilharz, 2005e). His father, a lawyer,\nprovided the family with a fairly typical middle-class existence. Both parents were from\nrabbinical families, but for business reasons the father had converted to Lutheranism when\nKarl was very young. In 1841 Marx received his doctorate in philosophy from the University\nof Berlin, a school heavily influenced by Hegel and the Young Hegelians, supportive, yet\ncritical, of their master. Marx’s doctorate was a dry philosophical treatise, but it did anticipate\nmany of his later ideas. After graduation he became a writer for a liberal-radical newspaper and\nwithin ten months had become its editor in chief. However, because of its political positions,\nthe paper was closed shortly thereafter by the government. The early essays published in this\nperiod began to reflect a number of the positions that would guide Marx throughout his life.\nThey were liberally sprinkled with democratic principles, humanism, and youthful idealism.\nHe rejected the abstractness of Hegelian philosophy, the naïve dreaming of utopian\ncommunists, and those activists who were urging what he considered to be premature political\naction. In rejecting these activists, Marx laid the groundwork for his own life’s work: Practical\nattempts, even by the masses, can be answered with a cannon as soon as they become\n15 dangerous, but ideas that have overcome our intellect and conquered our conviction, ideas to\nwhich reason has riveted our conscience, are chains from which one cannot break loose\nwithout breaking one’s heart; they are demons that one can only overcome by submitting to\nthem (Marx, 1842/1977:20).\nMarx married in 1843 and soon thereafter was forced to leave Germany for the more liberal\natmosphere of Paris. There he continued to grapple with the ideas of Hegel and his supporters,\nbut he also encountered two new sets of ideas—French socialism and English political\neconomy. It was the unique way in which he combined Hegelianism, socialism, and political\neconomy that shaped his intellectual orientation. Also of great importance at this point was his\nmeeting the man who was to become his lifelong friend, benefactor, and collaborator—\nFriedrich Engels (Carver, 1983). The son of a textile manufacturer, Engels had become a\nsocialist critical of the conditions facing the working class. Much of Marx’s compassion for the\nmisery of the working class came from his exposure to Engels and his ideas. In 1844 Engels\nand Marx had a lengthy conversation in a famous café in Paris and laid the groundwork for a\nlifelong association. Of that conversation Engels said, “Our complete agreement in all\ntheoretical fields became obvious . . . and our joint work dates from that time” (McLellan,\n1973:131). In the following year, Engels published a notable work, The Condition of the\nWorking Class in England. During this period Marx wrote a number of abstruse works (many\nunpublished in his lifetime), including The Holy Family (1845/1956) and The German Ideology\n(1845–1846/1970) (both coauthored with Engels), but he also produced The Economic and\nPhilosophic Manuscripts of 1844 (1932/1964), which better foreshadowed his increasing\npreoccupation with the economic domain.\nWhile Marx and Engels shared a theoretical orientation, there were many differences between\nthe two men. Marx tended to be theoretical, a disorderly intellectual, and very oriented to his\nfamily. Engels was a practical thinker, a neat and tidy businessman, and a person who did not\nbelieve in the institution of the family. In spite of their differences, Marx and Engels forged a\nclose union in which they collaborated on books and articles and worked together in radical\norganizations, and Engels even helped support Marx throughout the rest of his life so that Marx\ncould devote himself to his intellectual and political endeavors.\nIn spite of the close association of the names of Marx and Engels, Engels made it clear that he\nwas the junior partner:\nMarx could very well have done without me. What Marx accomplished I would not have\nachieved. Marx stood higher, saw farther, and took a wider and quicker view than the rest of\nus. Marx was a genius. (Engels, cited in McLellan, 1973:131–132)\n16 In fact, many believe that Engels failed to understand many of the subtleties of Marx’s work\n(C. Smith, 1997). After Marx’s death, Engels became the leading spokesperson for Marxian\ntheory and in various ways distorted and oversimplified it, although he remained faithful to the\npolitical perspective he had forged with Marx. Because some of his writings had upset the\nPrussian government, the French government (at the request of the Prussians) expelled Marx in\n1845, and he moved to Brussels. His radicalism was growing, and he had become an active\nmember of the international revolutionary movement. He also associated with the Communist\nLeague and was asked to write a document (with Engels) expounding its aims and beliefs. The\nresult was the Communist Manifesto of 1848 (1848/1948), a work that was characterized by\nringing political slogans (for example, “Working men of all countries, unite!”). In 1849 Marx\nmoved to London, and, in light of the failure of the political revolutions of 1848, he began to\nwithdraw from active revolutionary activity and to move into more serious and detailed\nresearch on the workings of the capitalist system. In 1852, he began his famous studies in the\nBritish Museum of the working conditions in capitalism. These studies ultimately resulted in\nthe three volumes of Capital, the first of which was published in 1867; the other two were\npublished posthumously. He lived in poverty during these years, barely managing to survive on\na small income from his writings and the support of Engels. In 1864 Marx became reinvolved\nin political activity by joining the International, an international movement of workers. He\nsoon gained preeminence within the movement and devoted a number of years to it. He began\nto gain fame both as a leader of the International and as the author of Capital. But the\ndisintegration of the International by 1876, the failure of various revolutionary movements, and\npersonal illness took their toll on Marx. His wife died in 1881, a daughter in 1882, and Marx\nhimself on March 14, 1883.\nMarx believed that conflict-especially class conflict-is necessary in order to produce social and a better\nsociety. For Marx, the most important changes were economic. He concluded that the capitalist\neconomic system was responsible for the overwhelming poverty that he observed in London at\nthe beginning of the Industrial Revolution (Marx and Engels, 1967/1848). In the Marxian framework,\nclass conflict is the struggle between the capitalist class and the working class. The capitalist class, or\nbourgeoisie, is comprised of those who own and control the means of production. Means of production\nrefers to the tools, land, factories, and money for investment that form the economic basis of a\nsociety. The working class, or proletariat, is composed of those who must sell their labor because\nthey have no other means to earn a livelihood. From Marx's viewpoint, the capitalist class controls\nand exploits the masses of struggling workers by paying less than the value of their labor.\nThis exploitation results in workers' alienation-a feeling of powerlessness and estrangement\n17 from other people and from oneself. Marx predicted that the working class would become aware of\nits exploitation, overthrow the capitalists, and establish a free and classless society.\n2.3.5 Max Weber (1864-1920)\nMax Weber was a German scholar who made numerous contributions to sociological thought.\nHe believed that sociology should be “value free” – that political ideas should not enter into social\nresearch. He was an influential theorist in the areas of social class, religion, bureaucracy, stratification,\npolitical organizations, division of labor, the relationship of religious activities to economic.\nA Biographical Sketch\nMax Weber was born in Erfurt, Germany, on April 21, 1864, into a\ndecidedly middle-class family. In 1904 and 1905, he published one of his best-known works,\nThe Protestant Ethic and the Spirit of Capitalism.\nIn one of his influential writings, “The protestant Ethic and the spirit of capitalism,” he explained\nprotestant religion that came out from the Catholic religion helped for the early development of\ncapitalism in Western Europe. He explored that Protestantism led to investment rather than consumption\nof profits which in turn encouraged the growth of capitalism. This is in opposition to the Marxian idea\nthat social and cultural change is an outgrowth of changes in the economic system. The connections\nbetween early protestant doctrine and the psychology of entrepreneurship may be summarized as\nfollows:\n1. Self Discipline and Work: The Calvinist doctrine of predestination held that men were either\ncondemned by God to everlasting hell or chosen to “live in the house of Lord forever.” Because\nbelievers in this doctrine were uncertain whether they were among the elect, they were anxious and\ninsecure. Strict self discipline, rejection of worldly pleasures, and righteous success in this world through\nhard work came to be regarded as signs of grace, evidence that one was in God’s favor. Relief from\nreligious anxiety was this sought. In disciplined effort. To work was to play, and work was regarded as a\npersonal mission or calling.\n2. Initiative and Acquisition: Hard work and self discipline won economic advantage over competitors\nand led to the acquisition of wealth since the Calvinists were supposed to avoid worldly pleasure, be\n18 thrifty, and abhor waste, they could not use wealth in traditional ways. They could, however, use their\ncapital to expand, ctheir business activities. Individual initiative was rewarded, since success in work\nwas interpreted as a sign of God’s blessing. Furthermore, continuous work in one’s calling alleviated\nconstant anxiety about salvation. No matter what a Calvinist accomplished in this world, he had no\nguarantee of salvation. Therefore he could not relax.\n3. Individualism and competition: Calvinists believed that man is alone before his maker, that he should\nnot trust the friendship of men that only God should be his confidant because even those closes to him\nmight be among the damned. Each individual could seek success as the sign of grace, and this striving\nwas consistent with economic competition. He dealt honestly and righteously with other men, but he was\nready to take advantage of his opportunities even if that meant out doing his competitors, (Broom and\nSelznick p.403). These, however, are the indirect, unintended effects of religion on economic\ndevelopment. So capitalism is a latent effect of religion according to the analysis of Max Weber.\nWeber and the Theory of Domination\nAn individual or group of individuals got the right to command others or to be obeyed by others. In other\nwords some people are governors, while most others are governed. Weber tried to interpret the motives\nbehind such obedience and he discussed on domination. He defined domination as the probability that\ncertain (all) commands will be obeyed by a given group of persons because of diverse motives of\ncompliance (affection, custom or tradition, rational calculation of an advantage, material interest) on the\npart of the obeyed.\nWeber made a distinction between power and authority in relation to domination. Power is the ability to\ndo or act. Authority, on the other hand, is socially defined power as appropriate or legitimate, or it is an\ninstitutionalized power. It is a power accepted as appropriate or supported by those subjected to it.\nAccordingly, Weber classified three types of domination/authority.\n1. Traditional authority/domination: it is based on established beliefs, traditions and moral habituation to\ncertain powers. The person in power could enjoy authority by virtue of his inherited status. People obey\nbecause the authority existed in the past and therefore should continue. No rational consideration of the\nimportance of the existing authority. It is simply taken for granted as essential. In Ethiopian, for instance,\nauthority was inherited by kings such as King Menelik →Zawditu→ Haileselasie.\n2. Charismatic Authority: it is rested on devotion to a specific and exceptional (sacredness) of an\nindividual. This exceptional quality could be heroism, exemplary character and of the normative patterns\nof order revealed or ordained by him. The exceptional (gifted individual could be a religious leader e.g.\nJesus Christ ocf Nazareth or Mohammed of Mecca, or persons such as Nelson Mandela, Fidel Castro,\netc. Here people obey not regulations, traditions but individual personalities and extra ordinary qualities.\nThese qualities could be possessed by magical power. This type of authority of unstable because when\nthe charismatic leader dies his followers disintegrate unless otherwise institutionalized.\n19 3. The Rational/Legal Authority: This is based on rational, goal oriented, and consideration of\nadvantages and disadvantages of being obeyed. People subordinate themselves to laws and regulations\nand individual personality or traditions are not so important. Rational authority is a characteristic of a\ncapitalist society. Modern bureaucracy is the purest and the best type, and it is the most rational form of\nadministration. Individuals hold positions in the hierarchy of bureaucracy based not on heredity/Kinship\nbut on competence. Found in schools, government organizations, and most other institutions.\nProfessional authority is which bacsed on expertise (Knowledge, profession, etc) is also included under\nrational authority. For example, Medical doctors, architects, etc.\nNote: the three types of authorities are not found in pure form, most societies are a blend of two or more\nof the types. In the United Kingdom, for instance, both traditional (the monarchy) and legal (the\nexecutive) authorities are found.\nSociology and Social Action\nAccording to Weber, Sociology is a science which attempts the interpretive understanding of social\naction in order to arrive at a causal explanation of its course and effects. Social action is all human\nbehavior when and in so far as the acting individual attaches a subjective meaning to it, either overt o\npurely inward and subjective.\nUnlike other sociologists of his time, Weber argued in favor of taking the individual as a basic, starting\npoint of analysis. Unlike matter, humans have consciousness, thoughts and feelings, meaning and\nintentions or an awareness of being. Because of this human actions are meaningful; they define\nsituations and give meaning to their actions and those actions of other. As a result, they do not simply\nreact to external stimuli or they do not merely behave but they act. The sociologist must, therefore,\ndiscover the meanings individuals attach to their actions in order to understand them, Weber argued that\nthe subject matter of the natural sciences and social sciences is fundamentally different. The methods\nand assumptions of the natural sciences are inappropriate to the study of humans. Since it is not possible\nto get inside the heads of the actors the discovery of meanings must be based on interpretation an\nintuition.\nWeber thought that it was possible to produce causal explanation of human behavior so long as an\nunderstanding of meaning formed part of those explanations. This explanation of authority of Weber is\nunlike the Marxist idea that the ruled obey the powers of the few because they are deceived by those in\npower, because of ideology (false consciousness).\nOn the basis of mode of orientation, Weber identified four typologies of types of social actions,\nincluding:\n1. Traditional action: traditions are the motives that determine the action of the individual in a certain way.\nThey are actions which are carried out due to tradition, because they are always carried out in such a\n20 situation. Some traditional actions can become cultural artifacts. For example, putting on light clothes\nand relaxing on Sundays.\n2. Affectual action (also known as emotional actions): refers the actions or behavior of an individual are\ndetermined by certain affectual or impulsive facts such as love, hatred, sympathy or anger. they are\ntaken due to one's emotions, to express personal feelings. For examples, cheering after a\nvictory, crying at a funeral would be emotional actions.\n3. Value oriented rational action: refers actions which are taken because it leads to a valued goal, but with\nno thought of its consequences and often without consideration of the appropriateness of the means\nchosen to achieve them. For example, actions of individuals in response to certain values such as\nreligious or ethical issues.\n4. Goal oriented Rational Action: it refers an action or mode of orientation as a means to an end. They are\nplanned and taken after evaluating the goal in relation to other goals, and after thorough consideration\nof various means (and consequences) to achieve it. Example, actions of individuals in economic\ntransaction such as calculating the means and the ends during purchasing stuffs.\nAccording to Weber, the traditional and affectual actions are not rational social actions in proper sense\nbecause they are not aiming at achieving certain ends. Value oriented and goal oriented actions are\nrational actions because an action is rationally oriented when the means, the end, and secondary results\nare all rationally taken into account and weighed. This involves rational consideration of alternative\nmeans to the end, of the relation of the end to other prospective results of employment of any given\nmeans, and the relative importance of different possible ends.\nChapter Three: Sociological Theoretical Perspectives\nSociologists depend on theories to help them explain the social world and organize their ideas about how\nit operates. A theory is the analysis and statement of how and why a set of facts relates to each other. In\nsociology, theories help us understand how social phenomena relate to each other. Theories help\nsociologists explain why and how society works. Through the use of theory, they work to answer such\nquestions as “why are things as they are, what conditions produce them, and what conditions change\nthem into something else? If we have such a theory, we will at last be in a position to know what we\nreally can do about the shape of our society” (Collins 1988, 119). By understanding the real causes of\nhow and why things operate as they do, we can find ways to address the things that need improvement.\nHowever, not all sociologists do have the same view on society (see their different views in the\nfollowing pages). In sociology, theoretical paradigms differ in how much of society or what aspects of\nsociety they focus on at one time. In other words, they differ on how “big” their look at society is. Macro\nperspectives are “big” perspectives that look at social processes throughout society. Social theorists who\ntake macro perspectives examine the interrelationships of large-scale social structures and\n21 interrelationships (e.g., the economy, the government, and the health-care system). They look at how\nthese facets of society fit together and any troubles or stress within these interrelationships. They are also\ninterested in why and how society changes as a result of these relationships. Conversely, micro\nperspectives focus on patterns of individual interactions. Social theorists who take a micro perspective\nfocus on the daily interactions we have on an individual level. They are interested in why and how\nindividuals relate to each other, how our day-to-day interactions with each other are shaped by larger\nsociety, and how these day-to-day interactions can, in turn, shape larger society.\nThere are currently three major theoretical paradigms in sociology: the structural-functionalist paradigm,\nthe social-conflict paradigm, and the symbolic-interactionist paradigm (Babbie 1994). No one of these\nthree perspectives is singularly “right” or “wrong”. Each provides a different way to view and analyze\nsociety. They can reveal different issues and suggest different answers to tackling any problems they\nidentify. Two of the major paradigms, the structural functionalist and the social-conflict perspective, take\na macro perspective on society. The third perspective, symbolic-interactionism, takes a micro\nperspective.\nChapter Four: The Cultural Context of Society\n4.1 Society and Culture\nBefore continuing the discussion of culture, we should first understand the difference between the\nconcepts of culture and society. Two concepts that are basic to sociology are culture and society. These\nwords are so central to sociology that every book has already used the terms in their chapters. They are\nalso readily used in everyday, non sociological conversation. But exactly what do these terms mean\nwhen used by sociologists? Why are they so central to sociology?\nWhile culture refers to way of life of people, society refers to the people who share and engage in that\nculture. Society is a central component of sociological study and everyday lives. A society consists of\npeople who interact and share a common culture. “Society is indispensable to the individual because it\npossesses at a given moment an accumulation of values, of plans and materials which the child could\nnever accumulate alone . . . But the individual is also indispensable to society because by his activity and\ningenuity he creates all the material values, the whole fund of civilization” (Thomas and Thomas 1928,\n233–34).\nIn general, a Society has a definite geographic location which persists over time. It is relatively self\nsustaining and independent to individuals, but has organized relationships among the people. A society\ncan be defined broadly or narrowly with respect to the context of speaking. We can talk of the whole\nweb of social relationship (human society in general) society of a given country like the American\n22 Society and different nations and nationalities within a given country like the Amhara Society, the\nOromo society, the Gurage society etc.\n4.2 Definitions of Culture\nCulture is an extremely broadest ethnographic concept which has got several definitions. To sociologists,\nculture is made up of all of the ideas, beliefs, behaviors, and products common to and defining, a group’s\nway of life. It refers to the shared way of thinking & believing that grow out of group experience & are\npassed from one generation to the next. It is the way of life of society, the knowledge, beliefs, customs &\nskills available to its members. Culture encompasses everything humans create and have as they interact\ntogether. Culture is the complex system of meaning and behaviour that defines the way of life for a\ngiven group or society. It includes ways of thinking as well as patterns of behaviour. Observing culture\ninvolves studying what people think, how they interact, and the objects they use.\nIn general, culture has been given the following two forms of definitions:\nEdward Tylor (1871) defined culture as follows:\n“Culture is that complex whole which includes knowledge, belief, art, low, custom and other capabilities\nand habit acquired by man as a member of society”. This definition is from idealistic perspective. Hence,\nit includes those aspects of culture that take non-physical form and hence are unobservable. It is also\ndefined by Paddington as “Culture is the sum total of material and intellectual equipment where by\npeople satisfy their biological and social needs and adapt themselves to the environment”. This\ndefinition includes aspects of culture that have physical existence and hence are observable. And this\ndefinition is from materialistic perspective. So, when we look at the above two definitions culture\nincludes both the material resources (manmade physical objects) and non-material (manmade intangible\nculture traits) of group life. It is important to sociologists to look at the various facets of culture. Every\nculture is composed of both material and nonmaterial components. Material culture includes all the\ntangible products created by human interaction. Any physical objects created by humans are part of the\nmaterial culture. This includes clothing, books, art, buildings, computer software, print and broadcast\nmedia, inventions, food, vehicles, tools, and so on. These objects are significant because of the meaning\nthey are given. Nonmaterial culture consists of the intangible creations of human interaction. These exist\nas our ideas, languages, values, beliefs, behaviors, and social institutions. Culture shapes the way we see\nthe world. It impacts how we think, how we act, what we value, how we talk, the organizations we\ncreate, the rituals we hold, the laws we make, how and what we worship, what we eat, what we wear,\nand what we think of as beautiful or ugly. Culture impacts things that seem to non-sociologists as\n“scientifically determined” as medical care (e.g. Payer 1988;Snow 1993) and things as “natural” as\npersonality (Cooper and Denner 1994; Cross and Markus 1999; J. G. Miller 1999) and sex (Grailey\n1987; Kimmel 2000). Even our emotions (Hochschild 1983; McCarthy 1989) and our choices of many\nof the foods we eat (Belasco and Scranton 2002) are “cultural acquisitions.”\n23 4.3 Components of culture\nFor the purpose of analysis, sociologists break down culture in to three component parts.\n1. Culture trait (element): It is a simplest unit of culture employed in a particular analysis which is\nirreducible unit, i.e. cannot be further divided into meaningful parts. It Can be material (e.g. plough, hoe,\nchair) or non-material (e.g. idea, belief, skill etc)\n2. Culture complex: it is any integrated system of culture traits that function as a unit in society. For\nexample, let’s took the traditional cultivation system in rural Ethiopia. Tools such as a plough, mofer,\nkenber, a pair of oxen and a farmer with a skill to handle the tools are required to cultivate the land and\nto produce. Thus, the combination of these material and non material culture traits make up an essential\nculture complex\n3. Culture pattern: it is a number of culture complexes combined to function as an integrated whole.\nFor instance, the farming system described above is only a component part of the economic pattern of\nrural Ethiopia If we have to adequately and exhaustively describe the rural economic pattern, then we\nneed to include the modern farming methods which employ tractors, harvesters, combiners etc; fishing,\nforestry, pastoratlism; industries (large, medium and small). The combination of all these activities\nconstitute the economic pattern of the country and these function as an integrated whole.\n4.4 Attributes/Characteristics of culture\nAcross societies, there are common characteristics of culture, even when the particulars vary. These\ndifferent characteristics are as follows:\n1. Culture is essentially symbolic: The significance of culture lies in the meaning it holds for people.\nSymbols are things or behaviors to which people give meaning; the meaning is not inherent in a symbol\nbut is bestowed by the meaning people give it. Symbols are powerful expressions of human culture. The\nmost frequent form of use of symbols is language. Words are symbols because they stand for something\nelse. The word blackboard, for example, is a symbol because it stands for the idea of a blackboard. So,\nCulture is found only in human society. This is because human beings can develop and use highly\ncomplex systems of symbols. Social life can exist without symbols as it does among other animals. But\nonly human have culture because only they are able to create symbols.\n2. Culture is acquired: This implies that culture is a learned. Cultural beliefs and practices are usually\nso well learned that they seem perfectly natural, but they are learned. Nonetheless, how do people come\nto prefer some foods to others? How is musical taste acquired? Culture may be taught through direct\ninstruction, such as a parent teaching a child how to use silverware or teachers instructing children in\nsongs, myths, and other traditions in school. Culture is also learned indirectly through observation and\nimitation. A person becomes a member of a culture through both formal and informal transmission of\nculture. Until the culture is learned, the person will feel like an outsider. The process of learning culture\nis referred to by sociologists as socialization as it is discussed on chapter five.\n24 3. Culture is shared: Culture is a quality or attribute of a group rather than an individual. Culture is\ncollectively experienced and collectively agreed upon. The shared nature of culture is what makes\nhuman society possible. The shared basis of culture may be difficult to see in complex societies where\ngroups have different traditions, perspectives, and ways of thinking and behaving. But not all shared\nthrow are culture; beyond its shared nature it must be learned. For example, we share Blank hair\nnaturally, so it cannot be culture. But the hair style is a culture because learning is involved. Eating\ncannot also be a culture rather how, when and what we eat makes a culture.\n4. Culture is Dynamic: Culture grows, expands, and develops continually. No culture is totally fixed\nand static. Cultural growth is a cumulative process because societies add new cultural elements,\ncomplexes and patterns. Similarly, societies discard cultural traits, complexes and patterns that have out\nlived their purposes. So, Cultural growth is a selective process. Culture grows and changes through the\nprocess of innovation, diffusion and transmission as illustrated below:\na. Innovation: the process of introducing an idea, or object that is new to a culture.\n1. Invention: create new cultural traits which don’t exist before.\n2. Discovery of new culture. It could be:\na) Primary- Discovery for the 1st time\nb) Secondary- improvement of those inventions, which already existed.\nb. Diffusion: is the process of borrowing culture traits, complexes or patterns from other societies. It could\nbe : 1) Direct diffusion through war, trade, migration, etc; and 2) Indirect diffusion through social media\nsuch as radio, television, reading materials etc.\nc. Transmission: cultural transmission is the process by which accumulated knowledge passes from one\ngeneration to another orally, in a written form or both\nNote: The above three factors for culture change are not mutually exclusive. That is, one or more than\none factor can play a role in changing a culture of society simultaneously.\n4.5 Cultural Diversity and Uniformity\n4.5.1 Cultural Diversity (variability)\nIt is believed that human beings everywhere have the same biological and mental makeup. But their\nmotivations, customs and beliefs differ enormously. We observe differences in technology, custom, diet,\nart, religion, government, marriage practices etc from one society to another. We call this cultural\nvariability or diversity. Cultural diversity refers to differences within a specific culture that add to the\ncomplexity of the culture & to the rich texture of social life. But why have people developed so different\nlife styles? Sociologists are quite interested in the large amount of diversity that occurs even within\nparticular cultures. Observers of culture in the United States would easily find many differences if they\nstudied Hollywood’s celebrity community, a neighborhood in Chicago largely populated by descendants\nof Eastern European immigrants, a Florida town that is home to many retirees, and a coalmining town in\n25 southwestern Virginia. Although some sociologists have tried to find a common American culture and\nhave often discussed middle-class culture as if that lifestyle applied to everyone, sociologists are\nincreasingly recognizing the importance of studying, or even promoting, cultural differences.\nIn general, social scientists agree that cultural variability is attributed to the fact that people in different\nparts of the world have found different ways of life and survival mechanisms for satisfying their basic\nneeds such as food, clothing and shelter. Nevertheless, the search for more specific explanations has\nresulted in the formulation of the following five approaches:\n1. Geographic Factors: Climatic conditions, topography, vegetation etc are considered to be principal\nsources of cultural variability. Obviously, these geographic factors have influence on cultural variability\nsince societies adopt behavior in accordance with the natural environment. But if this approach is true\none would expect people in more or less similar natural environment would develop more or less similar\nculture, which is not necessarily true from the available reality.\n2. Racial Determinism: this approach assumes that culture vary because of differences in races. It was\nbelieved that differences in human behavior can be traced in biological characteristics like skin color,\nshape of the skull hair texture etc. Race-any of the group into which humans can be divided according to\ntheir physical characteristics of color of skin, color type of hair, shape of eyes and nose etc. Thus,\nsociologists reject this approach on the ground that culture is a social inheritance, a form of acquired or\nlearned behavior, rather than a biological inheritance. Besides, there is no substantial evidence in favor\nof this argument.\n3. Span of interest: the argument here is that different societies have developed different span of interest\nemphasizing on different aspect of life. For instance, societies may emphasize on acquisition of wealth,\npolitical and economic power, practice of religion (life after death), individual achievement etc. such\nemphasis difference is thus believed to have contributed to cultural variability.\n4. Demographic factors: Population size seems to be an important factor in this approach. One factor\nthat influences cultural development is invention. Hence, it is assumed that invention is dependent up on\ninventors and the number of inventors is directly related to the size of the population.\n5. Historic chance: the argument here goes that cultural difference is due to mere historic chance or\noccurrences that happened by accident.\n4.5.2 Cultural uniformity (cultural universals)\nDespite their great diversity, there is a striking uniformity among the world’s cultures. Murdock has\nlisted about 73 elements that are known to all cultures some of which include cooking, division of labor,\ngreetings, music, language, law etc. We call a culture is uniform or universal when the general idea is\ntaken into consideration, but the specific form it takes is different. For instance, all human societies have\nsome kind of language, but we observe different languages throughout the world.\n26 4.6 Basic Cultural Elements and Concepts\n4.6.1 Social values\nThe term value in sociology is both similar to and distinct from its meaning in everyday life. As\ncommonly used value often means price. In sociology, we start from the assumption that as individuals\nall of us possess a set of values. We have a value scale or a system of value for deciding what is most\nimportant in life, for instance, placing a high value on intellectual development, wealth, fame etc. Some\nof us may value intellectual development very highly and decide to undergo for several years of training\nto satisfy our objective. For some of us, however, intellectual development may not be a priority or a\nvalue we cherish. On the contrary, we may appreciate fame and to satisfy this objective we may be\ninvolved in music or sports. In the same way, as individuals, every society possesses its own value\nsystem. Values at the level of the society are commonly known as social and/or cultural values.\nSocial or cultural values, culturally defined ideas about what is important, are central to culture. Values\ndelineate how a culture should be. They are shared assumptions by the members of society as to what is\nright and wrong, good or bad, important or unimportant, desirable or undesirable. It means that the\nsociological concept of values hinges on more basic moral issues than the trivialities of price. It involves\njudging the worth of one thing compared to another where neither of the objects can be assigned a price.\nHence, values are widely held beliefs and ideas about what is important to the community’s identity or\nwellbeing, E.g. privacy, equality, freedom etc.\nValues are relative and subjective heavily influenced by time and place. It is important to note, however,\nthat although more or less similar sets of social values can be identified across different societies, not all\nsocieties do have similar value systems. Kluckhohn defines a value as a conception, explicit or implicit,\ndistinctive of an individual or characteristic of a group of the desirable, which influence the selection\nfrom available modes, means and ends of action. Values are also dynamic in that they are liable or\nsubject to changes in response to changes in social conditions.\n4.6.2 Social Norms\nAll societies have rules or norms specifying appropriate and inappropriate behavior and individuals are\nrewarded or punished as they conform to or deviate from the rules it is impossible to imagine a norm less\nsociety, because without norms behavior would be unpredictable. Therefore, societies develop norms,\nwhich manifest or reflect their social values. Norms are derived from our societal values. Norms are the\nstandards, which should govern behavior in roles; they are the society expectations of what is normal.\nSometimes they have to be formalized as law, but most are less formal. Norms constitute the shared\nrules or expectations specifying appropriate behaviors in various situations. We need norms to maintain\na stable social order. Norms can be prescribed and proscribed. Prescribed norms tell us what we should\ndo (wait our turn, pay bills on time, show respect for our elders, etc.). They are things that must be done\nby which an individual in a given society is obliged to do them. For example, respect others; be on time\n27 in class; obey the law; etc. Proscribed norms, on the other hand, tell us what we should not do (hit our\nspouse, curse aloud at a church service, run red lights, etc.). They refer to things must not be committed\nsuch as don’t steal or kill; don’t lie; don’t disturb, etc.\nNorms obviously vary in strength and are classified as mores and folkways according to the intensity of\nfeeling associated with them and the degree of conformity expected. Some norms are defined by\nindividuals and societies as crucial. Based on this assumption, W.G summer broadly divided the norms\ninto two: mores and folkways.\n4.6.2.1 Mores\nMores (pronounced more-ays) are strongly held norms. They represent deeply held standards of what is\nright and wrong. Prohibitions on murder, robbery, and assault are all examples of mores across many\ncultures. Mores are serious social norms up on which society’s existence is believed to depend. They are\nthose norms, which must be followed because they are believed essential to group welfare. By this, we\nmean strong ideas of right and wrong, which require certain acts and forbid others. For example, in\nmodern society all members may be required to wear clothing and to bury their dead. Such “musts” are\noften labeled mores. In short, mores are very important, strictly enforced and punishable. Laws, within\neach society, some norms become codified. We call these codified norms, laws. Mores are considered\nmorally significant breaches and are often formalized as laws. For this reason, punishment for violations\nof mores can be severe, involving sanctions such as arrest or imprisonment. Some mores are so strongly\nheld they have been termed taboos, norms that are so objectionable that they are strictly forbidden.\nTaboos are often things considered unthinkable in a culture. Common examples include incest taboo and\ncannibalism.\n4.6.2.2 Folk Ways\nCompared to mores, folkways are less serious social norms. Folkways are weak norms that are often\ninformally passed down from previous generations. They often deal with everyday behaviors and\nmanners. Feelings about folkways are less intense than feelings about mores and conformity with\nfolkways is largely up to the individual. A person who does not conform to generally accepted norms\narouses little reaction in others except on formal occasions or in special situations. E.g. wearing a mini –\nskirt in church may be highly reacted from the clergymen.\n4.6.3 Social Control\nA mere existence of social norms does not guarantee the universal observation of the norms. Norms are\nenforced through a process of internalization. They become part of who we are as individuals and as a\nculture. However, external social enforcement in the form of both positive and negative sanctions is also\ncritical (Horne 2001). Failure to conform to and/or abide by the norms of society is referred to as non-\nconformity. Non-conformity is broadly classified into two:\n1. Eccentricity: it refers to non conformity to folkways. It is usually overlooked by the members of society.\n28 2. Deviance: it is non-conformity to mores. It is taken very seriously by members of the society because\ndeviants hold at system of values and norms which conflict with the values and norms of the society at\nlarge. E.g. a criminal group.\nThus, a society must have social order if it is to function smoothly. To function effectively, societies\nestablish a system of social control in order to enforce conformity to their norms. Social control means\ncontrol of the society over an individual.\nThere are two types of social control:\n1. Informal Social Control: In simple societies, social control is largely informal. Gossip and other group\nadministered sanctions are sufficient. Everyone knows everyone else. It consists of the techniques where\nby people who know one another on personal basis accord praise to those who comply with their\nexpectations and show displeasure to those that do not.\n2. Formal social control: In complex societies, social control is formal; laws are passed and enforcement\nmachinery is created. Written contracts replace oral agreements. At this level & development folkways\nand mores by themselves are not enough to ensure the general welfare of the society. People well in\nadvance are made aware of the consequences that they will have to face if they transgress social norms.\nSocial control involves the use of sanctions or is accomplished through the applications of sanctions.\nSanctions are actions through which we reward conformity to norms and punish non-conformity.\nSanctions may be of two types:\n1. Positive (Reward) which could be formal positive sanctions include bonuses, medals, promotions, etc or\ninformal positive sanctions which include exaggerated praise, encouragement, signs of approval, flattery,\netc.\n2. Negative (punishment) either formal negative sanctions which includes imprisonment, fines, dismissal\nfrom job, etc or informal negative Sanctions which include criticism, ridicule, gossip, Ostracism,\nstigmatizing, reprimand, etc.\nNote: If the societal norms are not enforced, anomie which is a state of confusion, insecurity or\nnormlessness and lawlessness will reign.\n4.7 Major Concepts of Culture\n4.7.1 Cultural alternatives\nCultural alternatives refer to the activities which the member of society may freely choose to follow or\nnot to follow. Several alternatives are associated with a particular cultural universal thus allowing\npersonal choice. For instance, one widely shared cultural universal by many societies is that people have\nto work and participate in some labor activity in order to earn a living. But the choice of occupation is\nleft to individuals. Choice is limited by the number of roles & the number of people available to perform\nthem.\n29 4.7.2 Cultural Specialties\nCultural Specialties: refer to the special skills or abilities and behavior associated with the cultural\nalternative. Generally, the alternatives are limited by the scope of the division of labor in society. Once\nthe alternative is chosen, the skill the alternative demands must be learned.\n4.7.3 Culture lag\nMaterial culture, such as technology, may change faster than nonmaterial culture. The result may by a\ncultural lag, in which a gap occurs as different aspects of culture change at different rates (Ogburn, 1964;\nVolti, 2001).\n4.7.4 Culture Shock\nDifferent cultures exist around the world that also seems “normal” or “better” to their inhabitants.\nEncountering these different cultures can result in culture shock, confusion that occurs when\nencountering unfamiliar situations and ways of life. It refers to the psychological maladjustment\nindividuals experience when they came across the society different from their own culture, i.e. first\ncontact. It is a feeling of confusion and anxiety caused by contacts with another culture. Culture shock is\nthe disorientation and frustration of those who find themselves among people who do not share their\nbasic values and beliefs. Usually, disagreements over styles of dress, eating habits and other every day\nmatters can be adjusted to fairly easily. Acute culture shock is most likely when expectations about\npersonal feeling and interactions are violated.\nCulture shock is the personal disorientation a person may feel when experiencing an unfamiliar way of\nlife due to immigration or a visit to a new country, or to a move between social environments. One of the\nmost common causes of culture shock involves individuals in a foreign country. The distinct phases of\nculture shock include Honeymoon, Negotiation, Adjustment, Mastery and the Interdependence, as\ndiscussed below:\n• Honeymoon: During this period, the differences between the old and new culture are seen in a\nromantic light. For example, in moving to a new country, an individual might love the new food, the\npace of life, and the locals' habits. During the first few weeks, most people are fascinated by the new\nculture. They associate with nationals who speak their language, and who are polite to the foreigners.\nThis period is full of observations and new discoveries. Like most honeymoon periods, this stage\neventually ends.\n• Negotiation: After some time (usually around three months, depending on the individual),\ndifferences between the old and new culture become apparent and may create anxiety. Excitement may\neventually give way to unpleasant feelings of frustration and anger as one continues to experience\nunfavorable events that may be perceived as strange and offensive to one's cultural attitude. Language\nbarriers, stark differences in public hygiene, traffic safety, food accessibility and quality may heighten\nthe sense of disconnection from the surroundings. Still, the most important change in the period is\n30 communication: People adjusting to a new culture often feel lonely and homesick because they are not\nyet used to the new environment and meet people with whom they are not familiar every day. The\nlanguage barrier may become a major obstacle in creating new relationships: special attention must be\npaid to one's and others' culture-specific body language signs, linguistic faux pas, conversation tone,\nlinguistic nuances and customs, and false friends.\n• Adjustment: Again, after some time (usually 6 to 12 months), one grows accustomed to the new\nculture and develops routines. One knows what to expect in most situations and the host country no\nlonger feels all that new. One becomes concerned with basic living again, and things become more\n\"normal\". One starts to develop problem-solving skills for dealing with the culture and begins to accept\nthe culture's ways with a positive attitude. The culture begins to make sense, and negative reactions and\nresponses to the culture are reduced.\n• Mastery: In the mastery stage assignees are able to participate fully and comfortably in the host\nculture. Mastery does not mean total conversion; people often keep many traits from their earlier culture,\nsuch as accents and languages. It is often referred to as the biculturalism stage.\n4.7.5 Multiculturalism\nMany groups do claim shared cultural patterns. However, there is an increasing recognition and interest\nacross the United States in multiculturalism— a recognition of and respect for cultural differences.\nMulticulturalism allows much of the dominant culture to be shared while valuing some traditions of\nvarious subgroups. Events such as Black History Month and courses such as Women’s Studies\nacknowledge and embrace multiculturalism.\n4.7.6 Xenocentrism\nXenocentrism is the belief that the products, styles or ideas of one’s society are inferior to those that\noriginate elsewhere. It is a condition that an individual devastates his own societal ideal and/or materials\nvalues. In a sense, it is a reverse ethnocentrism.\n4.7.7 Ethnocentrism\nEthnocentrism is a tendency to feel that one’s own particular culture or way of life is superior, right and\nnatural and that all other cultures are inferior and often wrong and unnatural. It is basically an inclination\nto judge other cultures in terms of the values and norms of one’s own culture. In short, ethnocentrism is\nadvocating of individuals that my way of life is the best. All people have a tendency to think of their\nown culture as best. That is why stereotyped thinking may be almost inevitable, but it can at least be\nreduced, if not eliminated. When studying cultures and cultural variations, sociologists must be aware of\nethnocentrism, judging other cultures by the standards of one’s own culture. Because we all live within a\nculture, we tend to see the way our culture does things as “normal” or “natural” and the ways that other\ncultures do things as “abnormal” or “unnatural.” We also tend to judge our own familiar culture’s ways\nof doing things as “better”. Some sociologists such as Marvin Harris (1974) show how ethnocentric\n31 views can result in major misunderstanding of other cultures. If these misguided views were used to\nenact social change, the consequences could be severe.\n4.7.8 Cultural Relativism\nIt is the opposite to that of ethnocentrism. Rather than being ethnocentric, sociologists need to develop\ncultural relativism. This means they should be careful to judge other cultures by those cultures’ own\nstandards. In other words, sociologists try to understand other cultures and why they behave and believe\nas they do rather than judging them “unnatural” or “wrong”. Cultural relativism refers to the notion that\neach culture should be evaluated from the stand point of its own setting rather than from the stand point\nof a different culture. In other words, norms, values and beliefs are relative to the particular culture in\nwhich they exist and should be judged only from the view point of that culture, The “goodness’ or\n“badness” of values. Practices and beliefs are relative to their cultural setting.\n6.7.9 Subculture\nAs part of their interest in cultural diversity, sociologists study subcultures. A subculture is a smaller\nculture within a dominant culture that has a way of life distinguished in some important way from that\ndominant culture. Subcultures form around any number of distinguishing factors. They may form, for\nexample, around hobbies (as with ham-radio operators, custom-car enthusiasts, bingo players, online-\ngame players, hunters, stamp collectors, recreational-vehicle owners), shared interests such as music\nstyles (jazz, hip-hop, rap), other behaviors or interests (cheerleaders, Bible study participants, skydivers,\ndrug users, gamblers, outlaw bikers), occupations (car racing, pilots, police officers), or racial and ethnic\nbackgrounds. Subcultures can also consist of even smaller divisions. For example, although the “teen\nsubculture” may be discussed as if there is little diversity, teens are actually very diverse. They include\njocks, hippies, preppies, ravers, skaters, and more. Each of these smaller subcultures has their own\nbeliefs, interests, and means of interaction (Finnegan 1998). Yet members of a subculture share most of\nthe values of the dominant culture. They earn money by having a job, pay bills, and see that their\nchildren get an education.\nSubculture is a pattern that is distinct in important ways but has much in common with the dominant\nculture. In other words, a subculture contains some of the dominant cultural values but also values or\ncustoms of its own. So, it is a culture with in a culture. Complex societies like that of our own contain\nnot one culture but many ethnic, regional or any other sub-cultures with different values, norms, social\nrelations and life styles. Subcultures are set of beliefs, norms and customs supported by values\ninterpersonal networks of participation in common institutions which exist within a larger social system,\nE.g. Ethnic subcultures, occupational subcultures, and counterculture.\nEvery group has some distinctive patterns, but unless they affect the total life of members, patterns do\nnot make up a sub culture. A sub- culture has a general influence on attitudes and life styles and tends to\ngive a person a specific identity. For example, 1) a sub-culture may be based on an occupation if that\n32 occupation is the context of the everyday life of its members. Such occupations as mining, police work,\nrailroading etc are likely to develop sub- cultures. 2) More typical, however, is a sub-culture tends to be\nwith their special shops, churches and schools. Thus they provide a setting for many of the activities of\ntheir members.\n4.7.10 Counter-culture\nNot all smaller cultures within a dominant culture largely share the dominant culture’s values. A culture\nthat opposes patterns of the dominant culture is known as a counterculture. Countercultures are often\nyouth-oriented (Spates 1976). In the 1960s, hippies advocated dropping out of the mainstream culture\ninto a communal, peaceful, self-exploration lifestyle. Many hippies have today become, at least largely,\npart of the dominant culture. Militias and white supremacists are examples of modern-day\ncountercultures.\n4.7.11 Acculturation\nIt is the adoption of new traits or patterns as a result of contact with another culture. Ideally,\nacculturation is the way one people learn from another as a result of culture contact. Cultural integration\nor acculturation is also the process by which an outsider, immigrant, or subordinate group becomes\nindistinguishably integrated into the domain host society.\n4.8 The process of social interaction\nHuman society is a process of social interaction based on human tendencies of co-operation and conflict.\nIt is a continuous process of change subject to the reactions of individuals in relation to environment.\nSociety is moving equilibrium, a changing process, based on the associative (i.e. adjustment,\naccommodation and assimilation as discussed below) and dissociative (conflict and competition)\nreactions of individuals as members of social groups.\n4.8.1 Adjustment\nAdjustment is a process which man deliberately contrives to fit his needs to the environment or\nenvironment is his needs. It is highly selective and endlessly variant. When members of a society are\nunable to adjust with all kinds of environment, it becomes a specialized process. A civilized man,\nhowever, is capable of readjustment with the new environment and there is remarkable mobility to the\nprocess of adjustment. Readjustment is not an easy affair. It becomes difficult when people belonging\nto different cultural organizations come together.\n4.8.2 Accommodation\nAccommodation is a process of harmony with the environment. It is a manner and degree of adjustment\nof individuals and groups with the social environment. It is less rigid and more flexible in civilized\ngroups than in primitive communities. The recognized forms of accommodation are truce, compromise,\narrangements of subordination and superordination, arbitration and toleration. Accommodation is a\nprocess of resolving rivalries or conflicting situations. It is a systematic handling of rivalries interaction.\n33 4.8.3 Assimilation\nAssimilation is a process of identification or integration of dissimilar individuals or groups in terms of\ncommon interest, attitude and outlook. A major issue in the United States, as well as in other cultures, is\nhow much conformity to dominant cultural patterns will be required. America has long been called a\nmelting pot into which others cultures meld into one new culture. The process of a cultural group losing\nits identity and being absorbed into the dominant culture is known as assimilation. Cultural traits are\nassimilated by the process of inter-communications.\n4.8.4 Conflict and competition\nConflict is a form of rivalry or struggle. It is a social process in which individuals and groups seek their\nends by directly challenging the antagonist by violence or the threat of violence. The dictionary of\nsociology defined as “a process situation in which two or more human beings or groups seek actively to\nthwart each other’s purposes to prevent each other’s interest, even to the extent of injuring or destroying\nthe other”. Conflict may exist in varying degrees. It may be organized, transitory or enduring, physical,\nintellectual or spiritual. It could be direct (i.e. quarrel or litigation, etc) and/or indirect (i.e. through a\nthird party as means to attain ends).\nCompetition, on the other hand, is a modified form of struggle. A competitive endeavor is a basic human\ndrive manifested in procuring the needs of life. There are several forms of competition, absolute and\nrelative. For example, men and women struggle by way of competition to secure social status.\nChapter Five: Socialization\n5.1 Meaning of Socialization\nAs humans, we are social beings who spend our lives interacting with others. Most of us have contact\nwith other humans to some extent every day. Indeed, research shows that isolation from human\ninteraction can be quite damaging. Sociologists and others have studied cases of children who spent their\nearly childhood virtually isolated fbrom all human contact, some literally locked away from human\ncontact by abusive adults. These children lacked basic human responsiveness. Only after focused efforts\nto teach them social skills did these children begin to develop the social behaviors that are required to\ninteract and live as a social being.\nSociologists study how we learn to live in society and interact with others - in other words, how the\nworld is socially organized. They want to know how we learn social expectations, how we learn that\nthese expectations apply to us, and how these expectations become part of us as individuals. They also\nwant to know how these expectations are developed and perpetuated. Socialization is a key to this social\norganization. Socialization is a lifelong social process of learning cultural patterns, behaviors, and\nexpectations. Through socialization, we learn cultural values, norms, and roles. We develop a\n34 personality, our unique sense of who we are.We also pass along culture and social patterns to our\nchildren through socialization.\nSocialization can be looked at from societal and individual points of views:\nFrom societal point of view, socialization is the process of fitting new individuals into an organized way\nof life and teaching them the society’s cultural traditions. Socialization transforms the human animal into\na human being, a member of society. Because of that transformation most babies grow up into fully\nfunctioning social beings, able to use the language of their parents and competent in their society’s\nculture.\nFrom the individual viewpoint, socialization is the process of developing a self. Through interaction with\nothers, person gains an identity, develops values and aspirations, and under favorable conditions\nbecomes able to make full use of his or her potential. Although intensive socialization takes place during\nthe early child hood, socialization is a never-ending process. It begins from early child hood and ends at\nthe end of the life of an individual. Socialization continues throughout life.\n5.2 The Self and Socialization\nWe all have various perceptions, feelings, and beliefs about who we are and what we are like. But we are\nnot born with these understandings. Building on the work of George Herbert Mead, Sociologists\nrecognize that our concept of who we are, the self, emerges as we interact with others. The self is a\ndistinct identity that sets us apart from others. It is not a static phenomenon, but continues to develop and\nchange throughout our lives.\nSociologists and psychologists alike have expressed interest in how the individual develops and modifies\nthe sense of self as a result of social interaction. What follows is the discussion of sociological and\npsychological approaches to the self.\n5.2.1 Sociological Approaches to the Self\nLooking–Glass Self\nCharles Horton Cooley (1864–1929) developed the concept of the looking-glass self. According to\nCooley, society provides a sort of mirror, or “looking-glass,” that reflects to us who we are. We form our\nself image on the basis of how we think others see us. This concept (the process of developing a self-\nidentity or self-concept) consists of three major parts or phases:\ni. the imagination of our appearance to the other person [we imagine how we present ourselves to others – to\nrelatives, friends, even strangers on the streets];\nii. the imagination of the judgment of that appearance [we imagine how others evaluate us (attractive,\nintelligent, shy, or strange)]; and\niii. some sort of self-feeling about ourselves, such as pride or mortification, respect or shame.\n35 We come to think of ourselves in terms of how we imagine others see us. If we think that others see us\nas beautiful or humorous, for example, we come to see ourselves in those terms. If we think they see us\nnegatively, our self-image is likewise negative.\nDramaturgical Analysis\nErving Goffman (1922-1982) developed a dramaturgical analysis in which he compared our everyday\nsocial interactions to theatrical performances. According to Goffman, we interact as if we are actors\nperforming roles on a stage. We use these performances to direct and control the impressions we make in\nothers’ minds. This is called impression management. Through a “presentation of self,” we consciously\nattempt to influence how other people see us. The campaign literature published by political candidates\nis an excellent example of this concept in action.\nDeveloping the theater analogy, Goffman divides social interaction into front-stage and back-stage\nregions. Just like in a play, front-stage behavior is action that occurs for an audience. Back-stage\nbehavior occurs out of sight of any audience. That is where the props and performances are prepared. It\nis also where we can truly be ourselves. Goffman notes that in our social interactions we are both actor\nand audience at the same time.\nGoffman’s work on the self represents a logical progression of sociological studies begun by Cooley and\nMead on how personality is acquired through socialization and how we manage the presentation of the\nself to others. Cooley stressed the process by which we create a self; Mead focused on how the self\ndevelops as we learn to interact with others; Goffman emphasized the ways in which we consciously\ncreate images of ourselves for others.\nPsychological Approaches to the Self\nSociologists have also looked to the field of psychology for insights that help inform their understanding\nof the socialization process; and psychologists have shared the interests of sociologists in the\ndevelopment of the self. Early work in psychology, such as that of Sigmund Freud (1856-1939), stressed\nthe role of in-born drives – among them the drive for sexual gratification – in channeling human\nbehavior.\nMuch of the work of Sigmund Freud (1856–1939), is both complex and controversial. However, Freud\nmade important contributions to our understanding of socialization. He argued that early socialization is\ncritically important to personality development and to managing natural desires that promote self-interest\nrather than social interests. He also addressed the importance of internalizing norms and values.\nAdditionally, Freud (1950) moved beyond Cooley’s and Mead’s focus on conscious perceptions,\nidentifying the importance of the unconscious mind.\nFreud (1950) saw personality as divided into three parts: the id, the ego, and the superego. The id is\nmade up of our basic biological drives and needs. These are our sexual drives and fundamental needs,\n36 including food. They are self-centered rather than socially centered, and they crave immediate\ngratification.\nThe ego is our “self,” our personality, which balances the urges of the id with the requirements of a civil\nsociety. The desires of the id have to be tempered. Chaos would result if everyone was constantly\nseeking to gratify all of their own desires. Society would not be able to exist as we know it. Through\nsocialization, which Freud saw as primarily the responsibility of parents, we learn to repress our id and\ndevelop the ego.\nThe superego consists of our internalized social controls, culture, values, and norms. It is our\nconscience. The id and the superego are engaged in a constant struggle, mediated by the ego in a largely\nunconscious process. If the ego mediates properly, the person will be well socialized and well adjusted.\nOtherwise, the result will be a personality problem.\n5.3 Types of Socialization\nSociologists recognize that the experience of socialization is a lifelong process. It occurs from childhood\nthrough adulthood and even into old age. It occurs across our entire life span and, to some extent, across\nall of our social interactions. People move into, and out of, roles cthroughout their lives from “getting a\ndriver’s license, high school graduation, marriage, divorce, the first full-time job, retirement, [through]\nwidowhood. In general, each major transition initiates a new socialization experience or situation that\nhas implications for the individual’s self-concept.” At the end of life, socialization processes even help\npeople prepare for death.\nBecause socialization begins at birth and continues throughout the life cycle, it is a process that takes\ndifferent forms depending on the stage of life and the special environmental and situational problems\nthat may arise. There are four kinds of socialization:\n1. Primary socialization\n2. Anticipatory socialization\n3. Adult Socialization and\n4. Re-Socialization\n1. Primary/Childhood Socialization\nThe most crucial phase of learning for an individual occurs in the first years of life. In the early years of\nchild hood, incredible complex learning must occur, and it occurs relatively quickly. This early child\nhood socialization is referred to as primary socialization. It is called primary because it supplies the\nfoundation for all other learning and it must come first. Most often the child learns from the family\nthrough imitation, conditioning and reward for accomplishing the expected behavior.\nIn primary socialization, the child must learn the basic skills necessary to function in society. The child\nmust master or begin to master motor skills involving coordination and control of the body such as\n37 walking, grasping, and feeding himself or herself and so on. Language and the understanding of symbols\nand gestures must be mastered if any further learning is to take place.\n2. Anticipatory Socialization\nAnticipatory socialization involves learning and adopting the attitudes and behavior of group or category\none desires or expects to join (before one joins it). It is useful in helping the upwardly mobile adapt to\ntheir new position in society. One way of learning the roles we will play in our lives is to rehearse them.\nAnticipatory socialization refers to learning roles by practicing those we anticipate playing in the future.\nIn child hood, for example, children play house-boys practice playing the father and husband roles, while\ngirls rehearse the behavior they see in their mothers. Numerous examples of anticipatory socialization\ncan be found at various stages in our lives.\nChildren, as well, spends hours copying role models from Television. Here, toys and games give\nchildren the opportunity to experience, through play, a taste of what they may do in the future. There are,\nfor example, toys for children to practice occupations such as doctor, firefighter, teacher, etc.\nAnticipatory socialization is a part of primary socialization, but is not restricted to it. We continue to\nrehearse though much of our lives because rehearsal functions as a powerful learning tool. It serves as a\nmeans of preparation by which people gain some certainty and confidence regarding their performance\nbefore others.\n3. Adult Socialization\nAdult socialization is the learning that builds on and modifies primary socialization and is required all of\nus as we move into new stages of life and face a changing environment Adult socialization is sometimes\ncalled secondary socialization.\n4. Re-socialization\nA drastic shift that involves giving up one way of life for another that is not only different from it but\nalso incompatible with it.\nE.g.: 1. Brainwashing – is rejecting old beliefs and ideas and accepting new ideas.\n2. Rehabilitation of criminals\n3. Religious conversion of sinners\nIn all of the above cases, a person breaks with the past and is made over. Re-socialization of adults often\ntakes place in what is called a total institution, an environment that is usually isolated from the\ncommunity such as religious places, prisons, mental hospitals etc.\nRe-socialization is sometimes confused with adult socialization and it is important to distinguish the\ntwo processes. It is helpful to think of adult socialization as the learning process required of all of us as\nwe adjust to new stages in our lives. Re-socialization, on the other hand, applies to situations that are\nmore unusual and dramatic. It requires some break with a past way of life because the past way of life no\nlonger works in a radically new situation.\n38 5.4 Agents/Settings of Socialization\nThroughout life, people change their attitudes, values and self-images as they take on new roles &\nundergo new experiences. The lifelong socialization process involves several social forces that influence\nour lives and alter our self-images. In the study of socialization, sociologists emphasize the following\nsocializing agents as influential in transmitting the culture to the individual and in fostering the\nindividual’s personality and social self: the family, school, peer group, mass media and technology,\nworkplace, and religion and the state.\n1. The Family\nFamily is a group of people organized on the basis of natural sympathy and affection. Family is a group\nof interacting personalities who have definite and specific roles to play, in that group, e.g. the father has\nto protect, the mother has to nourish, and the child has to obey.\nAcross all societies, the family is the first and most important location for socialization. The family\nbegins the process of socialization and is the first major setting in which the child interacts. The family\nprovides the earliest human contact for an infant. The family into which we are born provides us social\ncharacteristics such as social class, race and ethnicity, and religious background. Our families are our\ninitial teachers of behaviors, language, cultural knowledge, values, and social skills. They are also\ncentral to gender role socialization. In other words, they provide our primary socialization.\nOlder research focused almost exclusively on parents as agents of socialization for children. Newer\nresearch examines how children influence parents as well. Researchers are also looking at how changing\nfamily structures, such as the increasing number of single-parent families, impact child socialization.\nThe major functions of family could be summarized as:\n1. Affectual: The family has to provide care, love and affection\n2. Economic: Parents have to satisfy the economic needs of the child. They have to provide food, clothing,\neducation and recreation. They have to prepare him for independent economic life. They have to train\nhim for some vocation or occupation in life.\n3. Protection: The family has to protect the child from threats.\n4. Educational: Home is the first institution of the child and mother is the first teacher of a child. The child\nreceives earliest knowledge and experience in the family. It lays foundation for the child’s character and\npersonality. The lessons he learns in the family may not be planned but they exercise profound influence\non his body and mind and moulds his personality.\n5. Religious: Family has to provide some religious instruction to the child to develop plenty of thoughts,\nkind heartedness and fellow feelings.\n6. Family status: The family has to transmit the culture of the community and family traditions and status.\nProfessions, for instance, are usually transmitted from father to sons.\n39 2. School\nLike the family, schools have an explicit mandate to socialize people, especially children, into the norms\nand values of society. In schools, students are exposed to a variety of different experiences. They interact\nwith people of different races, ethnicities, religions, social classes, and value systems, perhaps for the\nfirst time. These secondary-group interactions with schoolmates and staff are different than the primary-\ngroup interactions they have had with their families. When children enter school, they enter a\nbureaucracy where they are expected to learn how to be a student. They will be educated not only in\nacademic skills, but also in a hidden curriculum that encourages conformity to the norms, values, and\nbeliefs held by wider society. Students learn to speak with proper grammar, stand in line and wait their\nturn.\nIn addition to families, schools also contribute to gender-role socialization. Formal and informal\ninstitutional activities such as recess periods and games socialize children into culturally approved\ngender roles.\n3. Peer Group\nWhen you were a 16-year-old, how many times did you complain to your parent(s), “All of my friends\nare doing so and so. Why can’t I? It isn’t fair!” As this all-too-common example indicates, our friends\nplay a very important role in our lives. This is especially true during adolescence, when peers influence\nour tastes in music, clothes, and so many other aspects of our lives. But friends are important during\nother parts of the life course as well. We rely on them for fun, for emotional comfort and support, and\nfor companionship.\nWhen a child grows older, the family becomes somewhat less important in his social development.\nInstead, peer groups - those of similar age, social class, and interests - increasingly assume the role of\nMead’s significant others (individuals who are most important in the development of the self). Within\nthe peer group, young people associate with others who are approximately their own age, and who often\nenjoy a similar social status.\nPeer settings allow children to engage in activities outside of parental control and other adult\nsupervision. With their peers, children are able to engage in democratic relationships with out the\nascribed differences given in the home. Children, for example, quickly learn the power and the pain of\nridicules from peers and feel the need to fit in and be like the others. As a result, children are constantly\nlearning new behavior and attitudes from other children.\nInteractions within the peer group accomplish much in the establishment of identity and self concept.\nFrom other children, they learn how they are perceived by others outside their family. Those perceptions\nin turn affect how they perceive themselves. For instance, they may entertain the idea whether other\nchildren call them skinny or fat, fast or slow, smart or stupid, cute or ugly, friendly or unfriendly, etc.\n40 Peers also provide role models for eacch other. Today, much of the pressure to wear the right clothes and\ndo certain things stems from the role modeling of peers and the desire to please the peer group becomes\nespecially acute during the adolescent years, when youths often feel a need to break away from the\nfamily and parental control.\n4. Mass Media and Technology\nMass media, impersonal communications that are directed in a one-way flow to a large audience, are\nalso important in the socialization process. These media innovations are pervasive throughout society.\nThey include newspapers, magazines, recorded music, movies, radio, television and internet. We are\nexposed to a variety of behaviors, ideas, beliefs, and values through the media. We also obtain many of\nour views about society and how things are or should be through the mass media. For example, whether\nor not we have ever met a team of emergency room physicians or observed surgery, we develop\nexpectations about these people and situations based on media portrayals (e.g., televised medical dramas\nand documentaries about medical procedures).\nA number of sctudies have found that the mass media in various forms including children’s bbooks (e.g.,\nDavis 1984; Peterson and Lach 1990), television programming (e.g., Thompson and Zerbinos 1995), and\nadvertising (Kilbourne 2000) perpetuate gender stereotypes and gender role socializationb.\nThe mass media do not always have a negative socializing influence. Television programs and even\ncommercials can introduce young people to unfamiliar lifestyles and cultures. Sociologists and other\nsocial scientiscts are also interested in online friendship networks, like Facebook.\n5. Religion\nAlthough religion is arguably less important in people’s lives now than it was a few generations ago, it\nstill continues to exert considerable influence on our beliefs, values, and behaviors; and continues to be a\npowerful agent of socialization. But here, we should distinguish between religious preference (e.g.,\nProtestant, Catholic, or Jewish) and religiosity (e.g., how often people pray or attend religious services).\nBoth these aspects of religion can affect your values and beliefs on religious and nonreligious issues\nalike, but their particular effects vary from issue to issue. To illustrate this, consider the emotionally\ncharged issue of abortion. People hold very strong views on abortion, and many of their views stem from\ntheir religious beliefs.\nReligious instruction contributes greatly to the identities children construct for themselves. Children tend\nto develop the same religious beliefs as their parents; switching to a religious faith different from the one\nin and the State which a person is raised is rare. Even those who renounce the religion of their youth are\ndeeply affected by the attitudes, images, and beliefs instilled by early religious training. Very often those\nwho disavow religion return to their original faith at some point in their life, especially if they have\nstrong ties to their family of origin and if they form families of their own.\n41 Religious socialization shapes the beliefs that people develop. An example comes from studies of people\nwho believe in creationism. Creationism is a set of beliefs that largely reject the theory of human\nbiological evolution and instead argue that human beings as now exist were created by a central force or\nGod. Those who believe this have generally been taught to believe so over a long period; that is, they\nhave been specifically socialized to believe in the creationist view of the world’s origin and to reject\nscientific explanations, such as the theory of evolution.\nReligious socialization also influences a large number of beliefs that guide adults in how they organize\ntheir lives, including beliefs about moral development and behavior, the roles of men and women, and\nsexuality, to name a few.\n6. Workplace\nThe workplace is also a major location for socialization. Workplace socialization requires that we learn\nto fulfill the role of worker, demonstrating the requisite job skills and norms associated with the position.\nNurses, for example, must learn how to transfer the skills and values acquired during training to the\nwork setting. That includes fitting the norms of how nurses interact with physicians, colleagues, and\npatients, how they dress, and how they present themselves as a “nurse.”\nSocialization into an occupation can represent both a harsh reality (“I have to work in order to buy food\nand pay the rent”) and the realization of an ambition (“I’ve always wanted to be an airplane pilot”).\n7. Sports\nMost people perhaps think of sports as something that is just for fun and relaxation—or perhaps to\nprovide opportunities for college scholarships and athletic careers—but sports are also an agent of\nsocialization. Through sports, men and women learn concepts of self that stay with them in their later\nlives.\nSports are also where many ideas about gender differences are formed and reinforced. For men, success\nor failure as an athlete can be a major part of a man’s identity. Even for men who have not been athletes,\nknowing about and participating in sports is an important source of men’s gender socialization. Men\nlearn that being competitive in sports is considered a part of manhood. Indeed, the attitude that “sports\nbuilds character” runs deep in the culture. Sports are supposed to pass on values such as competitiveness,\nthe work ethic, fair play, and a winning attitude. Sports are considered to be where one learns to be a\nman.\nChapter six: Social Interaction and Social Structure\n6.1 Introduction\nHuman society is a system of social interaction that includes both culture and social organization. Within\na society, members have a common culture, even though there may also be great diversity within it.\nMembers of a society think of themselves as distinct from other societies, maintain ties of social\n42 interaction, and have a high degree of interdependence. The interaction they have, whether based on\nharmony or conflict, is one element of society.\nWithin society, social interaction is behavior between two or more people that is given meaning by\nthem. Social interaction is how people relate to each other and form a social bond. It refers to the ways in\nwhich people respond to one another, whether face-to-face or over the telephone or on the computer. But\nfew, if any, of the interacting people realize that their behavior is at that moment influenced by society—\na society whose influence extends into their immediate social relationships, even when the contours of\nthat society—its social structure—are likely invisible to them.\nSociologists use the term social structure to refer to the organized pattern of social relationships and\nsocial institutions that together compose society. It refers to the way in which a society is organized into\npredictable relationships.\n6.2 Elements of Social Structure\nAll social interaction takes place within a social structure, including those interactions that redefine\nsocial reality. Statuses, roles, groups, social networks and social institutions are the major elements of\nany social structure.\n6.2.1. Status\nStatus is central to social interaction and social structure. To sociologists, status is established social\nposition in a social structure that carries with it a degree of prestige. It is a rank in society. Unlike\npopular usage of the term, having “status” in sociological terms does not equate to prestige. To\nsociologists, everyone has status, although some do have higher status than others as judged by society.\nStatus signifies the numerous social spaces existing in a society. These spaces are independent of the\nindividuals who occupy them; they simply designate the positions necessary to the ongoing functions of\na society: student, teacher, bank teller, lawyer, prisoner, mother, husband, etc.\nStatuses are obtained in different ways. They can be either achieved or ascribed.\nAchieved statuses are those positions acquired through personal effort. Being a sociology student,\narchitect, parent, square dancer, or shoplifter are all achieved statuses. Individuals had to do something\nto become each of these things.\nAscribed statuses are positions involuntarily acquired through birth. They are occupied from the\nmoment a person is born. Your biological sex is an ascribed status. Being a son, a brother, or ab princess,\ntoo are all ascribed statuses. Some achieved statuses may depend at least to some extent on ascribed\nstatuses. For example, because of their sex, women are not currently allowed to achieve positions as\nsubmariners in the U.S. navy. Ascribed statuses are those occupied from the moment a person is born.\nCollectively, all the statuses a person holds at once comprise his or her status set. We often use the term\nmultiple statuses or status set for all the statuses that a person occupies. It refers to complement of a\ndistinct statuses occupied by an individual, each of these in turn having its own role set. Each of the\n43 people in the clinic holds a number of different statuses at the same time. The doctor may also be a\ndaughter, wife, mother, member of the garden club, and civic-league president. This status set changes\nfrequently over a person’s lifetime. Continuing with the doctor as an example, her status set changed\nwhen she moved from being a medical student to a doctor. It changed when she married and would\nchange again if she were to divorce or be widowed. She could remove or add statuses from her set by\nresigning from the civic league or running for political office.\nAlthough people occupy many statuses at one time, it is usually the case that one status is dominant,\ncalled the master status, overriding all other features of the person’s identity. The master status may be\nimposed by others, or a person may define his or her own master status. It is a very influential status that\nbecomes more socially important than all other statuses. A master status may attach to either positive or\nnegative statuses. The doctor in our example may be defined by her occupation. Whatever else she is,\nshe is first a doctor to those she meets in social settings. Other people may respond to her with the\nprestige accorded that position. If the doctor were to be convicted of a serious crime such as insurance\nfraud or selling prescription narcotics, she might find that her master status becomes that of a criminal.\n6.2.2. Social roles\nBy virtue of occupying a particular status, we have social relationships with occupants of other status.\nThese relationships and the norms that govern them are called roles. Roles, like statuses, are also central\nto social interaction and social structure. The two concepts of status and role go hand in hand. A role is\nthe behavior others expect from a person associated with a particular status. Role can be regarded as\nbundle of expectations. It is the pattern of behavior associated with or expected of a person or the\nindividual who occupies a status. When one puts the rights and duties which constitute the status into\neffect, he is performing a role.\nAs illustrated above, a role is a behavior expected of someone in a particular status. Using the status of\nthe doctor from the examples above, a number of role expectations can be identified. Doctors should\ncome to work. They should examine patients competently and discuss their concerns. They should\nprescribe medicine lawfully. All of these examples illustrate how we expect doctors to act. These roles\ntogether illustrate a role set, all of the roles that go with a single status. Role set is a concept, which\nindicates the complements of roles associated with a particular status. Therefore, each social status\ninvolves not a single associated role but an array or roles.\nEach of us simultaneously occupies many statuses and for each status, has several roles. For example, a\nperson who takes a status of a lecturer at Gondar College of Medical Sciences does have several roles to\nplay including giving lecture to students, doing research, sitting at departmental meetings to decide on\ndepartmental affairs, taking extra assignments with other government and non-government agencies, etc.\nanother example is also illustrated in below diagram:\n44 Part-time\nChurch-goer\nAsian waitress\nAmerican\nGirlfriend\nA person\nDaughter\nRoommate\nStudent\nWoman\nFigure 6.1 Roles in a college Student’s Role\nAll these are complementary roles associated with the person and are referred to as role set. A person\nmay occupy several statuses and roles at one time. A person’s role set includes all the roles occupied by\nthe person at a given time. Thus, a person can be a teacher, a husband, father and Idir chairman. In this\nparticular case the person has four status positions.\nEach status demands a different role. As a result of this, they have multiple roles, a variety or complex of\nroles related with different statuses which are called multiple roles. It refers to the different roles played\nby the individual as a result of occupying different status. A doctor, for example, may be at the same\ntime the head of a house hold, a church member, a lecturer etc. Each of these is a different status and\ndemands a different role. Be reminding that multiple roles refer not to the complex of roles associated\nwith a single social status but with the various social statuses (often in differing institutional spheres) in\nwhich people find themselves.\nThe roles for different statuses the person holds may conflict with each other. This is known as role\nconflict. Role conflict is a situation where a person’s roles attached to multiple statuses may clash with\neach other. Role strain, on the other hand, is the incompatibility of roles attached to a single status. It\noccurs when two or more roles associated with a single status are in conflict. This requires balancing\nexpectations. For example, being a student, a person may face difficulties in doing things at the same\ntime such as studying, taking class, doing assignments, taking meals, etc.\n6.2.3 Groups\nAt the micro-level, society is made up of many different social groups. Groups play a vital role in a\nsociety’s social structure. Much of our social interaction takes place within groups and is influenced by\ntheir norms and sanctions. At any given moment, each of us is a member of many groups\nsimultaneously, and we are subject to their influence: family, friendship groups, athletic teams, work\ngroups, racial and ethnic groups, and so on. The various types of groups will be discussed in the next\nchapter.\n45 6.2.4 Social Networks\nA social network is a set of links between individuals, between groups, or between other social unitsb,\nsuch as bureaucratic organizations or even entire nations. It represents a serious of social relationships\nthat links a person directly to others; and through them indirectly to still more people. One could say that\nany given person belongs simultaneously to several networks. Your group of friends, or all the people on\nan electronic mailing list to which you subscribe, or all of your Facebook subscribers are social\nnetworks.\n6.2.5 Social Institutions\nA social institution (or simply an institution) is an established and organized system of social behavior\nwith a recognized purpose. The term refers to the broad systems that organize specific functions in\nsociety. It is a pattern which has developed around a major social function, goal or need. It is thus a\nmeans to an end.\nAn institution is an organized network of values, norms, folkways and more through which a particular\nhuman society organizes itself and directs its members in the performance or its activities to satisfy their\nneeds. Here it should be noted that institutions are universal in nature although they vary considerably in\nterms of their level of development and the functions they perform.\n6.3 Major Institutional Classifications\nThere are a vast array of institutions each of which having their goals, rules and regulations assisting in\nthe orderly functioning of society. Different scholars have classified social institutions in different ways.\nHowever, they generally agree that four major institutional classifications can be defined as follows:-\n1. Political institutions – Those institutions dealing with regulating the acquisition and exercise of power\nby some individuals or groups over others. In doing so, they play a basic role of maintaining peace and\norder.\n2. Economic institutions – are concerned with the production, Distribution, and consumption of goods\nand services a society requires to meet its needs.\n3. Kinship institutions – those institutions of a family that incorporate a wide network of relations due to\nthe consanguinal and affinial relations between communities.\n4. Expressive and integrative institutions – deal with educational, health, religions and recreational\naspects of society.\nNB: It is important to note that social institutions are interrelated and have considerable influence on\neach other.\nBasic Social institutions. There are five basic social institutions, including:\n1. The Family\nDefinition: “family is a socially sanctioned, relatively permanent grouping of people who are united by\nblood, marriage or adoption ties and who generally live together and cooperate economically.”\n46 Functions: The following are among the more or less universal functions of the family find throughout\ntime and in all societies. However, the family has many other important functions that many vary\novertime and from one society to another.\n1. Reproduction and regulation of sexual behavior: reproduction is a prerequisite for the survival of a\nsociety. The family provides institutionalized means by which the society’s members are replaced from\ngeneration to generation. The family also provides for and regulate sexual derive. E.g. Premarital sex,\nincest taboo\n2. Care and protection of the young: Young children through their long period of dependency need care\nand protection.\n3. Socialization: the family is virtually the only primary social institution responsible for the early\ndevelopment of personality in the individual.\n4. Family also provides the means by which in individual’s social status is initially fixed. For example,\nthrough the family individual member are assigned their ethnic or social status, their initial religious\nstatus and their class status.\n5. The family also provides the affection, love and emotional support that are so vital to human\nhappiness.\nFamily Structure\n1. Nuclear Family: the basic family unit. Consists of a wife, a husband and their children. Common in\nmore developed world.\n2. Extended Family: Consists of all those people defined as kin. Kin are people who are related by birth\nor birth or marriage (blood or affiliation). For example, when young couples marry, they will at times\nmove in with the parents of the bride or groom. The house hold containing these two generation is an\nexample of extended family.\nPatterns of residence\n1. Patrilocal residence: a newly married couple that move in within the husband’s parents.\n2. Matriblocal residence: a newly married couple that move in with the wife’s parents.\n3. Neolocal residence: here, a young newly married couple is usually expected to set up housekeeping in\nits own apartment or house. This is most common in advanced countries.\nPatters of Marriage\n1. Monogamy: is marriage of one male and one female. It is common among Christians (advanced\ncountries). And it is the most common type of marriage relationships.\n2. Polygamy: Plural marriage; it consists of one person of one sex and two or more persons of another\nsex. It is, thus of two types:\n Polygyny: marriage of one man to two or more women\n Polyandry: marriage of one woman to two or more men.\n47 Patterns of mate selection\n1. Endogamy: is marriage with in specific group whether it is religious, ethnic, class or any other type.\n2. Exogamy: Marriage outside of a specific group.\nPatterns of Authority\n1. Patriarchy: is the authority of the family primarily vested in the husband (father). In this pattern of\nauthority every decision concerning the members of the family is solely made by the husband/older male\nmember of the family.\n2. Matriarchy: is when the authority is primarily vested in the wife/older women member of the family.\n3. Egalitarian: When the authority is more equally shared or balanced between husband and wife.\nPatterns of Descent and Inheritance\n1. Matrilineal: Descent and inheritance pass through the female side of the family. The father’s relatives\nare not considered as kin. Property passes only through the female live.\n2. Patrilineal: Descent and inheritance pass through the male line (side) of the family. Here, the\nmother’s relatives are not considered as kin and hence are deprived or property rights.\n3. Bilineal: Descent and inheritance are traced through both sides of the family. This system considers\nboth the mother’s and sister’s relatives and property passes to both sides.\n2. Religious Institution\nSociologists are not generally concerned with weather religious belief is right or wrong. They are mainly\ninterested in the significance of religion in a society.\nWe find some kind of religion in all societies(universality of religion). The religious institution meets\nmany basic human needs and its function in society can be broadly categorized under three headings.\n1. Individual support: Religion can provide a source of explanation and meaning for individuals when\nfaced by strains and crisis in their lives such as war, death and natural disasters.\n2. Social integration: Religion provides unity, cohesiveness and solidarity in a society. Durkheim saw\nreligion as a kind of social glue, binding society together and intergrading individuals into it.\n3. Social control: Religion provides people with ethical principles and a set of guide lines for appropriate\nand in appropriate behavior.\n3. The Economic Institution\nThe economic institution is universal. Its goal is the meeting of society’s economic needs, and it\nperforms the following functions in order to meet them. To meet these function people have to cooperate\nwith one another and create responsible organization, especially under condition when there exist\nextensive division of labor and thus specialization in certain labor activities.\nFunctions:\n1. Gathering of resources\n2. The manufacturing of goods and services\n48 3. The distribution of goods and services\n4. The consumption of goods and services\nIn less complex societies, non-industrialized countries, economic institutions are merged with families\nand tribe, and it is difficult to distinguish economic activities from family life, religion, politics and\nsocial relations. In more complex societies economic institution is more clearly separated from other\nsocial institutions\n4. The Polity\nThe political institution is the complex of norms that regulate the acquisition and exercise of power by\nsome individuals or groups over other within a given territory through social structures claiming a\nmonopoly ultimate authority.\nFunctions:\n1. Regulating the power of some people over others: It determines when, how and who should gain\npower.\n2. Resolving conflicts that exist among various segments of society.\n3. Institutionalizing and enforcing social norms through laws which are established by governments’\nlegislative body.\n4. Protecting citizens from outside enemies.\nIn general, political institution plays a basic role of maintaining peace and order.\n5. Educational Institution\nFunctions:\n1. Socialization: Schools are important agencies of secondary socialization which usually beginning in\nthe family. Schools transmit societal values, attitudes, beliefs, norms, specific skills and system of\nknowledge to young people.\n2. Recruitment: The Educational institution recruits, young people for specific roles by sorting out those\nwho are best suited. In short, Educational institution produces labor force with the appropriate skills\nneeded for work.\n3. Social Control: Schools act as important agencies of social control, which encourage children to learn\nand conform to the values and norms expected by society. This is mainly carried out through the hidden\ncurricula as there are no organized course in obedience and conformity.\n3. Preparing for social change: Beyond encouraging people to accept culture which will lead to stability,\nschools also prepare students for a rapidly changing industrial society. It promotes technological changes\nin society by providing the basis of knowledge and skill that enable technological innovation to occur.\nChapter seven: Social Groups and Organizations\n7.1 Introduction\nThe study and understanding of social groups is central to sociology. Social groups and organizations\ncomprise a basic part of virtually every arena of modern life. We live most of our lives within social\nsettings, so sociology is actually a study of our experiences within groups. Thus, in the last six decades\nor so, sociologists have taken a special interest in studying these scientific phenomena from a scientific\npoint of view.\n49 Sociologists devote much attention to groups of all sizes and characteristics. Much sociological study\ninvestigates “how individuals are shaped by their social groups, from families to nations, and how\ngroups are created and maintained by the individuals who compose them.”\n7.2 Social Groups\nThe term group has a specific definition in sociology that differs from everyday usage. In everyday\nlanguage, almost any collection of people might be called a group. However, two or more people being\nin close physical proximity does not constitute a group in the sociological meaning of the word.\nSociologically speaking, a group is a collection of people who interact regularly based on some shared\ninterest and who develop some sense of belonging that sets them apart from other gatherings of people.\nIn other words, a group is a collection of individuals who:\n• interact and communicate with each other;\n• share goals and norms; and,\n• have a subjective awareness of themselves as “we,” that is, as a distinct social unit.\nTo be a group, the social unit in question must possess all three of these characteristics.\nPeople who just happen to be in the same place at the same time are not a group. Rather, they are an\naggregate. It is a collection of people who are in the same place, but who do not interact or share\ncharacteristics. Individuals riding the bus or walking their dogs in a park are examples of aggregates. If\nthese people interact and develop some sort of shared interests or sense of themselves as a group, then\nthey become a group by definition. For example, the individual dog walkers might begin to talk with\neach other about their pets, start to walk their dogs on the same schedule, and even plan events together,\nsuch as an obedience class. Through these shared interests and interactions, the dog walkers may begin\nto identify themselves as members of a group. They might even adopt some sort of name to identify\nthemselves. Another, albeit tragic, example of an aggregate developing very quickly into a group was on\nSeptember 11, 2001, when hijackers flew airplanes into the World Trade Center and Pentagon. The\npassengers on United Airlines Flight 93 that crashed in Pennsylvania started as an aggregate and became\na group when they joined together to fight the hijackers.\nAnother term that is often confused with group is category. A category refers to people who share\nsimilar characteristics or status. Age, race, gender, income level, religious affiliation, being a musician,\nowning a pet, or living in an apartment are all categories. People in a category do not necessarily interact\nor share any sense of belonging, and may not even know each other.\nSocial categories can become social groups, depending on the amount of “we” feeling the group has.\nOnly when there is this sense of common identity, as defined in the characteristics of groups above, is a\ncollection of people an actual group. For example, all people nationwide watching “Ye ehud meznagna”\non ETV on Sunday afternoon form a distinct social unit, an audience. But they are not a group because\nthey do not interact with one another, nor do they possess an awareness of themselves as “we.”\n50 However, if many of the same viewers were to come together for a large meeting, such as fans of the\nlong-running TV series Star Trek (the fans call themselves “Trekkies”) coming together for a convention\nwhere they could interact and develop a “we” feeling, then they would constitute a group.\nWe now know that people do not need to be face-to-face in order to constitute a group. Online\ncommunities, for example, are people who interact with each other regularly, share a common identity,\nand think of themselves as being a distinct social unit. On the Internet community Facebook, for\nexample, you may have a group of “friends,” some of whom you know personally and others whom you\nonly know online. But these friends, as they are known on Facebook, make up a social group that might\ninteract on a regular, indeed, daily basis—possibly even across great distances.\nGroups also need not be small or “close-up” and personal. Formal organizations are highly structured\nsocial groupings that form to pursue a set of goals. Bureaucracies, such as business corporations or\nmunicipal governments or associations such as the Parent-Teacher Association (PTcA), are examples of\nformal organizations.\n7.2.1 Types of Groups\nSociologists have made distinctions between different types of groups: primary and secondary groups,\nin-groups and out-groups, and reference groups.\n1. Primary and Secondary Groups\nCharles Horton Cooley (1864–1929), a famous sociologist of the Chicago School of sociology,\nintroduced the concept of the primary groups, defined as those small groups in which all the members\nhave enduring, intimate face-to-face interaction and relatively long-lasting relationships. In his original\nformulation, primary was used in the sense of “first.” Examples of primary groups are families, friends,\npeers, neighbors, classmates, sororities, fraternities, and church members. These groups are marked by\nprimary relationships in which communication is informal. Members of primary groups have strong\nemotional ties. They also relate to one another as whole and unique individuals.\nPrimary groups have a powerful influence on an individual’s personality or self-identity. The effect of\nfamily on an individual can hardly be overstated. The weight of peer pressure on schoolchildren is\nparticularly notorious. Street gangs are a primary group, and their influence on the individual is\nsignificant; in fact, gang members frequently think of themselves as a family. Inmates in prison very\nfrequently become members of a gang—primary groups based mainly upon race–ethnicity—as a matter\nof their own personal survival. The intense camaraderie formed among Marine Corps units in boot camp\nand in war, such as the war in Iraq, is anothecr classic example of primary group formation and the\nresulting intense effect on the individual and upon her or his survival.\nIn contrast to primary groups are secondary groups, those larger groups in which all members do not\ninteract directly and have relationships that are less intimate, less personal or emotional and less long-\nlasting than those of primary groups. Secondary groups are marked by secondary relationships in\n51 which communication is formal. Members of secondary groups may not know each other or may not\nhave much face-to-face interaction. They tend to relate to others only in particular roles and for practical\nreasons. An example of a secondary relationship is that of a stockbroker and her clients. The stockbroker\nlikely relates to her clients in terms of business only. She probably will not socialize with her clients or\nhug them. Secondary groups also include all the students at a college or university, all the people in your\nneighborhood, and all the people in a bureaucracy or corporation.\nPrimary relationships are most common in small and traditional societies, while secondary relationships\nare the norm in large and industrial societies. Because secondary relationships often result in loneliness\nand isolation, some members of society may attempt to create primary relationships through singles’\ngroups, dating services, church groups, and communes, to name a few. This does not mean, however,\nthat secondary relationships are bad. For time and other commitments limit the number of possible\nprimary relationships in modern society, acquaintances and friendships can easily spring forth from\nsecondary relationships.\n2. In-groups and Out-groups\nWhen groupsc have a sense of themselves as “us,” they will also have a complementary sense of other\ngroups as “them.” The distinction is commonly characterized as in-groups versus out-groups. The\nconcept was first employed by William Graham Sumner and elaborated by the early sociological theorist\nW. I. Thomas. In-groups represent those groups with which we identify and feel a sense of belonging\nand loyalty. Out-groups are those with which we do not identify or toward which we may even feel\nanimosity/antagonism.\nTo some extent every social group creates boundaries between itself and other groups, but a cohesive in-\ngroup typically has three characteristics:\n Members use titles, external symbols, and dress to distinguish themselves from the out-group. E.g.\nsymbols such as team uniforms; and rituals such as secret handshakes.\n Members tend to clash or compete with members of the out-group. This competition with the other\ngroup can also strengthen the unity within each group.\n Members apply positive stereotypes to their in-group and negative stereotypes to the out-group.\nWe tend to develop a bias in which we favor our in-groups, perceiving them in a better light than those\n“others.” We often prefer our fraternity or sorority, our church, our sports team, or people from our\nethnic group, for example, over others for this reason. Conflict with another group(s) can strengthen\ngroup solidarity.\n3. Reference Groups\nSociologists are also interested in how we use groups to judge ourselves and our attitudes, beliefs,\nbehaviors, and actions. Primary and secondary groups are groups to which members belong. Both are\n52 called membership groups. In contrast, reference groups are those to which you may or may not belong\nbut use as a standard for evaluating your values, attitudes, and behaviors. Reference groups are those\nwith which we compare ourselves. They are generalized versions of role models. They are not “groups”\nin the sense that the individual interacts within (or in) them. Do you pattern your behavior on that of\nsports stars, musicians, military officers, or business executives? If so, those models are reference groups\nfor you.\nAny group can become a reference group if we use them to judge something about ourselves.\nConsidering what best friends will think about your new boyfriend or girlfriend or how to dress to fit in\nwith your new colleagues on your first day of work are both ways of using reference groups.\nWe can also have negative reference groups that we do not want to be like. Dressing in hip-hop, punk, or\ngoth styles sets children apart from their parents and a conservative establishment. Reference groups do\nnot even have to be real. Girls and women who judge their bodies against the apparently flawless, thin,\nair-brushed models shown on the cover of women’s magazines or advertisements are measuring\nthemselves against a fictional, and unattainable, reference group. Children who compare their parents to\nparents on television sitcoms are making a similar fictional reference-group comparison.\n7.3 Formal Organizations and Bureaucracies\nGroups, as we have seen, are capable of greatly influencing individuals. The study of groups and their\neffects on the individual represent an example of micro-level analysis. In contrast, the study of formal\norganizations and bureaucracies, a subject to which we now turn, represents an example of macro-level\nanalysis. The focus on groups drew our attention to the relatively small and less complex, whereas the\nfocus on organizations draws our attention to the relatively large and structurally more complex.\nMany of the social collectivities discussed earlier in this chapter take the form of informal\norganizations, because they do not involve formalized or rigorous rules, roles, and responsibilities.\nThey may occur spontaneously and involve personal relationships. They are not especiaclly designed for\nefficiency, but they work well in informal settings. This informal organizational structure, however, does\nnot work well in many areas of our lives. Governmental or corporate organizations require a different\nform. These entities are formal organizations.\nFormal organizations represent large, secondary social collectivities that are highly organized and\nregulated for purposes of efficiency by structured procedures. They are organized to accomplish a\ncomplex task or tasks and to achieve goals efficiently. Many of us belong to various formal\norganizations: work organizations, schools, and political parties, to name a few. Organizations are\nformed to accomplish particular tasks and are characterized by their relatively large size, compared with\na small group such as a family or a friendship circle. Often organizations consist of an array of other\norganizations. The federal government is a huge organization comprising numerous other organizations,\nmost of which are also vast. Each organization within the federal government is also designed to\n53 accomplish specific tasks, be it collecting your taxes, educating the nation’s children, or regulating the\nnation’s transportation system and national parks.\n7.3.1 Bureaucracy\nAs formal organizations develop, many become a bureaucracy, which, according to Randall Collins, is\norganizational control achieved by explicit rules and regulations and by specifying responsibilities for\naction in written records. Max Weber was the first sociologist to examine bureaucracies (1946). He\nnoted that modern Western society has necessitated a certain type of formal organization: bureaucracy.\nHis interests included the structure and operation of large-scale enterprises such as governments,\nreligions, and economies. Weber believed that bureaucracy is the most efficient form of organization\npossible. He analyzed the classic characteristics of the bureaucracy. These characteristics represent what\nhe called the ideal type bureaucracy—a model rarely seen in reality but that defines the principal\ncharacteristics of a social form. The characteristics of bureaucracies described as an ideal type are:\n Hierarchy of authority: In bureaucracies, positions are arranged in a hierarchy so that each is under the\nsupervision of a higher position. Such hierarchies are often represented in an organization chart, a\ndiagram in the shape of a pyramid that shows the relative rank of each position plus the lines of authority\nbetween each. These lines of authority are often called the “chain of command,” and they show not only\nwho has authority, but also who is responsible to whom and how many positions are responsible to a\ngiven position.\n Formal rules and regulations: Written rules and regulations govern administration and conduct. These\nrules and regulations ensure consistency, standardization, and that people within the bureaucracy do not\nmake up rules as they go along.\n Written documentation: This documentation (the “files”) encompasses the policies that are to be\nfollowed in the organization.\n High degree of division of labor and specialization: The notion of the specialist embodies this\ncriterion. Bureaucracies ideally employ specialists in the various positions and occupations, and these\nspecialists are responsible for a specific set of duties. Sociologist Charles Perrow notes that many\nmodern bureaucracies have hierarchical authority structures and an elaborate division of labor.\n Technical knowledge: Members of a bureaucracy should meet all the required qualifications to\ncompetently fulfill the duties of their position. By fitting skill sets to positions, rather than designing\npositions to fit the skills of individual workers, bureaucracies create a situation in which members who\nleave a position can be rceplaced by someone with the same qualifications and the organization can\ncontinue to operate.\n Impersonal relationships/Impersonality: Social interaction in the (ideal) bureaucracy is supposed to\nbe guided by instrumental criteria, such as the organization’s rules, rather than by expressive needs, such\n54 as personal attractions or likes and dislikes. The ideal is that the objective application of rules will\nminimize matters such as personal favoritism—giving someone a promotion simply because you like\nhim or her or firing someone because you do not like him or her. Of course, as we will see, sociologists\nhave pointed out that bureaucracy has “another face”—the informal social interaction that keeps the\nbureaucracy working and often involves interpersonal friendships and social ties, typically among people\ntaken for granted in these organizations, such as the support staff.\n Career ladders: Candidates for the various positions in the bureaucracy are supposed to be selected on\nthe basis of specific criteria, such as education, experience, and standardized examinations. The idea is\nthat advancement through the organization becomes a career for the individual. Some organizations,\nsuch as some universities and some law firms, have a policy of tenure—a guarantee of continued\nemployment until one’s retirement from the organization.\n Salaried positions: Compensation for work performed is assigned on the basis of the position. It is not\ndetermined by personal factors (for example, how physically cattractive a worker is or how much the\nsupervisor enjoys his or her jokes).\n Separation of “official” and “private” income and duties: The “office” is separate from the sphere of\nprivate life. Official monies and property of the organization are not intermingled with members’ private\nfunds or interests.\n Efficiency: Bureaucracies are designed to coordinate the activities of many people in pursuit of\norganizational goals. Ideally, all activities have been designed to maximize this efficiency. The whole\nsystem is intended to keep social–emotional relations and interactions at a minimum and instrumental\ninteraction at a maximum.\n7.3.1. 1 Bureaucracy’s Other Face\nAll the characteristics of Weber’s “ideal type” are general defining characteristics. Rarely do actual\nbureaucracies meet this exact description. A bureaucracy has, in addition to the ideal characteristics of\nstructure, an informal structure. This includes social interactions, even network connections, in\nbureaucratic settings that ignore, change, or otherwise bypass the formal structure and rules of the\norganization. This informal structure often develops among those who are taken for granted in\norganizations, such as secretaries and administrative assistants—who are most often women. Sociologist\nCharles Page (1946) coined the phrase bureaucracy’s other face to describe this condition.\nThis other face is informal culture. It has evolved over time as a reaction to the formality and\nimpersonality of the bureaucracy. Thus, administrative assistants and secretaries will sometimes “bend\nthe rules a bit” when asked to do something more quickly than usual for ac boss they like and bend the\nrules in another direction for a boss they do not like by slowing down or otherwise sabotaging the boss’s\nwork. Researchers have noted, for example, that secretaries and assistants have more authority than their\n55 job titles and salaries suggest. As a way around the cumbersome formal communication channels within\nthe organization, the informal network, or “grapevine,” often works better, faster, and sometimes even\nmore accurately than the formal channels. As with any culture, the informal culture in the bureaucracy\nhas its own norms or rules. One is not supposed to “stab friends in the back,” such as by “ratting on”\nthem to a boss or spreading a rumor about them that is intended to get them fired. Yet, just as with any\nnorms, there is deviation from the norms, and “back-stabbing” and “ratting” does happen.\nBureaucracy’s other face can also be seen in the workplace subcultures that develop, even in the largest\nbureaucracies. Some sociologists interpret the subcultures that develop within bureaucracies as people’s\nattempts to humanize an otherwise impersonal organization. Keeping photographs of family and loved\nones in the office, placing personal decorations on one’s desk (if you are allowed), and organizing office\nparties are some ways people resist the impersonal culture of bureaucracies.\nChapter Eight: Social Stratification and Social Mobility\n8.1 Introduction\nSocial stratification is one of the most basic concepts in sociology. Social stratification refers to the\nunequal distribution around the world of the three Ps: property, power, and prestige. The term represents\na system of structured social inequality; or structured hierarchy/social strata that exist in a society.\n(Social inequality is the degree of disparity of the distribution of valued resources within society.)This\nstratification forms the basis of the divisions of society and categorizations of people.\nSociologists use a geological metaphor to explain how groups of people are divided into social rankings\nsimilar to the layers, or strata, in the Earth’s surface; and social stratification is a term that they use to\ndescribe this division of people into layers.\n8.2 Types of Stratification Systems\nStratification systems can be broadly categorized into three types: estate systems, caste systems, and\nclass systems.\n1. Estate System\nIn an estate system of stratification, the ownership of property and the exercise of power is monopolized\nby an elite who have total control over societal resources. Historically, such societies were feudal\nsystems where classes were differentiated into three basic groups—the nobles, the priesthood, and the\ncommoners. Commoners included peasants (usually the largest class group), small merchants, artisans,\ndomestic workers, and traders. The nobles controlled the land and the resources used to cultivate the\nland, as well as all the resources resulting from peasant labor.\nEstate systems of stratification are most common in agricultural societies. Although such societies have\nbeen largely supplanted by industrialization, there are still examples of societies that have a small but\npowerful landholding class ruling over a population that works mainly in agricultural production. Unlike\nthe feudal societies of the European Middle Ages, however, contemporary estate systems of stratification\n56 display the influence of international capitalism. The “noble class” comprises not knights who conquered\nlands in war, but international capitalists or local elites who control the labor of a vast and impoverished\ngroup of people, such as in some South American societies where landholding elites maintain a\ndictatorship over peasants who labor in agricultural fields.\n2. Caste System\nIn a caste system, one’s place in the stratification system is an ascribed status, meaning it is a quality\ngiven to an individual by circumstances of birth. The hierarchy of classes is rigid in caste systems and is\noften preserved through formal law and cultural practices that prevent free association and movement\nbetween classes. The system of apartheid in South Africa was a stark example of a caste system. Under\napartheid, the travel, employment, associations, and place of residence of Black South Africans were\nseverely restricted. Segregation was enforced using a pass system in which Black South Africans could\nnot be in White areas unless for purposes of employment; those found without passes were arrested,\noften sent to prison without ever seeing their families again. Interracial marriage was illegal. Black\nSouth Africans were prohibited from voting; the system was one of total social control where anyone\nwho protested was imprisoned. The apartheid system was overthrown in 1994 when Nelson Mandela,\nheld prisoner for 27 years of his life, was elected president of the new nation of South Africa; a new\nnational constitution guaranteeing equal rights to all was ratified in 1996.\n3. Class System\nIn class systems, stratification exists, but a person’s placement in the class system can change according\nto personal achievements; that is, class depends to some degree on achieved status, defined as status that\nis earned by the acquisition of resources and power, regardless of one’s origins. Class systems are more\nopen than caste systems because position does not depend strictly on birth, and classes are less rigidly\ndefined than castes because the divisions are blurred by those who move between one class and the next.\nDespite the potential for movement from one class to another, in the class system found in the United\nStates, class placement still depends heavily on one’s social background. Although ascription (the\ndesignation of ascribed status according to birth) is not the basis for social stratification in the United\nStates, the class a person is born into has major consequences for that person’s life. Patterns of\ninheritance; access to exclusive educational resources; the financial, political, and social influence of\none’s family; and similar factors all shape one’s likelihood of achievement. Although there is no formal\nobstacle to movement through the class system, individual achievement is very much shaped by an\nindividual’s class of origin.\n8.3 Types of Social classes of People\nSocial class (or class) is the social structural position groups hold relative to the economic, social,\npolitical, and cultural resources of society. It refers to a group of people with similar levels of wealth,\n57 influence, and status. Class is not just an attribute of individuals; it is a feature of society. Sociologists\ntypically use three methods to determine social class:\n The objective method measures and analyzes “hard” facts.\n The subjective method asks people what they think of themselves.\n The reputational method asks what people think of others.\n1. The Lower Class\nThe lower class is typified by poverty, homelessness, and unemployment. People of this class, few of\nwhom have finished high school, suffer from lack of medical care, adequate housing and food, decent\nclothing, safety, and vocational training. The media often stigmatize the lower class as “the underclass,”\ninaccurately characterizing poor people as welfare mothers who abuse the system by having more and\nmore babies, welfare fathers who are able to work but do not, drug abusers, criminals, and societal\n“trash.”\n2. The Working Class\nThe working class are those minimally educated people who engage in “manual labor” with little or no\nprestige. Unskilled workers in the class—dishwashers, cashiers, maids, and waitresses—usually are\nunderpaid and have no opportunity for career advancement. They are often called the working poor.\nSkilled workers in this class—carpenters, plumbers, and electricians—are often called blue collar\nworkers. They may make more money than workers in the middle class—secretaries, teachers, and\ncomputer technicians; however, their jobs are usually more physically taxing, and in some cases quite\ndangerous.\n3. The Middle Class\nThe middle class are the “sandwich” class. These white collar workers have more money than those\nbelow them on the “social ladder,” but less than those above them. They divide into two levels according\nto wealth, education, and prestige. The lower middle class is often made up of less educated people with\nlower incomes, such as managers, small business owners, teachers, and secretaries. The upper middle\nclass is often made up of highly educated business and professional people with high incomes, such as\ndoctors, lawyers, stockbrokers, and CEOs.\n4. The Upper Class\nComprising only 1 to 3 percent of the United States population, the upper class holds more than 25\npercent of the nation’s wealth. This class divides into two groups: lower-upper and upper-upper. The\nlower-upper class includes those with “new money,” or money made from investments, business\nventures, and so forth. The upper-upper class includes those aristocratic and “high-society” families\nwith “old money” who have been rich for generations. These extremely wealthy people live off the\nincome from their inherited riches. The upper-upper class is more prestigious than the lower-upper class.\n58 Wherever their money comes from, both segments of the upper class are exceptionally rich. Both groups\nhave more money than they could possibly spend, which leaves them with much leisure time for\ncultivating a variety of interests. They live in exclusive neighborhoods, gather at expensive social clubs,\nand send their children to the finest schools. As might be expected, they also exercise a great deal of\ninfluence and power both nationally and globally.\n8. 4 Social Mobility\nSociologists interested in stratification also focus on social mobility, movement within the stratification\nsystem from one position, or strata, to another. All of us begin life with a social heritage that includes\ncall membership. In some societies (open society) moving up in the social ladder or hierarchy is\npossible. An individual can move up and down the class structure, and shift or alter his class level or\nstatus position over time through his individual efforts. Such movement in the class structure of society\nis referred to as social mobility.\nIn a closed society with a caste system, however, mobility can be difficult or impossible. Social position\nin a caste system is decided by assignment rather than attainment. This means people are either born into\nor marry within their family’s caste; changing caste systems is very rare. An example of the rigid\nsegregation of caste systems occurs today in India, where people born into the lowest caste (the\n“untouchables”) and can never become members of a higher caste. South Africa also has a caste system.\n8.4.1 Patterns of social mobility\nSeveral patterns of social mobility are possible:\n Horizontal mobility involves moving within the same status category. Horizontal mobility does not\ninvolve status change. An example of this is a nurse who leaves one hospital to take a position as a nurse\nat another hospital.\n Vertical mobility, in contrast, involves moving from one social level to another. Upward (ascending)\nmobility takes place when status position rises up in the social structure. E.g. A promotion in rank in the\nArmy. Downward (descending) mobility takes place when status position goes down in the social\nhierarchy E.g. Demotion in rank.\n Intragenerational mobility, also termed career mobility, refers to a change in an individual’s social\nstanding, especially in the workforce, such as occurs when an individual works his way up the corporate\nladder.\n Intergenerational mobility refers to a change in social standing across generations, such as occurs\nwhen a person from a lower-class family graduates from medical school.\n8.4.2 Structural mobility and individual mobility\nMajor upheavals and changes in society can enhance large numbers of people’s opportunities to move up\nthe social ladder at the same time. This form of mobility is termed structural mobility. Industrialization,\n59 increases in education, and postindustrial computerization have allowed large groups of Americans since\n1900 to improve their social status and find higher-level jobs than did their parents. Nevertheless, not\neveryone moves into higher-status positions. Individual characteristics—such as race, ethnicity, gender,\nreligion, level of education, occupation, place of residence, health, and so on—determine individual\nmobility. In the United States, being a member of a racial minority, female, or a disabled person have\ntraditionally limited the opportunities for upward mobility.\nChapter Nine: Understanding Deviance and Crime\n9.1 Definition of deviance\nThe term deviance has different definitions as it is seen from the point of view of different scholars of\ndifferent fields of studies. It is obvious that a biologist’s or a psychologist’s definition of deviance could\nnot be one and the same with that of a sociologist’s definition.\nIn the broadest sense, deviance refers to behavior that violates the folkways, mores and laws of a\nparticular group. In the sociological definition, deviance can be defined as any behavior, belief, or\ncondition that violates significant social norms in the society or group within which it occurs (Kendall,\n2003). Thus, deviance encompasses a wide range of abnormal or anti-social behavior. Criminal\nbehaviors which are the violation of mores are the most significant type of deviant behavior. Deviance\ncannot be uniformly defined throughout the world rather it is a relative concept.\n9.2 The Relativity of Deviance\nDeviance cannot always be treated in this way since it is a relative social behavior which differs in its\nfrom one society to others, from social groups to social groups, from time to time, from social situation\nto social situation, and from one place to the other. Thus, we can see that it is not possible to isolate a\ncertain acts and find them universally condemned by all societies as deviant acts. These aspects of the\nrelativity of deviance are discussed as follows:\n1. The relevance of audience: For most of the sociologists, deviance is not absolute, universal,\nstatistical, power-based, or labeled; but it is reacted with a particular social audience. As a result,\ndeviance is always defined by some particular social audience. This, in turn, shows that it is advisable to\ntake the society, social structure, social stratification, social norms, social control and social behaviors\ninto consideration when we treat social deviance. An audience includes anyone who witnessed the act or\nwas aware of the act Audiences may be strangers on the street, a family, a jury, a group of neighbors or\nthe public in general.\n2. The relevance of time: It is obvious that society is dynamic in its nature. It changes across time.\nHence, social norms also change along with this societal change. In other words, as far as society\nchanges across time, norms and value (which are basic elements of a given culture) also change. This, in\nturn, reveals that the change in norms across time brings about the changes in the attitude towards these\nnorms. Thus, deviance varies. For example, termination of marital life (divorce) regardless of adultery\n60 was a serious deviant act at some few decades ago in our country; but, today it becomes a normal act that\ncan be ended up without any problem.\n3. Deviance varies from place to place. This means that the place where an act has been taken place\ndetermines whether the act is deviant or normal. For example, killing a person is usually a wrong act.\nBut, it will be renownable if it is taken place at the battle field. Still, it can be a serious crime if it occurs\nat someone’s home for the purpose of revenge. Another more relevant example is that fighting in\nclassroom is absolutely a deviant act; but it is non-deviant if it is happened within the boxing ring.\n4. The relevance of social groups: Social groups within a society have their own distinctive norms. For\nexample, having two or more wives is a prescribed deed in those Muslim communities of the world.\nHowever, this is a serious and intolerable behavior in those Orthodox Christians of the world. Do you\nknow the reason why? It is due to the fact that the norms and values that govern the behavior of Muslims\nare directly different from that of the Orthodox Christians.\n5. The relevance of social status: people are perceived differently according to their social\ncharacteristics. Generally, higher status individuals are less likely to be labeled deviant or to receive\nharsh treatment than are lower status individuals.\n6. The relevance of the situation: The situational context is often as important as the act itself in\ndetermining whether an act will be defined as deviant. As an example you might argue that killing\nanother human being (murder) is the ultimate deviant act. But there are many times when people are not\nlabeled as deviants or murderers just because he/she has killed someone. We ask whether the person\nkilled in self defense, in war, whether the individual is considered legally insane or incapable of knowing\nright from wrong, etc. In each case, the act was the same - a person killed another person. The situations\nleading to the killings, however, were defined in a number of different ways. The definition of a\nparticular situation, in turn, determined how people labeled the individuals involved.\n9.3 Functions and Dysfunctions of Deviance\nAccording to functionalist school, deviance is both functional and dysfunctional to the social system\nwithin which it occurs. Let us begin or discussion with the dysfunction it brings to the society at large.\n9.3.1 Dysfunctions of Deviance\nDysfunctions of deviance, as to sociologists, are the negative or disruptive consequences of deviance.\nObviously, several societies can tolerate a good deal of deviance without serious results. However,\nresistant and intensive deviance can impair and even seriously belittle organized social life. As all we\nknow, organized social life is a product of the coordinated actions of many different peoples. “Should\nsome people fail to perform their actions at the proper time in accordance with accepted expectations,\ninstitutional life may be threatened.” (Vander, 1990: 2005). The writer further argued that if a parent\ndeserts a family, it commonly complicates the task of child care and child rearing. If in the midst of the\n61 battle a squad of soldiers fails to obey and run away, the entire army with no doubt becomes\noverwhelmed and defeated.\nSecond important dysfunction is that deviance undermines our willingness to discharge our\nresponsibilities and obligations. It reduces our effort to play our roles and to contribute to the larger\nsocial enterprises. If we realize that some people get rewards (even disproportionate rewards) without\nplaying by the rule, we develop resentment and bitterness. Our morale, self-confidence and loyalty suffer\n((Vander, 1990). Suppose that you have known that a number of students from your class got a grade in\nthe course sociology of deviance illegally through either by cheating, favour made for a course\ninstructor, or other forms of evil deeds. What would your reaction be? Undoubtedly, your motivation to\nstruggle with the materials (books) and to study long hours would very likely be undermined and totally\ndiscouraged. Similarly, in a society with a higher degree of corruption, like Ethiopia, the situation will\nreally discourage people who are engaging in acceptable ways of getting money; and most portion of\nmembers of the society become willing to internalize this illegal mechanism of getting money which\nlater on can be seen a natural and common ways of being affluent.\nDeviance also reduces our trust to other members of our social lives. We know that our social lives\nindicate that we trust one another. No trust to others in the social organization means there is no\norganized social life. Thus, we must have confidence that other will play by the rules and regulations\nconstructed around our social lives in committing ourselves to collective enterprise, we allocate some\nresources, forgo some alternatives, and make some investment in the future. We do so because we\nassume that other people will do the same, but, would other not reciprocate our trust, we felt that our\nown efforts are pointless, wasted, and foolish. Subsequently, we remain less motivated and willing to\nplay by the rules of our social lives.\n9.3.2 The Functions of Deviance\nWe commonly believe that deviance is a result of moral erosion and that the consequences of deviant\nacts are very negative. However, sociologists recognize that deviance is not always harmful to the group\nor to society.\nOne of the founding fathers of sociology, Emile Durkheim argued that deviance is in fact normal and\nuniversal in human societies. Generally, Durkheim has identified the following four functions of\ndeviance:\na. Deviance affirms cultural values and norms. Culture, as to Macionis (1997), involves moral choices:\npeople must prefer some attitudes and behaviours to others, for the write, conceptions of what is morally\nright exists only in opposition to notions of what is morally wrong “just as there can be no righteousness\nwithout evil; there can be no justice without crime.” (ibid: 211). In short deviance is inseparable from\nthe process of generating and sustaining morality in a society or social group.\n62 b. Responding to the deviance clarifies moral boundaries by labeling or publicly evaluating people as\ndeviants, a society or social group sets the boundary between wrong and right. For example, by imposing\ndisciplinary procedures on those who commit plagiarism, a university marks a line between academic\nhonesty and cheating.\nc. Responding to deviance promotes social unity. People typically react to serious deviance with\ncollective outrage. In doing so, they reaffirm the normal ties that bind them (Macionis, 1997). A shared\nenemy arouses common sentiments and elements of feeling of integration and solidarity. Thus, when\ndeviant behaviour is seen as a threat to group solidarity and people unite in opposition to that behaviour,\ntheir loyalties to society are reinforced. For example, currently, several houses in Gondar Town are\nbeing burgled. As a result, dwellers of several kebeles discussed the problem and established a jointly\npaid village guard so as to keep those burglars at a distant. This example clearly shows that people of\nsome villages become united and remained loyal one another in struggles against burglers.\nd. Deviance encourages social change. Russ Long (2008) explains that deviance is an important\nelement of social change since it offers alternative definitions to what is right. Sometimes the\nalternatives become acceptable and it may even become the dominant view. As it is clearly stated in\nMacionis (1997), Durkheim claimed that today’s deviance might well become tomorrow’s morality.\nTherefore, deviance brings about social change either through revolutionary actions against or\namendment on the existing more rules of a society. Deviance is, thus, a catalyst for a social change. A\nrepeated deviance indicating that the existing social system is not functioning properly. This, in turn,\nforces social change to be realized.\ne. Deviance also provides job opportunities. It is due to the persistence of deviant behaviours within a\ngiven society that forced people to establish several social controlling institutions and organizations, no\nguard will stand by the gate of a bank if there are no deviants in a society.\n9.4 Deviant Statuses\nDeviant status, as a social position, can be two types: achieved and ascribed deviant statuses. People cast\ninto the deviant realm for their behaviors have an achieved status: they have gained the deviant label\nthrough something they have done. People regarded as deviant due to the fact that their conditions often\nhave an ascribed deviant status. It is involuntarily acquired from birth. This category, according to Adler,\net. al., (2000), would include having deviant social, economic, cultural and political statuses, such as\nbeing a deviant racial status, a congenital physical handicapped, or a height deviants (too tall or too\nshort).\nPeople with ascribed deviant status have nothing to become deviant and nothing they can do to repair the\ndeviant status, whereas people with achieved deviant status have done something that exposed them to\nbe seen a deviant.\n63 9.5 Deviance and Crime\nDeviance is generally referred to as the violation of social norms whereas crime is the infraction from\nwritten rules and regulations, especially criminal law of a give society or social group. In most cases,\ncrime involves victims. Criminal acts such as murder, arson, robbery, burglary, and larceny are totally\nunacceptable and condemnable simply because they involve victims. We label these acts crime, meaning\nthat their violation of the public order is so severe that they must be handled punitively and coercively by\nsocial institutions, like the police, the courts, and prisons (Adler, et. al., 2002). Most of these and other\nunmentioned criminal acts are considered deviant behaviours. However, there are many cases in which\ncriminal acts cannot be taken as deviant behaviours due to several reasons. Thus, the argument ‘crime is\nnot always a subset of deviance, is sound. For example, white-collar crimes are commonly regarded as\nmerely aggressive business practices.\nIn the analysis of the relationship between deviance and crime, we can have the following three possible\ndimensions: First, the overlap between deviance and crime is extensive with those crimes of violence,\ncrimes of harm, and theft of personal properties. These behaviours, according to Kelly, et. al., (2002), are\nboth illegal and deviant. Secondly, in the actual sense, much deviance is considered non-criminals. Some\nof the examples of such category include obesity, stuttering, physical handicaps, interracial marriage,\nunwed pregnancy, and so on. Finally, we can also have another dimension, different from the above two,\nof the relationship between crime and deviance. Here, we can see that there are some criminal\nbehaviours which do not violate norms and values of a society, for example, white-collar crimes –\ncrimes which need a higher status to be committed – and forms of civil disobedience, where people\nbreak laws to protest against them. Besides of these dimensions, there is still another area of difference\nbetween deviance and crime. As we have tried to mention earlier, deviance includes those deviations\nfrom the normal to the positive direction; but crime never include those positive deviant behaviour.\nTherefore, it is possible to conclude that crime is not a subset of deviance. They can be overlapping\ncategories only in a single independent dimension (see the first dimension above).\n9.6 Sociological Theories of Deviance\nMany theories have been developed to explain the cause of deviance. They have tried to explain the\nreason for the prevalence of deviations from the normal way of behaving in given societies. These\ntheories are different from one another as they are very much influenced by the ideological backgrounds\nof their proponents. For example, an explanation forwarded by a religious man is not expected to be the\nsame as those explanations given by social thinkers. The whole theories of deviance can, generally, be\nclassified into categories such as demonological theories, biological, psychological and sociological\ntheories.\nSociologists have made considerable efforts in both theory and research regarding deviance. All\nsociological theories of crime and deviance have in common which is an emphasis on social forces and\n64 conditions, as opposed to psychological or biological factors. They see the deviation from the normal\nbehavior as being caused by the existing social structure. There are many social conditions which\ninfluence individual member’s behavior. Among others, the most three important groups of sociological\ntheories regarding deviant behavior are reviewed as follows:\n9.6.1 Anomie theories of deviance\nBoth Emile Durkheim and Robert K. Merton are the two most important structural-functional theorists\nwho are related with the analysis of anomie. It is, however, worthwhile keeping in mind that Durkheim’s\nanomie is different from that of Merton’s. For Durkheim, anomie is the state of normlessness, a\ncondition occurred within a given society when norms are absent or nonfunctional. On the other hand,\nMerton defined anomie as a social condition of an individual which occurred due the mismatch between\nsocietal goals and socially approved means by which goals are attained.\nAs to Durkheim, after social upheavals such as war, traditional norms of behavior no longer work, thus\ncausing societal normlessness. Several deviant acts like suicide, crime, and other crises exist in societies\nthat do not develop effective norms. Therefore, anomie, for Durkheim, refers to a broad breakdown of\nnorms in society, or a disconnecting of an individual from the norms of his society’s contemporary\nvalues. According to Durkheim, deviance or crime is inevitable and normal aspect of social life. It is an\nintegral part of all healthy societies. Thus, it is impossible to have a society totally devoid of deviance\nand/or crime (Williams, 2004). Thus, deviance is inevitable due to the fact that not every member of\nsociety can be equally committed to the collective sentiments, the shared values and moral beliefs of\nsociety.\nRobert Merton’s Strain theory, on the other hand, focuses on the idea that people feel strain when they\nare exposed to cultural goals that they are unable to obtain because they do not have access to culturally\napproved ways of achieving those goals. Merton posited that the greater society encourages its members\nto use acceptable means of achieving acceptable goals. In the United States, acceptable means include\nhard work, prudent saving, and higher education. Acceptable goals, on the other hand, comprise comfort,\nleisure time, social status, and wealth (Martin, 2005). However, acceptable means are not evenly\ndistributed among members of the society though societal goals do. In other words, not all members of a\nsociety have equal availability of resources to achieve society’s recognized goals, thus creating strain for\nthose with less empowered members. “Strain is manifested at the desire to achieve these [socially\napproved] goals; and one’s inability to acquire the legitimate means to achieve them.” (ibid: 83). This\nimplies that those without resources may become criminals or delinquents simply because of using\nillegal means to achieve comfort, leisure, prestige, and wealth. Here, the idea of Merton’s individual\nadaptation comes. Individuals will respond to anomic condition in different ways. Merton outlined four\ntypes of deviant responses or adaptations to this condition of anomie.\n65 a. Innovation: The innovator accepts the socially approved goal, wants money and success but uses deviant\nmeans such as stealing or cheating to achieve it. For example, if too much emphasis is put on diplomas\nand grades without a corresponding emphasis on achieving grades honestly, college students who are not\ndoing well might cheat to get better grades.\nb. Ritualism: This response occurs when an individual has lost sight of his or her goals altogether and\nbecomes obsessed with doing things the right way. Imagine a college football coach who continually\nloses every game but does not seem disturbed as long as the tem follows the rules of the game.\nc. Retreatism: Occurs when individuals simply give up any hope of achieving the goals set out by society.\nRetreatists feel that they cannot make it. Many students who drop out of school have given up of\nreaching graduation. They have retreated. People can retreat into alcoholism and drug addiction.\nPerhaps, the ultimate type of retreatism is suicide.\nd. Rebellion: This deviant adaptation occurs when individuals want to change the structure of society by\nchallenging the system. Rebels want to institute new social goals and means for achieving them. For\nexample, revolutionaries often violate laws in an attempt to institute a different political system.\n9.6.2 Differential Association and Cultural Transmission Theories\nThese two similar theories emphasize the role of the immediate environment and social learning\nexperienced by a deviant person. Criminologist Edwin Sutherland was responsible for developing the\ntheory of differential association. It focused on the process through which people learn norms, values,\nmotivations, priorities, techniques and rationalization, which encourage deviance. People learn these\nthrough their interactions and associations with others.\nIf an individual has been exposed to deviant orientations with greater intensity and frequency, and for a\nlonger period of time than he or she has been exposed to conformist orientation, then the individual is\nlikely to engage in deviance.\nThe implication of differential association theory is that the family, environment, neighborhood peer\ngroup, school and other socializing agents can teach a child deviant behavior just prostitutes tend to enter\ntheir profession because they have friend, a group or a pimp who encourages them to sell themselves. If\none grows up admiring and identifying with those who have succeeded through crime or deviance, if one\nhas close friends and associated who endorse deviant, behavior, if one interacts more frequently and\nsatisfactorily with deviant individuals, then one is likely to learn various deviant adaptations including\nprostitution, drug use and embezzlement. In other words, deviance like any other behavior is transmitted\nthrough the culture and environment.\n9.6.3 Labeling Theory\nLabeling theory does not attempt to explain the origins of deviant behavior. It only assumes that every\none commits deviant acts at some point in life. It focuses on the perpetuation of deviance as a result of\nbeing singled out and given the stigma of a deviant status. So, this theory emphasizes on the power of\n66 society to label people as deviants. Here, Social control agencies play a major part in assigning deviant\nlabels. Howard Becker, a labeling theorist, argued that an act by itself is not a deviant rather a societal\nreaction matters most. A self-fulfiling prophecy can inflict deviant and criminal behviours. Edwin\nLemert also postulates primary and secondary deviation to show how labeling of individual contributes\nto deviance amplification.\nReferences\n Giddens, Anthony. (2006). Sociology. 5th ed. Wiley India Pvt. New Delhi.\n Macions, John J. (1995). Sociology. (5th Ed). New Jersey: Ptencile Hall.\n Ritzer, George. (2005). Encyclopaedia of Social Theory. Volume II. Sage Publications,\nInc.Thousand Oaks, California, U.S.A.\n Ritzer, George. (2005). Encyclopaedia of Social Theory. Volume II. Sage Publications,\nInc.Thousand Oaks, California, U.S.A.\n Ritzer, George. (2008). Sociological Theory (8th ed.). New York: McGraw-Hill.\n Schaefer, Richard. (2010). Sociology. (12th ed). mcGram-Hill Companies, Inc. New York.\n Shaefer, Richard. (2003). Sociology. (8th Ed). Boston: McGraw Hill.\n Tk Indrani (2003). Textbook of Sociology for Nurses. Jaypee: New Delhi.\n Zerihun Doda (2004). Introduction Sociology, Lecture Note: DU, Ethiopia.\n67"
}