{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nAesthetics and Value\nArt and the Aesthetic Experience\nBeauty is something we perceive and respond to. It may be a response of awe and amazement, wonder and joy, or something else. It might\nresemble a “peak experience” or an epiphany. It might be watching a sunset or taking in the view from a mountaintop—the list goes on. Here we\nare referring to a kind of experience, an aesthetic response that is a response to the thing’s representational qualities, whether it is man-made or\nnatural (Silverman). The sub\u0000eld of philosophy called aesthetics is devoted to the study and theory of this experience of the beautiful; in the \u0000eld\nof psychology, aesthetics is studied in relation to the physiology and psychology of perception.\nAesthetic analysis is a careful investigation of the qualities which belong to objects and events that evoke an aesthetic response. The aesthetic\nresponse is the thoughts and feelings initiated because of the character of these qualities and the particular ways they are organized and\nexperienced perceptually (Silverman).\nThe aesthetic experience that we get from the world at large is di\u0000erent than the art-based aesthetic experience. It is important to recognize\nthat we are not saying that the natural wonder experience is bad or lesser than the art world experience; we are saying it is di\u0000erent. What is\ndi\u0000erent is the constructed nature of the art experience. The art experience is a type of aesthetic experience that also includes aspects,\ncontent, and context of our humanness. When something is made by a human– we know that there is some level of commonality and/or\ncommunal experience.\nWhy aesthetics is only the beginning in analyzing an artwork\nWe are also aware that beyond sensory and formal properties, all artwork is informed by its speci\u0000c time and place or the speci\u0000c historical and\ncultural milieu it was created in (Silverman). For this reason we analyze artwork through not only aesthetics, but also, historical and cultural\ncontexts.\nHow we engage in aesthetic analysis\nOften the feelings or thoughts evoked as a result of contemplating an artwork are initially based primarily upon what is actually seen in the work.\nThe \u0000rst aspects of the artwork we respond to are its sensory properties, its formal properties, and its technical properties (Silverman). Color is\nan example of a sensory property. Color is considered a kind of form and how form is arranged (e.g., color) is a formal property. What medium\n(e.g., painting, animation, etc.) the artwork is made of is an example of a technical property. These will be discussed further in another module.\nAs Dr. Silverman, of California State University explains, the sequence of questions in an aesthetic analysis could be: what do we actually see?\nHow is what is seen organized? And, what emotions and ideas are evoked as a result of what has been observed?\nHow We Assign Value to Art\nThe word art is often used to apply judgments of value, as in expressions like \"that meal was a work of art\" (implying that the cook is an artist) or\n\"the art of deception\" (the advanced, praiseworthy skill of deceiving). It is this use of the word as a measure of high value that gives the term its\n\u0000avor of subjectivity.\nDoes It Have to Be Visually Pleasing or Not?\nMaking judgments of value requires a basis for criticism. At the simplest level, deciding whether an object or experience is considered art is a\nmatter of \u0000nding it to be either attractive or repulsive. Though perception is always colored by experience, and is necessarily subjective, it is\ncommonly understood that what is not somehow visually pleasing cannot be art. However, \"good\" art is not always or even regularly visually\npleasing to a majority of viewers. In other words, an artist's prime motivation need not be the pursuit of a pleasing arrangement of form. Also, art\noften depicts terrible images made for social, moral, or thought-provoking reasons.\nFrancisco de Goya, El Tres de Mayo, 1808 (The Third of May, 1808). Image is in the public domain.\nFor example, the painting pictured above, by Francisco Goya, depicts the Spanish shootings on the third of May, 1808. It is a graphic depiction of\na \u0000ring squad executing several pleading civilians. Yet at the same time, the horri\u0000c imagery demonstrates Goya's keen artistic ability in\ncomposition and execution, and it produces \u0000tting social and political outrage. Thus, the debate continues as to what mode of aesthetic\nsatisfaction, if any, is required to de\u0000ne \"art.\" The revision of what is popularly conceived of as being visually pleasing allows for a re-invigoration\nof and a new appreciation for the standards of art itself.\nArt is often intended to appeal to and connect with human emotion. It can arouse aesthetic or moral feelings, and can be understood as a way of\ncommunicating these feelings. Art may be considered an exploration of the human condition or what it is to be human.\nFactors Involved in the Judgment of Art\nSeeing a rainbow often inspires an emotional reaction like delight or joy. Visceral responses such as disgust show that sensory detection is\nre\u0000exively connected to facial expressions and to behaviors like the gag re\u0000ex. Yet disgust can often be a learned or cultural response, too; as\nDarwin pointed out, seeing a smear of soup in a man's beard is disgusting even though neither soup nor beards are themselves disgusting.\nArtistic judgments may be linked to emotions or, like emotions, partially embodied in our physical reactions. Seeing a sublime view of a\nlandscape may give us a reaction of awe, which might manifest physically as increased heart rate or widened eyes. These unconscious\nreactions may partly control, or at least reinforce, our judgment in the \u0000rst place that the landscape is sublime.\nLikewise, artistic judgments may be culturally conditioned to some extent. Victorians in Britain often saw African sculpture as ugly, but just a few\ndecades later, those same audiences saw those sculptures as being beautiful. Evaluations of beauty may well be linked to desirability, perhaps\neven to sexual desirability. Thus, judgments of art can become linked to judgments of economic, political, or moral value. In a contemporary\ncontext, one might judge a Lamborghini to be beautiful partly because it is desirable as a status symbol, or we might judge it to be repulsive\npartly because it signi\u0000es for us over-consumption and o\u0000ends our political or moral values.\nJudging the value of an artwork is often partly intellectual and interpretative. It is what a thing means or symbolizes for us that is often what we\nare judging. Assigning value to artwork is often a complex negotiation of our senses, emotions, intellectual opinions, will, desires, culture,\npreferences, values, subconscious behavior, conscious decision, training, instinct, sociological institutions, and other factors. Watch the video\nbelow to hear discussion on these factors in value judgement.\nWatch this video on the artwork titled The Physical Impossibility of Death in the Mind of Someone Living by Damien Hirst. Consider the\ncomplexity of the interpretative experience of art and how value is assigned to an artwork.\nWorks Cited\nSilverman, Ronald. Learning About Art: A Multicultural Approach. California State University, 2001. Web. 24, June 2008.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}