{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 3: Context and Perspective\nArt in the Twenty-First Century\nIntroduction\nTwenty-\u0000rst-century art is a burgeoning \u0000eld of practice, research, and publication, making it an incredibly dynamic \u0000eld of study. Many\nimportant topics have been resonating in the new century and inspiring new thinking and scholarly debate, such as the surge of bio art in\nresponse to scienti\u0000c research in the life sciences, and the critical theory known as relational aesthetics that developed in response to an\nincrease in art that invites viewers’ participation and interaction. Other topics that were much-discussed in the late twentieth century remain vital\nfor the analysis of twenty-\u0000rst-century art and visual culture, including semiotics, post-modernism, and feminism.\nArt of the twenty-\u0000rst century emerges from a vast variety of materials and means. These include the latest electronic technologies, such as\ndigital imaging and the Internet; familiar genres with a long history that continue to be practiced with great vigor, such as painting; and materials\nand processes once associated primarily with handicrafts, re-envisioned to express new concepts. Many artists regularly and freely mix media\nand forms, making the choices that best serve their concepts and purposes. Activities vary from spectacular projects accomplished with huge\nbudgets and extraordinary production values to modest endeavors that emphasize process, ephemeral experiences, and a do-it-yourself\napproach. The notion of in\u0000uences has also shifted with changes in communications and technology; every location around the world has artists\nwho respond to local geographies and histories as well as the sway of global visual culture.\nGlobalization\nA key feature of the art scene in the twenty-\u0000rst century (and of many sectors of twenty-\u0000rst-century life) is the impact of globalization – the\naccelerating interconnectivity of human activity and information across time and space. Aided by the internet and mass media, awareness of the\nvitality of contemporary art in localities around the globe has grown exponentially. Anyone with access to the internet can follow developments\nin Shanghai, Sydney, São Paulo, or Nairobi. Simultaneously the increased movement of artists across borders and oceans has added to the\nintermixing of in\u0000uences and artistic vocabularies. For example, Wangechi Mutu, originally from Kenya, pursued further education in South Wales\nand then in the United States. Her collaged images of women are informed by African tribal arts, 20th-century European and American collage\nartists, and the latest illustrations from fashion, pornography, and medical sources.\nThe meaning and consequences of globalization are much debated by scholars. Economically and politically, is globalization a force for growth\nand freedom in societies everywhere, or does it contribute to further exploitation of developing regions by the wealthy? Does globalization work\nin di\u0000erent ways in di\u0000erent localities?\nRegarding globalization and art, do practices in Asia, Africa, the Middle East, and elsewhere challenge the traditional assumptions and value\njudgments that are the basis of the Western canon? Are Western institutions rethinking that canon or simply adding art from other places to\ntheir rosters in a token and uncritical gesture of inclusivity? How do curated exhibitions that address themes of globalization represent artists\nfrom various parts of the world? The expanding art market and the proliferation of biennials and art fairs helped a select group of artists from\nevery continent to gain an international presence; but have the underlying structure and values of the art market changed otherwise?\nInterdisciplinary and Collaborative Art\nIn the twenty-\u0000rst century visual culture has grown as a recognized interdisciplinary \u0000eld of study as well as artistic practice. It takes a\nmultifaceted and often collaborative approach to making and understanding how images of all types communicate and participate in the\nconstruction of identity, gender, class, power relationships, and other social and political meanings and values. Medicine, science, politics,\nconsumer culture, and religion and spirituality are some of the arenas that visual culture studies examine along with art. Visual culture scholars\nanalyze \u0000lm, television, graphic novels, fashion design, and other forms of popular culture in addition to established \u0000ne art media such as\npainting, and they draw upon many methodologies and theories, including semiotics, sociology, psychoanalysis, reception theory, feminism, and\nthe concept of the gaze, to name a few.\nJust as visual culture examines images and media of all types so, too, are twenty-\u0000rst-century artists drawing inspiration, imagery, materials, and\nconcepts from diverse areas of culture, moving well beyond in\u0000uences from the history of \u0000ne art and design. The world of professional sports\nand fanatic fans has been a topic for Paul Pfei\u0000er, while the commercial television industry has informed various video installations by Christian\nJankowski.\nMost contemporary artists do not draw rigid distinctions between high art and popular culture. For instance, a number of contemporary artists\nembrace traditional techniques of \u0000ber art but use them to create unorthodox forms or address current social and political issues. Along these\nlines, Ghada Amer has used thread to embroider on canvas repeated motifs of nude women engaged in sexual acts, then partially obscured the\nembroidered images with gestural painted brushstrokes. Her themes include the expression and repression of female sexuality and eroticism in\nboth Western and Islamic societies. Another example of intermixing visual cultures is the complex array of interactions between science and\ncontemporary art, with many artists engaging with scienti\u0000c imagery and ideas in their practice. For example, Wim Delvoye’s ongoing series\ncalled Cloaca imagines humans as cyborgs, representing the human digestive system as a kind of biomechanical contraption. Finally, many\ntwenty-\u0000rst-century artists are deeply a\u0000ected by their immersion in global visual culture, which is now made vividly present through online\nnetworks. Many artists maintain a personal website, and some create art expressly for dissemination through social media. As always, new\ntechnologies provide new opportunities and challenges.\nPublic and Participatory Art\nPublic art was a well-established genre by the late twentieth century, attracting both traditional and experimental practitioners. Public art in the\ntwenty-\u0000rst century has expanded even more as a \u0000eld of activity in which creative investigation can take place. In addition to continuing familiar\nforms such as site-speci\u0000c monuments, murals, gra\u0000ti, and collaborations between artists, engineers, and architects, public art encompasses\nnew purposes, forms, and locations, including pop-up art shops, street parades, and online projects. Public artists in the twenty-\u0000rst century\nmight use established approaches such as installation and performance but introduce new variations. For instance, it is now common for artists\nto hire other people, sometimes with special skills, to undertake performances on their behalf. In this vein, Vanessa Beecroft hired fashion\nmodels for performances, and the collaborative artists Allora & Caldazilla directed professional athletes as performers in some of their\ninstallations.\nA pronounced tendency in the twenty-\u0000rst century has been art that is participatory, in which the social interactions prompted by a work\nbecome its content. Often called relational art, the work literally engages the public in some way. For instance, Carsten Höller has installed giant\nslides in museums for visitors to slide down, and Rirkrit Tiravanija has prepared Thai food and served it to gallery goers. Artists attracted by the\nimmediacy and connectivity of globally networked media often create online projects that invite social interaction. Relational aesthetics has\ndeveloped (and been contested) as a critical theory for analyzing and evaluating such undertakings. Key questions in these debates include:\nDoes it matter if the social interactions prompted by such works promote a better world or are conviviality and entertainment su\u0000cient goals? To\nwhat extent should the physical products of relational art (such as Höller’s slides) be evaluated aesthetically as well as for their social e\u0000ects?\nTechnology and Art\nThe use of technology (computers, \u0000lm, digital arts, recorded sound, lights, etc.) is widespread in both the creation and viewing of art.\nKeep in mind that twenty-\u0000rst century art can incorporate one, some, all, or none of these characteristics. This is simply a guide to some of the\nexciting things regularly occurring in contemporary art. In the coming years and decades, additional concerns will surely develop and be\nincorporated in the making and understanding of art.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}