{
    "text": "Art History/Printable version\nArt History\nThe current, editable version of this book is available in Wikibooks, the open-content textbooks collection, at\nhttps://en.wikibooks.org/wiki/Art_History\nPermission is granted to copy, distribute, and/or modify this document under the terms of the Creative Commons\nAttribution-ShareAlike 3.0 License. Contents\nPreface\nArt: Defined\nTheories of Art\nArt and Class\nUtility of Art\nClassification disputes about Art\nControversial Art\nForms, Genres, Mediums, and Styles\nPrehistoric Art\nPaleolithic Art\nPaleolithic Cave Paintings\nPaleolithic Venus Figurines\nMesolithic Art\nAmerican Indian Art\nLinks\nAncient Art\nAncient Egyptian Art\nThe Timeline of Egyptian Art\nGallery\nEgyptian Art\nGreek Art\nRoman Art\nMesopotamian Art\nAncient Chinese Art\nPre Columbian American Indian Art\nAncient Art of Other Civilizations\nMedieval Art\nRomanesque\nIntro\nCharacteristics\nGothic\nOther European movements\nEast Asian art, 500-1500\nSouth Asian art, 500-1500\nIslamic art to 1500\nAfrican art, 500-1500\nOceanic art, 500-1500\nAmerican Art, 500-1500\nRenaissance\nIntroduction\nGallery\nLeonardo Da Vinci\nMichelangelo\nDutch Golden Age\nRembrandt Harmenszoon van Rijn\nJohannes Vermeer\nOther Notable Works\n17th Century\nGallery\n18th Century\nBaroque\nRococo\nEnlightment\nGallery\nEuropean\nJapanese\nArchitecture\n19th Century\nImpressionism\nArtists\nCamille Pissarro (1830-1903)\nEdgar Degas (1834-1917)\nClaude Monet (1840-1926)\nMonet and Impressionism Late Work\nBerthe Morisot (1841-1895)\nPierre-Auguste Renoir (1841-1919)\nEarly Career\nRenoir's \"Dry\" Period\nLate Career\nEdouard Manet (1832-1883)\nSupport of Baudelaire and Zola\nLate Works\nBibliography\nReferences\nMajor Artwork of this time\nGallery\nHudson River School\nImpressionism, Post-Impressionism, Neo-Impressionism, and Pointillism\nRomanticism\nOther\nArchitecture\nFilm\n20th Century\nSecessionist movement\nFauvism\nCubism\nDadaism\nFuturism\nVorticism\nPostmodernism\nAbstract Expressionism\n20th Century Art Gallery\n1900-1920\n1920-1945\n1945-1970\n1970-1999\nArchitecture\nPhotography\nFilm\n21st Century\nGallery\nWorks\nArchitecture\nPhotography\nAnimation\nGlossary\nArt Movements\nMovements\nAbstract Expressionism\nArt Deco\nArt Nouveau\nAshcan School\nAssemblage (Collage)\nBarbizon School (Landscape Painting)\nBaroque\nBeaux Arts\nBlack or African-American Art\nClassicism\nConceptual art\nConstructivism\nCubism\nDada\nExpressionism\nFauvism\nFuturism\nGenre\nImpressionism\nIndigenouism\nIntentism\nMannerism Minimalism\nModern Ink Painting\nNeoclassicism\nNeoimpressionism\nOp Art\nPop Art\nRealism\nRococo\nSurrealism\nSymbolism\nReference\nAuthors Preface\nArt is that which elevates our understanding of the world and of ourselves from simple description or narrative to the sublime. Art occurs when images and objects,\nsights and sounds, or drawings and carvings convey the beauty and splendor of the world, or a realized imagination of an artist, for the purpose of self-expression\nor the shared enjoyment of its creation.\nArt: Defined\nThe modern use of the word 'Art', which rose to prominence after 1750, commonly refers to a skill used to produce an\naesthetic result. By any definition of the word, Art has existed alongside humankind, from the Ancient to the\nContemporary.\nThe first and broadest sense of how Art is described has remained closest to it's Latin meaning, which roughly translates to\na \"skill\" or \"craft\", a few examples demonstrating the broad sense of the root \"Art\" includes artifact, artificial, artifice,\nartillery, medical arts, and military arts. However, there are many other colloquial uses of the word, all with some relation to\nits etymology, such as from the Indo-European root meaning \"arrangement\" or \"to arrange\". In this sense, Art is whatever\nis described as having undergone a deliberate process of arrangement by an agent.\nThe second, more recent, sense of the word Art is an extension for \"creative art\" or “fine art\". In this instance, Art skill is\nbeing used to express the artist’s creativity, or to engage the audience’s aesthetic sensibilities, or to draw the audience\ntowards consideration of the “finer” things. Often, if the skill is being used in a lowbrow or practical way, people will\nconsider it a craft instead of Art. Likewise, if the skill is being used in a commercial or industrial way, it will be considered\ncommercial art instead of Art. On the other hand, crafts and design are sometimes considered applied art. Some have\nargued that the difference between fine art and applied art has more to do with value judgments rather than any distinct and The Café Terrace at Night by van\ndefined difference. However, even fine art can have goals beyond just pure creativity and self-expression. Gogh (1888)\nThe ultimate derivation of fine in fine art comes from the Aristotelian philosophy, Four causes (https://en.wikipedia.org/wi\nki/Four_causes). This principle states that there are four causes or explanations for an object. The fourth and/or final cause of an object is the purpose for its\nexistence. The term fine art is derived from this notion. If the final cause of an artwork is simply the artwork itself, and not a means to another end, then that\nartwork could appropriately be called fine.\nThe closely related concept of beauty is classically defined as \"that which when seen, pleases\". Pleasure is the final cause of beauty, and so it is not a means to\nanother end, but is an end in itself.\nArt can describe several kinds of things: a study of creative skill, a process of using the creative skill, a product of the creative skill, or the audience’s experiencing\nof the creative skill. The creative arts (“art”’ as discipline) are a collection of disciplines (“arts”) which produce artworks (“art” as objects) that is compelled by a\npersonal drive (“art” as activity) and echoes or reflects a message, mood, or symbolism for the viewer to interpret (“art” as experience).\nArtworks can be defined by purposeful, creative interpretations of limitless concepts or ideas in order to communicate something to another person. Artworks can\nbe explicitly made for this purpose or interpreted based on images or objects. The purpose of Art may be to communicate ideas, such as in politically-, spiritually-,\nor philosophically-motivated art, to create a sense of beauty (see “aesthetics”), to explore the nature of perception, for pleasure, or to generate strong emotions. The\npurpose may also be nonexistent or seemingly nonexistent.\nArt is something that visually stimulates an individuals thoughts, emotions, beliefs or ideas. Art is a realized expression of an idea, it can take many different forms\nand serve many different purposes. Though the application of scientific theories to derive a new scientific theory involves skill and end product is \"creation\" of\nsomething new, but this is not categorized as art, but as science only.\n\"It is self-evident that nothing concerning art is self-evident any more.\" -Walt Weaver\nTheories of Art\nNowhere are we more easily tripped up than in defining what is truly Art. While no one quibbles with the sublime beauty\nof the Mona Lisa, or the timeless majesty of the Parthenon, a general consensus about some works of art leads us to\ndisturbing and difficult questions like \"Who gets to say what art is?\" or \"What is it about this artwork that makes it\nbeautiful?\" We do know that while the artist is trying to relate directly to his intended audience, the process of defining and\nappreciating art is facilitated by the theoretician and critic, who give us insight into the work, its nature and its place in the\nhistory of culture.\nThere are many related theories of art. Aesthetics is the philosophy of beauty; aesthetic discussions engage us in disputes\nabout the best way to define art. One nihilistic theoretical point of view, for example, is that it is a mistake even to try to\ndefine art or beauty, insofar as they have no essence, and therefore can have no definition. Another is that art is a cluster of\nrelated concepts rather than a single concept. Examples of this approach include Morris Weitz and Berys Gaut. Fountain\nby Marcel Duchamp. At the same time, general descriptions of the nature of art can be separated from determinations of\nbeauty and called “theories of art,” but are always ringed with the determination of the relative artistic value of the work.\nAnother approach is to say that “art” is socially or culturally rooted, and that \"art\" is whatever artists, schools and museums\nsay it is. This \"institutional definition of art\" has been championed by George Dickie. This theory smacks of elitism, and\nhas its populist critics. Most people, at first blush, cannot see the artistry of a Brillo Box or a store-bought urinal; that is,\nuntil Andy Warhol and Marcel Duchamp said they were art, by placing them in a context to be viewed as art (i.e., the art\ngallery). This contextualization of art cum definition is a common, if overused, feature of conceptual art, prevalent since the\n1960s; notably, the Stuckist art movement critiques this tendency.\nGraffiti Art (Park Street, Bristol) by\nProceduralists often suggest that it is the process by which a work of art is created or viewed that makes it, art, not any Banksy\ninherent feature of an object, or how well received it is by the institutions of the art world after its introduction to society at\nlarge. For John Dewey, for instance, if the writer intended a piece to be a poem, it is one whether other poets acknowledge\nit or not. Whereas if exactly the same set of word was written by a journalist, intending them as shorthand notes to help him write a longer article latter, these would not be a poem. Leo Tolstoy, on the other hand, claims that what makes something art or not is how it is experienced by its audience, not by the intention of\nits creator. Functionalists, like Monroe Beardsley argue that whether or not a piece counts as art depends on what function it plays in a particular context, the same\nGreek vase may play a non-artistic function in one context (carrying wine), and an artistic function in another context (helping us to appreciate the beauty of the\nhuman figure).\nArt and Class\nLouis Le Vau opened up the interior court to create the expansive entrance cour d'honneur, later copied all over Europe.\nArt is often seen as belonging to one social class and excluding others. In this context, art is seen as a high-status activity\nassociated with wealth, the ability to purchase art, and the leisure required to pursue or enjoy it. The palaces of Versailles or\nthe Hermitage Museum in St. Petersburg with their vast collections of art, amassed by the fabulously wealthy royalty of\nEurope exemplify this view. Collecting such art is the preserve of the rich, in one viewpoint. Before the 13th century in\nEurope, artisans were often considered to belong to a lower caste, however during the Renaissance artists gained an Versailles\nassociation with high status. \"Fine\" and expensive goods have been popular markers of status in many cultures, and\ncontinue to be so today. At least one function of Art in the 21st century is as a marker of wealth and social status.\nUtility of Art\nOften one of the defining characteristics of fine art as opposed to applied art, is the absence of any clear usefulness or utilitarian value. But this requirement is\nsometimes criticized as being a class prejudice against labor and utility. Opponents of the view that art cannot be useful, argue that all human activity has some\nutilitarian function, and the objects claimed to be \"non-utilitarian\" actually have the function of attempting to mystify and codify flawed social hierarchies. It is also\nsometimes argued that even seemingly non-useful art is not useless, but rather that its use is the effect it has on the psyche of the creator or viewer.\nArt is also used by art therapists, psychotherapists and clinical psychologists as art therapy. The end product is not the principal goal in this case; rather a process of\nhealing, through creative acts, is sought. The resultant piece of artwork may also offer insight into the troubles experienced by the subject and may suggest suitable\napproaches to be used in more conventional forms of psychiatric therapy.\nGraffiti is a kind of graphic art, often painted on buildings, buses, trains and bridges. The \"use\" of art from the artist’s standpoint could be as a means of\nexpression. It allows one to symbolize complex ideas and emotions in an arbitrary language subject only to the interpretation of the self and peers.\nIn a social context, art can serve to soothe the soul and promote popular morale. In a more negative aspect of this facet, art is often utilised as a form of\npropaganda, and thus can be used to subtly influence popular conceptions or mood (in some cases, artworks are appropriated to be used in this manner, without the\ncreator's initial intention).\nFrom a more anthropological perspective, art is often a way of passing ideas and concepts on to later generations in a (somewhat) universal language. The\ninterpretation of this language is very dependent upon the observer’s perspective and context, and it might be argued that the very subjectivity of art demonstrates\nits importance in providing an arena in which rival ideas might be exchanged and discussed, or to provide a social context in which disparate groups of people\nmight congregate and mingle.\nClassification disputes about Art\nIt is common in the history of art for people to dispute about whether a particular form or work, or particular piece of work counts as art or not. Philosophers of Art\ncall these disputes “classificatory disputes about art.” For example, Ancient Greek philosophers debated about whether or not ethics should be considered the “art\nof living well.” Classificatory disputes in the 20th century included: cubist and impressionist paintings, Duchamp’s urinal, the movies, superlative imitations of\nbanknotes, propaganda, and even a crucifix immersed in urine. Conceptual art often intentionally pushes the boundaries of what counts as art and a number of\nrecent conceptual artists, such as Damien Hirst and Tracy Emin have produced works about which there are active disputes. Video games and role-playing games\nare both fields where some recent critics have asserted that they do count as art, and some have asserted that they do not.\nPhilosopher David Novitz has argued that disagreement about the definition of art, are rarely the heart of the problem, rather that “the passionate concerns and\ninterests that humans vest in their social life” are “so much a part of all classificatory disputes about art” (Novitz, 1996). According to Novitz, classificatory\ndisputes are more often disputes about our values and where we are trying to go with our society than they are about theory proper. For example, when the Daily\nMail criticized Hirst and Emin’s work by arguing \"For 1,000 years art has been one of our great civilising forces. Today, pickled sheep and soiled beds threaten to\nmake barbarians of us all\" they are not advancing a definition or theory about art, but questioning the value of Hirst’s and Emin’s work.\nControversial Art\nFamous examples of controversial European art of the 19th century include Theodore Gericault's \"The Raft of the Medusa\" (1820), construed by many as a\nblistering condemnation of the French government's gross negligence in the matter, Edouard Manet's \"Le D'jeuner sur l'Herbe\" (1863), considered scandalous not\nbecause of the nude woman, but because she is seated next to fully-dressed men, and John Singer Sargent's \"Portrait_of_Madame_X (https://en.wikipedia.org/wik\ni/Portrait_of_Madame_X)\", (1884) which caused a huge uproar because of the model's plunging neckline and the fact that her dress strap fell off shoulder. The\nmodel's family petitioned for the painting to be removed from the salon, and Sargent repainted the left dress strap on to the shoulder.\nIn the 20th century, examples of high-profile controversial art include Pablo Picasso's \"Guernica\" (1937), considered by most at the time as the primitive output of\na madman, this the sole explanation for its 'hodgepodge of body parts' and Leon Golub's \"Interrogation III\" (1958), shocking the American conscience with a\nnude, hooded detainee strapped to a chair, surrounded by several ever-so-normal looking \"cop\" interrogators. In 2001, Eric Fischl created \"Tumbling Woman\" as a memorial to those who jumped or fell to their death on 9/11. Initially installed at Rockefeller Center in New\nYork City, within a year the work was removed as too disturbing.\nForms, Genres, Mediums, and Styles\nThe creative arts are often divided into more specific categories, such as decorative arts, plastic arts, performing arts, or\nliterature. For example painting is a form of decorative art, and poetry is a form of literature.\nAn art form is a specific form for artistic expression to take, it is a more specific term than art in general, but less specific\nthan “genre.” Some examples include, but are by no means, limited to:\npainting\ndrawing\nprintmaking\nsculpture\nmusic\npoetry\narchitecture\ncinema Detail of Leonardo da Vinci's Mona\nLisa, showing the painting technique\nA genre is a set of conventions and styles for pursuing an art form. For instance, a painting may be a still life, an abstract, a of sfumato\nportrait, or a landscape, and may also deal with historical or domestic subjects. The boundaries between form and genre\ncan be quite fluid. So, for example, it is not clear whether song lyrics are best thought of as an art form distinct from poetry,\nor a genre within poetry. Is cinematography a genre of photography (perhaps “motion photography”) or is it a distinct form?\nAn artistic medium is the substance the artistic work is made out of. So for example stone and bronze are both mediums that sculpture uses sometimes. Multiple\nforms can share a medium (poetry and music, both use sound), or one form can use multiple media. An artwork or artist’s style is a particular approach they take to\ntheir art. Sometimes style embodies a particular artistic philosophy or goal, we might describe Joy Division as Minimalist in style, in this sense, for example.\nSometimes style is intimately linked with a particular historical period, or a particular artistic movement. So we might describe Dali’s paintings as Surrealist in style\nin this sense. Sometimes style is linked to a technique used, or an effect produced, so we might describe a Roy Lichtenstein painting as pointillist, because of its\nuse of small dots, even thought it is not aligned with the original proponents of Pointillism.\nMany terms used to describe art, especially recent art, are hard to categorize as forms, genres, or styles; or such categorizations are disputed. No one doubts there is\nsuch a thing as land art, but is it best thought of as a distinct form of art? Or, perhaps, as a genre of architecture? Or perhaps as a style within the genre of landscape\narchitecture? Are comics an art form, medium, genre, style, or perhaps more than one of these? Prehistoric Art\nPaleolithic Art\nArt has been part of human culture for millennia. Our ancestors left behind paintings and sculptures of delicate beauty and expressive strength. The earliest finds\ndate from the Middle Paleolithic period (between 200,000 and 40,000 years ago), although the origins of art may be older still, lost to the impermanence of\nmaterials.\nPaleolithic Cave Paintings\nFamous examples of Paleolithic (Old Stone Age) art can be found in France at the caves of Lascaux and Chauvet. Art from\nthis era is also found in regions around the world, including South Africa, where finds at Blombos Cave include an\nengraved piece of ochre believed to be about 70,000 years old.\nIn terms of speculating about the consciousness of these artists, it is particularly worth noting that at Lascaux, in what was\noriginally called the Cave of the Dead Man, we could a semiotic effort to talk about the human soul. The \"reality\" of the\nrepresentation of all animal figures is very high grade. The one human figure in the cave is done as a stick figure. In the\nforeground stands a staff surmounted by a bird figure.\nLascaux painting\nPaleolithic Venus Figurines\nSmall figurines dating from the Upper Paleolithic period (from about 40,000 to about 10,000 years ago) have been found 3D\nthroughout Europe. They are referred to as \"Venuses\", because they usually depict women, often with exaggerated hips\nand breasts. Some experts believe these figures could be fertility totems and among the first physical representations of a\nreligious or superstitious system. The objects are also sized to be carried easily from place to place as tribes migrated.\nThe Venus of Willendorf, which was discovered in Austria, is one of the best-known of the Venuses. Carved from\nlimestone, it is estimated to be around 25,000 years old.\nAnother well-known Paleolithic Venus, \"The Black Venus of Dolní Věstonice\", was found in the Czech Republic. It is\nremarkable in that it (together with other objects found nearby) is the earliest known ceramic work of art so far discovered. A 3D scan of the Venus of\nWillendorf. You can rotate around the\nfigurine in your browser.\nThe Venus of Willendorf from multiple Venus of Venus of\nangles. Hohle Fels Dolní\nVěstonic\ne\nMesolithic Art\nThe Mesolithic, or \"Middle Stone Age\" Period lasted from about 10,000 years ago to the onset of farming in many areas\nwhich ranged from about 8,000 - 4,000 years ago. The production of small, portable works of art such as the Venus\nfigurines popular during the Paleolithic era seems to have been greatly reduced.\nRock painting continued into the Mesolithic era, and included highly stylized depictions of human beings. Sites where\nMesolithic art has been found include Kamennaya Mogila in the Ukraine, where rather primitive depictions of animals\nwere carved into sandstone, Gobustan in Azerbaizhan and the Zaraut-Kamar grotto in Uzbekistan, both of which include\nstylized paintings of humans.\nAmerican Indian Art\nMesolithic artwork, possibly\ndepicting archers in a fight. Great Serpent Mound in Petroglyph in Utah\nOhio\nPetroglyphs in Washington. Nazca lines.\nNazca lines. Cueva de las Manos.\nLinks\nThe Caves of Lascaux (http://www.culture.gouv.fr/culture/arcnat/lascaux/en/)\nVenus Figures from the Stone Age (http://donsmaps.com/venus.html) Ancient Art\nAncient Egyptian Art\nAs far as we know, civilization first began in the Mesopotamian river valleys of the Tigris and Euphrates in present day Iraq.\nSoon thereafter, it took root in the valley and delta of the Nile. The ancient Egyptian civilization was one of the longest lasting\nin the West. It began in approximately 3000 B.C and lasted until 300 B.C. When it came to their art, the Egyptians had a\ndistinguished style known as frontalism. Figures created in this way are also called composite.\nThe features of frontalism are as follows:\nIn reliefs and paintings, the head of the character is drawn in profile while the body faces frontward\nThe eyes are drawn in full (even though the face is in profile)\nAn example of the Egyptian use\nThe legs are turned to the side with one foot in front of the other of frontalism.\nAll of the figures, in all media, are rigid and stiff, yet the faces are calm or no expression\nAlthough frontalism applies to the Egyptian art through thousands of years, there were slightly different rules for animals or slaves.\nThe Timeline of Egyptian Art\nThe Predynastic Period lasted from about 5000-3100 B.C. which was before Egypt became a kingdom. Many of the characteristics of their culture and art as we\nknow it did begin during this time period.\nThe pantheon of the gods was established during this time period\nThe illustrations and proportions of their human figures was developed\nEgyptian imagery, symbolism, and basic hieroglyphic writing was developed\nThe Early Dynastic Period lasted from about 3100 - 2686 B.C., which is also known as the 1st and 2nd Dynasties. During this time, the Egyptian government\nwas strong and supported their arts. During the Old Kingdom - from 2686-2181 B.C., the Egyptian pyramids were built. Sculptures that appeared more natural were built. The first known portraits\nwere done. It is at the end of the Old Kingdom when the Egyptian style made a shift toward formalized nude figures with long bodies and large eyes.\nGallery\nEgyptian Art\nNefertiti Bust Funerary mask of Tutankhamun Gold Scarab\nMirror of the Chief of the Statue of Pharaoh Stele of Princess Nefertiabet eating\nSouthern Tens Reniseneb Mentuhotep II\nThe Narmer Palette Temple of Horus at Edfu\nThe Giza pyramid complex\nGreek Art\nAphrodite of Milos Winged Nike of Samothrace Roman reproduction of\nMyron’s Discobolos in\nBronze. Ptolemaic mosaic of a dog with metal askos from Hellenistic An Attic red figured cup featuring a horse rider.\nEgypt.\nHeracles and Athena on Black figure and red figure pottery Minoan Bull's Head Rhyton\nfrom Kato Zakros\nThe mysterious clay fried Phaistos Disc. Attic white ground Kylix featuring Apollo with a black bird.\nProbably painted by the Pistoxenos Painter. The Hirschfeld Krater. Fragment of a gold wreath. Greek statues were originally given\ncolor. This is a modern restoration\nattempt.\nTemple of Hephaestus in Athens. The Parthenon in Athens.\nTheatre and Temple of Apollo at Delphi. Theatre of Dionysus in Athens. The Ancient Theatre of Epidaurus.\nTheatre Mask\nRoman Art\nAugustus of Prima Porta Head of an elderly Roman. Roman mosaic featuring a theater mask. Maison Carrée, a Roman temple located in modern France.\nPantheon in Rome.\nMesopotamian Art\nStatue of Ebih-Il Bull's head of the Queen's lyre Bronze head of an Akkadian ruler, Victory Stele of Naram-Sin\nfrom Pu-abi's grave likely either Sargon of Akkad or\nNaram-Sin of Akkad. Assyrian Winged Bull Great Ziggurat of Ur\nAncient Chinese Art\nJust one of the multitude of The Flying Horse of Gansu\nstatues from the Terracotta Army. Duanfang altar set Hou Mu Wu Ding One of the\nBronze statues\nof tall humans\nin Sanxingdui.\nPre Columbian American Indian Art\nOlmec Head Head dress of Moctezuma II (Reproduction)\nZapotec Mask Chichen Itza Stone of the Sun\nAncient Art of Other Civilizations\nPyramids of Meroë Greco-Buddhist state of the\nBuddha. This statue was\ncrafted in Gandhara. Medieval Art\nMedieval art dates roughly from the period 500-1500 AD.\nEuropean medieval art is generally centered around the architecture and icons of the Roman Catholic Church. The\nChristian Church grew from the fourth century onwards as the Roman empire collapsed. The pagan gods were no longer\nworshipped and such was the power of this new Christian religion that Iconoclasts destroyed early pagan statues and\nreligious objects during the reign of Constantine, Emperor of Rome from 306 to 337. From the ashes of Classical Rome\ncame a new Europe where the Christian Church became intricately entwined in the politics and economics of the day.\nCharlemagne (c. 742 – 814), a Frankish king, united Western Europe and was given the title \"Holy Roman Emperor\"\n(Imperator Augustus) by Pope Leo III on the 25 December 800 C.E. From this moment on the Christian Church and the\nState had forged a bond that would last for centuries.\nThe Ghent Altarpiece.\nRomanesque\nIntro\nThe Romanesque period refers roughly to the eleventh and first half of the twelfth centuries. The term Romanesque was first given to this type of architecture in\nthe 19th Century due to the use of round-headed arches and masonry barrel vaults, practices that had been common in ancient Roman architecture. The kinds of\nmonuments that were sufficiently permanent to survive--mainly church buildings and sculpture--were commissioned by the Church.\nCharacteristics\nCommon characteristics of Romanesque architecture are thick, stone walls and large, exterior buttresses to support them, rounded arches, and barrel vaults. The\nwindows in these structures are usually small due to the restraints of using ashlar masonry. The exteriors of Romanesque churches, as compared to the modular\nCarolingian and Ottonian churches of the ninth and tenth centuries, have unified decorative schemes of architectural and sculptural elements that unite the design\nas a whole. These design elements include blind arcades, (rows of arches set flush against the wall's surface), and corbel tables, (series of arches mounted, not on\ncolumns, but on decorative stone brackets, called corbels), both of which often run around the entire perimeter; down the exterior nave wall, and around the\ntransepts and apse, tying the structure together visually.\nOne major development of eleventh and twelfth-century architecture is the addition of increasingly elaborate programmes of figural sculpture on the exterior,\nparticularly at the West end, usually the main entrance to the church. Standing figures of sacred Biblical authors, such as prophets and apostles, as well as saints\nand Old Testament kings were placed against the walls beside the doorways, called jambs. The arches over doorways, instead of being left open, were usually\nfilled with semi-circular slabs of stone, called tympana (sing. tympanum). The subject matter in the tympana was dominated by representations of the Last\nJudgment when, according to traditional teaching, Christ would return and divide the world into those who will receive eternal reward, and those who will be\npunished. Romanesque sculpture is marked by a love of inventive surface patterns, and an expressive approach to the human body, using elongation, unnatural\nposes and emphatic gestures to convey states of mind.\nAmong smaller art forms, Romanesque manuscript illustrators continued to present full-page author portraits, for example, before the beginning of each Gospel\nbook; but also elaborated the written word with historiated initials, that is, the first letter of a section drawn large, containing relevant figures or even narrative\nscenes; and marginal miniatures, the small scenes, sometimes fanciful and strange, drawn in the margins of the page. Metalwork, and carved gems and ivory share\nsome of the expressive and decorative qualities of monumental sculpture and manuscript painting.\nA 12th century manuscript Romanesque Romanesque sculptures were sometimes\npage - Psalm 24 stained glass. given color, as can faintly be seen here.\nGothic\nGothic architecture originated in southern France, around 1140, beginning with the innovative construction of the choir of Saint-Denis. Several characteristics\nmark Gothic architecture including the use of flying buttresses, elaborate stained-glass windows, ribbed vaults, pointed arches, and a distinct emphasis on\nverticality.\n'Several of these characteristics are exemplified in specific cathedrals: 'Flying buttresses: Notre Dame de Paris\nStained Glass: Chartres Cathedral\nDistinct Verticality: Amiens Cathedral'\nIn contrast to the dark, claustrophobic Romanesque churches, Gothic cathedrals present a light, airy atmosphere due mainly to their ribbed vaults and flying\nbuttresses which are able to support thinner walls, higher ceilings, and large, light filled windows. The Notre-Dame De Paris in 2010, before the 2019 fire. The Meeting of the Magi, Bust of the Virgin, International\nInternational Gothic. Gothic\nOther European movements\nInscription of the book of St. Mark in the Ebbo Gospels, Christ Pantocrator mosaic in the Hagia\nLindisfarne, an example of an example of Carolingian art. Sophia, an example of Byzantine\nAnglo-Saxon art. artwork. The Wilton Diptych. The Birth of Venus by Sandro Botticelli - 1484 - 1486.\nEast Asian art, 500-1500\nThe Forbidden City an example of Chinese architecture - Early 1400's.\nSouth Asian art, 500-1500\nThe Golden Temple, built in the late 1500's.\nIslamic art to 1500\nFrom c. 670 to 1500, Islam expanded from its roots in modern-day Saudi Arabia to an empire stretching from Morocco to India. The spread of Islam throughout\nEurasia was accompanied by the development of an artistic style which was closely related to Islam and its interpretation by regional dynasties. Islamic arts and\narchitecture vary widely according to region but have a few unifying features. The Qur'an forbids depictions of the Prophet Muhammed and depictions of any\nperson in religious art; therefore, Islamic artistic decoration is characterized by abstract floral and vegetal motifs rather than figural representation. Also, the Qu'ran\ndiscourages the construction of any building that would outlive its architect unless it serves Islam or the community in some way; therefore, surviving works,\nparticularly works of architecture, tend to be public buildings like mosques, gardens and markets. (Palaces also frequently survive, although this could easily be\nbecause of the desire to preserve works of that quality of construction and decoration). Finally, the Arabic language, as the language of the Qur'an, is deeply\nembedded in Islamic artistic tradition; text is often featured as meaningful decoration in works of art and architecture. The Ardabil Carpet Arabesques in the Alhambra. Depiction of part of the Khamsa\nof Nizami - 1539\nAfrican art, 500-1500\nA Terracotta bust made by Bronze Head from Horn Blower Mali artwork\nthe Yoruba people Ife ~ 1300\nbetween the 12th century,\nand the 15th century The Golden Rhinoceros of Mapungubwe.\nOceanic art, 500-1500\nA Moai\nAmerican Art, 500-1500\nDresden Codex Montezuma Castle Machu Picchu\nAztec doubled headed serpent Aztec sun stone Renaissance\nIntroduction\nThe Renaissance is a period in European history that covers the 15th and the 16th century. The word renaissance means\nrebirth in French and describes the rediscovery of the knowledge and art of Classical Greece and Rome. The roots of the\nRenaissance can be found in the Crusades of the 11th century onwards. The Crusaders' main aim was to liberate Jerusalem\nfrom Muslim control and one of the more positive effects of the Crusades was the rediscovery of ancient texts and art.\nNews of books and artifacts that had been unavailable in Europe were brought back by Crusaders and this led to a renewed\ninterest in Classical Greece and Rome. It must be noted that diplomatic contact and trade between Europe and the East\ncontinued throughout the Crusades and many texts were acquired by Europeans perfectly peacefully. One of the most\nquoted finds is The Almagest by Ptomely; a work on astronomy. The Almagest was written in the 2nd century C.E and\nSchool of Athens by Raphael (1505) translated into Arabic in the 9th century. It was rediscovered in the 12th century by European scholars and translated into\nSpanish and Latin. This influx of texts and art from the East revitalized Classical studies in the West. Scholars in the West\ncould now compare their Medieval texts (sometimes complete or fragments) against earlier copies or read works that had\nbeen known about in the West but had been presumed to have been permanently lost. These discoveries had a great effect on European culture and art. There was\na determined effort by Renaissance composers to bring back to life the plays of the Ancient Greeks and Romans. Renaissance painters used the themes and\nmythology of the Classical period for inspiration. Renaissance sculpture absorbed the Classical aesthetic on form and many Renaissance statues show a sense of\nbalance in portraying the human form that would be instantly recognizable to an Athenian of the 5th century BC.\nPopular Works:\n1. Primavera (The Birth of Spring), Birth of Venus - Sandro Botticelli\n2. Bronze David, Marble David - Donatello\n3. David, Pieta' - Michelangelo\n4. School of Athens - Raphael\n5. Dome of Santa Maria del Fiore, Ospedale degli Innocenti Loggia, San Lorenzo (Florence), Santo Spirito (Florence) - Brunelleschi\n6. Mona Lisa, The Last Supper, Vitruvian Man, Annunciation - Leonardo\n7. North and East Doors, Baptistry of San Giovanni, Florence - Ghiberti\nThemes: This period is characterized by numerous religious works; themes include the Holy Trinity, Holy Family, Adoration of the Magi, Virgin and child.\nMythological subject matter is introduced in the visual arts of this period.\nCenters of Art:\n1. 15th-century Florence\n2. 16th-century Rome\n3. 16th-century Northern Italy (including Venice, provinces)\n4. 15th-century Flanders\nImportant literature:\n1. Vasari's Lives of the Artists 2. Alberti's On Painting\nGallery\nLeonardo Da Vinci\nVitruvian Man The Last Supper\nAnnunciation Mona Lisa Lady with an Ermine Salvator Mundi\nMichelangelo\nDavid Pieta\nCreation of Adam Sistine Chapel ceiling. 3D\nA 3D scan of David. You can rotate around the statue in your browser.\nDutch Golden Age\nRembrandt Harmenszoon van Rijn\nThe Storm on the Sea of Galilee by The Blinding of Samson by Rembrandt - 1636.\nRembrandt - 1633. The Night Watch by Rembrandt - 1642. Self-Portrait with Beret and Turned-\nUp Collar by Rembrandt - 1659.\nJohannes Vermeer\nThe Wine Glass by Johannes Vermeer - 1658 - 1660. The Milkmaid by Johannes Vermeer - 1658\n- 1661. Girl with a Pearl Earring by Johannes\nVermeer - 1665\nOther Notable Works\nPrimavera by Sandro Botticelli - 1470s-1480s. An example of Italian\nRenaissance panel painting.\nDelivery of the Keys an example of Italian Renaissance painting by Pietro\nPerugino - 1481-1482 The Triumph of Death by Pieter Bruegel the Elder - 1562. The Wedding Feast at Cana by Paolo Veronese - 1563\nThe Dispute of Minerva and Neptune by René-Antoine Houasse -\n1689. 17th Century\nAs the Renaissance occurred in Europe, the art world of other countries did not stay stagnant.\nGallery\nThe Taj Mahal in India. 18th Century\nBaroque\nSpilling over into the beginning of the 18th century were the last remnants of Baroque art. Baroque interior design, in particular, is distinctly ornate and rich in\nceiling decor.\nRococo\nFollowing Baroque art, a similar movement, called Rococo, developed. Initially, it thrived in interior design as Baroque had previously done, but in comparison to\ninterior design done in the Baroque style, the Rococo style could be described as softer and more refined.\nThe main proponents of Rococo style painting were Antoine Watteau, Francois Boucher, and Jean-Honore Fragonard. Rococo painting has a very distinct style.\nLight, mint greens and soft pinks and blues were some of the most popularly used colors. In general, the color palette consisted of soft, yet intense, colors. Also,\ndistinct to Rococo painting was the light subject matter; generally paintings in this style depicted the leisure of the upper class. Jean-Honore Fragonard's The Swing\nexemplifies the Rococo style, as seen in painting.\nEnlightment\nThe Rococo movement came to an end with the onset of the Enlightenment, which ushered in the next major artistic movement-Neoclassicism. As the name\nsuggest, a revival of the influence of classic art from ancient Greece and Rome ensued. In painting, Jaques-Louis David was the leading painter of this style. His\nworks, such as the Oath of the Horatii exemplified Neoclassicism with its logical order and stately, even heroic, subject matter. In architecture, one of the greatest\ninfluences was Palladio's Villa Rotunda, a Renaissance building, itself, inspired by classic order and symmetry. As demonstrated by the shift from Rococo to Neoclassicism, two starkly contrasting art styles, many successive art movements are reactions to previous styles. The\nvery formal, stately Neoclassical style was a direct reaction to that of the previous light and airy Rococo style.\nGallery\nEuropean\nInterior of Ca' Rezzonico in Venice, an example of Rococo artwork. -\n1753\nView of Warsaw from the Terrace of the Royal Castle by Bernardo Bellotto -\n1773. David - Oath of the Horatii - 1784 David - The Death of Socrates - 1787\nJacques-Louis David - Portrait\nd'Henriette de Verninac - 1799\nJapanese\nThree Beauties of the Present\nDay by Kitagawa Utamaro -\n1793. An example of nishiki-e\ncolor woodblock print.\nArchitecture Amber Room - 1701.\nMonticello - 1772.\nPanthéon - 1790. Brandenburg Gate Neoclassical architecture - 1788-1791. 19th Century\nImpressionism\nPhotography in the nineteenth century both challenged painters to be true to nature and encouraged them to exploit aspects\nof the painting medium, like color, that photography lacked. This divergence away from photographic realism appears in\nthe work of a group of artists who from 1874 to 1886 exhibited together, independently of the Salon. The leaders of the\nindependent movement were Claude Monet, August Renoir, Edgar Degas, Berthe Morisot, and Mary Cassatt. They\nbecame known as Impressionists because a newspaper critic thought they were painting mere sketches or impressions. The\nImpressionists, however, considered their works finished. Many Impressionists painted pleasant scenes of middle class\nurban life, extolling the leisure time that the industrial revolution had won for middle class society. In Renoir's luminous\nL'Hermitage à Pontoise by Camille\npainting Luncheon of the Boating Party, for example, young men and women eat, drink, talk, and flirt with a joy for life Pissarro (1867)\nthat is reflected in sparkling colors. The sun filtered through the orange striped awning colors everything and everyone in\nthe party with its warm light. The diners' glances cut across a balanced and integrated composition that reproduces a very\ndelightful scene of modem middle class life.\nSince they were realists, followers of Courbet and Manet, the Impressionists set out to be \"true to nature,\" a phrase that\nbecame their rallying cries. When Renoir and Monet went out into the countryside in search of subjects to paint, they\ncarried their oil colors, canvas, and brushes with them so that they could stand right on the spot and record what they saw\nat that time. In contrast, most earlier landscape painters worked in their studio from sketches they had made outdoors. The\nmore an Impressionist like Monet looked, the more she or he saw. Sometimes Monet came back to the same spot at\ndifferent times of day or at a different time of year to paint the same scene. In 1892 he rented a room opposite the Cathedral\nof Rouen in order to paint its facade over and over again. He never copied himself because the light and color always\nchanged with the passage of time, and the variations made each painting a new creation. The differences are obvious when\nwe compare the painting of Rouen Cathedral that is now in Switzerland with the one that is now in Washington, D.C.\nRealism meant to an Impressionist that the painter ought to record the most subtle sensations of reflected light. In capturing Luncheon of the Boating Party by\na specific kind of light, this style conveys the notion of a specific and fleeting moment of time. Impressionist painters like Renoir (1881)\nMonet and Renoir recorded each sensation of light with a touch of paint in a little stroke like a comma. The public back\nthen was upset that Impressionist paintings looked like a sketch and did not have the polish and finish that more fashionable\npaintings had. But applying the paint in tiny strokes allowed Monet, Renoir, or Cassatt to display color sensations openly, to keep the colors unmixed and intense,\nand to let the viewer's eye mix the colors. The bright colors and the active participation of the viewer approximated the experience of the scintillation of natural\nsunlight. The Impressionists remained realists in the sense that they remained true to their sensations of the object, although they ignored many of the old\nconventions for representing the object \"out there.\" But truthfulness for the Impressionists lay in their personal and subjective sensations not in the \"exact\"\nreproduction of an object for its own sake. The objectivity of things existing outside and beyond the artist no longer mattered as much as it once did. The\nsignificance of \"outside\" objects became irrelevant. Concern for representing an object faded, while concern for representing the subjective grew. The focus on\nsubjectivity intensified because artists became more concerned with the independent expression of the individual. Reality became what the individual saw. With\nImpressionism, the meaning of realism was transformed into subjective realism, and the subjectivity of modem art was born.\nArtists\nJean-Baptiste-Camille Corot (1796-1875)\nCharles-François Daubigny (1817-1878)\nGustave Courbet (1819-1877)\nEugene Boudin (1824-1898)\n#Camille Pissarro (1830-1903)\nCamille Pissarro (1830-1903)\nEdouard Manet (1832-1883)\nEdgar Degas (1834-1917)\nClaude Monet (1840-1926)\nPierre-Auguste Renoir (1841-1919)\nFrederic Bazille (1841-1870)\nBerthe Morisot (1841-1895)\nMary Cassatt (1844-1926)\nGustave Caillebotte (1848-1894)\nPaul Gauguin (1848-1903)\nCamille Pissarro (1830-1903)\nBorn July 10, 1830 in St. Thomas, Virgin Islands. His father, a Portuguese Jew, ran a general store. Although Pissarro attended school in Paris and demonstrated\nan exceptional talent for drawing, he returned to St. Thomas in 1847 to work in the family business. During the ensuing years his interest in art persisted, and in\n1855 his parents finally yielded to his ambition to become a painter.\nPissarro reached Paris in time to see the important World's Fair of 1855. He was particularly impressed by the landscapes of Camille Corot and other members of\nthe Barbizon group, who had taken the first steps toward working directly from nature, and by the ambitious and forthright realism of Gustave Courbet, although\nhis own work increasingly gravitated toward landscape rather than figurative subjects.\nDuring the next 10 years, Pissarro received some academic training at the École des Beaux-Arts, but he spent most of his time at the Académie Suisse, where free\nclasses were offered. This was an important gathering place for those artists whose ambitions and sensibilities lay outside the teaching of the official schools, for it\noffered greater opportunity to discuss and develop personal ideas about painting and art in general. In this setting Pissarro became friends with Claude Monet,\nPierre Auguste Renoir, Alfred Sisley, and Paul Cézanne, who were seeking alternatives to the established methods of painting. Pissarro's works at this time were\noccasionally, though by no means consistently, accepted at the annual Salons. More importantly, however, he received critical backing and encouragement from\nthe journalist and critic Émile Zola. During the Franco-Prussian War of 1870-7, Pissarro and Monet went to London, where they were impressed by the landscape paintings of John Constable and\nJ.M.W. Turner. By this time Pissarro and Monet had begun to work directly from nature and to develop the unique style that would later be called Impressionism.\nIn their pursuit of this new and revolutionary direction, the lessons of the earlier English landscapists provided crucial and much-needed support, particularly in\nterms of the loose handling of paint, the abstractness, and the strong response to nature that characterized their own paintings. When Pissarro returned to his home\nat Louveciennes near Paris, he found that the Prussians had destroyed nearly all of his paintings.\nBy the early 1870s, the work of Pissarro and his colleagues had been rejected by the Salon, France's official state-run art show, on repeated occasions. In 1874,\nthey held their own exhibition, a show of \"independent\" artists, which included the work of Pissarro, Monet, Renoir, Sisley, Edgar Degas, and Berthe Morisot.\nThis was the first Impressionist exhibition (the term \"Impressionist,\" originally used derisively, was actually coined by a newspaper critic). There were seven\nsimilar exhibitions from 1874-86, and Pissarro was the only artist who participated in all eight. This fact is important because it reveals something about Pissarro's\nrelation to Impressionism generally: he was the patriarch and teacher of the movement, constantly advising younger artists, introducing them to one another, and\nencouraging them to join the revolutionary trend that he helped to originate. In 1892, a large retrospective of Pissarro's work finally brought him the international\nrecognition he deserved. Characteristic paintings are Path through the Fields (1879), Landscape, Eragny (1895), and Place du Théâtre Français (1898). He died in\nParis on November 12, 1903. Although his work was generally less innovative than that of his major contemporaries, his contributions as an artist should not be\nunderestimated in the development of the Impressionist painting style.\nEdgar Degas (1834-1917)\nBorn Hilaire-Germain-Edgar Degas on July 19, 1834, in Paris, France. A member of an upper-class family (his father was a banker), Degas was originally\nintended to practice law, which he studied for a time after finishing secondary school. In 1855, however, he enrolled at the famous École des Beaux-Arts, or\nSchool of Fine Arts, in Paris, where he studied under Louis Lamothe, a pupil of the classical painter Jean-Auguste-Dominique Ingres. In order to supplement his\nart studies, Degas traveled extensively, including trips to Naples, Florence, and Rome (where he lived for three years), in order to observe and copy the works of\nsuch Renaissance masters as Sandro Botticelli, Andrea Mantegna, and Nicolas Poussin. From his early classical education, Degas learned a good deal about\ndrawing figures, a skill he used to complete some impressive family portraits before 1860, notably The Belleli Family (1859). In 1861, Degas returned to Paris,\nwhere he executed several \"history paintings,\" or works with historical or Biblical themes, which were then the most sought-after paintings by serious art patrons\nand particularly the prestigious state-run art show, the Salon, held each year in Paris. He also began copying works by the Old Masters from the Louvre, which he\nwould continue doing for many years. With his historical paintings (including 1861's Daughter of Jephthah, based on an incident from the Old Testament) and his\nfinely-wrought portraits of friends, family members, and clients, the young Degas quickly established a reputation among French art circles and never suffered\nfrom the financial problems that plagued many of his contemporaries.\nSoon, however, Degas began to shift his focus from historical painting to depictions of life in contemporary Paris. By 1862,\nhe had begun painting various scenes from the racecourse, including studies of the horses, their mounts, and the\nfashionable spectators. Degas' style after the early 1860s was influenced by the budding Impressionist movement, including\nhis friendship with Édouard Manet, as well as his introduction to Japanese graphic art, with its striking representation of\nfigures. Along with his work painting scenes from the racetrack, Degas began concentrating on portraits of groups, most\nnotably of female ballet dancers, who became Degas' most famous subjects. Degas served in the artillery division of the\nFrench National Guard during the Franco-Prussian War of 1870-71. Upon his return, he worked on even more ambitious\nstudies of groups, often in motion, in both indoor and outdoor settings. In October 1872, Degas visited the United States\nfor five months, spending time in New Orleans, Louisiana, where some members of his family were in the cotton business.\nFrom this experience came his famous painting New Orleans Cotton Office (1873).\nMany of Degas' paintings featured the artist's experiments with unorthodox visual angles and asymmetrical perspectives,\nsomewhat like a photographer's treatment of a subject. Examples of this style are A Carriage at the Races (1872), which\nfeatures a human figure who is almost cut in half by the edge of the canvas, and Ballet Rehearsal (1876), a group portrait of\nballerinas that appears almost cropped at the edges. From 1873 to 1883, Degas produced many of his most famous works, The Dance Class (La Classe de\nDanse) by Edgar Degas (1873–1876)\nboth paintings and pastels, of his favorite subjects, including the ballet, the racecourse, the music hall, and café society.\nThough he never suffered from lack of money or interest in his work, Degas stopped exhibiting at the Salon in 1874, and\nthereafter displayed most of his works alongside those of the other Impressionists, including Claude Monet, Alfred Sisley,\nBerthe Morisot, Pierre-Auguste Renoir, and Camille Pissarro. His strong focus on draftsmanship, portraiture, and composition distanced him from the rest of the\nartists identified as Impressionists.\nSometime in the 1870s, Degas began to suffer a loss of vision, which limited his ability to work. He began increasingly to work as a sculptor, producing bronze\nstatues of horses and ballet dancers, among other subjects. A number of his sculptures, including Little Dancer Aged Fourteen (1880-81), were figures dressed in\nreal costumes, and many of them captured the moment of transition between one position to another, giving the statues a real sense of immediacy and motion. As\nDegas' eyesight grew worse, he became an increasingly reclusive and eccentric figure. In the last years of his life, he was almost totally blind. Edgar Degas died on\nSeptember 27, 1917, in Paris, leaving behind in his studio an important collection of drawings and paintings by his contemporaries as well as a number of statues\ncrafted in wax and metal, which were cast in bronze after his death.\nClaude Monet (1840-1926)\nBorn November 14, 1840, in Paris, France. Claude Monet was a seminal figure in the evolution of Impressionism, a pivotal style in the development of modern\nart. In 1845 his family moved to Le Havre, and by the time he was 15, Monet had developed a local reputation as a caricaturist. Through an exhibition of his\ncaricatures in 1858, Monet met Eugène Boudin, a landscape painter who exerted a profound influence on the young artist. Boudin introduced him to outdoor\npainting, an activity that he entered reluctantly but which soon became the basis for his life's work. By 1859 Monet was determined to pursue an artistic career. He\nvisited Paris and was impressed by the paintings of Eugène Delacroix, Charles Daubigny, and Camille Corot. Against his parents' wishes, Monet decided to stay in\nParis. He worked at the free Académie Suisse, where he met Camille Pissarro, and he frequented the Brasserie des Martyrs, a gathering place for Gustave Courbet\nand other realists who constituted the vanguard of French painting in the 1850s. Formative Period\nMonet's studies were interrupted by military service in Algeria from 1860 to 1862. The remainder of the decade witnessed constant experimentation, travel, and the\nformation of many important artistic friendships. In 1862, he entered the studio of Charles Gleyre in Paris and met Pierre-Auguste Renoir, Alfred Sisley, and\nFrédéric Bazille. During 1863 and 1864, he periodically worked in the forest at Fontainebleau with the Barbizon artists Théodore Rousseau, Jean François Millet,\nand Daubigny, as well as with Corot. In Paris in 1869, he frequented the Café Guerbois, where he met Édouard Manet. At the outbreak of the Franco-Prussian\nWar in 1870, Monet traveled to London, where he met the adventurous and sympathetic dealer Paul Durand-Ruel. The following year Monet and his wife,\nCamille, whom he had married in 1870, settled at Argenteuil, which became a semi-permanent home (he continued to travel throughout his life) for the next six\nyears. Monet's constant movements during this period were directly related to his artistic ambitions. The phenomena of natural light, atmosphere, and color captivated his imagination, and he committed himself to an increasingly accurate recording of their enthralling variety. He consciously sought that variety and\ngradually developed a remarkable sensitivity for the subtle particulars of each landscape he encountered. Paul Cézanne is reported to have said, \"Monet is the most\nprodigious eye since there have been painters.\" Relatively few of Monet's canvases from the 1860s have survived. Throughout the decade, and during the 1870s\nas well, he suffered from extreme financial hardship and frequently destroyed his own paintings rather than have them seized by creditors. A striking example of\nhis early style is Terrace at Sainte-Adresse (1867). The painting contains a shimmering array of bright, natural colors, eschewing completely the somber browns\nand blacks of the earlier landscape tradition.\nMonet and Impressionism\nAs William Seitz wrote in 1960, \"The landscapes Monet painted at Argenteuil between 1872 and 1877 are his best-known, most popular works, and it was during\nthese years that Impressionism most closely approached a group style. Here, often working beside Renoir, Sisley, Caillebotte, or Manet, he painted the sparkling\nimpressions of French river life that so delight us today.\" During these same years, Monet exhibited regularly in the Impressionist group shows, the first of which\ntook place in 1874. On that occasion his painting Impression: Sunrise (1872) inspired a hostile newspaper critic to call all the artists \"Impressionists,\" and the\ndesignation has persisted to the present day.\nMonet's paintings from the 1870s reveal the major tenets of the Impressionist vision. Along with Impression: Sunrise, Red\nBoats at Argenteuil (1875) is an outstanding example of the new style. In these paintings, Impressionism is essentially an\nillusionist style, albeit one that looks radically different from the landscapes of the Old Masters. The difference resides\nprimarily in the chromatic vibrancy of Monet's canvases. Working directly from nature, he and the other Impressionists\ndiscovered that even the darkest shadows and the gloomiest days contain an infinite variety of colors. To capture the\nfleeting effects of light and color, however, Monet gradually learned that he had to paint quickly and to employ short\nbrushstrokes loaded with individualized colors. This technique resulted in canvases that were charged with painterly\nactivity; in effect, they denied the even blending of colors and the smooth, enameled surfaces to which earlier painting had\npersistently subscribed.\nYet, in spite of these differences, the new style was illusionistically intended; only the interpretation of what illusionism Impression, Sunrise (Impression,\nconsisted of had changed. For traditional landscape artists, illusionism was conditioned first of all by the mind: that is, soleil levant) by Monet (1872)\npainters tended to depict the individual phenomena of the natural world-leaves, branches, blades of grass-as they had\nstudied them and conceptualized their existence. Monet, on the other hand, wanted to paint what he saw rather than what\nhe intellectually knew. And he saw not separate leaves, but splashes of constantly changing light and color. According to Seitz, \"It is in this context that we must\nunderstand his desire to see the world through the eyes of a man born blind who had suddenly gained his sight: as a pattern of nameless color patches.\" In an\nimportant sense, then, Monet belongs to the tradition of Renaissance illusionism: in recording the phenomena of the natural world, he simply based his art on\nperceptual rather than conceptual knowledge.\nDuring the 1880s, the Impressionists began to dissolve as a cohesive group, although individual members continued to see one another and they occasionally\nworked together. In 1883 Monet moved to Giverny, but he continued to travel-to London, Madrid, and Venice, as well as to favorite sites in his native country. He\ngradually gained critical and financial success during the late 1880s and the 1890s. This was due primarily to the efforts of Durand-Ruel, who sponsored one-man\nexhibitions of Monet's work as early as 1883 and who, in 1886, also organized the first large-scale Impressionist group show to take place in the United States.\nMonet's painting during this period slowly gravitated toward a broader, more expansive and expressive style. In Spring Trees by a Lake (1888) the entire surface\nvibrates electrically with shimmering light and color. Paradoxically, as his style matured and as he continued to develop the sensitivity of his vision, the strictly\nillusionistic aspect of his paintings began to disappear. Plastic form dissolved into colored pigment, and three-dimensional space evaporated into a charged, purely\noptical surface atmosphere. His canvases, although invariably inspired by the visible world, increasingly declared themselves as objects that are, above all,\npaintings. This quality links Monet's art more closely with modernism than with the Renaissance tradition.\nModernist, too, are the \"serial\" paintings to which Monet devoted considerable energy during the 1890s. The most celebrated of these series are the haystacks\n(1891) and the façades of Rouen Cathedral (1892-1894). In these works Monet painted his subjects from more or less the same physical position, allowing only\nthe natural light and atmospheric conditions to vary from picture to picture. That is, he \"fixed\" the subject matter, treating it like an experimental constant against\nwhich changing effects could be measured and recorded. This technique reflects the persistence and devotion with which Monet pursued his study of the visible\nworld. At the same time, the serial works effectively neutralized subject matter per se, implying that paintings could exist without it. In this way his art established\nan important precedent for the development of abstract painting.\nLate Work\nMonet's wife died in 1879; in 1892 he married Alice Hoschedé. By 1899 his financial position was secure, and he began work on his famous series of water lily\npaintings. Water lilies existed in profusion in the artist's exotic gardens at Giverny, and he painted them tirelessly until his death there on December 5, 1926.\nMonet's late years were by no means easy. During his last two decades, he suffered from poor health and had double cataracts; by the 1920s, he was virtually\nblind. In addition to his physical ailments, Monet struggled desperately with the problems of his art. In 1920, he began work on 12 large canvases (each measuring\n14 feet in width) of water lilies, which he planned to give to the state. To complete them, he fought against his own failing eyesight and against the demands of a\nlarge-scale mural art for which his own past had hardly prepared him. In effect, the task required him to learn a new kind of painting at the age of 80. The paintings\nare characterized by a broad, sweeping style; virtually devoid of subject matter, their vast, encompassing spaces are generated almost exclusively by color. Such\ncolor spaces were without precedent in Monet's lifetime; and moreover, their descendants have appeared in contemporary painting only since the end of World War\nII.\nBerthe Morisot (1841-1895)\nBorn January 14, 1841, in Bourges, France. The daughter of a high-ranking government official and granddaughter of the influential Rococo painter Jean-Honoré\nFragonard, Morisot began studying painting alongside her sister Edma when both were young. Though women were not allowed to join official arts institutions,\nlike schools, until the last few years of the nineteenth century, Morisot and her sister earned a certain measure of respect within art circles for their budding talent.\nAfter copying masterpieces from the Louvre Museum in the late 1850s under Joseph Guichard, Berthe and Edma began painting outdoor scenes while studying\nwith the well-known landscape painter Jean-Baptiste Camille Corot. Berthe Morisot worked with Corot, who became a family friend, from 1862 to 1868. She first\nexhibited her paintings at the prestigious state-run art show, the Salon, in 1864, and her work was shown there regularly for the next decade..\nMorisot was greatly influenced by her friendship with Édouard Manet, to whom she was introduced in 1868 by their fellow artist Henri Fantin-Latour. Though\nMorisot was never a pupil of Manet's, she soon abandoned aspects of Corot's teachings and destroyed almost all of her early work in favor of a more\nunconventional and modern approach, with the encouragement of Manet and others, including Edgar Degas and Frédéric Bazille. She also played an important role in Manet's career, posing for a number of his paintings-notably The Balcony (1869) and Repose (c. 1870) - and\nencouraging him to adapt some tenets of Impressionism into his work.\nBeginning in 1874, Morisot refused to show her work at the Salon, choosing to join a fledgling group of Impressionist\npainters that included Degas, who would become Morisot's lifelong friend, as well as Camille Pissarro, Pierre-Auguste\nRenoir, Claude Monet, and Alfred Sisley. Morisot agreed to take part in the first independent exhibition of Impressionist\npaintings, which opened in a photographer's studio on Paris's Boulevard des Capucines in April 1874. In doing so, she\nwent against the advice of Édouard Manet, who refused to exhibit with the Impressionists and was determined to make his\nname at the Salon. Among the paintings she showed at the exhibition were The Cradle, The Harbor at Cherbourg, Hide\nand Seek, and Reading. In December 1874, at the age of 33, Morisot married Manet's younger brother, Eugène, also a\npainter. Eugène Manet supported his wife in her work and the marriage gave Morisot social and financial stability while\nshe continued her painting career. On a census form, Morisot famously recorded herself as \"without profession,\"\nunderscoring her vision of her life and work within, not outside of, the traditional feminine sphere. She participated in all of\nthe Impressionist exhibitions save one, in 1877, when she was pregnant with her daughter, Julie, born in 1878.\nMorisot painted in oils, watercolors, and pastels, and produced numerous drawings. Her wide range of subjects included\nBerthe Morisot with a Bouquet of\nportraits (many of her sister Edma), landscapes, still lives, and the domestic scene, particularly traditional feminine\nViolets by Manet (1872)\noccupations. A particularly notable example of the latter was Woman at Her Toilette (c. 1879), which she displayed in the\nfifth Impressionist exhibition in 1880. For some of her later works, Morisot noticeably changed her style, making numerous\nsketches of a subject before beginning a painting rather than relying on spontaneous observation, as in her earlier work. Paintings that showcased her new style\nincluded The Cherry Tree (1891-92) and Girl with a Greyhound (1893). Eugène Manet died in April 1892, after a long illness. Morisot's friends and fellow artists\nrallied around her and her young daughter Julie, and she continued to work. Though never commercially successful during her lifetime, Morisot outsold several of\nher fellow Impressionists, including Monet, Renoir, and Sisley. She had her first solo exhibition in 1892 at the Boussod and Valadon gallery, where she sold a\nnumber of works, and she earned further recognition in 1894, when the French government purchased her oil painting Young Woman in a Ball Gown. In the\nwinter of 1894-95, Morisot contracted pneumonia. She died on March 2, 1895, at the age of 54. After her death, Renoir and Degas organized a retrospective of her\nwork, which garnered serious critical acclaim and ensured her place in art history as one of the founding members of the revolutionary Impressionist movement.\nPierre-Auguste Renoir (1841-1919)\nBorn February 25, 1841, in Limoges, France. Shortly after his birth, his family moved to Paris. Because he showed a remarkable talent for drawing, Renoir\nbecame an apprentice in a porcelain factory, where he painted plates. Later, after the factory had gone out of business, he worked for his older brother, decorating\nfans. Throughout these early years, Renoir made frequent visits to the Louvre, where he studied the art of earlier French masters, particularly those of the 18th\ncentury-Antoine Watteau, François Boucher, and Jean Honoré Fragonard. His deep respect for these artists informed his own painting throughout his career.\nDuring the 1870s, a revolution erupted in French painting. Encouraged by artists like Gustave Courbet and Édouard Manet, a number of young painters began to\nseek alternatives to the traditions of Western painting that had prevailed since the beginning of the Renaissance. These artists went directly to nature for their\ninspiration and into the actual society of which they were a part. As a result, their works revealed a look of freshness and immediacy that in many ways departed\nfrom the look of Old Master painting. The new art, for instance, displayed vibrant light and color instead of the somber browns and blacks that had dominated\nprevious painting. These qualities, among others, signaled the beginning of modern art.\nEarly Career\nIn 1862, Renoir decided to study painting seriously and entered the Atelier Gleyre, where he met Claude Monet, Alfred Sisley, and Jean Frédéric Bazille. During\nthe next six years, Renoir's art showed the influence of Gustave Courbet and Édouard Manet, the two most innovative painters of the 1850s and 1860s. Courbet's\ninfluence is especially evident in the bold palette-knife technique of Diane Chasseresse (1867), while Manet's can be seen in the flat tones of Alfred Sisley and His\nWife (1868). Still, both paintings reveal a sense of intimacy that is characteristic of Renoir's personal style.\nThe 1860s were difficult years for Renoir. At times he was too poor to buy paints or canvas, and the Salons of 1866 and 1867 rejected his works. The following\nyear the Salon accepted his painting Lise. He continued to develop his work and to study the paintings of his contemporaries-not only Courbet and Manet, but\nCamille Corot and Eugène Delacroix as well. Renoir's indebtedness to Delacroix is apparent in the lush painter like that of the Odalisque (1870). Renoir and\nImpressionism In 1869, Renoir and Monet worked together at La Grenouillère, a bathing spot on the Seine. Both artists became obsessed with painting light and\nwater. According to Phoebe Pool (1967), this was a decisive moment in the development of Impressionism, for \"It was there that Renoir and Monet made their\ndiscovery that shadows are not brown or black but are colored by their surroundings, and that the 'local color' of an object is modified by the light in which it is\nseen, by reflections from other objects and by contrast with juxtaposed colors.\" The styles of Renoir and Monet were virtually identical at this time, an indication\nof the dedication with which they pursued and shared their new discoveries. During the 1870s, they still occasionally worked together, although their styles\ngenerally developed in more personal directions. In 1874, Renoir participated in the first Impressionist exhibition, along with Monet, Edgar Degas, Alfred Sisley,\nCamille Pissarro, and Berthe Morisot. His works included The Opera Box (1874), a painting that shows the artist's penchant for rich and freely handled figurative\nexpression. Of all the Impressionists, Renoir most consistently and thoroughly adapted the new style-in its inspiration, essentially a landscape style-to the great\ntradition of figure painting.\nAlthough the Impressionist exhibitions were the targets of much public ridicule during the 1870s, Renoir's patronage gradually increased during the decade. He\nbecame a friend of Caillebotte, one of the first patrons of the Impressionists, and he was also backed by the art dealer Durand-Ruel and by collectors like Victor\nChoquet, the Charpentiers, and the Daidets. The artist's connection with these individuals is documented by a number of handsome portraits, for instance, Madame\nCharpentier and Her Children (1878).\nIn the 1870s, Renoir also produced some of his most celebrated Impressionist genre scenes, including The Swing and The Ball at the Moulin de la Galette (both\n1876). These works embody his most basic attitudes about art and life. They show men and women together, openly and casually enjoying a society diffused with\nwarm, radiant sunlight. Figures blend softly into one another and into their surrounding space. Such worlds are pleasurable, sensuous, and generously endowed\nwith human feeling.\nRenoir's \"Dry\" Period\nDuring the 1880s, Renoir gradually separated himself from the other Impressionists, largely because he became dissatisfied with the direction the new style was\ntaking in his own hands. In paintings like The Luncheon of the Boating Party (1881), he felt that his style was becoming too loose, that forms were losing their\ndistinctiveness and sense of mass. As a result, he looked to the past for a fresh inspiration. In 1881, he traveled to Italy and was particularly impressed by the art of Raphael. During the next six years, Renoir's paintings became increasingly dry: he began to draw in a tight, classical manner, carefully outlining his figures in an\neffort to give them plastic clarity. The works from this period, such as The Umbrellas (1883) and Les grandes baigneuses (1884-1887), are generally considered\nthe least successful of Renoir's mature expressions. Their classicizing effort seems self-conscious, a contradiction to the warm sensuality that came naturally to him.\nLate Career\nBy the end of the 1880s, Renoir had passed through his dry period. His late work is truly extraordinary: a glorious outpouring of monumental nude figures,\nbeautiful young girls, and lush landscapes. Examples of this style include The Music Lesson (1891), Young Girl Reading (1892), and Sleeping Bather (1897). In\nmany ways, the generosity of feeling in these paintings expands upon the achievements of his great work in the 1870s. Renoir's health declined severely in his later\nyears. In 1903, he suffered his first attack of rheumatoid arthritis and settled for the winter at Cagnes-sur-Mer. By this time he faced no financial problems, but the\narthritis made painting painful and often impossible. Nevertheless, he continued to work, at times with a brush tied to his crippled hand. Renoir died at Cagnes-sur-\nMer on December 3, 1919, but his death was preceded by an experience of supreme triumph: the state had purchased his portrait Madame Georges Charpentier\n(1877), and he traveled to Paris in August to see it hanging in the Louvre.\nEdouard Manet (1832-1883)\nBorn January 23, 1832 in Paris, France, to Auguste Édouard Manet, an official at the Ministry of Justice, and Eugénie Désirée Manet. Manet's father, who had\nexpected his son to study law, vigorously opposed his wish to become a painter. The career of naval officer was decided upon as a compromise, and at the age of\n16 Édouard sailed to Rio de Janeiro on a training vessel. Upon his return he failed to pass the entrance examination of the naval academy. His father relented, and\nin 1850 Manet entered the studio of Thomas Couture, where, in spite of many disagreements with his teacher, he remained until 1856. During this period, Manet\ntraveled abroad and made numerous copies after the Old Masters in both foreign and French public collections. Early Works Manet's entry for the Salon of 1859,\nThe Absinthe Drinker, a thematically romantic but conceptually daring work, was rejected. At the Salon of 1861, his Spanish Singer, one of a number of works of\nSpanish character painted in this period, not only was admitted to the Salon but won an honorable mention and the acclaim of the poet Théophile Gautier. This\nwas to be Manet's last success for many years.\nIn 1863, Manet married Suzanne Leenhoff, a Dutch pianist. That year he showed 14 paintings at the Martinet Gallery; one\nof them, Music in the Tuileries, remarkable for its freshness in the handling of a contemporary scene, was greeted with\nconsiderable hostility. Also in 1863, the Salon rejected Manet's large painting Le Déjeuner sur l'herbe, or Luncheon on the\nGrass, and the artist elected to have it shown at the now famous Salon des Refusés, created by the emperor under the\npressure of the exceptionally large number of painters whose work had been turned away. Here, Manet's picture attracted\nthe most attention and brought forth a kind of abusive criticism that was to set a pattern for years to come.\nIn 1865, Manet's Olympia produced a still more violent reaction at the official Salon, and his reputation as a renegade\nbecame widespread. Upset by the criticism, Manet made a brief trip to Spain, where he admired many works by Diego\nVelázquez, to whom he referred as \"the painter of painters.\"\nLe déjeuner sur l'herbe by Manet\n(1863)\nSupport of Baudelaire and Zola\nManet's close friend and supporter during the early years was Charles Baudelaire, who, in 1862, had written a quatrain to accompany one of Manet's Spanish\nsubjects, Lola de Valence, and the public, largely as a result of the strange atmosphere of the Olympia, linked the two men readily. In 1866, after the Salon jury had\nrejected two of Manet's works, Émile Zola came to his defense with a series of articles filled with strongly expressed, uncompromising praise. In 1867, he\npublished a book that contains the prediction, \"Manet's place is destined to be in the Louvre.\" This book appears on Zola's desk in Manet's portrait of the writer\n(1868). In May of that year, the Paris World's Fair opened its doors, and Manet, at his own expense, exhibited 50 of his works in a temporary structure, not far\nfrom Gustave Courbet's private exhibition. This was in keeping with Manet's view, expressed years later to his friend Antonin Proust, that his paintings must be\nseen together in order to be fully understood.\nAlthough Manet insisted that a painter be \"resolutely of his own time\" and that he paint what he sees, he nevertheless produced two important religious works,\nDead Christ with Angels and Christ Mocked by the Soldiers, which were shown at the Salons of 1864 and 1865, respectively, and ridiculed. Only Zola could\ndefend the former work on the grounds of its vigorous realism while playing down its alleged lack of piety. It is also true that although Manet despised the\nacademic category of \"history painting\" he did paint the contemporary Naval Battle between the Kearsarge and the Alabama (1864) and The Execution of\nEmperor Maximilian of Mexico (1867). The latter is based upon a careful gathering of the facts surrounding the incident and composed, largely, after Francisco\nGoya's Executions of the Third of May, resulting in a curious amalgam of the particular and the universal. Manet's use of older works of art in elaborating his own\nmajor compositions has long been, and continues to be, a problematic subject, since the old view that this procedure was needed to compensate for the artist's own\ninadequate imagination is rapidly being discarded.\nLate Works\nAlthough Manet influenced the Impressionists during the 1860s, during the next decade it appears that it was he who learned from them. His palette became\nlighter; his stroke, without ever achieving the analytical intensity of Claude Monet's, was shorter and more rapid. Nevertheless, Manet never cultivated plein-airism\nseriously, and he remained essentially a figure and studio painter. Also, despite his sympathy for most of the Impressionists with whom the public associated him,\nhe never exhibited with them at their series of private exhibitions, which began in 1874. He was particularly close to the female Impressionist Berthe Morisot,\nwhom he met in 1868. Manet was a great influence on Morisot, and she in turn helped him accept some of the tenets of Impressionism to greater effect in his work;\nshe also posed for him numerous times, notably for The Balcony (1869) and Repose (c. 1870). In 1874, Morisot married Manet's younger brother, Eugéne, also a\npainter. Manet had his first resounding success since The Spanish Singer at the Salon of 1873 with his Bon Bock, which radiates a touch and joviality of\nexpression reminiscent of Frans Hals, in contrast to Manet's usually austere figures. In spite of the popularity of this painting, his success was not to extend to the\nfollowing season. About this time he met the poet Stéphane Mallarmé, with whom he remained on intimate terms for the remainder of his life. After Manet's\nrejection by the jury in 1876, Mallarmé took up his defense.\nToward the end of the 1870s, although Manet retained the bright palette and the touch of his Impressionist works, he returned to the figure problems of the early\nyears. The undeniable sense of mystery is found again in several bar scenes, notably the Brasserie Reichshoffen, in which the relationships of the figures recall\nthose of Luncheon on the Grass. Perhaps the apotheosis of his lifelong endeavors is to be found in his last major work, A Bar at the Folies-Bergère (1881-1882).\nHere, in the expression of the barmaid, is all the starkness of the great confrontations of the 1860s, but bathed in a profusion of colors. While we are drawn to the\nbrilliantly painted accessories, it is the girl, placed at the center before a mirror, which dominates the composition and ultimately demands our attention. Although\nher reflected image, showing her to be in conversation with a man, is absorbed into the brilliant atmosphere of the setting, she remains enigmatic and aloof. Manet\nproduced two aspects of the same personality, combined the fleeting with the eternal, and, by \"misplacing\" the reflected image, took a step toward abstraction as a solution to certain lifelong philosophical and technical problems. In 1881, Manet was finally admitted to membership in the\nLegion of Honor, an award he had long coveted. By then he was seriously ill. Therapy at the sanatorium at Bellevue failed\nto improve his health, and walking became increasingly difficult for him. In his weakened condition he found it easier to\nhandle pastels than oils, and he produced a great many flower pieces and portraits in that medium. In the spring of 1883,\nhis left leg was amputated, but this did not prolong his life. He died peacefully in Paris on April 30. Manet was short,\nunusually handsome, and witty. His biographers stress his kindness and unaffected generosity toward his friends. The\nparadoxical elements in his art are an extension of the man: although a revolutionary in art, he craved official honors; while\nfashionably dressed, he affected a Parisian slang at odds with his appearance and impeccable manners; and although he\nespoused the style of life of the conservative classes, his political sentiments were those of the republican liberal.\nLe Bar des Folies-Bergère by Manet\nBibliography (1881-1882). Notably, this painting\nmay be among the first examples of\nImpressionism: Reflections and Perceptions, by Meyer Schapiro. Scholarly, yet accessible, with product placement in art.[1]\noutstanding quality reproductions.\nStudies in Impressionism, by John Rewald. Another great art history writer, this is a series of essays.\nArt in the Making: Impressionism, by David Bomford. An interesting technical approach to the study of Impressionist paintings.\nImpressionists Side by Side: Their Friendships, Rivalries, and Artistic Exchanges, by Barbara White. Approaches the study of\nImpressionism from the personal relationships of the painters.\nOrigins of Impressionism, the catalog from the Metropolitan Museum of Art exhibition. Excellent illustrations and text provide a background\nof the precursors of the Impressionists, Manet, Corot, Courbet, et al.\nPainting of Modern Life: Paris in the Art of Manet and His Followers, T.J. Clark's masterpiece looks at the Impressionist movement from\nthe social context of Paris in the 1870s.\nArt in Theory 1900-2000: An Anthology of Changing Ideas ,Charles Harrison (editor). A great anthology of texts from the 19th and 20th\ncentury by artists and art historians.\nReferences\n1. Grovier, Kelly. \"A Bar at the Folies-Bergere: A symbol planted in cleavage\". www.bbc.com. Retrieved 22 November 2020.\nMajor Artwork of this time\nPost Impressionism-visible brushstrokes, similar to impressionism, but greater use of arbitrary color and crowded compositions\nProminent Artists\nPaul Cézanne\nPaul Gauguin\nHenri Rousseau\nGeorges Seurat\nHenri de Toulouse-Lautrec\nVincent van Gogh\nThe Fauve Movement-short lived art movement known for its intense colors\nProminent Artists\nHenri Matisse\nAndré Derain\nGeorges Braque\nRaul Dufy\nGeorges Rouault\nMaurice de Vlaminck\nCubism-analytical and synthetic\nProminent Artists\nGeorges Braque\nPablo Picasso\nJuan Gris\nSurrealism-emphasized emotion, reality skewed, a reaction to the creation of realistic photography\nProminent Artists\nSalvador Dalí\nRené Magritte\nMax Ernst Joan Miró\nGallery\nHudson River School\nThe Oxbow by Thomas Cole - 1836.\nArchitect’s Dream by Thomas Cole - 1840. Starrucca Viaduct by Jasper Francis Cropsey - 1865.\nAmong the Sierra Nevada, California by Albert Bierstadt - 1868.\nImpressionism, Post-Impressionism, Neo-Impressionism, and Pointillism\nWoman with a Parasol by Claude Café Terrace at Night by Vincent van Starry Night by Vincent van Gough - 1889. An example of\nMonet - 1875. An example of Gough - 1888. Post-Impressionism.\nImpressionism Starry Night Over the Rhône by Vincent van Gough - 1889. An A Sunday Afternoon on the Island of La Grande Jatte by Georges Seurat\nexample of Post-Impressionism. - 1884. An example of Pointillism.\nOpus 217. Against the Enamel of a Background Rhythmic Self Portrait by Vincent van Gogh -\nwith Beats and Angles, Tones, and Tints, Portrait of M. Félix 1887. An example of Pointillism.\nFénéon in 1890 by Paul Signac - 1890. An example of Neo-\nImpressionism and Pointillism.\nParade de cirque by Georges Seurat - 1887-1888. An example of Neo-\nImpressionism and Pointillism.\nRomanticism Ossian receiving the Ghosts of the French Napoleon Crossing the Alps by The Morning by Philipp Otto Runge -\nHeroes attributed to Anne-Louis Girodet de Jacques-Louis David - 1801. 1808.\nRoussy-Trioson - 1801.\nThe Third of May by Francisco Goya. This event refers to an Wanderer above the sea of fog by\nevent in 1808. Painted in 1814. Caspar David Friedrich - 1817. Portrait of Ludwig van Beethoven when Saturn Devouring his Son Liberty Leading the People by Eugène Delacroix - 1830.\ncomposing the Missa Solemnis by by Francisco Goya -\nJoseph Karl Stieler - 1820. Between 1819 and 1823.\nPoem of the Soul - On the mountain by Louis Janmot - 1854.\nOther\nReprint of The Great Wave off Kanagawa by Katsushika Hokusai - The Meeting, or Bonjour, Monsieur Courbet! by Gustave\nbetween 1826 and 1833. Courbet - 1854. Jewish woman selling oranges by Halévy Street, View from the Seventh Floor by Gustave\nAleksander Gierymski. Painted between Caillebotte - 1877.\n1880 and 1881.\nThe Wailing Wall by J.L. Gerome - The Geography Lesson or \"The Black Spot\" by Albert Bettannier -\n1880. 1887\nThe Scream by Edvard Munch - 1893.\nArchitecture The White House Neoclassical and Palladian architecture finished in\n1800.\nUS Capitol - 1800.\nArc de Triomphe Neoclassical architecture between 1806 and 1836. The Palace of Westminster, this iconic iteration of the structure was\nrebuilt in the mid 1800's after the earlier structure was destroyed by fire.\nPalais Garnier - 1875. Washington Monument Obelisk -\n1884.\nBrooklyn Bridge - 1883. Statue of Liberty by\nFrédéric Auguste\nBartholdi - 1886. ʻIolani Palace A prime example of Hawaiian architecture - 1879. Tour Eiffel Now an iconic\nsymbol of France, this\n1889 structure was\ncontroversial at the time.\nTower Bridge - 1894\nFilm\nPauvre Pierrot, one of the earliest\nanimated films. Hand painted\nframes. 1892. 20th Century\nThe twentieth century has seen huge changes in the modes and meanings of artistic production that mirror the enormous social changes that have occurred\nduring the same time period. Continuing with the break with the academic values such as the hierarchy of genres, many movements and many countries re-\nevaluated aesthetics, technique, color, media, meaning, and many other aspects of artistic enterprise. Technology has had not only an indirect impact on artists, but\noften is the subject matter, or even the media that artists have worked with.\nThe Impressionists, at the end of the nineteenth century, who championed landscape painting and revolutionized technique and use of color, helped to open the\nfloodgates for many more movements (not all of which identified themselves as such). The Secession movement, Fauvism, Cubism, Expressionism, Dada, The\nBauhaus, Futurism, Surrealism, Suprematism, De Stijl, Abstract Expressionism, Pop Art, Op Art, Minimalism, and the Postmodern are some of the major\nmovements that have shaped the century and changed our very conceptions of what art is.\nSecessionist movement\nThe Secessionist movement was the Austrian branch of a larger movement known primarily as Art Nouveau (\"new art\").\nDepending on the country, the style is also known as Jugendstil (Germany), Style Liberty (Italy), Modernisme (Spain), or\nLatvian Romanticism. Art Nouveau is an umbrella term but also refers to works of this style produced in France and\nBelgium. Art Nouveau has its roots in the English Arts and Crafts movement of the 19th century; in fact, certain artists, like\nCharles Rennie Mackintosh, work in both styles. The purpose of Art Nouveau was to create what is known as a complete\nwork of art - a work that includes painting, drawing and printmaking as well as applied arts and architecture. For this\nreason, some of the most beautiful and informative Art Nouveau works are complete rooms or houses where every object\nwithin is executed in Art Nouveau style. Art Nouveau is characterized by free-flowing floral, vegetal, and other typically\nfeminine motifs. It also features a kind of romantic mysticism that can be traced back to the Pre-Raphaelite and Symbolist\nmovements of the 19th century. Some well-known Art Nouveau artists and craftsmen include Alphonse Mucha (Czech), an\naccomplished printmaker and painter; Antoni Gaudi (Spanish), whose architectural works dot Barcelona; Hector Guimard\n(French), whose wrought-iron entrances for the Paris metro have become his legacy; Gustav Klimt (Austrian), who led the\nThe Kiss by Gustav Klimt - 1907- Austrian Secessionists with his opulent and complex paintings; and Louis Comfort Tiffany (American), who is well-known\n1908. for his distinctive stained-glass work.\nFauvism\nFauvism, whose name derives from the French word for \"wild beast,\" was a Primitivist movement centered in Paris in the\nfirst decade of the 20th century. The most well-known Fauvist artists are Henri Matisse and Andre Derain. The large blocks\nof color and simplified forms Fauvist artists used undoubtedly influenced the Cubist movement, which overlapped Fauvism\nby a few years.\nCubism\nThe Father of Cubism is said to be Cezanne. Pablo Picasso, a Spanish artist, who\nhad many phases in his long career, picked up the gauntlet of Cubism. His famous\n\"Demoiselles d'Avignon\" of 1907, housed in the Museum of Modern Art in New\nYork, depicts five nude women, possibly prostitutes, in an interior. The painting is\nprimitivistic - Picasso synthesized his well-documented interest in African masks\ninto the faces of the figures. The fragmentation and flattening of the figures also\nanticipates the development of analytical Cubism a few years later. One of the\nSpaniard's most socio-political cubist paintings is \"Guernica\" of 1937, his grey,\nblack and white portrait of the horrors of war. The basque town of Guernica was\nbombed by the German Luftwaffe on April 26, 1937.[1] (https://en.wikipedia.org/w\niki/Bombing_of_Guernica) L'homme à la tulipe (Portrait de Jean\nMetzinger) Fauvist painting by Jean\nAnother founding member of the Cubist movement was Georges Braque, a French\nMetzinger - 1906.\nartist whose analytical Cubist work from the 1910s is quite similar to Picasso's.\nBraque and Picasso worked together closely, and Braque's influence on Picasso\nA cubist Portrait of Pablo Picasso, (and vice versa) should not be downplayed. Other major artists of the analytical Cubist movement include Juan Gris,\ndone by Juan Gris. whose interest in mathematics made his art more regularized, and less fragmented, than Picasso's; Marcel Duchamp, whose\nearly, pre-readymade works such as \"Nude Descending a Staircase\" are highly fragmented and undeniably Cubist; Jean\nMetzinger; and Albert Gleizes.\nDadaism\nDadaism was a German-French-American movement of the 1920s up to the 1960s which was a reaction to the horrors of\nWorld War I; it incorporated wordplay (largely nonsensical) and collage. It was founded by the poet and playwright Tristan\nTzara in the Cabaret Voltaire, France. Major members included Francis Picabia, Hugo Ball, Hannah Höch, and Marcel\nDuchamp.\nFuturism\n1920 Dada exhibition in Berlin. Futurism was an Italian movement in the 1910s and 1920s that was based on a fascination with movement, technology, and machinery. Major members included\nthe founder Filippo Marinetti (Zang Tumb Tumb; poem), Umbertro Boccioni (Unique Forms of Continuity in Space; sculpture) and Giacomo Balla (Dynamism of\na Dog on a Leash; painting), the latter two both painters and sculptors.\nVorticism\nVorticism was an English movement of the 1910s; it was founded by writer and painter Wyndham Lewis as a reaction to\nFuturism.\nThe movement officially began in 1914, in the first issue of literary magazine BLAST, but ended after the main members\nwitnessed (or died in) World War I. The war painter Christopher Richard Wynne Nevinson was briefly involved, but was\nlater expelled from the group and became identified as a Futurist. Sculptor Jacob Epstein was not formally involved, but his\nTorso in Metal from Rock Drill is regarded as a major Vorticist work.\nMajor members included David Bomberg (The Mud Bath; painting), Edward Wadsworth (Dazzle-ships in Drydock at\nLiverpool; painting), Henri Gaudier-Brzeska (Vortex (written from the trenches); essay) and Ezra Pound (Vortex; essay).\nPostmodernism\nPostmodern artist Barbara Kruger is known for critical images inspired by commercial advertising. She is the author of\nseveral books. \"Love for Sale\" shows Kruger's blown up photographic black and white images with text in a red box\nThe Vorticist Dazzle-ships in\nsuperimposed creating a new meaning for the viewer. Kruger taught at the Art Institute and Cal Arts during the 70s.\nDrydock at Liverpool\nKruger's work often focuses on feminist issues. Kruger's Whitney Biennial 2'x3' work, enlarged as she tackled billboards in\nthe US and other countries.\nShe was the subject of a lecture given at the 3rd Annual Conference of the Society of the Word and Image at Carleton University in Ontario, Canada in 1993.\nAbstract Expressionism\nA school of painting that flourished after World War II until the early 1960s, characterized by the view that art is nonrepresentational and chiefly improvisational.\nAbstract art is defined as art that has no reference to any figurative reality. In its wider definition the term describes art that depicts real forms in a simplified or\nrather reduced way - keeping only an allusion of the original natural subject. The abstract paintings of Joan Miró are a good example of this wider definition. The\nterm non-figurative is used as a synonym.\nIn the twentieth century Wassily Kandinsky is considered as the inventor of non-figurative art. Over a period of several years his paintings moved gradually away\nfrom figurative subjects. In 1910 he created the first completely abstract work of art - a watercolor - without any reference to reality. Wassily Kandinsky not only\nbecame the first abstract artist, he also promoted it as a theorist. In 1912 his book On the Spiritual in Art was published. A movement of abstract painting that emerged in New York City during the mid-1940s and attained singular prominence in American art in the following decade;\nalso called action painting and the New York school. Jackson Pollock 's turbulent yet elegant abstract paintings, which were created by spattering paint on huge\ncanvases placed on the floor, brought abstract expressionism before a hostile public. Willem de Kooning 's first one-man show in 1948 established him as a highly\ninfluential artist. Other important artists involved with the movement included Hans Hofmann , Robert Motherwell , and Mark Rothko ; among other major\nabstract expressionists were such painters as Clyfford Still , Theodoros Stamos, Adolph Gottlieb, Helen Frankenthaler, Lee Krasner, and Esteban Vicente.\n20th Century Art Gallery\n1900-1920\nThe Capture of the Forts at Taku by Fritz Portrait of Adele Bloch-Bauer I by Simultaneous Windows on the\nNeumann (Between 1900 and 1919) Gustav Klimt - 1907. City Abstract Cubist painting by\nRobert Delaunay - 1912.\nPortrait of Wally Neuzil by Egon Schiele - Slavs in their Original Homeland: Between the The Virgin by Gustav Klimt - 1913\n1912. Turanian Whip and the Sword of the Goths by\nAlphonse Mucha - 1912\nPainting No. 48. by Marsden Form and Light, Motif in West New Jersey by Portrait of a German Vorticist Study by Edward\nHartley - 1913. An example of Oscar Florianus Bluemner - 1914. An Officer by Marsden Wadsworth - 1914\nAmerican Modernism. example of American Modernism. Hartley - 1914. An\nexample of\nAmerican\nModernism. Spirit of Black Square by Kazimir Malevich Interior of a Studio by Sigrid Hjertén -\nCommunications - 1915. 1916\nBronze statue by\nEvelyn Beatrice\nLongman - 1914-\n1916.\nBermuda No. 2, The Schooner Cubist and Fountain by Marcel Synchromy No. 3 by Stanton\nFuturist art by Charles Demuth - 1917. Duchamp - 1917. Macdonald-Wright - 1917. An\nexample of Synchromism.\n1920-1945\nAbraham Lincoln Marble statue by Daniel Chester Asbury Park South by Florine Stettheimer Bauhausausstellung\nFrench - 1920. - 1920. An example of Jazz Age inspired Bauhaus style by Joost\nartwork. Schmidt - 1923. On White II by Vassily I Saw the Figure 5 in Gold American Gothic Social The Slav Epic Makeup through the Window\nKandinsky - 1923. Cubist and Futurist art by Realism painting by Grant Poster by by Harue Koga - 1930. An\nCharles Demuth - 1928. Wood - 1930. Alfons Mucha - example of Japanese\n1930 surrealism.\nChrist the Redeemer 4 of 8 Guardians of Traffic art deco sculptures by Chicago World's Fair\nstatue - 1931. Henry Hering and Frank Walker ~ 1932. art deco poster - 1933.\nWorkers Sorting the Mail Art Deco mural by Reginald Marsh - Nighthawks by Edward Hopper - 1942.\n1936.\n1945-1970\nspiralis by Roberto Crippa - Jazz by Ernani Costantini - Spirit of Detroit bronze Welcome to Fabulous Las Vegas sign, an\n1953. An example of Spatialism. 1956. statue by Marshall iconic example of Googie style - 1959.\nFredericks - 1958. Picture by Drawing Machine Miriam Laufer with IKB 191 Minimalist work David Smith, Cubi VI -\n1, by Desmond Paul Henry - paining in 1962. by Yves Klein - 1962 1963.\n1962.\nOur Life, an East German mural in the social realism style - 1964.\nLeyendo las noticias by Marta Who's Afraid of Red, Poster in the\nMinujín - 1965. An example of Yellow, and Blue I International\nHappening performance art. Minimalist artwork by Typographical Style -\nBarnett Newman - 1969.\n1966.\n1970-1999\nThe Rainbow by Salvador Dali - 1972. AA78 a painting in the Fantastic\nRealism style by Zdzisław\nBeksiński - 1978. Meteorite by Milton Becerra - 1985. An example of the Rite of Spring by Ronnie Landfield - 1985. An Homage to Newton, a\n\"Land Art\" style. example of the Color field style of abstract surrealist sculpture by\npainting. Salvador Dali - 1985.\nArchitecture\nPorte Dauphine station of the Paris Métro, an Art Moana Hotel - 1901. Sacré-Cœur- 1919.\nNouveau building - 1900.\nEmpire State Building Cincinnati Union Terminal Art Deco train station - Frank Loyd Wright\nArt deco architecture - 1933. sketches for Broadacre\n1931. City.\nGolden Gate Bridge Art Deco bridge - 1937. Jefferson Memorial - 1943. Tokyo Tower - 1958. Solomon R. Guggenheim Museum Modern Space Needle - Theme Building - 1961.\narchitecture by Frank Loyd Wright - 1959. 1961.\nMontreal Biosphere - 1967. Gateway Arch - 1967. Cathedral of Brasília - 1970. World Trade Center\nNew Formalism\narchitecture - 1973.\nSydney Opera House Modernist expressionist architecture - Willis Tower/Sears\n1973. Tower International\narchitectural style -\n1974.\nOlympic Stadium in Montréal - 1970's-1980's. Bank of China Petronas Towers\nTower - 1990. Postmodern Islamic\nArchitecture - 1999.\nPhotography Early high quality color photograph - 1911. Lunch atop a Skyscraper - 1932. Migrant Mother by Dorothea\nLange - 1936.\nHindenburg disaster - 1937. Raising the Flag on Iwo Jima - 1945. Raising a flag over the Reichstag - 1945. Guerrillero Heroico - 1960. Earthrise - 1968\nBuzz Aldrin on the Moon - 1969. Blue Marble - 1972. Pillars of Creation - 1995.\nFilm\n0:00 0:00 0:00\nA Trip to the Moon, a film directed by Georges The Great Train Robbery - 1903. Gertie the Dinosaur - 1914\nMéliès - 1902.\n0:00\n0:00\n0:00\nThe Bond - 1918.\nFeline Follies - 1919.\nManhatta by Paul Strand - 1921. The 20th\ncentury saw photography and videography\ntake great advances in artistic expression. 0:00 0:00 0:00\nThe General - 1926. Don Juan introduced synchronized recording The Fifth-Column Mouse an example of a\nmusic with film - 1926. wartime propaganda film - 1943. 21st Century The 21st century in artwork is hallmarked by the use of advanced technology and production techniques in the creation of art. Many of these technologies enabled\ncreators to create works which would have been previously difficult or impossible to perform just decades before. Some of these technologies included computer\nrendering, 3D printing, and the use of novel materials such as vantablack by the sculptor Anish Kapoor. It is important to note that traditional works and methods\ndid not disappear during this time, though in some genres such as animation, their use rapidly declined due to becoming commercially nonviable.\nGallery\nWorks\nGraham by Kristoffer Zetterstrand - 2003.\nArchitecture\nWalt Disney Concert Hall - 2003. Taipei 101 Postmodern skyscraper 30 St Mary Axe - 2004.\n- 2004. Beijing National Stadium Postmodern High-Tech architecture - 2008.\nMarina Bay Sands - 2010. Tokyo Skytree - 2012.\nOne Central Park with hanging gardens - 2013. One World Trade Center -\n2014.\nPhotography Situation Room, Iconic photograph - 2011. First direct photo of a Black Hole, Iconic\nphotograph - 2019.\nAnimation\n0:00 0:00\nElephants Dream - An example of 3D computer animation Big Buck Bunny - An example of 3D computer animation\ntypical of the mid 2000s - 2006. typical of the late 2000s - 2008.\n0:00\nCosmos Laundromat: First Cycle - An example of 3D computer animation typical of\nthe mid 2010s - 2015.\n0:00\nSprite Fright - An example of a 3D computer animation typical of the early 2020s -\n2022.  Glossary\nArt Movements\nabstract expressionism Movement in painting, originating in New York City in the 1940s. It emphasized spontaneous personal expression, freedom from\naccepted artistic values, surface qualities of paint, and the act of painting itself. Pollock, de Kooning, Motherwell, and Kline, are important abstract expressionists.\nart deco Design style prevalent during the 1920s and 1930s, characterized by a sleek use of straight lines and slender form.\nart nouveau A decorative art movement that emerged in the late nineteenth century. Characterized by dense asymmetrical ornamentation in sinuous forms, it is\noften symbolic and of an erotic nature. Klimt worked in an art nouveau style.\nAsh Can School Group of American artists active from 1908 to 1918. It included members of The Eight such as Henri and Davies; Hopper was also part of the\nAsh Can group. Their work featured scenes of urban realism.\nBarbizon School An association of French landscape painters, c. 1840-70, who lived in the village of Barbizon and who painted directly from nature. Theodore\nRousseau was a leader; Corot and Millet were also associated with the group.\nBaroque A movement in European painting in the seventeenth and early eighteenth centuries, characterized by violent movement, strong emotion, and dramatic\nlighting and coloring. Bernini, Caravaggio and Rubens were among important baroque artists.\nByzantine A style of the Byzantine Empire and its provinces, c. 330-1450. Appearing mostly in religious mosaics, manuscript illuminations, and panel paintings, it\nis characterized by rigid, monumental, stylized forms with gold backgrounds.\nclassicism Referring to the principles of Greek and Roman art of antiquity with the emphasis on harmony, proportion, balance, and simplicity. In a general sense, it\nrefers to art based on accepted standards of beauty.\ncolor field painting A technique in abstract painting developed in the 1950s. It focuses on the lyrical effects of large areas of color, often poured or stained onto\nthe canvas. Newman, Rothko, and Frankenthaler painted in this manner.\nconceptual art A movement of the 1960s and 1970s that emphasized the artistic idea over the art object. It attempted to free art from the confines of the gallery\nand the pedestal.\nconstructivism A Russian abstract movement founded by Tatlin, Gabo, and Antoine Pevsner, c. 1915. It focused on art for the industrial age. Tatlin believed in art\nwith a utilitarian purpose.\ncubism A revolutionary movement begun by Picasso and Braque in the early twentieth century. It employs an analytic vision based on fragmentation and multiple\nviewpoints.\ndadaism A movement, c. 1915-23, that rejected accepted aesthetic standards. It aimed to create antiart and nonart, often employing a sense of the absurd. The\nEight A group of American painters who united out of opposition to academic standards in the early twentieth century. Members of the group were Robert Henri,\nArthur Davies, Maurice Prendergast, William James Glackens, Ernest Lawson, Everett Shinn, John Sloan, and George Luks.\nexcessivism Refers to the contemporary consumer’s urge to go beyond what is needed and beyond one’s means when acquiring material goods. The works, based\non excessive tendencies, are a commentary in and of themselves on materialism. The inaugural exhibition of was held in 2015 at the LA Artcore Gallery, Los\nAngeles, Calif., curated by Kaloust Guedel, author of the Excessivism Manifesto.\nexpressionism Refers to art that uses emphasis and distortion to communicate emotion. More specifically, it refers to early twentieth century northern European art,\nespecially in Germany c. 1905-25. Artists such as Rouault, Kokoschka, and Schiele painted in this manner.\nfauvism From the French word fauve , meaning \"wild beast .\" A style adopted by artists associated with Matisse, c. 1905-08. They painted in a spontaneous\nmanner, using bold colors.\nfolk art Works of a culturally homogeneous people without formal training, generally according to regional traditions and involving crafts.\nfuturism An Italian movement c. 1909-19. It attempted to integrate the dynamism of the machine age into art. Boccioni was a futurist artist.\nGothic A European movement beginning in France. Gothic sculpture emerged c. 1200, Gothic painting later in the thirteenth century. The artworks are\ncharacterized by a linear, graceful, elegant style more naturalistic than that which had existed previously in Europe.\nimpressionism A late-nineteenth-century French school of painting. It focused on transitory visual impressions, often painted directly from nature, with an\nemphasis on the changing effects of light and color. Monet, Renoir, and Pissarro were important impressionists.\nmannerism A style, c. 1520-1600, that arose in reaction to the harmony and proportion of the High Renaissance. It featured elongated, contorted poses, crowded\ncanvases, and harsh lighting and coloring.\nminimalism A movement in American painting and sculpture that originated in the late 1950s. It emphasized pure, reduced forms and strict, systematic\ncompositions.\nNabis From the Hebrew word for \"prophet.\" A group of French painters active in the 1890s who worked in a subjective, sometimes mystical style, stressing flat\nareas of color and pattern. Bonnard and Vuillard were members.\nnaive art Artwork, usually paintings, characterized by a simplified style, nonscientific perspective, and bold colors. The artists are generally not professionally\ntrained. Henri Rousseau and Grandma Moses worked in this style.\nneoclassicism A European style of the late eighteenth and early nineteenth centuries. Its elegant, balanced works revived the order and harmony of ancient Greek\nand Roman art. David and Canova are examples of neoclassicists.\nop art An abstract movement in Europe and the United States, begun in the mid-1950s, based on the effects of optical patterns. Albers worked in this style. photorealism A figurative movement that emerged in the United States and Britain in the late 1960s and 1970s. The subject matter, usually everyday scenes, is\nportrayed in an extremely detailed, exacting style. It is also called superrealism, especially when referring to sculpture.\npointillism A method of painting developed by Seurat and Paul Signac in the 1880s. It used dabs of pure color that were intended to mix in the eyes of viewers\nrather than on the canvas. It is also called divisionism or neoimpressionism.\npop art A movement that began in Britain and the United States in the 1950s. It used the images and techniques of mass media, advertising, and popular culture,\noften in an ironic way. Works of Warhol, Lichtenstein, and Oldenburg exemplify this style.\npostimpressionism A term coined by British art critic Roger Fry to refer to a group of nineteenth-century painters, including Cézanne, Van Gogh, and Gauguin,\nwho were dissatisfied with the limitations of expressionism. A movement in France that represented both an extension of Impressionism and a rejection of that\nstyle's inherent limitations.It has since been used to refer to various reactions against impressionism, such as fauvism nd expressionism.From the 1880s several\nartists began to develop different principles for the use of color, pattern, form and line, derived from the Impressionist.\nPre-Raphaelite Brotherhood A group of English painters formed in 1848. These artists attempted to recapture the style of painting preceding Raphael. They\nrejected industrialized England and focused on painting from nature, producing detailed, colorful works. Rossetti was a founding member.\nrealism In a general sense, refers to objective representation. More specifically, a nineteenth century movement, especially in France, that rejected idealized\nacademic styles in favor of everyday subjects. Daumier, Millet, and Courbet were realists.\nRenaissance Meaning \"rebirth\" in French. Refers to Europe c. 1400-1600. Renaissance art which began in Italy, stressed the forms of classical antiquity, a realistic\nrepresentation of space based on scientific perspective, and secular subjects. The works of Leonardo, Michelangelo, and Raphael exemplify the balance and\nharmony of the High Renaissance (c. 1495-1520).\nrococo An eighteenth-century European style, originating in France. In reaction to the grandeur and massiveness of the baroque, rococo employed refined, elegant,\nhighly decorative forms. Fragonard worked in this style.\nRomanesque A European style developed in France in the late eleventh century. Its sculpture is ornamental, stylized and complex. Some Romanesque frescoes\nsurvive, painted in a monumental, active manner.\nromanticism A European movement of the late eighteenth to mid nineteenth century. In reaction to neoclassicism, it focused on emotion over reason, and on\nspontaneous expression. The subject matter was invested with drama and usually painted energetically in brilliant colors. Delacroix, Gericault, Turner, and Blake\nwere Romantic artists.\nsuprematism A Russian abstract movement originated by Malevich c. 1913. It was characterized by flat geometric shapes on plain backgrounds and emphasized\nthe spiritual qualities of pure form.\nsurrealism A movement of the 1920s and 1930s that began in France. It explored the unconscious, often using images from dreams. It used spontaneous\ntechniques and featured unexpected juxtapositions of objects. Magritte, Dali, Miro, and Ernst painted surrealist works.\nsymbolism A painting movement that flourished in France in the 1880s and 1890s in which subject matter was suggested rather than directly presented. It featured\ndecorative, stylized, and evocative images. Movements\nGlossary of Art Movements\nAbstract Expressionism\nAmerican art movement of the 1940s that emphasized form and color within a non-representational framework. Jackson Pollock initiated the revolutionary\ntechnique of splattering the paint directly on canvas to achieve his interpretation of perfection.\nArt Deco\nA 1920s style characterized by setbacks, zigzag forms, and the use of chrome and plastic ornamentation. New York's Chrysler Building is an architectural example\nof the style.\nArt Nouveau\nAn 1890s style in architecture, graphic arts, and interior decoration characterized by writhing forms, curving lines, and asymmetrical organization. Some critics\nregard the style as the first stage of modern architecture.\nAshcan School\nA group of New Jersey realist artists at the beginning of the twentieth century who rejected the formal subject matter of the academy and focused on gritty urban\nscenes and ordinary, even ugly, aspects of life.\nAssemblage (Collage)\nForms of modern sculpture and painting utilizing readymades, found objects, and pasted fragments to form an abstract composition. Louise Nevelson's boxlike\nenclosures, each with its own composition of assembled objects, illustrate the style in sculpture. Pablo Picasso and Braque developed the technique of cutting and\npasting natural or manufactured materials to a painted or unpainted surface.Picasso incorporated elements such as wallpaper pieces and chair caneing.\nBarbizon School (Landscape Painting)\nA group of 19th-century French painters who rejected idealized landscape painting and sought a more informal, realistic portrayal of nature. They were heavily\ninfluenced by 17th-century Dutch genre painting. Theodore Rousseau, one of the principal figures of the group, was a proponent of outdoor painting, based on\ndirect observation of one's surroundings.\nBaroque\nEuropean art and architecture of the 17th and 18th centuries. Giovanni Bernini, a major exponent of the style, believed in the union of the arts of architecture,\npainting, and sculpture to overwhelm the spectator with ornate and highly dramatized themes. Although the style originated in Rome as the instrument of the\nChurch, it spread throughout Europe in such monumental creations as the Palace of Versailles.\nBeaux Arts\nElaborate and formal architectural style characterized by symmetry and an abundance of sculptured ornamentation. New York's old Custom House at Bowling\nGreen is an example of the style.\nBlack or African-American Art\nThe work of American artists of African descent produced in various styles characterized by a mood of protest and a search for identity and historical roots. See\nRomare Bearden.\nClassicism\nA form of art derived from the study of Greek and Roman styles characterized by harmony, balance, and serenity. In contrast, the Romantic Movement gave free\nrein to the artist's imagination and to the love of the exotic.\nConceptual art\nAn art form originating in the late 1960´s. In conceptual art, the idea or concept is the most important aspect of the work. It has had a prominent effect on art\nproduction and art theory until this day.\nConstructivism A form of sculpture using wood, metal, glass, and modern industrial materials expressing the technological society. The mobiles of Alexander Calder are examples\nof the movement.\nCubism\nEarly 20th-century French movement marked by a revolutionary departure from representational art. Pablo Picasso and Georges Bracque penetrated the surface of\nobjects, stressing basic abstract geometric forms that presented the object from many angles simultaneously.\nDada\nA product of the turbulent and cynical post-World War I period, this anti-art movement extolled the irrational, the absurd, the nihilistic, and the nonsensical. The\nreproduction of Mona Lisa adorned with a mustache is a famous example. The movement is regarded as a precursor of Surrealism. Some critics regard\nHAPPENINGS as a recent development of Dada. This movement incorporates environment and spectators as active and important ingredients in the production of\nrandom events.\nExpressionism\nA 20th-century European art movement that stresses the expression of emotion and the inner vision of the artist rather than the exact representation of nature.\nDistorted lines and shapes and exaggerated colors are used for emotional impact. Vincent Van Gogh is regarded as the precursor of this movement.\nFauvism\nThe name “wild beasts” was given to the group of early 20th-century French painters because their work was characterized by distortion and violent colors. Henri\nMatisse and Georges Rouault were leaders of this group.\nFuturism\nThis early 20th-century movement originating in Italy glorified the machine age and attempted to represent machines and figures in motion. The aesthetics of\nFuturism affirmed the beauty of technological society.\nGenre\nThis French word meaning “type” now refers to paintings that depict scenes of everyday life without any attempt at idealization. Genre paintings can be found in\nall ages, but the Dutch productions of peasant and tavern scenes are typical.\nImpressionism\nLate 19th-century French school dedicated to defining transitory visual impressions painted directly from nature, with light and color of primary importance. If the\natmosphere changed, a totally different picture would emerge. It was not the object or event that counted but the visual impression as caught at a certain time of\nday under a certain light. Claude Monet and Camille Pissarro were leaders of the movement.\nIndigenouism\nAn art movement promoting environmental protection by utilizing Indigenous Materials. Indigenouism Art a campaign against global warming. Indigenouism Art\nis more than just a style; it is a philosophy that encourages artists to look back to their roots and find inspiration in their culture, traditions, and environment. By\nusing natural materials that are locally available, artists can reduce their reliance on synthetic and imported materials, which contribute to the depletion of natural\nresources.\nIntentism\nA movement that began to re-establish the role of the artist in an artwork. Intentists believe that all meaning is the outworking of intention\nMannerism\nA mid-16th-century movement, Italian in origin, although El Greco was a major practitioner of the style. The human figure, distorted and elongated, was the most\nfrequent subject.\nMinimalism\nMinimalism describes movements in various forms of art and design, especially visual art and music, where the work is stripped down to its most fundamental\nfeatures.\nModern Ink Painting A late-20st-century and early-21st-century movement, Modern ink painting is an emerging style that reaches beyond traditional Asian ink painting in scope and\ntreatment of a minimalist-art. Contemporary ink painting is developing and establishing the recognition it deserves and gaining its own place among the major\npictorial works of the world. This global contemporary art movement represents sort of amalgamation of the Western visual art problems and practices with those\nof East Asia. Best known European contribution to the Modern ink painting is Alfred Freddy Krupa.\nNeoclassicism\nAn 18th-century reaction to the excesses of Baroque and Rococo, this European art movement tried to recreate the art of Greece and Rome by imitating the ancient\nclassics both in style and subject matter.\nNeoimpressionism\nA school of painting associated with George Seurat and his followers in late 19th-century France that sought to make Impressionism more precise and formal.\nThey employed a technique of juxtaposing dots of primary colors to achieve brighter secondary colors, with the mixture left to the eye to complete (pointillism).\nOp Art\nThe 1960s movement known as Optical Painting is characterized by geometrical forms that create an optical illusion in which the eye is required to blend the\ncolors at a certain distance.\nPop Art\nIn this return to representational art, the artist returns to the world of tangible objects in a reaction against abstraction. Materials are drawn from the everyday world\nof popular culture—comic strips, canned goods, and science fiction. It is meant to visually pop out and could be considered along with op-art or optical art used in\nthe famous Zonk poster to have begun the great Black Light poster era.\nRealism\nA development in mid-19th-century France lead by Gustave Courbet. Its aim was to depict the customs, ideas, and appearances of the time using scenes from\neveryday life.\nRococo\nA French style of interior decoration developed during the reign of Louis XV consisting mainly of asymmetrical arrangements of curves in paneling, porcelain, and\ngold and silver objects. The characteristics of ornate curves, prettiness, and gaiety can also be found in the painting and sculpture of the period.\nSurrealism\nA further development of Collage, Cubism, and Dada, this 20th-century movement stresses the weird, the fantastic, and the dreamworld of the subconscious.\nSymbolism\nAs part of a general European movement in the latter part of the 19th century, it was closely allied with Symbolism in literature. It marked a turning away from\npainting by observation to transforming fact into a symbol of inner experience. Gauguin was an early practitioner.\n.\nReference\nGlossary of Art Movements (http://www.infoplease.com/ipea/A0106225.html) Authors\nSerge Tom Westland - Organization, initial work on pages.\nMbrickn - Adding images, examples.\nRetrieved from \"https://en.wikibooks.org/w/index.php?title=Art_History/Printable_version&oldid=3987570\"\nThis page was last edited on 16 September 2021, at 19:30.\nText is available under the Creative Commons Attribution-ShareAlike License; additional terms may apply. By using this site, you agree to the Terms of Use and Privacy Policy."
}