{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 2: Elements of Art and Principles of Design\nElements of Art\n1. Line\nThere are many di\u0000erent types of lines, all characterized by their length being greater than their width. Lines can be static or dynamic depending\non how the artist chooses to use them. They help determine the motion, direction and energy in a work of art. We see line all around us in our\ndaily lives; telephone wires, tree branches, jet contrails and winding roads are just a few examples.\nThe Nazca lines in the arid coastal plains of Peru date to nearly 500 BCE were scratched into the rocky soil, depicting animals on an incredible\nscale, so large that they are best viewed from the air. Let’s look at how the di\u0000erent kinds of line are made.\nDiego Velazquez’s Las Meninas from 1656, ostensibly a portrait of the Infanta Margarita, the daughter of King Philip IV and Queen Mariana of\nSpain, o\u0000ers a sumptuous amount of artistic genius; its sheer size (almost ten feet square), painterly style of naturalism, lighting e\u0000ects, and the\nenigmatic \u0000gures placed throughout the canvas–including the artist himself –is one of the great paintings in western art history. Let’s examine it\n(below) to uncover how Velazquez uses basic elements and principles of art to achieve such a masterpiece.\nDiego Velazquez, Las Meninas, 1656, oil on canvas, 125.2” x\n108.7”. Prado, Madrid. CC BY\u0000SA\nActual lines are those that are physically present. The edge of the wooden stretcher bar at the left of Las Meninas is an actual line, as are the\npicture frames in the background and the linear decorative elements on some of the \u0000gures' dresses. How many other actual lines can you \u0000nd\nin the painting?\nImplied lines are those created by visually connecting two or more areas together. The gaze to the Infanta Margarita—the blonde central \u0000gure\nin the composition—from the meninas, or maids of honor, to the left and right of her, are implied lines. Implied lines can also be created when two\nareas of di\u0000erent colors or tones come together. Can you identify more implied lines in the painting? Where? Implied lines are found in three-\ndimensional artworks, too. The sculpture of the Laocoon below, a \u0000gure from Greek and Roman mythology, is, along with his sons, being\nstrangled by sea snakes sent by the goddess Athena as wrath against his warnings to the Trojans not to accept the Trojan horse. The sculpture\nsets implied lines in motion as the \u0000gures writhe in agony against the snakes.\nLaocoon Group, Roman copy of Greek original, Vatican\nMuseum, Rome. Photo by Marie-Lan Nguyen. CC BY\u0000SA\nStraight or classic lines provide structure to a composition. They can be oriented to the horizontal, vertical, or diagonal axis of a surface.\nStraight lines are by nature visually stable, while still giving direction to a composition. In Las Meninas, you can see them in the canvas supports\non the left, the wall supports and doorways on the right, and in the background in matrices on the wall spaces between the framed pictures.\nMoreover, the small horizontal lines created in the stair edges in the background help anchor the entire visual design of the painting. Vertical and\nhorizontal straight lines provide the most stable compositions. Diagonal straight lines are usually more visually dynamic, unstable, and tension-\n\u0000lled.\nStraight lines, 11 July 2012, Creator: Oliver Harrison.\nCC BY\nExpressive lines are curved, adding an organic, more dynamic character to a work of art. Expressive lines are often rounded and follow\nundetermined paths. In Las Meninas you can see them in the aprons on the girls’ dresses and in the dog’s folded hind leg and coat pattern. Look\nagain at the Laocoon to see expressive lines in the \u0000gures’ \u0000ailing limbs and the sinuous form of the snakes. Indeed, the sculpture seems to be\nmade up of nothing but expressive lines, shapes and forms.\nOrganic lines, 11 July 2012, Creator: Oliver Harrison.\nCC BY\nThere are other kinds of line that encompass the characteristics of those above yet, taken together, help create additional artistic elements and\nricher, more varied compositions. Refer to the images and examples below to become familiar with these types of line.\nOutline, or contour line is the simplest of these. They create a path around the edge of a shape. In fact, outlines often de\u0000ne shapes.\nOutline, 11 July 2012, Creator: Oliver Harrison. CC\nBY\nHatch lines are repeated at short intervals in generally one direction. They give shading and visual texture to the surface of an object.\nHatch, 11 July 2012, Creator: Oliver Harrison. CC BY\nCrosshatch lines provide additional tone and texture. They can be oriented in any direction. Multiple layers of crosshatch lines can give rich and\nvaried shading to objects by manipulating the pressure of the drawing tool to create a large range of values.\nCrosshatch, 11 July 2012, Creator: Oliver Harrison.\nCC BY\nLine quality is that sense of character embedded in the way a line presents itself. Certain lines have qualities that distinguish them from others.\nHard-edged, jagged lines have a staccato visual movement while organic, \u0000owing lines create a more comfortable feeling. Meandering lines can\nbe either geometric or expressive, and you can see in the examples how their indeterminate paths animate a surface to di\u0000erent degrees.\nLines, 11 July 2012, Creator: Oliver Harrison. CC BY\nAlthough line as a visual element generally plays a supporting role in visual art, there are wonderful examples in which line carries a strong\ncultural signi\u0000cance as the primary subject matter.\nCalligraphic lines use quickness and gesture, more akin to paint strokes, to imbue an artwork with a \u0000uid, lyrical character. To see this unique\nline quality, look up the work of Chinese poet and artist Dong Qichang, dating from the Ming dynasty (1555-1637). A more geometric example\nth\nfrom the Koran, created in the Arabic calligraphic style, dates from the 9 century.\nBoth these examples show how artists use line as both a form of writing and a visual art form. American artist Mark Tobey (1890–1976) was\nin\u0000uenced by Oriental calligraphy, adapting its form to the act of pure painting within a modern abstract style described as white writing.\n2. Shape\nA shape is de\u0000ned as an enclosed area in two dimensions. By de\u0000nition shapes are always \u0000at, but the combination of shapes, color, and other\nmeans can make shapes appear three-dimensional, as forms. Shapes can be created in many ways, the simplest by enclosing an area with an\noutline. They can also be made by surrounding an area with other shapes or the placement of di\u0000erent textures next to each other—for instance,\nthe shape of an island surrounded by water. Because they are more complex than lines, shapes are usually more important in the arrangement\nof compositions. The examples below give us an idea of how shapes are made.\nReferring back to Velazquez’s Las Meninas, it is fundamentally an arrangement of shapes; organic and hard-edged, light, dark and mid-toned,\nthat solidi\u0000es the composition within the larger shape of the canvas. Looking at it this way, we can view any work of art, whether two or three-\ndimensional, realistic, abstract or non-objective, in terms of shapes alone.\nGeometric Shapes vs. Organic Shapes\nShapes can be further categorized into geometric and organic. Examples of geometric shapes are the ones we can recognize and name:\nsquares, triangles, circles, hexagons, etc. Organic shapes are those that are based on organic or living things or are more free form: the shape\nof a tree, face, monkey, cloud, etc.\n3. Form\nForm is sometimes used to describe a shape that has an implied third dimension. In other words, an artist may try to make parts of a \u0000at image\nappear three-dimensional. Notice in the drawing below how the artist makes the di\u0000erent shapes appear three-dimensional through the use of\nshading. It's a \u0000at image but appears three-dimensional. Form is used to make people, animals, trees, or anything appear three-dimensional.\nThis image is free of copyright restrictions.\nWhen an image is incredibly realistic in terms of its forms (as well as color, space, etc.) such as this painting by Edwaert Collier, we call that\ntrompe l'oeil, French for \"fool the eye.\"\nEdweart Collier, Trompe l'oeil with Writing Materials,\noil on canvas, c. 1702.\nThis image is in the public domain.\n4. Space\nSpace is the area surrounding or between real or implied objects. Humans categorize space: there is outer space, that limitless void we enter\nbeyond our sky; inner space, which resides in people’s minds and imaginations, and personal space, the important but intangible area that\nsurrounds each individual and which is violated if someone else gets too close. Pictorial space is \u0000at, and the digital realm resides in cyberspace.\nArt responds to all of these kinds of space.\nMany artists are as concerned with space in their works as they are with, say, color or form. There are many ways for the artist to present ideas\nof space. Remember that many cultures traditionally use pictorial space as a window to view subject matter through, and through the subject\nmatter they present ideas, narratives and symbolic content. The innovation of linear perspective, an implied geometric pictorial construct dating\nfrom \u0000fteenth-century Europe, a\u0000ords us the accurate illusion of three-dimensional space on a \u0000at surface, and appears to recede into the\ndistance through the use of a horizon line and vanishing point(s). You can see how one-point linear perspective is set up in the examples\nbelow:\nOne-Point Linear Perspective, 11 July 2012, Creator:\nOliver Harrison. CC BY\nOne-point perspective occurs when the receding lines appear to converge at a single point on the horizon and used when the \u0000at front of an\nobject is facing the viewer. Note: Perspective can be used to show the relative size and recession into space of any object, but is most e\u0000ective\nwith hard-edged three-dimensional objects such as buildings.\nA classic Renaissance artwork using one point perspective is Leonardo da Vinci’s The Last Supper from 1498. Da Vinci composes the work by\nlocating the vanishing point directly behind the head of Christ, thus drawing the viewer’s attention to the center. His arms mirror the receding\nwall lines, and, if we follow them as lines, would converge at the same vanishing point.\nLeonardo da Vinci, The Last Supper, 1498. Fresco. Santa Maria della Grazie. Work is in the public domain.\nTwo-point perspective occurs when the vertical edge of a cube is facing the viewer, exposing two sides that recede into the distance, one to\neach vanishing point.\nTwo-Point Perspective, 11 July 2012, Creator: Oliver\nHarrison. CC BY\nView Gustave Caillebotte’s Paris Street, Rainy Weather from 1877 to see how two-point perspective is used to give an accurate view to an urban\nscene. The artist’s composition, however, is more complex than just his use of perspective. The \u0000gures are deliberately placed to direct the\nviewer’s eye from the front right of the picture to the building’s front edge on the left, which, like a ship’s bow, acts as a cleaver to plunge both\nsides toward the horizon. In the midst of this visual recession a lamp post stands \u0000rmly in the middle to arrest our gaze from going right out the\nback of the painting. Caillebotte includes the little metal arm at the top right of the post to direct us again along a horizontal path, now keeping\nus from traveling o\u0000 the top of the canvas. As relatively spare as the left side of the work is, the artist crams the right side with hard-edged and\norganic shapes and forms in a complex play of positive and negative space.\nThe perspective system is a cultural convention well suited to a traditional western European idea of the \"truth,\" that is, an accurate, clear\nrendition of observed reality. Even after the invention of linear perspective, many artists and cultures continued to use other ways to show\npictorial space, relying on overlapping, size di\u0000erences (smaller=further), vertical placement (lower=closer; higher=further), aerial or\natmospheric perspective (hazy, less detailed-further; clear, crisp, detailed=closer). THESE ARE IMPORTANT! MAKE SURE YOU\nUNDERSTAND WHAT THEY MEAN.\nExamine the miniature painting of the Third Court of the Topkapi Palace from fourteenth-century Turkey to contrast its pictorial space with that\nof linear perspective. It’s composed from a number of di\u0000erent vantage points (as opposed to vanishing points), all very \u0000at to the picture plane.\nWhile the overall image is seen from above, the \u0000gures and trees appear as cutouts, seeming to \u0000oat in mid air. Notice the towers on the far left\nand right are sideways to the picture plane. The trees and people occupying the upper parts are meant to be perceived as further from the\nviewer as compared to those trees, buildings and people located near the bottom of the painting. This is an example of vertical placement.\nAs \"incorrect\" as it looks, the painting does give a detailed description of the landscape and structures on the palace grounds.\nThird Court of the Topkapi Palace, from the Hunername, 1548. Ottoman\nminiature painting, Topkapi Museum, Istanbul. CC BY\u0000SA\nAfter nearly \u0000ve hundred years using linear perspective, western ideas about how space is depicted accurately in two dimensions went through\nth\na revolution at the beginning of the 20 century. A young Spanish artist, Pablo Picasso, moved to Paris, then western culture’s capital of art, and\nlargely reinvented pictorial space with the invention of Cubism, ushered in dramatically by his painting Les Demoiselles d'Avignon in 1907. He was\nin\u0000uenced in part by the chiseled forms, angular surfaces and disproportion of African sculpture (refer back to the Male Figure from Cameroon)\nand mask-like faces of early Iberian artworks. For more information about this important painting, listen to the following question and answer.\nIn the early 20th century, Picasso, his friend Georges Braque and a handful of other artists struggled to develop a new space that relied on,\nironically, the \u0000atness of the picture plane to carry and animate traditional subject matter including \u0000gures, still life and landscape. Cubist\npictures, and eventually sculptures, became amalgams of di\u0000erent points of view, light sources and planar constructs. It was as if they were\npresenting their subject matter in many ways at once, all the while shifting foreground, middle ground and background so the viewer is not sure\nwhere one starts and the other ends. In an interview, the artist explained cubism this way: “The problem is now to pass, to go around the object,\nand give a plastic expression to the result. All of this is my struggle to break with the two-dimensional aspect*”(from Alexander Liberman, An\nArtist in His Studio, 1960, page 113). Public and critical reaction to cubism was understandably negative, but the artists’ experiments with spatial\nrelationships reverberated with others and became – along with new ways of using color – a driving force in the development of a modern art\nmovement that based itself on the \u0000atness of the picture plane. Instead of a window to look into, the \u0000at surface becomes a ground on which to\nconstruct formal arrangements of shapes, colors and compositions. For another perspective on this idea, refer back to module one’s discussion\nof ‘abstraction’.\nYou can see the radical changes cubism made in George Braque’s landscape La Roche Guyon from 1909. The trees, houses, castle and\nsurrounding rocks comprise almost a single complex form, stair-stepping up the canvas to mimic the distant hill at the top, all of it struggling\nupwards and leaning to the right within a shallow pictorial space.\nGeorge Braque, Castle at La Roche Guyon, 1909. Oil on\ncanvas. Stedelijk van Abbe Museum, Eindhoven,\nNetherlands. Licensed through GNU and Creative\nCommons\nAs the cubist style developed, its forms became even \u0000atter. Juan Gris’s The Sunblind from 1914 splays the still life it represents across the\ncanvas. Collage elements like newspaper reinforce pictorial \u0000atness.\nJuan Gris, The Sunblind, 1914. Gouache, collage, chalk,\nand charcoal on canvas. Tate Gallery, London. Image\nlicensed under GNU Free Documentation License\nIt’s not so di\u0000cult to understand the importance of this new idea of space when placed in the context of comparable advances in science\nsurrounding the turn of the nineteenth century. The Wright Brothers took to the air with powered \u0000ight in 1903, the same year Marie Curie won\nthe \u0000rst of two Nobel prizes for her pioneering work in radiation. Sigmund Freud’s new ideas on the inner spaces of the mind and its e\u0000ect on\nbehavior were published in 1902, and Albert Einstein’s calculations on relativity, the idea that space and time are intertwined, \u0000rst appeared in\n1905. Each of these discoveries added to human understanding and realligned the way we look at ourselves and our world. Indeed, Picasso,\nspeaking of his struggle to de\u0000ne cubism, said “Even Einstein did not know it either! The condition of discovery is outside ourselves; but the\nterrifying thing is that despite all this, we can only \u0000nd what we know” (from Picasso on Art, A Selection of Views by Dore Ashton, (Souchere,\n1960, page 15).\n5. Value and Contrast\nValue (or tone) is the relative lightness or darkness of a shape in relation to another. The value scale, bounded on one end by pure white and on\nthe other by black, and in between a series of progressively darker shades of grey, gives an artist the tools to make these transformations. The\nvalue scale below shows the standard variations in tones. Values near the lighter end of the spectrum are termed high-keyed, those on the\ndarker end are low-keyed.\nValue Scale, 11 July 2012, Creator: Oliver Harrison, CC BY\nIn two dimensions, the use of value gives a shape the illusion of form or mass and lends an entire composition a sense of light and shadow. The\ntwo examples below show the e\u0000ect value has on changing a shape to a form.\n2D Form, 11 July 2012, Creator: Oliver Harrison, CC\nBY\n3D Form, 11 July 2012, Creator: Oliver Harrison, CC BY\nThis same technique brings to life what begins as a simple line drawing of a young man’s head in Michelangelo’s Head of a Youth and a Right\nHand from 1508. Shading is created with line (refer to our discussion of line earlier in this module) or tones created with a pencil. Artists vary the\ntones by the amount of resistance they use between the pencil and the paper they’re drawing on. A drawing pencil’s leads vary in hardness,\neach one giving a di\u0000erent tone than another. Washes of ink or color create values determined by the amount of water the medium is dissolved\ninto.\nThe use of high contrast, placing lighter areas of value against much darker ones, creates a dramatic e\u0000ect, while low contrast gives more subtle\nresults. These di\u0000erences in e\u0000ect are evident in ‘Guiditta and Oloferne’ by the Italian painter Caravaggio, and Robert Adams’ photograph\nUntitled, Denver from 1970-74. Caravaggio uses a high contrast palette to an already dramatic scene to increase the visual tension for the\nviewer, while Adams deliberately makes use of low contrast to underscore the drabness of the landscape surrounding the \u0000gure on the bicycle.\nCaravaggio, Guiditta Decapitates Oloferne, 1598, oil on canvas. National\nGallery of Italian Art, Rome. This work is in the public domain\n6. Color\nColor is the most complex artistic element because of the combinations and variations inherent in its use. Humans respond to color\ncombinations di\u0000erently, and artists study and use color in part to give desired direction to their work.\nColor is fundamental to many forms of art. Its relevance, use and function in a given work depend on the medium of that work. While some\nconcepts dealing with color are broadly applicable across media, others are not.\nThe full spectrum of colors is contained in white light. Humans perceive colors from the light re\u0000ected o\u0000 objects. A red object, for example,\nlooks red because it re\u0000ects the red part of the spectrum. It would be a di\u0000erent color under a di\u0000erent light. Color theory \u0000rst appeared in the\nth\n17 century when English mathematician and scientist Sir Isaac Newton discovered that white light could be divided into a spectrum by passing\nit through a prism.\nThe study of color in art and design often starts with color theory. Color theory splits up colors into three categories: primary, secondary, and\ntertiary.\nThe basic tool used is a color wheel, developed by Isaac Newton in 1666. A more complex model known as the color tree, created by Albert\nMunsell, shows the spectrum made up of sets of tints and shades on connected planes.\nThere are a number of approaches to organizing colors into meaningful relationships. Most systems di\u0000er in structure only.\nTraditional Model\nTraditional color theory is a qualitative attempt to organize colors and their relationships. It is based on Newton's color wheel, and continues to\nbe the most common system used by artists.\nBlue Yellow Red Color Wheel. Released under the\nGNU Free Documentation License\nTraditional color theory uses the same principles as subtractive color mixing (see below) but prefers di\u0000erent primary colors.\nThe primary colors are red, blue, and yellow. You \u0000nd them equidistant from each other on the color wheel. These are the\n\"elemental\" colors; not produced by mixing any other colors, and all other colors are derived from some combination of these three.\nThe secondary colors are orange (mix of red and yellow), green (mix of blue and yellow), and violet (mix of blue and red).\nThe tertiary colors are obtained by mixing one primary color and one secondary color. Depending on amount of color used, di\u0000erent\nhues can be obtained such as red-orange or yellow-green. Neutral colors (browns and grays) can be mixed using the three primary\ncolors together.\nWhite and black lie outside of these categories. They are used to lighten or darken a color. A lighter color (made by adding white to\nit) is called a tint, while a darker color (made by adding black) is called a shade.\nColor Mixing\nThink about color as the result of light re\u0000ecting o\u0000 a surface. Understood in this way, color can be represented as a ratio of amounts of primary\ncolor mixed together. Color is produced when parts of the external light source's spectrum are absorbed by the material and not re\u0000ected back\nto the viewer's eye. For example, a painter brushes blue paint onto a canvas. The chemical composition of the paint allows all of the colors in the\nspectrum to be absorbed except blue, which is re\u0000ected from the paint’s surface. Common applications of subtractive color theory are used in\nthe visual arts, color printing and processing photographic positives and negatives.\nThe primary colors are red, yellow, and blue.\nThe secondary colors are orange, green and violet.\nThe tertiary colors are created by mixing a primary with a secondary color.\nBlack is mixed using the three primary colors, while white represents the absence of all colors. Note: because of impurities in\nsubtractive color, a true black is impossible to create through the mixture of primaries. Because of this the result is closer to brown.\nSimilar to additive color theory, lightness and darkness of a color is determined by its intensity and density.\nSubtractive Color Mixing. Released under the GNU\nFree Documentation License\nColor Attributes\nThere are many attributes to color. Each one has an e\u0000ect on how we perceive it.\nHue refers to color itself, but also to the variations of a color.\nValue (as discussed previously)refers to the relative lightness or darkness of one color next to another. The value of a color can\nmake a di\u0000erence in how it is perceived. A color on a dark background will appear lighter, while that same color on a light\nbackground will appear darker.\nSaturation refers to the purity and intensity of a color. The primaries are the most intense and pure, but diminish as they are mixed\nto form other colors. The creation of tints and shades also diminish a color’s saturation. Two colors work strongest together when\nthey share the same intensity.\nColor Interactions\nBeyond creating a mixing hierarchy, color theory also provides tools for understanding how colors work together.\nMonochrome\nThe simplest color interaction is monochrome. This is the use of variations of a single hue. The advantage of using a monochromatic color\nscheme is that you get a high level of unity throughout the artwork because all the tones relate to one another. See this in Mark Tansey’s Derrida\nQueries de Man from 1990.\nAnalogous Color\nAnalogous colors are similar to one another. As their name implies, analogous colors can be found next to one another on any 12-part color\nwheel:\nAnalogous Color, 11 July 2012, Creator: Oliver\nHarrison. CC BY\nYou can see the e\u0000ect of analogous colors in Paul Cezanne’s oil painting Auvers Panoromic View\nColor Temperature\nColors are perceived to have temperatures associated with them. The color wheel is divided into warm and cool colors. Warm colors range from\nyellow to red, while cool colors range from yellow-green to violet. You can achieve complex results using just a few colors when you pair them in\nwarm and cool sets.\nWarm cool color, 11 July 2012, Creator: Oliver\nHarrison. CC BY\nComplementary Colors\nComplementary colors are found directly opposite one another on a color wheel. Here are some examples:\npurple and yellow\ngreen and red\norange and blue\nComplementary Color, 11 July 2012, Creator: Oliver\nHarrison. CC BY\nBlue and orange are complements. When placed near each other, complements create a visual tension. This color scheme is desirable when a\ndramatic e\u0000ect is needed using only two colors.\n7. Texture\nAt the most basic level, Three-dimensional works of art (sculpture, pottery, textiles, metalwork, etc.) and architecture have actual texture which\nis often determined by the material that was used to create it: wood, stone, bronze, clay, etc. Two-dimensional works of art like paintings,\ndrawings, and prints may try to show implied texture through the use of lines, colors, or other ways. When a painting has a lot of actual texture\nfrom the application of thick paint, we call that impasto.\nThe \u0000rst image below is a sculpture, and like all three-dimensional objects it has actual texture.\nThe next two images are details from the painting The Arnol\u0000ni Portrait by Jan van Eyck. Here, the artist has created implied texture. If you were\nto touch this painting you would not feel the fabric of the clothing and carpet, the wooden \u0000oor or the smooth metal of the chandelier, but our\neyes \"see\" the texture.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}