{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 2: Elements of Art and Principles of Design\nFormalism and Content\nViewing Art\nWhen we are looking at art we typically have an initial response or impression. This response to what we see (or hear, etc.) is formed by a\nlifetime of knowledge and experience and the culture and time in which we live. The expression \"Beauty lies in the eye of the beholder\" gets at\nthe subjective and personal nature of perception—and of the \"\u0000rst impression,\" in particular. There's nothing wrong with one's \u0000rst impression or\nresponse—it is, after all, a personal response. It's your point of view.\nFormal Analysis\nFormal analysis is a close and analytical way of looking at and discussing a work of art. It includes describing the work in terms of various\nelements, such as color, shape, texture, line, lighting, mass, and space, as well as a discussion of how those elements have been used (the\ndesign principles). Formal analysis can lead the viewer beyond description of the artwork and its content by linking the elements of the work to\nthe e\u0000ects that they have on the viewer. This is discussion of the artwork from the point of view of “here is the artwork, and this is what I see and\ncan make sense of . . .”\nContent\nContent is simply the the subject matter of an artwork. It's the images you see—like the trees in a painting of a forest, or the town, the sky, and\nthe moon in Van Gogh’s Starry Night. Content can play a role in formal analysis, but the content aspect is less important than the \"artwork\"\naspect in a formal analysis. A contextual analysis, however, often brings additional information to light allowing a deeper appreciation beyond the\nformal (visual) aspects alone.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}