{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nRepresentational, Abstract, and Nonrepresentational\nArt\nKey Points\nPainting, sculpture, and other artforms can be divided into the categories of representational (sometimes also called \u0000gurative art although it\ndoesn't always contain \u0000gures), abstract and nonrepresentational art. Representational art describes artworks—particularly paintings and\nsculptures–that are clearly derived from real object sources, and therefore are by de\u0000nition representing something with strong visual\nreferences to the real world. Most, but not all, abstract art is based on imagery from the real world. The most \"extreme\" form of abstract art is\nnot connected to the visible world and is known as nonrepresentational.\nRepresentational art or \u0000gurative art represents objects or events in the real world, usually looking easily recognizable. For\nexample, a painting of a cat looks very much like a cat-- it's quite obvious what the artist is depicting.\nRomanticism, Impressionism, and Expressionism contributed to the emergence of abstract art in the nineteenth century as artists\nbecame less interested in depicting things exactly like they really exist. Abstract art exists on a continuum, from somewhat\nrepresentational work, to work that is so far removed from its actual real-world appearance that it is almost impossible to easily\ndiscern what is being represented. Abstract art is always connected to something visual from the real world.\nWork that does not depict anything from the real world (\u0000gures, landscapes, animals, etc.) is called nonrepresentational.\nNonrepresentational art may simply depict shapes, colors, lines, etc., but may also express things that are not visible-- emotions or\nfeelings for example.\nJohann Anton Eismann, Meerhaven. 17th c. Work is in the public domain\nThis \u0000gurative or representational work from the seventeenth century depicts easily recognizable objects–ships, people, and buildings. But\nartistic independence was advanced during the nineteenth century, resulting in the emergence of abstract art. Three movements that\ncontributed heavily to the development of these were Romanticism, Impressionism, and Expressionism.\nAbstraction indicates a departure from reality in depiction of imagery in art. Abstraction exists along a continuum; abstract art can formally refer\nto compositions that are derived (or abstracted) from a \u0000gurative or other natural source. (Some people also use this term to refer to\nnonrepresentational (non-objective) art that has no derivation from \u0000gures or objects. However, in this class we do not the term abstract like this.)\nPicasso is a well-known artist who used abstraction in many of his paintings and sculptures: \u0000gures are often simpli\u0000ed, distorted, exaggerated,\nor geometric.\nPablo Picasso, Girl Before a Mirror, 1932, MOMA\nPhoto by Sharon Mollerus CC BY\nEven art that aims for verisimilitude (accuracy and truthfulness) of the highest degree can be said to be abstract, at least theoretically, since\nperfect representation is likely to be exceedingly elusive. Artwork which takes liberties, altering for instance color and form in ways that are\nconspicuous, can be said to be partially abstract.\nRobert Delaunay, Le Premier Disque, 1913. Work is in the public domain\nDelaunay's work is a primary example of early nonrepresentational art, bearing no trace of any reference to anything recognizable from the real\nworld. In nonrepresentational art, for instance, one is unlikely to \u0000nd references to naturalistic entities.\nFigurative art and nonrepresentational art are almost mutually exclusive. But representational (or realistic) art often contains partial abstraction.\nAs you see, these terms are bit confusing, but do your best to understand the basic de\u0000nitions of representational, abstract and\nnonrepresentational.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}