{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 3: Context and Perspective\nPerspectives and Criticism\nPerspectives can be though of as di\u0000erent viewpoints when appreciating or trying to understand art, for example people from one culture or\nbackground might think of certain artworks di\u0000erently than people from a di\u0000erent culture or background. Here you will learn about a few\ndi\u0000erent types of perspectives as well as a number of \"critical\" perspectives - how art critics, scholars, artists, and writers might approach and\nunderstand art.\nNOTE: the term perspective is also sometimes used to describe how spatial relationships are depicted in an artwork-- especially the illusion of\n3-dimensional space in a 2-dimensional work of art like a drawing or painting. This is not how we are using the term perspective in this lesson.\nThree General Types of Perspective\n1. Cultural Perspective\nCulture is a complex concept that encompasses the ways that social life e\u0000ects and informs our experiences. To quote Stuart Hall:\n\"Culture, it is not so much a set of things- novels and paintings, or TV programs or comics- as a process, a set of practices.\nPrimarily culture is concerned with the production and exchange of meanings- the 'giving and taking of meaning' between\nmembers in a society or group... Thus culture depends on its participants interpreting meaning- fully what is around them, and\n'making sense' of the world, in broadly similar ways (Rose, p2).\"\nIt could be said that growing up in America contributes to an 'American worldview'. We each may have variations to this, but unless you were\nraised outside of the United States, you are strongly (consciously or unconsciously) in\u0000uenced by an American perspective. This is an example\nof cultural context.\nIn America it is typical to feel it is inappropriate for someone to dictate what we can read, listen to, look at or think about. This would generally\nfall under the First Amendment, the freedom of speech and expression aspect of our county, beliefs, and government. In other countries, for\nexample Italy– they may or may not have this as a cultural value.\nRepresentations, in whatever form they take, contribute to 'made meanings' of culture, speci\u0000cally as visual culture. As Gillian Rose points out-\nthese representations, whether they are high art or advertisements, are not transparent windows on the world, rather- they interpret the world\n(Rose, p2). When we select and take in speci\u0000c kinds of representations there is an exchange of meaning that goes two ways. We participate in\nconstructing culture by selecting and elevating certain forms of representations, and that speci\u0000c visual culture we experience has the power to\nin\u0000uence our personal view on life.\n2. Historical Perspective\nAs time passes, scholarship and research occur and many people become aware of a particular artwork, art form, art style, etc. Recognition may\nincrease (and sometimes decreases). Vincent Van Gogh is an example here—totally unappreciated while he was alive, but now he's recognized\nworldwide as a notable painter. Other examples might be the originally negative attitudes towards jazz music or hip-hop. In art, these currents of\nrecognition of importance often spring from institutions like museums, academic writing and journals, college art classes, and art history as a\n\u0000eld of study.\n3. Personal Perspective\nPersonal perspectives are formed by the layered aspects that form our individual identities. This could be any number of de\u0000ning aspects such\nas, gender, class, race, where you were born and raised, education, aspects of family, group a\u0000liations, etc., and the list goes on. These aspects\nform our unique biographical experiences that constitute our identities and color our personal point of view or the way we interpret our life\nexperiences.\nYou may \u0000nd that your personal response to art and artworks will change as you learn more about design, art making, and the history of art in\ngeneral. Knowledge and/or education about art usually helps us appreciate and understand art.\nSweeping judgments based purely on a personal emotional response can be colored with bias and often come from having little knowledge of a\nsubject or artwork or the larger cultural context. These are habits of thinking that inhibit a critical understanding of things that are new to us like\nartwork. In general, it's a good idea to take a generous stance to art forms or artworks we don't like or don't understand or just don't connect to.\nSix Critical Perspectives - Introduction\nFrom the \u0000rst forms of art criticism in ancient Greece, the discussion of meaning in art has taken many directions. The professional art critic is\noften one of the gatekeepers who, through their writing, endorse or reject particular kinds of art, whether in style, artistic ability, or message. In\nfact, a study of the di\u0000erent ways to look at art can tell us much about changing times and philosophies: the role of aesthetics, economics, and\nother cultural issues have a lot to do with the origin of these philosophical positions. Of course, none of them is completely true—they're simply\ndi\u0000erent types of discourse. People approach meaning from di\u0000erent perspectives. The artworks sit silent while all around them the voices\nchange. We are in a time when there are several, sometimes greatly con\u0000icting, ways of thinking about meaning in art. Here are just six di\u0000erent\nperspectives art critics may use to aid their interpretation and understanding of art:\n1. Structural Criticism\nStructuralism is based on the notion that our concept of reality is expressed through language and related systems of shared communication.\nApplied to the visual arts, the world of art becomes a collective human construction, where a single work needs to be judged within the\nframework or structure of shared beliefs or perceptions. I often use the example of the word \"cowboy\". In your head: visualize a cowboy: then\ndescribe what you saw. What gender was your person? What race was this person? Now let’s apply those answers to historical fact. The fact is\nthat upwards of 60 percent of the historical cowboys in the United States were black slaves freed after the Civil War. Did you see your cowboy\nas white? Your idea of cowboy might have come from \u0000lm, which is an extremely di\u0000erent form of reality. The structural idea manifests itself\nwhen we look for meaning in art based on any preconceived ideas about it we already have in our mind. These preconceptions (or limitations)\nare shaped by language, social interaction and other cultural experiences.\n2. Deconstructive Criticism\nDeconstruction posits that any work of art can have many meanings attached to it, none of which is limited by a particular language or\nexperience outside the work itself. In other words, the critic must reveal (deconstruct) the structured world in order to knock out any\nunderpinnings of stereotypes, preconceptions, or myths that get in the way of true meaning. Taking the perspective of a deconstructive critic,\nwe would view a portrait of Marilyn Monroe by pop artist Andy Warhol as an imaginary construct of what is real. As a popular culture icon,\nMarilyn Monroe the movie star was ubiquitous: in \u0000lm, magazines, television and photographs. But Marilyn Monroe the person committed suicide\nin 1962 at the height of her stardom. In truth, the bright lights and celebrity of her Hollywood persona eclipsed the real Marilyn, someone who\nwas troubled, confused and alone. Warhol’s many portraits of her –each one made from the same publicity photograph –perpetuate the myth\nand cult of celebrity.\n3. Formalist Criticism\nFormalism is what we engaged in when we looked at the elements of art and principles of design. Formalism doesn't really care about what\ngoes on outside the actual space of the work, but \u0000nds meaning in its use of materials. One of the champions of the formalist approach was\nClement Greenberg. His writing stresses “medium speci\u0000city”: the notion there is inherent meaning in the way materials are used to create the\nartwork. As is relates to painting and works on paper, the result is a focus on the two-dimensional surface. This is contrary to traditional uses of\npainting as a platform for the illusion of depth. Formalism allows a more reasoned discussion of abstract and nonrepresentational art because\nwe can approach them on their own terms, where the subject matter becomes the medium instead of something it represents. This is a good\nway to approach artworks from cultures we are not familiar with, though it has the tendency to make them purely decorative and devalue any\ndeeper meaning. It also allows a kind of training in visual seeing, so it is still used in all studio arts and art appreciation courses.\n4. Ideological Criticism\nIdeological criticism is most concerned with the relationship between art and structures of power. It infers that art is embedded in a social,\neconomic, and political structure that determines its \u0000nal meaning. Born of the writings of Karl Marx, ideological criticism translates art and\nartifacts as symbols that re\u0000ect political ideals and reinforce one version of reality over another. A literal example of this perspective would view\nthe Lincoln Memorial in Washington, D.C. as a testament to a political system that oppressed people because of race yet summoned the political\nwill to set them free in the process of ending a Civil War.\nThe Lincoln Memorial, Washington, D.C. Photo by Je\u0000 Kubina and licensed\nthrough Creative Commons\nIn contrast, Ernst Ludwig Kirchner’s painting Franzi in Front of a Carved Chair (below) from 1910 is also considered a symbol of artistic (hence,\npolitical) freedom. His Expressionist art – with its strong, sometimes arbitrary colors and rough approach to forms, was denounced by Nazi\nGermany as being “degenerate.\" The Degenerate Art Show of 1937 was a way for the German political establishment to label modern art as\nsomething evil and corrupt. Hitler’s regime was only interested in heroic, representational and idealistic images, something Kirchner was\nrebelling against. Kirchner and other Expressionist artists were marginalized and many of their works destroyed by the authorities.\nErnst Ludwig Kirchner, Franzi In Front of A Carved Chair,\n1910, oil on canvas, Thyssen-Bornemisza Museum,\nMadrid. This work is in the public domain\n5. Psychoanalytic Criticism\nPsychoanalytic criticism is the way we should look at artwork if we feel it is only about personal expression. The purest form of this criticism\nranks the work of untrained and mentally ill artists as being just as important as any other art. It is in this way that the artist “inside” is more\nimportant than any other reason the art happens or the e\u0000ect the art has. When discussing Vincent van Gogh you will often hear people allude\nto his mental state more than his actual artwork, experience, or career. This is a good example of psychoanalytic criticism. One of the problems\nin this type of criticism is that the critic is usually discussing issues the artist themselves may be totally unaware of (or deny).\n6. Feminist Criticism\nFeminist Criticism began in the 1970s as a response to the neglect of women artists over time and in historical writings. This form of criticism is\nspeci\u0000c to viewing art as an example of gender bias in historical western European culture, and views all work as a manifestation of this bias.\nFeminist criticism created whole movements in the art world (speci\u0000cally performance based art), and has changed over the last few years to\ninclude all underrepresented groups. A well-known example of feminist art is Judy Chicago’s large-scale installation The Dinner Party.\nIn reality, all of these critical perspectives hold some truth. Art is a multifaceted medium that contains in\u0000uences from most all the\ncharacteristics of the culture it was created in, and some that transcend cultural environments. These perspectives, along with the di\u0000erent\nlevels of meaning we explored in this module, help us to unravel some of the mysteries inherent in works of art, and bring us closer to seeing\nhow art expresses feelings, ideas and experiences that we all share. In our search it is important to be aware of all the issues involved, take\naspects of each critical position depending upon the work being viewed, the environment (and context) you’re seeing it in, and make up our own\nmind.\nWorks Cited\nRose, Gillian. Visual Methodologies: An Introduction to Researching Visual Materials. Los Angeles: Sage Publications, 2012. Print.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}