{
    "text": "Code of\nBest Practices\nin Fair Use\nfor the\nVisual Arts\ncollege art association\nFunded by the Andrew W. Mellon Foundation\nAdditional support provided by the Samuel H. Kress Foundation Code of Best Practices\nin Fair Use for the Visual Arts\nFEBRUARY 2015\nFunded by the Andrew W. Mellon Foundation\nAdditional support provided by the Samuel H. Kress Foundation MESSAGE FROM THE CAA PRESIDENT\nThe mission of the College Art Association (CAA) is to promote the visual arts and\ntheir understanding through advocacy, intellectual engagement, and a commitment\nto the diversity of practices and practitioners. CAA contributes to the visual arts\nprofession as a whole through scholarly publications, advocacy, exchange of research\nand new work, and the development of standards and guidelines that reflect the\nbest practices of the field.\nThe Code of Best Practices in Fair Use for the Visual Arts is based on a\nconsensus of professionals in the visual arts who use copyrighted images, texts,\nand other materials in their creative and scholarly work and who, through\ndiscussion groups, identified best practices for using such materials. They included\nart and architectural historians, artists, designers, curators, museum directors,\neducators, rights and reproduction officers, and editors at scholarly publishers\nand journals.\nCAA is grateful to Lead Principal Investigators Patricia Aufderheide and\nPeter Jaszi of American University for their oversight and execution of this project,\nincluding their surveying nearly 12,000 CAA members on their use of copyrighted\nmaterials, conducting 100 interviews to identify key issues, facilitating discussions\nwith another 120 visual arts professionals to understand and identify points of\nconsensus concerning best practices in use of such materials and, finally, articulating\nthat consensus in the Code of Best Practices.\nCAA expresses its deep appreciation to the many visual arts professionals\nwho gave their time and expertise to this project. Special thanks are due to the\nother principal investigators—Linda Downs, Anne Collins Goodyear, under\nwhose CAA presidency the project began, and Jeffrey Cunard—as well as to\nGretchen Wagner, who, with Jeffrey, cochaired CAA’s Task Force on Fair Use.\nCAA also thanks the project advisors, the Legal Advisory Committee, the Task\nForce on Fair Use, its Committee on Intellectual Property, and its Professional\nPractices Committee for expert assistance, and Janet Landay, project manager,\nfor orchestrating all logistics. A full list of participants is set out in the credits\nthat follow the Code.\nFinally, CAA acknowledges the generous support of the Andrew W. Mellon\nFoundation and the Samuel H. Kress Foundation, without which this project would\nnot have been possible.\nDeWitt GoDfrey\nPresident, CAA, and Professor, Art and Art History Department, Colgate University TABLE OF CONTENTS\n2 Message from the CAA President\n5 Introduction\n6 Why the Code?\n6 When the Code Does and Does Not Apply\n7 Applying the Code\n9 Code of Best Practices\n9 One: Analytic Writing\n10 Two: Teaching about Art\n11 Three: Making Art\n11 Four: Museum Uses\n13 Five: Online Access to Archival and\nSpecial Collections\n14 Appendix A: Fair Use Today\n18 Appendix B: How the Code Was Created\n19 Credits 5\n|\nCODE\nOF\nIntroduction\nBEST\nPRACTICES\nThe Code of Best Practices in Fair Use was created with and for the visual arts\ncommunity. Copyright protects artworks of all kinds, audiovisual materials,\nphotographs, and texts (among other things) against unauthorized use by\nothers, but it is subject to a number of exceptions designed to assure space for\nfuture creativity. Of these, fair use is the most important and the most flexible.\n(Appendix A is an essay by Peter Jaszi presenting a perspective on fair use.)\nThe Code describes common situations in which there is a consensus within the\nvisual arts community about practices to which this copyright doctrine should\napply and provides a practical and reliable way of applying it.\nAssessing fair use in light of shared professional understandings is a respected\npractice. Invoking professional practices provides members of a community with a\nclear framework in which to apply fair use with confidence, knowing the shared\nnorms of their field. Having a code of best practices allows them to share their\ncommon understandings with others—including publishing entities, distributors,\ninsurers, and lawyers—who may make decisions on which they depend. In addition\nto serving as a useful tool for individuals, a code can assist institutions and their\ncounsel in applying the doctrine and developing policies that reflect their particular\nconcerns. Further, a code provides guidance to rights holders as to when it may\nnot make sense for them to claim infringement in light of an appropriate invocation\nof fair use. Finally, although a code cannot control the judicial interpretation of\nfair use, it helps courts to become familiar with best practices in a professional\ncommunity when called upon to rule on fair use.\nThe right to make fair use of copyrighted materials is a key tool for the visual\narts community, although its members may not always choose to take advantage of\nit. They may still seek copyright permissions, for instance, to maintain relationships,\nto reward someone deemed deserving, or to obtain access to material needed for\ntheir purposes. But, in certain other cases, including those described in the Code,\nthey may choose instead to employ fair use of copyrighted material in order to\naccomplish their professional goals.\nMany members of the visual arts community employ fair use in their\nprofessional practices and many do so regularly. For instance, scholars and their\neditors employ fair use in the context of analytic writing (for example, in using\nreproductions of copyrighted artworks and quotations). Teachers rely on it—along\nwith other copyright exceptions—to show images of works being discussed during\nclass sessions, and, even more heavily, to provide relevant images for student use\noutside class. In the museum context, fair use may be employed in exhibitions and\npublications, and in a range of digital and educational projects. Artists may employ\nfair use to build on preexisting works, engage with contemporary culture, or provide\nartistic, political, or social commentary. And the entire visual arts community benefits 6 from fair use when it enables enhanced access to archival materials. These are only\n|\nsome of the most common ways in which fair use is central to visual arts practice. CODE\nOF\nWHY THE CODE? BEST\nArtists, scholars, teachers, museum professionals, and others represented in the PRACTICES\nCollege Art Association membership are significant producers of copyrighted\nworks and they value their own rights. CAA recognized the value of promoting\ngreater certainty among its members about the appropriate exercise of fair use.\nThe risk posed by widespread uncertainty on this point was underscored by the\ncommon default expectation that users of copyrighted material should routinely\nseek permission to eliminate potential legal liability for unauthorized uses. CAA\nmembers were aware that such a culture of permissions could limit the work of the\nvisual arts community and, as a result, deprive the public, especially in a digital\nera. CAA therefore engaged Patricia Aufderheide and Peter Jaszi, professors at\nAmerican University and leading experts in copyright and fair use, to assess the\ncurrent state of the community’s practices with respect to the use of third-party\ncopyrighted materials. In 2014, thanks to generous preliminary funding from the\nSamuel H. Kress Foundation and a major grant from the Andrew W. Mellon\nFoundation, CAA asked Aufderheide and Jaszi to prepare “Copyright, Permissions,\nand Fair Use among Visual Artists and the Academic and Museum Visual Arts\nCommunities: An Issues Report.”\nThe Issues Report, which was based on their interviews with 100 visual arts\nprofessionals and a survey of CAA members, reported that the practices of many\nprofessionals in the visual arts are constrained due to the pervasive perception\nthat permissions to use third-party materials are required even where a confident\nexercise of fair use would be appropriate. Most commonly the decision not to rely\non fair use is made by visual arts professionals themselves. Although members of\nthe community may rely on fair use in some instances, they may self-censor in\nothers, due to confusion, doubt, and misinformation about fair use, leading them\nto over-rely on permissions. (This is in contrast to self-censorship due to specific,\nnon-copyright-related circumstances, such as a personal relationship with an\nartist.) Doing so jeopardizes their ability to realize their own full potential, as well\nas that of the visual arts community as a whole.\nAware of the success of other communities in developing codes of best\npractices in fair use, and of the opportunity that best practices present to help\nshape the application of fair use law, CAA decided to create such a code for the\nvisual arts community. The methodology is described in Appendix B.\nWHEN THE CODE DOES AND DOES NOT APPLY\nFair use is part of US copyright law, and the Code applies to the activities of\nmembers of the visual arts community who use copyrighted works in the US in\nfurtherance of their professional goals. The Code applies to any copyrighted\nwork used in the United States regardless of whether the work originated outside\nthe United States. The Code does not apply to reproductions, distributions, performances, and other uses outside the United States, including web-based 7\n|\nuses specifically targeted toward other countries, to which those countries’ CODE\nlaws may apply.\nOF\nThe Code is not applicable to—and is not needed for—uses of material for BEST\nwhich permissions already have been granted to the broader public, such as PRACTICES\nthrough Creative Commons licenses, which provide advance permission for a range\nof uses. Anyone may use such works in ways authorized by the applicable license\nbut may also invoke fair use for other kinds of uses, where appropriate.\nSimilarly, the Code is not a guide to—and, again, is not needed for—the use of\nmaterial that is in the public domain. By definition, public domain material is not\nprotected by copyright and may be used without regard to copyright. According to\nthe reasoning of the decision in Bridgeman Art Library v. Corel Corp., 36 F. Supp.\n2d 191 (S.D.N.Y. 1999), moreover, copyright-free material also includes faithful\nphotographic reproductions of two-dimensional artworks, which are distinct from\nthe artworks they depict. Bridgeman, however, does not on its face apply to still\nphotographs of three-dimensional works, such as sculpture, architecture, and\nperformance art. Nevertheless, such photographs might be used pursuant to fair\nuse in light of the principles and limitations set forth in the Code.\nIn practice, fair use can be applied only to works for which users can obtain\naccess, including, for example, in the case of visual art, to reproductions, such as\nanalog slides or digital images. Sometimes, however, permission must be sought\nsimply because a “sole source” controls an art object or reproductions thereof—\neven where the work itself is in the public domain. Because demands for permis-\nsion fees in this context are not based on copyright, fair use cannot be invoked to\navoid paying such fees.\nFair use and, therefore, the Code, also do not apply to the extent that a license\nagreement or other contract controls reproduction or other use. Thus, for example,\narchives must abide by restrictions imposed by donors, and museums must comply\nwith provisions for rights clearance in distribution contracts that supersede fair\nuse. Sometimes such terms may be found in the “fine print” of agreements that\nmay otherwise be noncontroversial.\nAPPLYING THE CODE\nFair use can be applied consistently based on logical principles grounded in factual\ncontexts. The Code describes an approach to reasoning about the application of\nfair use to issues both familiar and emergent. It does not provide rules of thumb,\nbright-line rules, or other decision-making shortcuts. For instance, it does not\nprescribe a uniform size or resolution for digital images that might be appropriate\nfor all online uses. Rather, it calls on a user to consider context in deciding what\nimage size should be employed for any new use, in light of the user’s professional\ngoals and other considerations.\nLikewise, the Code refers users to generally applicable professional standards,\nwhich, in turn, may evolve over time. This is the case, for example, where it\ninvokes the concept of “appropriate metadata” (which might include information 8 about the title, artist, date, medium, provenance, current location, ownership,\n|\nand other characteristics of a work), the meaning of which may differ according CODE\nto context.\nOF\nFinally, it is important to emphasize that decisions about whether to utilize BEST\nthe principles of the Code are not affected or limited by the possibility that others PRACTICES\nmay make further uses of the copyrighted material in question. As the law has\nbeen interpreted, such “downstream” uses (scanning a book illustration and\nplacing the image on consumer goods, for example) do not give rise to legal\nliability on the part of visual arts professionals who themselves have relied\nappropriately on fair use in making the material available and are not actively\naware of widespread misuse of it by others.\nThe Code that follows states five consensus principles that reflect best practices\nby members of the visual arts community in applying fair use. Each of the principles\nis given shape by its associated limitations, which are integral to application of the\nprinciple. The Code includes only principles and limitations about which there was\nnear-universal consensus among the discussion groups’ participants. As a result,\nthey are not necessarily exhaustive.\nMore specifically, the Code does not describe all the situations in which fair\nuse might be available to members of the visual arts community. Rather, it addresses\nonly the most common situations that members of the community encounter.\nBy the same token, the Code’s principles and limitations are, of course, subject\nto interpretation. 9\n|\nCODE\nOF\nThe Code of Best Practices:\nBEST\nSituations, Principles, and Limitations\nPRACTICES\nONE: ANALYTIC WRITING\nDESCRIPTION Analytic writing focuses attention on artists, artworks, and\nmovements; it includes analyses of art within larger cultural, political, and\ntheoretical contexts. Such writing routinely includes reproductions, in full or in\npart, of relevant artworks in all media, texts, historical images, digital phenomena,\nand other visual culture. This material—much of it copyrighted—may be drawn\nfrom a variety of sources, including the collections of libraries and archives\n(generally referred to here as “memory institutions”), notes and photographs taken\nby the writer, and documentary reproductions created or published by others; some\nworks start out in analog formats and others are born digital. Sometimes the visual\nor textual works reproduced in connection with analytic writing are the specific\nsubjects of analysis. Sometimes they are used to illustrate larger points about\nartistic trends and tendencies, or to document a particular point or conclusion.\nSuch writing is published both within traditional academic venues and in ever-\nexpanding venues beyond them. It may be published in a variety of formats,\nincluding print and electronic books and journals, exhibition catalogues, collection\ncatalogues, blog and social media posts, and contributions to collaborative digital\nprojects, such as wikis (which projects often reside in institutional repositories), or\nit may be delivered at academic meetings or on similar occasions. The effectiveness\nof analytic writing about art is improved by the reproduction of the materials that\nit references. In many instances, particularly for works of visual art, writers may\nconclude that reproduction of an entire work may be the most appropriate way to\nmake their points.\nPRINCIPLE In their analytic writing about art, scholars and other writers (and,\nby extension, their publishers) may invoke fair use to quote, excerpt, or reproduce\ncopyrighted works, subject to certain limitations:\nLimitations\nn The writer’s use of the work, whether in part or in whole, should be justified\nby the analytic objective, and the user should be prepared to articulate that\njustification.\nn The writer’s analytic objective should predominate over that of merely\nrepresenting the work or works used.\nn The amount and kind of material used and (where images are concerned) the\nsize and resolution of the published reproduction should not exceed that\nappropriate to the analytic objective.\nn Justifications for use and the amount used should be considered especially\ncarefully in connection with digital-format reproductions of born-digital works, 10 where there is a heightened risk that reproductions may function as substitutes\n|\nfor the originals. CODE\nn Reproductions of works should represent the original works as accurately as can\nOF\nbe achieved under the circumstances. BEST\nn The writing should provide attribution of the original work as is customary in PRACTICES\nthe field, to the extent possible.\nTWO: TEACHING ABOUT ART\nDESCRIPTION Teaching about art in studio and classroom settings, whether in\nacademia or elsewhere, has historically been achieved using reproductions of\nartwork as illustrations. Today, technology has extended the classroom beyond\nfour walls: teachers may show digital slides or video in classrooms, while also\nmaking such works that are related to their courses available to students online by\nmeans, for example, of course management platforms. Some institutions also offer\ntheir students art courses conducted entirely online. Although specific copyright\nexceptions are available for some teaching activities, teachers’ fulfillment of their\nmission often is frustrated by the narrow scope of those exceptions. Even where\nthese exceptions may be adequate to cover face-to-face teaching or distance\neducation in real time, they fail to cover many forms of pre- and post-class support\nthat teachers wish to provide to students. In support of their teaching activities,\nteachers in the visual arts long have maintained collections of exemplary\ndocumentation for their own use and that of their students. Sometimes these\nare maintained in their personal files and sometimes in departmental or other\ninstitutional reference collections. Those who maintain such files generally agree\nthat they would prefer to share them more broadly, with peers or related institutions,\nto create more powerful teaching resources.\nPRINCIPLE Teachers in the visual arts may invoke fair use in using\ncopyrighted works of various kinds to support formal instruction in a range of\nsettings, as well as for uses that extend such teaching and for reference collections\nthat support it, subject to certain limitations:\nLimitations\nn T he works selected should further the teacher’s substantive pedagogical objectives.\nn The teacher’s pedagogical objective should predominate over that of merely\nrepresenting the work or works used.\nn Student access to course management sites where such works are made available\nshould be restricted to those enrolled in the course or otherwise designated by\nthe teacher.\nn Images made available to students should, to the extent possible, accurately\nrepresent the works they depict.\nn If providing downloadable images online is justified by the teacher’s objectives,\nthose images should be suitable in size for satisfactory full-screen projection or\ndisplay on a personal computer or mobile device, but generally not larger. n When displayed, images should be accompanied by attribution of the original 11\n|\nwork as is customary in the field, to the extent possible. CODE\nn Images and other items in a reference collection should be augmented with\nOF\nappropriate and reasonably available metadata. BEST\nn Access to an institutional reference collection should be limited to persons PRACTICES\naffiliated with the institution and its partner institutions, such as students,\nfaculty, and authorized researchers, subject to a requirement that items in the\ncollection should be used only for legitimate purposes.\nTHREE: MAKING ART\nDESCRIPTION For centuries, artists have incorporated the work of others\nas part of their creative practice. Today, many artists occasionally or routinely\nreference and incorporate artworks and other cultural productions in their own\ncreations. Such quotation is part of the construction of new culture, which\nnecessarily builds on existing culture. It often provides a new interpretation of\nexisting works, and may (or may not) be deliberately confrontational. Increasingly,\nartists employ digital tools to incorporate existing (including digital) works into\ntheir own, making uses that range from pastiche and collage (remix), to the creation\nof new soundscapes and lightscapes. Sometimes this copying is of a kind that might\ninfringe copyright, and sometimes not. But whatever the technique, and whatever\nmay be used (from motifs or themes to specific images, text, or sounds), new art\ncan be generated.\nPRINCIPLE Artists may invoke fair use to incorporate copyrighted material into\nnew artworks in any medium, subject to certain limitations:\nLimitations\nn Artists should avoid uses of existing copyrighted material that do not generate\nnew artistic meaning, being aware that a change of medium, without more, may\nnot meet this standard.\nn The use of a preexisting work, whether in part or in whole, should be justified\nby the artistic objective, and artists who deliberately repurpose copyrighted\nworks should be prepared to explain their rationales both for doing so and for\nthe extent of their uses.\nn Artists should avoid suggesting that incorporated elements are original to them,\nunless that suggestion is integral to the meaning of the new work.\nn When copying another’s work, an artist should cite the source, whether in the\nnew work or elsewhere (by means such as labeling or embedding), unless there is\nan articulable aesthetic basis for not doing so.\nFOUR: MUSEUM USES\nDESCRIPTION Museums regularly curate and organize temporary or permanent\n(i.e., long-term) exhibitions, which include works from their own, other institutional,\nand private collections. Exhibitions can generate new artistic and scholarly insights\nand attract and enhance the experience of museum visitors. Frequently, exhibitions 12 may enhance or confirm the reputations of the artists whose work is included.\n|\nMuseums also routinely prepare print and graphic materials associated with CODE\nexhibitions, including wall panels that display text and reproductions of related\nOF\nimages; make available brochures and educational guides; publish catalogues; and BEST\noffer related lectures and other public programs. Many museums also offer various PRACTICES\nkinds of guides (including publicly accessible databases) that reproduce images for\nmany or all of the works in their permanent collections. Increasingly, they are\ndoing all these things using digital and other new technologies. For example,\nvisitors may access electronic information about exhibitions and collections with\ntheir own or a museum-supplied portable device, which may be networked.\nTeachers and students may access exhibition- and collection-related educational or\ncurricular materials (text, mixed media, and video) on the museum’s website and\nsocial media channels, or through third parties, including for-profit and nonprofit\npublishers. Physical exhibitions may be complemented by virtual counterparts or\nonline enhancements so that remote visitors can virtually “walk through” the\ngalleries, appreciate the curatorial narrative, and, if desired, focus their attention\non particular works. Similarly, online documentation of collections (including\ncollection catalogues and databases of images and metadata) can help to place\nindividual artworks in a larger institutional or cultural context and provides some\nof the benefits of a physical visit to the museum, as well as providing access to\nmaterial not currently on display. Such documentation also may prepare the\nmembers of the public to interact more fully with art when they visit the museum\nin person.\nPRINCIPLE Museums and their staffs may invoke fair use in using copyrighted\nworks, including images and text as well as time-based and born-digital material,\nin furtherance of their core missions, subject to certain limitations:\nLimitations\nn When copyrighted works are used in connection with physical or virtual\nexhibitions, the use should be justified by the curatorial objective, and the user\nshould be prepared to articulate that justification.\nn The amount of a work used in museum publications, the size and resolution of\npublished reproductions, and the level of fidelity of those reproductions should\nbe appropriate to the analytic or educational purpose.\nn Downloadable images made available online should be suitable in size for\nfull-screen projection or display on a personal computer or mobile device,\nbut generally not larger.\nn When image details and support for “close looking” are offered online through\nlarge or high-resolution images, downloading should not be facilitated unless a\nspecial justification is present.\nn Images provided to the public should be accompanied by attribution of the\noriginal work as is customary in the field, to the extent possible.\nn Images and other documentation of museum collections should be associated\nwith all appropriate and reasonably available metadata. n Images and documentation of museum collections should honor institutional 13\n|\npolicies designed to protect noncopyright interests of third parties, including the CODE\nprivacy of individuals and the cultural sensitivities of communities.\nOF\nBEST\nFIVE: ONLINE ACCESS TO RELATED COLLECTIONS\nPRACTICES\nIN MEMORY INSTITUTIONS\nDESCRIPTION Many institutions, including academic libraries, art schools,\nmuseums, archives, and study centers, maintain collections of art-related\ndocumentation, including the sketches and studies, manuscripts, financial records,\npersonal photographs, and book collections of artists, collectors, dealers, and\nothers. Unless subject to use restrictions, including those imposed by donation\nagreements, these memory institutions typically make such documentation\navailable for study and personal copying by scholars and members of the public.\nMuch of this valuable and often unique study material—some unpublished and\nsome difficult to trace to rights holders—may be under copyright. Online access\nresulting from digitization of these collections greatly expands their utility for\nscholars, students, artists, and the public; it also contributes to the protection of\nthe information they contain against theft, disaster, and decay.\nPRINCIPLE Memory institutions and their staffs may invoke fair use to create\ndigital preservation copies and to enable digital access to copyrighted materials in\ntheir collections and to make those collections available online, with appropriate\nsearch tools, subject to the following limitations:\nLimitations\nn Material made available online should be redacted to protect the privacy and\nother noncopyright interests of third parties, in accordance with prevailing\nprofessional standards.\nn V isitors to the site should be informed that the materials they access are provided\nfor their personal and/or scholarly use, and that they are responsible for\nobtaining any copyright permissions that may be required for their own further\nuses of that material.\nn Institutions should prominently offer such users a point of contact for further\ninformation and correspondence and they should respond promptly to user\ncomplaints, corrections, and questions.\nn When provided, downloadable images provided online should be suitable in size\nand resolution for full-screen projection or display on a personal computer or\nmobile device, but generally not larger.\nn Materials made available should be accompanied by attribution as is customary\nin the field, to the extent possible.\nn I tems should be augmented with all appropriate and reasonably available metadata. 14\n|\nCODE\nOF\nAppendix A: Fair Use Today*\nBEST\nPRACTICES\nSome background information about the fair use doctrine, seen in the context of\ncopyright law and its objectives, may be helpful in thinking about how to use the\nCode. The goal of US copyright law is to promote the progress of knowledge\nand culture. Its best-known feature is protection of owners’ rights. But copying,\nquoting, recontextualizing, and reusing existing cultural material can be critically\nimportant to creating and spreading knowledge and culture.\nThat is why there is a social bargain at the heart of copyright law. That bargain\nis: Our society offers creators some exclusive rights in copyrighted works, to\nencourage them to produce culture. The compensation that creators receive from\nexploiting their copyrights is important as an incentive to this ultimate end;\nit is not an end in itself. Society also limits copyright in important ways, so that\nthe primary intended beneficiary of copyright law—the public—can benefit from\nthose works. Most basically, copyright lasts for a limited time, and then works\nenter the public domain, where they are free for use by all. Other limitations allow\nthe use of works protected by copyright without permission or payment to the\ncopyright owner. Without those uses, creative and scholarly activities would suffer,\nand the public would lose out on important new work that builds on the past.\nAs Section 107 of the Copyright Act of 1976 provides, “ fair use of a copyright\nwork… is not an infringement of copyright.”† Fair use is the most important limit\non copyright monopoly rights. It has been part of US copyright law for more than\n170 years. Where it applies, fair use is a right and not a mere privilege. Because\ncopyright law describes fair use in general terms, the fair use doctrine can adjust to\nevolving circumstances, and the fact that it is asserted procedurally as an affirmative\ndefense should not affect this characterization.\n* Peter Jaszi wrote this section and is solely responsible for it.\n† § 107. Limitations on exclusive rights: Fair use\nNotwithstanding the provisions of sections 106 and 106A, the fair use of a copyrighted work,\nincluding such use by reproduction in copies or phonorecords or by any other means specified\nby that section, for purposes such as criticism, comment, news reporting, teaching (including\nmultiple copies for classroom use), scholarship, or research, is not an infringement of copyright.\nIn determining whether the use made of a work in any particular case is a fair use the factors to\nbe considered shall include—\n1. the purpose and character of the use, including whether such use is of a commercial nature or\nis for nonprofit educational purposes;\n2. the nature of the copyrighted work;\n3. the amount and substantiality of the portion used in relation to the copyrighted work as a\nwhole; and\n4. the effect of the use upon the potential market for or value of the copyrighted work.\nThe fact that a work is unpublished shall not itself bar a finding of fair use if such finding is made\nupon consideration of all the above factors. As a comparison, for example, freedom of expression is a right that is also asserted 15\n|\nas a defense in defamation cases. Rather than following a formula, lawyers and CODE\njudges assess whether a particular use of copyrighted material is “fair” according\nOF\nto an “equitable rule of reason.” This means taking into account all facts and BEST\ncircumstances to decide if an unlicensed use of copyrighted material generates PRACTICES\nsocial or cultural benefits greater than the cost imposed on the copyright owner.\nJudicial decisions on fair use can give practitioners strong positive guidance\nabout how to apply the doctrine. In 1976, Congress inscribed the venerable\njudge-made rule into Section 107, codifying the familiar “four factors.” It also\nincluded a preamble, listing examples of uses that were eligible to be treated\n(as fair use. Notably, some of these (like “criticism, comment, . . . teaching,\nscholarship, [and] research”) are core activities of many visual arts professionals.\nThere then ensued a decade of generally cautious and even conservative court\nopinions, calling into question the real utility of the doctrine for those who make\nand comment on culture.\nSince the early 1990s, however, the case law has taken a dramatic turn. By\n2002, when the US Supreme Court affirmed the strong connection between fair use\nand First Amendment freedom of expression in Eldred v. Ashcroft, 537 U.S. 186\n(2003), the doctrinal landscape already had changed dramatically. In the interven-\ning time, the courts had indicated that a generally critical consideration in evaluat-\ning the fair use factors is whether the use can be considered “transformative”—\nwhether it “adds something new, with a further purpose or different character,” as\nthe Supreme Court put it in Campbell v. Acuff-Rose Music, 510 U.S. 569 (1994).\nSince then, cases have reinforced the notion that for a use to be considered\n“transformative,” it need not—as, in fact, it usually does not—entail a literal\nmodification or revision of the original material. Instead, it is crucial that it has\nput that material in a new context where it performs a new function. Thus, the\nreproduction of an image to illustrate the argument of a scholarly article could\nqualify, just as could the use of copyrighted material in new art.\nWhere a use is transformative, the first statutory factor (looking to “purpose\nand character”) will weigh strongly in favor of fair use even if the new use is\n“commercial” in character. The second factor (which implicates the nature of the\nwork used) tends to favor transformative uses as well. This factor functions to\nprovide certain imaginative works extra protection from unfair exploitation;\nhowever, this concern loses much of its force when they are used for new purposes.\nMoreover, where the third factor is concerned, courts will measure the appropriateness\nof the amount of copyrighted material used against the transformative purpose of\nNote that although the factors are often viewed as representing the four corners of fair use\nanalysis, the list is made explicitly nonexclusive; thus, courts can and (from time to time) do\ntake other considerations into account, including the “public interest,” in allowing the use\nunder consideration to go forward. This may be of particular relevance to educational users\nand those associated with memory institutions, who can marshal strong arguments about the\nsocial utility of their activities. 16 that use; where visual imagery is concerned, use of an entire work often will\n|\nqualify, as in Nunez v. Caribbean Int‘l News Corp., 235 F.3d 18 (1st Cir. 2000). CODE\nAnd crucially, a transformative use is likely to weigh in favor of fair use under\nOF\nthe fourth factor (directed toward the market harm suffered by the copyright BEST\nholder), because (as increasing numbers of courts have recognized) copyright PRACTICES\nowners are not entitled to control the “transformative markets” for their works,\nas exemplified by Bill Graham Archives v. Dorling Kindersley Ltd., 448 F.3d 605\n(2d Cir. 2006), which involved graphic art reproduced to illustrate a historical\nnarrative. The unlicensed use of reference images (so-called “thumbnails”) in\ninternet search engines has been found to be fair on this basis, an example being\nPerfect 10, Inc. v. Amazon.com, Inc., 508 F.3d 1146 (9th Cir. 2007). But, conversely,\nthe transformativeness test also safeguards rights holders from the invasion of\ncommercially significant markets or potential markets that they are entitled to\nexploit. When a use merely substitutes for an authorized use in a copyright owner’s\ncore market, for example, the photographic image of a statue chosen and used for\nits visual appeal on a postage stamp in Gaylord v. United States, 595 F.3d 1364\n(Fed. Cir. 2010), it is less likely to be considered fair.\nWhere a use is deemed nontransformative, the market-harm test of factor\nfour is likely to play a more important role in the analysis. Thus, for example,\na textbook author’s failure to license summaries of various artists’ careers adopted\nfrom a proprietary website could weigh against a fair use finding. Alternatively,\nthe reproduction of an “orphan” work that is not being actively exploited might\nbe deemed fair on the same grounds.\nAs might be expected, these developments in the case law have been questioned\nby some, who have criticized the transformativeness test as too subjective in its\napplication, too harsh (where the interests of copyright owners are concerned) in\neffect, and somehow inconsistent with the fact that copyright owners are granted\nan “exclusive right” to “prepare derivative works” under Section 106(2) of the\nCopyright Act. Only time may tell how well justified some of these objections are.\nBut, as to the last, it is worth noting that all the exclusive rights granted in Section\n106 are qualified. It is not clear why the derivative work right should be any less\nsubject to fair use than, for example, the rights of “reproduction,” “distribution,”\nor “performance.”\nCertainly, controversy remains about how fair use should apply to so-called\nappropriation art, the case law concerning which was discussed at some length\nin the Issues Report that helped frame the issues addressed in this Code. The\nparticular application of the transformativeness test in Cariou v. Prince, 714 F.3d\n694 (2d Cir. 2013), involving new works created by defendant’s overpainting of\nphotographs taken from plaintiff’s book, continues to attract critics as well as\ndefenders. This Code offers a balanced approach to invoking fair use in this area\nof visual arts practice, as in others.\nIn general, there has never been as strong a general judicial consensus about\nthe nature of the fair use doctrine as the one that exists today. In making fair use\ndecisions about issues such as those that confront the visual arts community, judges today generally focus, in effect, on two key analytic questions: 17\n|\nn Did the use “transform” the copyrighted material by using it for a purpose CODE\nsignificantly different from that of the original, or did it do no more than\nOF\nprovide consumers with a “substitute” for the original? BEST\nn Was the material taken appropriate in kind and amount, considering the nature PRACTICES\nof both the copyrighted work and the use?\nThese two questions effectively collapse the four factors. The first question contains\nthe first two factors—the purpose of the use and nature of the work used. Thus,\nfor example, the unpublished nature of a work could weigh against fair use if a\ndeceased artist’s copyrighted private letters were being used for gratuitous and\nsensational effect, but it should have little bearing if the use were for an academic\n(and thus transformative) purpose. The second question rephrases the third factor,\nwhich looks to the quantity and quality of the material used. Both of the key\nquestions touch on the fourth factor, focusing on economic harm the use will cause\nto the owner’s relevant market. This is because courts have made it clear that\nsubstitutional harm is what matters in applying factor four. Thus, if Artist B’s\n“parodies’’ of Artist A’s works actually supplant purchases of Artist A’s works,\nthat might result in such harm, but if Artist A’s work, as a result, loses popularity\nor marketability, that would not.\nIn other words, if the answer to these two questions is clearly in the affirmative,\na court is likely to find a use fair, even if the work is used in its entirety. Where that\nis the case, a rights holder also might conclude that it ought not to challenge the use.\nCourt decisions also show that it can be helpful to the fair use argument for\nthe user to explain the new function, purpose, or context of the use. The case law\nfurther suggests that the more coherent an account the user can give of how and\nwhy it was appropriate to employ the copyrighted work, the easier it is for judges\nto understand if and whether and why the use would be considered transformative.\nThe flexibility of fair use can lead users to wish for clearer rules or brighter\nlines. But the flexibility of fair use is its strength. Courts have emphasized that fair\nuse analysis is fact- and situation-specific. In most cases, however, it is also quite\npredictable. Moreover, it can be made more so. Even without case law specifically\naddressing a use, judges and lawyers consider expectations and practice—whether\nthe user acted reasonably and in good faith in light of standards of accepted\npractice in a particular field. One way of creating better understanding of what fair\nuse permits is, therefore, to document the considered attitudes and best practices of\na professional community.\nFinally, it is worth noting that legal experts disagree on how much a user’s\nshow of good faith adds to a claim of fair use—although, of course, it cannot hurt.\nNevertheless, the members of the visual arts community who met to devise the\nconsensus reflected in the Code believed in its importance. Thus, the Code reflects\nsome widely and strongly held community values not tied to language of the\nCopyright Act, in particular the importance of attribution, and of safeguarding\nnoncopyright interests such as privacy and cultural sensitivities (including those\nof indigenous communities). 18\n|\nCODE\nOF\nAppendix B: How The Code Was Created\nBEST\nPRACTICES\nIn five cities—New York, Washington, DC, Dallas, Chicago, and Los Angeles—\ntwo groups, each of ten to fourteen visual arts professionals, met with facilitators\nAufderheide and Jaszi for four-hour, closed, deliberative discussions. Each group\nbrought together practitioners from across the spectrum of the visual arts, including\nartists, scholars, museum professionals, editors, and others. They were asked to\nspeak as individuals rather than as representatives of particular organizations.\nTo encourage open discussion, participants’ anonymity and the confidentiality of\ntheir individual views were guaranteed.\nIn each session, participants considered issues drawn from the situations\ndescribed in the Issues Report. Participants discussed their reasons for using\nthird-party materials in such situations and, in light of their missions, they\nexplored the limits of those rationales. Each group considered areas of consensus\nidentified in previous groups’ discussions as well as points that had not been\nclarified fully in those earlier discussions.\nThe facilitators summarized, in a draft code, the areas of consensus identified\nin the discussion groups. The other principal investigators, the project advisors,\nCAA’s Task Force on Fair Use, its Committee on Intellectual Property, and its\nProfessional Practices Committee reviewed and provided comments on that draft.\nAfter a further revision by the facilitators, the draft Code was presented to a Legal\nAdvisory Committee of five experts in copyright law and fair use. That committee\nwas charged with ensuring that the Code’s articulation of principles and limitations\nfell within the bounds of reason and was generally consonant with fair use doctrine.\nThe Code was then revised in light of the committee’s comments. With the exception\nof Appendix A, no part of this document represents the individual views of any\ncontributor. The final version of this document, including the Code, was presented\nto the Board of Directors of the College Art Association, which approved it on\nJanuary 12, 2015. 19\n|\nCODE\nOF\nCredits*\nBEST\nPRACTICES\nLead Principal Investigators\nPatricia Aufderheide, Professor, School of Communication, and Director, Center for Media &\nSocial Impact, School of Communication, American University\nPeter Jaszi, Professor, Washington College of Law, Program on Information Justice and\nIntellectual Property, American University\nPrincipal Investigators\nJeffrey P. Cunard, Partner, Debevoise & Plimpton LLP, and Counsel, College Art Association\nAnne Collins Goodyear, Co-Director, Bowdoin College Museum of Art, and Past President,\nCollege Art Association\nLinda Downs, Executive Director and CEO, College Art Association\nTask Force on Fair Use\nCOCHAIRS\nJeffrey P. Cunard, Partner, Debevoise & Plimpton LLP, and Counsel, College Art Association\nGretchen Wagner, former General Counsel, ARTstor, and member, Committee on Intellectual\nProperty, College Art Association\nMEMBERS\nSuzanne Preston Blier, Allen Whitehill Clowes Professor of Fine Arts and of African and African\nAmerican Studies, Harvard University, and Vice President for Publications,\nCollege Art Association\nLinda Downs, Executive Director and CEO, College Art Association\nDeWitt Godfrey, Associate Professor of Sculpture, Department of Art and Art History,\nColgate University, and President, College Art Association\nAnne Collins Goodyear, Co-Director, Bowdoin College Museum of Art, and Past President,\nCollege Art Association\nRandall C. Griffin, Professor, Department of Art History, Southern Methodist University, and\nformer Vice President for Publications, College Art Association\nJoe Hannan, Editorial Director, College Art Association\nBetty Leigh Hutcheson, Director of Publications, College Art Association\nPaul Jaskot, Andrew W. Mellon Professor, 2014–16, Center for Advanced Study in the\nVisual Arts; Professor of the History of Art and Architecture, College of Liberal Arts and\nSocial Sciences, DePaul University; and former President, College Art Association\nPatricia McDonnell, Executive Director, Wichita Art Museum, and former Secretary,\nCollege Art Association\nChristine Sundt, Editor, Visual Resources: An International Journal of Documentation\nCharles A. Wright, Professor of Sculpture and Chair, Department of Art, Western Illinois\nUniversity, and Vice President for Committees, College Art Association\nProject Advisors\nPaul Catanese, Professor and Chair, Interdisciplinary Arts, Columbia College, and former Chair,\nNew Media Caucus, College Art Association\nChristine Sundt, Editor, Visual Resources: An International Journal of Documentation\nProject Manager\nJanet Landay, College Art Association 20 CAA Committee on Intellectual Property\n|\nCHAIRS CODE\nJudith Metro, Editor in Chief, National Gallery of Art\nOF\nMEMBERS\nBEST\nSusan Bielstein, Executive Editor, University of Chicago Press\nPRACTICES\nSuzanne Preston Blier (ex officio, as CAA board liaison), Allen Whitehill Clowes Professor of\nFine Arts and of African and African American Studies, Harvard University, and Vice President for\nPublications, College Art Association\nNathan Budoff, Associate Professor of Art, University of Puerto Rico\nKenneth Cavalier, Faculty of Law, University of British Columbia\nJeffrey P. Cunard (ex officio, as CAA board liaison), Partner, Debevoise & Plimpton LLP, and\nCounsel, College Art Association\nMary DelMonico, DelMonico Books/Prestel\nJoe Hannan (ex officio, as staff liaison), Editorial Director, College Art Association\nBetty Leigh Hutcheson (ex officio, as staff liaison), Director of Publications, College Art Association\nElaine Koss, freelance editor, New York\nAnne Norcross, Assistant Professor of Art History and Coordinator, Visual Resource Collection,\nKendall College of Art and Design, Ferris State University\nDoralynn Pines (ex officio, as CAA board liaison), Metropolitan Museum of Art, New York (retired),\nand Secretary, College Art Association\nCynthia Underwood, Patent Examiner, US Patent and Trademark Office\nGretchen Wagner, former General Counsel, ARTstor\nCharles A. Wright (ex officio, as CAA Vice President for Committees), Professor of Sculpture and\nChair, Department of Art, Western Illinois University\nCAA Professional Practices Committee\nCHAIRS\nJim Hopfensperger, Professor of Art, College of Fine Arts, Western Michigan University\nMEMBERS\nTom Berding, Association Professor, Art History and Design, Michigan State University\nPaul Catanese, Professor and Chair, Interdisciplinary Arts, Columbia College, and former Chair,\nNew Media Caucus, College Art Association\nElliot Bostwick Davis, John Cabot Chair, Arts of the Americas, Museum of Fine Arts, Boston\nHelen C. Evans, Mary and Michael Jaharis Curator for Byzantine Art, Metropolitan Museum of Art\nMichael Grillo, Chair, Department of Art, University of Maine\nDennis Ichiyama, Professor, Art + Design, School of Visual and Performing Arts, Purdue University\nBruce M. Mackh, Mellon Research Project Director, Arts Engine, University of Michigan\nVirginia Maksymowicz, Associate Professor of Sculpture at Franklin & Marshall College\nDenise Mullen (ex officio, as CAA board liaison), President, Oregon College of Art and Craft\nLinda Downs (ex officio, as staff liaison), Executive Director and CEO, College Art Association\nCharles A. Wright (ex officio, as CAA Vice President for Committees), Professor of Sculpture and\nChair, Department of Art, Western Illinois University\nLegal Advisory Committee\nRichard Dannay, Counsel, Cowan, Liebowitz & Latman, P.C.\nCristina del Valle, Senior Associate Counsel, Metropolitan Museum of Art, New York\nLauryn Guttenplan, Associate General Counsel, Smithsonian Institution\nSteven J. McDonald, General Counsel, Rhode Island School of Design\nMatthew Sag, Professor of Law, Loyola University Chicago School of Law\n*Institutional affiliations are provided for purposes of identification only.  21\n|\nCODE\nOF\nBEST\nPRACTICES\nPlease feel free to reproduce this work in its\nentirety. For excerpts, please employ fair use.\nNote to Readers: This Code of Best Practices is\navailable online at the College Art Association\nwebsite: www.collegeart.org/fair-use.\nIn conjunction with the publication, CAA’s\nwebsite also includes Frequently Asked\nQuestions and other materials that facilitate the\nuse of the Code. The Code and related materials\nare also available online on the websites of\nAmerican University’s Center for Media and\nSocial Impact (www.cmsimpact.org/fair-use)\nand the Washington College of Law’s Program\non Information Justice and Intellectual Property\n(www.wcl.american.edu/pijip/go/fair-use).\nFunded by the Andrew W. Mellon Foundation.\nAdditional support provided by the Samuel H.\nKress Foundation. www.cmsimpact.org/fair-use www.wcl.american.edu/pijip/go/fair-use www.collegeart.org/fair-use"
}