{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nPutting It Together\nDuring earlier eras, the de\u0000nition of art was aligned with craftsmanship and guilds, but as societies changed, so, too, did the meaning and\npurpose of art. Over time, art evolved beyond practical and religious functions and became an autonomous expression of the artist’s creative\nprocess and of the surrounding culture.\nAesthetics is concerned with how we perceptually engage in the changing and complex concepts of beauty and the sublime (Ocvirk, 6).\nExploring the de\u0000nition of art is an act of critical thinking. Critical thinking is creative thinking, and the critical-thinking process often requires a\nbelief in the question, rather than an expectation of hard truths or answers. Through active questioning, exploration, and trial and error, we\nuncover multiple valid perspectives.\nConsider the example of the nkisi \u0000gures introduced at the beginning of this module. Recall how that misunderstanding of visual culture was\nrepresentative of the larger confrontation and oppression of African societies by Europeans. Consider also, in the \u0000nal example of video games,\nhow the introduction of new media keeps alive the ongoing debate about what art is.\nWorks Cited\nOcvirk, Stinson, Wigg, Bone, Cayton. Art Fundamentals, Theory and Practice, 12 Edition. New York: McGraw Hill, 2013. Print.\nSayre, Henry. A World of Art, Sixth edition. Boston: Prentice Hall, 2010. Print.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}