{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nPurposes of Art\nArt has had a great number of di\u0000erent functions throughout its history, making its purpose di\u0000cult to quantify to any single concept. This does\nnot imply that the purpose of art is \"vague\" but that it has had many unique, di\u0000erent reasons for being created. Some of the functions of art are\nprovided in the outline below. This is a partial list of purposes as developed by Claude Lévi-Strauss.\n1. Expression of the imagination. Art provides a means to express the imagination (things, places, ideas that are unreal or unknowable)\nin nongrammatic ways. Unlike words, which come in sequences,each of which has a de\u0000nite meaning, art provides a range of forms,\nsymbols and ideas with meanings that can be determined by the artist. An artist can create visual imagery of mythical animals,\nreligious concepts such as heaven or hell, \u0000ctional places, or other things from their creative mind.\n2. Ritualistic and symbolic functions. In many cultures, art is used in religion, spiritual or magical rituals, performances and dances as a\ndecoration or symbol of a god or other divine quality. While these often have no speci\u0000c utilitarian purpose, anthropologists know\nthat they often serve a purpose at the level of meaning within a particular culture. This meaning is not furnished by any one\nindividual, but is often the result of many generations of change and understanding, and of a cosmological relationship within the\nculture.\n3. Communication. Art, at its simplest, is a form of communication. Most forms of communication have an intent or goal directed\ntoward other people. Illustrative arts, such as scienti\u0000c illustration, are a form of art as communication. Maps are another example.\nHowever, the content need not be scienti\u0000c. Stories, emotions, and feelings are also communicated through art.\n4. Entertainment. Art may seek to bring about a particular emotion or mood, for the purpose of relaxing or entertaining the viewer. This\nis often the function of the art industries such as Motion Pictures and Video Games. And of course, more traditional art, such as\nsome paintings and sculptures are simply meant to be enjoyable.\n5. Political change. One of the de\u0000ning functions of early twentieth-century art has been to use visual images to bring about political\nchange. Art movements that had this goal—Dadaism, Surrealism, and Futurism, among others—are collectively referred to as the\navant-garde arts. This purpose of art continues today in many objects aimed at exposing corruption of the ruling class, including\ngovernment, the wealthy, and corporations.\n6. Social causes. Art can be used to raise awareness for a large variety of causes. A number of art activities are aimed at raising\nawareness of AIDS, autism, cancer, human tra\u0000cking, and a variety of other topics, such as ocean conservation, human rights in\nDarfur, murdered and missing Aboriginal women, elder abuse, marriage equality, and pollution. Trashion, using trash to make fashion,\nis one example of using art to raise awareness about pollution.\n7. Psychological and healing purposes. Art is also used by art therapists, psychotherapists and clinical psychologists as art therapy.\nThe Diagnostic Drawing Series, for example, is used to determine the personality and emotional functioning of a patient. The end\nproduct (the art object) is not the principal goal in this case, but rather a process of healing, through creative acts, is sought. The\nresultant piece of artwork may also o\u0000er insight into the troubles experienced by the subject and may suggest suitable approaches\nto be used in more conventional forms of psychiatric therapy.\n8. Propaganda or commercialism. Art is often utilized as a form of propaganda, and thus can be used to subtly in\u0000uence popular\nconceptions or mood (especially regarding political issues). In a similar way, art that tries to sell a product also in\u0000uences mood and\nemotion. In both cases, the purpose of art here is to subtly manipulate the viewer into a particular emotional or psychological\nresponse toward a particular idea or object.\nThese are just one writer's categorization of purposes for art; there are many other ways to try to organize the diverse and complex ideas of art\ninto arti\u0000cial categories. In addition, the functions of art described above are not mutually exclusive, as many of them may overlap. For example,\nart for the purpose of entertainment may also be commercial or seek to sell a product (i.e. a movie or video game).\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}