{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 2: Elements of Art and Principles of Design\nDesign Principles\nIn this reading you will learn to identify and distinguish how the principles of design are used to visually organize an artwork.\nVisual art manifests itself through media, ideas, themes and sheer creative imagination. Yet all of these rely on basic structural principles that,\nlike the elements we’ve been studying, combine to give voice to artistic expression. Incorporating the principles into your artistic vocabulary not\nonly allows you to objectively describe artworks you may not understand, but contributes in the search for their meaning.\nThe \u0000rst way to think about a principle is that it is something that can be repeatedly and dependably done with elements to produce some sort\nof visual e\u0000ect in a composition.\nThe principles are based on sensory responses to visual input: elements APPEAR to have visual weight, movement, etc. The principles help\ngovern what might occur when particular elements are arranged in a particular way. Using a chemistry analogy, the principles are the ways the\nelements “stick together” to make a “chemical” (in our case, an image).\nAnother way to think about these design principles is that they express a value judgment about a composition. For example, when we say a\npainting has \"unity\" we are making a value judgment. We might also say that too much unity without variety is boring and too much variation\nwithout unity is chaotic.\nIn any work of art there is a thought process for the arrangement and use of the elements of design. The artist who works with the principles of\ngood composition will create a more interesting piece; it will be arranged to show a pleasing rhythm and movement. The center of interest will\nbe strong and the viewer will not look away, instead, they will be drawn into the work. A good knowledge of composition is essential in\nproducing good artwork. Some artists today like to bend or ignore these rules and by doing so are experimenting with di\u0000erent forms of\nexpression.\nBalance\nAll works of art possess some form of visual balance – a sense of weighted clarity created in a composition. The artist arranges balance to set\nthe dynamics of a composition. A really good example is in the work of Piet Mondrian, whose revolutionary paintings of the early\ntwentieth century used non-objective balance instead of realistic subject matter to generate the visual power in his work. In the examples below\nyou can see that where the white rectangle is placed makes a big di\u0000erence in how the entire picture plane is activated.\nImage by Christopher Gildow. Used with\npermission.\nWhich of these are visually static and which seem to have a sense of dynamism or implied movement?\nGenerally, when analyzing for visual balance, imagine a vertical line through the center of the image and compare the two halves. There are three\nbasic forms of visual balance:\nSymmetrical\nAsymmetrical\nRadial\nExamples of Visual Balance. Left: Symmetrical.\nMiddle: Asymmetrical. Right: Radial. Image by\nChristopher Gildow. Used with permission.\nSymmetrical balance is the most visually stable, and characterized by an exact—or nearly exact—compositional design on either (or both) sides\nof the horizontal or vertical axis of the picture plane. Symmetrical compositions are usually dominated by a central anchoring element. There are\nmany examples of symmetry in the natural world that re\u0000ect an aesthetic dimension. The Moon Jelly\u0000sh \u0000ts this description; ghostly lit against a\nblack background, but absolute symmetry in its design.\nMoon Jelly\u0000sh, (detail). Digital image\nby Luc Viator, licensed by Creative\nCommons\nBut symmetry’s inherent stability can sometimes make an image look static. View the Tibetan scroll painting below to see how the implied\nmovement of the central \u0000gure Vajrakilaya lessens the severe symmetry. The visual busyness of the shapes and patterns surrounding the \u0000gure\nare balanced by their compositional symmetry, and the wall of \u0000ame behind Vajrakilaya tilts to the right as the \u0000gure itself tilts to the left. Tibetan\nscroll paintings use the symmetry of the \u0000gure to symbolize their power, stability, timelessness, and spiritual presence.\nVajrakilaya. Image by Yurei Fukuro, license CC BY 2.0\nSpiritual paintings from other cultures employ this same balance for similar reasons. Sano di Pietro’s ‘Madonna of Humility’, painted around 1440,\nis centrally positioned, holding the Christ child and forming a triangular design, her head the apex and her \u0000owing gown making a broad base at\nthe bottom of the picture. Their halos are visually reinforced with the heads of the angels and the arc of the frame. You might say that this one\nand the Tibetan scroll painting are mostly symmetrical, but notice how much more symmetrical the second Madonna and child image is with the\nright and left halves of the painting almost identical. This is achieved by the Christ child being placed in the middle of Mary's lap and her two\nhands raised in unison.\nSano di Peitro, Madonna of Humility, c.1440,\ntempera and tooled gold and silver on\npanel. Brooklyn Museum, New York. Image\nis in the public domain.\nRussian icon.\nThe use of symmetry is evident in three-dimensional art, too. A famous example is the Gateway Arch in St. Louis, Missouri (below).\nCommemorating the westward expansion of the United States, its stainless steel frame rises over 600 feet into the air before gently curving\nback to the ground. Another example is Richard Serra’s Tilted Spheres (also below). The four massive slabs of steel show a concentric\nsymmetry and take on an organic dimension as they curve around each other, appearing to almost hover above the ground.\nEero Saarinen, Gateway Arch, 1963-65, stainless\nsteel, 630’ high. St. Louis, Missouri. Image\nLicensed through Creative Commons\nRichard Serra, Tilted Spheres, 2002 – 04, Cor-ten\nsteel, 14’ x 39’ x 22’. Pearson International Airport,\nToronto, Canada. Image Licensed through Creative\nCommons\nAsymmetry uses compositional elements that are o\u0000set from each other, creating a visually unstable balance. Asymmetrical visual balance is\nthe most dynamic because it creates a more complex design construction. A graphic poster from the 1930s shows how o\u0000set positioning and\nstrong contrasts can increase the visual e\u0000ect of the entire composition.\nPoster from the Library\nof Congress\narchives. Image is in the\npublic domain\nClaude Monet’s Still Life with Apples and Grapes from 1880 (below) uses asymmetry in its design to enliven an otherwise mundane arrangement.\nFirst, he sets the whole composition on the diagonal, cutting o\u0000 the lower left corner with a dark triangle. The arrangement of fruit appears\nhaphazard, but Monet purposely sets most of it on the top half of the canvas to achieve a lighter visual weight. He balances the darker basket of\nfruit with the white of the tablecloth, even placing a few smaller apples at the lower right to complete the composition.\nMonet and other Impressionist painters were in\u0000uenced by Japanese woodcut prints, whose \u0000at spatial areas and graphic color appealed to the\nartist’s sense of design.\nClaude Monet, Still Life with Apples and Grapes, 1880, oil on\ncanvas. The Art Institute of Chicago. Licensed under\nCreative Commons\nOne of the best-known Japanese print artists is Ando Hiroshige. You can see the design strength of asymmetry in his woodcut Shinagawa on\nthe Tokaido (below), one of a series of works that explores the landscape around the Takaido road. You can view many of his works through the\nhyperlink above.\nHiroshige, Shinagawa on the Tokaido, ukiyo-e print, after 1832. Licensed\nunder Creative Commons\nIn Henry Moore’s Reclining Figure the organic form of the abstracted \u0000gure, strong lighting and precarious balance obtained through asymmetry\nmake the sculpture a powerful example in three-dimensions.\nHenry Moore, Reclining Figure, 1951. Painted\nbronze. Fitzwilliam Museum, Cambridge. Photo by Andrew\nDunn and licensed under Creative Commons\nRadial balance suggests movement from the center of a composition towards the outer edge—or vise versa. Many times radial balance is\nanother form of symmetry, o\u0000ering stability and a point of focus at the center of the composition. Buddhist mandala paintings o\u0000er this kind of\nbalance almost exclusively. Similar to the scroll painting we viewed previously, the image radiates outward from a central spirit \u0000gure. In the\nexample below there are six of these \u0000gures forming a star shape in the middle. Here we have absolute symmetry in the composition, yet a\nfeeling of movement is generated by the concentric circles within a rectangular format.\nTibetan Mandala of the Six Chakravartins, c. 1429-46. Central Tibet\n(Ngor Monestary). Image is in the public domain\nRaphael’s painting of Galatea, a sea nymph in Greek mythology, incorporates radial design. Notice how most of the \u0000gures, whether in the sky or\nocean, encircle the central \u0000gure of Galatea.\nRaphael, Galatea, fresco, 1512. Villa Farnesina,\nRome. Work is in the public domain\nRepetition\nRepetition is the use of two or more like elements or forms within a composition. The systematic arrangement of a repeated shapes or forms\ncreates pattern.\nPatterns create rhythm, the lyric or syncopated visual e\u0000ect that helps carry the viewer, and the artist’s idea, throughout the work. A simple but\nstunning visual pattern, created in this photograph of an orchard by Jim Wilson for the New York Times, combines color, shape and direction into\na rhythmic \u0000ow from left to right. Setting the composition on a diagonal increases the feeling of movement and drama.\nThe traditional art of Australian aboriginal culture uses repetition and pattern almost exclusively both as decoration and to give symbolic\nmeaning to images. The coolamon, or carrying vessel pictured below, is made of tree bark and painted with stylized patterns of colored dots\nindicating paths, landscapes or animals. You can see how fairly simple patterns create rhythmic undulations across the surface of the work. The\ndesign on this particular piece indicates it was probably made for ceremonial use.\nAustralian aboriginal softwood coolamon with acrylic paint design. Licensed\nunder Creative Commons\nRhythmic cadences take complex visual form when subordinated by others. Elements of line and shape coalesce into a formal matrix that\nsupports the leaping salmon in Alfredo Arreguin’s ‘Malila Diptych’. Abstract arches and spirals of water reverberate in the scales, eyes and gills of\nthe \u0000sh. Arreguin creates two rhythmic beats here, that of the water \u0000owing downstream to the left and the \u0000sh gracefully jumping against it on\ntheir way upstream.\nAlfredo Arreguin, Malila Diptych, 2003 (detail). Washington State Arts\nCommission. Digital Image by Christopher Gildow. Licensed under\nCreative Commons.\nThe textile medium is well suited to incorporate pattern into art. The warp and weft of the yarns create natural patterns that are manipulated\nthrough position, color and size by the weaver. The Tlingit culture of coastal British Columbia produce spectacular ceremonial blankets\ndistinguished by graphic patterns and rhythms in stylized animal forms separated by a hierarchy of geometric shapes. The symmetry and high\ncontrast of the design is stunning in its e\u0000ect.\nScale and Proportion\nScale shows the relative size of one object in relation to another; a person compared to a dog, for example or one person compared to another\nperson. Proportion indicates the relative size of parts to the whole; a person’s head compared to the rest of their body, for example. Scale\nrelationships are often used to create illusions of depth on a two-dimensional surface, the larger form being closer to the viewer than the smaller\none. The scale of an object can provide a focal point or emphasis in an image.\nScale and proportion are incremental in nature. Works of art don’t always rely on big di\u0000erences in scale to make a strong visual impact. A good\nexample of this is Michelangelo’s sculptural masterpiece Pieta from 1499 (below). Here Mary cradles her dead son, the two \u0000gures forming a\nstable triangular composition. Michelangelo sculpts Mary to a larger scale than the dead Christ to give the central \u0000gure more signi\u0000cance, both\nvisually and psychologically. If they were both depicted the same size, Mary would appear awkward trying to cradle a full-size adult \u0000gure in her\nlap. At \u0000rst we don’t notice how much larger Mary is because of Michelangelo’s masterful sculpting ability.\nMichelangelo’s Pieta, 1499, marble. St. Peter’s Basilica,\nRome. Licensed under GNU Free Documentation\nLicense and Creative Commons\nWhen scale and proportion are greatly increased the results can be impressive, giving a work commanding space or fantastic implications. Rene\nMagritte’s painting Personal Values constructs a room with objects whose proportions are so out of whack that it becomes an ironic play on how\nwe view everyday items in our lives.\nAmerican sculptor Claes Oldenburg and his wife Coosje van Bruggen create works of common objects at enormous scales. Their Stake\nHitch reaches a total height of more than 53 feet and links two \u0000oors of the Dallas Museum of Art. As big as it is, the work retains a comic and\nplayful character, in part because of its gigantic size.\nEmphasis\nEmphasis—the area of primary visual importance—can be attained in a number of ways. We’ve just seen how it can be a function of di\u0000erences\nin scale. Emphasis can also be obtained by isolating an area or speci\u0000c subject matter through its location or color, value and texture. Main\nemphasis in a composition is usually supported by areas of lesser importance, a hierarchy within an artwork that’s activated and sustained at\ndi\u0000erent levels.\nLike other artistic principles, emphasis can be expanded to include the main idea contained in a work of art. Let’s look at the following work to\nexplore this.\nWe can clearly determine the \u0000gure in the white shirt as the main emphasis in Francisco de Goya’s painting The Third of May, 1808 below. Even\nthough his location is left of center, a candle lantern in front of him acts as a spotlight, and his dramatic stance reinforces his relative isolation\nfrom the rest of the crowd. Moreover, the soldiers with their aimed ri\u0000es create an implied line between them selves and the \u0000gure. There is a\nrhythm created by all the \u0000gures’ heads—roughly all at the same level throughout the painting—that is continued in the soldiers’ legs and\nscabbards to the lower right. Goya counters the horizontal emphasis by including the distant church and its vertical towers in the background.\nIn terms of the idea, Goya’s narrative painting gives witness to the summary execution of Spanish resistance \u0000ghters by Napoleon’s armies on\nthe night of May 3, 1808. He poses the \u0000gure in the white shirt to imply a cruci\u0000xion as he faces his own death, and his compatriots surrounding\nhim either clutch their faces in disbelief or stand stoically with him, looking their executioners in the eyes. While the carnage takes place in front\nof us, the church stands dark and silent in the distance. The genius of Goya is his ability to direct the narrative content by the emphasis he\nplaces in his composition.\nFrancisco de Goya y Lucientes, The Third of May, 1808, 1814. Oil on canvas.\nThe Prado Museum, Madrid. This image is in the public domain\nA second example showing emphasis is seen in Landscape with Pheasants, a silk tapestry from nineteenth-century China. Here the main focus\nis obtained in a couple of di\u0000erent ways. First, the pair of birds are woven in colored silk, setting them apart visually from the gray landscape they\ninhabit. Secondly, their placement at the top of the outcrop of land allows them to stand out against the light background, their tail feathers\nmimicked by the nearby leaves. The convoluted treatment of the rocky outcrop keeps it in competition with the pheasants as a focal point, but in\nthe end the pair of birds’ color wins out.\nTime and Motion\nOne of the problems artists face in creating static (singular, \u0000xed images) is how to imbue them with a sense of time and motion. A traditional\nsolutions to this problem may include showing the same \u0000gure (or other form) repeated in di\u0000erent places within the same image to give the\ne\u0000ect of movement and the passage of time.\nAn early example of this is in the carved sculpture of Kuya Shonin. The Buddhist monk leans forward, his cloak seeming to move with the breeze\nof his steps. The \u0000gure is remarkably realistic in style, his head lifted slightly and his mouth open. Six small \u0000gures emerge from his mouth, visual\nsymbols of the chant he utters repeatedly.\nth\nVisual experiments in movement were \u0000rst produced in the middle of the 19 century. Photographer Eadweard Muybridge snapped black and\nwhite sequences of \u0000gures and animals walking, running and jumping, then placing them side-by-side to examine the mechanics and rhythms\ncreated by each action.\nEadweard Muybridge, sequences of himself throwing a disc,\nusing a step and walking. Licensed through Creative\nCommons\nIn the modern era, the rise of Cubism and subsequent related styles in modern painting and sculpture had a major e\u0000ect on how static works of\nart depict time and movement. These new developments in form came about, in part, through the cubist’s initial exploration of how to depict an\nobject and the space around it by representing it from multiple viewpoints, incorporating all of them into a single image.\nMarcel Duchamp’s painting Nude Descending a Staircase from 1912 formally concentrates Muybridge’s idea into a single image. The \u0000gure is\nabstract, a result of Duchamp’s in\u0000uence by cubism, but gives the viewer a de\u0000nite feeling of movement from left to right. This work was\nexhibited at The Armory Show in New York City in 1913. The show was the \u0000rst to exhibit modern art from the United States and Europe at an\nAmerican venue on such a large scale. Controversial and fantastic, the Armory show became a symbol for the emerging modern art movement.\nDuchamp’s painting is representative of the new ideas brought forth in the exhibition.\nIn three dimensions the e\u0000ect of movement is achieved by imbuing the subject matter with a dynamic pose or gesture (recall that the use of\ndiagonals in a composition helps create a sense of movement). Gian Lorenzo Bernini’s sculpture of David from 1623 is a study of coiled visual\ntension and movement. The artist shows us the \u0000gure of David with furrowed brow, even biting his lip in concentration as he eyes Goliath and\nprepares to release the rock from his sling.\nTime is concerned with the passage of some amount of time, NOT the time of day, season, year, etc. The temporal arts of \u0000lm, video and digital\nprojection by their de\u0000nition show implied movement and the passage of time. In all of these mediums we watch as a narrative unfolds before\nour eyes. Film is essentially thousands of static images divided onto one long roll of \u0000lm that is passed through a lens at a certain speed. From\nthis apparatus comes the term movies.\nVideo uses magnetic tape to achieve the same e\u0000ect, and digital media streams millions of electronically pixilated images across the screen. An\nexample is seen in the work of Swedish Artist Pipilotti Rist. Her large-scale digital work Pour Your Body Out is \u0000uid, colorful and absolutely\nabsorbing as it unfolds across the walls.\nIn a painting or sculpture, the passage of time is often indicated where there is implied movement, but not always. In the photograph above,\nsome amount of time must have passed as we see the \u0000gure in di\u0000erent positions. However, in Bernini's David, we see a sense of implied\nmovement but not the passage of any time.\nUnity and Variety\nUltimately, a work of art is the strongest when it expresses an overall unity in composition and form, a visual sense that all the parts \u0000t together;\nthat the whole is greater than its parts. This same sense of unity is projected to encompass the idea and meaning of the work too. This visual\nand conceptual unity is sublimated by the variety of elements and principles used to create it. We can think of this in terms of a musical\norchestra and its conductor: directing many di\u0000erent instruments, sounds and feelings into a single comprehendible symphony of sound. This is\nwhere the objective functions of line, color, pattern, scale and all the other artistic elements and principles yield to a more subjective view of the\nentire work, and from that an appreciation of the aesthetics and meaning it resonates.\nWe can view Eva Isaksen’s work Orange Light below to see how unity and variety work together.\nEva Isaksen, Orange Light, 2010. Print and collage on canvas. 40” x 60.”\nPermission of the artist\nIsaksen makes use of nearly every element and principle including shallow space, a range of values, colors and textures, asymmetrical balance\nand di\u0000erent areas of emphasis. The unity of her composition stays strong by keeping the various parts in check against each other and the\nspace they inhabit. In the end the viewer is caught up in a mysterious world of organic forms that \u0000oat across the surface like seeds being\ncaught by a summer breeze.\nYou should consider unity and variety in all artworks. Think about things like lines, colors, textures, shapes, even subject-matter such as the\nkinds of \u0000gures and animals, trees and buildings and other kinds of recognizable objects: are they similar, di\u0000erent?\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}