{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nDe\u0000ning Art from the Medieval Period to Today\nIntroduction\nAlmost every culture has given (and continues to give) some thought to their visual objects-- what we may call \"art.\" To begin your readings, we\nwill explore some ideas of art from the Western tradition from the Middle Ages to today. This introductory chapter is longer than most of the\nother readings, and you should begin to see how di\u0000cult it is to understand this thing we call \"art.\" I have highlighted some key terms for you.\nPart 1: Medieval to Renaissance\nWe begin by considering the production and consumption of art from the Crusades through to the period of the Catholic Reformation. The focus\nis on art in medieval and Renaissance Christendom, but this does not imply that Europe was insular during this period. The period witnessed the\nslow erosion of the crusader states in the Holy Land, \u0000nally relinquished in 1291, and of the Greek Byzantine world until Constantinople fell to the\nOttomans in 1453. Columbus made his voyage to the Americas in 1492. Medieval Christendom was well aware of its neighbors. Trade, diplomacy,\nand conquest connected Christendom to the wider world, which in turn had an impact on art.\nAny notion of the humble medieval artist oblivious to anything beyond his own immediate environment must be dispelled. Artists and patrons\nwere well aware of artistic developments in other countries. Artists traveled both within and between countries and on occasion even between\ncontinents. Such mobility was facilitated by the network of European courts, which were instrumental in the rapid spread of Italian Renaissance\nart. Europe-wide frameworks of philosophical and theological thought, reaching back to antiquity and governing religious art, applied – albeit\nwith regional variations – throughout Europe.\nArt, Visual Culture, and Skill\nThe term ‘visual culture’ is used here in preference to ‘art’ for the fundamental reason that the arts before 1600 were wide-ranging, including\nmedia today that we might deem within the realm of craft and not \u0000ne art. The Latin word ‘ars’ signi\u0000ed skilled work; it did not mean art as we\nmight understand it today, but a craft activity demanding a high level of technical ability, including tapestry weaving, goldsmith’s work, and\nembroidery. Literary statements of what constituted the arts during the medieval period are rare, particularly in northern Europe, but proliferate\nin the Renaissance. Giorgio Vasari (1511–74), the biographer of Italian artists, claimed in his famous book Le vite de’ più eccelenti pittori, scultori e\narchitettori (Lives of the Painters, Sculptors and Architects; \u0000rst edition 1550 and revised 1568) that the architect Filippo Brunelleschi (1377–\n1446) was initially apprenticed to a goldsmith ‘to the end that he might learn design’ (Vasari, 1996 [1568], vol. 1, p. 326). According to Vasari,\nseveral other Italian Renaissance artists are supposed to have trained initially as goldsmiths, including the sculptors Ghiberti (1378–1455) and\nVerrocchio (1435–88), and the painters Botticelli (c.1445–1510) and Ghirlandaio (1448/49–94). The design skills necessary for goldsmiths’ work\nwere evidently a good foundation for future artistic success.\nMedieval and Renaissance Visual Culture\nThe term ‘visual culture’ is also used for a second reason that is less to do with de\u0000nition than with method. Including the various arts under the\numbrella of ‘visual culture’ implies their inseparability from the visual rhetoric of power on the one hand, and the material culture of a society on\nthe other. Before 1500 art was primarily part of the persuasive power and cultural identity of the church, ruler, city, institution, or the wealthy\npatron commissioning the artwork. In this sense, art might be considered alongside ceremonies, for example, as strategies conveying social\nmeaning or magni\u0000cence, or as a demonstration of wealth and power by the patron commissioning the artwork to be made.\nIn later centuries art evolves into purely an aesthetic entity, prompting scrutiny for its own sake alone. The intent of the varied forms of art\nproduced during the medieval and Renaissance period lie outside this de\u0000nition. Objects were made that invited attentive scrutiny for their\ningenuity in design, while at the same time ful\u0000lling a variety of functions. No one in medieval times would have bothered to commission works of\nart unless they could assume that their contemporaries would understand and perhaps be in\u0000uenced by their communicative power. For\nexample, the wealthy lavished money on rich artifacts or dynastic portraits in part because these objects were a way of communicating their\nexclusiveness and social power to their contemporaries.\nArtistic Quality\nThe fact that a work of art had a function did not mean that artistic quality was a matter of indi\u0000erence. Some artists’ guilds required candidates\nto submit a ‘masterpiece’ for examination by the guild in order to win the status of master. Those scrutinizing the masterpieces must have had a\nclear idea of the criteria of quality they were hoping for, even if these criteria were never set down in writing. The careful selection of artists even\nfrom far-\u0000ung locations, and the preference for one practitioner above another, shows that patrons too were quite capable of discriminating on\nthe basis of artistic prowess. A work of art during the medieval and Renaissance period was expected to be of high quality as well as purposeful.\nArtists and Patrons\nFamously, in 1516, the renowned Renaissance artist Leonardo da Vinci (1452–1519) was invited to the French court of Francis I (ruled 1515–47),\nperhaps not so much for the work that he might produce at what was then an advanced age, as out of admiration and presumably for the\nprestige that the presence of such a renowned \u0000gure might endow on the French court. The advancement of artistic status is often associated\nwith princely employment. Patron is the term for the person or entity who commissions or hires the artist to create artwork. Given the example\nof Leonardo da Vinci, this appears to make sense. Maintained on a salary, a court artist was no longer a jobbing craftsman constantly on the\nlookout for work. Potentially, at least, he had access to projects demanding inventiveness and conferring honor, and time to lavish on his art and\non study. Equally, however, court artists might be required to undertake mundane and routine work which they could not very well refuse. Court\nsalaries were also often in arrears or not paid at all. In the same letter in which Leone Leoni described Charles V chatting with him for two to\nthree hours at a time, he complains of his poverty, while carefully qualifying the complaint by claiming he serves the emperor for honor and cares\nfor studying not moneymaking. The lot of the court artist might appear to ful\u0000ll aspirations for artistic status, but it certainly had its drawbacks.\nPatterns of Artistic Employment: Workshop, Guild, and Court Employment\nThe pattern of artistic employment in the medieval period and the Renaissance varied. Traditionally, craftsmen working on great churches would\nbe employed in workshops on site, albeit often for some length of time; during the course of their career, such craftsmen might move several\ntimes from one project to another. Many other artists moved around in search of new opportunities of employment, even to the extent of\naccompanying a crusade. Artists working for European courts might travel extensively as well, not just within a country but from country to\ncountry and court to court: El Greco (1541–1614) moved between three di\u0000erent countries before \u0000nding employment not at the royal court in\nSpain but in the city of Toledo.\nA \u0000xed artist’s workshop depended not only on local institutional and individual patronage, but often also on the willingness of clients from\nfurther a\u0000eld to come to the artist rather than the artist traveling to work for clients.\nA guild served three main functions: promoting the social welfare of its members, maintaining the quality of its products and protecting its\nmembers from competition. This usually meant de\u0000ning quite carefully the materials and tools that a guild member was allowed to use to prevent\nactivities that infringed the privileges of other guilds and for which they had not been trained, for example a carpenter producing wood\nsculpture.\nIt is the protection from competition that art historians have seen as eliminating artistic freedom, but it is worth pausing to wonder whether this\nview owes more to modern free-market economics than to the realities of \u0000fteenth-century craft practices. In practice, it meant that domestic\ncraftsmen enjoyed preferential membership rates, but in many artistic centers foreign craftsmen were clearly also welcomed so long as their\nwork re\u0000ected favorably on the reputation of the guild.\nAs the debate about artistic status grew, the real disadvantage of the guild system for artists was not so much lack of freedom or pro\u0000tability or\neven status so much as the connotations of manual craft attached to the guild system of apprenticeship as opposed to the ‘liberal’ training\no\u0000ered by the art academies.\nPart 2: Academy to Avant-Garde\nWe now consider the key developments in the de\u0000nition of art between c.1600 and c.1850.\nFrom Function to Autonomy\nThe most important idea for this purpose is the concept of art itself, which came to be de\u0000ned in the way that we still broadly understand it\ntoday during the course of the centuries explored here.\nThis concept rests on a distinction between art, on the one hand, and craft, on the other. It assumes that a work of art is to be appreciated and\nvalued for its own sake, whereas other types of artifacts serve a functional purpose. A signi\u0000cant step in this direction was made by a group of\npainters and sculptors who in 1563 set up an Accademia del Disegno (Academy of Design) in Florence in order to distinguish themselves from\ncraftsmen organized in guilds. Their central claim was that the arts they practiced were ‘liberal’ or intellectual rather than ‘mechanical’ or\npractical. After 1600, academies of art were founded in cities throughout Europe, including Paris (1648) and London (1768). Most o\u0000ered training\nin architecture as well as in painting and sculpture. A decisive shift took place in the mid eighteenth century, when the three ‘arts of design’\nbegan to be classi\u0000ed along with poetry and music in a new category of ‘\u0000ne arts’ (a translation of the French term, ‘beaux-arts’). Other arts,\nsuch as landscape gardening, were sometimes included in this category. Architecture was occasionally excluded on the grounds that it was\nuseful as well as beautiful, but the \u0000ne arts were usually de\u0000ned in terms broad enough to encompass it. One writer, for example, described\nthem as ‘the o\u0000spring of genius; they have nature for model, taste for master, pleasure for aim’ (Jacques Lacombe, Dictionnaire Portatif des\nBeaux-Arts, 1753 (1st edn 1752), p. 40, as translated in Shiner, 2001, p. 88).\nFrom the Sacred to the Courtly\nTo chart what these conceptual shifts meant in practice, we can borrow the categories elaborated by the cultural theorist Peter Bürger (1984,\npp. 47–8), who outlines a long-term shift away from the functions that art traditionally served. Such functions continued to play an important role\nafter 1600, especially in the seventeenth century, when academies were rare outside Italy and many artists still belonged to guilds. As in the\nmedieval period, the primary function was religious (or ‘sacred’). The so-called Counter Reformation gave a great boost to Roman Catholic\npatronage of the arts, as the church sought to renew itself in the aftermath of the Protestant Reformation. It was in this context that the word\n‘propaganda’ originated; it can be traced back to 1622 when Pope Gregory XV (reigned 1621–23) founded the Congregazio de Propaganda Fide\n(Congregation for the Propagation of Faith) in Rome. The commitment to spreading the faith that this organization embodied helped to shape art\nnot just in Europe but in every part of the world reached by the Catholic Missions, notably Asia and the Americas, throughout the period\nexplored here. The churches that rejected the authority of Rome also played a role in supporting ‘sacred art’, primarily architecture since their\nuse of other art forms was limited by Protestant strictures against ‘Popish’ idolatry (see for example Levy, 2004; Bailey, 1999; Haynes, 2006).\nEven in Catholic countries, however, the religious uses of art slowly declined relative to secular ones. The seventeenth century is the last in\nwestern art history in which a major canonical \u0000gure like the Italian painter Michelangelo Merisi da Caravaggio (1571–1610) might still be a\nprimarily religious artist.\nMichelangelo Merisi da Caravaggio, The Death of the Virgin, 1601–03, oil on\ncanvas, 369 × 245 cm. Musée du Louvre, Paris. Photo: Web Gallery of Art, CC BY-\nSA. Work is in the public domain.\nBürger’s Functions of Art: the Courtly\nBy 1600, it was ‘courtly art’ (Bürger’s second category) that increasingly prevailed in much of Europe. ‘Courtly art’ can be de\u0000ned as consisting\nprimarily of art actually produced at a royal or princely court, but also extending beyond it to include works of art that more generally promote\nthe leisured lifestyle of an aristocratic elite. As in the Renaissance, artists served the needs of rulers by surrounding them with an aura of\nsplendor and glory. In this context, art was integrated into the courtly or aristocratic way of life, as part of a culture of spectacle, which\nfunctioned to distinguish the nobles who frequented the court from other social classes and to legitimate the ruler’s power in the eyes of the\nworld (see for example, Elias, 1983; Adamson, 1999; Blanning, 2002). The consolidation of power in the hands of a fairly small number of\nEuropean monarchs meant that their need for ideological justi\u0000cation was all the greater and so too were the resources they had at their\ndisposal for the purpose. Exemplary in this respect is the French king Louis XIV (ruled 1643–1715), who harnessed the arts to the service of his\nown autocratic rule in the most conspicuous manner imaginable. From 1661 onwards, he employed the architects Louis Le Vau (1612/13–1670)\nand Jules Hardouin-Mansart (1648–1708), the painter Charles Le Brun (1619–90) and the landscape gardener André Le Nôtre (1613–1700),\namong many others, to create the vast and lavish palace of Versailles, not far from Paris. Every aspect of its design glori\u0000ed the king, not least by\ncelebrating the military exploits that made France the dominant power in Europe during his reign.\nThe Salon de la Guerre (War room), Château de Versailles, designed by Jules\nHardouin-Mansart, showing plaster relief by Antoine Coysevox of Louis XIV\ntrampling over his enemies, 1678–86. Photo: Jebulon. CCO\nBürger’s Functions of Art: Bourgeois Art\nBy 1800, however, the predominant category was what Bürger calls ‘bourgeois art’. His use of this term re\u0000ects his reliance on a broadly Marxist\nconceptual framework, which views artistic developments as being driven ultimately by social and economic change (Bürger, 1984, p. 47;\nHemingway and Vaughan, 1998). Such art is bourgeois in so far as it owed its existence to the growing importance of trade and industry in\nEurope since the late medieval period, which gave rise to an increasingly large and in\u0000uential wealthy middle class. Exemplary in this respect is\nseventeenth-century Dutch painting, the distinctive features and sheer profusion of which were both made possible by a large population of\nrelatively a\u0000uent city-dwellers. In other countries, the commercialization of society and the urban development that went with it tended to take\nplace more slowly. Britain, however, rapidly caught up with the Netherlands; by 1680, London was being transformed into a modern city\ncharacterized by novel uses of space as well as by new building types. Here too, artists produced images that were a\u0000ordable and appealing to\na middle-class audience; notable in this respect was William Hogarth (1697–1764), who began his career working in the comparatively cheap\nmedium of engraving. Even his famous set of paintings Marriage A-la-Mode, which satirizes the manners and morals of fashionable society, was\nprimarily intended as a model for prints to be made after them. Hogarth’s work, like that of many other artists of the period, embodies a sense of\ndidactic purpose, in accordance with the prevailing view that art should aim both to ‘instruct and delight’.\nWilliam Hogarth, Marriage A-la-Mode: 2, The Tête à Tête, circa 1743. Work is in the public domain.\nWhat fundamentally distinguishes ‘bourgeois art’ from previous categories, however, is its lack of any actual function. Its de\u0000ning feature,\naccording to Bürger, is its autonomy, which he de\u0000nes as ‘art’s independence from society’ (Bürger, 1984, p. 35). As we have seen, a conception\nof ‘\u0000ne art’ as a category apart from everyday needs was formalized in the mid eighteenth century. What this meant in practice is best\ndemonstrated by the case of easel painting, which had become the dominant pictorial form by 1600. Unlike an altarpiece or a fresco, this kind of\npicture has no \u0000xed place; instead, its frame serves to separate it from its surroundings, allowing it to be hung in almost any setting. Its value lies\nnot in any use as such, but in the ease with which it can be bought and sold (or what Marxists call its ‘exchange value’). In taking the form of a\ncommodity, easel-painting accords with the commercial priorities of bourgeois society, even though what appears within the frame may be far\nremoved from these priorities. Art’s previous functions did not simply vanish, however, not least because the nobility and its values retained\nconsiderable power and prestige.\nUltimately more important than such residual courtly functions, however, is the distinctly paradoxical way that art in bourgeois society at once\npreserves and transforms art’s sacral functions. Autonomous art does not promote Christian beliefs and practices, as religious art traditionally\ndid, but rather is treated by art lovers as itself the source of a special kind of experience, a rare\u0000ed or even spiritual pleasure. This type of\npleasure is now called ‘aesthetic’, a word that was coined in 1735, by Alexander Baumgarten, though it was only towards the end of the\neighteenth century that writers began to talk about their experience of art in such high-\u0000own quasi-religious terms (for examples, see Shiner,\n2001, pp. 135–6). What this boils down to is that art increasingly functioned during this period as a cult in its own right, sometimes referred to as\nthe artwork’s aura, one in which the artist of genius replaces God the creator as the source of meaning and value. This exalted conception of art\nconsolidated the separation between the artist and the craftsman, which had motivated the foundation of the Florentine Academy some two\ncenturies earlier.\nPatronage\nIn exploring artistic developments from the years c. 1600 to c. 1850, the \u0000rst structure or institution to consider is that of patronage. As in the\nRenaissance, many artists worked for patrons, who commissioned them to execute works of art in accordance with their requirements.\nPatronage played an important role throughout the period, most obviously in the case of large-scale projects for a speci\u0000c location that could\nnot be undertaken without a commission. Exemplary in this respect is the work that the sculptor (and architect) Gian Lorenzo Bernini (1598–\n1680) carried out at St Peter’s Basilica in Rome for a succession of popes from the 1620s onwards. Landscape gardening is another case in\npoint. Artists also executed on commission for a patron works that, though not actually immoveable, involved too much risk to be executed ‘on\nspec’, in the hope that someone would come along and buy them after they were completed, either because they were large and expensive or\nbecause they did not make for easy viewing. Both considerations applied in the case of David’s The Oath of the Horatii, a huge picture of a tragic\nsubject painted in an uncompromising style, which was commissioned by the French state. An artist greatly in demand such as the sculptor\nAntonio Canova (1757–1822) would also tend to work on commission; in his case, the grandest patrons from across Europe sometimes waited\nfor years to receive a statue by the master, even though he maintained (as both Bernini and Rubens also did) a large workshop to assist him in\nhis labors.\nFinally, portraiture was a genre that, with rare exceptions, such as the portrait of Omai by Sir Joshua Reynolds (1723–92), required a patron to\ncommission an artist to make a likeness.\nFrom Patronage to the Open Market\nNevertheless, the period after 1600 saw a shift away from patronage towards the open market. This shift accompanied the gradual decline of\n‘sacral’ and ‘courtly’ art, both of which were normally executed on commission. Consider the case of Caravaggio’s Death of the Virgin, an\naltarpiece commissioned for the church of Santa Maria della Scala in Rome in 1601. In the event, the resolutely human terms in which the painter\ndepicted the subject and the unidealised treatment of the \u0000gures scandalized the monks responsible for the church. The painting was therefore\nput up for sale, exciting intense interest among artists, dealers and collectors; it was snapped up (at a high price) by the Duke of Mantua, on the\nadvice of Rubens, who was then employed as the duke’s court painter (Langdon, 1998, pp. 246–51, 317–18). Thus a functional religious artifact\nwas transformed into a secular artwork, acclaimed as a masterpiece by a famous artist and sold to a princely collector, for whom the possession\nof such a work was a matter of personal prestige. The comparable transformation of courtly art in response to the market can be illustrated by\nreference to another picture immediately displaced from the location for which it was painted. In 1721, the Flemish-born artist Antoine Watteau\n(1684–1721) painted a large canvas as a shop sign for his friend, the Parisian art dealer Edme Gersaint. It shows the kind of elegant \u0000gures that\nthe artist typically painted, but here, rather than engaging in aristocratic leisure and dalliance in a park-like setting, they are scrutinizing items for\nsale in an art dealer’s shop; a portrait of Louis XIV is being packed away into a case, as if to mark the passing of the era of grand courtly art.\nRapidly sold to a wealthy (though not aristocratic) collector, Gersaint’s Shop Sign exempli\u0000es the way that Watteau repackaged courtly ideals\nfor the market to reach a wider audience. The painting also shows how art collecting became a re\u0000ned pastime for the social elite, in which art\ndealers played a crucial role (McClellan, 1996).\nAntoine Watteau, Gersaint’s Shop Sign, 1720–21, oil on canvas, 151 × 306 cm. Schloss Charlottenburg, Berlin. Work is in the public domain.\nAs these two examples demonstrate, more market-oriented structures and practices emerged in countries such as Italy and France from the\nend of the Renaissance onwards (see Haskell, 1980; Pomian, 1990; Posner, 1993; North and Ormrod, 1998). However, the tendency towards\ncommercialization is even more striking elsewhere: for example, in the growth of large-scale speculative building in late seventeenth-century\nLondon. As already noted, the emergence of ‘bourgeois art’ (as distinct from architecture) is best exempli\u0000ed by the Netherlands, where most\nartists produced small easel paintings for sale. This model of artistic practice went hand in hand with the rise of art dealers and other features of\nthe modern art world, such as public auctions and sale catalogues (see Montias, 1982; North, 1997; Montias, 2002). In important respects, the\nDutch case remains idiosyncratic, but nevertheless the genres of painting that dominated in this context – that is, portraiture, landscape, scenes\nof everyday life and still life – soon became the most popular and successful elsewhere in Europe too. It was not just subject matter that\ncounted, however; increasing emphasis was also placed on the distinctive brushwork of the individual artist and on the skills of connoisseurship\nthat both dealers and collectors needed in order to recognize and appreciate the ‘hand’ of each ‘master’ and, of course, to distinguish genuine\nworks from misattributed ones and outright forgeries. Exemplary in this respect is the work of Rembrandt; it was thanks above all to his\nexceptionally broad and hence highly distinctive handling of paint that he came to be generally regarded as the greatest of all post-Renaissance\nartists by the mid nineteenth century. As a result of these developments, painting increasingly tended to overshadow other art forms, especially\ntapestry, which lost its previous high status with the decline of courtly art.\nThe Public Sphere\nThe emergence of a recognizably modern art world between 1600 and 1850 formed part of the development of the ‘public sphere’, as it has\nbeen de\u0000ned by the philosopher Jürgen Habermas. Habermas argues that the late seventeenth century onwards saw a shift away from\n‘representational culture’, which embodied and displayed the power of the ruler and nobility, as courtly art traditionally did. It was replaced by a\nnew urban culture, the ‘bourgeois public sphere’, which was brought into existence by private individuals, that is, middle-class people like\nmerchants and lawyers, who came together to exchange news and ideas, giving rise to new cultural institutions, such as newspapers, clubs,\nlending libraries and public theatres (Habermas, 1989 [1962]; Blanning, 2002). A pioneering role in this respect was played by London as a\nconsequence of the limited power of the monarch, which meant that the court dominated culture much less than it did in France at the same\ntime. Public interest in art grew rapidly during the eighteenth century, aided by an expanding print culture, which allowed the circulation of high-\nart images to an ever larger audience (see Pears, 1988; Clayton, 1997). In both London and Paris, large audiences also attended the exhibitions\nthat began to be held during the middle decades of the century. The \u0000rst public museums were established around the same time. Most were\nroyal and princely collections opened up to the public, whether as a benevolent gesture on the ruler’s part or, in the case of the Louvre, by the\nFrench Revolutionary government in 1793 (McClellan, 1994; Sheehan, 2000; Prior, 2002). However, it was a charitable bequest from an art\ndealer that led to the creation of the \u0000rst public art museum in Britain; housed in a building designed for the purpose by the architect Sir John\nSoane (1753–1837), Dulwich College Picture Gallery opened to the public in 1817.\nThe Art Museum and the Painting of Current Events\nWith the establishment of the art museum, the autonomy of art gained its de\u0000ning institution. In a museum, a work of art could be viewed purely\nfor its own sake, without reference to its traditional functions. Nevertheless, as indicated above, art’s autonomy was far from complete. From\naround 1800 onwards, for example, the public sphere also opened up the possibility that artists might try to bridge the gap dividing art from\nsociety by independently producing works that engaged with current events, as the French painter Théodore Géricault (1791–1824) did in his\nvast picture, The Raft of the Medusa. This and comparable works by other French artists, notably Liberty Leading the People by Eugène\nDelacroix (1798–1863), which was painted just after the July Revolution of 1830, are often seen as having inaugurated a new tradition of\npolitically committed modern or ‘avant-garde’ art, which came to the fore towards the end of the nineteenth century. However, it was during this\nperiod that the French military term ‘avant garde’ (meaning a section of an army that goes ahead of the rest) came to be applied to works of art.\nIt was \u0000rst used in this sense in a text published in 1825 under the name of the Utopian Socialist Henri de Saint-Simon, who argued that artists\ncould help to transform society by spreading ‘new ideas among men’ (Harrison et al., 1998, p. 40). Although he does not seem to have had any\nspeci\u0000c type of art in mind, his emphasis on its role as a means of communication makes it plausible to apply the term to works such as The Raft\nof the Medusa and Liberty Leading the People, which convey a political message on a large scale and to striking e\u0000ect.\nEugène Delacroix, Liberty Leading the People, 1830, oil on canvas, 260 × 325 cm. Musée du Louvre,\nParis. Work is in the public domain.\nFor present purposes, however, what is important about these two paintings is the way that they depended on the institutions of the public\nsphere. Rather than being commissioned by a patron, each was intended \u0000rst and foremost for display at the o\u0000cial art exhibition in Paris known\nas the Salon. Both, moreover, were bought by the state for the Luxembourg museum, which was founded in 1818 to house modern French art\n(though, in Géricault’s case, not until several years later). Indeed Delacroix may have painted his picture in the hope or even the expectation that\nthis would happen, since two of the artist’s works had already entered the museum. It should also be noted that such ambitious and challenging\nworks were very much the exception, even in France and much more so in other countries where the state did not support living artists in the\nsame way. Most of them earned a living by catering to the demands of the market, typically by specializing in a particular genre, such as\nportraiture. In this respect, the \u0000rst half of the nineteenth century is continuous with the previous two centuries, during which high-status works\nby celebrated artists also constituted only a small part of the broad \u0000eld of visual culture. Rather than tracing a single narrative of art’s\ndevelopment from the establishment of the academies to the beginnings of the avant-garde, it is important to be aware of its diversity and\ncomplexity throughout western Europe during this period.\nPart 3: Modernity to Globalization\nThis section addresses art and architecture from around 1850 up to the present.\nDuring this period, art changed beyond recognition. The various academies still held sway in Europe. It is true that the hierarchy of the genres\nwas breaking down and the classical ideal was becoming less convincing.\nWhat counted as art in much of the nineteenth century remained pretty stable. Whether in sculpture, painting, drawing or printmaking, artworks\nrepresented recognizable subjects in a credible human-centered space. To be sure, subjects became less high-\u0000own, compositional e\u0000ects\noften deliberately jarring and surface handling more explicit. There were plenty of academicians and commentators who believed these changes\namounted to the end of civilization, but from today’s perspective they seem like small shifts of emphasis.\nIn contrast, art in the \u0000rst part of the twentieth century underwent rapid change. Art historians agree that during this time artists began to\nradically revise picture making and sculpture. With the invention of photography and it being employed as the dominant conveyor of realism,\npainting undergoes a period of experimentation. Painters \u0000attened out pictorial space, broke with conventional viewpoints and discarded local\ncolor. (‘Local color’ is the term used for the color things appear in the world. From the early twentieth century, painters began to experiment with\nnon-local color.) Sculptors began to leave the surface of their works in a rough, seemingly un\u0000nished state; they increasingly created partial\n\u0000gures and abandoned plinths or, alternatively, in\u0000ated the scale of their bases. Architects abandoned revivalist styles and rich ornamentation.\nTo take one often cited example from painting, while the art of Paul Cézanne (1839–1906) is based on a recognizable motif, say a landscape,\nwhen looking at these paintings we get the distinct impression that the overall organization of the colors and structural elements matters as\nmuch or more than the scene depicted. To retain \u0000delity to his sense impressions, Cézanne is compelled to \u0000nd a new order and coherence\ninternal to the canvas. Frequently this turns into incoherence as he tries to manage the tension between putting marks on a \u0000at surface and his\nexternal observation of space.\nIn \u0000fteen years some artists would take this problem – the recognition that making art involved attention to its own formal conditions that are not\nreducible to representing external things – through Cubism to a fully abstract art. Conventionally, this story is told as a heroic progression of\n‘movements’ and ‘styles’, each giving way to the next in the sequence: Post-Impressionism, Fauvism, Cubism, Futurism, Dada, Constructivism,\nSurrealism… Each changing of the guard is perceived as an advance and almost a necessary next step on the road to some preset goal. This\nrapid turnover of small groups and personal idioms can seem bewildering and, in fact, this is a minimal version of this story. Whether they sought\nnew expressive resources, novel ways of conveying experience or innovative techniques for representing the modern world, modern artists\nturned their backs on the tried and tested forms of mimetic resemblance. But what counted as art changed too. Bits of the everyday world\nbegan to be incorporated into artworks – as collage or montage in two-dimensional art forms; in construction and assemblage in three-\ndimensional ones. The inclusion of found materials played a fundamental role in modern art. The use of modern materials and technologies –\nsteel, concrete, photography – did something similar. Some artists abandoned easel painting or sculpture to make direct interventions in the\nworld through the production of usable things, whether chairs or illustrated news magazines. Not all artists elected to work with these new\ntechniques and materials, and many carried on in the traditional ways or attempted to adapt them to new circumstances.\nModern Art: Autonomy and Responding to the Modern World\nBroadly speaking, there are two di\u0000erent ways of thinking about modern art, or two di\u0000erent versions of the story. One way is to view art as\nsomething that can be practiced (and thought of) as an activity radically separate from everyday life or worldly concerns. From this point of view,\nart is said to be ‘autonomous’ from society – that is, it is believed to be self-sustaining and self-referring. One particularly in\u0000uential version of\nthis story suggests that modern art should be viewed as a process by which features extraneous to a particular branch of art would be\nprogressively eliminated, and painters or sculptors would come to concentrate on problems speci\u0000c to their domain. Another way of thinking\nabout modern art is to view it as responding to the modern world, and to see modern artists immersing themselves in the con\u0000icts and\nchallenges of society. That is to say, some modern artists sought ways of conveying the changing experiences generated in Europe by the twin\nprocesses of commercialization (the commodi\u0000cation of everyday life) and urbanization. From this point of view, modern art is a way of re\u0000ecting\non the transformations that created what we call, in a sort of shorthand, ‘modernity’.\nThe \"autonomy\" argument presumes that art is self-contained and artists are seen to grapple with technical problems of painting and sculpture,\nand the point of reference is to artworks that have gone before. This approach can be described as ‘formalist’ (paying exclusive attention to\nformal matters), or, perhaps more productively drawing on a term employed by the critic Meyer Schapiro (1904–96), as ‘internalist’ (a somewhat\nless pejorative way of saying the same thing) (Schapiro, 1978 [1937]).\nRather than cloaking arti\u0000ce, modern art, such as that made by Wassily Kandinsky (1866–1944) drew attention to the conventions, procedures\nand techniques supposedly ‘inherent’ in a given form of art. Modern art set about ‘creating something valid solely on its own terms’ (Ibid., p. 8).\nFor painting, this meant turning away from illusion and story-telling to concentrate on the features that were fundamental to the practice –\nproducing aesthetic e\u0000ects by placing marks on a \u0000at, bounded surface. For sculpture, it entailed arranging or assembling forms in space.\nWassily Kandinsky, Landscape with Red Spots, 1913. Work is in the public domain.\nThe Emergence of Modern Art in Paris\nLet’s take a step back to the middle of the nineteenth century and consider the emergence of modern art in Paris. The new art that developed\nwith Gustave Courbet (1819–77), Manet and the Impressionists entailed a self-conscious break with the art of the past. These modern artists\ntook seriously the representation of their own time. In place of allegorical \u0000gures in togas or scenes from the Bible, modern artists concerned\nthemselves with the things around them. When asked to include angels in a painting for a church, Courbet is said to have replied ‘I have never\nseen angels. Show me an angel and I will paint one.’ But these artists were not just empirical recording devices. The formal or technical means\nemployed in modern art are jarring and unsettling, and this has to be a fundamental part of the story. A tension between the means and the\ntopics depicted, between surface and subject, is central to what this art was. Nevertheless, we miss something crucial if we do not attend to the\nartists’ choices of subjects. Principally, these artists sought the signs of change and novelty – multiple details and scenarios that made up\ncontemporary life. This meant they paid a great deal of attention to the new visual culture associated with commercialized leisure.\nThe groups of artists producing this art – usually referred to collectively as the ‘avant-garde’ or the ‘historical avant-garde’ – wanted to fuse art\nand life, and often based their practice on a socialist rejection of bourgeois culture. From their position in western Europe, the Dadaists mounted\nan assault on the irrationalism and violence of militarism and the repressive character of capitalist culture; in collages, montages, assemblages\nand performances, they created visual juxtapositions aimed at shocking the middle-class audience and intended to reveal connections hidden\nbehind everyday appearances. The material for this was drawn from mass-circulation magazines, newspapers and other printed ephemera. The\nConstructivists participated in the process of building a new society in the USSR, turning to the creation of utilitarian objects (or, at least,\nprototypes for them). The Surrealists combined ideas from psychoanalysis and Marxism in an attempt to unleash those forces repressed by\nmainstream society; the dream imagery is most familiar, but experiments with found objects and collage were also prominent. These avant-garde\ngroups tried to produce more than re\u0000ned aesthetic experiences for a restricted audience; they pro\u0000ered their skills to help to change the world.\nIn this work the cross-over to visual culture is evident; communication media and design played an important role. Avant-garde artists began to\ndesign book covers, posters, fabrics, clothing, interiors, monuments and other useful things. They also began to merge with journalism by\nproducing photographs and undertaking layout work. In avant-garde circles, architects, photographers and artists mixed and exchanged ideas.\nFor those committed to autonomy of art, this kind of activity constitutes a denial of the shaping conditions of art and betrayal of art for\npropaganda, but the avant-garde were attempting something else – they sought a new social role for art. One way to explore this debate is by\nswitching from painting and sculpture to architecture and design.\nNational, International, Cosmopolitan\nWhether holding itself apart from the visual culture of modernity or immersed in it, modern art developed not in the world’s most powerful\neconomy (Britain), but in the places that were most marked by ‘uneven and combined development’: places where explosive tensions between\ntraditional rural societies and the changes wrought by capitalism were most acute (Trotsky, 1962 [1928/1906]). In these locations, people only\nrecently out of the \u0000elds encountered the shocks and pleasures of grand-metropolitan cities. As the sociologist of modernity Georg Simmel\n(1858–1918) suggested: ‘the city sets up a deep contrast with small-town and rural life with reference to the social foundations of psychic life’. In\ncontrast to the over-stimulation of the senses in the city, Simmel thought that in the rural situation ‘the rhythm of life and sensory mental imagery\n\u0000ows more slowly, more habitually, and more evenly’ (Simmel, 1997 [1903], p. 175). This situation applies \u0000rst of all to Paris (see Clark, 1984;\nHarvey, 2003; Prendergast, 1992). In Paris, the grand boulevards and new palaces of commercial entertainment went hand in hand with the\n‘zone’, a vast shanty town ringing the city that was occupied by workers and those who eked out a precarious life. Whereas the Impressionists\nconcentrated on the bourgeois city of bars, boulevards and boudoirs, the photographer Eugène Atget (1857–1927) represented the Paris that\nwas disappearing – the medieval city with its winding alleys and old iron work – or those working-class quarters composed of cheap lodgings\nand traders recycling worn-out commodities (Nesbit, 1992; see also Benjamin, 1983). This clash of ways of life generated di\u0000erent ways of\ninhabiting and viewing the city with class and gender at their core. Access to the modern city and its representations was more readily available\nto middle-class men than to those with less social authority, whether they were working people, women or minority ethnic or religious groups\n(Wol\u0000, 1985, pp. 37–46; Pollock, 1988, pp. 50–90).\nEugène Atget, Chi\u0000onier (Ragpicker), c. 1899–1901. Work is in the public domain.\nContradictions\nBefore the Second World War, the alternative centers of modernism were also key sites of uneven and combined development: Berlin, Budapest,\nMilan, Moscow and Prague. In these places, large-scale industry was created by traditional elites in order to develop the production capacities\nrequired to compete militarily with Britain. Factory production was plopped down into largely agrarian societies, generating massive shocks to\nsocial equilibrium. In many ways, Moscow is the archetypal version of this pattern of acute contradictions. Before the 1917 Revolution, Moscow\nwas the site of enormous and up-to-date factories, including the world’s largest engineering plant, but was set in a sea of peasant\nbackwardness. This is one reason that Vladimir Lenin described Russia as the weakest link in the international-capitalist chain.\nThis set of contradictions put a particular perception of time at the center of modern art. Opposition to the transformations of society that were\nunderway could be articulated in one of two ways, and in an important sense both were fantasy projections: on the one hand, artists looked to\nsocieties that were seen as more ‘primitive’ as an antidote to the upheavals and shallow glamour of capitalism. On the other hand, they\nattempted a leap into the future. Both perspectives – Primitivism and Futurism – entailed a profound hostility to the world as it had actually\ndeveloped, and both orientations were rooted in the conditions of an uneven and combined world system.\nThe vast urban centers – Paris, Berlin, and Moscow – attracted artists, intellectuals, poets and revolutionaries. The interchange between people\nfrom di\u0000erent nations bred a form of cultural internationalism. In interwar Paris, artists from Spain, Russia, Mexico, Japan and a host of other\nplaces rubbed shoulders. Modernist artists attempted to transcend parochial and local conditions and create a formal ‘language’ valid beyond\ntime and place, and ‘the school of Paris’ or the ‘international modern movement’ signi\u0000ed a commitment to a culture more capacious and vibrant\nthan anything the word ‘national’ could contain. The critic Harold Rosenberg (1906–78) stated this theme explicitly. Rejecting the idea that\n‘national life’ could be a source of inspiration, he suggested that the modernist culture of Paris, was a ‘no-place’ and a ‘no-time’ and only Nazi\ntanks returned the city to France by wiping out modernist internationalism (Rosenberg, 1970 [1940]).\nA Move to New York\n‘Perhaps for the only time in its history, after the Second World War modernism was positioned at the heart of world power – when a host of\nexiles from European fascism and war relocated in New York. American abstract art was centered on New York and a powerful series of\ninstitutions: the Museum of Modern Art, Peggy Guggenheim’s gallery Art of This Century and a host of small independent galleries run by private\ndealers (including Betty Parsons, Samuel Koontz and Sidney Janis). In the main, these artists, such as Jackson Pollock (1912–56), Mark Rothko\n(1903–70), Arshile Gorky (1904–48), Robert Motherwell (1915–91) and Barnett Newman (1905–70), and associated critics (Greenberg and\nRosenberg) were formed during the 1930s in the circles of the New York Left: they were modernist internationalists opposed to US parochialism\nin art and politics. After the war, they retained this commitment to an international modern art, while the politics drained away or was purged in\nthe Cold War. The period of US hegemony in modern art coincided with the optimum interest in autonomous form and pure ‘optical’ experience.\nThis was the time when artists working in the modernist idiom were least interested in articulating epochal changes and most focused on art as\nan act of individual realization and a singular encounter between the viewer and the artwork. At the same time, these artists continued to keep\ntheir distance from mainstream American values and mass culture. Some champions of autonomous art are inclined to think art came to a\nshuddering halt with the end of the New York School. Alternatively, we can see Conceptual Art as initiating or reinvigorating a new phase of\nmodern art that continues in the global art of today.\nIt should be apparent from this brief sketch that the predominant ways of thinking about modern art have focused on a handful of international\ncenters and national schools – even when artists and critics proclaim their allegiance to internationalism. The title of Irving Sandler’s book The\nTriumph of American Painting is one telling symptom (Sandler, 1970). There is a story about geopolitics – about the relationship between the\nwest and the rest – embedded in the history of modern art. These powerful forms of modernism cannot be swept aside, but increasingly critics\nand art historians are paying attention to other stories; to the artworks made in other places and in other ways, and which were sidelined in the\ndominant accounts of art’s development. A focus on art in a globalized art world leads to revising the national stories told about modernism. This\nhistory is currently being recast as a process of global interconnections rather than an exclusively western-centered chronicle, and\ncommentators are becoming more attentive to encounters and interchanges between westerners and people from what has helpfully been\ncalled the ‘majority world’, in art as in other matters. This term – majority world – was used by the Bangladeshi photographer Shahidul Alam, to\ndescribe what the term ‘third world’ had once designated. We use it here to characterize those people and places located outside centers of\nwestern a\u0000uence and power; they constitute the vast majority of the world’s inhabitants and this reminds us that western experience is a\nminority condition and not the norm.\nThe Local and the Global\nThe reality is not that the majority world will be transformed into a high-tech consumer paradise. In fact, inequality is increasing across the world.\nWhat is referred to as globalization is the most recent phase of uneven and combined development. The new clash of hypermodern and\ntraditional forms of economic activity and social life are taking place side by side; megacities spring up alongside the ‘planet of slums’, and\ncommunication technologies play an important role in this clash of space and time. Recent debates on globalization and art involve a rejection of\nmodernist internationalism; instead, artists and art historians are engaged with local conditions of artistic production and the way these mesh in\nan international system of global art making. Modern art is currently being remade and rethought as a series of much more varied responses to\ncontemporaneity around the world. Artists now draw on particular local experiences, and also on forms of representation from popular\ntraditions. Engagement with Japanese popular prints played an important role in Impressionism, but in recent years this sort of cultural crossing\nhas undergone an explosion.\nDrawing local image cultures into the international spaces of modern art has once more shifted the character of art. The paradox is that the\ncultural means that are being employed – video art, installation, large color photographs and so forth – seem genuinely international. Walk into\nmany of the large exhibitions around the globe and you will see artworks referring to particular geopolitical conditions, but employing remarkably\nsimilar conventions and techniques. This cosmopolitanism risks underestimating the real forces shaping the world; connection and mobility for\nsome international artists goes hand in hand with uprootedness and the destruction of habitat and ways of life for others.\nPart 4: Some Contemporary Theories De\u0000ning Art\nMany have argued that it is a mistake to even try to de\u0000ne art or beauty, that they have no essence, and so can have no de\u0000nition.\nCampbell's Tomato Juice Box, 1964, Andy Warhol, Synthetic polymer\npaint and silkscreen ink on wood, 10 inches x 19 inches x 9 1/2 inches\n(25.4 x 48.3 x 24.1 cm), Museum of Modern Art, New York. © 2007 Andy\nWarhol Foundation / Fair Use\nAndy Warhol exhibited wooden sculptures of boxes as art.\nOne contemporary approach is to say that “art” is basically a sociological category that whatever art schools and museums, and artists get\naway with is considered art regardless of formal de\u0000nitions. This institutional theory of art has been championed by George Dickie. Most\npeople did not consider a store-bought urinal or a sculptural depiction of a Campbell's Soup box to be art until Marcel Duchamp and Andy\nWarhol (respectively) placed them in the context of art (e.g., the art gallery), which then provided the association of these objects with the values\nthat de\u0000ne art. Marcel Duchamp, the artist who called a urinal an art object, would likely have agreed, he once famously aid \"art is completed by\nthe viewer.\" In other words, it's not the object itself that is art but how and where we may see it. A urinal in a men's room is part of the plumbing,\na urinal displayed in an art gallery is a \"sculpture.\"\nProceduralists often suggest that it is the process by which a work of art is created or viewed that makes it art, not any inherent feature of an\nobject, or how well received it is by the institutions of the art world after its introduction to society at large. For John Dewey, for instance, if the\nwriter intended a piece to be a poem, it is one whether other poets acknowledge it or not. Whereas if exactly the same set of words was written\nby a journalist, intending them as shorthand notes to help him write a longer article later, these would not be a poem.\nLeo Tolstoy, on the other hand, claims that what makes something art or not is how it is experienced by its audience (audience context), not by\nthe intention of its creator.\nFunctionalists, like Monroe Beardsley argue that whether a piece counts as art depends on what function it plays in a particular context. For\ninstance, the same Greek vase may play a non-artistic function in one context (carrying wine), and an artistic function in another context\n(helping us to appreciate the beauty of the human \u0000gure).\nControversy around Conceptual Art\nThe work of the French artist Marcel Duchamp from the 1910s and 1920s paved the way for the conceptual artists, providing them with\nexamples of prototypically conceptual works (the readymades, for instance) that de\u0000ed previous categorizations of art. Conceptual art, where\nthe idea is as important as the image/object, emerged as a movement during the 1960s. The \u0000rst wave of the “conceptual art” movement\nextended from approximately 1967 to 1978. Early “concept” artists like Henry Flynt, Robert Morris, and Ray Johnson in\u0000uenced the later, widely\naccepted movement of conceptual artists like Dan Graham, Hans Haacke, and Douglas Huebler.\nMore recently, the “Young British Artists” (YBAs), led by Damien Hirst, came to prominence in the 1990s and their work is seen as conceptual,\neven though it relies very heavily on the art object to make its impact. The term is used in relation to them on the basis that the object is not the\nartwork, or is often a found object, which has not needed artistic skill in its production.\nRecent Examples of Conceptual Art\n1991: Charles Saatchi funds Damien Hirst and the next year in the Saatchi Gallery exhibits his The Physical Impossibility of Death in\nthe Mind of Someone Living, a real shark in a tank formaldehyde.\n1999: Tracey Emin is nominated for the Turner Prize. Part of her exhibit is My Bed, her messy bed, surrounded by detritus such as\ncondoms, blood-stained panties, bottles and her bedroom slippers.\n2001: Martin Creed wins the Turner Prize for The Lights Going On and O\u0000, an empty room where the lights go on and o\u0000.\n2005: Simon Starling wins the Turner Prize for Shedboatshed, a wooden shed which he had turned into a boat, \u0000oated down the\nRhine River and turned back into a shed again.\nThe Stuckist group of artists, founded in 1999, proclaimed themselves “pro-contemporary \u0000gurative painting with ideas and anti-conceptual art,\nmainly because of its lack of concepts.” They also called it pretentious, “unremarkable and boring” and on July 25, 2002, in a demonstration,\ndeposited a co\u0000n outside the White Cube gallery, marked “The Death of Conceptual Art”. In 2003, the Stuckism International Gallery exhibited a\npreserved shark under the title A Dead Shark Isn’t Art, clearly referencing the Damien Hirst work\nIn 2002, Ivan Massow, the Chairman of the Institute of Contemporary Arts branded conceptual art “pretentious, self-indulgent, craftless” and in\n“danger of disappearing up its own arse …”. Massow was consequently forced to resign.\nDisputes about New Media\nComputer games date back as far as 1947, although they did not reach much of an audience until the 1970s. It would be di\u0000cult and odd to deny\nthat computer and video games include many kinds of art (bearing in mind, of course, that the concept “art” itself is, as indicated, open to a\nvariety of de\u0000nitions). The graphics of a video game constitute digital art, graphic art, and probably video art; the original soundtrack of a video\ngame clearly constitutes music. However it is a point of debate whether the video game as a whole should be considered a piece of art of some\nkind, perhaps a form of interactive art.\nLicenses and Attributions\nPrevious Next\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}