{
    "text": "Search and extract content from course documents, Upload to Study Expert Help Study Resources Log in Join\nIntroduction to Art Concepts, SAC, ART100\nModule 1: What Is Art?\nWhy It Matters\nDe\u0000ning \"art\"\nIntroduction\nAs a thought experiment, imagine what a society without art would be like? How would buildings look? How would acceptable clothing or style\nof dress be de\u0000ned? Could any kind of visual communication exist at all? It’s a provocative question that quickly necessitates de\u0000ning the\nboundaries of what does and does not constitute art. This mirrors the complexity of engaging in the ongoing de\u0000nition of art.\nArt is studied because “it is among the highest expressions of culture, embodying its ideals and aspirations, challenging its assumptions and\nbeliefs, and creating new visions and possibilities for it to pursue” (Sayre, XVI). When we discuss contemporary art, we are typically referring to\nthe practice of \u0000ne art, but prior to the Renaissance art was de\u0000ned within the realm of functional crafts, such as goldsmithing. The idea of\nautonomous art, or art for art’s sake, developed later, over many eras.\nStudying art leads to a greater understanding of our own cultural values and other cultures. When colonizing forces of Europeans encountered\nAfrican wood sculptural nkisi \u0000gures, primarily in what is now the Democratic Republic of the Congo, they considered them to be evidence of\nidolatry and witchcraft or opposition to the colonizing forces (Sayre 11–12). The \u0000gures were often pierced with nails as a symbolic gesture to\ninitiate a desired goal, like creating a contract or agreement between individuals or groups. The invading Europeans often destroyed the nkisi\n\u0000gures, which were sacred objects to the Congo people.\nVisit this link to see an example of a nkisi sculpture.\nThe material covered in this section will help you understand how we arrived at our contemporary understanding of art and how to begin\nengaging in the ongoing de\u0000nition and discussion of art.\nOK, let's get started!\nWork Cited\nSayre, Henry. A World of Art, Sixth edition. Boston: Prentice Hall, 2010. Print.\nLicenses and Attributions\nNext\nCompany Get Course Hero Study Tools Help Legal Connect with Us\nAbout Us iOS AI Homework Help Contact Us Copyright Policy College Life\nCareers Android Flashcards FAQ Academic Integrity Facebook\nLeadership Chrome Extension Feedback Our Honor Code Twitter\nSitemap Tutors Privacy Policy LinkedIn\nQ&A Archive Terms of Use YouTube\nEducator Events Attributions Instagram\nDo Not Sell or Share My Personal\nInfo\nCopyright © 2023. Course Hero, Inc. Course Hero is not sponsored or endorsed by any college or university."
}